{"url": "www.nydailynews.com/entertainment/gossip/john-travolta-six-year-gay-affair-california-pilot-doug-gotterba-alleges-report-actor-camp-calls-ridiculous-article-1.1147440", "text": "The California pilot who claims he had a high-flying gay affair with actor John Travolta is airing new details about their alleged six-year relationship.\n\nIn a National Enquirer story labeled “ridiculous” by Travolta’s camp, pilot Doug Gotterba said he first met the “Grease” star in February 1981 when he interviewed for a pilot job – and by September they were lovers.\n\n“I know the date (the affair began) because I still have the log book and records,” Gotterba, 62, told the Enquirer.\n\nHe said they flew to Monterey, Calif., together and shared a “fantastic” bottle of merlot wine over dinner at the Highlands resort in Carmel.\n\n“I got the sense I was being courted,” Gotterba said. “As we walked from the restaurant back to the room, John suddenly said, “Hey, would you like a massage?'”\n\nGotterba said he’d expected the invitation, and the massage quickly led to sex.\n\n“John was gentle but very passionate. The next day he told me with a big smile on his face, ‘I really enjoyed last night,'” Gotterba told the Enquirer.\n\nDouglas Gotterba in undated photo\n\nHe said Travolta, 58, took him on more romantic trips to Hawaii, Amsterdam and Kenya.\n\n“Sometimes he’d bring women along as beards, but he would ask me to join him in his suite and we’d spend the nights together. It was our little secret,” Gotterba claimed.\n\nThe pilot said he encouraged Travolta to get a girlfriend as cover, and that’s when the actor started dating Brooke Shields.\n\n“There was no chemistry between them. They’d smile for the cameras and everyone assumed they were a couple,” he said.\n\nThe affair ended in 1986 after growing tensions, Gotterba said.\n\n“He’d show up on my door many times, unannounced, to check up on me,” the pilot told the Enquirer. “He’d disappear into my bedroom and go through my drawers. He always tried to catch me cheating on him.”\n\nHe said Travolta would ignore him for days if he didn’t drop everything to be with him on a moment’s notice.\n\nTheir last meeting was years later in 1992, after Travolta married actress Kelly Preston.\n\n“We were making small talk when suddenly, I blurted out, ‘So, John, tell me. Now that you’re married, do you still prefer men – or women?'” Gotterba said he asked. “Well, Doug, I still prefer men,” Travolta replied, according to Gotterba.\n\nThe Enquirer report follows three months after two anonymous masseurs – John Does 1 and 2 – filed and later dropped federal lawsuits claiming Travolta groped them during massages.\n\nThe first Doe withdrew his legal claim after Travolta proved he was in New York on the day of the alleged Beverly Hills attack.\n\nTravolta’s camp immediately dismissed the Enquirer’s interview with Gotterba.\n\n“This ridiculous so-called ‘new’ story is a retread of a story published a few weeks ago by the same desperate supermarket tabloid – the same tabloid that impossibly claimed that John Travolta had an encounter with ‘Doe #1’ in Beverly Hills when he was actually on the east coast working on a movie,” Travolta’s rep said in a statement Wednesday.\n\nndillon@nydailynews.com", "images": ["https://secure.gravatar.com/avatar/?s=85&d=mm&r=g", "https://www.nydailynews.com/wp-content/uploads/migration/2014/07/23/CZEER67GNSE73MSTZZIRW3FQ74.jpg?w=1024&h=670", "data:image/webp;base64,UklGRiQAAABXRUJQVlA4IBgAAAAwAQCdASoBAAEAAwA0JaQAA3AA/v3AgAA=", "https://www.nydailynews.com/wp-content/uploads/2023/08/New_York_Daily_News_nydredblack-1.svg"], "top_img": "https://www.nydailynews.com/wp-content/uploads/migration/2014/07/23/CZEER67GNSE73MSTZZIRW3FQ74.jpg?w=1024&h=670", "keywords": [], "authors": ["Nancy Dillon"], "canonical_link": "https://www.nydailynews.com/2014/07/23/john-travolta-had-six-year-gay-affair-with-me-california-pilot-doug-gotterba-alleges-in-report-that-actors-camp-calls-ridiculous/", "title": "John Travolta had six-year gay affair with me, California pilot Doug Gotterba alleges in report that actor’s camp calls ‘ridiculous’", "meta_data": {"application-name": "newyorkdailynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "robots": "max-image-preview:large", "tdm-reservation": 1, "mrf": {"authors": "Nancy Dillon", "canonical": "https://www.nydailynews.com/2014/07/23/john-travolta-had-six-year-gay-affair-with-me-california-pilot-doug-gotterba-alleges-in-report-that-actors-camp-calls-ridiculous/"}, "description": "The California pilot who claims he had a high-flying gay affair with actor John Travolta is airing new details about their alleged six-year relationship. In a National Enquirer story labeled “ridiculous” by Travolta’s camp, pilot Doug Gotterba said he fir", "generator": "WordPress 6.8.3", "og": {"type": "article", "title": "John Travolta had six-year gay affair with me, California pilot Doug Gotterba alleges in report that actor’s camp calls ‘ridiculous’", "url": "https://www.nydailynews.com/2014/07/23/john-travolta-had-six-year-gay-affair-with-me-california-pilot-doug-gotterba-alleges-in-report-that-actors-camp-calls-ridiculous/", "description": "The California pilot who claims he had a high-flying gay affair with actor John Travolta is airing new details about their alleged six-year relationship. In a National Enquirer story labeled &#8220…", "site_name": "New York Daily News", "image": {"identifier": "https://www.nydailynews.com/wp-content/uploads/migration/2014/07/23/CZEER67GNSE73MSTZZIRW3FQ74.jpg?w=1024&h=670", "width": 1024, "height": 670}, "locale": "en_US"}, "article": {"published_time": "2014-07-23T13:25:07+00:00", "modified_time": "2019-01-10T14:18:26+00:00"}, "twitter": {"text": {"title": "John Travolta had six-year gay affair with me, California pilot Doug Gotterba alleges in report that actor’s camp calls ‘ridiculous’"}, "image": "https://www.nydailynews.com/wp-content/uploads/migration/2014/07/23/CZEER67GNSE73MSTZZIRW3FQ74.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.nydailynews.com/wp-content/uploads/2023/09/cropped-DailyNewsCamera-7.webp?w=270"}, "movies": [], "publish_date": 1406121907.0, "source": "http://www.nydailynews.com", "summary": ""}