{"url": "https://en.wikipedia.org/wiki/BTS_(band)", "text": "South Korean boy band\n\nBTS (Korean: 방탄소년단; RR: Bangtan Sonyeondan; lit. Bulletproof Boy Scouts), also known as the Bangtan Boys, is a South Korean boy band formed in 2010. The band consists of Jin, Suga, J-Hope, RM, Jimin, V, and Jung Kook, who co-write or co-produce much of their material. Originally a hip hop group, they expanded their musical style to incorporate a wide range of genres, while their lyrics have focused on subjects including mental health, the troubles of school-age youth and coming of age, loss, the journey towards self-love, individualism, and the consequences of fame and recognition. Their discography and adjacent work has also referenced literature, philosophy and psychology, and includes an alternate universe storyline.\n\nBTS debuted in 2013 under Big Hit Entertainment with the single album 2 Cool 4 Skool. BTS released their first Korean and Japanese-language studio albums, Dark & Wild and Wake Up respectively, in 2014. The group's second Korean studio album, Wings (2016), was their first to sell one million copies in South Korea. By 2017, BTS had crossed into the global music market and led the Korean Wave into the United States, becoming the first Korean ensemble to receive a Gold certification from the Recording Industry Association of America (RIAA) for their single \"Mic Drop\", as well as the first act from South Korea to top the Billboard 200 with their studio album Love Yourself: Tear (2018). In 2020, BTS became the fastest group since the Beatles to chart four US number-one albums in less than two years, with Love Yourself: Answer (2018) becoming the first Korean album certified Platinum by the RIAA; in the same year, they also became the first all-South Korean act to reach number one on both the Billboard Hot 100 and Billboard Global 200 with their Grammy-nominated single \"Dynamite\". Follow-up releases \"Savage Love\", \"Life Goes On\", \"Butter\", \"Permission to Dance\", and \"My Universe\" made them the fastest act to earn six US number-one singles since the Beatles in 1966.\n\nAs of 2023 , BTS is the best-selling musical act in South Korean history according to the Circle Chart, having sold in excess of 40 million albums.[2] Their studio album Map of the Soul: 7 (2020) is the fourth best-selling album of all time in South Korea, as well as the first in the country to surpass both four and five million registered sales. They are the first non-English-speaking and Asian act to sell out concerts at Wembley Stadium and the Rose Bowl (Love Yourself World Tour, 2019), and were named the International Federation of the Phonographic Industry's (IFPI) Global Recording Artist of the Year for both 2020 and 2021. The group's accolades include multiple American Music Awards, Billboard Music Awards, Golden Disc Awards, and nominations for five Grammy Awards. Outside of music, they have addressed three sessions of the United Nations General Assembly and partnered with UNICEF in 2017 to establish the Love Myself anti-violence campaign. Featured on Time's international cover as \"Next Generation Leaders\" and dubbed the \"Princes of Pop\", BTS has also appeared on Time's lists of the 25 most influential people on the internet (2017–2019) and the 100 most influential people in the world (2019), and in 2018 became the youngest recipients of the South Korean Order of Cultural Merit for their contributions in spreading the Korean culture and language.\n\nOn June 14, 2022, the group announced a scheduled pause in group activities to enable the members to complete their 18 months of mandatory South Korean military service. Jin, the eldest member, enlisted on December 13, 2022; the others followed in 2023. All members completed their services by June 2025. In August 2025, RM confirmed that the band is working on a new album and in November 2025, Jimin announced that all the music for the album was completed and is being planned for release in early 2026.[3][4]\n\nName\n\nBTS stands for the Korean phrase Bangtan Sonyeondan (Korean: 방탄소년단; Hanja: 防彈少年團), which translates literally to 'Bulletproof Boy Scouts'.[5] According to J-Hope, the name signifies the group's desire \"to block out stereotypes, criticisms, and expectations that aim on adolescents like bullets\".[6][7] In Japan, they are known as Bōdan Shōnendan (防弾少年団).[8] In July 2017, BTS announced that their name would also stand for \"Beyond the Scene\" as part of their new brand identity.[9] This extended the meaning of their name to encompass the idea of growth \"from a boy to an adult who opens the doors that are facing forward\".[10]\n\nHistory\n\n2010–2014: Formation and early years\n\nBTS in 2013 performing at the Incheon Music Center\n\nBTS was formed in 2010, after Big Hit Entertainment CEO Bang Si-hyuk wanted to form a hip hop group around RM (Kim Nam-joon), an underground rapper well known on the music scene in Seoul. At the time, physical album sales were on the decline and digital revenues were not yet high enough to compensate.[11] Seeing a need for diversified income streams, Bang decided to form an idol group instead, because of the potential for live concert performances and passionate support from fans of such groups. Many trainees refused to become part of an idol group, but J-Hope, RM, and Suga remained.[11] Bang chose to vary from the usual, highly regimented idol groups and create one where the members would be individuals rather than an ensemble and free to express themselves.[12] Auditions were held in 2010 with plans to launch the following year.[14][15] The band members lived together, practicing up to 15 hours a day, and first performed before a small crowd of industry insiders in 2013.\n\nWe started to tell the stories that people wanted to hear and were ready to hear, stories that other people could not or would not tell. We said what other people were feeling—like pain, anxieties and worries. That was our goal, to create this empathy that people can relate to. —Suga [ 17 ]\n\nBTS's representation by Big Hit, rather than one of the three agencies that dominated K-pop at the time, allowed the individual members leeway to express their individuality and have input into the music. On June 12, 2013, BTS released their debut single album 2 Cool 4 Skool, along with the lead single \"No More Dream\", neither of which sold particularly well at the time.[19] On June 13, 2013, BTS made their stage debut on M Countdown with the single, \"No More Dream\".[20] Nevertheless, according to Kathy Sprinkel in her book on BTS, that single was \"spotlighting young people's anxiety in the face of lofty parental expectations, sent shock waves through the K-pop ranks. Here was a musical act that wasn't pulling any punches. More specifically, they had a point of view, and they weren't afraid to take on topics that are considered taboo in South Korean society and elsewhere.\" The album reached the top five on South Korea's Gaon Music Chart.[22] In 2 Cool 4 Skool, BTS employed an old-school hip-hop sound from the 1990s. The album's release was followed by appearances on Korean music shows, which caught the attention of reviewers and viewers.[25][26]\n\nIn September 2013, BTS released the second entry in their \"school trilogy\": the EP, O!RUL8,2?. The album was released alongside the single \"N.O.\"[27][28] Similarly to 2 Cool 4 Skool, the new release had a theme of students feeling under pressure and needing to sacrifice their dreams and aspirations.[27] According to scholar Kyung Hyun Kim, many of BTS's earlier works such as \"N.O.\" and \"No More Dreams\" were \"expressions of rebellion against the establishment that tapped into Korean teenagers' frustrations with the country's educational system\" and, he stated, helped them build a fan base among young people in North America and Europe. That same month, BTS starred in their own variety show, SBS MTV's Rookie King Channel Bangtan, in which members parodied variety shows such as VJ Special Forces and MasterChef Korea.[30] At the end of the year, BTS was recognized with several New Artist of the Year awards in South Korea.[31][32][33]\n\n2014–2017\n\nSkool Luv Affair and first concert tour\n\nExterior of the nightclub Troubadour (photo taken 2006) where BTS held their concert in the US for free\n\nThe last entry in BTS \"school trilogy\", the Skool Luv Affair EP, was released in February 2014.[34][35] The release topped the Gaon Album Chart,[36] and appeared on Billboard's World Albums Chart for the first time, peaking at number three.[34][37] The EP was supported by two singles: \"Boy in Luv\" and \"Just One Day\".[38] Following Skool Luv Affair's release, BTS played at their first fan meeting in Seoul, selecting the name A.R.M.Y. for the fan club.[39] In July 2014, BTS hosted a concert in West Hollywood, their first show in the United States,[40] and in August, they appeared at KCON in Los Angeles.[41]\n\nIn August 2014, BTS released the album Dark & Wild, which reached number two in South Korea.[38][42] It was supported by two singles: \"Danger\" and \"War of Hormone\".[38] The group embarked on their first concert tour, 2014 BTS Live Trilogy Episode II: The Red Bullet, which lasted from October to December 2014.[43] The band launched their first Japanese studio album, Wake Up, in December 2014; the release peaked at number three on the Oricon Albums Chart.[44] After the album's release, BTS held their 1st Japan Tour 2015 Wake Up: Open Your Eyes in February 2015.[45] The Red Bullet Tour that had begun on October 17, 2014, in South Korea was resumed on June 6, 2015, in Malaysia and toured Australia, North America and Latin America before ending in Hong Kong that August. In all, the entire tour attracted 80,000 spectators at 18 cities in 13 countries.[43][46]\n\nMainstream breakthrough and commercial success\n\nBTS experimented with other styles of music besides hip-hop in The Most Beautiful Moment in Life, Pt. 1, released in 2015.[38] BTS wanted to express the beauty and anxiousness of youth and settled on the title of \"花樣年華\" (Korean: 화양연화; RR : Hwayangyeonhwa), loosely interpreted to define \"youth\" metaphorically as \"the most beautiful moment in life\".[48] The album served as an introduction to their youth trilogy, a triptych of albums dedicated to the struggles of young people. The single \"I Need U\" was a top-five hit in South Korea and garnered the group a win on SBS MTV's The Show.[50][51] The second single \"Dope\" (Korean: 쩔어; RR : Jjeoreo; lit. It's awesome) reached number three on Billboard's World Digital Song Sales chart and its music video was viewed over 100 million times on YouTube.[52][53] The group began the world tour extension of their Red Bullet Tour in June, titled 2015 Live Trilogy Episode II: The Red Bullet, visiting cities throughout Asia, Oceania, North America, and Latin America.[43] \"For You\", in Japanese, was released together with Japanese versions of \"War of Hormone\" and \"Let Me Know\" on June 17, 2015, and immediately topped Oricon's daily chart.[38][54]\n\nBTS performing at KCON France in Paris on June 2, 2016\n\nIn November, BTS commenced their third concert tour, 2015 BTS LIVE \"The Most Beautiful Moment in Life: On Stage\", beginning with three sold-out shows in Seoul. The tour marked the debut of their fourth EP, The Most Beautiful Moment in Life, Part 2, and was later extended to Japan.[55] Thematically, the EP focused more on the serious and speculative aspects of youth, touching on the pursuit of success, loneliness, affection for their origins, and the suffering of the younger generation due to unfavorable conditions in current society. The album topped the weekly Gaon Album and Billboard World Albums charts.[58][59] It also marked their first appearance on the Billboard 200 chart,[60] making it for one week at number 171,[61] and eight of the tracks appeared on Billboard's World Digital Song Sales chart.\n\nTheir compilation album and the finale to their \"youth trilogy\", The Most Beautiful Moment in Life: Young Forever was released on May 2, 2016. With 300,000 presold copies, it included three new singles: \"Epilogue: Young Forever\", \"Fire\", and \"Save Me\",[38][64] which debuted in the top three spots on the Billboard World Digital Charts. The album topped the Gaon Album Chart in South Korea for two consecutive weeks and reached number 107 on the Billboard 200.[65][66][67] The Most Beautiful Moment in Life: Young Forever won Album of the Year at the 2016 Melon Music Awards.[68] BTS embarked on their Asia tour extension, 2016 BTS LIVE \"The Most Beautiful Moment in Life On Stage: Epilogue\" from May to August 2016. Tickets for the 14 shows in 10 Asian cities sold out, some in as little as five seconds.[69]\n\nBTS win their first major Korean award for Album of the Year at the 2016 Melon Music Awards on November 19, 2016\n\nIn September 2016, BTS released their second Japanese studio album Youth.[70] The album sold 44,547 copies on the first day of its release, and charted 1st in the Oricon Daily Album Chart.[71][72] The album was eventually certified Gold with sales of roughly over 100,000 in Japan. It was followed one month later in October,[38] by their next studio album Wings, which combined the themes of youth presented in their previous \"youth trilogy\" with temptation and adversity. The album and its tracks, including the single \"Blood Sweat & Tears\" immediately rose to the top on eight music charts, including the Gaon Music Chart, and led the iTunes album charts in 23 countries.[75][76] Wings opened at number 26 on the Billboard 200, with 16,000 album-equivalent units in the US for the week of its release, the best week ever there for a K-pop album.[77] It became the best-selling album in Gaon Album Chart history.[78]\n\nYou Never Walk Alone and Love Yourself: Her\n\nIn February 2017, BTS released the repackaged edition of Wings entitled You Never Walk Alone. The 700,000 pre-orders of it (an increase from the 500,000 pre-orders of Wings) helped break the record for most albums sold in a month in South Korea, as it reached 1.49 million copies by the end of its first month.[79][80] The lead single was \"Spring Day\"[38] and it won Best Song of the Year at the 2017 Melon Music Awards.[81] BTS's second world tour, 2017 BTS Live Trilogy Episode III: The Wings Tour, began in February.[82] On the tour, BTS played arenas in the US, such as New Jersey's Prudential Center and California's Honda Center. Tickets for the North American leg sold out within hours and two shows were added.[83][84] After completing the North American leg, BTS attended the 24th Billboard Music Awards in May and won Top Social Artist,[85] the first K-pop group to win a Billboard award.[86] BTS fans cast over 300 million votes for the band and broke a six-year winning streak held by Justin Bieber, a performer with 100 million Twitter followers.[87] This caused the international media to focus on the ability of BTS's fandom to propel the group to such a victory.[87]\n\nBTS at their press conference in Seoul, South Korea after winning Top Social Artist at the 24th Billboard Music Awards on May 29, 2017\n\nBTS released a remake of Seo Taiji's \"Come Back Home\" (1995) in July 2017, giving it new lyrics but maintaining the theme of urging societal change.[88] Later that year, BTS embarked on their \"Love Yourself\" album series, with theme of the enlightenment of self-love through the \"起承轉結\" (Korean: 기승전결; RR : Giseungjeongyeol) narrative sequence of \"beginning, development, turn, and conclusion.\" BTS released its first part, their fifth EP, Love Yourself: Her, on September 18.[86][90] RM considered \"DNA\", the lead single from that album,[91] as \"taking BTS to new ground. We tried to apply new grammar and perspectives.\"[38] He said of the album, \"I believe it's going to be the starting point of a second chapter of our career; the beginning of our Chapter Two.\"[92] Sonically, the EP served as \"a dual exploration of the group's electro-pop and hip-hop leanings\".[91]\n\nBTS at the 45th American Music Awards shortly before making their US television debut on November 19, 2017\n\nLove Yourself: Her debuted at number seven on the Billboard 200.[93] The album had 1,664,041 sales in May 2017 to lead the Gaon Chart,[94] and was the first in 16 years to exceed 1.2 million copies sold since g.o.d's fourth album Chapter 4 (2001).[95][96] \"DNA\" was released simultaneously with the EP, and its music video accumulated 21 million views in its first 24 hours.[97] It became BTS's first entry on the Billboard Hot 100, charting at number 85, making them the first K-pop boy band to reach that chart.[98] The single rose to number 67 the following week and became the highest-charting song on the Hot 100 for any K-pop group.[99] A remix of \"Mic Drop\" from the album, featuring Desiigner, was released as a single and peaked at number 28, the first time a K-pop group had cracked the top forty.[100][101] Both singles attained Gold certification from the Recording Industry Association of America (RIAA) in early 2018.[102] \"Mic Drop\" achieved Platinum status in the US later that year.[103]\n\nIn November 2017, BTS became the first K-pop group to perform at the American Music Awards.[104][105] BTS won Artist of the Year at the 19th Mnet Asian Music Awards in December, winning for the second consecutive year.[106] They released \"DNA\" and \"Mic Drop\" together with a new song \"Crystal Snow\" as a single album in Japan on December 6, 2017, though the songs were made digitally available elsewhere.[38][107] It topped the Oricon Chart for the week of its release. It was the only album by a foreign artist to be certified Double Platinum in Japan in 2017.[108][109] Later that month, they made their Japanese television prime time music show debut on Music Station Super Live,[110] and ended the year by performing on Dick Clark's New Year's Rockin' Eve.[111][112]\n\nIn 2017, BTS partnered with UNICEF on the \"Love Myself\" campaign, intended to help end violence, abuse, and bullying, and to promote self-esteem and well-being among young people. Both Big Hit and the group pledged money to promote the campaign, and BTS sold special \"Love Myself\" merchandise and set up dedicated booths at concert venues. The campaign was renewed in 2021, with UNICEF deeming it to have been successful.[113]\n\n2018–2020\n\nLove Yourself album series\n\nBTS won major awards at the Golden Disc and Seoul Music Awards in January 2018.[114][115] In March, the group premiered an eight-episode documentary titled Burn the Stage that offered a behind-the-scenes look at their 2017 Wings Tour, exclusively on YouTube Premium.[116][117] Their third Japanese studio album, Face Yourself, was released on April 4, 2018,[118] and quickly reached the top 5 of the U.S. iTunes Albums chart. A nine-minute short film, titled Euphoria: Theme of \"Love Yourself: Wonder\" and featuring the song \"Euphoria\", followed the next day as a prelude to the group's third Korean-language studio album, Love Yourself: Tear.[119] BTS promoted Tear's May 18, 2018, release with an appearance at the 25th Billboard Music Awards two days later,[120] where they made their initial BBMA performance with their single, \"Fake Love\".[121][122] The group also won Top Social Artist for a second consecutive time.[123][124] The album coincided with the \"轉\" or \"turn\" of the series, touching on the tortuous enlightenment of loving without being loved, the pains and sorrows of separation, and providing encouragement to those without dreams.\n\nBTS at their press conference for Love Yourself: Tear on May 24, 2018\n\nLove Yourself: Tear debuted at number one its first week on the Billboard 200, becoming BTS's first number-one album in the US and the first K-pop album to top the US albums chart.[126] It also became BTS's first top-10 release in Britain, reaching number eight on the UK Albums Chart.[127] \"Fake Love\" became BTS's top-10 single on the Hot 100, the first time a song sung mostly in a language other than English had debuted in the top 10.[128] BTS released their compilation album Love Yourself: Answer in August 2018.[129] The album was supported by the single \"Idol\" and its alternative digital release featuring Nicki Minaj.[130][131]\n\nLove Yourself: Answer sold over 1.9 million copies on the Gaon Album Chart in August 2018.[132] The album became BTS's second number-one on the Billboard 200 and led to their highest US sales week in the country to that point with 185,000 album equivalent units.[133] In November 2018, Love Yourself: Answer became the first Korean language album to be certified Gold by the RIAA.[103] \"Idol\" and Love Yourself: Answer both received Platinum certifications in the US, with sales of more than 1 million.[134]\n\nNew York City's Citi Field, the venue for BTS's first stadium concert in the US, sold out in 20 minutes. [ 135 ]\n\nIn conjunction with Love Yourself: Answer's release in August 2018, BTS commenced their world tour, BTS World Tour: Love Yourself, with two concerts in the Seoul Olympic Stadium, which sold out in a matter of seconds, as did others of the 22 shows in 12 countries.[136] In October, BTS released their collaboration with Steve Aoki \"Waste It on Me\", their first all-English language feature.[138][139] For the final stop of the North American leg, the group performed at Citi Field in New York City, marking the first time a Korean act performed at a US stadium.[140] According to StubHub, BTS was the second best-selling concert act outside the US, behind only Ed Sheeran.[141] That October, BTS renewed their contract with Big Hit Entertainment through 2026.[142]\n\nIn early November 2018, a popular Japanese music show cancelled BTS's performance, citing a T-shirt a member wore the year before, bearing a photograph of a mushroom cloud following the bombing of Nagasaki.[143] In the same month, the Jewish human rights organization Simon Wiesenthal Center (SWC) stated that BTS owed an apology for that shirt, and for clothing and flags with Nazi symbolism.[144] Big Hit Entertainment issued an apology, explaining that the images were not intended to be hurtful to the victims of Nazism or atomic bombings and that the group and management would take steps to prevent future mistakes.[145] They also stated the flags were meant to be a commentary on the Korean school system.[146] The apology was accepted by SWC and the Korean Atomic Bomb Victim Association.[147][148] John Lie, in his scholarly article on BTS, opined that the Nazi incident showed that the group is not tightly controlled, as are other K-pop ensembles, whose every move seems scripted, and that the members have opinions and are not afraid to express them.\n\nAt the 20th Mnet Asian Music Awards, BTS won Artist of the Year and ranked number eight on Billboard's year-end Top Artist Chart and were also the number two act of the year in the Duo/Group ranking, only behind Imagine Dragons.[150][151] They were also listed as one of the 50 most influential people by Bloomberg for their \"willingness to address social issues, mental health, and politics, despite being in a genre often painted as bubble gum pop\".[152]\n\nMap of the Soul: Persona, stadium world tour and BTS World\n\nIn February 2019, BTS, for the first time, were presenters at the Grammy Awards.[153][154] In April, Time named them one of the Time 100, the most influential people of 2019.[155] Their EP, Map of the Soul: Persona, was released on April 12 with the single \"Boy with Luv\" (Korean: 작은 것들을 위한 시; RR : Jageun geotdeureul wihan si), featuring American singer Halsey.[156] The EP's release was followed by a performance on Saturday Night Live, the first K-pop act to appear there.[157] Map of the Soul: Persona became the first Korean-language album to reach the number one position in both the UK and Australia,[158][159] and the group's third album to top the Billboard 200 in less than a year.[160] Map of the Soul: Persona became the best-selling album ever in South Korea in terms of physical copies sold, with more than 3.2 million sales in less than a month.[161][162] \"Boy with Luv\" debuted at number eight on the Billboard Hot 100 in April 2019, the highest placement ever for a K-pop song.[163]\n\nBTS performing at the Rose Bowl stadium in Pasadena, California, before 60,000 fans\n\nFollowing their two wins at the 26th Billboard Music Awards in May, including for Top Duo/Group,[164] BTS embarked on their world tour stadium extension, Love Yourself: Speak Yourself.[165] Due to the demand, BTS added more shows after tickets for the first dates sold out within two hours.[166] In the lead up to the release of their mobile game BTS World, in June 2019 BTS released \"Dream Glow\" featuring Charli XCX,[167] \"A Brand New Day\" with Zara Larsson,[168] and \"All Night\" with Juice Wrld.[169] The group released the song \"Heartbeat\" with a music video from the game's official soundtrack, titled BTS World: Original Soundtrack.[170] The soundtrack was certified Double Platinum by Gaon.[171] On July 3, 2019, pre-orders for the single \"Lights\" crossed one million copies, marking the first time a foreign artist had accomplished this in Japan since Celine Dion in 1995.[172][173] \"Lights\" debuted at number 81 on the Billboard Japan Hot 100 for the chart issue date of July 8, 2019, and reached number one the following week.[174][175] On August 8, 2019, \"Lights\" received Million certification from the RIAJ, denoting shipments of one million copies.[176][177][178]\n\nLove Yourself: Her and Love Yourself: Tear both crossed 2 million copies in August.[179] All three albums of the Love Yourself series have sold more than 2 million copies each in South Korea.[180] Love Yourself: Tear gained silver certification by the BPI for sales in the UK, becoming their third album to do so following Love Yourself: Answer and Map of the Soul: Persona.[181] For the final stop of their record-breaking Love Yourself: Speak Yourself World Tour, the group played Seoul's Olympic Stadium.[182] BTS was the third top-grossing touring musical act of 2019.[183] That same month, they released a remix version of the song \"Make It Right\" featuring Lauv.[184] In November, BTS won three times at the 2019 American Music Awards, for Best Tour, Favorite Duo or Group – Pop/Rock, and Favorite Social Artist (the second consecutive year).[185]\n\nIn December, they attended both the 2019 Melon Music Awards and the 2019 Mnet Asian Music Awards. In each case, they became the first group to sweep the four major awards.[186][187][188] At the 34th Golden Disc Awards, BTS became the first artists in history to win grand prizes in both the physical and digital categories in a single year.[189] Map of the Soul: Persona was named the second best-selling physical album of 2019 in the US by Nielsen Music behind Taylor Swift's Lover and was ranked sixth overall on the chart of Top 10 Albums (Total Sales) in the US.[190] BTS wrapped 2019 as the fourth-highest-ranked group on Billboard's Top Billboard 200 Artists–Duo/Group ranking, behind Queen, Imagine Dragons and the Beatles.[191] Map of the Soul: Persona was named as the third best-selling album of 2019 by the International Federation of the Phonographic Industry (IFPI), making BTS the first Korean artist to be listed on the Global Top 10 Album Chart in consecutive years.[192][193][194] The IFPI named BTS as one of the best-selling artists of 2019 for a second consecutive year, making them the first non-English speaking act to achieve this.[195][196]\n\nMap of the Soul: 7, \"Dynamite\" and Be\n\nIn January 2020, BTS released \"Black Swan\" along with a choreography art film performed by MN Dance Company of Slovenia as the first single from their album Map of the Soul: 7.[197][198] Album distributor Dreamus reported that stock pre-orders of the album reached a record-breaking 4.02 million.[199] Later that month, BTS performed at the 62nd Annual Grammy Awards, making BTS the first Korean act to perform at the Grammys.[200][201] Map of the Soul: 7 was released on February 21 to favorable reviews.[202][203] The album was supported by the single \"On\" and an alternative digital release of it featuring Australian singer Sia.[204] According to Gaon Chart, Map of the Soul: 7 sold over 4.1 million copies in nine days after its release, surpassing Map of the Soul: Persona to become the best-selling album in South Korean history and the first album to be certified quadruple million.[205] The album debuted atop the US Billboard 200, making BTS the fastest group to earn four number one albums since the Beatles in 1966–1968.[206] \"On\" debuted at number four on the Billboard Hot 100, giving BTS its first top-five hit, and the most Hot 100 top-10 entries of any Korean act, with three.[207] BTS planned to support the Map of the Soul album series with a concert series, Map of the Soul Tour, beginning in April,[208] but this was indefinitely postponed due to the COVID-19 pandemic.[209]\n\nIn April 2020, BTS became the first K-pop artist to sell more than 20 million albums cumulatively,[210] making them the best-selling artist in South Korean history.[180][211] That month, amid the pandemic restrictions, BTS held a two-day online streaming concert event titled Bang Bang Con, where the group shared footage of past concerts on their YouTube channel.[212] On June 7, BTS headlined YouTube's Dear Class of 2020 online graduation event, performing \"Boy with Luv\", \"Spring Day\", and \"Mikrokosmos\".[213] Their commencement speeches highlighted their own graduations and offered \"messages of hope and inspiration for the class of 2020 in both Korean and English\".[214] On June 14, BTS held an online live concert, Bang Bang Con: The Live, as part of the seventh anniversary of their debut.[215] It garnered peak viewership of 756,000 live viewers in 107 countries and territories, setting the record for the largest audience for a paid virtual concert.[217] On June 19, BTS released the Japanese single, \"Stay Gold\", from their fourth Japanese album, Map of the Soul: 7 – The Journey, which was released worldwide on July 14.[218][219] It surpassed 564,000 copies in its first week, breaking the record for highest first week album sales by male foreign artists in Japan.[220]\n\nBTS released their first English-language single, \"Dynamite\", on August 21.[221] \"Dynamite\" debuted at number one on the US Billboard Hot 100 chart, earning BTS their first chart topper and making them the first all-South Korean act to earn a number one single in the US.[222][223] The single also topped Billboard's new Global 200 for the week ending September 24, as well as Global Excluding US charts, becoming the first single to top both simultaneously.[224] \"Dynamite\" peaked at number five on the US Mainstream Top 40 and on the. Billboard Pop Singles chart, becoming their first Top 10 on each and the former the highest-charting entry by a Korean act.[225][226] On August 31, BTS made their MTV Video Music Awards (VMAs) debut with the first live performance of \"Dynamite\"[227] and won four awards: Best Group, Best Choreography, Best Pop Video, and Best K-pop (the last three for their music video for \"On\").[228] On October 14, they performed the single at the 2020 Billboard Music Awards and won the Top Social Artist award for a fourth consecutive year.[229][230]\n\nOn October 2, 2020, BTS released a remix of Jawsh 685 and Jason Derulo's single \"Savage Love (Laxed – Siren Beat)\".[231] It topped the Hot 100.[232] On October 10 and 11, BTS hosted a two-day virtual pay-per-view concert at KSPO Dome in Seoul, called Map of the Soul ON:E, which drew 993,000 viewers from 191 countries and territories.[233][234][235] On November 20, BTS released their fifth Korean studio album Be, led by the single \"Life Goes On\".[236] \"Life Goes On\" debuted at number one on the Hot 100,[237] BTS's third consecutive US number-one single in three months and the first song performed primarily in Korean to top the chart.[238][239]\n\nOn November 24, 2020, BTS became the first Korean pop artists recognized by the Recording Academy when \"Dynamite\" received a nomination for Best Pop Duo/Group Performance at the 63rd Annual Grammy Awards.[240] The group won the Special International Music Award at the 62nd Japan Record Awards.[241] Kim, in his book on the influence of Korean popular culture, suggested that 2020, the worst year in many people's lives, was a noteworthy one for Korean culture, with Parasite winning the Academy Award for Best Picture and BTS posting three number-one hits on the Billboard Global 200.\n\n2021–present\n\n\"Butter\", \"Permission to Dance\" and Proof\n\nOn March 4, 2021, the IFPI named BTS its Global Recording Artist of the Year for 2020, the first Asian and first non-English speaking act to top the ranking.[244] BTS occupied three spots in the Global Album Sales Chart of 2020, with Map of the Soul: 7 at number one, Be (Deluxe Edition) at number two, and Map of the Soul: 7–The Journey at number eight.[245] On the newly launched Global Album All Format Chart, Map of the Soul: 7 claimed first place and Be (Deluxe Edition) claimed fourth.[246] On March 14, 2021, BTS performed \"Dynamite\" at the 63rd Annual Grammy Awards, becoming the first Korean nominee to perform, though they did not win the award.[247] On April 1, BTS released \"Film Out\", the first single from their then-upcoming Japanese compilation album, BTS, the Best.[248] BTS held a two-day online streaming event on their YouTube channel beginning April 17, titled Bang Bang Con 21, and aired three of their previous in-person concerts.[249]\n\nOn May 21, BTS released their second English-language single, \"Butter\".[250] It debuted at number one on the Hot 100—their fourth number one in nine months—making them the quickest act to achieve four chart-toppers since Justin Timberlake in 2006, and the fastest group since the Jackson 5 in 1970.[251] Their next English-language single, \"Permission to Dance\", was released on July 9.[252] It became BTS's eighth number-one on the Digital Songs chart, extending their record as the group with the most number-one entries on the ranking.[253] On September 24, 2021, the band released the single \"My Universe\" with Coldplay.[254] The single debuted at number one on the Hot 100, making it the first collaboration between two groups to debut at number one.[255] On October 4, 2021, \"My Universe\" became BTS' sixth Hot 100 number one, achieving the fastest accumulation of six chart-toppers since The Beatles in 1964–1966.[256][257] The band held an online concert, titled Permission to Dance on Stage, on October 24, 2021, in Seoul.[258] On November 23, \"Butter\" earned a Grammy nomination for Best Pop Duo/Group Performance at the 64th Annual Grammy Awards.[259][260] Between November 27 and December 2, BTS held their first live performances before an in-person audience since before the pandemic. The band played four sold-out shows at SoFi Stadium in Los Angeles as a continuation of their Permission to Dance on Stage concert series.[261][262][263]\n\nOn January 15, 2022, a fictional webtoon based on BTS, titled 7Fates: Chakho, was released. The comic surpassed 15 million views globally in its first two days of availability and became the highest-viewed title ever launched by Webtoon.[264][265] The band held three limited-capacity concerts at Seoul Olympic Stadium on March 10, 12 and 13—the largest music gatherings[a] approved by the South Korean government since the pandemic restrictions were imposed—with a total audience of 45,000 people.[266][267] On April 3, BTS performed \"Butter\" at the 64th Annual Grammy Awards,[260] though the song did not win the award for which it was nominated.[268] On April 8, the band earned seven nominations at the 2022 Billboard Music Awards[269] and won three, making them the most-nominated and the most-awarded group in the show's history.[270][271]\n\nOn June 10, 2022, BTS released their three-CD anthology album Proof.[272][273][274] On June 14, during their ninth anniversary celebrations, the band announced a temporary suspension of group activities to focus on solo projects and other endeavors.[275][276] Hybe Corporation, which owns Big Hit,[277] clarified in subsequent statements that BTS was neither disbanding nor going on hiatus, but would be actively furthering their individual careers with the label's full support while still participating in group activities, including the filming of Run BTS.[278][279] The incident caused Hybe Corporation's stock to decline rapidly, resulting in a decrease in market value of US$1.7 billion.[280] On August 24, Billboard magazine reported that BTS would be performing in Busan on October 15 in a benefit concert in support of the city's efforts to have a World Exposition in 2030, participating under the banner Yet to Come.[281][282]\n\nMilitary service and contract renewal\n\nIn spite of the announcement of the October 2022 benefit concert, Hybe Corporation's stock prices dropped to below its original IPO amid continuing market speculation about the implications of the upcoming mandatory military enlistment of the band's members.[283] Under South Korean laws, all able-bodied males must complete between 18 and 21 months of military service, usually by age 28.[281] Bloomberg News reported the concert as a success but also indicated that there were no further concert dates scheduled. It was estimated that if the band members completed their service, Hybe Corporation would lose nearly US$10 billion over ten years, with the loss to the South Korean economy at nearly US$39 billion.[284]\n\nIn October 2022, Big Hit confirmed that Jin, the band's oldest member, aged 29, had withdrawn his enlistment deferral request.[285] The other members planned to enlist later, with the group planning to reunite in 2025 following discharge.[286][287] At the end of October 2022, BTS earned five nominations for the 2022 MAMA Awards, with the band members receiving eight further nominations as solo artists.[288] On November 15, BTS earned three nominations at the 65th Annual Grammy Awards, including a nomination for Best Music Video for \"Yet to Come\".[289] \"My Universe\" was nominated for Best Pop Duo/Group Performance, making BTS the only act to be nominated three years in a row in this category since its introduction in 2011.[289] The band was also nominated for Album of the Year as featured artists on Coldplay's Music of the Spheres.[289] Jin enlisted as an active duty soldier on December 13.[290] On February 26, 2023, Big Hit announced that J-Hope had requested cancellation of the postponement of his military service.[291]\n\nFollowing their scheduled separation, the band's BTS 'Yet to Come' in Busan concert film was released on February 1, 2023.[292] J-Hope enlisted as an active duty soldier on April 18.[293] On May 12, BTS released a soundtrack \"The Planet\" for the South Korean animated series Bastions.[294] To commemorate their tenth anniversary, the group released the song \"Take Two\" on June 9.[295]\n\nOn September 20, 2023, Hybe confirmed through a press release that BTS would renew their exclusive contracts. The members will sign these agreements sequentially, considering their military service, after a board resolution with Big Hit Music, solidifying their commitment to future projects starting from 2025 onwards.[296][297] On September 22, 2023, Suga enlisted as a social worker.[298] RM and V enlisted on December 11, 2023, followed by Jimin and Jung Kook on December 12.[299] On June 12, 2024, Jin became the first member to complete his mandatory military service when he was officially discharged;[300] he was followed by J-Hope on October 17, 2024.[301] RM and V were discharged on June 10, 2025,[302] followed by Jimin and Jung Kook on June 11,[303] and on June 18, Suga was the final member to be discharged.[304]\n\nThe group reunited publicly for the first time on a Weverse live on July 1. In the livestream, they confirmed they were preparing a new album for early 2026, their first since Proof in 2022, alongside a new world tour.[305][306] On November 1, Jimin confirmed that all of the tracks for the new album were completed and ready for release in the Spring to accompany the group's planned tour.[307][308]\n\nArtistry\n\nInfluences\n\nJin (center) performing Freddie Mercury's \"ay-oh\" chant during BTS' first concert at Wembley Stadium on June 1, 2019\n\nBTS have cited Seo Taiji and Boys,[309] Nas, Eminem, Kanye West, Drake, Post Malone, Charlie Puth, and Danger as musical inspirations.[310] They have also cited Queen as an influence, saying they \"grew up watching videos of Live Aid\".[311] During their concert at Wembley Stadium in London, Jin paid tribute to Queen by leading the crowd in a version of Freddie Mercury's \"ay-oh\" chant.[311] \"Hip Hop Phile\" which was released when BTS's hip-hop concept was at its height, pays homage to the artists who influenced them, including the South Korean group Epik High, Jay-Z, Biggie, CL Smooth, and others.[312]\n\nTheir 2016 album Wings was inspired by Hermann Hesse's coming of age novel, Demian.[313] Their song \"Blood Sweat & Tears\" quotes Friedrich Nietzsche's Thus Spoke Zarathustra, and its music video features visual references to Herbert James Draper's The Lament for Icarus, Pieter Bruegel's Landscape with the Fall of Icarus, and Bruegel's The Fall of the Rebel Angels.[314] Among the literary and other sources that have inspired their works are those by Haruki Murakami, Ursula K. Le Guin, Carl Jung, George Orwell and Nietzsche.[315] The Love Yourself series was influenced by Erich Fromm's The Art of Loving,[277][316] and their 2018 song \"Magic Shop\" from Love Yourself: Tear was inspired by James R. Doty's memoir Into the Magic Shop.[317]\n\nMusical style\n\nSince their inception, BTS have emphasized hip hop as their musical base, largely due to the influence of RM and Suga's background as underground rappers;[318] during early visits to the US, the group received mentoring from American rappers. Bang Si-hyuk previously acknowledged that K-pop as a whole draws from black music, and author Crystal S. Anderson stated, \"BTS's rising popularity in the US represents the continuation of the ways that K-pop functions as part of a global R&B tradition.\" T.K. Park and Youngdae Kim of Vulture deemed the track \"Outro: Her\" from Love Yourself: Her as the best example of the group's understanding of old-school hip hop, with raps inspired by Chuck D and Tupac and jazzy chords from the 1990s to create a classic hip hop sound.[322]\n\nThe release of \"Blood Sweat & Tears\" in 2016 accelerated BTS's transition from a hip hop to a pop group. Park and Kim noted that the song draws from dancehall, reggaeton, and moombahton but opts for a \"baroque mysticism\" rather than the \"partylike atmosphere of its influences\".[322] The group also began incorporating traditional Korean elements into their music. For example, their single \"Idol\" (2018) features an adlib from Pansori, a Korean form of operatic storytelling, and vocal imitations of the sounds of Korean janggu drums.[325]\n\nWhile BTS maintains roots in hip hop, their sound has diversified. They first experimented with R&B, rock and jazz hip hop on Dark & Wild in 2014;[326] EDM in their The Most Beautiful Moment in Life album series; moombahton and tropical house on Wings and You Never Walk Alone;[328][329] future bass and Latin pop in their Love Yourself album series; slow-dance ballads,[330] emo rap, Afro pop,[331] funk, trap, pop rock, and hip pop in their Map of the Soul album series;[332] and disco in their single \"Dynamite\".[333][334] The band members have explored different genres on solo tracks, such as neo soul on V's \"Stigma\" and flowing R&B on Jimin's \"Lie\".[328]\n\nLyrical themes\n\nSince their formation, BTS have believed that telling their own stories is the best way for the younger generation to relate to their music.[335] Writing many of their own lyrics,[336][337] the group discusses universal life experiences such as sadness and loneliness in their work and turn them into something lighter and more manageable. RM stated that BTS tries to avoid a preaching or reprimanding tone in their songs \"because that's not the way that we want to spread our message ... We're born with different lives, but you cannot choose some things. So we thought that love, the real meaning of it, starts with loving ourselves and accepting some ironies and some destinies that we have from the very start.\"[338] When asked if it is difficult to write about things like mental health, Suga responded,\n\nWe feel that people who have the platform to talk about those things really should talk more, because they say depression is something where you go to the hospital and you're diagnosed, but you can't really know until the doctor talks to you ... More and more, I think artists or celebrities who have a voice should talk about these problems and bring it up to the surface.[338]\n\nThemes explored in BTS's discography range from exploring \"the troubles and anxieties of school-age youth\" to \"themes like love, friendship, loss, death, and more\".[339] Early BTS songs, such as \"No More Dream\" and \"N.O\" from their school trilogy, were described by Tamar Herman as motivated by personal experiences with South Korea's rigid approach to education and called for change to the educational system and societal expectations.[340] The members' experiences with South Korean youth culture also inspired the songs \"Dope\" and \"Silver Spoon\" (Korean: 뱁새; RR : Baepsae) from their youth trilogy. These songs reference generational disparity and millennials giving up romantic relationships, marriage, children, proper employment, homes, and social life in the face of economic difficulties and societal ills while facing condemnation from the media and older generations.[340] The group's label dubbed The Most Beautiful Moment in Life: Young Forever, the conclusion to their youth trilogy, \"a special album that marks the conclusion of the epic journey of the series, containing the last stories told by young people who, despite an uncertain and insecure reality (The Most Beautiful Moment in Life Pt. 1) continue to surge forward (The Most Beautiful Moment in Life Pt. 2).\" Wings focused on mental health, criticisms of the K-pop \"idol\" scene, and delivering a female empowerment message.[342] The Love Yourself series introduced new themes regarding youth culture in South Korea, including the excitement of love, pain of farewell, and enlightenment of self-love. According to Kathy Sprinkel, BTS's 2020 \"quarantine album\" Be \"chronicles the group's coming to terms with a suddenly new reality and offers support for their listeners going through the same upheaval and uncertainty\".\n\nBTS's lyrics have also addressed topics outside youth culture. The song \"Am I Wrong\" from Wings questioned societal apathy towards changing the status quo; the lyric \"We're all dogs and pigs / we become dogs because we're angry\" appeared to reference South Korean Ministry of Education official Na Hyang-wook, who advocated a caste system for the country and who reportedly described average people as \"dogs and pigs\". BTS released the song amid the 2016 South Korean political scandal that resulted in the impeachment of president Park Geun-hye.[340] RM and Suga's personal struggles with mental health have inspired some of their music.[338][322] \"Not Today\" from 2017's You Never Walk Alone is an anti-establishment anthem, urging \"all the underdogs in the world\" to keep fighting,[345] and \"Spring Day\" honored the victims of the Sewol Ferry tragedy.[346] Journalist Jeff Benjamin praised BTS in Fuse for \"speak[ing] honestly about topics they deem important, even in a conservative society\".[347] Former South Korean president Moon Jae-in said: \"Each of the seven members sings in a way that is true to himself and the life he wants to live. Their melody and lyrics transcend regional borders, language, culture, and institutions.\"[348]\n\nImpact\n\nFor broader coverage of this topic, see Korean Wave\n\nBTS performing at the Korea-France Friendship Concert in Paris on October 14, 2018\n\nOn April 29, 2019, Time magazine named BTS one of the 100 most influential people of the year, labeling them the \"Princes of Pop\".[349] Billboard executive Silvio Pietroluongo compared the group's influence to that of the Beatles.[350] MRC Data executive Helena Kosinski noted that \"although BTS weren't the first to open the doors to K-Pop worldwide, they were the first to become mainstream. They don't just appeal to young people but also to the 50s and 60s age demographic.\"[351] The first non-English speaking artist to make the Global Artist Chart in 2018, BTS was the second best-selling artists worldwide across multiple media platforms, second only to Drake.[352][353][354] In 2020, BTS became the first non-western and non-English speaking artist to be named IFPI's Global Recording Artist of the Year.[244] In South Korea, BTS accounted for 41.9 percent of album sales in the first half of 2019, up from their market share of 25.3 percent the previous year.[355]\n\nIn 2022, Youna Kim described BTS as having spearheaded the Korean Wave, representing the global expansion of Korean culture as effectively as Psy did in the previous decade and with the strength of influence that the Academy Award-winning South Korean film Parasite had in 2020. South Korea's central bank, the Bank of Korea, found in 2021 that BTS, including a \"ripple effect\" that included increased tourism to South Korea; increased interest in Korean culture, movies, and study of the Korean language; and added approximately US$5 billion per year to South Korea's economy, a growth of about 0.5 percent.[357] A 2018 study showed that, on average, 800,000 foreigners per year had visited South Korea over the past four years for BTS-related reasons.\n\nWriters identified BTS as leaders even among other highly influential K-pop groups such as Girls' Generation, Super Junior, Exo, Twice, and Blackpink and note that BTS's success shows the importance of a strong, active fan base in the age of social media, where fan campaigning can be as important as musical quality to a song's success. The group has also distinguished themselves at the forefront of the business side of the K-pop industry by pursuing less restrictive contracts with their management company to maximize their artistic originality and creativity.[361] With this newer approach to career management, BTS created closer ties to the South Korean youth and encourage individuality and authenticity among their audience.\n\nDiplomacy\n\nIn his 1990 essay Soft Power, political scientist Joseph Nye developed the concept of a second type of power different from traditional authoritarianism.[363] Nye wrote, \"This second aspect of power – which occurs when one country gets other countries to want what it wants – might be called co-optive or soft power in contrast with the hard or command power of ordering others to do what it wants.\"[364] Researchers such as Maud Quessard have applied the concept of soft power to BTS and their influence on entertainment diplomacy and international relations. Youna Kim and Maud Quessard all read the currency of soft power as including culture, political values, and foreign policy, which applies to BTS's ability to be co-optive in their approach to spreading their message of harmony, acceptance, and addressing life's setbacks via their broad appeal on the international stage.\n\nBTS was invited to address the United Nations General Assembly in New York in September 2018.[366][367] That same year they performed in Paris before an audience of 400, including President Moon Jae-in and other officials, at the 2018 Korea-France Friendship Concert, a summit celebrating the friendly relations between France and South Korea.[368] That year, BTS became the youngest recipients of the Order of Cultural Merit. Despite cultural medals traditionally being given to recipients with over 15 years of achievement, Moon recognized the group, five years into their career, for their contributions in spreading Korean culture and language worldwide.[369][370] In September 2019, BTS were mentioned by Moon while announcing strategies for the content industries, for having pioneered innovative business models through direct communication with fans.[371] In 2020, BTS received the James A. Van Fleet Award in recognition of their outstanding contributions to the promotion of US-Korea relations, the youngest honorees to receive the award.[372][373] In July 2021, they were appointed Special Presidential Envoy for Future Generations and Culture by President Moon. In their role as envoys, they help to \"raise awareness on global agendas, such as sustainable development, to our future generations and to strengthen the nation's diplomatic power across the world\"[374] and appear at international events such as the 76th United Nations General Assembly.[375] On May 31, 2022, BTS visited US President Joe Biden at the White House to discuss the recent rise in anti-Asian hate crimes and discrimination.[376]\n\nFandom\n\nAccording to Kyung Hyun Kim, BTS's rise was facilitated by a great increase in music video programming and consumption on YouTube and the coming of an idol empire, including merchandising of nonmusical products, games, and fantasy fiction, as well as an expansion of online music fandom. The group has a large, highly organized, online community of fans known as ARMY (Adorable Representative M.C. for Youth), which translates the group's lyrics and social media posts into other languages and matches charitable contributions of BTS's members. As of 2020, some 40 million ARMY members subscribe to the band's YouTube channel, with more than 30 million following the official BTS Twitter and Instagram accounts.[87] The fan community helps generate BTS's number-one chart rankings via coordinated campaigns on streaming platforms, as well as pushes to feature BTS's music on radio stations and television. Some ARMY members may even surpass the group itself in influence among BTS fans.\n\nFans at the BTS world tour concert 'Love Yourself' in Los Angeles on September 6, 2018.\n\nBTS interacted and engaged with their followers from their earliest days via social media, as well as via BTS Universe, an alternate storyline involving the members told through music videos, mobile games, books, short films, and more that gives fans room to theorize.[382] Kim suggested that ARMY are drawn to BTS since the members are seen as underdogs, originating from the Korean countryside and a relatively minor Korean entertainment company, which allows young fans to identify with them. BTS's lyrics speak to social values, and fans respond by trying to improve the world. As a result, the fandom regularly embraces activism on charitable causes and socio-political issues such as refugee crises, racial discrimination, children's rights, climate change, and the COVID-19 pandemic.[384][385] Feedback from ARMY to BTS affects the group's actions and lyrics; BTS has eliminated certain Korean words that sound like American racial slurs from their songs and ended collaboration with a Japanese producer when Korean ARMY members deemed his views extreme.\n\nPer South Korean author Jiyoung Lee, the relationship between BTS and ARMY is \"a mutual exchange between artists and their fans\" that is about more than merely \"ensuring the band's primacy\", but also \"extending the band's message of positivity into the world\". Lee opines that BTS and ARMY are \"a symbol of change in zeitgeist, not just of generational change\". The band members themselves agree and have long acknowledged their fans' role in their success. According to Sarah Keith, \"BTS embody a moment of generational transformation. ARMY represents a 'coming of age' for the young, in which cultural production and influence are global and meaningful, and where the youth are politically and socially engaged.\"\n\nOther ventures\n\nEndorsements\n\nBTS partnered with Puma beginning in 2015, initially as Puma Korea's brand ambassadors before expanding to global ambassadors in 2018, and promoting the remix of Puma's \"Turin\" and \"Sportstyle\" line worldwide.[391][392][393] In 2019, BTS signed with Fila to endorse its sportswear.[394] BTS has also served as global brand ambassadors for LG Electronics' smartphones,[395] and Hyundai Motors' 2019 flagship SUV the Hyundai Palisade[396] and hydrogen fuel cell electric SUV, the Hyundai Nexo.[397] BTS became global ambassadors of the electric street racing series Formula E to promote how electric vehicles can help combat climate change.[398] In 2020, BTS partnered with Samsung Electronics,[399] releasing a limited BTS-themed version of the Galaxy S20+ and Galaxy Buds+.[400] As the first male pop group ever to collaborate with Dior, BTS sported ensembles from Kim Jones' Pre-Fall 2019 collection at their concert at Stade de France.[401] The band became global brand ambassadors for Louis Vuitton in April 2021.[402]\n\nPhilanthropy\n\nBTS are known for their philanthropic endeavors. Several members of the band have been inducted into prestigious donation clubs, such as the UNICEF Honors Club and the Green Noble Club, in acknowledgement of the size and frequency of their donations.[403][404][405] They have also received awards for their donations, with one member receiving a Patron of the Arts Award for donations to the arts,[406] and BTS as a whole receiving a UNICEF Inspire Award for their Love Myself campaign. They often donate privately, with their patronage later being made public by the organizations they support and the media.[403][407] The band's efforts have motivated their fans to also engage in various charitable and humanitarian activities, and on occasion even match their donations.[408]\n\nAccolades\n\nBTS have received numerous awards throughout their career. They have consecutively won the Billboard Music Award for Top Social Artist since 2017; are the only K-pop group to win Top Duo/Group, at the 2019 Billboard Music Awards;[409] and are the most-awarded group in BBMA history as of 2022, with 12 wins overall.[410] BTS are also the only K-pop group to win Favorite Duo or Group – Pop/Rock and Favorite Social Artist at the American Music Awards,[411] and became the first Asian act in the show's history to win Artist of the Year in 2021.[412] They are the first Korean pop act to receive a Grammy Award nomination,[413] and the first Korean artist to be nominated for a Brit Award.[414] With 30 awards overall, including a record four consecutive wins for Artist of the Year (Asia), BTS are the most-awarded foreign artist in the history of the Japan Gold Disc Awards. They have also received a total of 50 trophies at the MAMA Awards.[415]\n\nMembers\n\nDiscography\n\nFilmography\n\nFilms\n\nOnline shows\n\nBibliography\n\nConcert tours\n\nNotes\n\n^ 15,000 attendees per day\n\nReferences\n\nCited literature\n\nFurther reading", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Citi_Field_on_August_27%2C_2013.jpg/250px-Citi_Field_on_August_27%2C_2013.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/BTS_during_a_White_House_press_conference_May_31%2C_2022_%28cropped%29.jpg/1200px-BTS_during_a_White_House_press_conference_May_31%2C_2022_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Bangtan_Boys_at_KCON_France_2016.jpg/250px-Bangtan_Boys_at_KCON_France_2016.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Troubadour_02.jpg/250px-Troubadour_02.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/170529_BTS_at_a_press_conference_for_the_BBMAs_3.jpg/250px-170529_BTS_at_a_press_conference_for_the_BBMAs_3.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Cscr-featured.svg/20px-Cscr-featured.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8c/Extended-protection-shackle.svg/20px-Extended-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/BTS_with_President_Biden_at_the_White_House_for_2022_AAPI_Heritage_Month_on_May_31%2C_2022.jpg/250px-BTS_with_President_Biden_at_the_White_House_for_2022_AAPI_Heritage_Month_on_May_31%2C_2022.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/%EB%B0%A9%ED%83%84%EC%86%8C%EB%85%84%EB%8B%A8_%EC%9B%94%EB%93%9C%ED%88%AC%EC%96%B4_%EC%BD%98%EC%84%9C%ED%8A%B8%EC%84%9C_%E2%80%98%E7%BE%8E_%EC%A0%8A%EC%9D%80_%EC%B8%B5_%EB%A7%88%EC%9D%8C_%EC%82%AC%EB%A1%9C%EC%9E%A1%EB%8A%94%EB%8B%A4%E2%80%99_%2843784972734%29.jpg/250px-%EB%B0%A9%ED%83%84%EC%86%8C%EB%85%84%EB%8B%A8_%EC%9B%94%EB%93%9C%ED%88%AC%EC%96%B4_%EC%BD%98%EC%84%9C%ED%8A%B8%EC%84%9C_%E2%80%98%E7%BE%8E_%EC%A0%8A%EC%9D%80_%EC%B8%B5_%EB%A7%88%EC%9D%8C_%EC%82%AC%EB%A1%9C%EC%9E%A1%EB%8A%94%EB%8B%A4%E2%80%99_%2843784972734%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Bangtan_Boys_at_the_Incheon_Music_Center_in_September_2013_02.jpg/250px-Bangtan_Boys_at_the_Incheon_Music_Center_in_September_2013_02.jpg", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/BTS_at_2017_American_Music_Awards_in_Los_Angeles%2C_19_November_2017_02.jpg/250px-BTS_at_2017_American_Music_Awards_in_Los_Angeles%2C_19_November_2017_02.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/BTS_performing_at_the_Korea-France_Friendship_Concert%2C_Paris_Treasure_Art_Theater%2C_14_October_2018.jpg/250px-BTS_performing_at_the_Korea-France_Friendship_Concert%2C_Paris_Treasure_Art_Theater%2C_14_October_2018.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/BTS_Love_Yourself_-_Speak_Yourself_tour_at_Rose_Bowl%2C_Pasadena_%28California%29%2C_4_May_2019_04.jpg/250px-BTS_Love_Yourself_-_Speak_Yourself_tour_at_Rose_Bowl%2C_Pasadena_%28California%29%2C_4_May_2019_04.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/BTS_during_a_White_House_press_conference_May_31%2C_2022_%28cropped%29.jpg/330px-BTS_during_a_White_House_press_conference_May_31%2C_2022_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/BTS_win_first_Daesang_%28Grand_Prize%29_at_Melon_Music_Awards%2C_19_November_2016.jpg/250px-BTS_win_first_Daesang_%28Grand_Prize%29_at_Melon_Music_Awards%2C_19_November_2016.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/180524_BTS_at_a_press_conference_for_Love_Yourself_Tear_%283%29.png/250px-180524_BTS_at_a_press_conference_for_Love_Yourself_Tear_%283%29.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Gnome-mime-sound-openclipart.svg/60px-Gnome-mime-sound-openclipart.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/20px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/BTS_at_American_Music_Awards_November_21%2C_2021.jpg/250px-BTS_at_American_Music_Awards_November_21%2C_2021.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/BTS_during_a_White_House_press_conference_May_31%2C_2022_%28cropped%29.jpg/1200px-BTS_during_a_White_House_press_conference_May_31%2C_2022_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/BTS", "title": "Wikipedia", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/BTS_during_a_White_House_press_conference_May_31%2C_2022_%28cropped%29.jpg/1200px-BTS_during_a_White_House_press_conference_May_31%2C_2022_%28cropped%29.jpg", "width": 1200, "height": 471}, "title": "BTS - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}