{"url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DeadArtistsAreBetter", "text": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DeadArtistsAreBetter\n\nnote The Skeleton Painter, by James Ensor, 1896 ...not quite what we meant.\n\n— French Frith Kaiser Thompson, \"Now That I Am Dead\" \"Now that I'm dead, I can finally make a living!\"\n\nThe vast majority of shows that mention paintings will mention this trope at one point: Artists are never recognized until after they're dead. Though this has happened in many cases, there have also been a lot of painters that were celebrated while still alive. Nor has the deceased gained fame immediately after their corpse hits the ground, as seems to happen when this trope is in effect. But nonetheless, it is a law of fiction-land that if your art is scorned and ignored while you live, it will be hung next to Picasso's or played along Mozart's when you die.\n\nIn theory, the idea that dead artists are better may result from them dying at their peak: they will be forever associated with their \"magnum opus\" rather than suffering Tough Act to Follow. They don't have time to get into an Audience-Alienating Era of divisive or low-quality work. A dead artist also can't get into more scandals or controversies, and Never Speak Ill of the Dead brings a moratorium on harsh criticism of them. And in a more general sense, an artist's death induces scarcity: since they definitely won't produce any more works, their existing ones become more precious.\n\nIn 99% of the cases where this trope is mentioned, one character, either the artist or an associate, will come up with the \"brilliant\" idea of spreading rumors of the artist's death, which immediately causes said artist's work to skyrocket in popularity and sell like hotcakes. Of course, something inevitably goes wrong, the artist is found to be alive, and the status quo is restored. Fraud accusations are seldom made.\n\nThe modern-day sentiment is probably \"Dead Musicians Are Better\". Streams of a freshly-deceased artist's songs usually skyrocket and social media can make people's opinions very apparent. (2016 was a good year-long example, although it was mostly seen about already-famous musicians getting even more popularity after death.) Posthumous Popularity Potential is the version of this trope in real-life.\n\nHistorically, this trope has affected most artists far less than people assume. Shakespeare was very successful in life, so was Beethoven. After all, only a few people would continue doing something for a long time without some kind of success. This is glaringly obvious for composers - of the top tier, only Bach and Tchaikovsky come even remotely close to this trope, and they were still far from starving in life.\n\nSee also Vindicated by History, True Art Is Ancient, and Short-Lived, Big Impact. When a dead artist is celebrated through song, it's a Celebrity Elegy. Such celebrities are good candidates to hang out in heaven. Many examples below also fall under Never Speak Ill of the Dead, in that some artists who became greatly celebrated after their death were hated or ridiculed in life.\n\nExamples:\n\nopen/close all folders\n\nAnimation\n\nIcarus and Wisemen: Alive, Icarus was made fun of. Dead, he gets all the glory: the wise men made a monument at his grave, altogether mourned him at the funeral, and started giving tours to his memorial.\n\nAnime & Manga\n\nThis trope is discussed in Case Closed. In Conan and Kaito Kid's first encounter, Kaito Kid suggests thieves are creative artists while detectives are merely art critics. Later in the case, as Conan attempts to unmask Kaito Kid's disguise: Conan Edogawa : Most talented artists gain fame only after death. I'll make you a renowned master, Kaito Kid... by burying you in a cemetery called prison .\n\nThe plot device with a faked death skyrocketing popularity and recognition is used in Galaxy Angel almost perfectly, although with a military officer instead of an artist. A similar thing happens in Cannon God Exaxxion, though in this case the people playing up the war hero's death actually believed he was dead at first. When it turns out he wasn't, rather than admitting their mistake, they decide to make it come true.\n\nIn Mega Man Star Force, Hyde is under the impression that people will not love his grim, macabre works of art until after he dies. This is a motive for his villainy in the first place, as he tries to find Mu to become immortal so that he may live to see people appreciate him. When this doesn't seem to be working out, he starts an art class for children to get them to appreciate the art when they grow older, but they all ignore him and simply come for the free food. Free food provided by Luna Platz at that, who is perhaps is his sole earnest student.\n\nIn one chapter of Pet Shop of Horrors, a has-been actor whose only success was a small role in a cult-classic sci-fi film dies of suicide by basilisk. At his funeral, people are already starting to speak of him as if he were a great actor whose immense talent was gone too soon from the world.\n\nInvoked in an episode of Sorcerer Hunters where the Villain of the Week tries to have an artist killed just to increase the value of his paintings.\n\nManjimutt from Yo-kai Watch uses this as an excuse for why he has no friends. It should be noted Manjimutt is already dead and is not even an actual artist. Manjimutt: The snowflakes are my only friends. Artists are never appreciated in their lifetime.\n\nComic Books\n\nIn Adventure Time: Marceline Gone Adrift, an evil hipster takes advantage of Marceline's apparent death to appoint himself the keeper of her memory, produce unauthorised merch, and eventually loot her house for memorabilia.\n\nIn the Doctor Who comic strip \"Interstellar Overdrive 2\" in Doctor Who Magazine, the manager of a band plans to kill them all in a spaceship 'accident' so the record company can make a fortune reissuing new editions of their back catalogue.\n\nIn MAD, in one Melvin and Jenkins feature, Melvin pockets a terminally ill boy's art, hoping that it will increase in value once the kid dies.\n\nComic Strips\n\nPlayed for Laughs in Big Nate. In one arc, Nate decides to start selling his artwork and tells neighborhood bully Chester that his artwork could possibly be more valuable after he died. Chester misinterprets it as \"I can sell Nate's art for a lot of money if Nate's dead\".\n\nThe New Yorker once ran a cartoon with a well-off couple asking a street artist \"And how much more would this be worth if you died?\"\n\nFan Works\n\nIn Claro de Luna it's mentioned that the famous cellist Colccherini wasn't well-recognized until after his death. This also foreshadows Octavia's own fate, as her lover Luna immortalizes her in history after her death.\n\nIn The Horror! The Horror! Nicolas and Perenelle Flamel, having changed their names and professions after the Philosopher's Stone was (supposedly) destroyed, discuss doing it again in the hope of finding better ones than they currently have. Nicolas: Famous artist?\n\nPerenelle: Maybe, but you'd have to die before your paintings would be worth anything.\n\nNicolas: Famous artist?Maybe, but you'd have to die before your paintings would be worth anything. Done it before. We could do it again.\n\nNicolas and Perenelle Flamel, having changed their names and professions after the Philosopher's Stone was (supposedly) destroyed, discuss doing it again in the hope of finding better ones than they currently have. In No Competition Ally consoles an eight-year-old Harry for his poor grade in art. Ally: No artist is truly famous unless they are dead, so it scarcely matters while you're alive.\n\nFilm — Live-Action\n\nLiterature\n\nLive-Action TV\n\nMusic\n\nPodcasts\n\nAre You Afraid of the Dark Universe?: In The Phantom of the Phantom of the Opera, after John Riddle is killed on Broadway production of The Phantom of the Opera, ticket sales soar despite all Broadway casts going on strike until the crime in solved.\n\nRadio\n\nDead Famous is a Radio 4 documentary strand tracing artists' posthumous careers backwards from their current fame to their death in obscurity, looking at the mechanisms that make this happen.\n\nInvoked in The Goon Show episode \"Tales of Montmartre:\" Gauguin: You can keep my paintings.\n\nToulouse-Lautrec: What good are they?\n\nGauguin: Nothing now, they'll be worth a fortune after I'm dead.\n\nToulouse-Lautrec: After you're dead... [GUNSHOT] I'm rich! You can keep my paintings.What good are they?Nothing now, they'll be worth a fortune after I'm dead.After you're dead... [GUNSHOT] I'm rich!\n\nThe Hotblack Desiato story arc in The Hitchhiker's Guide to the Galaxy (1978) has the universe-famous rock star spend a year dead for \"tax reasons\". It doesn't do his music sales any harm, either.\n\nTabletop Games\n\nIn one of the Multiple Endings for the Cyberpunk 2020 module Eurotour, the record label of rockstar Jack Entropy tries to invoke this trope by assassinating him before his self-destructive lifestyle makes him stop being profitable. The module comments \"There's no better way to make an artist popular than to have him die\" and that marketing will make Entropy \"the 21st century Jim Morrison\".\n\nTheatre\n\nA discovered play by Mark Twain, Is He Dead?, is based on the short story described above with a smattering of Attractive Bent-Gender and some rather funny Melodrama.\n\nIn Pippin, the title character tries to succeed at life by taking up art, only to discover that \"you got to be dead to you find out if you were any good.\"\n\nTimberlake Wertenbaker's play Three Birds Alighting On A Field invokes this trope repeatedly. One scene has an art dealer discussing the disappointing sales of a particular painter. The artist had died young, which the dealer mentions as a \"good thing, from a marketing point of view\".\n\nVideo Games\n\nVisual Novels\n\nThis forms part of the plot of the Visual Novel Hotel Dusk: Room 215 for the Nintendo DS; an artist who is very much alive and his partner had been exploiting this effect, getting high prices for the artist's paintings by making up a dead artist named \"Osterzone\" and saying that Osterzone was the one who painted them.\n\nWebcomics\n\nWeb Original\n\nThe Day the Music Died: The Carverquest fandom quickly turns on author Damon Lars Eldrich after finding out about the ending of the last book. As soon as his death is reported, they instantly reverse their opinions and make numerous tributes to him.\n\nThis shirt explains it rather bluntly by saying \"GET KILLED GET NOTICED\".\n\nWestern Animation", "images": ["https://tvtropes.org/images/play-button-logo.png", "https://pixel.quantserve.com/pixel/p-mEzuYq24VEJ-3.gif", "https://www.facebook.com/tr?id=850567933835915&ev=PageView&noscript=1", "https://tvtropes.org/images/tvtropes_logo_180x180.png", "https://sb.scorecardresearch.com/p?c1=2&c2=38282685&cv=3.6.0&cj=1", "https://tvtropes.org/images/logo-white-big.png", "https://static.tvtropes.org/pmwiki/pub/external_link.gif", "https://static.tvtropes.org/pmwiki/pub/images/dead_artist_3067.png"], "top_img": "https://static.tvtropes.org/pmwiki/pub/images/dead_artist_3067.png", "keywords": [], "authors": [], "canonical_link": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DeadArtistsAreBetter", "title": "Dead Artists Are Better", "meta_data": {"description": "The Dead Artists Are Better trope as used in popular culture. The vast majority of shows that mention paintings will mention this trope at one point: Artists …", "twitter": {"card": "summary_large_image", "site": "@tvtropes", "owner": "@tvtropes", "title": "Dead Artists Are Better - TV Tropes", "description": "The Dead Artists Are Better trope as used in popular culture. The vast majority of shows that mention paintings will mention this trope at one point: Artists …", "image": {"src": "https://static.tvtropes.org/pmwiki/pub/images/dead_artist_3067.png"}}, "og": {"site_name": "TV Tropes", "locale": "en_US", "title": "Dead Artists Are Better - TV Tropes", "type": "website", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DeadArtistsAreBetter", "image": "https://static.tvtropes.org/pmwiki/pub/images/dead_artist_3067.png", "description": "The vast majority of shows that mention paintings will mention this trope at one point: Artists are never recognized until after they're dead. Though this has happened in many cases, there have also been a lot of painters that were celebrated …"}, "article": {"publisher": "https://www.facebook.com/tvtropes"}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1, viewport-fit=cover", "apple-itunes-app": "app-id=6738365737, app-argument=tvtropes://home"}, "movies": [], "publish_date": null, "source": "https://tvtropes.org", "summary": ""}