{"url": "https://www.independent.co.uk/arts-entertainment/tv/news/game-of-thrones-season-7-episode-1-premiere-arya-stark-walder-frey-lady-stoneheart-books-a7846461.html", "text": "Your support helps us to tell the story Read more Support Now From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it's investigating the financials of Elon Musk's pro-Trump PAC or producing our latest documentary, 'The A Word', which shines a light on the American women fighting for reproductive rights, we know how important it is to parse out the facts from the messaging. At such a critical moment in US history, we need reporters on the ground. Your donation allows us to keep sending journalists to speak to both sides of the story. The Independent is trusted by Americans across the entire political spectrum. And unlike many other quality news outlets, we choose not to lock Americans out of our reporting and analysis with paywalls. We believe quality journalism should be available to everyone, paid for by those who can afford it. Your support makes all the difference. Read more\n\nSeason seven of Game of Thrones has arrived, bringing death to numerous characters within the very first episode.\n\n**Spoilers for the season premiere ‘Dragonstone ahead**\n\nNo scene was quite as horrific as the cold opening which saw Arya Stark murder the entire Frey family, retribution for the infamous Red Wedding.\n\nWearing Walder Frey’s face, the girl-who-now-has-a-name welcomed the character’s heir’s into the Twin’s great hall, toasting their recent success with “proper wine for proper heroes”.\n\nHowever, things quickly turn sour as the men cheer ‘Walder’ on: \"Yes, yes... cheer. Brave men, all of you. Butchered a woman, pregnant with a baby. Cut the throat of a mother of five. Slaughtered your guests after inviting them into your home.”\n\nAs the address continues, the Frey men begin to choke; they’ve been poisoned. The Lord continued: ”But you didn't slaughter every one of the Starks.\n\n“No, no, no. That was your mistake. You should have ripped them all out, root and stem. Leave one wolf alive, and the sheep are never safe.”\n\nAs they hit the floor, Arya reveals herself, turning to Walder's latest wife, telling her to deliver a message to the crown: “Tell them the North remembers. Tell them winter came for House Frey.”\n\nIt’s brutal revenge, Maisie Williams saying of the scene: “It’s so f**ked up! Even Arya is surprised she has so much power. In that last moment she’s staring out at all those men dying, she’s turned into a bit more of a monster than she’s ever realised. I don’t think she’s sad about that but she’s got it on her mind.”\n\nThe disturbing scene also brings together some story threads from George R.R. Martin's A Song of Ice and Fire series, the books on which Game of Thrones is based.\n\nAs The Hollywood Reporter explains, Arya’s revenge against the Frey’s encapsulates Lord Wyman Manderly of White Harbor’s very own revenge story from the books.\n\nMartin’s series sees Lord Manderly openly working with the Freys, Boltons, and Lannisters, while also plotting revenge for his son — lost in the Red Wedding — behind their backs.\n\nThe character kills numerous members of the Frey family and cooks them into pies, serving them up to relatives. \"The best pie you have ever tasted, my lords,\" Manderly says during A Dance with Dragons. \"Wash it down with Arbor Gold and savour every bite. I know I shall.”\n\nDuring the season six finale, Arya gives Walder a pie before slitting his throat. She then brings the Manderly storyline to a conclusion by serving the Frey sons poisoned Arbor Gold.\n\nThe second storyline the young Stark has seemingly encapsulated is Lady Stoneheart. For those unaware, Stoneheart is the reanimated corpse of Catelyn Stark — brought to life by the Brotherhood Without Banners — who exacts revenge on the Red Wedding perpetrators.\n\nWith only twelve episodes remaining, there’s almost zero chance we’ll see Stoneheart; instead, Arya has encapsulated the undead character’s quest to murder those traitors across Westeros.\n\nThe question remains of where will Arya go next? During the episode, she tells Ed Sheeran and his Lannister gang she’s heading South to “kill the Queen”. But, could we see her travelling North to Winterfell? The teaser for episode two has already revealed a likely reunion will take place, but doesn’t confirm where she’s heading.\n\nGame of Thrones airs weekly on Sky Atlantic in the UK and is available on NOW TV.", "images": ["https://www.independent.co.uk/img/logo-white-out.svg", "https://static.the-independent.com/s3fs-public/thumbnails/image/2017/07/17/11/game-of-thrones-arya.jpg?width=1200&height=800&crop=1200:800", "https://static.the-independent.com/s3fs-public/thumbnails/image/2017/07/17/11/game-of-thrones-arya.jpg"], "top_img": "https://static.the-independent.com/s3fs-public/thumbnails/image/2017/07/17/11/game-of-thrones-arya.jpg?width=1200&height=800&crop=1200:800", "keywords": [], "authors": [], "canonical_link": "https://www.independent.co.uk/arts-entertainment/tv/news/game-of-thrones-season-7-episode-1-premiere-arya-stark-walder-frey-lady-stoneheart-books-a7846461.html", "title": "Game of Thrones season 7 premiere's opening Arya scene combines two iconic storylines from the books", "meta_data": {"robots": "max-image-preview:large,max-video-preview:-1", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "News", "sitename": "The Independent", "page path": "/arts-entertainment/tv/news", "page type": "Article", "adPageType": "Article Page", "description": "'Wash it down with Arbor Gold and savour every bite'", "og": {"updated_time": "2017-07-18T13:18:48.000Z", "site_name": "The Independent", "title": "How the Game of Thrones season 7 opening scene brings together two iconic threads from the books", "url": "https://www.the-independent.com/arts-entertainment/tv/news/game-of-thrones-season-7-episode-1-premiere-arya-stark-walder-frey-lady-stoneheart-books-a7846461.html", "type": "article", "description": "'Wash it down with Arbor Gold and savour every bite'", "image": {"identifier": "https://static.the-independent.com/s3fs-public/thumbnails/image/2017/07/17/11/game-of-thrones-arya.jpg?width=1200&height=800&crop=1200:800", "secure_url": "https://static.the-independent.com/s3fs-public/thumbnails/image/2017/07/17/11/game-of-thrones-arya.jpg?width=1200&height=800&crop=1200:800"}, "locale": "en_GB"}, "article": {"published_time": "2017-07-18T13:18:48.000Z", "modified_time": "2017-07-18T13:18:48.000Z", "section": "Culture", "subsection": "TV & Radio", "author_name": "Jack Shepherd", "content_type": "story", "word_count": 888, "image_count": 1, "embed_count": 2, "video_count": 1, "internal_link_count": 1, "external_link_count": 8}, "date": "2017-07-18T13:18:48.000Z", "viewport": "width=device-width,initial-scale=1,minimum-scale=1", "theme-color": "#919191", "indy-test-internal-article-helmet": "indy", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "twitter": {"title": "How the Game of Thrones season 7 opening scene brings together two iconic threads from the books", "site": "@Independent", "card": "summary_large_image", "description": "'Wash it down with Arbor Gold and savour every bite'", "image": "https://static.the-independent.com/s3fs-public/thumbnails/image/2017/07/17/11/game-of-thrones-arya.jpg?width=1200&height=800&crop=1200:800"}, "keywords": "[\"Game of Thrones season 7\",\"Game of Thrones\",\"Arya Stark\",\"Internal\"]"}, "movies": [], "publish_date": 1500383928.0, "source": "https://www.independent.co.uk", "summary": ""}