{"url": "https://www.wanttoknow.info/newsstories-0-10000", "text": "Note: For more along these lines, see concise summaries of deeply revealing news articles on Big Tech and the disappearance of privacy from reliable major media sources.\n\n2024-08-02, New York Magazine\n\nPosted: 2024-08-05 19:56:45\n\nOn July 16, the S&P 500 index, one of the most widely cited benchmarks in American capitalism, reached its highest-ever market value: $47 trillion. 1.4 percent of those companies were worth more than $16 trillion, the greatest concentration of capital in the smallest number of companies in the history of the U.S. stock market. The names are familiar: Microsoft, Apple, Amazon, Nvidia, Meta, Alphabet, and Tesla. All of them, too, have made giant bets on artificial intelligence. For all their similarities, these trillion-dollar-plus companies have been grouped together under a single banner: the Magnificent Seven. In the past month, though, these giants of the U.S. economy have been faltering. A recent rout led to a collapse of $2.6 trillion in their market value. Earlier this year, Goldman Sachs issued a deeply skeptical report on the industry, calling it too expensive, too clunky, and just simply not as useful as it has been chalked up to be. “There’s not a single thing that this is being used for that’s cost-effective at this point,” Jim Covello, an influential Goldman analyst, said on a company podcast. AI is not going away, and it will surely become more sophisticated. This explains why, even with the tempering of the AI-investment thesis, these companies are still absolutely massive. When you talk with Silicon Valley CEOs, they love to roll their eyes at their East Coast skeptics. Banks, especially, are too cautious, too concerned with short-term goals, too myopic to imagine another world.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on AI and corporate corruption from reliable major media sources.\n\n2024-07-30, NPR\n\nPosted: 2024-08-05 19:54:24\n\nWhat if your entire economy was based on one product? For all intents and purposes, Denmark quite literally runs on Ozempic, a diabetes medication that is now widely used by consumers to lose weight. Worldwide sales have increased by over 60% in the past year alone. In the United States, which is one of its largest markets, prescriptions for Ozempic and similar drugs quadrupled between 2020 and 2022. At the end of 2023, Novo became the largest company in Europe. And its rise has eclipsed the Danish economy, creating a lot of value on the one hand, but an imbalanced economy on the other. You might have heard of \"petrostates,\" countries where fossil fuel extraction dominates the economy. By that measure, you might call Denmark a pharmastate, because Novo now dominates the Danish economy. Nearly 1 out of every 5 Danish jobs created last year was at Novo. And that's just directly. If you also include the jobs that Novo has created indirectly — like, for example, at its suppliers, or from all the newly wealthy Novo employees spending their money at shops and restaurants — nearly half of all private-sector nonfarm jobs created in Denmark can be traced back to Novo. Novo Nordisk's meteoric trajectory raises a question about economic growth that's much bigger than just Denmark: Namely, what are the risks of having one giant company driving your entire economy? And crucially, what happens if that company's fortunes take a turn for the worse?\n\nNote: The makers of these weight-loss drugs could be hit with over 10,000 lawsuits over severe adverse events from these drugs. It is now estimated that 1 in 8 adults in the US have taken Ozempic or another weight-loss drug. For more along these lines, see concise summaries of deeply revealing news articles on Big Pharma profiteering from reliable major media sources.\n\n2024-07-25, CNN News\n\nPosted: 2024-08-05 19:52:37\n\nThe top 1% has seen its wealth soar by $42 trillion over the past decade, according to a new analysis by Oxfam International, which is being released ahead of the G20 finance ministers and central bank governors’ meeting in Brazil. That’s nearly 34 times more than the bottom 50% of global population. The average net worth of the elite jumped by nearly $400,000 per person, after adjusting for inflation, compared to $335 for the bottom half of residents. “Inequality has reached obscene levels, and until now governments have failed to protect people and planet from its catastrophic effects,” said Max Lawson, Oxfam International’s head of inequality policy. “The richest one percent of humanity continues to fill their pockets while the rest are left to scrap for crumbs.” As part of its G20 presidency, the Brazilian government recently commissioned a study on raising taxes on the wealthy. The report, prepared by French economist and inequality expert Gabriel Zucman, found that a 2% minimum tax on global billionaires’ wealth would yield between $200 billion and $250 billion from about 3,000 taxpayers annually. According to the EU Tax Observatory ... the super-rich in big countries pay a far smaller share of their income in taxes than ordinary people. Plus, their wealth is taxed at effective rates of just 0%-0.5%. Finance officials from the world’s biggest countries began talks earlier this year on introducing a global minimum tax on billionaires.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on financial inequality from reliable major media sources.\n\n2024-07-25, The Hill\n\nPosted: 2024-08-05 19:51:07\n\nPesticides may cause cancer on a level equivalent to smoking cigarettes, a new study has found. The widespread use of pesticides may lead to hundreds of thousands of additional cancer cases in major corn-producing states like Iowa, Illinois, Indiana, Missouri and Ohio — even for Americans who don’t work on farms, according to findings published ... in Frontiers in Cancer Control and Society. In February, scientists from the Endocrine Society and the International Pollutants Elimination Network raised concerns that there was no safe level of exposure to many common pesticides. Research ... has tended to focus on specific pesticides, regions or cohorts of the population (like farm workers) — which obscures the fact that pesticides are used across the country, and that those exposed to any of them tend to be exposed to many of them, creating a greater compound risk. The researchers found a difference of 154,000 cancer cases per year, adjusted for population, between the area with the lowest pesticide use — the Great Plains — and that with the highest, the corn belt of the inner Midwest, where hundreds of millions of pounds of glyphosate are applied each year across millions of acres. When it came to individual cancers, pesticide use seemed to have the strongest association with blood cancers like leukemia or non-Hodgkin lymphoma. Half again as many cases of the latter appeared to be “caused by pesticides compared to smoking,” the researchers wrote.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on health and food system corruption from reliable major media sources.\n\n2024-07-25, The Lever\n\nPosted: 2024-08-05 19:48:29\n\nA new study found the amount of pesticides used on farms was strongly associated with the incidence of many cancers — not only for farmers and their families, but for entire communities. The just-released analysis showed that “agricultural pesticides can increase your risk for some cancers just as much as smoking,” says co-author Isain Zapata. Living in places with high pesticide use increased the risk of colon and pancreatic cancers by more than 80 percent. Pesticides are currently an integral part of the country’s industrialized agricultural system. About a million pounds of pesticides are used each year, across nearly every state in the country. These chemicals make their way through the food system: a pesticide linked to infertility, for example, is widely found in household staples like Cheerios. When a pesticide is first registered with federal regulators, the vast majority of the information available about it is science conducted by the company who made it. “The presumption in the U.S. is in favor of the safety of the chemical,” Burd says. Elsewhere, like the European Union, “chemicals are not presumed safe, they adopt a much more precautionary approach.” There’s also a revolving door between the [Environmental Protection Agency] and the industry it regulates. Alexandra Dunn, the former assistant administrator for the Office of Chemical Safety and Pollution Prevention, for example, is now running CropLife America, the pesticide industry’s leading lobbying group. She’s only the latest; since 1974, all of the office’s directors went on to work for pesticide companies.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on toxic chemicals and food system corruption from reliable major media sources.\n\n2023-11-03, Christian Science Monitor\n\nPosted: 2024-08-05 19:45:46\n\nAs the Monitor’s chief culture writer, Stephen Humphries stays open to a sprawling landscape of story ideas. Lately that has meant exploring empathy gaps – situations where, in some cases, groups hail the misfortune and losses of those whom they view as their ideological foes. No-tolerance side-taking has emerged over everything from the Mideast conflict to stances on policing or vaccines. That got Stephen talking to a solution-seeker on the matter of fraying human connections: Alexandra Hudson, author of \"The Soul of Civility.\" \"I am hopeful,\" she says, \"because I’ve spoken to thousands of people who are working to be part of the solutions in their every day.\" Through the power of connection, she says, “we can reclaim the soul of civility and heal our broken world.\" As these traditional touchstones of meaning in life, family, faith, friendship, community, have been on the [decline] in recent decades, more and more people have found their ultimate meaning in public life, in political issues. Now it’s easy for people to feel like their very identity is being assaulted because of that disagreement, because their identity has been misplaced in a public and political issue. Democracy depends on reasonable, deliberative discourse and conversation and debate. And if people are constantly being thrown into fight or flight mode, we’re not doing our public issues well, we’re not doing democracy well. We’re not doing life together very well. We live in this era of a strange perfectionism. We take one aspect of who a person is and extrapolate that: “OK, that’s all I need to know about who you are and what you stand for.” But that’s so reductive and it’s degrading to the dignity of the human person. Unbundling people is seeing the part in light of the whole, seeing someone’s mistakes even in light of the dignity and an irreducible worth they have as human beings.\n\nNote: Explore more positive stories like this about healing social division.\n\n2024-02-09, Christian Science Monitor\n\nPosted: 2024-08-05 19:43:37\n\nThe issue of abortion has neatly cleaved the Polish political class, yet researchers find that Poles themselves feel much more empathy around it than their elected leaders. And the idea that people hold compassion around many divisive issues presents an opportunity to bridge a societal divide, says Zofia Wodarczyk, a researcher at the social science think tank More in Common, which published a study. “We basically only talk [in politics] about abortion – are you for, or are you against, but there’s so much in between that’s gray,” she says. And when she and her colleagues interviewed voters of all stripes, they saw the gray. Even among the most staunchly conservative, religious group – about 6% of those surveyed – about a third of men and women surveyed would support someone close to them getting an abortion. The vast majority of Polish men and women of all persuasions oppose punishing women who choose abortion. Anna Wójcik, a legal scholar ... says people are ready to move past what she calls “civil war conditions,” after eight years in which the conservative majority questioned loyalty to country for simply expressing divergent views. “I feel that Polish people are tired of this polarizing political scene and division,” says Ms. Wójcik. “Basically people want to move forward, to be able to discuss topics in democracy that we have conflicting views on, like energy transition and education and stuff like that.”\n\nNote: Explore more positive stories like this about healing social division.\n\n2024-04-16, Howstuffworks.com\n\nPosted: 2024-08-05 19:41:48\n\nBetween 136.5 and 148.5 million people became casualties of war in the 20th century alone. The economics are equally staggering. For instance, U.S. spending on the wars in Iraq, Afghanistan and Pakistan could top $4 trillion. Despite the exorbitant human and financial costs, the vast majority of governments consider defense spending to be a necessity. A few renegade countries have opted to shed their militaries, however. The first country is the most recent one on our list to get rid of its armed forces. After Jean-Bertrand Aristide was elected president [of Haiti] on Dec. 16, 1990, his government was overrun by a military coup. Aristide ... moved quickly to disband Haiti's armed forces before they could pose any further problems. What prompted Costa Rica to eliminate its armed forces? In 1948, after an unusual period of political upheaval ... the new government drafted a constitution that not only guaranteed free and open elections but also abolished the country's armed forces. The island nation of Mauritius is home to more than a million people and one of the strongest economies in Africa. What you won't find, however, are regular military forces. Thanks to the deep distrust Panamanians held for the military, the government adopted a constitutional amendment disbanding the military in 1994. In 1986, Micronesia entered into a Compact of Free Association with the United States.\n\nNote: Explore more positive stories like this on healing the war machine.\n\n2024-07-09, New York Post\n\nPosted: 2024-07-29 16:04:05\n\nThe Biden administration’s Office of Refugee Resettlement failed to vet sponsors responsible for caring for unaccompanied children apprehended crossing the border, whistleblowers told Senators Tuesday, describing several cases of apparent human trafficking involving the minors and their sponsors. [Whistleblower Deborah] White revealed that she and her colleague, Tara Rodas, first discovered a case of trafficking involving minors crossing the border in June 2021, but even after reporting it, “children continued to be sent to dangerous locations with improperly vetted sponsors.” “Children were sent to addresses that were abandoned houses or nonexistent in some cases,” White said. “In Michigan, a child was sent to an open field, even after we reported making an 911 call after hearing someone screaming for help, yet the child was still sent. When I raised concerns about contractor failures and asked to see the contract I was told, ‘You’re not gonna get the contract and don’t ask for it again.’” White ... described the case of a 16-year-old girl from Guatemala, whose sponsor claimed to be her older brother. “He was touching her inappropriately. It was clear her sponsor was not her brother,” Rodas said, noting that the girl “looked drugged” and as if “she was for sale” on her sponsor’s social media postings. The sponsor had other social media accounts containing child pornography, according to Rodas, explaining that it keeps her up at night.\n\nNote: Watch our Mindful News Brief video on how the US government facilitates child trafficking at the border. For more along these lines, see concise summaries of deeply revealing news articles on immigration corruption and sexual abuse scandals from reliable major media sources.\n\n2024-07-09, News Nation\n\nPosted: 2024-07-29 16:02:03\n\nThree Republican U.S. senators and federal whistleblowers raised alarm over the government’s alleged complicity in human trafficking at the nation’s southern border. The New York Times [reported that] Health and Human Services could not reach more than 85,000 children between 2021 and 2023, adding that DHS and HHS leaders refused to attend the roundtable. Deborah White, who worked in Health and Human Services’ Unaccompanied Child Program, joined those senators in calling for justice. “Make no mistake, children were not going to their parents. They were being trafficked with billions of taxpayer dollars by a contractor failing to vet sponsors and process children safely, with government officials complicit in it,” White said at the roundtable. White began working at HHS’ Pomona, California, Office of Refugee Resettlement site in 2021, where she said she saw hundreds of children sent to unknown fates. “What I found there was horrifying and shocking, as I made [the] initial discovery at the site that children were actually being trafficked,” White told NewsNation. The last time HHS published a report on sexual abuse and sexual harassment among unaccompanied minors was in 2017. “We don’t know what happens to them afterwards, right? We never hear from them again,” White said. “Once they leave HHS or our custody, they wipe their hands of it. They’re not concerned with what’s happening to them once they leave. They’re supposed to do 30-day wellness calls, but … when they did 30-day wellness calls, the case managers were finding that the children were not anywhere to be found in most cases.”\n\nNote: Watch our Mindful News Brief video on how the US government facilitates child trafficking at the border. For more along these lines, see concise summaries of deeply revealing news articles on immigration corruption and sexual abuse scandals from reliable major media sources.\n\n2024-07-19, The Hill\n\nPosted: 2024-07-29 16:00:17\n\nEmployees of a Texas-based nonprofit that provides housing to unaccompanied migrant children repeatedly subjected minors in its care to sexual abuse and harassment, the Department of Justice (DOJ) alleged in a new lawsuit. From 2015 through at least the end of 2023, multiple employees at Southwest Key Programs, the country’s largest private provider of housing for unaccompanied children, subjected unaccompanied children in their care to “repeated and unwelcome sexual abuse, harassment, and misconduct,” the lawsuit said. Minors housed in its shelters were subjected to severe sexual abuse and rape, solicitation of sex acts, solicitation of nude photos and entreaties for sexually inappropriate relationships, among other acts. The children range in age from as young as five years old to teenagers just shy of eighteen years old. Southwest Key employees allegedly discouraged children from reporting abuse, in some cases threatening them and their families. One report describes a Southwest Key Youth Care Worker who repeatedly sexually abused a five-year-old girl, an eight-year-old girl and an eleven-year-old girl. He entered their bedrooms in the middle of the night to touch their “private area,” and threatened to kill their families if they disclosed the abuse, according to the lawsuit. The company has come under scrutiny before. Videos from Arizona Southwest Key shelters in 2018 showed staffers physically abusing children.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on immigration corruption and sexual abuse scandals from reliable major media sources.\n\n2024-07-08, Newsweek\n\nPosted: 2024-07-29 15:58:40\n\nLate last year, the U.S. Food and Drug Administration (FDA) quietly introduced a regulation that may be one of the most important shifts in how [clinical research organizations, universities large and small, pharma companies, and multi-billion dollar corporations] conduct future medical and public health research. A bedrock of ethical research design is the universal requirement of informed consent for any medical procedure, treatment, or intervention. These measures have generally been strengthened since the Nuremberg Trials, formally adopted across the U.S. government through the institutional review board (IRB) system. An IRB is a committee of specialists and administrators at each institution that oversees research design and assures the protection of research subjects. At its core, the new FDA rule change allows any IRB to broadly assume the FDA's own exemption power, dubiously granted under the 21st Century Cures Act of 2016, to grant exemptions to informed consent requirements based on \"minimal risk.\" Based on vague guidelines, it effectively gives thousands of IRB committees the unilateral ability to determine that researchers need not obtain true informed consent from research participants. The relaxed standards could facilitate the quick approval of controversial research projects. The Gates Foundation-backed Oxitec program is currently releasing millions of genetically modified mosquitos in the Florida Keys. Another application of the relaxed standards is to government-funded studies of online posts designed to identify \"misinformation.\" Entities like the Stanford Internet Observatory have laundered government demands for censorship of speech—even true speech—in online settings like Facebook and X (formerly Twitter). The literal purpose of this research is to harm its research subjects by censoring their speech and labeling them as purveyors of misinformation. In 2021, a conservative journalist sued Stanford University for slandering him via this research project, which never sought his informed consent to be a subject of their study. Under the new FDA rule, IRBs everywhere would feel no compunction to require it.\n\nNote: Read about the shocking history of human experimentation. See a disturbing timeline of corporate and government experiments that treated people like guinea pigs. For more, see concise summaries of deeply revealing news articles on corruption in science from reliable major media sources.\n\n2024-06-10, Forbes\n\nPosted: 2024-07-29 15:56:21\n\nEvery state in the U.S. requires hospitals to take a small blood sample from newborns to test for genetic diseases. In most places, the samples are destroyed or given to parents shortly after the testing, but New Jersey keeps them stored in a state facility—for 23 years—without asking for the parents’ consent. During the decades that New Jersey keeps the baby blood samples, it can do whatever it wants with the samples. In fact, on at least a few occasions, samples have been handed over to law enforcement, without consent or a warrant. There is an opt out of testing for religious objections, and parents can request the state to destroy the sample after the testing is complete. But parents don’t even know that the state is keeping the blood in the first place. This puts New Jersey out of step with other states, who in recent years were forced to end the sharing of blood samples without consent. Texas destroyed more than 5.3 million blood samples after a 2009 lawsuit revealed that the state had sold some of them to private companies and the Pentagon. Suits in Minnesota and Michigan also led those states to destroy millions of samples. The New Jersey parents aren’t suing for money. What they want is for the state to do one of three things: 1) obtain informed consent including the specific uses New Jersey may have for the samples; 2) promptly return all samples that are produced without consent; or 3) destroy all samples once the screening tests are completed.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on government corruption and the disappearance of privacy from reliable major media sources.\n\n2024-07-16, Newsweek\n\nPosted: 2024-07-29 15:54:06\n\nBeing overweight or obese is a serious, common, and costly chronic disease. More than two in five U.S. adults have obesity. By 2030, nearly one of two adults in the U.S. are projected to be obese. More than 108 million U.S. adults live with obesity and more than 1 billion people are obese around the world. Obesity accounted for nearly $173 billion in medical expenditures in 2019. Recent news that weight loss medications, including GLP-1 receptor agonists like Ozempic and others, are revolutionizing obesity medicine. Some patients lose up to 20 percent of their initial body weight in a year or two on these drugs. Yet a recent lawsuit challenging a top brand heightens concerns about this relatively new class of drugs. More than half of graduating medical students report that the time dedicated to clinical nutrition instruction is insufficient. In a striking study of 115 medical doctors, the majority of participants (65.2 percent) demonstrated inadequate nutrition knowledge, with 30.4 percent of those scoring low having a high self-perception of their nutrition knowledge. The important role of medical doctors in addressing nutrition in clinical practice has been acknowledged by multiple authoritative professional bodies. Ironically, most doctors often lack the knowledge to help a patient eat healthy and to realize the importance of food to wellness. In a contested space filled with commercial interests and influencers, it is critical for a doctor to be a reliable source of evidence-based nutrition.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on health and food system corruption from reliable major media sources.\n\n2024-07-14, The Hill\n\nPosted: 2024-07-29 15:52:01\n\nVaccine adverse effects are real. I know it makes some people uncomfortable to acknowledge this, but alongside the benefits of vaccines, there are cases of profound harm. Recently, the New York Times covered my story: “Thousands Believe COVID Vaccines Harmed Them. Is Anyone Listening?” Sadly, no one is listening yet, and very few people are willing to help. I am a research nurse practitioner who has dedicated my professional career to community health and clinical research, including vaccines. My beliefs are firmly rooted in science. Three years ago, when the COVID-19 vaccine emerged, I stepped forward to receive it. What followed was unexpected and devastating. Within hours I developed tingling along my right arm, which over days radiated across my body. A neurologist and colleague recommended that I proceed with a second dose. With the vaccine mandate from my employer at the top of my mind, I proceeded, against my own medical judgment. After the second dose, my condition rapidly worsened. I developed positional tachycardia, wildly fluctuating blood pressures, internal tremors, electrical zap sensations on my legs, intense right-sided headaches, abdominal pain and severe tinnitus. I struggle to live with all of this and more to this day. Medical gaslighting, coupled with the absence of legal recourse or adequate compensation, compounds the challenges we endure. When I reach out for help, my pleas often fall on deaf ears, or I am disparaged as a misinformed “anti-vaxxer.”\n\nNote: This article was written by Shaun Barcavage, a nurse practitioner in New York City. Explore our nuanced, uncensored investigation about this important issue. For more along these lines, see concise summaries of deeply revealing news articles on COVID vaccine problems from reliable major media sources.\n\n2024-07-17, The Conversation\n\nPosted: 2024-07-29 15:49:55\n\nAcross the world, over 800 million people spend their days hungry. More than 2 billion have limited access to food. Yet today’s global food system produces enough to feed every person on the planet. To account for these trends, we need to look at market concentration, and how a small number of very big companies have come to dominate the production and supply of the food we all eat. The global food system has become much more concentrated in recent years, partly through an increase in mergers and acquisitions, where large firms buy up rival companies until they completely dominate key areas. High levels of market concentration mean less transparency, weaker competition, and more power in the hands of fewer firms. And our research reveals that a rise in the number of mergers and acquisitions is taking place at all stages of the global food system – from seeds and fertilisers to machinery and manufacturing. This is all part of food being increasingly seen as a source not only of human sustenance, but as a profitable investment – or what is known as the “financialisation of food”. Just four firms control 44% of the global farm machinery market, two companies control 40% of the global seed market, and four businesses control 62% of the global agrochemicals market. This trend is matched in food retail, with four firms – Tesco, Sainsbury’s, Asda, and Morrisons – estimated to control over 64% of the UK grocery market.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on corruption in the food system and in the corporate world from reliable major media sources.\n\n2024-05-09, The Equation (Union of Concerned Scientists Blog)\n\nPosted: 2024-07-29 15:47:58\n\nCorporations across the food system increasingly have the power, by virtue of their size, market domination, political connections, and deep pockets, to set prices, meddle with science, evade regulation, and write the rules to benefit themselves. “Big Ag” and “Big Food” are shorthand for a sprawling collection of giant, often multinational corporations that wield enormous market power throughout our food system. Some of these companies are household names—for example, Tyson Foods, John Deere, and General Mills—while others are virtually unknown to consumers. Those lesser-known companies tend to operate up the supply chain, and include Bayer and Syngenta, which sell the seeds farmers need and the pesticides they’ve come to rely on, and Nutrien and CF Industries Holdings, which manufacture synthetic fertilizers. The consequences of extreme agriculture and food industry concentration ... include supply chain instability, unsafe working conditions and downward pressure on wages, and higher food prices for consumers. Some 40% of farmland nationally is owned, in ever-larger tracts, by absentee landlords who don’t farm but rent to others (in the Corn Belt bullseye of Iowa, it’s more than half). Billionaires, including Microsoft founder Bill Gates, are among the largest private owners of US farmland. And corporations and investment funds like Nuveen and Manulife are buying up farmland at a rate that should alarm you.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on food system corruption from reliable major media sources.\n\n2024-05-14, The Equation (Union of Concerned Scientists Blog)\n\nPosted: 2024-07-29 15:46:11\n\nEvery five years or so, Congress reauthorizes a comprehensive, multibillion-dollar law that has a major impact not only on farmers and ranchers—who make up less than 2 percent of the US population—but also on the environment, public health, and the economy. Generically called the “farm” bill, it is actually a farm and food bill that supports a wide range of programs, including ones that cover crop insurance, financial credit, and export subsidies for farmers, as well as the Supplemental Nutrition Assistance Program (SNAP), formerly known as food stamps. SNAP, which eats up 80 percent of the bills’ total budget, currently serves 41 million low-income Americans. A major ... reason farm and food bills routinely fail to live up to their original intent is the undue influence the agribusiness sector has over Congress, which it exerts via campaign contributions and lobbying. The sector includes commodity crop traders, meat and poultry processors, fertilizer and pesticide makers, multinational food and beverage companies, giant supermarket chains, and all of their related trade associations. The agribusiness sector spent more than $793 million on lobbying on a range of issues between 2019 and 2023. Top spenders included the American Crystal Sugar Company, the American Farm Bureau Federation, Koch Industries, and the US Chamber of Commerce. Agribusiness’s influence peddling is largely overlooked by the mainstream news media.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on corruption in government and in the food system from reliable major media sources.\n\n2023-10-23, Bloomberg\n\nPosted: 2024-07-29 15:43:54\n\nSomeday soon, in addition to prescribing medication or therapy, doctors may begin directing patients to visit a museum or join a choir. The growing practice of “social prescribing” is a way for healthcare providers to address patients’ health and wellbeing by connecting them to a range of nonclinical services, often taking the form of community arts and cultural activities. Attention on the healing power of the arts grew during the COVID-19 pandemic. A UK study found that during lockdown in 2020, individuals who spent 30 minutes per day on arts activities had lower rates of depression and anxiety, as well as greater life satisfaction. The first social prescribing pilots in the United States are kicking off on the heels of research demonstrating the long-term health benefits of arts engagement. Adolescents who regularly engage in arts activities have lower odds of behavioral problems, criminalized behaviors, and substance use and higher odds of maintaining strong social support networks. Creatively engaged older adults have 20% lower odds of depression and are more likely to have better memory, life satisfaction, and overall aging experiences. One particularly striking study found that older adults with frequent cultural engagement are less likely to use inpatient healthcare or nursing home stays. In a study of people experiencing chronic pain, doing monthly arts activities is associated with better physical wellbeing, specifically less difficulty with everyday activities.\n\nNote: Explore more positive stories like this about healing our bodies and healing social division.\n\n2024-04-17, New York Times\n\nPosted: 2024-07-29 15:41:59\n\nA practice called social prescribing is being explored in the United States, after being adopted in more than 20 other countries. Social prescriptions generally aim to improve health and well-being by connecting people with nonclinical activities that address underlying problems, such as isolation, social stress and lack of nutritious food, which have been shown to play a crucial role in influencing who stays well and for how long. For Ms. Washington, who is among thousands of patients who have received social prescriptions from the nonprofit Open Source Wellness, the experience was transformative. She found a less stressful job, began eating more healthfully and ... was able to stop taking blood pressure medication. At the Cleveland Clinic, doctors are prescribing nature walks, volunteering and ballroom dancing. In Newark, an insurance provider has teamed up with the New Jersey Performing Arts Center to offer patients glassblowing workshops, concerts and museum exhibitions. A nonprofit in Utah is connecting mental health patients with community gardens and helping them participate in other activities that bring them a sense of meaning. Universities have started referring students to arts and cultural activities like comedy shows and concerts. Research on social prescribing suggests that it can improve mental health and quality of life and that it might reduce doctor visits and hospital admissions.\n\nNote: Explore more positive stories like this about healing our bodies and healing social division.\n\n2024-07-18, Broadview\n\nPosted: 2024-07-29 15:39:54\n\nDr. Kate Mulligan is the Senior Director of the Canadian Institute for Social Prescribing (CISP), a new national hub created to support health care providers and social services professionals to connect people to non-clinical supports and community resources. Mulligan ... led one of Canada’s first social prescribing projects. \"They have a conversation with someone with expertise [like a doctor] to determine a plan, and get support to follow through on something non-clinical that benefits their health. It should be happening systematically, as a regular part of our health system,\" [said Mulligan]. Someone experiencing food insecurity or an illness like diabetes can be prescribed fresh foods. That could mean a voucher for your local farmers’ market, a food box delivery to your home or a credit card that you can spend at the regular grocery store. Social prescribing also means making sure the provided food is culturally appropriate ... thinking about possible connections to include and benefit local farmers. A small community largely inhabited by retirees — lots of people ending up living alone without a strong support network — implemented social prescribing. An older man was diagnosed with depression after his wife died. He kept going for primary care, but really what he was experiencing was unsupported grief. Through social prescribing, he was connected with a fishing rod and a fishing buddy. This is like a $20 intervention. Within a fairly short time, he got off his medication and reconnected with other services too — built friendships, got connected to other community offerings. The health centre started developing their own services, like grief support cooking classes for older grieving widows.\n\nNote: Explore more positive stories like this about healing our bodies and healing social division.\n\n2024-07-14, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2024-07-21 19:37:15\n\nThe Ukrainian military has used AI-equipped drones mounted with explosives to fly into battlefields and strike at Russian oil refineries. American AI systems identified targets in Syria and Yemen for airstrikes earlier this year. The Israel Defense Forces used another kind of AI-enabled targeting system to label as many as 37,000 Palestinians as suspected militants during the first weeks of its war in Gaza. Growing conflicts around the world have acted as both accelerant and testing ground for AI warfare while making it even more evident how unregulated the nascent field is. The result is a multibillion-dollar AI arms race that is drawing in Silicon Valley giants and states around the world. Altogether, the US military has more than 800 active AI-related projects and requested $1.8bn worth of funding for AI in the 2024 budget alone. Many of these companies and technologies are able to operate with extremely little transparency and accountability. Defense contractors are generally protected from liability when their products accidentally do not work as intended, even when the results are deadly. The Pentagon plans to spend $1bn by 2025 on its Replicator Initiative, which aims to develop swarms of unmanned combat drones that will use artificial intelligence to seek out threats. The air force wants to allocate around $6bn over the next five years to research and development of unmanned collaborative combat aircraft, seeking to build a fleet of 1,000 AI-enabled fighter jets that can fly autonomously. The Department of Defense has also secured hundreds of millions of dollars in recent years to fund its secretive AI initiative known as Project Maven, a venture focused on technologies like automated target recognition and surveillance.\n\nNote:Learn more about emerging warfare technology in our comprehensive Military-Intelligence Corruption Information Center. For more, see concise summaries of deeply revealing news articles on AI from reliable major media sources.\n\n2024-07-18, The Hill\n\nPosted: 2024-07-21 19:35:08\n\nAccording to the American Psychological Association, “Misinformation is false or inaccurate information — getting the facts wrong. Disinformation is false information which is deliberately intended to mislead — intentionally misstating the facts.” What we’ve seen over the past several years is our government purveying disinformation — deliberately misleading the public. When our government peddles disinformation, it undermines the public trust. That’s why only 22 percent of Americans say they trust the government. Hillary Clinton’s campaign made and paid for the Russian collusion hoax, which asserted that Donald Trump had “worked with the Russians to try to rig the 2016 election,” to quote then-House Judiciary Chairman Jerrold Nadler (D-N.Y.). Clinton and her campaign ... were working behind the scenes with government agents — including the FBI and elected Democrats — to spread disinformation. Several operatives within the FBI were promoting the hoax and giving it the appearance of fact, which allowed the media to cover the issue ad infinitum. One FBI agent, Kevin Clinesmith, even lied to the FISA Court so the government could continue monitoring the phone calls of U.S. citizens. The hoax cost taxpayers millions of dollars, first with the Mueller Report and then the Durham Report. Yet no collusion was found, just disinformation. Retired Dr. Anthony Fauci, who served as director of the National Institute of Allergy and Infectious Diseases ... [asserted] the natural origin of the COVID-19 virus. Several years later, there is a widespread assumption that the virus leaked from the Wuhan Virility Institute in China. Fauci did not want people to believe the lab-leak theory, perhaps because he and others had worked with and provided federal funds to that laboratory.\n\nNote: Watch our 15-min Mindful News Brief video on the strong evidence that bioweapons research created COVID-19. For more along these lines, see concise summaries of deeply revealing news articles on government corruption and media manipulation from reliable sources.\n\n2024-07-11, The Hill\n\nPosted: 2024-07-21 19:31:57\n\nAfter government officials like former White House advisers Rob Flaherty and Andy Slavitt repeatedly harangued platforms such as Facebook to censor Americans who contested the government’s narrative on COVID-19 vaccines, Missouri and Louisiana sued. They claimed that the practice violates the First Amendment. Following years of litigation, the Supreme Court threw cold water on their efforts, ruling in Murthy v. Missouri that states and the individual plaintiffs lacked standing to sue the government for its actions. The government often disguised its censorship requests by coordinating with ostensibly “private” civil society groups to pressure tech companies to remove or shadow ban targeted content. According to the U.S. House Weaponization Committee’s November 2023 interim report, the Cybersecurity and Infrastructure Security Agency requested that the now-defunct Stanford Internet Observatory create a public-private partnership to counter election “misinformation” in 2020. This consortium of government and private entities took the form of the Election Integrity Partnership (EIP). EIP’s “private” civil society partners then forwarded the flagged content to Big Tech platforms like Facebook, YouTube, TikTok and Twitter. These “private” groups ... receive millions of taxpayer dollars from the National Science Foundation, the State Department and the U.S Department of Justice. Legislation like the COLLUDE Act would ... clarify that Section 230 does not apply when platforms censor legal speech “as a result of a communication” from a “governmental entity” or from an non-profit “acting at the request or behest of a governmental entity.”\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on censorship and government corruption from reliable sources.\n\n2024-05-15, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2024-07-21 19:28:56\n\nRazish [is] a fake village built by the US army to train its soldiers for urban warfare. It is one of a dozen pretend settlements scattered across “the Box” (as in sandbox) – a vast landscape of unforgiving desert at the Fort Irwin National Training Center (NTC), the largest such training facility in the world. Covering more than 1,200 square miles, it is a place where soldiers come to practise liberating the citizens of the imaginary oil-rich nation Atropia from occupation by the evil authoritarian state of Donovia. Fake landmines dot the valleys, fake police stations are staffed by fake police, and fake villages populated by citizens of fake nation states are invaded daily by the US military – wielding very real artillery. It operates a fake cable news channel, on which officers are subjected to aggressive TV interviews, trained to win the media war as well as the physical one. Recently, it even introduced internal social media networks, called Tweeter and Fakebook, where mock civilians spread fake news about the battles – social media being the latest weapon in the arsenal of modern war. Razish may still have a Middle Eastern look, but the actors hawking chunks of plastic meat and veg in the street market speak not English or Arabic, but Russian. This military role-playing industry has ballooned since the early 2000s, now comprising a network of 256 companies across the US, receiving more than $250m a year in government contracts. The actors are often recent refugees, having fled one real-world conflict only to enter another, simulated one.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on military corruption from reliable major media sources.\n\n2024-07-02, Reuters\n\nPosted: 2024-07-21 19:26:47\n\nOnlyFans makes reassuring promises to the public: It’s strictly adults-only, with sophisticated measures to monitor every user, vet all content and swiftly remove and report any child sexual abuse material. Reuters documented 30 complaints in U.S. police and court records that child sexual abuse material appeared on the site between December 2019 and June 2024. The case files examined by the news organization cited more than 200 explicit videos and images of kids, including some adults having oral sex with toddlers. In one case, multiple videos of a minor remained on OnlyFans for more than a year, according to a child exploitation investigator who found them while assisting Reuters. OnlyFans “presents itself as a platform that provides unrivaled access to influencers, celebrities and models,” said Elly Hanson, a clinical psychologist and researcher who focuses on preventing sexual abuse and reducing its impact. “This is an attractive mix to many teens, who are pulled into its world of commodified sex, unprepared for what this entails.” In 2021 ... 102 Republican and Democratic members of the U.S. House of Representatives called on the Justice Department to investigate child sexual abuse on OnlyFans. The Justice Department told the lawmakers three months later that it couldn’t confirm or deny it was investigating OnlyFans. Contacted recently, a department spokesperson declined to comment further.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on sexual abuse scandals from reliable major media sources.\n\n2024-07-13, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2024-07-21 19:24:47\n\nJonathan Haidt is a man with a mission ... to alert us to the harms that social media and modern parenting are doing to our children. His latest book, The Anxious Generation: How the Great Rewiring of Childhood Is Causing an Epidemic of Mental Illness ... writes of a “tidal wave” of increases in mental illness and distress beginning around 2012. Young adolescent girls are hit hardest, but boys are in pain, too. He sees two factors that have caused this. The first is the decline of play-based childhood caused by overanxious parenting, which allows children fewer opportunities for unsupervised play and restricts their movement. The second factor is the ubiquity of smartphones and the social media apps that thrive upon them. The result is the “great rewiring of childhood” of his book’s subtitle and an epidemic of mental illness and distress. You don’t have to be a statistician to know that ... Instagram is toxic for some – perhaps many – teenage girls. Ever since Frances Haugen’s revelations, we have known that Facebook itself knew that 13% of British teenage girls said that their suicidal thoughts became more frequent after starting on Instagram. And the company’s own researchers found that 32% of teen girls said that when they felt bad about their bodies, Instagram made them feel worse. These findings might not meet the exacting standards of the best scientific research, but they tell you what you need to know.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on Big Tech and mental health from reliable major media sources.\n\n2024-07-14, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2024-07-21 19:22:44\n\nToxic PFAS “forever chemicals” used in lithium ion batteries essential to the clean energy transition present a dangerous source of chemical pollution that new research finds threatens the environment and human health. The multipronged, peer-reviewed study zeroed in on a little-researched and unregulated subclass of PFAS called bis-FASI that are used in lithium ion batteries. Researchers found alarming levels of the chemicals in the environment near manufacturing plants, noted their presence in remote areas around the world, found they appear to be toxic to living organisms, and discovered that waste from batteries disposed of in landfills was a major pollution source. PFAS are a class of about 16,000 human-made compounds most often used to make products resistant to water, stains and heat. They are called “forever chemicals” because they do not naturally break down and have been found to accumulate in humans. The chemicals are linked to cancer, birth defects, liver disease, thyroid disease, plummeting sperm counts and a range of other serious health problems. The paper notes that few end-of-life standards for PFAS battery waste exist, and the vast majority ends up in municipal dumps where it can leach into waterways, accumulate locally or be transported long distances. It looked at the presence of the chemicals in historical leachate samples and found none in those from prior to the mid-1990s, when the chemical class was commercialized.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on toxic chemicals from reliable major media sources.\n\n2024-06-11, BBC News\n\nPosted: 2024-07-21 19:20:35\n\nA court in the United States has found multinational fruit company Chiquita Brands International liable for financing a Colombian paramilitary group. The group, the United Self-Defence Forces of Colombia (AUC), was designated by the US as a terrorist organisation at the time. Following a civil case brought by eight Colombian families whose relatives were killed by the AUC, Chiquita has been ordered to pay $38.3m (£30m) in damages to the families. The AUC engaged in widespread human rights abuses in Colombia, including murdering people it suspected of links with left-wing rebels. The victims ranged from trade unionists to banana workers. The case was brought by the families after Chiquita pleaded guilty in 2007 to making payments to the AUC. During the 2007 trial, it was revealed that Chiquita had made payments amounting to more than $1.7m to the AUC in the six years from 1997 to 2004. The banana giant said that it began making the payments after the leader of the AUC at the time, Carlos Castaño, implied that staff and property belonging to Chiquita's subsidiary in Colombia could be harmed if the money was not forthcoming. The AUC claimed to have been created to defend landowners from ... left-wing rebels, the paramilitary group more often acted as a death squad for drug traffickers. At its height, it had an estimated 30,000 members who engaged in intimidation, drug trafficking, extortion, forced displacement and killings.\n\nNote: Read more about Chiquita's payments to this Colombian paramilitary group. Chiquita succeeded the United Fruit Company, which once owned most of the land in Guatemala and had close ties with the CIA. When Guatemala's democratically elected president aimed to nationalize land, US covert operations installed a military dictator, returning the land to United Fruit. This led to a bloody 40-year civil war and a series of repressive military regimes, armed with CIA-funded weapons.\n\n2024-07-09, The Intercept\n\nPosted: 2024-07-21 19:17:49\n\nReal estate companies are making an explicit appeal to wartime patriotism, leading with the conflict as a selling point and a reason to invest. In late June, a company called My Israel Home hosted an expo at a Los Angeles synagogue catering to a specific clientele: Jewish Americans looking to buy a new home in Israel — or on illegal Israeli settlements in the occupied West Bank. Similar real estate fairs have popped up across North America this year ... and several have faced protests as the war on Gaza has brought the issue of Israeli settlements and Palestinian sovereignty to the fore. On websites largely tailored for Jewish American buyers looking to move to Israel, prospective homeowners can browse properties that include listings for homes in settlement communities, which offer the typical trappings of suburban life. Around a dozen real estate firms have participated in real estate fairs organized by My Israel Home across North America this year. Six of these firms are actively marketing at least two dozen separate properties for sale located within eight different West Bank and East Jerusalem settlements, according to their online listings. Other real estate firms commonly list dozens of West Bank properties on their sites. West Bank settlements have long drawn criticism from the international community, which regards the settlements as illegal, in violation of Article 49 of the Geneva Conventions. Criticism of settlements have only intensified in recent months amid a spike in settler violence against Palestinians in the occupied territory.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on corruption in government and in the corporate world from reliable major media sources.\n\n2024-04-16, Rolling Stone\n\nPosted: 2024-07-21 19:16:02\n\nProject Gunrunner [was] a nationwide initiative launched in Laredo, Texas, in 2005, which sought to reduce the smuggling of firearms across the U.S. southern border. But while the primary tactic of Gunrunner was the interdiction of buyers and sellers who were violating the laws, [ATF] agents in Phoenix had other plans. They wanted to see where the guns went if they were allowed to cross the border — to follow the small fish until they caught bigger ones. Agents named their operation “Fast and Furious,” after the popular movie about car racing. Between September 2009 and December 2010, a joint task force comprised of federal officials from ATF, FBI, DEA, and ICE, working under the U.S. Attorney’s Office for the District of Arizona, let over two thousand guns “walk” to Mexico. The murder that made the flawed operation public and political in the United States was of an American citizen on US soil: the killing of US Border Patrol agent Brian Terry. Though the investigators could not identify the specific gun that fired the bullet, two AK-47 style WASR-10 rifles were recovered at the scene. Both were traced to ... one of the straw purchasers the agents were monitoring under the Fast and Furious operation. ATF agents who shared their experiences during interviews conducted by a congressional committee admitted they knew that the only way they would learn the whereabouts of the guns they let go would be when Mexican law enforcement recovered them at crime scenes.\n\nNote: Read more about the thousands of illegal guns American officials allowed into Mexico during Operation Fast and Furious. For more along these lines, see concise summaries of deeply revealing news articles on government corruption from reliable major media sources.\n\n2024-06-15, Positive News\n\nPosted: 2024-07-21 19:13:50\n\nIn A Band of Brothers, we believe that, when a man is willing to hold himself accountable and be supported by his community, magic can happen. And if you ask me what healthy masculinity looks like, it’s that. A man who has been arrogant, ignorant, selfish, rageful ... in short, who has made mistakes (and show me a human who hasn’t), having the courage to step into the circle and say: ‘I need help’. And other men holding him accountable without ever closing their hearts to him. I have compassion for all the men I meet who are still so focused on their own wounds that they cannot lift their heads to see the wounds of others. Suicide is the biggest killer of men under 50 in the UK, which is the acute end of a much wider men’s mental health crisis. The young men who come to us are often torn between competing pressures: an old story about needing to be tough, to make money, to dominate, and a newer one about needing to be gentle, to value more than money, to stop dominating, to renounce the old values. Compassion and accountability – you need both. And the compassion comes first. I am still struck by the words of the young man who said: “No-one had ever actually asked me why I was angry.” He had also never been in a space where he was taught the difference between healthy anger, which is a natural and vital human emotion, and unhealthy anger, which leads to violence against yourself or others.\n\nNote: This article was written by Conroy Harris, founder of A Band of Brothers. Explore more positive stories like this about healing social division.\n\n2024-07-16, Positive News\n\nPosted: 2024-07-21 19:12:11\n\nThe No One Dies Alone (NODA) movement ... trains and supports volunteers to act as companions to people in the last hours of their lives. Award-winning Scottish nurse Alison Bunce was among the first to pioneer the concept in the UK, but as her team kept bedside vigils in homes, hospitals and hospices she began to ask herself: might they help people have good lives, too? “Being present and accompanying someone as they’re dying is such a privilege – it’s a profound, unique moment,” says Bunce. “But over the years, people were speaking to me about social isolation and loneliness, and I realised this was about life as well as death.” She set up Compassionate Inverclyde (CI) as a project funded by Ardgowan Hospice – where she worked as director of care – and recruited an initial 20 volunteers who could sit with people who were dying alone, initially in the hospice and a local hospital, but eventually in their own homes. Bunce soon realised her volunteers could do more and began curating a range of community care services which operate alongside healthcare professionals and support people at various stages of life. “Our very ethos is about being kind, and how ordinary people can make a difference together,” she says. Volunteers might lend a hand and a friendly ear to new mums, create ‘back home parcels’ for hospital leavers, visit socially isolated neighbours or keep the tea flowing out at CI’s bereavement cafe.\n\nNote: Explore more positive stories about human interest topics.\n\n2024-06-27, Yale Environment 360\n\nPosted: 2024-07-21 19:10:33\n\nDanielle Stevenson ... has been pioneering a nature-based technique for restoring contaminated land, using fungi and native plants to break down toxins like petroleum, plastics, and pesticides into less toxic chemicals. The usual way of dealing with tainted soil is to dig it up and cart it off to distant landfills. In a recent pilot project funded by the city of Los Angeles, Stevenson ... working with a team of UC Riverside students and other volunteers, significantly reduced petrochemical pollutants and heavy metals at an abandoned railyard and other industrial sites in Los Angeles. Stevenson says she believes her bioremediation methods can be scaled up to clean polluted landscapes worldwide. \"Decomposer fungi can degrade petrochemicals the same way they would break down a dead tree,\" [said Stevenson]. \"And in doing so, they reduce the toxicity of these petrochemicals and create soil that no longer has these contaminants or has much reduced concentrations of it. They can also eat plastic and other things made out of oil. People who live in a place impacted by pollution need to have a say in how their neighborhood is being cleaned up. We need to empower them with the tools to do this. That’s why along with doing these studies and pilot projects, I’ve been running workforce development programs. Potentially, they could bring economic opportunities and benefits to the community in addition to cleaning up the contaminated site.\"\n\nNote: Explore more positive stories like this about healing the Earth.\n\n2024-07-06, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2024-07-16 13:20:50\n\nRecall ... takes constant screenshots in the background while you go about your daily computer business. Microsoft’s Copilot+ machine-learning tech then scans (and “reads”) each of these screenshots in order to make a searchable database of every action performed on your computer and then stores it on the machine’s disk. “Recall is like bestowing a photographic memory on everyone who buys a Copilot+ PC,” [Microsoft marketing officer Yusuf] Mehdi said. “Anything you’ve ever seen or done, you’ll now more or less be able to find.” Charlie Stross, the sci-fi author and tech critic, called it a privacy “shit-show for any organisation that handles medical records or has a duty of legal confidentiality.” He also said: “Suddenly, every PC becomes a target for discovery during legal proceedings. Lawyers can subpoena your Recall database and search it, no longer being limited to email but being able to search for terms that came up in Teams or Slack or Signal messages, and potentially verbally via Zoom or Skype if speech-to-text is included in Recall data.” Faced with this pushback, Microsoft [announced] that Recall would be made opt-in instead of on by default, and also introducing extra security precautions – only producing results from Recall after user authentication, for example, and never decrypting data stored by the tool until after a search query. The only good news for Microsoft here is that it seems to have belatedly acknowledged that Recall has been a fiasco.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on Big Tech and the disappearance of privacy from reliable major media sources.\n\n2024-07-01, The BMJ (Formerly British Medical Journal)\n\nPosted: 2024-07-16 13:18:59\n\nDuring his final three years at the US Food and Drug Administration the physician scientist Doran Fink’s work focused on reviewing covid-19 vaccines. But a decade after joining the agency Fink had accepted a job with Moderna, the covid vaccine manufacturer. As he left for the private sector, the FDA’s ethics programme staff emailed him guidelines on post-employment restrictions, “tailored to your situation.” The email, obtained by The BMJ under a freedom of information request, explained that, although US law prohibits a variety of types of lobbying contact, “they do not prohibit the former employee from other activities, including working ‘behind the scenes.’” The legal ability to work “behind the scenes” is enshrined in federal regulations and highlights a “critical, critical loophole” in US revolving door policy. Craig Holman, a government affairs lobbyist for the organisation Public Citizen, told The BMJ that the rules forbid various forms of direct lobbying contact but permit lobbying activity that is indirect. “So, people will leave government service and can immediately start doing influence peddling and lobbying,” Holman explained. “They can even run a lobbying campaign, as long as they don’t actually pick up the telephone and make the contact with their former officials.” A majority of former FDA reviewers take up jobs in industry. Since 2000 every FDA commissioner, the agency’s highest position, has gone on to work for industry.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on corruption in government and in Big Pharma from reliable major media sources.\n\n2024-06-29, Washington Post\n\nPosted: 2024-07-16 13:16:32\n\nA Supreme Court ruling against the opioid company Purdue Pharma ... substantially raised the bar for executives and owners trying to shield their wealth. Johnson & Johnson, Boy Scouts of America and Rite Aid are among the entities trying to handle a vast number of lawsuits in bankruptcy court, seeking to resolve all claims in a single settlement. These proceedings have echoes of the Purdue Pharma case decided by the Supreme Court on Thursday, in which the Sackler family, which owns the bankrupt opioid-maker, offered plaintiffs about $6 billion of the $11 billion they extracted from the company. In exchange, family members would have received immunity from future lawsuits, without filing for bankruptcy themselves. A 5-4 Supreme Court held that settlement was inadequate. Its ruling threw the massive bankruptcy case against Purdue Pharma into doubt after years of court battles over the company’s role in the nation’s opioid epidemic. The decision also adds a fresh wrinkle to a controversial legal strategy, called the Texas two-step, in which companies use a Texas law to split into separate companies and shift a large volume of legal claims onto the newly created entity. In the second step, the entity carrying the lawsuits files for bankruptcy and seeks to release its parent organization from all liability in exchange for a payout. Johnson & Johnson transferred some of its assets and all of the legal claims against it over asbestos-tainted talcum powder into a new legal entity that filed for Chapter 11. Boy Scouts of America ... agreed to pay $2.5 billion to settle claims of sexual abuse in bankruptcy court, a deal that shields from future litigation insurance companies as well as schools, churches and community organizations involved with the nonprofit.\n\nNote: For more like this, read about how powerful corporations use the bankruptcy system to dodge lawsuits over sexual abuse and deadly products. Along US opioid industry lines, read how the industry operated like a drug cartel. Watch our Mindful News Brief video on how the deadly War on Drugs protects the activities of the rich and powerful: military-intelligence interests within the US government, big banks, Big Pharma, and drug cartels.\n\n2024-06-27, The Intercept\n\nPosted: 2024-07-16 13:14:08\n\nThe Senate Select Committee on Intelligence submitted its 6,700-page “torture report” about the CIA to the White House in April 2014. More than 10 years later, the full report remains secret after a federal appellate court dismissed a lawsuit I filed in the hopes of forcing its release. The document “includes comprehensive and excruciating detail” about the CIA’s “program of indefinite secret detention and the use of brutal interrogation techniques,” the late Sen. Dianne Feinstein, who chaired the Senate intelligence committee at the time, wrote in a 2014 summary. “The full report details how the CIA lied to the public, the Congress, the president, and to itself about the information produced by the torture program,” said Tom Blanton, director of the National Security Archive at George Washington University. So far, efforts to obtain the torture report using the federal Freedom of Information Act have been unsuccessful. In late 2016, despite the CIA director’s objections, former President Barack Obama placed a copy in his presidential papers. But that copy is not subject to FOIA until 2029 — 12 years after Obama left office. The CIA and a handful of federal agencies also have copies of the torture report, although the Trump administration returned several of these to the Senate intelligence committee vaults in 2017. The Obama, Trump, and Biden administrations all fought strenuously against FOIA requests for these agencies’ copies.\n\nNote: The above was written by media law attorney Shawn Musgrave. No one been charged in connection with the unethical CIA torture program. Many of the architects and enablers of the program are now in powerful and esteemed positions in academia, high levels of government, the federal judiciary, and more. For more, read the \"10 Craziest Things in the Senate Report on Torture\" and check out our summary on US torture programs in our comprehensive Military-Intelligence Corruption Information Center.\n\n2023-08-12, Wall Street Journal\n\nPosted: 2024-07-16 13:11:53\n\nIn the early days of America’s war on terror, U.S. authorities detained Ahmed Rabbani thinking he was someone else. They soon realized their mistake. Rabbani ... was never charged with a crime. Rabbani’s lawyer says he ... was taken by Pakistani authorities who misidentified him and handed him over to U.S. intelligence officers for a $5,000 reward. Rabbani [was] a taxi driver in Karachi. He spoke three languages—Urdu, Arabic and English. When he was detained, on Sept. 10, 2002, Rabbani didn’t know his wife was pregnant. He said he found out about it three years later from a letter—the first communication he had received from her since his detention. He met his 20-year-old son, Jawwad, for the first time upon his return to Pakistan in February. After 18½ years at Guantanamo Bay, he stepped off a plane in Pakistan in February—a free but broken man. Years of hunger strikes and force feeding have left him unable to eat most solid food. “I never, never, ever sleep at night,” he said. His only means of escape was art. By the time of his release, he had made hundreds of paintings. In May, 20 of Rabbani’s paintings were shown at a gallery in the Pakistani city of Karachi. Rabbani said he was transferred several times to camps in Pakistan and Afghanistan known as black sites—secret CIA interrogation facilities. There, he said, he was tortured until he told his captors anything he thought they wanted to hear. A total of 779 men were at some point detained [at Guantanamo]. Like Rabbani, most were eventually released without ever having been charged with a crime. Rabbani says he doesn’t expect he will ever fully recover, physically or mentally. “Some things will never be fixed,” he said.\n\nNote: Read more about Guantanamo Bay's horrors. Check out the incredible ships created by Moath al-Alwi, another prisoner held at Guantánamo Bay without charges since 2002. The Pentagon has declared that art produced at Guantánamo Bay belongs to the US government, and not the artists. Authorities have refused to release the artworks from prison.\n\n2024-06-22, The Intercept\n\nPosted: 2024-07-16 13:09:12\n\nLast week, the Biden administration said it would allow the Azov Brigade, a Ukrainian military unit, to receive U.S. weaponry and training, freeing it from a purported ban imposed in response to concerns that it committed human rights violations and had neo-Nazi ties. A photo posted by the unit itself, however, seems to suggest that the U.S. was providing support as far back as December of last year. The photo, in tandem with the administration’s own statements, highlights the murky nature of the arms ban, how it was imposed, and under what U.S. authority. Two mechanisms could have barred arms transfers: a law passed by Congress specifically prohibiting assistance to Azov, and the so-called Leahy laws that block support to units responsible for grave rights violations. The State Department said this month that weapon shipments will now go forward after a Leahy law review, but won’t comment on if and when a Leahy ban was in effect. The congressional prohibition, the U.S. says, does not apply because it barred assistance to the Azov Battalion, a predecessor to the Azov Brigade. The original unit had earned scrutiny for alleged human rights violations and ties to neo-Nazi and white supremacist ideologies. The U.S. has not made clear about when the apparent ban started, but a deputy Azov commander and media reports indicate some type of prohibition has been in effect for nearly a decade — though the congressional ban has only been in effect since 2018.\n\nNote: Facebook changed its censorship policies to permit calls for the death of Russian soldiers and praise for the Azov Battalion. Learn more about US covert military support for Neo-Nazis in our comprehensive Military-Intelligence Corruption Information Center.\n\n2024-07-08, Futurism\n\nPosted: 2024-07-16 13:06:53\n\nA growing number of supermarkets in Alabama, Oklahoma, and Texas are selling bullets by way of AI-powered vending machines, as first reported by Alabama's Tuscaloosa Thread. The company behind the machines, a Texas-based venture dubbed American Rounds, claims on its website that its dystopian bullet kiosks are outfitted with \"built-in AI technology\" and \"facial recognition software,\" which allegedly allow the devices to \"meticulously verify the identity and age of each buyer.\" As showcased in a promotional video, using one is an astoundingly simple process: walk up to the kiosk, provide identification, and let a camera scan your face. If its embedded facial recognition tech says you are in fact who you say you are, the automated machine coughs up some bullets. According to American Rounds, the main objective is convenience. Its machines are accessible \"24/7,\" its website reads, \"ensuring that you can buy ammunition on your own schedule, free from the constraints of store hours and long lines.\" Though officials in Tuscaloosa, where two machines have been installed, [said] that the devices are in full compliance with the Bureau of Alcohol, Tobacco, Firearms and Explosives' standards ... at least one of the devices has been taken down amid a Tuscaloosa city council investigation into its legal standing. \"We have over 200 store requests for AARM [Automated Ammo Retail Machine] units covering approximately nine states currently,\" [American Rounds CEO Grant Magers] told Newsweek, \"and that number is growing daily.\"\n\nNote: Facial recognition technology is far from reliable. For more along these lines, see concise summaries of deeply revealing news articles on artificial intelligence from reliable major media sources.\n\n2024-06-14, Lee Fang on Substack\n\nPosted: 2024-07-16 13:03:43\n\nHigh-level former intelligence and national security officials have provided crucial assistance to Silicon Valley giants as the tech firms fought off efforts to weaken online monopolies. John Ratcliffe, the former Director of National Intelligence, Brian Cavanaugh, a former intelligence aide in the White House, and [former White House National Security Advisor Robert] O'Brien jointly wrote to congressional leaders, warning darkly that certain legislative proposals to check the power of Amazon, Google, Meta, and Apple would embolden America's enemies. The letter left unmentioned that the former officials were paid by tech industry lobbyists at the time as part of a campaign to suppress support for the legislation. The Open App Markets App was designed to break Apple and Google's duopoly over the smartphone app store market. The companies use their control over the app markets to force app developers to pay as much as 30 percent in fees on every transaction. Breaking up Apple and Google’s hold over the smartphone app store would enable greater free expression and innovation. The American Innovation and Choice Online Act similarly encourages competition by preventing tech platforms from self-preferencing their own products. The Silicon Valley giants deployed hundreds of millions of dollars in lobbying efforts to stymie the reforms. For Republicans, they crafted messages on national security and jobs. For Democrats, as other reports have revealed, tech giants paid LGBT, Black, and Latino organizations to lobby against the reforms, claiming that powerful tech platforms are beneficial to communities of color and that greater competition online would lead to a rise in hate speech.The lobbying tactics have so far paid off. Every major tech antitrust and competition bill in Congress has died over the last four years.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on intelligence agency corruption and Big Tech from reliable major media sources.\n\n2024-07-08, Reason\n\nPosted: 2024-07-16 13:01:09\n\nIn May, the New York State government agreed to subsidize news media. The legislation allows tax credits for up to half of journalists' salaries. Not every outlet can write off employment costs. Excluded ... are nonprofit operations as well as those owned by publicly traded companies. Governments have tried to suppress dissenting views. If a massive chunk of journalists' income comes from one reliable source—government coffers—they'll inevitably treat government as the audience to please rather than locals who've proven difficult to court and who distrust the press. Under such subsidies, the future of local media could be one of well-funded media outlets ignored by their nominal communities as they produce reports tailored for the tastes of bureaucrats with funding power. That's been an ongoing problem with publicly funded journalism. \"In Europe, we have seen governments harm the reputation and independence of public media to the point of limiting their citizens' access to differing points of view,\" Freedom House research analyst Jessica White wrote. In December, a report from The Future of Free Speech, an independent think tank ... warned, \"the global landscape for freedom of expression has faced severe challenges in 2023. Even open democracies have implemented restrictive measures.\" The report documented how obsession with \"hate speech,\" \"terrorist content,\" and \"disinformation\" are wielded as bludgeons by officials against critics of government officials and their policies.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on government corruption and media manipulation from reliable sources.\n\n2024-06-04, Public on Substack\n\nPosted: 2024-07-16 12:58:50\n\nStarting in 2016, United States government intelligence agencies, news media, and establishment leaders in both political parties warned of a vast Russian conspiracy to interfere in elections. Every major allegation proved to be wrong or profoundly misleading. According to every serious political scientist, Russia had no measurable influence in the 2016 elections. According to intelligence and security services, the news media, and establishment political leaders across the Western World, Russia is currently interfering in European elections by secretly bribing conservative politicians. Yesterday, the Washington Post repeated the claim. But neither the government agencies nor the news media have produced any evidence to support their accusations, and every single individual accused of taking money from the Russians has denied it. What we are witnessing appears to be establishment politicians weaponizing government intelligence agencies to interfere in Europe’s elections, with the active participation of mainstream German NGOs and news media companies. The weaponization of government by politicians and intelligence agencies should terrify us all. Just because you’re not the victim in this particular case, either because you’re not European or conservative, is no reason to think that what’s happening couldn’t affect you and the people you love and care about in the future.\n\nNote: Read about the 2016 leak of DNC documents that was blamed on Russian Hackers. For more along these lines, see concise summaries of deeply revealing news articles on intelligence agency corruption from reliable major media sources.\n\n2024-06-19, Colorado Sun\n\nPosted: 2024-07-16 12:56:19\n\nMore than 800 people were selected to participate in the Denver Basic Income Project while they were living on the streets, in shelters, on friends’ couches or in vehicles. They were separated into three groups. Group A received $1,000 per month for a year. Group B received $6,500 the first month and $500 for the next 11 months. And group C, the control group, received $50 per month. About 45% of participants in all three groups were living in a house or apartment that they rented or owned by the study’s 10-month check-in point, according to the research. The number of nights spent in shelters among participants in the first and second groups decreased by half. And participants in those two groups reported an increase in full-time work, while the control group reported decreased full-time employment. Parents of kids under 18 ... reported statistically significant improvements in “parental distress” after receiving money for 10 months. Researchers tallied an estimated $589,214 in savings on public services, including ambulance rides, visits to hospital emergency departments, jail stays and shelter nights. The $9.4 million project was funded by a mix of public and private money, including $1.5 million from The Colorado Trust and $2 million from the city of Denver’s pot of federal pandemic relief money.\n\nNote: Explore more positive stories about reimagining the economy and healing social division.\n\n2024-07-04, Good News Network\n\nPosted: 2024-07-16 12:54:16\n\nThe U.S. Marshals Service (USMS), along with federal, state, and local agencies led a six-week national operation that resulted in finding 200 critically missing children, which includes endangered runaways and those abducted by noncustodial persons. This is the second rendition of this coordinated effort, and so it was called Operation We Will Find You 2 (WWFY2). Running from May 20 to June 24 it focused on geographical areas with high clusters of missing children. WWFY2 resulted in the recovery and removal of 123 children from dangerous situations. An additional 77 missing children were located and found to be in safe locations, according to law enforcement or child welfare agencies. These so-called dangerous situations involved human trafficking, captivity by family relations, or situations of sexual exploitation, some involuntarily and others violently. “One of the most sacred missions of U.S. Marshals Service is locating and recovering our nation’s critically missing children,” said USMS Director Ronald L. Davis on completion of the case. “This is one of our top priorities as there remain thousands of children still missing and at risk.” Some of the most notable and frightening cases can be read on the USMS release of the operation, and included kidnapping in Michigan, human trafficking in Miami-Dade, sex trafficking in Arizona, familial kidnapping in Oregon, and potential infanticide in North Carolina.\n\nNote: Explore more positive stories about ending human trafficking.\n\n2024-06-30, CNN News\n\nPosted: 2024-07-16 12:52:04\n\nRecent high school graduate Suborno Isaac Bari, 12, plans to start studying math and physics at New York University in the fall. “I hope to graduate college at 14 in spring 2026,” said Suborno, who recently became the youngest graduate from his Long Island high school. The gifted tween, who memorized the periodic table at 2 years old and has taught lectures at colleges in India since he was 7, graduated on Wednesday from Malverne High School in Nassau County, New York. The bright young student, whose family says he’s also skilled in painting, debate and playing the piano, could also be making history at NYU when he begins pursuing his bachelor of science degree. A university spokesperson informed the Bari family “NYU is unaware of anyone younger than Suborno being admitted,” according to a copy of an email shared with CNN. In 2016, then-President Barack Obama sent Suborno a letter praising the bright student for his hard work and accomplishments. The family shared a copy of the letter with CNN. In 2020 when he was 7, Suborno began receiving invitations from colleges in India to teach, which he does three times a year. “That gives him lots of chances to have conversations with different levels of expertise, students, faculties, college presidents, so many people,” [father] Rashidul Bari said. Suborno plans to continue his family’s trend of teaching by one day becoming a math and physics professor.\n\nNote: Explore more positive stories about human interest topics.\n\n2024-06-29, USA Today\n\nPosted: 2024-07-11 15:09:06\n\n“El Flaco” ... works as a mercenary, he said, and had come to discuss a closely guarded secret of Mexico’s most powerful cartels: The FGM 148 Javelin infrared-guided, missile launcher. El Flaco maintains he has been trained to perform special operations using shoulder-fired weapons, including the Javelin. He said he now trains others to use it as well. If El Flaco is telling the truth, Javelins would be among the most extreme examples of the escalation in the arms race between cartels and Mexican military. Cartels’ arsenals now include belt-fed gatling guns, drone bombs and land mines. The U.S.-made Javelin is the most sophisticated shoulder-fired missile launcher in the world, with a range of a mile and a half. Its main purpose is to destroy military tanks, but it also has the capacity to take down low-flying helicopters. There are holes in the U.S. tracking system. During the Iraq War in 2003, the department lost track of 35 Javelins provided to Iraqi allied forces. ISIS was found to have a Javelin in Syria, Kurdish fighters there also obtained a Javelin and the weapon was found at a Libyan warlord base. Since 2018, the Mexican government has reported seizing a dozen rocket launchers and 56 grenade launchers from cartels. Thomas Brandon with the U.S. Bureau of Alcohol, Tobacco, Firearms and Explosives said it was clear that “criminal organizations and drug cartels based in Mexico continue to look towards the United States as a source of supply for firearms and in this case military grade weapons such as grenades, machine guns, and Man-Portable Air Defense.”\n\nNote: American officials allowed thousands of illegal guns to be trafficked into Mexico during Operation Fast and Furious. For more, see concise summaries of deeply revealing news articles on military corruption from reliable major media sources.\n\n2024-06-19, Forbes\n\nPosted: 2024-07-11 15:06:38\n\nTwenty years ago, FedEx established its own police force. Now it's working with local police to build out an AI car surveillance network. The shipping and business services company is using AI tools made by Flock Safety, a $4 billion car surveillance startup, to monitor its distribution and cargo facilities across the United States. As part of the deal, FedEx is providing its Flock surveillance feeds to law enforcement, an arrangement that Flock has with at least four multi-billion dollar private companies. Some local police departments are also sharing their Flock feeds with FedEx — a rare instance of a private company availing itself of a police surveillance apparatus. Such close collaboration has the potential to dramatically expand Flock’s car surveillance network, which already spans 4,000 cities across over 40 states and some 40,000 cameras that track vehicles by license plate, make, model, color and other identifying characteristics, like dents or bumper stickers. Jay Stanley ... at the American Civil Liberties Union, said it was “profoundly disconcerting” that FedEx was exchanging data with law enforcement as part of Flock’s “mass surveillance” system. “It raises questions about why a private company ... would have privileged access to data that normally is only available to law enforcement,” he said. Forbes previously found that [Flock] had itself likely broken the law across various states by installing cameras without the right permits.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on AI and the disappearance of privacy from reliable major media sources.\n\n2024-06-24, Washington Post\n\nPosted: 2024-07-11 15:03:37\n\nThe U.S. Postal Service has shared information from thousands of Americans’ letters and packages with law enforcement every year for the past decade, conveying the names, addresses and other details from the outside of boxes and envelopes without requiring a court order. Postal Service officials have received more than 60,000 requests from federal agents and police officers since 2015. Each request can cover days or weeks of mail sent to or from a person or address, and 97 percent of the requests were approved. The surveillance technique, known as the mail covers program, has long been used by postal inspectors to help track down suspects or evidence. The practice is legal, and the inspectors said they share only what they can see on the outside of the mail. [Sen. Ron] Wyden said in a statement, “Thousands of Americans are subjected to warrantless surveillance each year, and ... the Postal Inspection Service rubber stamps practically all of the requests they receive.” He also criticized the agency for “refusing to raise its standards and require law enforcement agencies monitoring the outside of Americans’ mail to get a court order, which is already required to monitor emails and texts.” Anxieties over postal surveillance are classically American. In 1798, Vice President Thomas Jefferson wrote in a letter that his fears of having his private communications exposed by the “infidelities of the post office” had stopped him from “writing fully & freely.”\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on police corruption and the disappearance of privacy from reliable major media sources.\n\n2024-06-30, New York Times\n\nPosted: 2024-07-11 15:01:27\n\nDavid Metcalf’s last act in life was an attempt to send a message — that years as a Navy SEAL had left his brain so damaged that he could barely recognize himself. He shot himself in the heart, preserving his brain to be analyzed by a state-of-the-art Defense Department laboratory in Maryland. The lab found an unusual pattern of damage seen only in people exposed repeatedly to blast waves. The vast majority of blast exposure for Navy SEALs comes from firing their own weapons, not from enemy action. The damage pattern suggested that years of training intended to make SEALs exceptional was leaving some barely able to function. At least a dozen Navy SEALs have died by suicide in the last 10 years. A grass-roots effort by grieving families delivered eight of their brains to the lab. Researchers discovered blast damage in every single one. The damage may be just as widespread in SEALs who are still alive. A Harvard study ... scanned the brains of 30 career Special Operators and found an association between blast exposure and altered brain structure and compromised brain function. The more blast exposure the men had experienced, the more problems they reported with health and quality of life. Doctors treating the injured troops give them diagnoses of psychiatric disorders that miss the underlying physical damage. Much of what is categorized as post-traumatic stress disorder may actually be caused by repeated exposure to blasts.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on military corruption from reliable major media sources.\n\n2024-06-06, The Intercept\n\nPosted: 2024-07-11 14:59:11\n\nRussia is to blame for coups in the African Sahel, according to a new analysis by the Pentagon’s top Africa researcher, which ignores the U.S. role in training leaders of these mutinies — and two decades of failed U.S. counterterrorism policies in the region. A series of reports by The Intercept found that military personnel who had received U.S. support were involved in coups in Burkina Faso (in 2014, 2015, and twice in 2022), Mali (in 2012, 2020, and 2021), and Niger (in 2023). U.S.-supported officers also played a role in coups in Mauritania (2008), Gambia (2014), Chad (2021), and Guinea (2021). The total number of U.S.-trained mutineers across Africa since 9/11 may be far higher than is known, but the State Department, which tracks data on U.S. trainees, is either unwilling or unable to supply it. The Pentagon is mandated to provide a briefing on coups carried out by U.S.-trained African partners to the Senate and House Armed Services committees but missed its March deadline. Throughout all of Africa, the State Department counted a total of just nine terrorist attacks in 2002 and 2003, the first years of U.S. counterterrorism assistance in the Sahel. Last year, the number of violent events in Burkina Faso, Mali, and Niger alone reached 3,716, according to the Armed Conflict Location & Event Data Project, a crisis monitoring organization. This represents a jump of more than 41,000 percent.\n\nNote: Learn more about how war is a tool for hidden agendas in our comprehensive Military-Intelligence Corruption Information Center. For more, see concise summaries of deeply revealing news articles on military corruption from reliable major media sources.\n\n2024-06-26, New York Post\n\nPosted: 2024-07-11 14:55:52\n\nA recent audit of Pentagon funding of gain-of-function research outside the US “may have shielded” collaborations with Chinese biotech firms — including at least one linked to Beijing’s military, a Republican senator alleged. Sen. Roger Marshall (R-Kan.) pressed Defense Secretary Lloyd Austin for answers about redactions that had concealed the firms — WuXi AppTec, Pharmaron Beijing Co., and Genscript Inc. — from public scrutiny in the audit, according to a letter. “American taxpayers deserve transparency about the programs they are funding, and I am disappointed this OIG report does not provide that accountability,” Marshall wrote. According to the Defense Department Office of Inspector General audit, more than $15.5 million in grants between 2014 and 2023 flowed through subrecipients to “contracting research organization[s] in China or other foreign countries for research related to potential enhancement of pathogens of pandemic potential.” However, the 20-page audit cited “significant limitations with the adequacy of data” — and said the Pentagon “did not track funding at the level of detail necessary to determine whether the DoD provided funding ... for the gain-of-function experiments. Such research is classified as “offensive biological work” by the Pentagon, which Marshall said “raises questions” about National Institutes of Health (NIH) officials having admitted this year to funding gain-of-function experiments at the ... Wuhan Institute of Virology.\n\nNote: Watch our 15-min Mindful News Brief video on the strong evidence that bioweapons research created COVID-19. For more along these lines, see concise summaries of deeply revealing news articles on COVID-19 and military corruption from reliable major media sources.\n\n2024-07-01, CNN News\n\nPosted: 2024-07-11 14:52:42\n\nFlorida prosecutors heard graphic testimony about how the late millionaire and financier Jeffrey Epstein sexually assaulted teenage girls two years before they cut a plea deal, according to transcripts released Monday of the 2006 grand jury investigation. Epstein’s ties to the rich and the powerful seems to have allowed him to continue to rape and sex traffic teenagers. Transcripts show that the grand jury heard testimony that Epstein, who was then in his 40s, had raped teenage girls as young as 14 at his Palm Beach mansion. The teenagers testified and told detectives they were also paid to find him more girls. After the grand jury investigation, Epstein cut a deal with South Florida federal prosecutors in 2008 that allowed him to escape more severe federal charges and instead plead guilty to state charges of procuring a person under 18 for prostitution and solicitation of prostitution. He was sentenced to one and a half years in the Palm Beach County jail system, followed by a year of house arrest. He was required to register as a sex offender. According to the transcripts, Palm Beach Police Det. Joe Recarey testified in July 2006 that the initial investigation began when a woman reported in March 2005 that her stepdaughter who was in high school at the time said she received $300 in exchange for “sexual activity with a man in Palm Beach,” Recarey testified. Another teenager ... told detectives that she was 17 years old when she was approached by a friend who said she could make $200 by providing a massage at Epstein’s home. Epstein told her that he would pay her if she brought other “girls” to his home. “And he told her, ‘The younger, the better,’” Recarey said.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on Jeffrey Epstein's child sex ring from reliable major media sources.\n\n2024-05-31, NewsNation\n\nPosted: 2024-07-11 14:50:39\n\nRetired Army Col. Karl Nell claims nonhuman intelligence not only exists and has been to Earth but has been actively interacting with humanity. Nell has a long career with the Army, has worked for aerospace companies and was the former director of the UAP Task Force, which investigated anomalous phenomena for the Pentagon. He isn’t the only senior figure to have come forward, with other senior figures like former Deputy Undersecretary of Defense Christopher Mellon and retired Navy Admiral Tim Gallaudet also making many of the same points Nell did. Interest in UFOs and extraterrestrials has spiked since former intelligence officer David Grusch came forward with claims the Pentagon is operating a secret UFO retrieval program. Grusch said he had heard credible stories of the program from officials he spoke to during his time on the UAP Task Force. He said that not only is the program being kept secret from the American public, it is also being concealed from Congress. A bipartisan UFO Caucus has also formed in Congress, with lawmakers hearing several classified briefings. Many, including de facto caucus leader Rep. Tim Burchett, R-Tenn., have been skeptical of the information offered in those briefings. Burchett has repeatedly suggested the government is purposefully siloing information and relying on private contractors to prevent Congress from getting the full picture of what is going on.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on UFOs from reliable major media sources. Then explore the excellent, reliable resources provided in our UFO Information Center.\n\n2024-04-15, The Hill\n\nPosted: 2024-07-11 14:47:59\n\nInteractions between UFOs and ultra-sensitive U.S. nuclear assets date back nearly eight decades. New Mexico ... is the site of a remarkable number of baffling, unsolved UFO incidents. In late 1948, for example, dozens of pilots, defense personnel and scientists associated with the famed Los Alamos and Sandia nuclear weapons programs began seeing mysterious “green fireballs” in the sky. Such objects were frequently observed flying on a perfectly horizontal trajectory, often moving directly toward nearby aircraft. In 1979, the New York Times and the Washington Post had reported on a series of alarming incidents at key nuclear weapons facilities in the United States. The incidents involved “unknown entities and brightly lighted, fast-moving vehicles that hovered over nuclear weapons storage areas and evaded all pursuit efforts.” The unnerving events have notable parallels to allegations by former Air Force missile officers, that UFOs had rendered nuclear weapons inoperable at Minot Air Force Base in 1966 and Malmstrom Air Force Base in 1967. Astronomer J. Allen Hynek, the Air Force’s long-time scientific consultant on UFOs, described how an unknown object high above Minot’s nuclear silos interfered with a missile command station’s communications equipment in August 1966. A local Minot, N.D., newspaper reported the extraordinary incident.\n\nNote: Read more about UFO interference with nuclear missiles. For more along these lines, see concise summaries of deeply revealing news articles on UFOs from reliable major media sources. Then explore the e", "images": ["https://www.wanttoknow.info/article-images/14166.jpg", "https://www.wanttoknow.info/article-images/14162.jpg", "https://www.wanttoknow.info/article-images/14086.jpg", "https://www.wanttoknow.info/m/images/social-youtube.png", "https://www.wanttoknow.info/article-images/14141.jpg", "https://www.wanttoknow.info/article-images/14105.jpg", "https://www.wanttoknow.info/article-images/14103.jpg", "https://www.wanttoknow.info/article-images/1241.jpg", "https://www.wanttoknow.info/article-images/14161.jpg", "https://www.wanttoknow.info/m/images/menu.png", "https://www.wanttoknow.info/m/images/wtk-header1.png", "https://www.wanttoknow.info/article-images/14094.jpg", "https://www.wanttoknow.info/article-images/14127.jpg", "https://www.wanttoknow.info/article-images/14023.jpg", "https://www.wanttoknow.info/article-images/14164.jpg", "https://www.wanttoknow.info/article-images/14203.jpg", "https://www.wanttoknow.info/article-images/12977.jpg", "https://www.wanttoknow.info/images/wtk-art1.png", "https://www.wanttoknow.info/article-images/12887.jpg", "https://www.wanttoknow.info/article-images/14189.jpg", "https://www.wanttoknow.info/article-images/9182.jpg", "https://www.wanttoknow.info/article-images/14100.jpg", "https://www.wanttoknow.info/article-images/14208.jpg", "https://www.wanttoknow.info/article-images/13256.jpg", "https://www.wanttoknow.info/article-images/14066.jpg", "https://www.wanttoknow.info/article-images/14085.jpg", "https://www.wanttoknow.info/article-images/14109.jpg", "https://www.wanttoknow.info/m/images/social-youtube-color.png", "https://www.wanttoknow.info/m/images/social-twitter-color.png", "https://www.wanttoknow.info/article-images/14126.jpg", "https://www.wanttoknow.info/article-images/14124.jpg", "https://www.wanttoknow.info/article-images/14134.jpg", "https://www.wanttoknow.info/article-images/12759.jpg", "https://www.wanttoknow.info/m/images/wtk-og.jpg", "https://www.wanttoknow.info/article-images/14171.jpg", "https://www.wanttoknow.info/article-images/3401.jpg", "https://www.wanttoknow.info/article-images/14087.jpg", "https://www.wanttoknow.info/article-images/14204.jpg", "https://www.wanttoknow.info/m/images/social-fb.png", "https://www.wanttoknow.info/article-images/13255.jpg", "https://www.wanttoknow.info/article-images/19.jpg", "https://www.wanttoknow.info/article-images/14172.jpg", "https://www.wanttoknow.info/article-images/14195.jpg", "https://www.wanttoknow.info/article-images/1937.jpg", "https://www.wanttoknow.info/article-images/14026.jpg", "https://www.wanttoknow.info/article-images/13990.jpg", "https://www.wanttoknow.info/article-images/14150.jpg", "https://www.wanttoknow.info/m/images/wtk-logo.png", "https://www.wanttoknow.info/article-images/846.jpg", "https://forms.aweber.com/form/displays.htm?id=rAzMTEzs7Bws", "https://www.wanttoknow.info/m/images/social-twitter.png", "https://www.wanttoknow.info/m/images/menu-close.png", "https://www.wanttoknow.info/article-images/14120.jpg", "https://www.wanttoknow.info/article-images/14191.jpg", "https://www.wanttoknow.info/article-images/14200.jpg", "https://www.wanttoknow.info/article-images/14186.jpg", "https://www.wanttoknow.info/article-images/14209.jpg", "https://www.wanttoknow.info/article-images/14028.jpg", "https://www.wanttoknow.info/article-images/13972.jpg", "https://www.wanttoknow.info/article-images/14057.jpg", "https://www.wanttoknow.info/article-images/14132.jpg", "https://www.wanttoknow.info/article-images/14207.jpg", "https://www.wanttoknow.info/article-images/14219.jpg", "https://www.wanttoknow.info/article-images/14160.jpg", "https://www.wanttoknow.info/article-images/14217.jpg", "https://www.wanttoknow.info/m/images/social-fb-color.png", "https://www.wanttoknow.info/m/images/rss.jpg", "https://www.wanttoknow.info/m/images/social-insta-color.png", "https://www.wanttoknow.info/article-images/14088.jpg", "https://www.wanttoknow.info/article-images/14163.jpg", "https://www.wanttoknow.info/article-images/13999.jpg", "https://www.wanttoknow.info/article-images/296.jpg", "https://www.wanttoknow.info/article-images/13900.jpg", "https://www.wanttoknow.info/article-images/14210.jpg", "https://www.wanttoknow.info/article-images/14146.jpg", "https://www.wanttoknow.info/article-images/14075.jpg", "https://www.wanttoknow.info/article-images/14218.jpg", "https://www.wanttoknow.info/article-images/14089.jpg", "https://www.wanttoknow.info/article-images/placeholder.jpg", "https://www.wanttoknow.info/article-images/9962.jpg", "https://www.wanttoknow.info/m/images/social-insta.png", "https://www.wanttoknow.info/article-images/14133.jpg", "https://www.wanttoknow.info/article-images/14008.jpg", "https://www.wanttoknow.info/article-images/14206.jpg", "https://www.wanttoknow.info/article-images/13880.jpg", "https://www.wanttoknow.info/article-images/762.jpg", "https://www.wanttoknow.info/article-images/896.jpg", "https://www.wanttoknow.info/article-images/14090.jpg", "https://www.wanttoknow.info/article-images/14155.jpg", "https://www.wanttoknow.info/article-images/13923.jpg", "https://www.wanttoknow.info/article-images/14125.jpg", "https://www.wanttoknow.info/article-images/14131.jpg", "https://www.wanttoknow.info/article-images/14111.jpg"], "top_img": "https://www.wanttoknow.info/m/images/wtk-og.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.wanttoknow.info/newsstories-0-10000", "title": "News Stories", "meta_data": {"description": "News stories: Excerpts from highly revealing major media news stories suggest major cover-ups of health, energy, media, 9/11, war, elections, and more. Links to original stories provided for easy verification.", "keywords": "news,articles,9/11,911,elections,energy,inventions,financial,global,warming,government,health,mass,media,,information,polls,able,danger,avian,flu,corporate,corruption,dolphins,whales,hurricane,katrina,income,inequality,inspirational,microchips,mind,control,nature,reality,non-lethal,nonlethal,privacy,secrecy,secret,societies,terrorism,ufos,vaccines,war", "og": {"title": "WantToKnow.info", "description": "Want to know the truth? Key media articles and reliable, information-packed summaries on major cover-ups for those who want to know the truth on health, banking, energy, media, elections, war, 9/11.", "image": "https://www.wanttoknow.info/m/images/wtk-og.jpg", "type": "article", "url": "https://www.wanttoknow.info/newsstories-0-10000"}, "viewport": "width=device-width, initial-scale=1", "ROBOTS": "INDEX,FOLLOW", "Revisit-after": "21 days", "rating": "general", "google-site-verification": "93poa4ULbuO4k4m5pcOzlCUyZF-QR_CMpiv-eFUo8sw"}, "movies": [], "publish_date": null, "source": "https://www.wanttoknow.info", "summary": ""}