{"url": "https://people.com/music/beyonce-jay-z-relationship-timeline/", "text": "\"Crazy in Love,\" indeed!\n\nThroughout their 20-plus year relationship, Beyoncé and JAY-Z have seen it all. From a secret wedding and infidelity rumors to smash collaborations and adventures in parenting, the fiercely private pair continue to claim the throne of music's First Family. Since marrying in April 2008, the Grammy Award winners have welcomed three children: daughter Blue Ivy (born in 2012) and twins Rumi and Sir (born in 2017).\n\nIn her 2013 documentary Life Is But a Dream, Beyoncé spoke about having her first child with JAY-Z and what that meant for their relationship.\n\n\"This baby has made me love him more than I ever thought I could love another human being,\" she said. \"It's just that I love him so much that we almost feel like one. I don't know how to describe it.\"\n\nIn December 2024, JAY-Z was accused of raping a 13-year-old girl in 2000 alongside Sean \"Diddy\" Combs in a civil lawsuit. He publicly denied the allegations in a statement posted on X (formerly Twitter).\n\nFrom their first collaboration on \"'03 Bonnie and Clyde\" to starting a family, here's everything you need to know about Beyoncé and JAY-Z's relationship.\n\n1999–2000: Beyoncé and JAY-Z first meet\n\nDestiny's Child (from left: LaTavia Roberson, LeToya Luckett, Beyoncé Knowles and Kelly Rowland) arrive at the Royal Albert Hall for the MOBO Awards on Oct. 6, 1999. Michael Crabtree/PA Images/Getty Images\n\nThe former Destiny's Child star previously told Seventeen that they met when she was 18, which would have been between September of 1999 and August of 2000.\n\n2000–2001: Beyoncé and JAY-Z start dating\n\nJAY-Z and Beyoncé at 'Saturday Night Live' on Nov. 2, 2002, for an episode on which JAY-Z was the musical guest. Mary Ellen Matthews/NBCU Photo Bank/NBCUniversal\n\nThe pair began dating when Beyoncé was 19 after getting to know each other. \"We were friends first for a year and a half before we went on any dates,\" she later told Oprah Winfrey in an OWN interview. \"We were on the phone for a year and a half, and that foundation is so important for a relationship. Just to have someone who you just like is so important, and someone [who] is honest.\"\n\nNovember 2001: Beyoncé and JAY-Z appear together on the cover of Vanity Fair\n\nThe couple appeared together on the cover of Vanity Fair's November 2001 music issue. JAY-Z later told the magazine that they \"were just beginning to try to date each other\" at the time, adding: \"Well, you know, you've got to try first. You got to dazzle ... wine and dine,\" and that he had his work cut out for him pursuing her. \"She's a charming Southern girl, you know, she's not impressed... But I would have definitely had to be this cool.\"\n\nOctober 10, 2002: JAY-Z releases \"'03 Bonnie & Clyde\" featuring Beyoncé\n\nJAY-Z and Beyoncé on 'Total Request Live'. KMazur/WireImage\n\nIn 2002, JAY-Z released the song \"'03 Bonnie & Clyde,\" featuring Beyoncé. The next month, they filmed the music video in Mexico, which also starred the late Lance Reddick and was nominated for best hip-hop video at the 2003 MTV Video Music Awards.\n\nMay 14, 2003: Beyoncé releases \"Crazy in Love\" featuring JAY-Z\n\nBeyoncé dropped her \"Crazy in Love\" music video featuring JAY-Z in 2003, and the duo went on to win the best R&B song and best rap/sung collaboration awards at the 2004 Grammys.\n\nDespite rumors, the track's obvious hints and their explosive onscreen chemistry, the pair still hadn't gone public with their romance at the time — advice they fielded from Oprah Winfrey!\n\n\"I remember the first time you were on the Oprah show, I told you, 'Don't go around telling people who you're dating,'\" the talk show legend recalled in her 2013 catch-up with Beyoncé.\n\nAugust 29, 2004: Beyoncé and JAY-Z make their red carpet debut\n\nJAY-Z and Beyoncé on the red carpet for the 2004 MTV Video Music Awards at the American Airlines Arena in Miami, Fla. SGranitz/WireImage\n\nBeyoncé and JAY-Z made their red carpet debut at the 2004 MTV VMAs in Miami, where they both took home Moonmen.\n\nSeptember 1, 2006: Beyoncé releases B'Day with two songs featuring JAY-Z\n\nBeyoncé and JAY-Z at the 2006 MTV Video Music Awards at Radio City Music Hall in New York City on Aug. 31, 2006. Billy Farrell/Patrick McMullan\n\nBeyoncé dropped her second solo LP, B'Day, on her 25th birthday. The chart-topper included two more collabs with JAY-Z: \"Déjà Vu\" and \"Upgrade U.\"\n\nNovember 21, 2006: JAY-Z releases Kingdom Come including the song \"Hollywood\" featuring Beyoncé\n\nJAY-Z released Kingdom Come in 2006, which included yet another Beyoncé duet titled \"Hollywood.\"\n\nApril 4, 2008: Beyoncé and JAY-Z get married\n\nJAY-Z and Beyoncé kiss on their wedding day. Beyoncé — 'All Night'\n\nJAY-Z and Beyoncé got married in a top-secret, super-intimate ceremony on April 4, 2008.\n\n\"It was a very emotional wedding — lots of crying — and really very spiritual,\" a source told PEOPLE at the time of the soirée, held at the rapper's 13,500-sq.-ft. Manhattan penthouse and decorated with 70,000 dendrobium orchids flown in from Thailand.\n\nWhile the pair kept their marriage under wraps at first, Beyoncé later opened up about their nuptials and their relationship leading up to the big day.\n\n\"There was no rush — no one expected me to run off and get married,\" she told Seventeen. \"I really don't believe that you will love the same thing when you're 20 as you do at 30. So that was my rule: Before the age of 25, I would never get married. I feel like you have to get to know yourself, know what you want, spend some time by yourself, and be proud of who you are before you can share that with someone else.\"\n\nAugust 2008: JAY-Z confirms marriage to Beyoncé in an interview\n\nJAY-Z finally confirmed his marriage to Beyoncé in a September 2008 Vibe cover story — and opened up about why they kept it quiet for so long.\n\n\"That's ridiculous for me to confirm,\" he told the mag. \"I don't have … I'm gonna say, I think that was a ridiculous question. I just think it's really a part of your life that you gotta keep to yourself … You have to, or you'll go insane in this type of business. You have to have something that's sacred to you and the people around you … I shared so much of my life, my childhood, and my family, the death of my nephew with the world. I should have something to hold on to. You need something for your sanity to say, 'Okay, I could chill out, and this is it.'\"\n\nNovember 2008: Beyoncé talks about marriage to JAY-Z\n\nJAY-Z and Beyoncé arrive at the presidential inauguration at the U.S. Capitol in Washington, D.C., on Jan. 21, 2013, for U.S. President Barak Obama's reelection ceremony. Win McNamee/AFP/Getty Images\n\nBeyoncé spoke about her marriage in her December-January 2008 Seventeen cover story.\n\n\"I guess probably that we're all human,\" she told the magazine of what she's learned from her relationship. \"I don't care if you're picture-perfect on every magazine cover, and you're the most handsome, successful, coolest guy — you still get sad, and you still get your feelings hurt, and you still get confused and vulnerable and nervous and scared. You have to find a person you can make it through the tough times with.\"\n\nJanuary 2009: Beyoncé and JAY-Z attend President Obama's first inauguration\n\nJAY-Z and Beyoncé attended President Barack Obama's first inauguration, with Beyoncé singing \"America the Beautiful\" at his swearing-in ceremony, followed by the Etta James classic \"At Last\" for the former POTUS and Michelle Obama's first dance at his inaugural ball.\n\n2010–2011: Beyoncé and JAY-Z are rumored to be having a baby\n\nRumors swirled around this time that Beyoncé was pregnant. In her 2013 HBO documentary Life Is But a Dream, she revealed that she had once been pregnant but miscarried.\n\n\"About two years ago, I was pregnant for the first time,\" Beyoncé said in the doc. \"And I heard the heartbeat, which was the most beautiful music I ever heard in my life … Being pregnant was very much like falling in love. You are so open. You are so overjoyed. There's no words that can express having a baby growing inside of you, so of course you want to scream it out and tell everyone. [Early into the pregnancy], I flew back to New York to get my check up — and no heartbeat. Literally the week before I went to the doctor, everything was fine, but there was no heartbeat.\"\n\nAugust 28, 2011: Beyoncé reveals that she and JAY-Z are having a baby\n\nBeyoncé arrives at the 2011 MTV Video Music Awards at the Nokia Theatre on Aug. 28, 2011, in Los Angeles, Calif. Jason Merritt/Getty\n\nBeyoncé revealed she was pregnant at the MTV VMAs in L.A., cradling what appeared to be a bump on the red carpet before telling the audience during her \"Love on Top\" performance, \"I want you to stand up on your feet. I want you to feel the love that's growing inside me.\"\n\nOctober 2011: Beyoncé accused of misleading the public about her pregnancy\n\nBeyoncé and JAY-Z were dogged by an Internet conspiracy that she was not actually pregnant herself and was using a surrogate.\n\nThe mother-to-be addressed the rumors in Life Is But a Dream, calling the reports a \"stupid rumor, the most ridiculous rumor I've ever heard about me … To think that I would be that vain…\"\n\nJanuary 7, 2012: Beyoncé and JAY-Z welcome their first child together\n\nBeyoncé and JAY-Z welcomed daughter Blue Ivy Carter in New York City on Jan. 7, 2012, and the proud parents' friends and family — from sister Solange to Gwyneth Paltrow, Rihanna and Russell Simmons — offered their congratulations on social media.\n\nFebruary 10, 2012: Beyoncé and JAY-Z reveal first photos of Blue Ivy\n\nBeyoncé and Jay-Z introduced Blue Ivy to the world by sharing the first photos of their daughter on Mom's Tumblr. \"We welcome you to share in our joy. Thank you for respecting our privacy during this beautiful time in our lives,\" the Carter family wrote online.\n\nJanuary 20, 2013: Beyoncé and JAY-Z attend President Obama's second inauguration\n\nJAY-Z and Beyoncé arrive at U.S. President Barack Obama's reelection presidential inauguration at the U.S. Capitol on Jan. 21, 2013 in Washington, D.C. Win McNamee/Getty Images\n\nJAY-Z and Beyoncé attended President Obama's second inauguration, where she performed a controversial rendition of \"The Star-Spangled Banner.\"\n\nFebruary 2013: Beyoncé and JAY-Z share intimate moments in Life Is But a Dream documentary\n\nBeyoncé's Life Is But a Dream documentary aired on HBO, giving fans a rare glimpse into her private life with JAY-Z, from celebrating her pregnancy and singing Coldplay's \"Yellow\" to each other to enjoying a secluded, exotic vacation (on a yacht!) and her toasting him at a birthday party.\n\nJuly 4, 2013: JAY-Z releases Magna Carta Holy Grail including \"Part II (On the Run)\" featuring Beyoncé\n\nJAY-Z dropped Magna Carta Holy Grail in 2013, featuring the Beyoncé duet \"Part II (On the Run).\"\n\nDecember 13, 2013: Beyoncé surprise releases self-titled album including \"Drunk in Love\" featuring JAY-Z\n\nBeyoncé surprise-released her epic self-titled visual album later in 2013, complete with videos for each of the 14 tracks. JAY-Z blended his vocals to a verse for \"Drunk in Love\" and appeared in the music video. In addition, he made a brief cameo in the steamy clip for \"Partition.\"\n\nJanuary 26, 2014: Beyoncé and JAY-Z perform \"Drunk in Love\" at the Grammy Awards\n\nJAY-Z joined Beyoncé onstage at the 2014 Grammys in L.A., where they gave a passionate performance of \"Drunk in Love.\"\n\nMay 5, 2014: JAY-Z, Beyoncé and Solange involved in an elevator altercation\n\nCenter, from left to right: JAY-Z, Beyoncé and Solange Knowles leaving the Met Gala after party in the Boom Boom Room in the Meatpacking District on May 5, 2014. Splash News\n\nJAY-Z, Beyoncé and Beyoncé's sister Solange attended the annual Met Gala on May 5, 2014, in N.Y.C. Five days later, video footage of Solange seemingly attacking Jay in an elevator at an afterparty leaked online. None of the parties involved have ever spoken out about what caused the altercation, but tabloids reported that Solange was upset with Jay over alleged cheating rumors.\n\nDays after the incident, the trio released a statement: \"There has been a great deal of speculation about what triggered the unfortunate incident. But the most important thing is that our family has worked through it. Jay and Solange each assume their share of responsibility for what has occurred. They both acknowledge their role in this private matter that has played out in the public. They both have apologized to each other and we have moved forward as a united family. The reports of Solange being intoxicated or displaying erratic behavior throughout that evening are simply false. At the end of the day families have problems and we're no different. We love each other and above all we are family. We've put this behind us and hope everyone else will do the same.\"\n\nIn an August 2014 Lucky cover story, Solange addressed the incident, calling it \"that thing.\" \"What's important is that my family and I are all good,\" the singer told the now-defunct magazine. \"What we had to say collectively was in the statement that we put out, and we all feel at peace with that.\"\n\nJune 25, 2014: JAY-Z and Beyoncé launch On the Run Tour\n\nJAY-Z and Beyoncé perform during the On the Run Tour at the Rose Bowl in Pasadena, Calif., on Aug. 2, 2014. Larry Busacca/PW/WireImage\n\nJAY-Z and Beyoncé embarked on their On the Run Tour, kicking off the 21-date spectacle in Miami on June 25, 2014.\n\nSummer 2014: Beyoncé and JAY-Z face rumors of a split\n\nThe couple became plagued by rumors that their marriage was in crisis and they were heading toward a divorce in the summer of 2014.\n\n\"Word around the industry has been that things are rocky at home,\" a music source who has worked with JAY-Z told PEOPLE at the time. \"If they split, no one would be surprised.\"\n\nHowever, a friend of JAY-Z insisted: \"They are a great couple. They are soulmates and perfect for each other.\"\n\nAugust 24, 2014: Beyoncé is presented with the MTV Video Vanguard Award by JAY-Z and Blue Ivy\n\nJAY-Z and Beyoncé with daughter Blue Ivy Carter (left) onstage at the 2014 MTV Video Music Awards on Aug. 24, 2014. Kevin Winter/MTV1415/Getty Images\n\nBeyoncé dropped her \"***Flawless\" remix featuring Nicki Minaj, seemingly nodding to the Met Gala incident with the new lyric: \"Of course sometimes s--- go down when it's a billion dollars on the elevator.\"\n\nOn Aug. 24, 2014, JAY-Z and Blue Ivy took the stage at the MTV VMAs in L.A. to present Beyoncé with her Video Vanguard Award.\n\n\"Thank you. I have nothing to say, but I'm thrilled with so much gratitude,\" Bey said in her acceptance speech. \"I just thank God for this moment. I love y'all so much,\" she tearfully told the crowd. \"My beloved, I love you. My fans, I love you. MTV, I love you. Good night!\"\n\nNovember 16, 2014: Beyoncé, JAY-Z and Blue Ivy attend Solange's wedding\n\nSolange married Alan Ferguson in New Orleans on Nov. 16, 2014, with Beyoncé, JAY-Z and Blue Ivy in attendance.\n\nNovember 28, 2014: Beyoncé releases the song \"Ring Off,\" initially rumored to be about marriage troubles with JAY-Z\n\nOn Nov. 28, 2014, Beyoncé released two new songs, including \"Ring Off.\" While there was initial speculation the infidelity-fueled track was inspired by troubles in her own marriage, it was actually about her parents', which ended when they split in 2009.\n\nApril 2015: JAY-Z shares footage from wedding to Beyoncé\n\nJAY-Z posted a video of his and Beyoncé's wedding on Instagram. The clip showed them exchanging vows — he in a dashing black tux, she in a voluminous white gown — before Jay slid a wedding ring on Beyoncé's finger and they walked down the aisle.\n\nHowever, Jay has since deleted his Instagram account.\n\nMay 4, 2015: Beyoncé, JAY-Z and Solange attend the Met Gala\n\nBeyoncé and JAY-Z attend the 'China: Through the Looking Glass' Met Gala on May 4, 2015, in New York City. Kevin Mazur/WireImage\n\nBeyoncé, JAY-Z and Solange all attended the Met Gala in New York City, one year after the afterparty elevator incident at the Standard Hotel.\n\nFebruary 7, 2016: Beyoncé performs during the Super Bowl 50 halftime show\n\nBeyoncé performed with Bruno Mars, Chris Martin and Coldplay during the 2016 Super Bowl halftime show, while JAY-Z and Blue Ivy watched from a private box with Martin's ex-wife Gwyneth Paltrow and their kids Apple and Moses.\n\nApril 23, 2016: Beyoncé releases Lemonade album and HBO special possibly addressing marriage with JAY-Z\n\nBeyoncé's Lemonade special aired on HBO in 2016, and the album went on sale after a mysterious, week-long promo campaign. The lyrics in songs like \"Hold Up,\" \"Don't Hurt Yourself\" and \"Sorry\" hinted at infidelity and a marriage in crisis, while \"Sand Castles\" and \"All Night\" are about redemption, forgiveness and a renewed bond. Critics and fans flooded social media with commentary on the visual album, many interpreting it to be autobiographical while others thought it was a self-promotional creative endeavor.\n\nApril 27, 2016: Beyoncé kicks off her Formation World Tour in Miami and dedicates a song to JAY-Z\n\nBeyoncé and JAY-Z ride together on a golf cart during rehearsals for the first show of The Formation World Tour at Marlins Park in Miami, Fla., on April 26, 2016. INF\n\nDays later, Beyoncé kicked off her Formation World Tour in Miami. Despite reports that their marriage was still on the rocks, the pair were photographed — with JAY-Z's arm around his wife — at the concert venue, and she closed the show dedicating her hit \"Halo\" to her \"beautiful husband.\"\n\nEventually, Beyoncé's mom Tina Knowles-Lawson weighed in on the meaning of Lemonade, saying: \"It could be about anyone's marriage. I think that everybody at one time or another has been betrayed and lied to and it's about the pain and it's about the healing process and it's about, 'How do you get past that and move on.'\"\n\nMay 2, 2016: Beyoncé attends Met Gala without JAY-Z\n\nBeyoncé attends the 'Manus x Machina: Fashion in an Age of Technology' Costume Institute Gala at the Metropolitan Museum of Art on May 2, 2016, in New York City. George Pimentel/WireImage\n\nBeyoncé attended the Met Gala sans JAY-Z just eight days after the release of Lemonade, spurring more questions about the status of their relationship.\n\nThat same month, Fat Joe and Remy Ma released a remix of \"All the Way Up\" featuring JAY-Z, in which he raps: \"You know you made it when the fact your marriage made it is worth millions / Lemonade is … a popular drink and it still is.\" Then, that evening, JAY-Z and Beyoncé met up in New York for a date night at Italian hotspot Del Posto.\n\nJuly 9, 2016: Beyoncé and JAY-Z attend Wimbledon\n\nBeyoncé and JAY-Z attend the women's final of the Wimbledon Tennis Championships between Serena Williams and Angelique Kerber at Wimbledon on July 9, 2016, in London, England. Karwai Tang/WireImage\n\nJAY-Z and Beyoncé were photographed in good spirits at a Wimbledon match in London, where they cheered on pal Serena Williams, who made a memorable cameo in Lemonade's \"Sorry\" video.\n\nAugust 28, 2016: Beyoncé performs at MTV VMAs without JAY-Z\n\nBeyoncé attended the 2016 MTV VMAs with Blue Ivy in tow, performing a medley of songs from Lemonade and taking home eight awards, including video of the year. JAY-Z wasn't spotted at the show, but he later joined Bey to celebrate at a star-studded afterparty with pals Kanye West, Kim Kardashian, Alicia Keys and Swizz Beatz.\n\nOctober 7, 2016: JAY-Z takes the stage at final show of Beyoncé's Formation World Tour\n\nJAY-Z and Beyoncé perform on stage during closing night of The Formation World Tour at MetLife Stadium on Oct. 7, 2016, in East Rutherford, N.J. Larry Busacca/PW/WireImage\n\nBeyoncé invited JAY-Z onstage during the final show of her Formation World Tour in New Jersey, telling the audience to \"give it up for my man\" and giving him a smooch before launching into \"Drunk in Love.\"\n\nOctober 31, 2016: Beyoncé and JAY-Z dress up as Barbie and Ken for Halloween\n\nOn Oct. 31, 2016, Jay and Bey adorably celebrated Halloween with Blue Ivy, dressing up as Barbies and Ken.\n\n\n\nNovember 30, 2016: Beyoncé releases music video for \"All Night\" featuring footage from wedding to JAY-Z\n\nBeyoncé released a standalone video for \"All Night\" from Lemonade, which includes footage from their 2008 wedding.\n\nDecember 3, 2016: Beyoncé throws JAY-Z a surprise birthday party\n\nOn Dec. 3, 2016, Beyoncé threw JAY-Z a private surprise bash in L.A., where they celebrated with Kelly Rowland, Tina Knowles-Lawson and more.\n\nFebruary 1, 2017: Beyoncé reveals that she and JAY-Z are expecting twins\n\nBeyoncé reveals she and JAY-Z are expecting twins.\n\n\"We would like to share our love and happiness. We have been blessed two times over,\" she captioned a photo of herself cradling her baby bump. \"We are incredibly grateful that our family will be growing by two, and we thank you for your well wishes. – The Carters.\"\n\nLater that month, the couple attended both the Grammys (where Bey put on a show-stopping, goddess-inspired performance) and a pre-Oscars party, where the singer showed off her growing bump in multiple fitted ensembles.\n\nApril 4, 2017: Beyoncé celebrates anniversary of wedding to JAY-Z with Instagram post\n\nJAY-Z and Beyoncé celebrated nine years of marriage, with the mom-to-be sharing a series of photos and a sweet montage video — set to her song \"Die With You\" — to mark the occasion.\n\n\"I don't need air in my lungs. If I can't sing your song,\" one image read — showing the couple's matching ring finger \"IV\" tattoos (Beyoncé was born on Sept. 4; JAY-Z on Dec. 4; they tied the knot on April 4).\n\nThat same month, the longtime lovebirds jetted off to Bora Bora for a South Pacific babymoon — likely their last big vacation before the twins arrived. (Beyoncé had been scheduled to perform at Coachella in April, but postponed her appearance until 2018 on doctor's orders.)\n\nJune 2017: Beyoncé and JAY-Z welcome twins\n\nBeyoncé posing with her children, Sir and Rumi Carter. Beyoncé/Instagram\n\nA source confirmed to PEOPLE that Beyoncé and JAY-Z welcomed their twins in mid-June, 2017.\n\nLater that month, JAY-Z dropped his 13th solo studio album, 4:44. In the title track, the rapper references his relationship with Beyoncé, apologizes for womanizing, says his daughter and newborn twins changed his perspective, mentions a series of miscarriages and confesses he's undeserving of the relationship.\n\n\"I apologize, our love was one for the ages and I contained us,\" he raps, later adding, \"And if my children knew, I don't even know what I would do / If they ain't look at me the same / I would prolly die with all the shame.\"\n\nJuly 13, 2017: Beyoncé and JAY-Z make first public appearance since birth of twins\n\nBeyoncé made her super low-key public debut after welcoming the twins for an event alongside JAY-Z celebrating Roc Nation artist Vic Mensa on July 13 in L.A. Hours later, the mom of three shared the first photo of the couple's new additions, confirming they welcomed son Sir and daughter Rumi the previous month.\n\nAugust 2017: Beyoncé and JAY-Z purchase a new home in Bel Air\n\nAfter house hunting for two years, JAY-Z and Beyoncé settled into an $88 million Bel Air mansion.\n\n\n\nSeptember 3, 2017: JAY-Z celebrates Beyoncé's birthday during Made in America festival performance\n\nBeyoncé at the 2017 Made in America Festival on Sept. 3, 2017, in Philadelphia, Pa. Kevin Mazur/Getty Images for Anheuser-Busch\n\nThe A-list pair kicked off the month at the Made in America Festival in Philadelphia, where JAY-Z led the crowd in singing \"Happy Birthday\" to Bey, one day before she turned 36.\n\nSeptember 14, 2017: JAY-Z and Beyoncé make first red carpet appearance since the birth of their twins\n\nJAY-Z and Beyoncé at Rihanna's 3rd annual Diamond Ball Benefitting the Clara Lionel Foundation at Cipriani Wall Street on Sept. 14, 2017, in New York City. Kevin Mazur/Getty Images\n\nOn Sept. 14, the couple made their first red carpet appearance since welcoming the twins at pal Rihanna's Diamond Ball in N.Y.C.\n\nSeptember 23, 2017: Beyoncé and JAY-Z bring Blue Ivy to a Bruno Mars concert\n\nA week later, on Sept. 23, they enjoyed a family outing with Blue, dancing and singing along at Bruno Mars's Madison Square Garden 24K Magic Tour stop.\n\nAt the end of the month, a source confirmed to PEOPLE that JAY-Z and Beyoncé purchased a $26 million waterfront estate in the Hamptons.\n\nOctober 17, 2017: Beyoncé and JAY-Z at Tidal x Brooklyn benefit concert\n\nBeyoncé attends 'TIDAL X: Brooklyn' at Barclays Center on Oct. 17, 2017, in Brooklyn. Kevin Mazur/Getty Images\n\nOn Oct. 17, Jay headlined his third annual Tidal x Brooklyn benefit concert, raising money for those affected by hurricanes Harvey and Irma. While Bey attended, walking the carpet in support of the event, she didn't join her rapper hubby onstage when he performed their duet \"Bonnie and Clyde.\"\n\nLater in the month, at pal Kelly Rowland's Halloween party, Beyoncé and JAY-Z dressed up as another powerhouse duo: Lil' Kim and The Notorious B.I.G. The couples that wear couples costumes together stay together.\n\nNovember 2017: JAY-Z admits to being unfaithful to Beyoncé in interview\n\nOn Nov. 29, T: The New York Times Style Magazine released an extensive, deeply personal interview with JAY-Z in which the rapper admitted to infidelity, explained why he cheated and revealed how they got their marriage back on track.\n\n\"You know, most people walk away, and like divorce rate is like 50 percent or something 'cause most people can't see themselves. The hardest thing is seeing pain on someone's face that you caused, and then have to deal with yourself,\" he told the outlet, revealing therapy helped him in tough times. \"So, you know, most people don't want to do that. You don't want to look inside yourself. And so you walk away.\"\n\nThe rapper also told the outlet that their marital strife informed both Lemonade and 4:44, but playing that music for one another was painful and \"very, very uncomfortable,\" but: \"We were using our art almost like a therapy session.\"\n\nAt the end of November, Jay received the most nominations, eight, for the 2018 Grammys.\n\nJanuary 27, 2018: Jay-Z shows support for Beyoncé at pre-Grammys gala\n\nBeyoncé and JAY-Z at Catch in New York City after Clive Davis' pre-Grammys party on Jan. 17, 2018. PapCulture/Splash News\n\nOn Jan. 27, 2018, JAY-Z and Beyoncé attended Clive Davis and the Recording Academy's annual pre-Grammys gala in N.Y.C., where the rapper was honored with the 2018 Salute to Industry Icons Award. In his acceptance speech, JAY-Z revealed he ended his six-year boycott of the Grammys to support Bey in 2004, \"when a beautiful young lady, whom I love dearly, had a solo album, and it was the breakout — she was nominated.\"\n\nEarlier that day, he sat down with CNN's Van Jones for a wide-ranging interview in which he discussed everything from Trump's presidency to his marriage to Beyoncé, further opening up about how they fixed their relationship after he cheated. Jay said \"the best apology is changed behavior,\" adding: \"The other side is beautiful — at least for us.\"\n\nIn the same interview, Jay also spoke about 7-month-old twins Rumi and Sir. \"We are in a beautiful time now because they are 7 months and they can't move,\" he said. \"They can just coo … they just coo and you don't have to 'wait, wait, wait, wait.' … You know, they're not running anywhere yet. We are going to enjoy these couple of months until they start running, and then it's over.\"\n\nOn Jan. 28, Jay and Beyoncé attended the Grammys at Madison Square Garden, where they sat front-row with Blue.\n\nBlue stole the show throughout the night, whether she was adorably shushing her parents — or noshing on snacks and a juice box.\n\nMarch 2, 2018: Beyoncé and JAY-Z appear on song released by DJ Khaled\n\nOn March 2, JAY-Z and Beyoncé's then-latest collaboration dropped: DJ Khaled's \"Top Off,\" also featuring rapper Future. On the track, Jay raps about everything from incarcerated hip-hop star Meek Mill to \"me and Blue having a sing-off.\"\n\nMeanwhile, on Bey's verse, she raps: \"If they're tryna party with the queen / They gon' have to sign a non-disclosure.\" (Fans on social media speculated this line was about comedian Tiffany Haddish. The month before, the Girls Trip star said that at a party, \"[An actress] touched JAY-Z's chest and Beyoncé came walking up like…'Biitttchhh!' But, she didn't say that.\")\n\nMarch 12, 2018: Beyoncé and JAY-Z announce On the Run II Tour\n\nThe BeyHive buzzed into overdrive as Beyoncé and JAY-Z announced a joint summer tour on March 12, 2018. The jaunt was a long-awaited sequel to their blockbuster 2014 duel-headlining trek, On the Run.\n\nA source previously told PEOPLE that the music super-couple planned to return to the stage together. \"They are incredibly excited. It took a lot of work to make this happen. It's the best choice for their family.\"\n\nMarch 17, 2018: Beyoncé, JAY-Z and Blue Ivy attend Wearable Art Gala\n\nJAY-Z and Beyoncé with daughter Blue Ivy Carter (center) on the red carpet for the 2nd annual Wearable Art Gala in Los Angeles on March 17, 2018. Beyonce/Instagram\n\nOn March 17, 2018, Beyoncé, JAY-Z and Blue Ivy Carter attended the 2nd annual Wearable Art Gala in Los Angeles before the pop icon was awarded a humanitarian award by her mother — and Blue did some bidding on behalf of her famous parents.\n\nBlue held her paddle high and bid $17,000 on an acyclic painting of Sidney Poitier during the event's live auction, emceed by Star Jones, according to Vanity Fair. Despite JAY-Z jokingly trying to snatch the paddle from his daughter, she bid again when the item's asking price shot up to $19,000, the outlet reported. However, director Tyler Perry beat out the bid and won the art piece for $20,000.\n\n\"I got the painting. I could not be outdone by a 6-year-old,\" he joked.\n\nWork hard, play hard. In late March, the couple headed to Jamaica with their children, reportedly shooting promos for their upcoming tour.\n\n\"It was a work trip, but they also got to enjoy the island,\" a source told PEOPLE. \"Beyonce is preparing for Coachella. Together they are rehearsing for the tour. It's a lot of work for them, but they are very excited. Things are great.\"\n\nJune 6, 2018: Beyoncé and JAY-Z launch the On the Run II Tour\n\nBeyoncé and JAY-Z perform on the opening night of the On the Run II Tour at Principality Stadium on June 6, 2018, in Cardiff, Wales. Raven Varona/Parkwood/PictureGroup\n\nJAY-Z and Beyoncé kicked off their On the Run II tour in Cardiff, England, on June 6, 2018. Throughout the two-hour set, the couple performed 37 tracks — and gave fans a rare glimpse into their private world.\n\nThe pair appeared to hint that they recently renewed their vows. In a video (that has since been removed) taken at the tour opener, both musicians could be seen on a screen in all-white attire joined by Blue Ivy and twins Rumi and Sir for what appeared to be a vow renewal ceremony. The message \"THIS IS REAL LOVE\" is projected during the film at the concert as the power couple sings their 2009 duet \"Young Forever.\"\n\nBefore Bey and Jay shared the footage of the ceremony, photos of the pair holding two babies were shared along with the words \"LOVE IS UNIVERSAL\" and \"LOVE NEVER CHANGES.\" The BeyHive presumably thought the children were Rumi and Sir (who celebrated their first birthday on June 13), however, they were not.\n\n\"At the end of the show the Carter babies were included in a family collage [however] the babies in the film clip at the beginning were not their children,\" a source tells PEOPLE.\n\nJune 16, 2018: Beyoncé and JAY-Z release collaborative album Everything Is Love\n\nBeyoncé and JAY-Z during their On The Run II Tour at Etihad Stadium, in Manchester, U.K., on June 13, 2018. PictureGroup/Shutterstock\n\nA week later, the powerhouse couple stunned fans in London and around the world by releasing a new joint album called Everything Is Love.\n\nA video for the new track \"Apes—\" was shot by Ricky Saiz on location at the Louvre in Paris in May and dropped simultaneously. The couple announced the album during their concert in London with \"album out now\" text appearing on a screen.\n\n\"You've all given so much love every time we come here — thank you. Because we love you all so much we have something special for y'all,\" Beyoncé told the crowd. \"We want you guys to be the first to experience this new project. And we have a new visual for you guys. We want you all to count down — 10, 9, 8…\"\n\nWhile fans had no idea the album would be dropping on that Saturday, during an interview with The New York Times in 2017, JAY-Z revealed that both he and his wife had been working on new music together for a while but took a break so she could focus on Lemonade instead.\n\n\"Her album came out as opposed to the joint album that we were working on,\" he said, explaining that Lemonade was closer to being completed at the time.\n\nTeasing their future collaboration, he added, \"We still have a lot of that music.\"\n\nWhile the pair's album came as a surprise to their fans, many had previously assumed the new music would be released to coincide with their 10th wedding anniversary in April.\n\nJune 21, 2018: Beyoncé and JAY-Z celebrate joint album release with London date night\n\nIn between stops on their On the Run II Tour, Beyoncé and JAY-Z stepped out for date night in London. The couple's night out on the town came a few days after they surprised fans at the London Stadium with the release of their joint album, Everything Is Love.\n\nJuly 2018: Beyoncé and JAY-Z relax on a yacht in Italy during a break on the On the Run II Tour\n\nAfter performing 18 shows across Europe during the On the Run II Tour, Beyoncé and JAY-Z were spotted relaxing on a yacht off the coast of Italy before the U.S. leg of the tour kicked off in Cleveland on July 25.\n\nSeptember 4, 2018: Beyoncé and JAY-Z celebrate Beyoncé’s 37th birthday in Sardinia\n\nDuring another break on the On the Run II Tour schedule, Beyoncé and JAY-Z returned to Italy — specifically the island of Sardinia — to celebrate Beyoncé's 37th birthday. Beyoncé shared images from their European birthday getaway on Instagram.\n\nFebruary 10, 2019: Beyoncé and JAY-Z win Grammy Award for Everything Is Love\n\nBeyoncé and JAY-Z added another trophy to their Grammy collection when the music duo won best urban contemporary album at the 2019 Grammy Awards. The win was Beyoncé's 23rd Grammy and JAY-Z's 22nd.\n\nMarch 30, 2019: Beyoncé and JAY-Z are honored at the NAACP Image Awards\n\nJAY-Z and Beyoncé attend 'The Lion King' European premiere at Leicester Square on July 14, 2019, in London, England. Dave J Hogan/Getty Images\n\nBoth Beyoncé and JAY-Z were honored at the 2019 NAACP Image Awards. Beyoncé received the entertainer of the year trophy, while JAY-Z won the president's award. The couple gave a joint speech, in which JAY-Z dedicated his award to the \"strong women\" in his life, including his wife.\n\nApril 4, 2019: Beyoncé and JAY-Z celebrate their 11th wedding anniversary in Mexico\n\nFresh off awards season, a source told PEOPLE that Beyoncé and JAY-Z took a \"no-kids\" trip together to Mexico to celebrate their 11th wedding anniversary in Mexico. It was a welcomed vacation for the couple after completing the On the Run II Tour the previous year.\n\n\"Right after the tour ended, they took it easy,\" the source said. \"They were both beyond excited about how the tour went, but they were also tired. They just needed a little break and are back to talking about new projects.\"\n\nJune 5, 2019: Beyoncé and JAY-Z sit courtside at the NBA Finals\n\nJAY-Z and Beyoncé sat courtside during Game 3 of the 2019 NBA Finals as the Golden State Warriors played the Toronto Raptors.\n\nA courtside moment between Beyoncé and Nicole Curran, wife of Warriors' owner Joe Lacob, later went viral when Curran seemingly leaned over Beyoncé to talk to JAY-Z.\n\nFans speculated Beyoncé was annoyed, but Curran responded to the controversy on her now-deactivated Instagram, writing, \"Listen Beehive, I respect Queen B. I love her! I talked to her husband twice tonight. First, to take a drink order for them both when they arrived as they were our guests. Second, to explain why I gave his wife a rose from a fan. All of this has been taken out of context. I am a happily married woman. Telling me to kill myself?????? Somehow I don't think she would support this.\"\n\nNovember 15, 2019: Beyoncé and JAY-Z have date night at a Florida casino\n\nBefore hosting his fundraiser for the Shawn Carter Foundation Gala at the Seminole Hard Rock Hotel and Casino in Hollywood, Fla., JAY-Z and Beyoncé enjoyed a night out at the casino.\n\nJanuary 5, 2020: Beyoncé and JAY-Z bring their own champagne to the 2020 Golden Globes\n\nWhy wait for table service?\n\nBeyoncé and JAY-Z brought their own champagne — Armand de Brignac, co-owned by JAY-Z — to the 2020 Golden Globes.\n\nThe sneaky move was captured by Los Angeles Times reporter Amy Kaufman, who spotted the couple's bodyguard holding two bottles of JAY-Z's champagne brand.\n\nFebruary 2020: Beyoncé and JAY-Z spend time in Miami before Super Bowl LIV\n\nWhile in town for Super Bowl LIV, Beyoncé and JAY-Z took time to enjoy the Miami nightlife. A few days after the trip, Beyoncé shared images on her website of the stunning outfits she wore for each night out on the town with her husband.\n\nJune 5, 2021: Beyoncé and JAY-Z sit courtside at NBA Playoffs game\n\nBeyoncé and JAY-Z attend the Brooklyn Nets game against the Milwaukee Bucks during Round 2, Game 1 of the 2021 NBA Playoffs on June 5, 2021, at Barclays Center in Brooklyn, New York. Nathaniel S. Butler/NBAE\n\nBeyoncé and JAY-Z sat courtside for Game 1 between the Brooklyn Nets and the Milwaukee Bucks in the NBA Playoffs at the Barclays Center in Brooklyn. Both Beyoncé and JAY-Z were dressed in black-and-white outfits to support the Brooklyn Nets (formerly co-owned by JAY-Z).\n\nSeptember 2, 2021: Beyoncé and JAY-Z star in Tiffany & Co. campaign\n\nTiffany & Co. launched its ABOUT LOVE advertising campaign starring the power couple. Along with a behind-the-scenes preview shared exclusively with PEOPLE, Beyoncé and JAY-Z issued the statement, \"Love is the diamond that the jewelry and art decorate.\"\n\nIn the campaign, Beyoncé wore the iconic Tiffany Yellow Diamond, while JAY-Z wore Jean Schlumberger's legendary Bird on a Rock brooch, reconstructed as a pair of one-of-a-kind cuff links.\n\nThe campaign was influenced by the classic 1961 film Breakfast at Tiffany's, with Beyoncé wearing a long black dress similar to the style that star Audrey Hepburn wore in the film. Beyoncé also recorded a rendition of the film's song \"Moon River\" for the campaign.\n\nOctober 19, 2021: Beyoncé and JAY-Z appear in another ABOUT LOVE advertisement for Tiffany & Co.\n\nAfter launching the ABOUT LOVE campaign in September, Tiffany & Co. released another advertisement featuring Beyoncé and JAY-Z in a Breakfast at Tiffany's inspired short film.\n\nThe short film, titled \"Date Night,\" depicts the couple enjoying pizza and champagne while seated in the back seat of a Rolls Royce. The clip included a quick cameo by the couple's oldest daughter, Blue Ivy.\n\nNovember 2021: JAY-Z Joins Instagram, follows Beyoncé, then deletes his account\n\nJAY-Z joined Instagram for a second time on Nov. 3, 2021, posting a photo promoting the 2021 Netflix film he co-produced, The Harder They Fall. JAY-Z only followed one account: his wife's.\n\nHowever, the rapper deleted his account on Nov. 4, 2021, just one day after joining Instagram. JAY-Z previously opened and immediately closed his first account back in the summer of 2015.\n\nDecember 8, 2021: Beyoncé shares photos of trip to Las Vegas with JAY-Z\n\nUsing the caption \"Vegas Weekend,\" Beyoncé posted several photos —including one of the couple kissing — on Instagram. The photos were taken during a trip the two took together to Las Vegas.\n\nFebruary 13, 2022: Beyoncé, JAY-Z and Blue Ivy attend Super Bowl LVI\n\nBeyoncé, JAY-Z and Blue Ivy were in the crowd at SoFi Stadium in Los Angeles for Super Bowl LVI. Before the game, JAY-Z and Blue Ivy went onto the field and snapped a photo together.\n\nMarch 27, 2022: Beyoncé and JAY-Z attend the 2022 Oscars\n\nBeyoncé performs during the ABC telecast of the 94th annual Academy Awards on March 27, 2022, in Los Angeles, Calif. Mason Poole/A.M.P.A.S.\n\nBeyoncé opened the 2022 Academy Awards with her Oscar-nominated song \"Be Alive\" from the film King Richard. Beyoncé — backed by an orchestra, dancers and even a cameo from daughter Blue Ivy — performed on the tennis court in Compton, Los Angeles, where Serena and Venus Williams famously practiced. The singer later arrived at the ceremony with husband JAY-Z in tow, wearing a yellow gown and carrying a tennis ball-shaped purse as a nod to the six-time Oscar-nominated film.\n\nApril 4, 2022: Tina Knowles-Lawson celebrates Beyoncé and JAY-Z's 14th wedding anniversary\n\nBeyoncé's mother posted a video montage on Instagram of clips of her daughter and JAY-Z to celebrate the couple's 14th wedding anniversary.\n\nKnowles-Lawson wrote in the caption, \"Happy Anniversary to one of my inspirations for a couple! They work hard, laugh hard, and love Harder ❤️❤️❤️🙏🏽🙏🏽 14 years.\"\n\nApril 4, 2023: Beyoncé and JAY-Z celebrate their 15th wedding anniversary\n\nThe couple celebrated fifteen years of marriage in 2023, giving fans the perfect opportunity to take a look back at their intimate wedding in Manhattan.\n\n\n\nMay 10, 2023: JAY-Z and Blue Ivy support Beyoncé at opening night of the Renaissance World Tour\n\nA fan video captured JAY-Z and Blue Ivy in attendance at the opening show of Beyoncé's Renaissance World Tour, which kicked off in Stockholm, Sweden in 2023.\n\n\"Manager Ivy was there to make sure everything was running smooth,\" wrote the person who posted the video.\n\n\n\nFebruary 4, 2024: JAY-Z calls out the Grammys for never awarding Beyoncé album of the year\n\nWhile accepting the 2nd annual Dr. Dre Global Impact Award, JAY-Z took a moment to address the Grammys' voting process and called out the award show for Beyonce's never winning album of the year, despite his wife holding the record for most Grammys won.\n\nAfter acknowledging that the system is \"subjective,\" because \"it's music and it's opinion-based,\" the hip-hop artist said: \"But, you know, some things — I don't want to embarrass this young lady, but she has more Grammys than everyone and never won album of the year. So even by your own metrics, that doesn't work. Think about that. The most Grammys, never won album of the year. That doesn't work.\"\n\nDecember 9, 2024: JAY-Z and Beyoncé attend the Mufasa: The Lion King premiere amid the rapper's rape allegations\n\nTina Knowles, JAY-Z, Beyoncé and Blue Ivy Carter in 2024. LISA O'CONNOR/AFP via Getty\n\nJAY-Z supported his family at the Los Angeles premiere of Mufasa: The Lion King. Beyoncé voices Nala in the Disney film, while Blue Ivy voices lioness cub Kiara.\n\nThe event came one day after the rapper denied a rape allegation. JAY-Z was accused of raping a 13-year-old girl 24 years ago alongside Sean \"Diddy\" Combs in a civil lawsuit, which was originally filed in October 2024.\n\n\"These allegations are so heinous in nature that I implore you to file a criminal complaint, not a civil one!!\" he wrote in a statement posted on X (formerly Twitter). \"I'm a young man who made it out of the project of Brooklyn. We have very strict codes and honor. We protect children.\"", "images": ["https://people.com/thmb/iSLz2VYDyKm0Uywz1GwKXkfVhbo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/beyonce-jay-z-4-29b7765de8ac46de9d6715a5b39ca119.jpg", "https://people.com/thmb/AO0NnwtBw7k-E30mZjMZH_fPtvg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/beyonce1-1-ebc7233265ef478582cc5e11e991eb6c.jpg", "https://people.com/thmb/GsMlESUIuTrKeVEcbedkq2m9LJA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/jayz-beyonce-11-2000-4c80ff7a2c17409e8be32372bd29b6c2.jpg", "https://people.com/thmb/9wTLlTyLxxVYpmG-dSrUJfKBdI0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/blue-ivy-tiny-knowles-102825-eec64b3ce76d49b8bd00e1a5e282278c.jpg", "https://people.com/thmb/39GFSOXU8Q76PKgCNl8iC6V85zo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(854x0:856x2)/beyonce-7-1-bc2333e83adb4d6b9238842e0cc132e2.jpg", "https://people.com/thmb/ISGtCa1eXcGD4wqCFuEqicfn5HU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(752x0:754x2)/jay-z-1-317f9fea9262441ea002e5f43fd51354.jpg", "https://people.com/thmb/cGcCZotnsXyVTayy88mMlWs0i7g=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(763x0:765x2)/beyonce-b-2000-2e46d1bad575497b900a04660fb2b4df.jpg", "https://people.com/thmb/czOIaxfdUkPdDz8Sv90W8PgzUws=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(593x0:595x2)/beyonce-jay-z-9-f2f524f42d4c4d3ca3304983c058dbcd.jpg", "https://people.com/thmb/n5FXxVGHwa4sMubVCJqSy0tpsBg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(692x526:694x528)/beyonce-jay-z-7-50b7b9223c204269a5e8273058d71d4b.jpg", "https://people.com/thmb/ySMtFfq9YUxNYqzc4Vq16FoQ4bQ=/200x200/filters:no_upscale():max_bytes(150000):strip_icc()/kh-d9a5a4d678be49c580ea18023d075a8d.jpg", "https://people.com/thmb/qWGnaIWZ8KcMrgYMtfLeS_BY7ho=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/eric-dane-wife-rebecca-gayheart-main-041125-2c87fc8827784a5f8ff538a3f3694b16.jpg", "https://people.com/thmb/6UIRVs8M7vPGvO1ErgwQpN4RsJQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/kristin-cavallari-tout-6c06282a8e794cce8a0f3a5e5ba8bb11.jpg", "https://people.com/thmb/5aDIBa_OGojCeH6avwiNSCGyaTU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(975x532:977x534)/Beyonce-jay-z-tina-Blue-Ivy-Mufasa-premiere-120924-c2d5bcb4afb5460ba4348f4df05e9b1f.jpg", "https://people.com/thmb/N0vTDSp3eRCcDZoGrXe-9ufUBkI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(629x322:631x324)/beyonce-jay-z-13-320976cb115c408b9f9e9b3ff2618c2c.jpg", "https://people.com/thmb/bnYA-EdxpxwFKdmuQJXNMMYfYXg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(631x0:633x2)/beyonce-jay-z-8-24c0e71eb155493a8855a384386e6716.jpg", "https://people.com/thmb/gfgwwdXghNNPH93nEisvdOdS4aA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(709x0:711x2)/beyonce-jay-z-1-759a63fa94454b07b7c535fc88a02572.jpg", "https://people.com/thmb/dB0RTgmWW1Rmv-WFgCpyEIPCVEk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(539x0:541x2)/beyonce-4-136e2f42ee8e44ed9aa798178de0e6c0.jpg", "https://people.com/thmb/uMsy2jcHVYJ9bNPFFQL2Z0VBdRs=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/beyonce-jay-z-11-89f4a0843db548b3a06c657f83d609fe.jpg", "https://people.com/thmb/8JHTidDbfdhgxus6HU8iGwa3QFE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/austin-butler-emily-ratajkowski-111825-f2666a30b50a4ad6b183306a940dc2d9.jpg", "https://people.com/thmb/XKMN66HntGuyJviQunQYRTR6uTE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/kelly-ripa-mark-consuelos-live-main-080525-3f1884a2e51c4213a5ddeac0b0094b19.jpg", "https://people.com/thmb/3FvUtTzqOzc39aMU-NC3TBF496g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(770x275:772x277)/Jay-Z-Beyonce-121123-9edc792f1a9e4dca94ecd1dd6b7456cb.jpg", "https://people.com/thmb/vyJHKEJ82ooUSWt2SR-CETECkIs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/mcdermott-spelling-1-866b59b7eff1446b8e34775aa6c0ce74.jpg", "https://people.com/thmb/EGxuYXQxCHrcy7Wwn6LkSNWLUDc=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/mcdermott-spelling-1-866b59b7eff1446b8e34775aa6c0ce74.jpg", "https://people.com/thmb/mdtSqOpj6KxXzMT7NTgugN2W-mk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/ariana-grande-ethan-slater-wicked-london-111225-8e91c5fc9d3149ed9e93d6ef8dd2669f.jpg", "https://people.com/thmb/latNy6O_DnRNb9RptOuIm_6YNDY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/minka-kelly-dan-reynolds-relationship-ufc-303-event-041625-6a1e0711fb494f76bec8ece05a8d6b49.jpg", "https://people.com/thmb/ODx-xuSc0tF7KXziE3lqs5yr23A=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/beyonce-jay-z-10-d989b4a15b1b42689a764411296a182e.jpg", "https://people.com/thmb/nD6_a_9EA4jvjD43YFgHVLLNLrc=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(644x0:646x2)/beyonce-jay-z-2-e7ab7ff138504d6fbb11afba9b96d597.jpg", "https://people.com/thmb/XWN45512fF5wHNZjhpL3GG4Ggio=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(819x0:821x2)/beyonce-jay-z-14-e8929fc77c534250bba5a63437c3b7f4.jpg", "https://people.com/thmb/tgNceN28pCtDY7ISh6bzzAJwla0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/beyonce-jay-z-15-59c3483b8ede4b59bd0e5bf542beffbd.jpg", "https://people.com/thmb/bvhN4OZNj3_1jYvACjBlHGThwDg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Kobe-Bryant-and-his-wife-Vanessa-pose-at-the-2004-MTV-Movie-Awards-111725-dc8a6986da2247f7982b92a9ab2df339.jpg", "https://people.com/thmb/kSoLwzTRvBYb9X8zwuhNx7wYA4c=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(641x0:643x2)/beyonce7-7c9486b699c74a47b7bb4906914bb20f.jpg", "https://people.com/thmb/51TnpLfweREFNOrzQygPgn29f4c=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/jayz-beyonce-6-9b24a1649add4c189713ce37d31a5ba9.jpg", "https://people.com/thmb/R1pvwthMbSuMihTSaUueuAle7fs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/cardi-b-stefon-diggs-knicks-051225-08de9ae9fb8f4bc5a396373f7d253b02.jpg", "https://people.com/thmb/4rFeJEnRR_syZ8g4oeyf45TQSJA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(787x0:789x2)/beyonce-jay-z-6-b585e9e400f14647a7f7253f59f88066.jpg", "https://people.com/thmb/4Wm3_tIWzo9QDM2tpRlMVRkwc9o=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Drew-Barrymore-and-Minka-Kelly-111925-4ff5746bc3a444e1a4fda16f16db2a4d.jpg", "https://people.com/thmb/l1heBQe1jhrtwJjca13fVum5wTk=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/ekaterina-gordeeva-sergei-grinkov-ice-skating-111925-43f6a37ba62840c685a1b57f3a2569ac.jpg", "https://people.com/thmb/tEOejLkNJR4lYDZCqRVbMAKlOj0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/gettyimages-830260952-1-2000-7350168d1a8747cfabd5ca51ada13c0d.jpg", "https://people.com/thmb/xzbMNBm09es-VhNVSIp_l9dK050=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/beyonce-22-05e040ea68734b65b05689b404cb24ac.jpg", "https://people.com/thmb/0OBPJHXyzj8tZQSSjWvzEs2nhvw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/jenna-bush-hager-minka-kelly-today-with-jenna-and-friends-111925-7e3c2b8605fe4a96a1b712c168083adb.jpg", "https://people.com/thmb/n9MCqsYarDtZJMGWajQYsDgBD4I=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(677x0:679x2)/beyonce-jay-z-3-fba842b257d1413ab0c99eeafb917952.jpg", "https://people.com/thmb/W7pR5Ab5uQ2xdjO8WSlfEinulo0=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/Vencent-Hickerson-111925-6-f70136ab95854fed905274e761d98e0f.jpg", "https://people.com/thmb/asiaSBrG0r7jPTCNq-3yP72hblU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/jayz-beyonce-31-1-8687bb5449354197a7a38e5d515e63b9.jpg", "https://people.com/thmb/afnNnNLF2U5NFhsb-jwQ9mA3Pso=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/Kobe-Bryant-and-his-wife-Vanessa-pose-at-the-2004-MTV-Movie-Awards-111725-dc8a6986da2247f7982b92a9ab2df339.jpg", "https://people.com/thmb/5P9q3x79iqtQ4y438ajmgmaYRDQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/adam-sandler-jackie-sandler-1-111425-3649a856d05c4e01a6847ad08c7e2732.jpg", "https://people.com/thmb/5rvpZkQM4A7ecgR8H5hfM0TPzZE=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/jayz-beyonce-7-a20c9543070a472383c499903395bbd4.jpg", "https://people.com/thmb/AgTcGxKmZQkT63QT_4U3Ro_46e0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/beyonce3-1-2000-5234369da6294e338225d16673642cf5.jpg", "https://people.com/thmb/felbGJ0yESVeyTS9bJ2Iaze7eVg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Blue-Ivy-Carter-Angel-Ball-102725-d058475525cd495b8f45a16b9a1ba08d.jpg", "https://people.com/thmb/GwFXLRu6Xcrg6J_kcVOsm190DD0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/billy-bob-thornton-angelina-jolie-connie-angland-split-111925-73d94569a50e4ea2a0963c4f658f9471.jpg", "https://people.com/thmb/T4ZYYf67rPIVQpfxyU4YMmENJFw=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/jayz-beyonce-81-2e4091edb58147ffbd1262600533f0f5.jpg", "https://people.com/thmb/6IyhFgQT3wu0NWP0Aphz5wDFs4s=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/Kelsey-Zach-Top-Riley-Green-111925-f36976ca5eb14ae792f092060f209f93.jpg", "https://people.com/thmb/8qHurymZZp6wT2DV7waW4P-kRek=/200x200/filters:no_upscale():max_bytes(150000):strip_icc()/Jeff-Nelson_selects-10-85889a30a8544ebba85c86033bc5b46a.jpg", "https://people.com/thmb/buCS2ErljERw_dj-2EvaLwHrnW0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(900x0:902x2)/beyonce-jay-z-5-e22d2dee38d34e76a893f80df9900fb3.jpg", "https://people.com/thmb/VgYZSGFVNbU22-XVnT2PgQbhVF8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/miley-cyrus-dolly-parton-tout-012424-3815e535a02b4fa1af0e08f15b6c39bd.jpg", "https://people.com/thmb/YH1GSsAN4DC37tsFLTrnBdBM8t4=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/Blue-Ivy-Carter-Angel-Ball-102725-d058475525cd495b8f45a16b9a1ba08d.jpg", "https://people.com/thmb/SLX76p4w-rfRc_Kk1N7oqdNk8qw=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/meghan-king-5th-Annual-Vanderpump-Dog-Foundation-Gala-2023-jim-edmonds-Busch-Stadium-2024-092425-66f95d42ed374e038155e8e43fc99358.jpg"], "top_img": "https://people.com/thmb/3FvUtTzqOzc39aMU-NC3TBF496g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(770x275:772x277)/Jay-Z-Beyonce-121123-9edc792f1a9e4dca94ecd1dd6b7456cb.jpg", "keywords": [], "authors": ["Jeff Nelson", "Jeff Nelson Is The Senior Music Editor At People. He Has Been With The Brand Since", "Editing", "Writing", "Reporting Across Entertainment Verticals.", "People Editorial Guidelines", "Kylie Hemmert Is An Experienced Writer", "Editor Who Is Passionate About Everything Entertaining", "Especially In The Horror Realm. Her Work Has Appeared On Slashfilm", "Comingsoon.Net. She Previous Held Positions At Evolve Media"], "canonical_link": "https://people.com/music/beyonce-jay-z-relationship-timeline/", "title": "Beyoncé and JAY-Z's Relationship Timeline", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Beyoncé and JAY-Z got married in 2008 and have since welcomed three children. From cheating confessions to surprise album drops, here's everything you need to know about their relationship.", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "PEOPLE", "sailthru.author": "Jeff Nelson", "parsely-section": "Celebrity", "parsely-tags": "People.com,Celebrity,Person,Celebrity Relationships,Jay-Z,Blue Ivy Carter", "article": {"section": "People", "author": "https://www.facebook.com/peoplemag"}, "og": {"type": "article", "site_name": "People.com", "url": "https://people.com/music/beyonce-jay-z-relationship-timeline/", "title": "Beyoncé and JAY-Z's Relationship Timeline", "description": "Beyoncé and JAY-Z got married in 2008 and have since welcomed three children. From cheating confessions to surprise album drops, here's everything you need to know about their relationship.", "image": "https://people.com/thmb/3FvUtTzqOzc39aMU-NC3TBF496g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(770x275:772x277)/Jay-Z-Beyonce-121123-9edc792f1a9e4dca94ecd1dd6b7456cb.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Beyoncé and JAY-Z's Relationship Timeline", "description": "Beyoncé and JAY-Z got married in 2008 and have since welcomed three children. From cheating confessions to surprise album drops, here's everything you need to know about their relationship.", "image": "https://people.com/thmb/3FvUtTzqOzc39aMU-NC3TBF496g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(770x275:772x277)/Jay-Z-Beyonce-121123-9edc792f1a9e4dca94ecd1dd6b7456cb.jpg"}, "vf": {"url": "https://people.com/music/beyonce-jay-z-relationship-timeline/"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.147.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.147.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.147.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.147.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.147.0/icons/favicons/mstile-310x150.png", "fb": {"pages": 95926963131}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}