{"url": "https://www.aad.org/public/skin-hair-nails/skin-care/self-tanner-how-to-apply", "text": "How to apply self-tanner These basic tips will help you apply self-tanner so you get even coverage and longer-lasting results.\n\nThese basic tips will help you apply a self-tanner so you get even coverage and longer-lasting results.\n\nFollow these steps:\n\nExfoliate. Use a washcloth to exfoliate the skin prior to applying a self-tanner. Using an exfoliating product also will help remove dead skin cells. Spend a little more time exfoliating where your skin is thickest, on the elbows, knees and ankles. Dry your skin. Drying your skin before you apply a self-tanner helps it go on evenly. Apply in sections. Apply the self-tanner in sections (such as the arms, then legs, followed by the torso). Massage the self-tanner into your skin in a circular motion. Wash your hands after each section. You will avoid orange-colored palms by washing your hands with soap and water after you finish applying the self-tanner to each section of your body. Blend at your wrists and ankles. For a natural look, you need to lightly extend the tanner from your wrists to your hands and from your ankles to your feet. Dilute over your joints. Dilute the self-tanner on the knees, ankles and elbows, because these areas tend to absorb more self-tanner than the rest of the skin. To dilute, lightly rub with a damp towel or apply a thin layer of lotion on top of the self-tanner. Give your skin time to dry. Wait at least 10 minutes before getting dressed. For the next three hours, it is best to wear loose clothing and try to avoid sweating. Apply sunscreen every day. You still need to protect your skin with sunscreen. Be sure that your sunscreen offers all of the following: SPF 30 or higher Broad-spectrum protection (UVA/UVB protection) Water resistance\n\nQuiz: Do you apply self-tanner like a pro?\n\n<section><h2>Do you apply self-tanner like a pro?</h2><p><p>You can get even coverage and natural-looking results when you apply self-tanner at home. Do you know the techniques that make this possible? Find out by taking this quiz. </p></p></section><section><h2>To get even coverage, you should exfoliate before applying a self-tanner.</h2></section><section><h3>For best results, you want to apply a self-tanner to moist skin.</h3></section><section><h3>When applying a self-tanner, you want to use a circular motion.</h3></section><section><h3>For a natural look, avoid applying self-tanner to your elbows, knees, and ankles.</h3></section><section><h3>After applying self-tanner, you need to give your skin at least 10 minutes to dry before getting dressed.</h3></section><section><h3>If the self-tanner you apply has an SPF, you still need to use sunscreen every day.</h3></section><section><h2>Your results</h2><p><p>No worries. Getting that enviable natural look from a self-tanner is an acquired skill. You’ll find dermatologists’ tricks for getting even coverage and longer-lasting results by watching this short video:</p></p></section><section><h3>Your results</h3><p><p>You’ve got a head start on getting professional-looking results from a self-tanner. If you want to acquire a few more tips and tricks, such as how to avoid orange palms, find out what dermatologists tell their patients by watching this short video:</p></p></section><section><h3>Your results</h3><p><p>Awesome. You know how to get natural-looking results. If you’re looking for more self-tanner tips and tricks, such as avoiding orange palms, here are tips that dermatologists share with their patients: </p></p></section>\n\n﻿", "images": ["https://images.ctfassets.net/1ny4yoiyrqia/1O0t2elZNvYdI7bUByExRF/6fc63c4652aca94794ff0883305fda5e/aad-atopic-dermatitis-treatment-moisturizer.jpg?w=268", "https://images.ctfassets.net/1ny4yoiyrqia/3IQQrlyhNKssRgiO1eqGI9/ef9b6a0019a86e5188bb14d546e25039/flyers-posters-card.png?w=268", "https://images.ctfassets.net/1ny4yoiyrqia/5KKFTos6f2gKYwyqJb9I3r/92fc017436542f0de6a06aa663da9386/aad-casey-schukow-camper-skin-craft.jpg?w=268", "https://images.ctfassets.net/1ny4yoiyrqia/4zMoBhzDyHOgy42pXZHM1F/a934e495aeb77e1d0b475be24f308649/aad-what-is-a-dermatologist.jpg?w=268", "https://images.ctfassets.net/1ny4yoiyrqia/5INwkza1Bu9naCgwXyNWBv/81e16c785f2086cae3c66862fdd6c02d/aad-trim-nails.jpg?w=268", "https://images.ctfassets.net/1ny4yoiyrqia/5ZHK03QN0KMQypNKfAa5Zh/33ff1d078eed5ba15a59afefc4e72dec/aad-find-a-dermatologist.jpg?w=268", "https://images.ctfassets.net/1ny4yoiyrqia/41KzKXjwa194bLy8aONuem/c26124e4580aac1ba5e47e6e6a534de0/aad-scar-removal-laser-featured.jpg?w=268", "https://images.ctfassets.net/1ny4yoiyrqia/1amOaOPBHLig940B8Cz7JT/d31ac0548bff4f7ffaccc6921eedc5a9/aad-acne-keloidalis-nuchae-symptoms-itch.jpg?w=268", "https://images.ctfassets.net/1ny4yoiyrqia/6asM388ZXOmkXOGpqZQEa0/a3eddaa1654e5ff739b4a0c440ddbd00/aad-woman-using-skin-cream.jpg?w=268", "https://images.ctfassets.net/1ny4yoiyrqia/2QA1kffRbxfra5zyAA3jqa/16639a11c4fdbf8eddec360f6357375e/aad-biosimilars-dermatologist-patient.jpg?w=268", "https://images.ctfassets.net/1ny4yoiyrqia/3mEc0WoPtkMwpDXbOfFEgL/fb5a6e29e8a8e2a96b39fde6832a1186/aad-itchy-skin.jpg?w=268", "https://images.ctfassets.net/1ny4yoiyrqia/56SLYkw1BMNaUOkz0qLmG3/d8812b0d9167056c3b3ab59eb00845c3/aad-tattoo-removal-card.jpg?w=268"], "top_img": "https://images.ctfassets.net/1ny4yoiyrqia/41KzKXjwa194bLy8aONuem/c26124e4580aac1ba5e47e6e6a534de0/aad-scar-removal-laser-featured.jpg?w=268", "keywords": [], "authors": [], "canonical_link": "https://www.aad.org/public/everyday-care/skin-care-secrets/routine/apply-self-tanner", "title": "How to apply self-tanner", "meta_data": {"viewport": "width=device-width, initial-scale=1", "og": {"title": "How to apply self-tanner", "type": "article", "description,": "These basic tips will help you apply self-tanner so you get even coverage and longer-lasting results.", "url": "https://www.aad.org/public/everyday-care/skin-care-secrets/routine/apply-self-tanner"}, "description": "These basic tips will help you apply self-tanner so you get even coverage and longer-lasting results."}, "movies": ["https://www.youtube.com/embed/nqpGvQwTaao?rel=0"], "publish_date": null, "source": "https://www.aad.org", "summary": ""}