{"url": "https://www.biography.com/people/robin-wright-17191556", "text": "(1966-)\n\nWho Is Robin Wright?\n\nBorn in Texas in 1966, Robin Wright began her career as a model before landing on the soap opera Santa Barbara. She made the leap from television to film and gained fame for her roles in such hits as The Princess Bride and Forrest Gump, as well as her marriage to actor Sean Penn. Wright has garnered multiple Emmy Award nominations for her role as Claire Underwood on the original Netflix series House of Cards, and in 2014 she became the first actress to win a Golden Globe for an online-only series.\n\nEarly Life\n\nRobin Wright was born in Dallas, Texas, on April 8, 1966, but grew up in San Diego, California. The daughter of a pharmaceutical executive and an independent executive sales director for Mary Kay cosmetics, Wright was a natural beauty and began modeling at an early age, traveling to both Paris and Japan while still in high school. Wright says she pursued modeling mainly for the traveling opportunities it provided: \"I think that the whole idea of beauty distorts your ability to not only find yourself but to have a healthy sense of your identity. ... And then I went to Europe and I didn't want to come home. I loved Europe so much.\"\n\nEven though, as a teenager, Wright was elected homecoming queen and had a successful modeling career, she was actually more interested in dancing than being photographed. \"I think the inception of my interest in arts was when I was around 9 or 10 and I started dancing, she says. \"I was really convinced that I was going to go to New York and be onstage in A Chorus Line. Then that idea was sort of usurped from my life because we moved to San Diego.\"\n\nBig Break & Career Highlights\n\nAfter high school, Wright was encouraged to act by her modeling agent and landed a lead part on the soap opera Santa Barbara. Though she lacked any formal acting training and often shot her scenes the same day she received a script, with no rehearsal, Wright earned three Daytime Emmy nominations for her work on the show.\n\nThis drew the attention of director Rob Reiner, who decided to audition her for the lead role in his new film, an irreverent 1987 take on Robin Hood-style swashbuckler films called The Princess Bride. An iconic film that resonated with children and adults alike, The Princess Bride launched Wright to stardom; her winning performance as Princess Buttercup suddenly transformed her into a bona fide film actor at the age of 21. A year after the film's release, Wright divorced her first husband of two years, Dane Witherspoon.\n\nDespite the success of The Princess Bride, Wright was ambitious and did not want to be typecast early on as a victimized damsel character actor. Determined not to let her blond hair or good looks get in the way of more complex roles, she turned down one-dimensional, passive female parts in blockbusters like Jurassic Park and Batman Forever in favor of a much darker role in State of Grace, a gritty 1990 film about Irish gangsters.\n\nWhile shooting the film, she fell in love with her costar, Sean Penn, and became pregnant shortly thereafter with the pair's first daughter, Dylan Frances, followed soon by their son, Hopper Jack. She turned down the role of Maid Marian in Robin Hood: Prince of Thieves due to her pregnancy but came back for The Playboys, an Irish film.\n\nHer next role would be a big one: She played Jenny in Forrest Gump, a film that became a huge hit and has remained an enduring moviegoer favorite. Like many of Wright's characters, Jenny is a tortured soul who suffers from drug addiction and depression but has a wild spirit and cannot be contained. The movie ends with Jenny dying from AIDS, a far cry from the irrepressible damsel Wright played in The Princess Bride.\n\nMarriage to Sean Penn\n\nFollowing the smashing critical and box-office success of Forrest Gump, Wright and Penn wed in 1996, the beginning of a passionate and often tumultuous marriage. Being linked to an incredibly famous man was strange for Wright, since she never thought of herself as a celebrity: \"Famous is celebrityism, and I don't want that ... I know that I'm not that. Everybody knows who you are, I can't imagine living that life, but I don't think I consider myself famous.\"\n\nFor much of their marriage, Wright did not work at all and instead led a very private life devoted to her two children and her husband. When she did return to acting, she worked closely with her husband; the two starred as star-crossed, unhinged lovers in Nick Cassavetes's She's So Lovely, and Wright later played Jack Nicholson's love interest in Penn's third film as a director, The Pledge.\n\nIn 2004, she said of her then-husband, \"It's always been drama in my life with Sean, always. It's pronounced: That's the word I would use for him, in every way —presence, emotional life—'pronounced'. I think it's in his blood. He's always at the heart of something. Never a dull moment.\" The drama finally came to an end in 2007, when the couple filed for divorce. They soon reunited, until the summer of 2010, at which point they divorced for good and she changed her name from Robin Wright-Penn to simply Robin Wright.\n\nShe became engaged to actor Ben Foster in January 2014, but the couple called it quits 10 months after the announcement. Later, in 2017, Wright was romantically linked to Clement Giraudet, the worldwide VIP relations manager for French fashion house Saint Laurent. The two were married in France in August 2018.\n\n'House of Cards'\n\nIn 2013, Wright landed a starring role opposite Kevin Spacey in Netflix’s hit online-only series House of Cards. A sly and dark look at politics in Washington, D.C., the slick drama immediately resonated with critics and fans alike. Wright's Claire Underwood, the wife of Spacey's devious and unctuous politician Frank Underwood, is a power player in her own right and a force to be reckoned with. For her knockout performance, the actress earned five consecutive Emmy nominations for Outstanding Lead Actress in a Drama Series from 2013 through 2017. In 2014, she took home the Golden Globe for the role.\n\nProduction paused on House of Cards in late 2017, after Spacey was enveloped by a torrent of sexual harassment accusations. In December, Netflix announced that production would resume in early 2018 for eight episodes of the show's sixth and final season, with Spacey gone and Wright taking over the lead role.\n\nAddressing the issue of her former co-star in a July 2018 Today interview, Wright said that she and the crew \"were all surprised, of course, and ultimately saddened\" to learn of the allegations against Spacey. She said her interactions with him were \"respectful\" and \"professional,\" and they would share laughs sometimes on set, but added that she didn't know him well on a personal level.\n\nWright is contemplative on her long and successful career and is always preparing for new challenges: \"I'm ready to continue this work of actually not being afraid. I just feel like it took me a long time to grow up and to stop being inhibited in my work. I would read scripts and go, 'Oh, I'm not right. I could never do this. I could never achieve this character. This would be better for somebody else.' ... I don't have that fear of jumping off the cliff, where before, I always used to just stop and ask for directions, and you would kind of see that reticence in the work. So now, I'm completely rejuvenated when I get out there, and I'm ready to do more, play more.\"\n\nQUICK FACTS\n\nName: Robin Wright\n\nBirth Year: 1966\n\nBirth date: April 8, 1966\n\nBirth State: Texas\n\nBirth City: Dallas\n\nBirth Country: United States\n\nGender: Female\n\nBest Known For: Actress Robin Wright is known for her roles in such films as 'The Princess Bride' and 'Forrest Gump,' as well as on the Netflix series 'House of Cards.'\n\nIndustries\n\nFilm\n\n\n\nDrama\n\n\n\nComedy\n\nAstrological Sign: Aries\n\nNacionalities\n\nAmerican\n\nInteresting Facts\n\nGolden Globe-winning actress Robin Wright got her acting start in the world of soap operas, appearing in more than 500 episodes of 'Santa Barbara.'\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION", "images": ["https://www.biography.com/_assets/design-tokens/biography/static/images/logos/logo.5ec9b18.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/actor-dwayne-johnson-attends-the-black-adam-photocall-at-nh-news-photo-1758907441.pjpeg?crop=0.551xw:0.827xh;0.253xw,0&resize=360:*", "https://www.biography.com/_assets/design-tokens/biography/static/images/logos/network-logo.04aa008.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/sydney-sweeney-attends-the-lionsgate-presentation-during-news-photo-1762354205.pjpeg?crop=0.551xw:0.827xh;0.239xw,0.0673xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/actor-james-dean-poses-for-a-warner-bros-publicity-shot-for-news-photo-1760127578.pjpeg?crop=0.8173xw:1xh;center,top&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://hips.hearstapps.com/hmg-prod/images/pictured-eddie-murphy-on-february-15-2015-news-photo-1762808496.pjpeg?crop=0.631xw:0.942xh;0.111xw,0.0577xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/robin-wright-gettyimages-1131721707.jpg?crop=1xw:0.9994447529150472xh;center,top&resize=640:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://hips.hearstapps.com/hmg-prod/images/charlie-hunnam-attends-the-2024-met-gala-celebrating-news-photo-1729104230.jpg?crop=1.00xw:0.667xh;0,0.0741xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://hips.hearstapps.com/hmg-prod/images/claire-danes-attends-the-world-premiere-of-downton-abbey-a-news-photo-1762895763.pjpeg?crop=1.00xw:0.744xh;0,0.0842xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://www.biography.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/megan-moroney-performs-onstage-during-the-2024-cma-music-news-photo-1762964027.pjpeg?crop=0.495xw:0.743xh;0.332xw,0.0745xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/actor-john-candy-poses-for-a-photo-session-on-april-12-1993-news-photo-1760022606.pjpeg?crop=1.00xw:0.804xh;0,0.0536xh&resize=360:*", "https://hips.hearstapps.com/vidthumb/images/inkt-ep04-thumbnail-682dd7da2d33d.jpg?crop=1xw:1xh;center,top", "https://hips.hearstapps.com/hmg-prod/images/cynthia-erivo-at-the-wicked-for-good-new-york-premiere-held-news-photo-1763498079.pjpeg?crop=0.636xw:0.947xh;0.176xw,0.0526xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/of-southern-california-torch-of-liberty-dinner-1995-penny-news-photo-1760551191.pjpeg?crop=1xw:0.87783xh;center,top&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/robin-wright-gettyimages-1131721707.jpg?crop=1xw:0.4997223764575236xh;center,top&resize=1200:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/eddie-murphy-attends-the-80th-annual-golden-globe-awards-at-news-photo-1762788000.pjpeg?crop=1.00xw:0.669xh;0,0.0791xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1146827623.jpg?crop=1.00xw:1.00xh;0,0&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/robin-wright-gettyimages-1131721707.jpg?crop=1xw:0.4997223764575236xh;center,top&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.biography.com/actors/robin-wright", "title": "Movies, Career & Life", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Robin Wright - Movies, Career & Life", "description": "Actress Robin Wright is known for her roles in such films as 'The Princess Bride' and 'Forrest Gump,' as well as on the Netflix series 'House of Cards.'", "keywords": "Last Name: Wright, Birth Month/Day: April 8, First Name: Robin, Birth City: Dallas, Birth Year: 1966, Nationality: American, Life Events/Experience: Won Awards, Birth State: Texas, Industry/Interest Area: Comedy, Industry/Interest Area: Drama, Industry/Interest Area: Film, Astrological Sign: Aries, Birth Month: 4, Birth Country: United States", "theme-color": "#000000", "og": {"site_name": "Biography", "title": "Robin Wright - Movies, Career & Life", "description": "Actress Robin Wright is known for her roles in such films as 'The Princess Bride' and 'Forrest Gump,' as well as on the Netflix series 'House of Cards.'", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/robin-wright-gettyimages-1131721707.jpg?crop=1xw:0.4997223764575236xh;center,top&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.biography.com/actors/robin-wright", "type": "article"}, "article": {"publisher": "https://www.facebook.com/Biography", "opinion": "false", "section": "Famous Actors", "modified_time": "2022-09-09T20:02:14Z", "published_time": "2022-09-09T20:02:14Z"}, "parsely-metadata": "{\"socialHeadline\":\"Robin Wright - Movies, Career & Life\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/robin-wright-gettyimages-1131721707.jpg?crop=1xw:0.9994447529150472xh;center,top&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/robin-wright-gettyimages-1131721707.jpg?crop=1xw:0.4997223764575236xh;center,top&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/robin-wright-gettyimages-1131721707.jpg?crop=1xw:0.9994447529150472xh;center,top", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/robin-wright-gettyimages-1131721707.jpg?crop=1xw:0.4997223764575236xh;center,top&resize=640:*", "card": "summary_large_image"}, "sailthru.excerpt": "(1966-)Who Is Robin Wright?Born in Texas in 1966, Robin Wright began her career as a model before landing on the soap opera Santa Barbara. She made the leap from television to film and gained fame for her roles in such hits as The Princess Bride and Forrest Gump, as well", "sailthru.tags": "actors,Famous Actors,Biography-US", "sailthru.date": "2022-09-09 20:02:14", "sailthru.socialtitle": "Robin Wright - Movies, Career & Life", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1662753734.0, "source": "https://www.biography.com", "summary": ""}