{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/orlando-bloom-net-worth/", "text": "What is Orlando Bloom's Net Worth and Salary?\n\nOrlando Bloom is an English actor who has a net worth of $40 million. Orlando Bloom quite literally shot to stardom. He auditioned for the role that made him a household name while he was still in theater school at the famed Guildhall School of Music and Drama in London and won the part two days after graduation. That role, as Legolas in \"The Lord of the Rings\" trilogy, made him an instant star and led to starring roles in the massive \"Pirates of the Caribbean\" franchise and other popular films, including \"Troy,\" \"Kingdom of Heaven,\" \"Elizabethtown,\" \"Love and Other Disasters,\" \"New York, I Love You,\" and \"The Three Musketeers.\" He also appeared in \"The Hobbit\" trilogy in the role that first put him on the map, Legolas, while also starring on Broadway in a new production of \"Romeo and Juliet.\" In addition to his work in film, he has appeared on various television shows, picked up a few acting awards, married supermodel Miranda Kerr… divorced her… then married Katy Perry. In April 2014, he received a star on the Hollywood Walk of Fame.\n\nEarly Life\n\nOrlando Jonathan Blanchard Copeland Bloom was born on January 13, 1977, in Canterbury, Kent. His mother, Sonia Constance Josephine (née Copeland), was born in India, and her family also lived in Australia and Japan. Until he was thirteen years old, Bloom believed that his biological father was his mother's husband, the anti-Apartheid South African novelist Harry Saul Bloom, who actually had passed away when he was just four years old. His mother later told him that his biological father was actually the family friend (and his mother's partner) Colin Stone.\n\nBloom attended St Edmund's School in Canterbury and later moved to London in 1993 to attend Fine Arts College, Hampstead, where he took part in a two-year A-level course in Drama, Photography, and Sculpture. Then, he joined the National Youth Theatre and then earned a scholarship to the British American Drama Academy. His earliest professional acting roles were in episodes on the shows \"Casualty\" and \"Midsomer Murders,\" as well as the film \"Wilde\" (1997). After these projects, he enrolled at the Guildhall School of Music and Drama in London to study acting.\n\nCareer\n\nJust two days after he graduated from Guildhall in 1999, Bloom received his first major role. He was cast as the elf Legolas in \"The Lord of the Rings\" film trilogy (2001-2003); he appeared in the films \"The Fellowship of the Ring\" (2001), \"The Two Towers\" (2002), and \"The Return of the King\" (2003). For three years in a row, the entire cast of the \"Rings\" films were nominated for the Screen Actors Guild Best Ensemble Acting Award, and they eventually won in the category in 2003 for the third \"Ring\" film. During this period, he also appeared in the Ridley Scott film \"Black Hawk Down\" (2001).\n\nOrlando Bloom followed up this successful trilogy with a starring role in the Disney blockbuster hit \"Pirates of the Caribbean: The Curse of the Black Pearl\" (2003) as Will Turner, opposite stars Keira Knightley and Johnny Depp. This ended up being another successful franchise, and Bloom would go on to star in two more \"Pirates of the Caribbean\" films: \"Pirates of the Caribbean: Dead Man's Chest\" (2006) and \"Pirates of the Caribbean: At World's End\" (2007). He also made a brief supporting appearance as Will Turner in the film \"Pirates of the Caribbean: Dead Men Tell No Tales\" (2017). In part thanks to his roles in the highly popular \"Lord of the Rings\" and \"Pirates of the Caribbean\" franchises, Bloom was actually the most-searched man on Google News in 2006. By May 2007, he had appeared in four out of the top 15 highest-grossing films of all time (at the time).\n\nBloom made a return to the world of \"Lord of the Rings\" when he reprised his role as Legolas in the films \"The Hobbit: The Desolation of Smaug\" (2013) and \"The Hobbit: The Battle of the Five Armies\" (2014). The \"Hobbit\" films are prequels to the \"Lord of the Rings\" films. Other films Bloom has starred in include the historical war drama \"Troy\" (2004), in an ensemble cast featuring Brad Pitt, Eric Bana, and Peter O'Toole; Kingdom of Heaven (2005), directed by Ridley Scott; \"Elizabethtown\" (2005), opposite Kirsten Dunst; \"New York, I Love You\" (2009), a film that actually is 12 short films combined together; the romantic adventure film \"The Three Musketeers\" (2011), \"Zulu\" (2013), \"Unlocked\" (2017), and \"Romans\" (2017). Since, he has appeared in \"The Outpost\" (2021), \"Needle in a Timestack\" (2021), and \"Gran Turismo\" (2023).\n\nOriginally, Bloom's goal was to become a professional stage actor after graduating. As such, in addition to his many popular films, Bloom has also remained involved in theater. In 2007, he took to the stage as part of the cast of a London revival of the play \"In Celebration,\" written by David Storey. He then made his Broadway debut in 2013 as Romeo in \"Romeo and Juliet\" at the Richard Rodgers Theatre and followed this production with a starring role in the 2018 Trafalgar Studios production of the play \"Killer Joe.\"\n\nBloom has also been involved in several television projects. In 2006, he guest starred on the sitcom \"Extras\" as an exaggerated and narcissistic version of himself. He has also appeared on the shows \"LA Phil Live\" (2011), \"Easy\" (2016), and \"Carnival Row\" (2019). In 2021, he voiced Prince Harry in the animated series \"The Prince\" and appeared in \"CBeebies Bedtime Story.\"\n\nLord of the Rings Salary\n\nIn a 2019 interview, Orlando revealed he made just $175,000 to star in ALL THREE \"Lord of the Rings\" movies. That's $58,333 per film, pre-tax.\n\nOther Work\n\nBloom starred in a Gap television advertisement opposite actress Kate Beckinsale in 2002. He also appeared in a commercial on late-night Japanese TV in 2007, promoting the cosmetics brand Shiseido. He was named a UNICEF Goodwill Ambassador in 2009 and has worked with the organization to raise awareness of the education crisis for children in Ukraine during the country's military conflict with Russia.\n\nPersonal Life\n\nFrom 2003 to 2006, Bloom has an on-an-off relationship with American actress Kate Bosworth. He began dating Australian model Miranda Kerr in late 2007, and they got married in 2010. Together, they have one child, a son born in January 2011. Bloom and Kerr announced their separation in October 2013 and divorced by the end of the year. He began dating American singer Katy Perry in January 2016, and they separated in February 2017. However, Bloom and Perry reunited in April 2018, and they became engaged on February 14, 2019. He reportedly gave her an engagement ring that cost $5 million. On March 5, 2020, Perry broke the news that they were expecting their first child together in the music video for her single \"Never Worn White.\" In August, she gave birth to their daughter.\n\nReal Estate\n\nIn March 2019, Orlando listed his Beverly Hills mansion for $9 million. He bought the home in 2017 for $7 million.\n\nIn October 2020, Katy and Orlando paid $14.2 million for a roughly 9-acre estate in Montecito, California. Here is a video tour:\n\nThe home has become the center of a lawsuit filed by Carl Westcott, the previous owner who sold the property to Bloom and Perry through their business manager, Bernie Gudvi. Westcott's attorneys allege that he was not of sound mind when he made the sale and didn't actually want to sell the home. Westcott suffered from Huntington's Disease and was also heavily drugged at the time to undergo a lumbar spinal fusion surgery.", "images": ["https://vz.cnwimg.com/thm/1JoH3482haSLevnlEMdqhrz36y0=/132x132/center/top/filters:format(webp)/2009/11/George-Clooney.jpg", "https://vz.cnwimg.com/thm/I4dSiTJhq0kprSuO--deoPCEAmQ=/132x132/center/top/filters:format(webp)/2020/06/taylor.png", "https://vz.cnwimg.com/thm/KNDSqD-9inbRekV6AGgXDEG2Scw=/375x35:810x586/132x132/filters:format(webp):strip_exif()/2015/09/GettyImages-476575299.jpg", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "https://vz.cnwimg.com/thm/0_s43JMawX61s-Cbfus5LfOXd-8=/132x132/center/top/filters:format(webp)/2020/09/Keira-Knightley.jpg", "https://vz.cnwimg.com/thm/0dOqT2nlNQM7u_J-5xWrCsf2nAw=/132x132/center/top/filters:format(webp)/2020/02/Angelina-Jolie.png", "https://vz.cnwimg.com/thm/k-lxc0XGy5axgIpPMCBfpf_fD_I=/132x132/center/top/filters:format(webp)/2019/11/Lee-Arenberg.jpg", "https://vz.cnwimg.com/thm/Y14fttV9jls9mxFLuNAHJTnNWTE=/132x132/center/top/filters:format(webp)/2019/10/denzel-washington-1.jpg", "https://vz.cnwimg.com/thm/yboGsO77E1kQwELLmrwRZv_4RmE=/132x132/center/top/filters:format(webp)/2017/02/GettyImages-528215436.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/thm/lt1abKKVHSBtY-US0k9GLU9MTmM=/132x132/center/top/filters:format(webp)/2009/09/Brad-Pitt.jpg", "https://vz.cnwimg.com/thm/GY0aOds_cLfv2igawzzldoQnf00=/132x132/center/top/filters:format(webp)/2014/08/GettyImages-74198182.jpg", "https://vz.cnwimg.com/thm/_YC_fc2JL2tHGt5pGDUqPCR8QnQ=/132x132/center/top/filters:format(webp)/2022/09/Gore-Verbinski.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/thm/dXuAPIEBU--L_kRib4u0nSzjUtE=/132x132/center/top/filters:format(webp)/2020/04/Megan-Fox.jpg", "https://vz.cnwimg.com/thm/NaQw304qY2_9MKJ1i0W4N3fR5iA=/600x300/center/top/filters:format(webp)/2010/01/Orlando-Bloom.jpg", "https://vz.cnwimg.com/thm/lY3-oCS-xIdiqDaOi1qHd6UaTjg=/132x132/center/top/filters:format(webp)/2009/09/Cristiano-Ronaldo.jpg", "https://vz.cnwimg.com/thm/UxnQSql1h0QyX1CgkPqKhTxCTHM=/132x132/center/top/filters:format(webp)/2009/09/Jennifer-Aniston.jpg", "https://vz.cnwimg.com/wp-content/uploads/2010/01/Orlando-Bloom.jpg?x46379", "https://vz.cnwimg.com/thm/-a50H7gNgI1b08aDePRgAVIaC6o=/132x132/center/top/filters:format(webp)/2020/01/katy-perry2.jpg", "https://vz.cnwimg.com/thm/KFAqJ9F4o80l6an2fe78-0jw28s=/132x132/center/top/filters:format(webp)/2019/04/rr.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2010/01/Orlando-Bloom.jpg?x46379", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/orlando-bloom-net-worth/", "title": "Orlando Bloom Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Orlando Bloom Net Worth and Salary: Orlando Bloom is an English actor who has a net worth of $40 million. Orlando Bloom quite literally shot to stardom. He auditioned for the role that made him a household", "slick": {"wpversion": "3.0.1", "wppostid": 2805, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2010/01/Orlando-Bloom.jpg?x46379", "group": "post", "category": "actors:Actors"}, ";": "richest-celebrities:Richest Celebrities", "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "cnw": {"wppostid": 2805}, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Orlando Bloom Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/orlando-bloom-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/01/Orlando-Bloom.jpg?x46379", "site_name": "Celebrity Net Worth", "description": "What is Orlando Bloom's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2025-04-02T17:44:26+00:00", "published_time": "2020-06-17T17:04:30+00:00", "section": "Actors", "tag": "richest actors"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/01/Orlando-Bloom.jpg?x46379", "title": "Orlando Bloom Net Worth", "description": "Orlando Bloom Net Worth and Salary: Orlando Bloom is an English actor who has a net worth of $40 million. Orlando Bloom quite literally shot to stardom. He auditioned for the role that made him a hous"}}, "movies": [], "publish_date": 1592413470.0, "source": "https://www.celebritynetworth.com", "summary": ""}