{"url": "https://en.wikipedia.org/wiki/David_Spade", "text": "American stand-up comedian and actor (born 1964)\n\nDavid Wayne Spade (born July 22, 1964) is an American stand-up comedian, actor and podcaster. His comedic style, in both his stand-up material and acting roles, relies heavily on sarcasm and self-deprecation.[1][2] For his roles on television, Spade has received nominations for four Primetime Emmy Awards and two Golden Globe Awards. In 2003, he received a star on the Hollywood Walk of Fame.\n\nAfter several years as a stand-up comedian, Spade rose to prominence as a writer and cast member on the NBC sketch comedy series Saturday Night Live from 1990 to 1996. He played Dennis Finch in the NBC sitcom Just Shoot Me! (1997–2003) for which he was nominated for the Primetime Emmy Award for Outstanding Supporting Actor in a Comedy Series. He later acted in the ABC sitcom 8 Simple Rules (2004–2005) and the CBS sitcom Rules of Engagement (2007–2013). He hosted the Comedy Central late-night talk show Lights Out with David Spade (2019–2020).\n\nOn film, he took leading roles in Tommy Boy (1995), Black Sheep (1996), Senseless (1998), Joe Dirt (2001), Dickie Roberts: Former Child Star (2003), The Do-Over (2016), and The Wrong Missy (2020) with supporting roles in The Benchwarmers (2006), Grown Ups (2010), its 2013 sequel, and The Ridiculous 6 (2015). He voiced Ranger Frank in The Rugrats Movie (1998), Kuzco in Disney's The Emperor's New Groove (2000) and Kronk's New Groove (2005), and Griffin the Invisible Man in the Hotel Transylvania film series (2012–2022).\n\nSince 2022, Spade has hosted the podcast Fly on the Wall with Dana Carvey. He hosted the Fox game show Snake Oil (2023).\n\nEarly life [ edit ]\n\nSpade was born on July 22, 1964, in Birmingham, Michigan, to Judith J. (née Meek), a writer and magazine editor, and Wayne M. \"Sam\" Spade, a sales representative.[3][4][5][6] His older brothers are Bryan and Andy Spade.[7] The latter is an entrepreneur who, together with David's sister-in-law Kate Spade, co-founded the designer brand Kate Spade New York.[citation needed]\n\nSpade and his family moved to Scottsdale, Arizona,[8][9] when he was four years old.[10] His parents divorced soon thereafter, and he and his brothers were raised for the most part by their mother, in relative poverty.[11]\n\nSpade attended Saguaro High School and later Scottsdale Community College before transferring to Arizona State University and dropping out shortly thereafter since he was making a decent living doing stand-up.[12] He also was a member of the Sigma Alpha Epsilon fraternity.[13] Spade performed standup at the university's long-running sketch comedy show, Farce Side Comedy Hour, on numerous occasions. In the mid-1980s he also did stand-up in the Monday night comedy show at Greasy Tony's Pizza in Tempe, Arizona.[14]\n\nCareer [ edit ]\n\n1987–1997: Early work and Saturday Night Live [ edit ]\n\nSpade in 2004\n\nSpade began performing stand-up comedy after dropping out of college. After being spotted by a talent agent while performing at The Improv in Los Angeles he was cast in the 1987 film Police Academy 4.[15] With the help of friend and fellow comedian Dennis Miller, he joined Saturday Night Live in 1990.[14] Spade started as a writer and eventually moved up to cast member. While there, he became known for his brand of sarcasm, and his characters in a number of sketches were hits. Some of them include a flight attendant for \"Total Bastard Airlines\" who bids a dismissive \"Buh-Bye\" to each passenger upon disembarking; a receptionist for Dick Clark who, as a matter of policy, asks people indiscriminately, \"And you are?\"; and the quick-witted \"Hollywood Minute\" reporter who roasts celebrities with personal one-liners. Other characters include Christy Henderson from the Gap Girls and Karl from the Karl's Video sketches. He also did impressions of various celebrities, including Brad Pitt and Michael J. Fox. According to interviews with Spade, most of the material that he wrote early in his time at SNL was given to Dana Carvey to perform on the show. Spade, alongside Chris Farley, Chris Rock, Adam Sandler and Rob Schneider were known as the \"Bad Boys\" of SNL.[16]\n\nAfter the major cast overhaul following the 1994–1995 season, Spade agreed to remain on the show for the 1995–96 season to serve as a bridge between the former cast and new cast members Will Ferrell, Molly Shannon, and Cheri Oteri. During this season, Spade was given a weekly segment called \"Spade in America\" which was a spin-off of his \"Hollywood Minute\" and \"Weekend Update\" commentaries. On December 9, 1995, Spade revived \"Hollywood Minute\" inside one of his \"Spade in America\" segments; Spade joked, \"Look, children, it's a falling star. Make a wish!\" next to a picture of former Saturday Night Live cast member Eddie Murphy.[17] The one-liner referred to Murphy's lack of recent box office success, especially the bomb Vampire in Brooklyn. The quip made Murphy turn against both Spade and SNL for several years afterward.[18] Spade wrote in his 2015 memoir that he received an angry phone call from Murphy two days later at the SNL offices; the two did not reconcile until a chance meeting in 2011.[19][20] Spade left SNL in 1996. He returned to host an episode in 1998 and another in 2005.[21]\n\nSpade starred with fellow Saturday Night Live cast member Chris Farley in two buddy comedy films, Tommy Boy (1995) and Black Sheep (1996), both of which were distributed by Paramount Pictures. The two were planning a third film together, but Farley died of a drug overdose in 1997 at the age of 33 and thus it was cancelled. When Spade declined to attend Farley's funeral, rumors abounded that there had been a falling out between the two. Spade stated that their friendship had been under some tension, partly because of Farley's drug problem and reckless lifestyle, which Spade admittedly could not keep up with. However, it never escalated to ill will, and that the reason he did not attend the funeral was simply because he could not handle it emotionally.[22]\n\n1997–2018: Sitcom success and film roles [ edit ]\n\nAlthough he received several offers to star in his own TV shows, he turned them down and joined the ensemble cast of Steven Levitan's office sitcom Just Shoot Me!, opposite Laura San Giacomo and George Segal, which ran for seven seasons from 1997 to 2003. He played a sarcastic receptionist, Dennis Finch. In 1998, Spade appeared with Marlon Wayans in the buddy comedy film Senseless and voiced Ranger Frank in The Rugrats Movie. In 2000, he provided the voice of Kuzco in Disney's buddy comedy film, The Emperor's New Groove (2000) and would later reprise the role in its direct-to-video sequel Kronk's New Groove (2005).\n\nWhile appearing on Just Shoot Me, Spade had his first solo starring role as the title character in the 2001 film Joe Dirt, which was a modest box office success. The film was co-written by Spade and Fred Wolf. Spade starred again in the 2003 film Dickie Roberts: Former Child Star, again co-written by Spade and Wolf. These were the first of many films in which Spade has appeared that were produced by another Saturday Night Live castmate, Adam Sandler. Most notable among these are the films Grown Ups (2010) and Grown Ups 2 (2013), both of which included Spade and Sandler among the lead roles, and both of which were major box office hits. Other collaborations with Sandler include Grandma's Boy (2006), The Benchwarmers (2006), I Now Pronounce You Chuck & Larry (2007), Jack & Jill (2011), Joe Dirt 2 (2015), The Ridiculous 6 (2015), The Do-Over (2016), The Wrong Missy (2020), as well as voicing Griffin the Invisible Man in the Hotel Transylvania film series (2012–2022).\n\nSpade hosted both the Teen Choice Awards and SpikeTV's Video Game Awards in 2003. He voiced characters on several episodes of Beavis and Butt-Head and produced his own TV series Sammy in 2000. In 2004, he joined the cast of 8 Simple Rules, following the death of the sitcom's star, John Ritter, for the show's third and final season. He hosted the Comedy Central TV show The Showbiz Show with David Spade for three seasons, from September 2005 to October 2007. On the show, Spade made fun of Hollywood and celebrities in a manner similar to his old \"Hollywood Minute\" segment on SNL.[23]\n\nIn the 2006 video game The Legend of Spyro: A New Beginning, Spade provided the voice of Spyro's dragonfly companion, Sparx.[24] From 2007 to 2013, he starred as Russell Dunbar in the ensemble CBS sitcom Rules of Engagement. In 2010, he worked with TBS on a pilot for an animated series based on Joe Dirt, but it was eventually dropped.[25]\n\nIn 2014, Spade had a guest role on an episode of ABC sitcom The Goldbergs (on which George Segal, his former Just Shoot Me co-star, has a major role as \"Pops\", the protagonist's grandfather). The end credits featured an interaction between Pops and Spade's character.[26] In 2018, Spade appeared in his first major dramatic role in the movie Warning Shot co-starring Bruce Dern and James Earl Jones, with Spade playing the dangerous grandson of a powerful business tycoon (Dern).\n\n2019–present: Late-night talk show and podcast [ edit ]\n\nIn 2019, he started hosting a new late-night show called Lights Out with David Spade on Comedy Central. The television spot was right after The Daily Show in the former slot inhabited by The Colbert Report, The Nightly Show with Larry Wilmore and The Opposition with Jordan Klepper.[27] As the production was put on hold during the COVID-19 pandemic, Comedy Central announced the show would not return to the channel once production can resume, but is instead being shopped around to a third-party broadcaster.[28]\n\nIn August 2020, Spade guest hosted two episodes of Jimmy Kimmel Live! while Kimmel took a summer vacation.[29] In 2022, Spade began co-hosting the Fly on the Wall podcast with fellow Saturday Night Live alum Dana Carvey. Guests include former cast members and hosts of SNL.[30] In 2024, the Superfly video podcast (a spinoff of Fly on the Wall) co-hosted by Spade and Carvey was launched.[31] On April 18, 2023, it was announced that Spade would host Snake Oil, a new game show broadcast by Fox.[32][33]\n\nPersonal life [ edit ]\n\nSpade has dated numerous actresses and celebrities, including Heather Locklear, Lara Flynn Boyle, Julie Bowen, Teri Hatcher, and Naya Rivera,[34][35] with E! News calling him \"a bachelor-era George Clooney of the comedy world\".[36]\n\nHe and 2005 Playboy Playmate Jillian Grace have a daughter together.[37][38][39]\n\nOn November 29, 2000, Spade was attacked by his assistant, David Warren \"Skippy\" Malloy, while he was sleeping. Malloy used a stun gun on Spade after breaking into his home in the early morning. In an interview with Howard Stern, Spade stated that he managed to get away from the 350-pound (160 kg) Malloy, run to his bedroom, grab his gun and defend himself by locking himself in a bathroom armed with the shotgun. Malloy pleaded guilty and avoided jail time on condition that he seek counseling for drug and psychological problems. He subsequently received five years' probation, was ordered to stay at least 100 yards away from Spade, and was required by the court to perform 480 hours of community service.[40][41][42]\n\nIn December 2005, Spade donated $100,000 to the Phoenix Police Department to buy 300 firearms, including 50 AR-15 rifles for its patrol officers.[43][44] Spade also donated $200,000 to the Oklahoma tornado relief program on May 20, 2013, $100,000 toward the ALS ice bucket challenge in 2014, and $100,000 to the National Alliance on Mental Illness (NAMI) in June 2018 following the suicide of his sister-in-law Kate Spade, a fashion designer.[45]\n\nSpade primarily resides in Beverly Hills, California, although he also owns residences in Hollywood Hills and West Hollywood.[46][47] His Beverly Hills house was burglarized in June 2017.[47]\n\nFilmography [ edit ]\n\nComedy specials [ edit ]\n\nYear Title Role Notes 1998 David Spade: Take The Hit Himself HBO special 2014 David Spade: My Fake Problems Comedy Central special 2022 David Spade: Nothing Personal Netflix special 2025 David Spade: Dandelion Amazon Prime special\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nVideo games [ edit ]\n\nMusic videos [ edit ]\n\nWeb [ edit ]\n\nYear Title Role Notes 2022–present Fly on the Wall Himself/Co-host 2024–present Superfly\n\nAwards and nominations [ edit ]\n\nOn September 5, 2003, Spade received a star on the Hollywood Walk of Fame.[51]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/David_Spade_1_%28cropped%29.jpg/250px-David_Spade_1_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/David_Spade2_%28cropped%29.jpg/907px-David_Spade2_%28cropped%29.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/David_Spade2_%28cropped%29.jpg/250px-David_Spade2_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/40px-Wikiquote-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/David_Spade2_%28cropped%29.jpg/907px-David_Spade2_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/David_Spade", "title": "David Spade", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/David_Spade2_%28cropped%29.jpg/907px-David_Spade2_%28cropped%29.jpg", "width": 907, "height": 1200}, "title": "David Spade - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}