{"url": "https://www.inquisitr.com/4573320/robert-pattinson-is-reportedly-leaning-on-katy-perry-following-alleged-breakup-with-fka-twigs/", "text": "After his breakup with Kristen Stewart, Twilight movie hunk, Robert Pattinson, got engaged with French singer FKA Twigs. Like any other celebrity affairs, even their relationship was constantly under media’s radar. Kristen’s fans even stated that Robert made a hasty decision when he decided to marry Tahliah Barnett. Things started to go awry when it was recently reported that Robert Pattinson and FKA Twigs are no longer a couple and it is Katy Perry who is mentally supporting the actor during this tough time.\n\nRobert Pattinson’s personal life has remained the talk of tinsel town ever since it was first reported that he had feelings for his Twilight movie co-star Kristen Stewart. The couple dated for several years, but when the reports of Kristen’s alleged affair with Rupert Sanders surfaced, the Harry Potter and The Goblet of Fire movie actor decided to end his affair with her.\n\nEven after Kristen issued a public apology, Robert did not come back to her and decided to move on with FKA Twigs.\n\nAs earlier reported by the Inquisitr , Robert Pattinson and FKA Twigs have reportedly ended their two-year long engagement. During this tough time, Robert is leaning on his good friend Katy Perry.\n\n“As far as Katy goes, they have been good friends for a while. They have many mutual friends and have always kept in touch. They aren’t serious as of now, but Rob has always had an interest in Katy,” says E!’ s source.\n\nAnother source confirmed that ever since Robert’s split with FKA Twigs , he has been “leaning a lot on Katy.”\n\n“They talk on the phone regularly and make sure to see each other when they both aren’t away working. Katy has always been a good friend to Rob over the years and has been there for him emotionally,” the source added.\n\nKaty is currently busy with her world tour, so according to the reports, she FaceTimes Robert whenever possible.\n\n“She wants to make sure he is doing OK. Rob knows how good of a friend she is and he was also there for her when she was going through her divorce. They lean on each other.”\n\nApparently, this is not the first time that Robert Pattinson’s name has been linked with Katy Perry. Back in 2013, when the Twilight actor walked away from Kristen, many media outlets speculated that the “Chained To The Rhythm” singer was reportedly thinking about getting romantically involved with the actor.\n\nThe award-winner singer had to message Kristen explaining that she was simply being a good friend to Pattinson in the wake of his split and there was nothing romantically going on between the two of them.\n\n“I sent her a text message saying: ‘I know you’ve seen all this stuff but you know I would never disrespect you. I’m not that person,’” Katy told Elle UK. “I’m just trying to be a friend to him but it is unfortunate that I do have a set of t*ts.”\n\nRobert was also spotted with Katy Perry in early August during a dinner outing in Hollywood and many fans speculated that Robert has reportedly decided to end his engagement with FKA Twigs and will soon announce his inclination for Orlando Bloom’s ex-girlfriend.\n\nAs of this writing, there are multiple reports confirming Robert Pattinson, FKA Twigs’ split. However, an official statement from the stars or their respective representatives is still awaited. On the other hand, as reported above, Katy Perry is extremely busy with her ongoing world tour.\n\n[Featured Image by Mark Davis/Getty Images]", "images": ["https://www.inquisitr.com/wp-content/uploads/2025/10/2421769f-57a4-4bff-913f-cf316747493e.jpg", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20500%20157'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20492%20142'%3E%3C/svg%3E", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo-white.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/inquisitr-logo.png", "https://secure.gravatar.com/avatar/ec436e1595ee1fd93e8f144c4cf0a508?s=120&d=mm&r=g", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent-Dark-Mode.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20120%20120'%3E%3C/svg%3E"], "top_img": "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "keywords": [], "authors": ["News Writer"], "canonical_link": "https://www.inquisitr.com/robert-pattinson-is-reportedly-leaning-on-katy-perry-following-alleged-breakup-with-fka-twigs", "title": "Robert Pattinson Is Reportedly Leaning on Katy Perry Following Alleged Breakup With FKA Twigs", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "https://www.inquisitr.com/wp-content/uploads/2024/12/favicon.png", "description": "After his breakup with Kristen Stewart, Twilight movie hunk, Robert Pattinson, got engaged with French singer FKA Twigs. Like any other celebrity affairs,", "robots": "follow, index, max-snippet:-1, max-video-preview:-1, max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Robert Pattinson Is Reportedly Leaning on Katy Perry Following Alleged Breakup With FKA Twigs - Inquisitr News", "description": "After his breakup with Kristen Stewart, Twilight movie hunk, Robert Pattinson, got engaged with French singer FKA Twigs. Like any other celebrity affairs,", "url": "https://www.inquisitr.com/robert-pattinson-is-reportedly-leaning-on-katy-perry-following-alleged-breakup-with-fka-twigs", "site_name": "Inquisitr News"}, "article": {"tag": "twilight", "section": "Entertainment", "published_time": "2017-10-24T01:34:00-04:00"}, "twitter": {"card": "summary_large_image", "title": "Robert Pattinson Is Reportedly Leaning on Katy Perry Following Alleged Breakup With FKA Twigs - Inquisitr News", "description": "After his breakup with Kristen Stewart, Twilight movie hunk, Robert Pattinson, got engaged with French singer FKA Twigs. Like any other celebrity affairs,", "site": "@theinquisitr", "creator": "@theinquisitr"}, "generator": "WP Rocket 3.18.3"}, "movies": [], "publish_date": 1508823240.0, "source": "https://www.inquisitr.com", "summary": ""}