{"url": "jezebel.com/megyn-kelly-today-today-wasting-away-again-in-megynke-1819315902", "text": "Welcome to Megyn Kelly Today, Today, a new daily column in which we will share the most memorable things that happened on Megyn Kelly Today every morning until we are no longer able to watch Megyn Kelly Today without feeling like there will be no tomorrow.\n\nMegyn Kelly walked onstage in a long-sleeved black blouse and a leather skirt.\n\nMegyn Kelly says she can’t wait for Valerie Bertinelli.\n\nBobby Finger thought, “Megyn Kelly and I finally have our Breakfast at Tiffany’s.”\n\nMegyn Kelly did NOT explain the first segment for the first time ever.\n\nMegyn Kelly said Donna Karan used “her voice to attack women.”\n\nThe audience gasped.\n\nMegyn Kelly played Donna Karan’s comments about Harvey Weinstein twice.\n\nMegyn Kelly raised her voice and said, “Women sometimes make bad fashion choices at the office… this does not invite their own harassment. Period. End of report.”\n\nMegyn Kelly kept talking after the “period” and “end of report.”\n\nMegyn Kelly said, “There are laws in this country… I don’t give a damn if a woman shows up in a bikini to the office, that doesn’t make it all right… for her superior to harass her. It makes it OK for her boss to say go home and change. That’s it.”\n\nThere was still more after “that’s it.”\n\nMegyn Kelly said, “The truth is, sexual harassment has nothing to do with wardrobe. It has to do with power and control… How insulting to men! Like they are animals who can’t contain themselves if a woman shows part of her thigh… How about we not pile on Donna.”\n\nMegyn Kelly said, “How about we use this moment to encourage women to find their own voices despite the risks and to stand up for themselves, which is hard enough without rich, powerful, well-connected fashion moguls lecturing them on their clothing choices. And speaking of fashion choices, here’s one for you: I’m done with Donna Karan.”\n\nThe audience applauded Megyn’s apparent boycott (how brave!), who then said, “I want her to come on… and we can have an honest discussion about how she feels.”\n\nMegyn Kelly welcomed Katy Tur to the stage to talk about Ivana Trump’s statement about being the real First Lady.\n\nMegyn Kelly tried and failed to imitate Ivana Trump’s accent.\n\nMegyn Kelly teased Edie Falco’s appearance in promotion of, duh, Law & Order True Crime: The Menendez Murders.\n\nMegyn Kelly sat down with Edie Falco in a pre-taped interview.\n\nEdie Falco said, “They didn’t do it for the money,” and suggested she believed the brothers were abused by their parents.\n\nMegyn Kelly teased the next segment by saying, “Coming up, the truth about infidelity, and the warning signs every spouse should know. But first on a lighter note, cocktails and conversation with Valerie Bertinelli!”\n\nMegyn Kelly welcomed Valerie Bertinelli to the stage.\n\nValerie Bertinelli taught Megyn Kelly how to make an Irish coffee.\n\nMegyn Kelly and Valerie Bertinelli took a sip of Irish coffee.\n\nThe audience applauded because there’s nothing live studio audiences love more than the mere suggestion of alcohol.\n\nValerie Bertinelli began teaching Megyn Kelly how to make a margarita.\n\nValerie Bertinelli muddled the lime.\n\nMegyn Kelly asked Valerie Bertinelli, “What is muddling?”\n\nValerie Bertinelli explained muddling.\n\nMegyn Kelly used a shaker and said, “I had a blender explode on me not long ago!”\n\nMegyn Kelly provided no additional details about said blender explosion.\n\nMegyn Kelly dumped the contents of the shaker into the glass Valerie Bertinelli rimmed with salt without putting the strainer lid on top. (See the Clip of the Day.)\n\nValerie Bertinelli said, “Oh Megyn,” and the audience cackled.\n\nValerie Bertinelli caressed Megyn Kelly’s arm, said, “You’re so pretty, you’re so pretty,” and explained that she needed to strain the lime and jalapeños out of the margarita before serving.\n\nMegyn Kelly attempted to end the segment by saying, “Coming up, infidelity, the warning signs every spouse should know, and is there life after the affair.”\n\nValerie Bertinelli said, “I can tell you a little bit about that,” in an apparent reference to Eddie Van Halen.\n\nMegyn Kelly and the audience laughed.\n\nMegyn Kelly returned and asked, “Can a relationship survive and even thrive [after infidelity]?”\n\nMegyn Kelly rolled tape of some couple whose name I missed the first time around who dealt with—dun dun dun—infidelity.\n\nApparently the husband, Michael, cheated on his wife whose name I keep missing. Bobby Finger thinks it’s spelled Tirsha, but has never heard this name before and it has not yet been put onscreen.\n\nMegyn Kelly said that Michael “moved into the basement” after his affair was revealed so that he would be close to the kids.\n\nMichael said, “During all my thinking time in the basement, I reflected a lot on what caused the affairs.”\n\nMegyn Kelly said, “Michael stayed in the basement for six weeks as the couple remained in counseling.”\n\nBobby Finger asked, “What the hell is this show and why do these people keep speaking in somber tones about ‘the basement.’”\n\nMegyn Kelly welcomed Michael and Tirsha to the stage and asked how they’re doing.\n\nTirsha said, “We’re doing great! As far as the marriage… we’re better now than we have ever been… We’ve gone through the ugly, we’ve gone through the worst.”\n\nMegyn Kelly asked if Michael had addressed the issues (i.e. “not being appreciated”) that made him cheat to begin with.\n\nMichael said he had.\n\nMegyn Kelly said, “Forgive me for asking this, this is indelicate, but I know you took some of the affair partners home to your marital bed.”\n\nMichael said, “No, it was in the home, but not in our bed.”\n\nMegyn Kelly said, “To your home. To your home. So, I’m sure that’s been a source of pain, and I think the question is why? Why? Why would you do that?”\n\nTirsha looked at Michael all yeah bish why.\n\nMichael said, “It was a way to fill the need at the time.”\n\nMegyn Kelly asked another one-word question, saying, “And you managed to find forgiveness. How?”\n\nTirsha said, “It’s definitely a process. And I’ve been thinking a lot about forgiveness, and forgiveness initially is almost a selfish thing. Because you have to forgive to not let this consume yourself to that level, to not have that bitterness consume you, to not have this revenge consume you. Because that’s not healthy. And that’s not the woman that I wanna be. I’m a fun person. I’m a happy person. I didn’t want that to change. And so forgiving was to keep myself intact. To not lose myself through this… He worked his butt off for two years to get that trust back…”\n\nMegyn teased something about how affairs might be helpful for relationships.\n\nMegyn Kelly welcomed yet another couple who spoke like a self-help book. One of their names was Anne.\n\nAnne said, “When a tragedy like this hits you, it’s either gonna destroy you, it’s gonna define you, or it’s gonna develop you… I had to grow as a person and in marriage, two halves don’t make a whole…”\n\nMegyn Kelly asked some infidelity expert named Esther Perel about warning signs for infidelity.\n\nEster Perel said looking for signs is sorta bullshit, saying, “When you don’t see, it’s not because you’re a fool or… you’re not looking. It’s because you’re trying to protect an entire life that you have built.”\n\nTirsha said she saw no signs and said, “I blamed myself a lot for being dumb.”\n\nMegyn Kelly asked Michael if their marriage has improved.\n\nMichael said, “Absolutely.”\n\nMegyn Kelly thanked her guests and said, “Up next, supermodel Molly Sims is here. I need her badly! She’s gonna help us turn our everyday messes into something called everyday chic!”\n\nBobby Finger thought, “Wasn’t that infidelity segment essentially about turning everyday messes into something called everyday chic?”\n\nMegyn Kelly welcomed Molly Sims to the stage.\n\nMolly Sims appeared to be Megyn Kelly’s most excited guest to date.\n\nMolly Sims shared some tips with an audience member named Tracy who has “three-year-old twins and a messy pantry.”\n\nBobby Finger thought, “All you have is a messy pantry and you’re seeking the help of Molly Sims?!?!?!”\n\nMolly Sims said to hang a shoe rack on the back of a pantry—putting healthy snacks on the bottom, and less healthy snacks on the top.\n\nBobby Finger narrowed his eyes and grumbled, “I dare any of you to provide proof that Molly fucking Sims hung a damn shoe rack on the back of her pantry.”\n\nMolly Sims said, “Sometimes, I’m not lying, i get so many ‘mama, mama, mama,’ that I’ll hide in the pantry. So sometimes I’ll eat my own snacks. I’ll take conference calls. This is a great easy way! It’s a hack of a hack of a hack.”\n\nBobby Finger thought, “What in the fuck is Molly Sims talking about? Does Molly Sims know what a hack is?”\n\nMolly Sims could NOT be stopped, and started talking about other ways to hack, hack, hack! “Prepackage!” she demanded of us all. “Take glass containers, plastic containers in your refrigerator. Cut up cucumbers, red pepper, carrots. I know it sounds like when am I gonna have time to do it, but it’ll make your life so much easier and nine times out of 10 they’re gonna grab something healthier.”\n\nMegyn Kelly did not ask for data to back up that statistic from Molly Sims.\n\nHoda and Kathie Lee said Mandy Moore and Carla Bruni would be on their show today.\n\nMegyn Kelly said, “We’ll see you tomorrow! Bye ladi—” before 4 New York cut to the local news. Clip of the Day: Wasting Away Again In Megynkellyville Most Popular Only an Idiot Would Think We Need Anti-Abortion Democrats\n\nMan Arrested Trying to Serve Taylor Swift Deposition Papers from Justin Baldoni\n\nLet's Check in on Jordon Hudson, Shall We? More from Jezebel I Actually Can't Believe the Whitney Leavitt News\n\nFDA Hit With 2nd Lawsuit Over Needless Abortion Pill Investigation\n\nTom Brady Cloned His Dog, If Anybody Even Cares", "images": ["https://img.pastemagazine.com/wp-content/juploads/2025/10/bari151.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/06/baldoni-sm.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/09/errol151.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/07/musk151.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/05/untitled-98.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/05/mace151sdfds.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/08/wnba151.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/08/gaga151.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/07/press151sdf.jpg", "data:image/svg+xml,%3C%3Fxml version='1.0'%3F%3E%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 30 30' width='30px' height='30px'%3E%3Cpath d='M3,26c-0.552,0-1-0.447-1-1C2,23.395,2.485,9.553,19,9.016V5c0-0.404,0.244-0.77,0.617-0.924 c0.374-0.156,0.804-0.069,1.09,0.217l7,7c0.391,0.391,0.391,1.023,0,1.414l-7,7c-0.286,0.286-0.716,0.372-1.09,0.217 C19.244,19.77,19,19.404,19,19v-3.986c-6.12,0.171-10.631,1.924-13.083,5.098C4.022,22.563,4,24.976,4,25C4,25.553,3.552,26,3,26z' fill='%23a90026'/%3E%3C/svg%3E", "https://img.pastemagazine.com/wp-content/juploads/2025/08/fall1dfgdfg51.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/07/main151.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/04/kristi151.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/06/151sdfsdf.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/09/Screenshot-2025-09-29-at-15.17.33-2-1.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/10/noem-sq.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/09/rugby151.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/10/bofa-sm.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/08/vance151.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/05/151sdfdf.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/10/voice151.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/05/read151sg.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/06/main151.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/05/knicks151.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/11/billie151.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/10/halloween151.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/08/pulse151.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/08/alsharif151.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/10/fox151.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/10/louvre151.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/10/weiss151.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://img.pastemagazine.com/wp-content/juploads/2025/11/wl151.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/09/epstein151-1.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/10/terrifieirsdfsdf.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/05/mace151.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/09/navalbase151.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/09/Screenshot-2025-09-26-at-16.37.06-2.jpg", "https://img.pastemagazine.com/wp-content/juploads/2024/01/logo-1200x675-1.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/10/porter151.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/10/spiderman.jpg", "https://img.pastemagazine.com/wp-content/juploads/2024/09/diddy151.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/07/sweden151.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/01/untitled-6.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/08/ice.jpg", "https://img.pastemagazine.com/wp-content/juploads/2025/05/legal151.jpg"], "top_img": "https://img.pastemagazine.com/wp-content/juploads/2024/01/logo-1200x675-1.jpg", "keywords": [], "authors": ["Audra Heinrichs", "Lauren Tousignant", "Danielle Han", "Alyssa Mercante", "Nora Biette-Timmons", "Kylie Cheung"], "canonical_link": "https://www.jezebel.com/megyn-kelly-today-today-wasting-away-again-in-megynke-1819315902", "title": "Megyn Kelly Today, Today: Wasting Away Again In Megynkellyville", "meta_data": {"viewport": "viewport-fit=cover, width=device-width, initial-scale=1.0, maximum-scale=2.0", "fb": {"admins": 1185614656, "app_id": 127550380613969, "pages": 18512903240}, "p": {"domain_verify": "8f36922bc91ba221f10d82c407d8b6a9"}, "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Since 2007, Jezebel has been the Internet's most treasured source for everything celebrities, sex, and politics...with teeth.", "og": {"locale": "en_US", "type": "article", "title": "Megyn Kelly Today, Today: Wasting Away Again In Megynkellyville", "description": "Since 2007, Jezebel has been the Internet's most treasured source for everything celebrities, sex, and politics...with teeth.", "url": "https://www.jezebel.com/megyn-kelly-today-today-wasting-away-again-in-megynke-1819315902", "site_name": "Jezebel", "image": {"identifier": "https://img.pastemagazine.com/wp-content/juploads/2024/01/logo-1200x675-1.jpg", "width": 676, "height": 380, "type": "image/jpeg"}}, "article": {"publisher": "https://www.facebook.com/Jezebel"}, "twitter": {"card": "summary_large_image", "title": "Megyn Kelly Today, Today: Wasting Away Again In Megynkellyville", "site": "@jezebel"}, "msapplication-TileImage": "https://img.pastemagazine.com/wp-content/juploads/2023/12/cropped-icon-512x512-1-270x270.jpg"}, "movies": [], "publish_date": null, "source": "http://jezebel.com", "summary": ""}