{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/jason-statham-net-worth/", "text": "What Is Jason Statham's Net Worth and Salary?\n\nJason Statham is a British actor who has a net worth of $100 million. Jason Statham is a British actor known for his roles in high-octane action films. Jason Statham initially pursued a career in diving, becoming a competitive diver for the British national team. His athletic background and martial arts skills later helped him transition into modeling and stunt work before catching the attention of filmmaker Guy Ritchie.\n\nStatham made his acting debut in Ritchie's crime films \"Lock, Stock and Two Smoking Barrels\" (1998) and \"Snatch\"(2000), which established him as a charismatic, tough-guy actor. He gained widespread fame with \"The Transporter\"(2002) and its sequels, where he performed his own stunts and fight choreography. His career continued to rise with roles in \"Crank\" (2006), \"Death Race\" (2008), and \"The Expendables\" franchise.\n\nHe joined the \"Fast & Furious\" series in 2013, portraying Deckard Shaw, a role that led to the spin-off \"Hobbs & Shaw\" (2019). Known for his intense action sequences and signature tough-guy persona, Statham remains one of Hollywood's top action stars. His career spans over two decades, with box office hits proving his status as a leading figure in modern action cinema.\n\nEarly Life\n\nJason Statham was born on July 26, 1967, in Shirebrook, Derbyshire, England. He grew up in Great Yarmouth, a seaside town in England. His mother, Eileen, was a dancer, and his father, Barry, sold street goods. Statham played football for the local grammar school. Before becoming a world-famous action star, Jason originally pursued a career in diving and was a member of Britain's National Diving Squad for twelve years. He became part of the British Olympic team and went to Seoul, Korea, in 1988. Statham competed for England as a diver at the 1990 Commonwealth Games. After some disappointing finishes at both the Olympic Trials and Championships, he decided to focus on acting and modeling as a career.\n\nActing Career\n\nAn agent spotted Jason in 1998, and his career in front of the camera took off almost instantly. He also did a bit of modeling in his early career for the clothing line French Connection and was subsequently spotted by Guy Ritchie, who cast him in the film \"Lock, Stock, and Two Smoking Barrels,\" which grossed over $80 million in box office sales and launched Jason's career in Hollywood. Statham collaborated again with Guy Ritchie when he played the role of Turkish in the 2000 film \"Snatch.\" Statham acted alongside Brad Pitt and Benicio del Toro, and the film earned over $80 million at the box office. He appeared in various films throughout the early 2000s, including \"The One\" and \"Ghosts of Mars,\" but it was the action film \"The Transporter\" that made him a household name. For this role, he was responsible for all of his own stunts (by his choice), and he studied karate, Wing Chun kung fu, and kickboxing to prepare for the role. \"The Transporter\" went on to spawn two sequels, a reboot, and a television series. In 2005, Ritchie cast Statham in a starring role yet again in \"Revolver.\" However, it was a critical and box office fail. In 2008, Statham's performances in \"The Bank Job\" and \"Death Race\" garnered him loads of praise and put him in the category of full-blown action star.\n\nIn 2010, Statham appeared in \"The Expendables,\" an ensemble action film that also featured Sylvester Stallone and Mickey Rourke. The film opened at #1 in the U.S., UK, China, and India. His next role, in 2011, was in \"The Mechanic\" and was met with positive acclaim. Statham returned to British film when he starred in the police drama \"Blitz.\" Around this time, Jason appeared in \"The Italian Job\" and \"Cellular,\" in which he played the lead villain. His next film, \"Killer Elite,\" was panned by critics and grossed a negative budget. In 2012, Statham reprised his role for the sequel to \"The Expendables,\" and in 2014, he appeared in \"The Expendables 3.\" The sequels were critically panned but still box office smashes. Statham got to show off his comedic acting chops when he appeared in the action-comedy \"Spy,\" which had an all-star cast including Jude Law, Melissa McCarthy, and Rose Byrne. He was nominated for a Critic's Choice Award for best comedic actor for his role.\n\nIn late 2016, the sequel to his 2011 film \"The Mechanic\" opened as \"Mechanic: Resurrection.\" It went on to become a financial windfall, grossing over $109.4 million worldwide. In February 2017, he and Gal Gadot co-starred in a Wix.com ad for Super Bowl LI. The ad reached over 22 million user impressions. \"Spy 2\" was confirmed in 2018; however, director Paul Feig has been quoted as saying there hasn't been any interest from the studio in the project. Statham played the starring role of Captain Jonas Taylor in \"The Meg,\" an action horror film released in August 2018.\n\nStatham has also appeared in three \"Fast and Furious\" movies and reprised his role as Deckhard Shaw in \"Fast & Furious Presents: Hobbs & Shaw.\" Statham was praised critically for his performance, and the film was very commercially successful; it went on to become the tenth highest-grossing film of 2019. He returned to the series in 2021's \"F9\" and 2023's \"Fast X.\" Also in 2023, Statham reprised his role as Jonas Taylor in \"Meg 2: The Trench.\"\n\nPersonal Life\n\nJason has been dating model Rosie Huntington-Whiteley since 2010. The couple became engaged in 2016 and welcomed their first son in 2017. They had a daughter in February 2022.\n\nIn 2014, Statham was inducted into the International Sports Hall of Fame.\n\nIn 2015, Statham advocated for stunt performers to be given a category at the Academy Awards, citing the talent as overlooked. In his free time, Jason enjoys rock climbing, windsurfing, wakeboarding, and jet skiing.\n\nReal Estate\n\nIn 2009, Jason spent $10.6 million on an oceanfront home in Malibu, California. He sold this house in January 2020 for $18.5 million.\n\nIn 2011, he bought a Hollywood Hills home from Ben Stiller for $7.3 million. He sold this house in 2015 for $9.2 million to \"The Big Bang Theory\" star Johnny Galecki. Years earlier, this home was owned by legendary session drummer Hal Blaine.\n\nIn 2015, Jason and Rosie spent $2.7 million on a home above the Sunset Strip. He listed this renovated property in 2020 for $7 million. In 2015, they paid $12.99 million for a mansion in Beverly Hills. They sold this home in February 2025 for $20 million.", "images": ["https://vz.cnwimg.com/thm/1JoH3482haSLevnlEMdqhrz36y0=/132x132/center/top/filters:format(webp)/2009/11/George-Clooney.jpg", "https://vz.cnwimg.com/thm/I4dSiTJhq0kprSuO--deoPCEAmQ=/132x132/center/top/filters:format(webp)/2020/06/taylor.png", "https://vz.cnwimg.com/thm/uRsxoLs7Ymmit5ATgRtN2utad40=/221x5:381x236/132x132/filters:format(webp):strip_exif()/2009/09/P-Diddy.jpg", "https://vz.cnwimg.com/thm/KNDSqD-9inbRekV6AGgXDEG2Scw=/375x35:810x586/132x132/filters:format(webp):strip_exif()/2015/09/GettyImages-476575299.jpg", "https://vz.cnwimg.com/thm/iW5k3pfyRM3qEAXZrdIrVWERg54=/132x132/center/top/filters:format(webp)/2023/05/David-Leitch.jpg", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "https://vz.cnwimg.com/thm/SM_bwLF8nc0UaUofyL_3j9oBNfs=/600x300/center/top/filters:format(webp)/2009/11/Jason-Statham.jpg", "https://vz.cnwimg.com/thm/0dOqT2nlNQM7u_J-5xWrCsf2nAw=/132x132/center/top/filters:format(webp)/2020/02/Angelina-Jolie.png", "https://vz.cnwimg.com/thm/kREadKfbuE6Or78Boq5TQZV1hjU=/132x132/center/top/filters:format(webp)/2011/06/Rosie-Huntington-Whiteley.jpg", "https://vz.cnwimg.com/thm/Y14fttV9jls9mxFLuNAHJTnNWTE=/132x132/center/top/filters:format(webp)/2019/10/denzel-washington-1.jpg", "https://vz.cnwimg.com/thm/yboGsO77E1kQwELLmrwRZv_4RmE=/132x132/center/top/filters:format(webp)/2017/02/GettyImages-528215436.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/thm/lt1abKKVHSBtY-US0k9GLU9MTmM=/132x132/center/top/filters:format(webp)/2009/09/Brad-Pitt.jpg", "https://vz.cnwimg.com/thm/IoWqGPmFDjvC6iTqcDsspXBuxqo=/132x132/center/top/filters:format(webp)/2018/03/GettyImages-821622848.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/thm/dXuAPIEBU--L_kRib4u0nSzjUtE=/132x132/center/top/filters:format(webp)/2020/04/Megan-Fox.jpg", "https://vz.cnwimg.com/thm/_V4aDdGcejRTl4Lft3u7HJvZBmQ=/132x132/center/top/filters:format(webp)/2013/05/Ben-Stiller.jpg", "https://vz.cnwimg.com/thm/UxnQSql1h0QyX1CgkPqKhTxCTHM=/132x132/center/top/filters:format(webp)/2009/09/Jennifer-Aniston.jpg", "https://vz.cnwimg.com/thm/KFAqJ9F4o80l6an2fe78-0jw28s=/132x132/center/top/filters:format(webp)/2019/04/rr.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://vz.cnwimg.com/thm/tAHNWJMzj_dnEuVqXtLOQlzQShg=/132x132/center/top/filters:format(webp)/2009/11/Guy-Ritchie-1.jpg", "https://vz.cnwimg.com/wp-content/uploads/2009/11/Jason-Statham.jpg?x46379"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2009/11/Jason-Statham.jpg?x46379", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/jason-statham-net-worth/", "title": "Jason Statham Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Jason Statham is a British actor who has a net worth of $100 million. Jason Statham is a British actor known for his roles in high-octane action films. Jason Statham initially", "slick": {"wpversion": "3.0.1", "wppostid": 1935, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2009/11/Jason-Statham.jpg?x46379", "group": "post", "category": "actors:Actors"}, ";": "richest-celebrities:Richest Celebrities", "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "cnw": {"wppostid": 1935}, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Jason Statham Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/jason-statham-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2009/11/Jason-Statham.jpg?x46379", "site_name": "Celebrity Net Worth", "description": "What is Jason Statham's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2025-02-12T23:27:16+00:00", "published_time": "2020-01-02T21:24:46+00:00", "section": "Actors", "tag": "richest british people"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2009/11/Jason-Statham.jpg?x46379", "title": "Jason Statham Net Worth", "description": "Jason Statham is a British actor who has a net worth of $100 million. Jason Statham is a British actor known for his roles in high-octane action films. Jason Statham initially"}}, "movies": [], "publish_date": 1578000286.0, "source": "https://www.celebritynetworth.com", "summary": ""}