{"url": "https://en.wikipedia.org/wiki/Tiffany_Pollard", "text": "American television personality (born 1982)\n\nTiffany Pollard (born January 6, 1982)[1] is an American television personality. She starred on the first two seasons of the reality show Flavor of Love (2006), where she was given the nickname \"New York\" by rapper Flavor Flav.[2] Pollard later starred in spin-off series, including I Love New York (2007–2008) which launched a career in television.[3] Subsequent television roles include her hosting in Brunch with Tiffany (2017–2020) and Hot Haus (2022–2023), and her roles on House of Villains (2023–2026) and College Hill: Celebrity Edition (2023).[4][5][6]\n\nIn 2016 Pollard joined the British version of Celebrity Big Brother.[7] She has hosted the Fenty Beauty holiday gift guide twice—once in 2018 and again in 2019—at the request of Rihanna.[8][9][10] In January 2025, she was a contestant on a season of the cooking competition series Worst Cooks in America: Celebrity Edition.[11]\n\nCareer [ edit ]\n\n2005–2006: Beginnings and early breakthrough [ edit ]\n\nPollard began her television career in 2005 at the age of 23, when she was working as a clothing buyer and walking down Hollywood Boulevard. She was noticed by a casting agent from 51 Minds Entertainment, leading to her being cast in Flavor of Love, a reality television dating competition series which was filmed in late 2005 and debuted in early 2006.[12]\n\nWhile Pollard was on Flavor of Love, she had occasional clashes with other contestants. Although these clashes were, in general, nothing more than words, an incident in the penultimate episode of season one led to violence. After her elimination, an outraged Brooke \"Pumkin\" Thompson spat on Pollard following a heated exchange.[13] There was extensive tension between Pollard and Thompson throughout the show. Pollard vowed to \"whoop Pumkin's ass\", and attempted to do so at the season one reunion.[14] The final two contestants journeyed to Puerto Vallarta, Mexico, where Flavor Flav chose Nicole \"Hoopz\" Alexander over Pollard, to be his mate.[15] However, after his relationship with Alexander did not work out, Flav decided to return for a second season of his dating show.[16]\n\nDuring the filming of Flavor of Love 2, Flav invited Pollard, then 24, to join him in helping eliminate contestants. She agreed and was later added as a participant.[17] Pollard made it to the finale once again; however, Flav ultimately chose \"Deelishis\" over Pollard.[18] The season finale was the second highest non-sports basic cable program of the year drawing over 7.5 million viewers.[19][20][21]\n\n2007–2010: Television spin-off series [ edit ]\n\nPollard in 2009\n\nPollard was given her own spin-off series I Love New York which was Pollard's first reality television series.[22] She went on to star in other spin-off series, including I Love New York 2, New York Goes to Hollywood, New York Goes to Work, and more recently, Brunch with Tiffany.[23]\n\nBefore the finale of Flavor of Love's second season, Pollard denied having her own show. However, after the finale aired, she said that she had already signed on for one. I Love New York, a reality series focused on Pollard as she navigated a group of suitors vying for her affection, premiered on January 8, 2007, and remains the most-watched series debut in VH1 history with 4.426 million viewers.[24] Pollard chose Patrick \"Tango\" Hunter in the finale, however the two had a falling out, and their engagement ended shortly after filming.[25]\n\n51 Minds Entertainment premiered a follow-up season of I Love New York 2 on October 8, 2007 on VH1.[26] The second season introduced a new group of men, including \"Tailor Made\" and \"Mr. Boston\". In the finale Tailor Made (real name George Weisgerber) proposed to Pollard, but was turned down. During the I Love New York 2 reunion special, Tailor Made proposed a second time and Pollard accepted.[27][28]\n\nPollard's efforts to land a high-profile acting role provided a narrative for another new spin-off. New York Goes to Hollywood premiered on August 4, 2008, on VH1.[29]\n\nIn 2009, Pollard stepped out of the lifestyle she had grown accustomed to and took on the challenge of trying a humble job. Her fourth spin-off series, New York Goes to Work, premiered on May 4, 2009, and follows Pollard each week as viewers voted via text message on which of three job options she would take. If she successfully impressed her employer, she would earn a $10,000 bonus. However, if she quit, failed, or was fired, she would forfeit the bonus. Over the course of the series, Pollard earned $45,000 in bonuses, succeeding in four jobs, failing or quitting four others, and ultimately drawing in the season finale. In the series finale, viewers voted via mobile poll to choose New York's next task, and the majority selected I Love New York 3.[30]\n\nProduction for I Love New York 3 was set to start sometime in the first quarter of 2010; however, prior to that time frame, VH1 requested immediate cancellation of the \"celebreality\" franchise and shelved plans for I Love New York 3. In the summer of 2011, Pollard revealed that I Love New York 3 was shelved due to the murder-suicide case of Ryan Jenkins, who was a former contestant of Megan Wants a Millionaire. Following the halt in production, Pollard decided to take a step back from the spotlight for a period of time, marking a significant shift in her public life.[31]\n\n2011–2014: Semi-hiatus and career progression [ edit ]\n\nAfter I Love New York 3 was shelved, Pollard appeared in various television series, such as DTLA and That Sex Show.[32] In 2014, Pollard was profiled in an episode of E!'s True Hollywood Story, which revisted her rise to fame and explored her journey as a television personality.[33]\n\n2015–2019: Continued exposure [ edit ]\n\nIn April 2015, Pollard had a guest appearance on the E! Network series, Botched, where she discussed her previous breast implant surgeries and its unexpected complications. Before having surgery, Pollard threw herself a party at a hotel in Beverly Hills, to celebrate her impending transformation.[34][35][36]\n\nIn 2016, Pollard entered the Celebrity Big Brother house in the United Kingdom to participate in the show's 17th series. While in the house, there was a misunderstanding in which Pollard believed that David Gest had died inside the house, while the deceased was actually David Bowie, the ex-husband of Pollard's fellow housemate Angie Bowie.[37][38][39][40] On February 5, Pollard made it to the final and finished in fourth place.[citation needed]\n\nLater in 2016, Pollard signed on to join the unscripted reality series The Next :15, which followed six reality television stars in their pursuit of longevity in the entertainment industry.[41] That same year, she also joined VH1's Family Therapy with Dr. Jenn, a series led by therapist Dr. Jenn Mann that follows five celebrity families as they undergo three weeks of transformative family therapy.[42]\n\nIn 2017, Pollard began starring in Brunch with Tiffany, a talk show made for VH1's YouTube. The series \"follows Pollard as she gathers around the tables of the hottest restaurants with her famous friends for free-flowing conversations and cocktails\", with the pilot episode featuring Real Housewives of New York's, Sonja Morgan.[43] That same year, Pollard joined VH1's Scared Famous, a show hosted by Redman, where ten reality stars move into an estate in Savannah, Georgia, one of America's most haunted cities, as they endured challenges and scares that paid homage to recent horror hits.[44][45] Also that year, Pollard joined E! Network reality series Famously Single, which brought together eight celebrities, each grappling with their own romantic challenges, as they move into a loft in downtown Los Angeles to explore and understand the root of their relationship issues.[46]\n\nIn 2018, the cultural THNK 1994 Museum in Brooklyn dedicated an exhibit to Pollard.[47] The opening gala was attended by Pollard which celebrated her contributions to the cultural landscape.[48] Later in 2018, Pollard starred in a guest capacity on Braxton Family Values, where she was reunited with Flavor Flav, a key figure in her early career with whom she shares a long-standing friendship.[49][50] She also participated in Hip Hop Squares later that year.[51]\n\nIn 2019, Pollard became a guest judge on RuPaul's Drag Race season 11.[52] That same year, she returned to Botched to address complications from a breast implant surgery.[53] She also starred on an episode of Traveling the Stars: Action Bronson and Friends Watch Ancient Aliens, a comedy-documentary series in which Action Bronson and his friends engage discussions about the content of Ancient Aliens episodes.[54]\n\n2020–present: Expanding presence [ edit ]\n\nIn 2020, she took part in the eleventh season of Celebrity Ex on the Beach, as the ex of David McIntosh.[55] Later that year, her YouTube series Brunch with Tiffany was picked up by VH1, making its television debut in late 2020. The pilot episode, which premiered on September 7, featured Cyn Santana and Fizz.[56][57] In October 2020, after she teased that a season three of I Love New York \"might happen\", VH1 announced a one-off reunion special for I Love New York, which was hosted by Vivica A. Fox.[58] The reunion returned to the series' most memorable moments and offered insights into the cast's experiences since the show aired.[59]\n\nIn November 2020, Pollard appeared on the cover of Paper magazine's \"America\" issue. The issue featured an interview with Patia Borja that highlighted Pollard.[60] A few weeks later, in December 2020, she appeared as a supporting figure in the Zeus Network reality series One Mo' Chance, where she helped Kamal \"Chance\" Givens, who had previously competed for Pollard's affection on I Love New York, evaluate the women competing for his affection.[61]\n\nIn 2021, Pollard began co-starring as a companion to the titulary Ts Madison in The Ts Madison Experience.[62] In 2022, Pollard began hosting Hot Haus, a reality competition which garnered notoriety for featuring OnlyFans creators competing to be named the next queer sex symbol on OutTV.[63] In April 2022, Pollard shot a pictorial for Interview magazine and was also interviewed by editor-in-chief Mel Ottenberg.[64] In November that year, at the 2022 ARTAS, she was honored with the Hall of Fame award.[65]\n\nIn 2023, Pollard became a lead on College Hill: Celebrity Edition which follows a group of celebrities from various entertainment fields as they enroll at a historically black college or university, to experience college life. Later on in 2023, she also starred in E!'s reality competition series House of Villains, a show featuring notorious and controversial personalities from reality television franchises competing to be crowned America's Ultimate Supervillain.[66] In February 2024, she was interviewed in a televised interview on The Jason Lee Show, where the conversation's topics ranged from sexuality, to the impact of her career in an evolving entertainment industry.[67] In July 2024, she was tapped to host the Baddies Midwest & Gone Wild Auditions on the Zeus Network.[68] Later, in August 2024, she starred in an episode of Wiggin' Out with Tokyo Stylez, a reality series centered around celebrity hairstylist Tokyo Stylez, who was given just 24 hours to deliver a standout wig for Pollard.[69]\n\nIn October 2024, Pollard was invited back to E!'s House of Villains for a second season.[70] In January 2025, she was a contestant on a special season of the cooking competition series Worst Cooks In America: Celebrity Edition which is titled Heroes vs. Villains. The series pits celebrities, divided into two teams—'Heroes' and 'Villains'—against each other as they try to improve their cooking abilities.[71] In April 2025, Pollard made a return to U.K. television which marked a shift from former contestant to commentary role on 6 episodes of Celebrity Big Brother: Late and Live.\n\nPersonal life [ edit ]\n\nPollard was born in Utica, New York to Michelle Rothschild-Patterson (also known as \"Sister Patterson\") and Alex Pollard.[72] Pollard has used the surnames of both her parents, despite them being unmarried.[73] She attended John F. Kennedy Middle School and graduated from Thomas R. Proctor High School.[74]\n\nPollard's personal life has been heavily documented in the media. The early years of her fame were particularly filled with intense media scrutiny.[75][76][77][78][79][80] She was engaged to the I Love New York season 1 winner Patrick \"Tango\" Hunter for a six-month period until Hunter called off the engagement on the reunion show.[81] She was also engaged to George \"Tailor Made\" Weisgerber, the winner of I Love New York 2. She announced on episode 6 of her show, New York Goes to Hollywood, that she had officially separated from Weisgerber.[82][83]\n\nDespite her larger-than-life persona, Pollard has been candid about her personal struggles. In an episode of Brunch with Tiffany, Pollard said that she has been diagnosed with bipolar disorder.[84]\n\nOver the years, Pollard has undergone multiple cosmetic procedures. In 2019, Pollard decided to remove her breast implants. The procedure was documented on the reality television series Botched.[85]\n\nPollard experienced a miscarriage of her child after she dealt with stress from her mother, who was strongly chastised by psychologist Jenn Mann on Family Therapy with Dr. Jenn for refusing to believe Pollard was pregnant.[86]\n\nOn November 23, 2020, during the I Love New York: Reunited special, Pollard announced her third engagement, later revealed to be to a man named Jimmy Stewart.[87][88]\n\nOn March 27, 2023, Pollard advocated for queer people in a TikTok video on OutTV's page. She ended the video with her identifying as queer as well.[89] In a 2024 interview with Jason Lee on The Jason Lee Show, Pollard elaborated stating, \"I have lived a very, very broad life. I've never been afraid to do anything that I wanted to do.\"[90]\n\nIn September 2025, Pollard commented on the fluidity of gender expression. Speaking to PinkNews, Pollard stated, \"I really do resonate with non-binary\" and observed that \"we are so dual without even recognising it\".[91]\n\nOther ventures [ edit ]\n\nPollard has hosted the Fenty Beauty holiday gift guide on two occasions, in 2018 and 2019, a key feature of Fenty Beauty's annual holiday promotions.[92]\n\nIn November 2021, Pollard launched a limited-edition four-pack nail polish line called HBIC Ink, with each box being numbered to emphasize its exclusivity.[citation needed]\n\nIn January 2025, Pollard became the face of MAC Cosmetics Nude Lipstick campaign, where she posed nearly nude, with her body strategically covered by \"I only wear MAC\". In an interview with Essence magazine, Pollard shared her thoughts on the power of nude shades, saying, \"When you're nude, you can't hide.\"[93]\n\nActing appearances [ edit ]\n\nPollard appeared in the comedy film First Sunday (2008).[94] Pollard appeared in the 2009 national production of The Vagina Monologues.[95]\n\nIn popular culture [ edit ]\n\nBeyond her television appearances, Pollard is celebrated in internet culture.[96][97][98][99][100]\n\nPollard has been referred to as the \"queen of reaction memes\" due to the number of gifs and memes featuring her, which are shared across social media and frequently go viral.[101][102] A notable example is of Pollard getting up at a table and walking away.[103][104][105] The clips are sometimes remixed, contributing to their continued popularity.[106][107] A notable example is Pollard asking \"Do you know you have 30 minutes?\".[108][104][105]\n\nIn July, 2022, Flo Milli released her debut album You Still Here, Ho? from RCA Records, which features an introduction with Pollard, who shares that she's the \"original HBIC\" and adds that Flo Milli is the \"princess of this rap shit.\" Pollard also appears on \"Outro I Love New York\". In promotional footage, \"I Love New York\" was flipped to \"I Love Flo Milli\", and Flo's album cover features an homage to I Love New York. Her \"Ice Baby\" video, recreated the season 2 finale of Flavor Of Love, and also features an appearance made by Deelishis, who reprises her role.[109][110][111][112][113]\n\nIn May, 2023, Todrick Hall released an extended version of his hit \"Y.A.S.\" featuring Pollard. The music video also includes Pollard and features a scene inspired by The Little Mermaid.[114][115][116][117]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nYear Title Role Notes 2008 First Sunday Omunique's Client 2014 The Shop Kiana\n\nTelevision [ edit ]\n\nWeb [ edit ]\n\nYear Title Notes 2017–2020 Brunch with Tiffany A series on VH1's YouTube for three seasons before debuting on the VH1 television network later in 2020 for eight episodes. [ 120 ] October 16, 2019 People TV \"Tiffany Pollard Takes Us Behind the Scenes of Her Greatest 'HBIC' Moments\"\n\nAwards and nominations [ edit ]\n\nYear Result Award Category Recipient 2006 Won Fox Reality Awards Favorite Fight Flavor of Love 2006 Won Fox Reality Awards Favorite Villain Flavor of Love 2007 Nominated Teen Choice Awards Choice TV: Female Reality Star I Love New York 2007 Nominated Fox Reality Awards Most Memorable Reality Performer Flavor of Love, Flavor of Love 2, and I Love New York 2020 Nominated 12th Annual Shorty Awards Video Brunch with Tiffany [ 121 ] 2022 Won 9th American Reality Television Awards Hall of Fame Recipient Herself [ 122 ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Tiffany_pollard.jpeg/250px-Tiffany_pollard.jpeg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/e/ec/Tiffany_pollard.jpeg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Tiffany_Pollard_on_RealTVfilms.jpg/250px-Tiffany_Pollard_on_RealTVfilms.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Tiffany_pollard.jpeg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Tiffany_Pollard", "title": "Tiffany Pollard", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Tiffany_pollard.jpeg", "width": 914, "height": 1200}, "title": "Tiffany Pollard - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}