{"url": "https://www.mirror.co.uk/film/marvel-releasing-black-widow-solo-12423294", "text": "Black Widow UK release date, cast, director, plot for new Marvel movie\n\nScarlett Johansson finally gets her solo outing as Natasha Romanoff in Marvel Studios' Black Widow and is joined by Florence Pugh, David Harbour and Rachel Weisz\n\nDespite multiple delays, it seems as though Black Widow is finally on its way.\n\n‌\n\n\n\nScarlett Johansson's Natasha Romanoff is the most prolific female heroine in the Marvel Cinematic Universe and has appeared in a number of its films.\n\n‌\n\n\n\nFirst appearing in a small role in Iron Man 2, the character achieved great popularity following her major turns in Avengers Assemble and then Captain America: The Winter Soldier.\n\n‌\n\n\n\nIn recent years, Black Widow has continued to play a major role in the Avengers line-up, appearing in Avengers: Age of Ultron, Captain America: Civil War, Avengers: Infinity War, and also in Avengers: Endgame, where the character tragically lost her life.\n\nIt had been long hoped for, however, that the MCU would produce a solo entry for the flexible Russian spy, and now it's almost here.\n\nWith the film now finally on its way (after multiple delays), The Mirror breaks down all we know about the Widow spinning her own web...\n\n‌\n\n\n\nBlack Widow UK release date\n\nBlack Widow will now be released in cinemas and on Disney+ Premier Access on July 9, 2021.\n\nView 7 Images A poster for Black Widow starring Scarlett Johansson due for release on July 9, 2021 (Image: Marvel Studios/Disney)\n\nWho is Captain America in Falcon and the Winter Soldier? John F Walker explained READ MORE :\n\nThis enables both a theatrical and digital release, but the Premier Access release will require further fees to be paid.\n\n‌\n\n\n\nIt was originally planned for May 2020 and later delayed until November 2020 and then to May 2021 due to the ongoing Covid-19 pandemic.\n\nBlack Widow trailer\n\nWe finally have the first action-packed teaser trailer for the film.\n\nIt looks set to be an action-packed battle for Black Widow - or should that be Widows?\n\n‌\n\n\n\nCatch it at the top of this article.\n\nBlack Widow director\n\nAustralian director Cate Shortland helmed the film.\n\nShe is the first solo female director on a Marvel Cinematic Universe film.\n\n‌\n\n\n\nBlack Widow cast\n\nScarlett Johansson as Black Widow/Natasha Romanoff\n\nScarJo is back to play the founding female Avenger, who was killed off in Avengers Endgame.\n\nFlorence Pugh as Yelena Belova\n\n‌\n\n\n\nView 7 Images Introducing Nat's 'little sister' Yelena (Image: Marvel Studios)\n\nThe British rising star has been cast as the second female lead, described as Natasha's \"moral opposite\".\n\nShe will portray Yelena Belova, a fellow Black Widow trained in the Red Room like Natasha.\n\n‌\n\n\n\nIn the trailer the pair fight but then aid each other, having a sisterly bond.\n\nDavid Harbour as Red Guardian/Alexei Shostakov\n\nView 7 Images He's the Russian answer to Captain America (Image: Marvel Studios)\n\n‌\n\n\n\nThe Stranger Things star will play the role of Russian super-soldier, Alexei.\n\nHe will apparently go on a big journey throughout the film as the character has a complex relationship with Natasha.\n\nHe is seen in the trailer reuniting with Natasha, Yelena, and Melina.\n\n‌\n\n\n\nRachel Weisz as Melina Vostokoff\n\nView 7 Images Can Nat trust Melina? (Image: Marvel Studios)\n\nThe Oscar-winning star of The Favourite will play the role of a seasoned spy trained from the Red Room who is deeply involved in a scientific experiment.\n\n‌\n\n\n\nWeisz has revealed that Melina is also a Black Widow.\n\nO-T Fagbenle as Rick Mason\n\nThe Handmaid's Tale star will portray a figure from Natasha's past at SHIELD who she has a romantic history with.\n\n‌\n\n\n\nAs with most spies, we are still suspicious about this character.\n\nRay Winstone as Dreykov\n\nThe Sexy Beast star has been cast in the Black Widow film, according to Variety.\n\n‌\n\n\n\nIt has now been confirmed that he will portray the commander of the Red Room where the Black Widows are trained.\n\nThe character was referenced in Black Widow's first scene in the first Avengers film.\n\nTaskmaster\n\n‌\n\n\n\nView 7 Images Taskmaster (Image: MARVEL ENTERTAINMENT )\n\nThe latest reports suggest that the main villain that Natasha will face is the classic Marvel Comics villain Taskmaster, which was later confirmed at San Diego Comic-Con.\n\nSo who will be the Taskmaster?\n\n‌\n\n\n\nUnless a casting is revealed then we reckon that either Rick Mason or Melina will be the Taskmaster.\n\nHe is glimpsed in the trailer with a bow and arrow.\n\nWilliam Hurt as Secretary Thaddeus \"Thunderbolt\" Ross\n\n‌\n\n\n\nView 7 Images William Hurt as Sectetary Ross (Image: MARVEL ENTERTAINMENT)\n\nThe architect of the Sokovia Accords is glimpsed in the trailer and is likely pursuing Natasha after the events of Captain America: Civil War.\n\nRobert Downey Jr. as Iron Man/Tony Stark\n\n‌\n\n\n\nIron Man himself is due to appear in the film for a cameo role.\n\nBlack Widow plot\n\nView 7 Images Natasha fights in her Marvel film Black Widow (Image: MARVEL ENTERTAINMENT )\n\nThe film takes place following the events of Captain America: Civil War and before Avengers: Infinity War and sees Natasha's past catch up with her as a deadly experiment threatens the world.\n\nArticle continues below\n\nMarvel producer Kevin Feige has stated to Deadline that “We think she’s an amazing character. We think Scarlett Johansson’s portrayal of her is amazing. She’s a lead Avenger and has amazing stories in her own right to tell that we think would be fun to turn into a standalone franchise“.\n\nWhat would you like from a Black Widow film? Let us know in the comments below.", "images": ["https://i2-prod.mirror.co.uk/article23784159.ece/ALTERNATES/s615b/0_unnamed-6jpeg.jpg", "https://www.mirror.co.uk/footer/ipso.svg", "https://i2-prod.mirror.co.uk/article21423427.ece/ALTERNATES/s615b/0_BlackWidow.jpg", "https://i2-prod.mirror.co.uk/article21014646.ece/ALTERNATES/s615b/0_BlackWidow.png", "https://www.mirror.co.uk/footer/trust-project.svg", "https://www.mirror.co.uk/nav-web-static/release-v41-14493b7c888038a7d89b99cb3a7937c2b71eaebe/public/logo-reach.png", "https://i2-prod.mirror.co.uk/article23784159.ece/ALTERNATES/s1200/0_unnamed-6jpeg.jpg", "https://i2-prod.mirror.co.uk/article21423426.ece/ALTERNATES/s615b/0_BlackWidow.jpg", "https://i2-prod.mirror.co.uk/article21423424.ece/ALTERNATES/s615b/0_BlackWidow.jpg", "https://www.mirror.co.uk/assets/mirror/logos/masthead-mirror-default.svg", "https://i2-prod.mirror.co.uk/article21015384.ece/ALTERNATES/s615b/0_BlackWidow.png", "https://i2-prod.mirror.co.uk/article21014645.ece/ALTERNATES/s615b/0_BlackWidow.png"], "top_img": "https://i2-prod.mirror.co.uk/article23784159.ece/ALTERNATES/s1200/0_unnamed-6jpeg.jpg", "keywords": [], "authors": ["Lewis Knight", "Updated"], "canonical_link": "https://www.mirror.co.uk/film/black-widow-2021-release-date-12423294", "title": "Black Widow UK release date, cast, director, plot for new Marvel movie", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"page_id": 6149699161, "app_id": 123792601022133, "pages": 1814357575554395}, "description": "Scarlett Johansson finally gets her solo outing as Natasha Romanoff in Marvel Studios' Black Widow and is joined by Florence Pugh, David Harbour and Rachel Weisz", "author": "Lewis Knight", "robots": "noarchive, max-image-preview:large", "Googlebot-News": "noarchive", "referrer": "unsafe-URL", "keywords": "Marvel Comics, Avengers Infinity War, Scarlett Johansson, Films, Florence Pugh, Ray Winstone, Rachel Weisz, David Harbour", "news_keywords": "Marvel Comics, Avengers Infinity War, Scarlett Johansson, Films, Florence Pugh, Ray Winstone, Rachel Weisz, David Harbour", "allowTaboolaDeepDive": "true", "vf": {"00000000-0000-4000-8000-67e599051dc3": "mirror-prod-12423294"}, "og": {"title": "Black Widow UK release date, cast, director, plot for new Marvel movie", "description": "Scarlett Johansson finally gets her solo outing as Natasha Romanoff in Marvel Studios' Black Widow and is joined by Florence Pugh, David Harbour and Rachel Weisz", "url": "https://www.mirror.co.uk/tv/tv-news/marvel-releasing-black-widow-solo-12423294", "site_name": "Daily Mirror", "locale": "en_GB", "image": "https://i2-prod.mirror.co.uk/article23784159.ece/ALTERNATES/s1200/0_unnamed-6jpeg.jpg", "type": "article"}, "article": {"published_time": "2018-04-26T10:56:44Z", "modified_time": "2021-03-24T03:04:39Z", "author": "https://www.mirror.co.uk/authors/lewis-knight/", "section": "Film", "tag": "David Harbour"}, "twitter": {"card": "summary_large_image", "site": "@DailyMirror", "creator": "@ThatsOurLewis", "title": "Black Widow UK release date, cast, director, plot for new Marvel movie - The Mirror", "description": "Scarlett Johansson finally gets her solo outing as Natasha Romanoff in Marvel Studios' Black Widow and is joined by Florence Pugh, David Harbour and Rachel Weisz", "image": "https://i2-prod.mirror.co.uk/article23784159.ece/ALTERNATES/s1200/0_unnamed-6jpeg.jpg"}}, "movies": [], "publish_date": 1524740204.0, "source": "https://www.mirror.co.uk", "summary": ""}