{"url": "https://people.com/celebrity/celeb-exes-who-worked-together-after-breaking-up/", "text": "01 of 29 Zach Braff & Florence Pugh From left: Florence Pugh, Zoe Lister-Jones, Molly Shannon and Zach Braff. Stephen Lovekin/Shutterstock The stars are in a unique position: after making A Good Person together while they were dating, they are now on a promo tour for the film post-split. However, director Braff (right) only has praise for his ex and the movie's star, Pugh (left) — and has even been spending time with her family. Of his ex, Braff told Entertainment Tonight in March 2023, \"I'm just in awe of her talent and I said, 'I wanna write this for Florence. What I'm writing is really gonna be challenging, and she's incredible.' \" The actor previously told Collider, \"People say she's maybe the best actress of her generation. I think she's one of the best actresses working. This performance she gives is unbelievable.\"\n\n02 of 29 Madelyn Cline & Chase Stokes Charley Gallay/Getty The Outer Banks co-stars met before they even began filming their hit show in 2019, and by the time the Netflix series aired in April 2020, fans were speculating that the two were an item. The pair would confirm their romance in June 2020 and shared some sweet moments of their love publicly. However, after dating for a year and a half, Cline and Stokes decided to call it quits, though their professional relationship remained air tight. \"Mads and I have been working together now for 30 episodes, and we made a promise to each other before we even started dating that the work was always going to come first,\" Stokes, 30, told Entertainment Weekly. \"And that no matter what happens in our personal lives, and the ways that life sometimes takes you in different directions, that we're always going to honor the work. That stayed 100 percent truthful this season.\"\n\n04 of 29 Lili Reinhart & Cole Sprouse Kevin Winter/Getty People were 'shipping Lili Reinhart and Cole Sprouse pretty much the moment they made their debuts as Betty Cooper and Jughead Jones on Riverdale in 2017. And fans weren't imagining that chemistry —the two began dating, but kept things quiet until they walked the Met Gala red carpet together in 2018 and seemingly confirmed their relationship. Rumors of splits and reconciliations pursued the two for a few years, and in Aug. 2020, Sprouse would officially confirm they called it quits in an Instagram post. \"Lili and I initially separated in January of this year, deciding to more permanently split in March,\" the former Disney star wrote. \"What an incredible experience I had, I'll always feel lucky and cherish that I had the chance to fall in love. I wish her nothing but the utmost love and happiness moving forward. All I'll say about it, anything else you hear doesn't matter.\" The pair continued in their roles on Riverdale for several years; the show's seventh and final season is expected in 2023.\n\n05 of 29 Katie Holmes & Joshua Jackson Katie Holmes and Joshua Jackson on 'Dawson's Creek'. Columbia TriStar International Television/Getty In a 1998 interview with Rolling Stone, a 19-year-old Katie Holmes could barely contain her love for Dawson's Creek and then-boyfriend Joshua Jackson. \"I'm just going to say that I met somebody last year,\" she told the publication. \"I fell in love, I had my first love, and it was something so incredible and indescribable that I will treasure it always.\" The two began dating in 1998, before their characters, Joey and Pacey also became an item on the small screen. They would break up in 1999, though they remained coworkers until the show wrapped in 2003.\n\n06 of 29 BJ Novak & Mindy Kaling Gilbert Flores/Getty They say life imitates art, and in the case of BJ Novak and Mindy Kaling, that is sort of true. The pair stole America's hearts as the chaotic coupling that was Kelly Kapoor and Ryan Howard on The Office. In real life, their relationship was similar. \"No one, including us, ever really knew, 'Is this dating? Is this not dating?' We were never really dating, we were never really not dating,\" Novak told Vulture. \"We didn't know. No one knew. All you'd know for sure was that you'd always find one of us next to the other, even if we weren't getting along.\" Though Kelly and Ryan ended up running off together on the show, Novak and Kaling had a more mature end to their on-and- off \"situationship.\" \"In real life, I think we just essentially grew up and it became more of a transition,\" said Novak. The two remain besties and have been each other's dates to various high profile events. Novak is also the godfather to Kaling's first daughter, Katherine Swati and Spencer.\n\n07 of 29 Blake Lively & Penn Badgley Jamie McCarthy/WireImage \"We were constantly professional, to be honest, and we should both pat ourselves on the back because anything is complicated in that way ... and we handled it,\" Badgley said of working with Lively on Gossip Girl after calling it quits in 2010.\n\n08 of 29 Kaley Cuoco & Johnny Galecki Rich Polk/Getty Their characters may have gotten hitched on The Big Bang Theory, but exes Cuoco and Galecki had already ended their IRL relationship in 2010 after two years of dating. \"Massive doses of mutual love and respect, mostly,\" Galecki said during an appearance on The View when asked about how he and Cuoco maintain a healthy working relationship despite splitting up. \"It's not easy but with those two ingredients, pretty much anything is possible. We're dear, dear friends.\"\n\n09 of 29 Camila Mendes & Charles Melton Amy Sussman/Getty Another Riverdale couple that had to keep things professional post-break up are Camila Mendes and Charles Melton, who play Veronica Lodge and Reggie Mantle on the show. Romance rumors were also circulating around these two before Mendes confirmed they were dating through a string of now-deleted Instagram pics. Shortly after their one year anniversary, reports came out revealing that the stars were on pause. \"Cami and Charles have been separated for a few months now. They are taking a break from their relationship,\" a source told E! News at the time. \"Their relationship escalated very quickly and they are taking time now to focus on their work and themselves.\"\n\n10 of 29 Joey King & Jacob Elordi Jesse Grant/WireImage The Kissing Booth costars Jacob Elordi and Joey King dated for about a year before they put the kibosh on their relationship in 2018. King was honest in saying that working with her ex wasn't the easiest thing to do, especially with the knowledge that people would be watching the two onscreen with curiosity about their relationship. \"No one's thinking to themselves, 'That was easy,' because it wasn't. I'm sure people will analyze every movement and every detail. And you know what? Let them,\" she told Cosmo in 2020. \"But at the end of the day, I was just thrilled to be Elle Evans again.\" So how did she power through those awkward moments? Said King: \"Elle Evans needs her Noah Flynn, and whatever that means for my personal life, I'll do anything to make sure the story of my character who I care about so much is complete.\"\n\n11 of 29 Zendaya & Jacob Elordi FilmMagic After splitting from King, Elordi was also rumored to have been in a relationship with Euphoria costar Zendaya. Though they never confirmed they were an item, several sightings led fans to believe the two were definitely together. In 2019, the two were pictured on vacation in Greece together. Then, in January 2020, the pair was seen getting cozy at the American Australian Arts Awards. Just a few days after that, Elordi and Zendaya were caught kissing while out and about in SoHo. The apparent romance fizzled out as quietly as it started sometime in 2020. The pair still works together on the HBO Max hit show and Elordi even sent a big congrats to his former flame when she won her first Emmy. \"Congratulations Captain,\" the Australian-born actor wrote on his Instagram Story. \"Bravo.\"\n\n12 of 29 Jennifer Lawrence & Nicholas Hoult Dave M. Benett/Getty The X-Men franchise served as an important milestone (both personal and professional) for Lawrence and Hoult: They met on the set of the hit film and dated for a few years before ending their relationship in August 2014. \"These movies had been my life for so long and they had to come first in everything,\" the Oscar winner said in 2015. \"I was also in a relationship with somebody for five years and that was my life. So my life was this person and these movies and we broke up around the same time that I wrapped those movies.\" She continued: \"Being 24 was this whole year of, 'Who am I without these movies? Who am I without this man?' \" Hoult explained how he and Lawrence made it work at work post-split, telling ELLE, \"It's like going back to school after the summer holidays. The reality of [the X-Men franchise] is there are lots of characters, so everyone was together for brief periods, but not every day for four months.\"\n\n13 of 29 Sophia Bush & Chad Michael Murray Michael Brannigan/AP Bush and Murray were on-and-offscreen love interests on the set of One Tree Hill and tied the knot in 2005— but five months later, the two called it quits. The actress has chalked the brief union up to being \"22 and stupid\" but stressed that the two tried to make the best of it after they went separate ways, despite the fact that producers were \"really deeply inappropriate to both of us ... they ran TV ads about it. It was really ugly.\" \"People can call it whatever they want. They can say it's strength, they can say it's pride, they can say it's professionalism. You can put a positive or a negative skew on it,\" she said on the Drama Queens podcast. \"But I was always going to put Brooke Davis ahead of everybody and everything else. Nothing mattered to me but being honest for her.\"\n\n14 of 29 Rachel Bilson & Adam Brody \"One of the all time greats!\" Brody wrote in his Reddit AMA of working with Bilson on The O.C. The pair dated for three years of the four years they worked together on the show, and while their relationship didn't last in real life, their characters — Seth Cohen and Summer Roberts — tied the knot at the end of the series. The two also remain friendly, and Bilson has shared her appreciation for their relationship. \"Because of what the show was and how young we all were, going through it with someone experiencing the same thing and having that kind of support was really awesome,\" Bilson told Nylon in 2021. \"I'm actually grateful that I did have it. It was definitely a unique experience, and I don't think anyone else could have really understood it had they not been in it, so for that reason, it was super helpful and supportive, and I have total gratitude for the whole experience.\"\n\n15 of 29 Jennifer Garner & Michael Vartan Frederick M. Brown/Getty Before she married now ex-husband Ben Affleck, Jennifer Garner briefly dated Alias costar Michael Vartan between 2003 and 2004; they kept working together until 2006. And while their relationship was short-lived, the two remain close friends — but just friends, Vartan pointed out in 2018 when asked if they might ever reconcile. \"I don't think so,\" he said. \"If it didn't work once, there's a reason it didn't work.\"\n\n16 of 29 Jennifer Lopez & Marc Anthony Lester Cohen/WireImage Despite splitting up in 2011 after a decade of marriage, Lopez and Anthony still went forward with their global talent TV competition, Q'Viva! The Chosen, in 2012, and recorded a Spanish album together in 2016. \"We're just meant to be in each other's lives on different levels,\" Anthony previously said of working with his ex. \"This is a long story, it's not a short story ... Marriage was just one chapter ... And kids are another. We've got each other for life.\" Lopez echoed Anthony's sentiments in a 2017 interview: \"At first I was like, 'We're good with the kids and everything, but if we start working together, are we gonna start going at each other again?' And it's been awesome. Honestly, I think it's even helped our relationship.\"\n\n17 of 29 Nina Dobrev & Ian Somerhalder Getty The Vampire Diaries costars continued working together on the hit show as onscreen love interests well past their 2013 breakup, and fans hardly noticed a blip in their onscreen affection; they even snagged the \"Best Chemistry\" trophy at the 2014 People's Choice Awards. \"It's a good thing it's not awkward,\" Dobrev joked as she and Somerholder accepted the trophy. The former costars are on such good terms that Somerhalder's wife, Nikki Reed, joined the pair at a farewell dinner for the final season of The Vampire Diaries.\n\n18 of 29 Amanda Seyfried & Dominic Cooper Bruce Glikas/FilmMagic After meeting on set of the original 2008 hit Mamma Mia!, Seyfried and Cooper dated for three years before splitting in 2011. Seyfried spoke about how common on-set romances can be to Elle, saying \"You're put in a situation where you have to make out with each other. It's easy for things to get carried away.\" So when the two reprised their roles as newlyweds in the sequel, Mamma Mia! Here We Go Again, Seyfried admitted that her husband and Last World costar, Thomas Sadoski, wasn't exactly thrilled about their romantic onscreen reunion. \"I'd guess he assumed Dominic is in love with me the way he's in love with me. And it's just not the case, it's sweet,\" she said, adding, \"I'd rather he be jealous than completely fine with it.\"\n\n19 of 29 Jennifer Aniston & Tate Donovan Kevin Mazur/WireImage Fans of Friends would never be able to tell, but when Tate Donovan starred as Joshua Burgin, a love interest to Aniston's Rachel Green, he and the actress were actually in the midst of a breakup. The two were introduced by a mutual friend in 1995 and while Donovan was apprehensive about being in another high-profile relationship—he had just ended things with Sandra Bullock—their chemistry was undeniable. They would go on to be a serious item for two years, with The O.C actor becoming a frequent visitor on the Friends set. However, when he was asked to be on the sitcom, emotions from the split were still fresh. \"I was just happy to be on the team. The only bummer was Jennifer and I were breaking up at the time,\" he told Us Weekly in 2018. \"And so that was tricky to sort of act, and act like we are just meeting each other, and falling in love, or whatever, interested in each other, when we're sort of breaking up. That was just tough.\"\n\n20 of 29 Kyle Maclachlan & Laura Dern JB Lacroix/WireImage Decades after their 1980s relationship ended, the actors found themselves filming a sex scene together for Twin Peaks: The Return. MacLachlan discussed the unconventional reunion on The Ellen DeGeneres Show. \"We had this scene that we had to do together — we both knew going in — which was going to require some nakedness on both our parts. It's very funny because [director David Lynch] would sit down and say, 'Okay, this is what we're gonna do.' He talks you through it, so you feel pretty comfortable,\" he shared. \"And then you sit down, and Laura and I were kind of like, 'Okay, here we go.' Welcome back, 25 years later…Yeah, it was weird. We had a couple of laughs for sure.\"\n\n21 of 29 Dwayne Johnson & Dany Garcia Jim Spellman/WireImage Johnson and his producer ex have continued to collaborate on blockbusters since their 10-year marriage ended in 2007. \"It's not [easy],\" he told E! about working together post-breakup at the premiere of Hobbs & Shaw, which Garcia executive produced. \"For everybody out there, relationships aren't easy, marriages aren't easy, you gotta work at it.\" \"You never sign up for divorce … And we started out as friends and through divorce we still remain friends, but that kind of stuff takes a lot of work,\" the actor continued. \"A lot of times you see the glitz and the glamour of here in Hollywood and it's a big premiere, but that's the kind of sludgy stuff that everybody goes through. You gotta get your therapy and you got to go through it. But I always tell people and I always tell couples who are going through it — especially the dudes who seek out my advice who are like, 'How did you do it?' — I always say, 'You gotta put in the work, and just remember that you were friends beforehand.' Like, try to think about things like that, and think about your goals.\" Garcia and Johnson are parents to 17-year-old daughter Simone Alexandra Johnson.\n\n22 of 29 Naomi Watts & Liev Schreiber C Flanigan/FilmMagic Despite splitting in 2016 after 11 years together, Watts and Schreiber have remained on good terms. The stars' dynamic is so friendly, in fact, that they even signed on for a film, Chuck, which saw them take on the roles of husband and wife. \"I remember the first day [of shooting] that she came out of the trailer in the leopard print with the fake boobs and the hair,\" Schreiber told PEOPLE of working alongside his ex, adding that the experience was \"a treat.\" He added: \"She just went for it. I just knew it was going to be fun.\"\n\n23 of 29 Christina Anstead & Tarek El Moussa Jerod Harris/Getty After seven years of marriage, the Flip or Flop hosts called it quits — keeping news of their dissolution private for months before going public in December 2016. In late January, a source told PEOPLE that Tarek and Christina \"are very much committed and want to continue to work together and continue the show.\" The two continued filming the show together post-split for five years, but as they moved on with other people, it became apparent they were ready to end their working relationship too. \"Tarek and Christina are generally cordial. They're co-parenting and nothing gets in the way of that,\" a source told PEOPLE in 2022. \"The show was just too intimate of a setting at this point and it was time to close that chapter.\"\n\n24 of 29 Cameron Diaz & Justin Timberlake Dave Allocca/Startraks Proof there was no bad blood following Diaz and Timberlake's 2006 breakup: The pair starred in 2011's Bad Teacher together. \"It's great,\" the actress said of the experience. \"Justin and I have always had a good laugh together, and to make a movie where we get to have a laugh together, and there really was no one else who was more perfect for this part.\"\n\n25 of 29 Michael C. Hall & Jennifer Carpenter Jerod Harris/WireImage Two years before the end of Dexter in 2013, the costars — who were married from 2008 to 2011 while working on the show together — ended their union. \"Don't try this at home,\" Hall joked when asked how he and Carpenter make their professional relationship work after their divorce. \"The fact that Jennifer and I worked through whatever was going on with us personally and the way we did and maintained a commitment to telling this story was never in question,\" he went on. \"It was always what we needed and wanted to do.\"\n\n26 of 29 Nikki Reed & Paul Mcdonald George Pimentel/Getty A few months after announcing her divorce from the American Idol alum in 2014 following a whirlwind courtship, Reed continued working on a music collaboration with her ex-husband. The pair ultimately released their post-breakup album, I'm Not Falling — a joint effort they began working on in the early stages of their relationship.\n\n27 of 29 Bella Hadid & The Weekend Stefanie Keenan/Getty The Weeknd—real name Abel Tesfaye—and Bella Hadid were first linked together back in April 2015, when the \"Starboy\" crooner asked the supermodel to be in his video. The two would go on to date for a year and a half before going their separate ways in November 2016. Shortly after, The Weeknd and Hadid still had to work together when he was the selected performer at 2016's Victoria Secret Fashion Show in which Hadid was modeling. Though they may not have had to spend as much time together as the other ex-couples, their brief interaction on camera was enough to get fans riled up. The two did reconcile, but it wasn't until 2019 and they lasted a few months before saying goodbye for good.\n\n28 of 29 Milo Ventimiglia & Hayden Panettiere Michael Buckner/Getty Before he became America's favorite dad on NBC's This is Us, Milo Ventimiglia was also a lead on the network's Heroes, in which he starred alongside Hayden Panettiere from 2006 to 2010. The twostarted dating in 2007, though they had to keep their relationship under the radar partly due to their significant age difference. At the time, Ventimiglia was 30, while Panettiere was 18. They called it quits in 2009, though they had to keep filming Heroes. However, they didn't have to see each other at work for too for long, considering the fact that the sci-fi drama was canceled in 2010. Ventimiglia — who also dated Alexis Bledel while the two were playing love interests on Gilmore Girls — shared a few years later that dating a coworker isn't something he'd want to attempt again. He told Mr. Porter, \"[I'd] never do it again. There are things that happen to you in your life that shape who you are. Everything I've been through from jobs to friendships to partnerships, everything has built me to who I am. You learn from it. You learn a better way of doing things.\"", "images": ["https://people.com/thmb/X_FS43-yZMUHATfURxpfvkkXWjw=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(399x0:401x2)/nina-ian-01-800-889619bfadf54dd0aa2c7ef40549b8ba.jpg", "https://people.com/thmb/Ply5S-4nIaY5sTyOy3OZzdDFvAk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/jennifer-lopez6-8dfcffd224274f3fa214737c56af2fd3.jpg", "https://people.com/thmb/6YMkmjVi3TmowFGegJCAptVBPY4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Amy-Schumer-Chris-Fischer-111325-68d54c198ba54698b5d309804bf32f3e.jpg", "https://people.com/thmb/vNRQ8h5D5IpXjUI-xtVoy0YZ8NY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(741x0:743x2)/gettyimages-685942076-2000-e604359064054fdb9ad987703c9deb06.jpg", "https://people.com/thmb/Bh3W1CuXrVrTbcUrLIErX-fSdE4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Dwayne-Johnson-and-wife-Dany-Johnson-during-Be-Cool-Los-Angeles-Premiere-110725-3df6d0982ff94ecba1e9aee4cf287f3b.jpg", "https://people.com/thmb/tvXMRXdvgA34vBrKl59yNt_BzLc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/David-Geffen-David-Armstrong-051825-ebea6b6be9714cfc8a10bc99d5fe4f64.jpg", "https://people.com/thmb/d158xSEhoiVFQGwFC_LZJCObvzA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(872x0:874x2)/christina-el-moussa-9-2000-374945f6e1e04661b1e95e171d6935ab.jpg", "https://people.com/thmb/je4MV7R1hXbNg-oehBZeReGrlVI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/christina-haak-tarek-el-moussa-flip-off-102025-8bdc47c05b9f4bd297adb21a5c37f9cf.jpg", "https://people.com/thmb/Z-Y1q4vvM9MJI2Ektg7s4pTuwag=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(689x379:691x381)/Exes-Who-Worked-Together-Jennifer-Aniston-and-Tate-Donovan-d6f0a8e9bfe54de4bde98492c6e32d01.jpg", "https://people.com/thmb/A6jCv_kCrqY9VgOFZ4n2bR1UM18=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/sophia-bush-435-5-c66ce58e426d4abf8a27ac5994d48a99.jpg", "https://people.com/thmb/l99xqVkdZYOTQJxBHz1mqM2aihc=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(719x319:721x321)/Exes-Who-Worked-Together-Bella-Hadid-and-The-Weeknd-d022d329d1bc46aa840b8ee12cc99537.jpg", "https://people.com/thmb/dqgfPPXi83KWd9LXB3Xd47DyunI=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/Dwayne-Johnson-and-wife-Dany-Johnson-during-Be-Cool-Los-Angeles-Premiere-110725-3df6d0982ff94ecba1e9aee4cf287f3b.jpg", "https://people.com/thmb/dgaQEoitjqwo2PUofdvj95PqiM4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Colin-Firths-Ex-Wife-Livia-Giuggioli-Firth-102725-e7d2dbf3d50f427cac95744fd1630878.jpg", "https://people.com/thmb/6BVgFQ30gWgD9XmkUm2j5s90DZk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/alex-rodriguez-Cynthia-Scurtis-Madonna-111325-33c2de3e05914ed987d94df4aced2d95.jpg", "https://people.com/thmb/9IooZrbsA0K1aE50by0R4sc1ZFk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(614x379:616x381)/Exes-Who-Worked-Together-Maksim-Chmerkovsky-and-Karina-Smirnoff-cf54734de50c4f68a008c95e39317b66.jpg", "https://people.com/thmb/1eGmrZFjcTwi-wMb8B5c8zavEcI=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/Amy-Schumer-Chris-Fischer-111325-68d54c198ba54698b5d309804bf32f3e.jpg", "https://people.com/thmb/o6rCuNY_cfYBH_kMedxS_s-Khr0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(719x299:721x301)/Exes-Who-Worked-Together-BJ-Novak-and-Mindy-Kaling-18afd69e273e4dbd8a9de29a7e22f9fb.jpg", "https://people.com/thmb/CNwdpsgFbQRewxW1O7MwLeV3FK8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/penn-badgely-435-1-3e20251384164e46bc4cd44bf1b503ff.jpg", "https://people.com/thmb/OdYQBqE2xW_pq98D70zVGZphLR0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(939x614:941x616)/chase-stokes-madelyn-cline-619918d6d56a491fa2b1b03964149240.jpg", "https://people.com/thmb/Kh6fNm9WPgW_lCr71A2gKzR0mnY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(734x409:736x411)/Exes-Who-Worked-Together-Lili-Reinhart-and-Cole-Sprouse-438b5234517a49dea52eb94a72f888f4.jpg", "https://people.com/thmb/14aTofb_LxCFjPN8m0aS2nEQXxw=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(614x359:616x361)/Exes-Who-Worked-Together-Jacob-Elordi-and-Joey-King-a225c010734b461f9d4617e53467561e.jpg", "https://people.com/thmb/eYgvON48R67fwO0Uiv5kl6S6Nto=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(779x329:781x331)/Exes-Who-Worked-Together-Milo-Ventimiglia-and-Hayden-Panettiere-9190e682bd6d406a9c35e336697d905c.jpg", "https://people.com/thmb/rOd1j9_NARZk3Rp0qYudmD8FhcE=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/bj-novak-mindy-kaling-jennifer-lopez-ben-affleck-nina-dobrev-ian-somerhalder-100725-44aec9f3900b46c98ffa6329bc6020fa.jpg", "https://people.com/thmb/bPRr49iSek02jBass9S4e-yomVI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Drake-and-Serena-Williams-111925-1730587f36384e638ef89c0c54671fc3.jpg", "https://people.com/thmb/Oig4hsirhcdji5niTRQRDrEwH74=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/florence-pugh-zoe-lister-jones-molly-shannon-zach-braff-a-good-person-film-screening-032123-1-f1ef68f9f34d44e3b6cfa1471382620c.jpg", "https://people.com/thmb/y3FRjr3M7jykVQEMMU1gs6az6mg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/nikki-reed-435-68-9c5cdae31a5147518d139ca0d06ca617.jpg", "https://people.com/thmb/8OOKQ49LNRRy0c0vRwsTBQO8jEw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Paul-Costabile-Christina-Perri-110325-462d8ffcbb564b3eacf30639765d08f8.jpg", "https://people.com/thmb/CDObHAx8mfh6eqviXxwqvYpFRKk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(692x0:694x2)/amanda-seyfried2-bd222bd4cfaf4e6db51c8cf9a98aa361.jpg", "https://people.com/thmb/fWsYOVHOkB7JTRVWYmk38xG987k=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/schreiber-watts-2000-2c6e2876749540c3a03a1082e48ae0b4.jpg", "https://people.com/thmb/pnrVLQ3ToqSQe8pqfG7pp3IsHdU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(511x0:513x2)/jennifer-lawrence-1024-2-ec60e92597e141e4a439c40024cbf678.jpg", "https://people.com/thmb/l1heBQe1jhrtwJjca13fVum5wTk=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/ekaterina-gordeeva-sergei-grinkov-ice-skating-111925-43f6a37ba62840c685a1b57f3a2569ac.jpg", "https://people.com/thmb/C-s4P-0wRjMStywhhgmLSY-rQhM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/rachel-bilson-134168372437471a93ccc87ab0760aac.jpg", "https://people.com/thmb/GPITKJ8RS00Pg0LAL0xGmA-jroo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(684x0:686x2)/justin-timberlake-1-393305b349f44a05a16dfc2032395933.jpg", "https://people.com/thmb/7NYL4d2zN3CeMVsi56obTZ1KkWQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/michael-c-hall-435-8-7eea51468337475f8d44f76c826c8760.jpg", "https://people.com/thmb/7nVi-aqhARmealdbMVzY7ae_0Fc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/avril-lavigne-mod-sun-110725-1-cddff8a22812471892c45af53228f8bb.jpg", "https://people.com/thmb/CLsHkzTSADFXkMh3mKaGQyUkDcE=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x309:751x311)/Exes-Who-Worked-Together-Katie-Holmes-and-Joshua-Jackson-f759ba008ded491fa08d1175dda2f195.jpg", "https://people.com/thmb/M9vibNkktov8ZlMgLuU5vHBe9_0=/200x200/filters:no_upscale():max_bytes(150000):strip_icc()/IMG_7908-3b1878c6e756421c9e2c4ec710f60c22.JPG", "https://people.com/thmb/L3aBsQkkqADYhdOGOFQpxNmr3uQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(489x374:491x376)/HSMTMTS-season3-premiere-072822-3-403401830d6a4342b99c21034561c8f6.jpg", "https://people.com/thmb/92qw6MjUVPI_Dm58TIr2OsfSdrM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/florence-pugh-zach-braff-032123-1-58fde01c059f4669ab53c31953565660.jpg", "https://people.com/thmb/W7pR5Ab5uQ2xdjO8WSlfEinulo0=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/Vencent-Hickerson-111925-6-f70136ab95854fed905274e761d98e0f.jpg", "https://people.com/thmb/AWIgLw6oCjvuGnuN6Z3n2PeyuEk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/brittany-cartwright-jax-taylor-042424-2-44111ab94387465fb3c3f9b56068c753.jpg", "https://people.com/thmb/VFtLHFmbkeHnMgT2loY6vr-51Pk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(719x309:721x311)/Exes-Who-Worked-Together-Camila-Mendes-and-Charles-Melton-2c0e5e39a10a4a01a2695cb0e181eaf0.jpg", "https://people.com/thmb/xTvvx8qyzyeWODkIgDhX4FYfsP0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/kaley-cuoco-1-435-2-705676f7c8bb467aa7a6f84ce3564e5c.jpg", "https://people.com/thmb/1y8biv50D_dBwRQRvhhst6ohpOU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/emma-chamberlain-parents-michael-sophia-8-b3317c0615a64b9abe29af60259abc07.jpg", "https://people.com/thmb/iPL6ygoplJm3OyBoODdKzwlPcI8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/khloe-kardashian-lamar-odom-111925-cd0c726941d7492f9b707b58943304a1.jpg", "https://people.com/thmb/6IyhFgQT3wu0NWP0Aphz5wDFs4s=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/Kelsey-Zach-Top-Riley-Green-111925-f36976ca5eb14ae792f092060f209f93.jpg", "https://people.com/thmb/VM5gV5u7r4D-53x4Pqvu9t1WkHU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Nina-Dobrev-not-pretending-Tiktok-111425-tout-9bb898904aa846d98702bf022f30d105.jpg", "https://people.com/thmb/UbSBI8mIv88DQ3sDbZnI4UopsIs=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x499:751x501)/Exes-Who-Worked-Together-Jennifer-Garner-and-Michael-Vartan-d88791bf48b54353bfd1716122d03060.jpg", "https://people.com/thmb/0UUuCTLgdkTmk17m_oh6OXRxuoo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/bj-novak-mindy-kaling-jennifer-lopez-ben-affleck-nina-dobrev-ian-somerhalder-100725-44aec9f3900b46c98ffa6329bc6020fa.jpg", "https://people.com/thmb/1WsukErPiKgOCOelBXH4mFkykRY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Jacob-Elordi-and-Olivia-Jade-102725-ade9beef74bd4689b0819fdc447b51bd.jpg", "https://people.com/thmb/SLX76p4w-rfRc_Kk1N7oqdNk8qw=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/meghan-king-5th-Annual-Vanderpump-Dog-Foundation-Gala-2023-jim-edmonds-Busch-Stadium-2024-092425-66f95d42ed374e038155e8e43fc99358.jpg", "https://people.com/thmb/E_d7To6VEPiqNhllGs1e5mMmojU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(734x319:736x321)/Exes-Who-Worked-Together-Jacob-Elordi-and-Zendaya-cc0c85617b2445ce99d99e8f4ff6992f.jpg", "https://people.com/thmb/Pd2mGwyfhDikJkJtGi2uJhE1Nts=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Angelina-Jolie-Billy-Bob-Thornton-111825-86b23fdf767748bf816a9e1be59a0075.jpg", "https://people.com/thmb/k_Eb3oiFEAClOFCuThrEafgD364=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/dwayne-johnson-1-1-2000-a5edcd42638443599dfed3cb96b6c4d0.jpg"], "top_img": "https://people.com/thmb/92qw6MjUVPI_Dm58TIr2OsfSdrM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/florence-pugh-zach-braff-032123-1-58fde01c059f4669ab53c31953565660.jpg", "keywords": [], "authors": ["Grace Gavilanes", "Grace Gavilanes Is A Former Associate Editor At People. She Left People In", "People Editorial Guidelines", "Stephanie Sengwe Is A Pop Culture Enthusiast With Over Years Of Experience Working As A Digital Writer", "Editor", "Reporter In The Entertainment", "Lifestyle Spaces. She Joined People In", "Is Currently Serving As The Features Editor.", "Stephanie Sengwe", "Jack Smart"], "canonical_link": "https://people.com/celebrity/celeb-exes-who-worked-together-after-breaking-up/", "title": "Celeb Exes Who Worked Together After Splitting Up", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Imagine having to work alongside an ex immediately after breaking up — and read about stars like Florence Pugh and Zach Braff who did", "emailcontenttype": "LISTSC", "emailvertical": "PEOPLE", "sailthru.author": "Grace Gavilanes", "parsely-section": "Celebrity", "parsely-tags": "Celebrity Breakups,TV,Laura Dern,Movies,Animal Shelters & Rescues,Kyle MacLachlan,The Scoop", "article": {"section": "People", "author": "https://www.facebook.com/peoplemag"}, "og": {"type": "article", "site_name": "People.com", "url": "https://people.com/celebrity/celeb-exes-who-worked-together-after-breaking-up/", "title": "Celeb Exes Who've Had to Work Together After Splitting Up — and What They've Had to Say About It", "description": "Imagine having to work alongside an ex immediately after breaking up — and read about stars like Florence Pugh and Zach Braff who did", "image": "https://people.com/thmb/92qw6MjUVPI_Dm58TIr2OsfSdrM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/florence-pugh-zach-braff-032123-1-58fde01c059f4669ab53c31953565660.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Celeb Exes Who've Had to Work Together After Splitting Up — and What They've Had to Say About It", "description": "Imagine having to work alongside an ex immediately after breaking up — and read about stars like Florence Pugh and Zach Braff who did", "image": "https://people.com/thmb/92qw6MjUVPI_Dm58TIr2OsfSdrM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/florence-pugh-zach-braff-032123-1-58fde01c059f4669ab53c31953565660.jpg"}, "vf": {"url": "https://people.com/celebrity/celeb-exes-who-worked-together-after-breaking-up/"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.147.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.147.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.147.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.147.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.147.0/icons/favicons/mstile-310x150.png", "fb": {"pages": 95926963131}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}