{"url": "https://www.harpersbazaar.com/celebrity/latest/a12452861/beyonce-jay-z-yacht-date-night/", "text": "Every product on this page was chosen by a Harper's BAZAAR editor. We may earn commission on some of the items you choose to buy.\n\nBeyoncé and Jay-Z are are one of America's favorite celebrity power couples of the modern era—and their romance, despite all its publicized trials and tribulations, continues to flourish.\n\nAlways committed to their privacy and forever evolving, the singer and rapper have remained one of the most recognized A-lister couples since the early aughts, carving out legendary milestones as a duo that have gone down in pop culture history—their joint musical projects included.\n\nThroughout their two-decade-plus romance, Beyoncé and Jay-Z have frequently paid tribute to one another through song, and some tracks have even gone on to win Grammys (never forget Beyoncé's very first musical tribute to Jay-Z, \"Crazy in Love\"). As fate would have it, the two are now tied as the most-Grammy-nominated figures in history.\n\nAhead, look back at the pair's love story—from their historic joint performances, to their public tributes to one another, to glimpses of their private family life.\n\nJune 22, 2025: They sing together in Paris.\n\nParis gets quite a show as Beyoncé takes the stage at Stade de France amid her Cowboy Carter tour and performs her hit “Crazy in Love”—bringing a very special guest to the stage. Jay-Z makes a surprise appearance to rap alongside his wife, closing her string of Paris shows with a bang.\n\nSee a clip of the moment here:\n\nDecember 9, 2024: They make a rare red-carpet appearance.\n\nThe two walk the red carpet with their 12-year-old daughter, Blue Ivy, and Beyoncé’s mother, Tina Knowles, for the world premiere of Mufasa, in which Blue and Beyoncé voice acted.\n\nLISA O'CONNOR // Getty Images\n\nLISA O'CONNOR // Getty Images\n\nSeptember 6, 2024: The couple embark on a tropical vacation for Beyoncé's birthday.\n\nBeyoncé shares a peek of her birthday getaway on Instagram, including photos of her and Jay-Z lounging together on a daybed.\n\n“I’m so grateful for another year. Thank you for the loving birthday wishes. 🙏🏾🐝,” she writes in the caption.\n\nApril 1, 2024: Beyoncé pays tribute to Jay-Z during award acceptance speech.\n\nThe singer accepts the Innovator Award at the 2024 iHeartRadio Music Awards. During her speech, she expresses her gratitude to husband Jay-Z for his support for her work.\n\n“My husband. My rock. My best friend,” she says. “I love you.”\n\nShe also makes reference to their kids: Blue Ivy, Rumi, and Sir. “My three beautiful children who continue to be my inspiration and my biggest blessing,” she concludes her speech.\n\nFebruary 4, 2024: Jay-Z uses his Grammys speech to call out Beyoncé's Album of the Year snubs.\n\nJay-Z accepts a black gramophone for the Dr. Dre Global Impact Award at the 66th Grammy Awards show. During his speech, he calls out the ongoing problems he sees within the Recording Academy, especially as they relate to snubbing wife Beyoncé of the Album of the Year award.\n\n“I don’t want to embarrass this young lady,” he says, gesturing toward Beyoncé at their table, “but she has more Grammys than everyone, and never won Album of the Year. So even by your own metrics, that doesn’t work. Think about that: The most Grammys, never won Album of the Year—that doesn’t work.”\n\nHe adds, “Some of you are gonna go home tonight and feel like you’ve been robbed. Some of you may get robbed. Some of you don’t belong in the category.”\n\nSeptember 11, 2023: Beyoncé shares rare photos at-home with Jay-Z.\n\nThe “Virgo's Groove” singer shares a rare glimpse into her personal life at-home with Jay-Z by posting pictures of her 42nd birthday celebrations on Instagram. Pictures capture the two, who are currently traveling across the country for Bey's Renaissance World Tour, embracing each other and laughing while sitting on a kitchen counter. Beyoncé additionally shares photos of her birthday party decor, including silver balloons and a disco ball-themed cake, and her birthday outfit, featuring a graphic T-shirt and sparkling silver glitter boots.\n\nFebruary 2023: Jay-Z says the Grammys “missed the moment” after snubbing Beyoncé.\n\n\n\nIn a Q&A with Tidal before the 65th Grammy Awards, Jay-Z explains why he thinks the Album of the Year award belongs to Beyoncé (Harry Styles's Harry's House ultimately won the Grammy that night).\n\n“Look what it's done to the culture. Look how the energy of the world moved,” he says of Renaissance's impact. “They play her whole album in the club. I don't know if I've ever seen that. The whole entire joint—like, everything?! Every remix is amazing. Everyone's inspired. It has inspired the world. Every remix is better than the other one. ... When it just inspires creativity, that's an album. That has to be Album of the Year. It has to be.”\n\nThe rapper adds that he “hope[s] they just get it right,” addressing how the Academy has failed to recognize her achievements in the past. “Even with Bey, I felt like they missed the moment. Not just LEMONADE; [also] when Beck won over her [for Album of the Year at the 2015 show]. I was like, ‘Oh, y'all missed it,’” he says.\n\nThe two are captured on a date night at celebrity hot spot Giorgio Baldi in Santa Monica, California, in a rare informal public appearance.\n\nJuly 29, 2022: Beyoncé drops Renaissance, with a special tribute to Jay-Z.\n\nThe singer dedicates her seventh studio album, Renaissance, to Jay-Z.\n\nThroughout the album, she continues to reference her husband—as well as his highly publicized infidelity. She even alludes to the elevator fight between him and her sister Solange in \"Cozy,\" while seemingly defending her in the lyrics.\n\n\"She's a god, she's a hero / She survived all she been through / Confident, damn, she lethal / Might I suggest you don't fuck with my sis / 'Cause she ­comfortable,\" Beyoncé sings.\n\nApril 4, 2022: Beyoncé's mom commemorates the couple's 14th anniversary.\n\nTina Knowles-Lawson shares a sweet tribute for the couple with a video montage on Instagram.\n\n\"Happy Anniversary to one of my inspirations for a couple!\" she writes in the caption. \"They work hard, laugh hard, and love Harder ❤️❤️❤️🙏🏽🙏🏽 14 years.\"\n\nMarch 30, 2019: Jay-Z dedicates an award to Beyoncé.\n\nThe pair attend the 2019 NAACP Image Awards for a joint victory night, where they both take home honors: Beyoncé is honored as Entertainer of the Year, while Jay-Z is given the President's Award. During his acceptance speech, Jay-Z dedicates the award to all the strong women in his life, those of whom, of course, include wife Beyoncé.\n\nEarl Gibson III // Getty Images\n\nFebruary 20, 2019: They shade the United Kingdom at the Brit Awards.\n\nThe two remotely accept their award for Best International Group—and in so doing, iconically pose in front of a framed photo of Duchess Meghan, quietly (yet loudly all the same) demonstrating their support for the American-born royal at the height of the British royal drama and xenophobia.\n\nJune 16, 2018: They release a joint album, Everything Is Love.\n\nThe two dedicate their first joint album to their love. They later win a Grammy for Best Urban Contemporary Album at the 61st Annual Grammy Awards.\n\nJune 6, 2018: They kick off their On the Run II Tour.\n\nFollowing their successful first tour launch in Miami on June 2014, the two embark on their second On the Run Tour in Cardiff, England, where the couple perform 37 tracks in a two-hour performance, and appear to have also renewed their vows.\n\nIn a clip captured from the tour opener, the two appear onstage with their children in all-white attire, as they sing their hit 2009 duet, \"Young Forever,\" while the message \"THIS IS REAL LOVE\" appears across the screen behind them. \"LOVE IS UNIVERSAL\" and \"LOVE NEVER CHANGES\" are additional messages that appear throughout the performance.\n\nKevin Winter/PW18 // Getty Images\n\nDuring a tour break the following month, the two are captured relaxing on a yacht in Italy.\n\nNovember 29, 2017: Jay-Z opens up about his infidelity.\n\nIn a conversation with , the rapper elaborates on how he and Bey ultimately reached a reconciliation after his infidelity.\n\n\"You know, most people walk away, and like divorce rate is like 50 percent or something 'cause most people can't see themselves,\" he says, adding that therapy has helped him through the pain. \"The hardest thing is seeing pain on someone's face that you caused, and then have to deal with yourself,\" he continues. \"Most people don't want to do that. You don't want to look inside yourself. And so you walk away.\"\n\nJune 13, 2017: They welcome twins.\n\nThe two welcome baby twins Sir and Rumi Carter. To make space for their growing family, the stars settle into a new Bel-Air mansion later in August.\n\n\"We would like to share our love and happiness. We have been blessed two times over. We are incredibly grateful that our family will be growing by two, and we thank you for your well wishes,\" Beyoncé writes in her pregnancy announcement on Instagram, signing the message, \"The Carters.\"\n\nLater in the month, the rapper also drops his 13th studio album, 4:44, where he explicitly admits to his infidelity for the first time.\n\n\"I apologize, our love was one for the ages and I contained us,\" he raps on his \"4:44\" track. \"And if my children knew, I don't even know what I would do / If they ain't look at me the same / I would prolly die with all the shame.\"\n\nApril 4, 2017: They commemorate their ninth anniversary.\n\nBeyoncé shares a heartfelt tribute to the rapper on Instagram with a video montage commemorating nine years of marriage (as well as 10 years of romance).\n\nLater in the month, the two jet off to Bora Bora for a romantic getaway ahead of the birth of their twins.\n\nOctober 7, 2016: They return to the stage.\n\nThe two perform together for the first time since the Met Gala incident during the final leg of Beyoncé's Formation World Tour. Beyoncé invites Jay-Z to the stage with her and tells the audience to \"give it up for [her] man\" before going in for a kiss, seemingly confirming a reconciliation.\n\nApril 23, 2016: Beyoncé releases Lemonade.\n\nThe singer releases her sixth studio album, Lemonade, which brutally picks apart the rapper's cheating scandal, fueling ongoing rumors of a consequential split. (Though Beyoncé never confirms this subject matter herself, lyrics such as, \"If you try this shit again you gon' lose your wife,\" in \"Don't Hurt Yourself\" and, \"You can taste the dishonesty / It's on your breath as you pass it off so cavalier,\" in \"Pray You Catch Me\" seem to reference the adultery.)\n\nRumors of a rift between them further escalate the following month when Beyoncé appears solo at the Met Gala, as well as on August 28, when she performs without Jay-Z at the MTV VMAs.\n\nBeyoncé's mom, Tina Knowles-Lawson, undermines all the rumors at the time, telling People, \"[The album] could be about anyone's marriage. I think that everybody at one time or another has been betrayed and lied to and it's about the pain and it's about the healing process and it's about, 'How do you get past that and move on.'\"\n\nMay 5, 2014: The Met Gala altercation spurs cheating rumors.\n\nPer leaked video footage that soon goes viral, Beyoncé's sister Solange physically attacks Jay-Z inside an elevator at the Met Gala. The infamous altercation is rumored to have occurred in response to the rapper's cheating.\n\nDays later, the trio release a statement to address the public fight, though fail to explain why it happened.\n\n\"There has been a great deal of speculation about what triggered the unfortunate incident. But the most important thing is that our family has worked through it. Jay and Solange each assume their share of responsibility for what has occurred. They both acknowledge their role in this private matter that has played out in the public. They both have apologized to each other and we have moved forward as a united family. The reports of Solange being intoxicated or displaying erratic behavior throughout that evening are simply false. At the end of the day families have problems and we're no different. We love each other and above all we are family. We've put this behind us and hope everyone else will do the same.\"\n\nDivorce rumors circulate following the incident.\n\n\"Word around the industry has been that things are rocky at home,\" a music source who has worked with Jay-Z tells People at the time. Though, another friend of Jay-Z's insists, \"They are a great couple. They are soulmates and perfect for each other.\"\n\nDimitrios Kambouris Dimitrios Kambouris\n\nA year later, Solange, as well as Beyoncé and Jay-Z, are seen once again at the Met Gala, though they are not photographed together.\n\nFebruary 15, 2013: Beyoncé gushes over Jay-Z in an interview.\n\nSpeaking with Oprah Winfrey in Oprah's Next Chapter, the singer expresses her gratitude for Jay-Z and all that he's done to support her throughout their relationship.\n\n\"I would not be the woman I am if I did not go home to that man,\" she .\n\n\"You know we were friends first for a year and a half before we went on any date on the phone for a year and a half,\" she adds. \"And that foundation is so important in a relationship. And just to have someone that you just like is so important and someone that is honest.\"\n\nThe following day, the pair also release their HBO documentary, , offering a further glimpse into their life via clips of video diaries, performances, and exclusive confessionals.\n\nJanuary 7, 2012: They welcome their first child.\n\nThe couple welcome their first child, Blue Ivy Carter. Bey shares the first photos of Blue the following month on her Tumblr account.\n\n\"We welcome you to share in our joy,\" the singer writes on the post.\n\nAugust 28, 2011: Beyoncé debuts her first baby bump.\n\nAfter months of pregnancy rumors, the singer finally confirms the news at the 2011 MTV VMA Awards, where she cradles her baby bump in a bright orange gown.\n\nSteve Granitz // Getty Images\n\nLater that evening, Beyoncé publicly addresses the pregnancy during her performance of \"Love on Top,\" telling the audience, \"I want you to stand up on your feet. I want you to feel the love that's growing inside me.\"\n\nJanuary 20, 2009: They perform at President Barack Obama's first inauguration.\n\nIn the first of many Obama-hosted presidential events they attend together as a couple, Beyoncé and Jay-Z sing \"America the Beautiful\" at President Barack Obama's swearing-in ceremony at the White House. They also perform the Etta James classic \"At Last\" for the president and First Lady Michelle Obama's first dance at the inaugural ball.\n\nNovember 20, 2008: Beyoncé opens up about marriage.\n\nThe singer opens up about what her marriage to Jay-Z has taught her.\n\n\"I guess probably that we're all human,\" she tells Seventeen magazine. \"I don't care if you're picture-perfect on every magazine cover, and you're the most handsome, successful, coolest guy—you still get sad, and you still get your feelings hurt, and you still get confused and vulnerable and nervous and scared. You have to find a person you can make it through the tough times with.\"\n\nApril 4, 2008: They get married.\n\nThe two get married in a top-secret, intimate wedding soirée held in the rapper's Manhattan penthouse.\n\n\"It was a very emotional wedding—lots of crying—and really very spiritual,\" an insider later tells People.\n\nLater, in August, Jay-Z responds to questions about the wedding in an interview for Vibe.\n\n\"That's ridiculous for me to confirm,\" he says. \"I don't have … I'm gonna say, I think that was a ridiculous question. I just think it's really a part of your life that you gotta keep to yourself. … You have to, or you'll go insane in this type of business. You have to have something that's sacred to you and the people around you. … I shared so much of my life, my childhood, and my family, the death of my nephew with the world. I should have something to hold on to. You need something for your sanity to say, 'Okay, I could chill out, and this is it.'\"\n\nBey also talks marriage in an interview with Seventeen.\n\n\"There was no rush—no one expected me to run off and get married,\" she tells the magazine. \"I really don't believe that you will love the same thing when you're 20 as you do at 30. So that was my rule: Before the age of 25, I would never get married. I feel like you have to get to know yourself, know what you want, spend some time by yourself, and be proud of who you are before you can share that with someone else.\"\n\nEventually, the two do confirm the nuptials. Years later, Beyoncé even features footage from their wedding in her \"All Night\" music video, released in November 2016.\n\nAugust 29, 2004: They make their red-carpet debut.\n\nThe singer and rapper make their first red-carpet appearance as a couple at the MTV Video Music Awards in Miami, where both take home Moonmen.\n\nJeff Kravitz // Getty Images\n\nMay 14, 2003: Beyoncé debuts Jay-Z on her track.\n\nBeyoncé drops her first song dedicated to Jay-Z, \"Crazy in Love,\" from her debut solo studio album, Dangerously in Love. The track goes on to win best R&B Song and Best Rap/Sung Collaboration the following year at the 46th Annual Grammy Awards.\n\nThe two are not yet public with their relationship at this time, but the dedicated tracks fuel ongoing rumors of a relationship.\n\nDuring a 2013 conversation with the singer, years later, Oprah Winfrey made a point to remind Bey how she had advised the singer to maintain privacy surrounding her fling with the rapper during their first chat.\n\n\"I remember the first time you were on the Oprah show, I told you, 'Don't go around telling people who you're dating,'\" Winfrey recalled.\n\nOctober 10, 2002: Jay-Z debuts Beyoncé on his track.\n\nThe rapper releases his first song dedicated to the singer, \"03 Bonnie & Clyde,\" from his seventh studio album, The Blueprint 2: The Gift & the Curse. The singer additionally makes an appearance in the music video, which they filmed together in Mexico.\n\nNovember 2001: They confirm their relationship on Vanity Fair.\n\nThe pair officially confirm their romance with a couple's shoot for Vanity Fair, spilling more details on their relationship and how they met.\n\n\"We were just beginning to try to date each other,\" the rapper tells the magazine, adding, \"Well, you know, you've got to try first. You got to dazzle. … wine and dine. … She's a charming Southern girl, you know, she's not impressed. … But I would have definitely had to be this cool.\"\n\nCirca 1999–2000: They court each other.\n\nThe singer and rapper first meet at the MTV Spring Break Festival in Cancún, Mexico, sometime between September 1999 and August 2000, when the singer was just a teenager.\n\n\"I was 18 when we first met, 19 when we first started dating,\" she recalled to Seventeen in 2008.\n\n\"We were friends first for a year and a half before we went on any dates,\" the singer also told Oprah Winfrey in 2013.", "images": ["https://hips.hearstapps.com/hmg-prod/images/gettyimages-1910714113-65d75b965864a.jpg?crop=1.00xw:0.670xh;0,0.101xh&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/x-regular.e414d97.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/caret-left-regular.5546078.svg", "https://www.harpersbazaar.com/_assets/design-tokens/harpersbazaar/static/images/logos/logo.823d7af.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1038230794-68596523168b1.jpg?crop=1xw:0.8252148997134671xh;0.208xw,0.0587xh", "https://hips.hearstapps.com/hmg-prod/images/jay-z-accepts-the-presidents-award-onstage-at-the-50th-news-photo-1674589763.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523ffffff&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1775781039-68d4422ae0941.jpg?crop=0.700xw:1.00xh;0.157xw,0&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/harpersbazaar/static/images/logos/network-logo.6416a85.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-472231038-1659384713.jpg?crop=1xw:0.979978354978355xh;center,top&resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=currentColor&id=link-out-embed", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/envelope-simple-regular.91a0134.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/beyonce-and-jay-z-perform-onstage-during-the-on-the-run-ii-news-photo-1659459666.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-472230436-1659384735.jpg?crop=0.9675858732462506xw:1xh;center,top&resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg?primary=%2523ffffff", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://hips.hearstapps.com/hmg-prod/images/megan-fox-and-machine-gun-kelly-attend-universal-music-news-photo-1684514141.jpg?crop=1.00xw:0.670xh;0,0.129xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/singer-beyonce-arrives-at-the-the-28th-annual-mtv-video-news-photo-1659385056.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/pictured-gabriela-berlingeri-bad-bunny-on-the-red-carpet-at-news-photo-1660319174.jpg?crop=1.00xw:0.668xh;0,0.0599xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1489056535-645d20bc23bd1.jpg?crop=0.723xw:1.00xh;0.143xw,0&resize=360:*", "https://hips.hearstapps.com/rover/profile_photos/21445446-1bde-4290-a24e-2bdd274be027_1521573573.jpg?fill=1:1&resize=160:*", "https://hips.hearstapps.com/hmg-prod/images/beyonce-and-jay-z-during-2004-mtv-video-music-awards-red-news-photo-1659383022.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1259015499-6632470007f66.jpg?crop=0.720xw:1.00xh;0.147xw,0&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1463278313-64ee2146ab638.jpg?crop=0.679xw:1.00xh;0.188xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1191508186.jpg?crop=0.676xw:0.998xh;0.200xw,0.00240xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/jake-bongiovi-and-millie-bobby-brown-attend-netflixs-news-photo-1763046330.pjpeg?crop=0.793xw:0.529xh;0.0635xw,0.202xh&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/bookmark-simple-regular.9d9d56b.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2188545136-6757b3ab252e2.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/david-harbour-and-lily-allen-attend-the-26th-annual-screen-news-photo-1762971918.pjpeg?crop=0.738xw:1.00xh;0.132xw,0&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/globe-simple-regular.e7f303c.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/saved.ad81f1a.svg?primary=%2523000000", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2188545382-6758a08f84a83.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/taylor-swit-matt-healy-2-645e910541bf8.jpg?crop=0.503xw:1.00xh;0,0&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2151728037-67d33e4679c52.jpg?crop=0.550xw:0.825xh;0.175xw,0&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1038230794-68596523168b1.jpg?crop=0.619xw:0.453xh;0.208xw,0.0587xh&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1038230794-68596523168b1.jpg?crop=0.619xw:0.453xh;0.208xw,0.0587xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.harpersbazaar.com/celebrity/latest/a40732981/beyonce-jay-z-relationship-timeline/", "title": "Beyoncé and Jay-Z’s Complete Relationship Timeline", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Beyoncé and Jay-Z’s Complete Relationship Timeline", "description": "From their joint music collaborations to their public ups and downs and intimate family life—look back at the celebrity romance of the decade.", "theme-color": "#000000", "og": {"site_name": "Harper's BAZAAR", "title": "Jay-Z Joined Beyoncé Onstage in Paris Last Night to Perform \"Crazy in Love\"", "description": "See the clip", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1038230794-68596523168b1.jpg?crop=0.619xw:0.453xh;0.208xw,0.0587xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.harpersbazaar.com/celebrity/latest/a40732981/beyonce-jay-z-relationship-timeline/", "type": "article"}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "opinion": "false", "section": "Celebrity News", "modified_time": "2025-06-23T14:36:00Z", "published_time": "2025-06-23T14:36:00Z"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "parsely-metadata": "{\"socialHeadline\":\"Jay-Z Joined Beyoncé Onstage in Paris Last Night to Perform \\\"Crazy in Love\\\"\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1038230794-68596523168b1.jpg?crop=0.684xw:1.00xh;0.159xw,0&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1038230794-68596523168b1.jpg?crop=0.619xw:0.453xh;0.208xw,0.0587xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1038230794-68596523168b1.jpg?crop=0.684xw:1.00xh;0.159xw,0", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1038230794-68596523168b1.jpg?crop=0.619xw:0.453xh;0.208xw,0.0587xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "timely", "sailthru.excerpt": "Beyoncé and Jay-Z are are one of America's favorite celebrity power couples of the modern era—and their romance, despite all its publicized trials and tribulations, continues to flourish. Always committed to their privacy and forever evolving, the singer and rapper have remained one of the most recognized A-lister couples since", "sailthru.tags": "celebrity,Celebrity,latest,Celebrity News,celebrity-relationships,Celebrity Relationship News,Harper's BAZAAR-US", "sailthru.date": "2025-06-23 14:36:00", "sailthru.socialtitle": "Jay-Z Joined Beyoncé Onstage in Paris Last Night to Perform \"Crazy in Love\"", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1750689360.0, "source": "https://www.harpersbazaar.com", "summary": ""}