{"url": "https://en.wikipedia.org/wiki/Chloe_Kim", "text": "American snowboarder (born 2000)\n\nChloe Kim (born April 23, 2000) is an American professional snowboarder and two-time Olympic gold medalist. At the 2018 Winter Olympics, she became the youngest woman to win an Olympic snowboarding gold medal when she won gold in the women's snowboard halfpipe at 17 years old.[3]\n\nAt the 2022 Beijing Winter Olympics, she became the first woman to win two gold medals in halfpipe. She is an eight-time X Games gold medalist and the first woman to win two gold medals in snowboarding at the Winter Youth Olympic Games.[4][5][6] She is the World, Olympic, Youth Olympic, and X Games champion in the halfpipe and the first to win the title at all four major events.\n\nKim has won five ESPY Awards, including Best Female Action Sports Athlete three years in a row.\n\nEarly life [ edit ]\n\nKim was born on April 23, 2000, in Long Beach, California, and raised in nearby Torrance. She has two older sisters, Erica and Tracy.[7] Her parents are from South Korea. Kim began snowboarding at age four at the southern California resort of Mountain High. She started competing at age six as a member of Team Mountain High.[8] She spent third and fourth-grade studying and training in Geneva, Switzerland[9] where her aunt lived,[10] before returning to California and training at Mammoth Mountain. She is fluent in French, English, and Korean.[11] Kim's father quit his job to drive her to the mountains and also to be able to travel with her when she competes. Chloe Kim went to Dana Middle School. Kim joined the U.S. Snowboarding Team in 2013.[12]\n\nCareer [ edit ]\n\nAt the 2016 U.S. Snowboarding Grand Prix, Kim became the first woman to land back-to-back 1080 spins in a snowboarding competition.[7][13][14] She scored a perfect 100 points and is the second rider ever to do so, after Shaun White.[15] In 2024, Kim became the first woman to land a 1260 in competition history.[16]\n\nX Games [ edit ]\n\nWhile too young to compete in the 2014 Sochi Winter Olympics, Kim earned a silver medal in superpipe in the 2014 Winter X Games behind Kelly Clark. In 2015, Chloe won Gold in the superpipe at the Winter X Games, besting Clark.[17] With this win, at age 14, Kim became the youngest gold medalist until she lost the record to Kelly Sildaru, who won gold in 2016 at the age of 13.[18][19] In the 2016 X Games, she became the first person under the age of 16 to win two gold medals (and also the first person to win back-to-back gold medals) at an X Games.[20][13]\n\nIn 2025 at the X Games, Kim won her eighth gold medal in the superpipe, which gave her the most wins of any woman in the superpipe at the X Games, and tied her with Shaun White for most wins of any person in the superpipe at the X Games.[21]\n\n2016 Winter Youth Olympics [ edit ]\n\nIn 2016, Kim became the first American woman to win a gold medal in snowboarding at the Winter Youth Olympic Games and earned the highest snowboarding score in Youth Olympic Games history.[5] She was selected as Team USA's flag bearer for the Opening Ceremony of the 2016 Winter Youth Olympic Games, becoming the first snowboarder chosen to serve as flag bearer for Team USA at either the Olympic Winter Games or Youth Olympic Games.[22] Kim was nominated for the 2016 ESPYS award for Best Breakthrough Athlete.[23]\n\n2018 Winter Olympics [ edit ]\n\nAt Kim's first Winter Olympics in Pyeongchang, South Korea, she won the gold medal in the Women's Halfpipe finals with Ricky Bower as her coach.[24] Her first score was 93.75 points, which was 8.5 points ahead of second place. Her last half-pipe score was close to a perfect score at 98.25 points. She was nearly 10 points ahead of Liu Jiayu, who placed second.[25] Kim became the youngest woman to ever land two 1080-degree spins in a row at the Olympics.[26] At age 17, she became the youngest woman to ever win gold at the Olympics in the halfpipe, surpassing the past record holder, Kelly Clark, who had won the gold when she was 19.[27] This record landed Kim a position on Time magazine's annual Time 100 list.[28]\n\n2022 Winter Olympics [ edit ]\n\nKim became a two-time Olympian when she competed at her second consecutive Winter Olympics in Beijing, China. Kim entered the women's halfpipe event. She successfully defended her Olympic title, thus becoming the first female snowboarder to win back-to-back gold medals at the snowboard halfpipe event.[29][30]\n\nAfter qualifying for the final in first place with a score of 87.75, achieved in her first run, Kim won the event with a score of 94.00, also achieved in her first run. She used her additional two runs in the final to attempt a new trick, but in both attempts was unable to stick the landing. As a result, her scores for the second and third runs were low (27.00 and 26.25, respectively) and thus discarded, with the score from her first run counted to secure the Olympic title.\n\nLaax Open [ edit ]\n\nKim has five Laax Open titles. On January 18, 2025 at the Laax Open, Kim became the first woman to land a double cork 1080 in a snowboard halfpipe competition, landing a cab double cork 1080.[31]\n\nIn popular culture [ edit ]\n\nKim was featured on the cover of Sports Illustrated following her Olympic gold medal win.[32][33] Her appearance on a special edition of the Kellogg's Corn Flakes box set a new record for \"fastest-selling cereal box in Kellogg Company history.\"[34]\n\nIn 2018, Mattel began producing a Shero Barbie in her likeness in a new line of dolls highlighting inspiring women (that also includes Amelia Earhart).[35] In February 2019, Kim was featured in Nike's \"Dream Crazier\" ad with Serena Williams, Simone Biles, Ibtihaj Muhammad, Megan Rapinoe, and other women athletes. The ad appeared during the 2019 Oscars.[36]\n\nIn late 2020, Kim competed on season 4 of The Masked Singer as \"Jellyfish\". Kim ultimately made it to the semi-finals of the competition before being unmasked in a triple elimination alongside Taylor Dayne as \"Popcorn\" and Tori Kelly as \"Seahorse\".[37]\n\nIn March 2022, she was added to the game Fortnite as a playable character as part of the game's icon series.[38]\n\nAwards and honors [ edit ]\n\nIn July 2018, Kim won three ESPYs for Best Female Athlete, Best Female Olympian, and Best Female Action Sports Athlete.[39] She won the Best Female Action Sports Athlete ESPY Award three years in a row.[40][41][42]\n\nIn 2018, Kim was also included in Time magazine's list of 100 Most Influential People.[43] Kim was awarded Laureus World Action Sportsperson of the Year two times in a row (2019–2020).[44] In 2025, Kim made it to the Madame Tussauds Hot 100 list, recognizing her as a cultural icon.[45]\n\nPersonal life [ edit ]\n\nKim was admitted to Princeton University in 2018, but deferred the offer of admission until 2019.[46] She struggled with her fame at Princeton for a period of time and decided to return to competitive snowboarding prior to the 2022 Olympics.[47]\n\nFamily [ edit ]\n\nKim is a second-generation Korean-American; her parents, Boran Yoon Kim and Jong Jin Kim, emigrated from South Korea during the country's authoritarian era. Her father first arrived with just $800 in cash and worked minimum-wage jobs, eventually earning a college degree at the El Camino College in manufacturing engineering technology.[48][49] He eventually quit his job to help his daughter pursue her snowboarding career.[48]\n\nKim has extended family living in South Korea, where she competed in the 2018 Winter Olympics. Her relatives, including her grandmother, watched her compete for the first time at the Olympics.[50] Kim stated, \"I have this different opportunity because I'm Korean-American, but I'm riding for the States. ... I'm starting to understand that I can represent both countries.\"[48]\n\nAnti-Asian racism [ edit ]\n\nKim stated that despite being born in the United States and having always represented the country professionally at international events, she receives racist and hateful messages regularly, up to 30 a day, since she was 13 years old.[51] She stated that because she was Asian, people would often belittle her accomplishments, telling her to \"stop taking medals away from the white American girls on the team\", as well as to \"go back to China\".[52][53]\n\nShe has also spoken up about the rise of anti-Asian hate crime and violence in the country since the COVID-19 pandemic, adding that she is constantly worried about her parents' safety.[52] She added that she would always bring along a knife, pepper spray, and tasers whenever she goes outdoors to do her errands as well as avoiding crowded places in general.[53]\n\nFilmography [ edit ]\n\nTelevision [ edit ]\n\nYear Title Role Notes 2018 Double Dare Herself / Contestant Episode: \"Board Bombs vs. Team Over Your Head\" 2018 Ridiculousness Herself Episode: \"Chloe Kim\" 2020 #KidsTogether: The Nickelodeon Town Hall Herself Television special 2020 The Substitute Herself Episode: \"Chloe Kim\" 2020 Scooby-Doo and Guess Who? Herself (voice) Episode: \"Caveman on the Half Pipe\" 2020 The Masked Singer Herself (Jellyfish) Season 4\n\nFilm [ edit ]\n\nYear Title Role Notes 2019 Charlie's Angels Angel Recruit\n\nMusic videos [ edit ]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/5/5d/Flag_of_the_United_States_%2823px%29.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Flag_of_the_Czech_Republic.svg/40px-Flag_of_the_Czech_Republic.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Flag_of_Belgium_%28civil%29.svg/40px-Flag_of_Belgium_%28civil%29.svg.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Flag_of_New_Zealand.svg/40px-Flag_of_New_Zealand.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Flag_of_Switzerland_%28Pantone%29.svg/20px-Flag_of_Switzerland_%28Pantone%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Blue_pencil.svg/20px-Blue_pencil.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Silver_medal_icon_%28S_initial%29.svg/16px-Silver_medal_icon_%28S_initial%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/20px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/03/Flag_of_Italy.svg/40px-Flag_of_Italy.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b9/Flag_of_Australia.svg/40px-Flag_of_Australia.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Flag_of_France.svg/40px-Flag_of_France.svg.png", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Flag_of_Austria.svg/40px-Flag_of_Austria.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Flag_of_the_Netherlands.svg/40px-Flag_of_the_Netherlands.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Canada_%28Pantone%29.svg/40px-Flag_of_Canada_%28Pantone%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Gold_medal_icon_%28G_initial%29.svg/16px-Gold_medal_icon_%28G_initial%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b1/Olympic_Rings.svg/40px-Olympic_Rings.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Sports_icon.png/40px-Sports_icon.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/40px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/8/8c/Chloe_Kim_Seal_V1.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/9e/Flag_of_Japan.svg/40px-Flag_of_Japan.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Bronze_medal_icon_%28B_initial%29.svg/16px-Bronze_medal_icon_%28B_initial%29.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/b/ba/Flag_of_Germany.svg/40px-Flag_of_Germany.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Chloe_Kim_Seal_V1.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Chloe_Kim", "title": "Chloe Kim", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Chloe_Kim_Seal_V1.jpg", "width": 960, "height": 1200}, "title": "Chloe Kim - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}