{"url": "https://en.wikipedia.org/wiki/Maggie_Lawson", "text": "American actress (born 1980)\n\nMaggie Lawson (born August 12, 1980) is an American actress who is best known for her role as Detective Juliet \"Jules\" O'Hara in the television series Psych, and its subsequent film series. From 2018 to 2019, she held the recurring role of Natalie Flynn in the third and final season of Fox's Lethal Weapon.\n\nEarly life, family and education [ edit ]\n\nLawson was born on August 12, 1980, in Louisville, Kentucky and was raised there as well.[4] She began performing onstage at age eight, in local community and dinner theatre productions.[5]\n\nCareer [ edit ]\n\nLawson started her career in community and dinner theater productions. She became a youth TV host on WDRB Fox 41 Kid's Club in Louisville. She relocated to Los Angeles for her first television pilot at 15.[6]\n\nLawson performed in various sitcoms like Cybill, Boy Meets World and Home Improvement throughout her early career in both guest starring and supporting roles. She also made guest appearances on television series such as Smallville and Fear Itself, and co-starred in It's All Relative and Crumbs.\n\nFor The Wonderful World of Disney, Lawson starred in a double role in Model Behavior featuring Justin Timberlake. She portrayed Nancy Drew in the 2002 film Nancy Drew. Other film credits include Pleasantville, Nice Guys Sleep Alone and Cleaner.\n\nFrom 2006 to 2014, Lawson co-starred in the USA Network original series Psych, as Detective Juliet \"Jules\" O'Hara. She reprised her role in 2017 in Psych: The Movie, in Psych 2: Lassie Come Home in 2020 and Psych 3: This Is Gus, in 2021.[7]\n\nIn 2011, Lawson briefly returned to her roots in theater to star in the play Greedy, directed by her then-partner and Psych co-star James Roday. It ran for a few weekends in Los Angeles.\n\nFollowing Psych, she scored leading roles in ABC's 2013 sitcom Back in the Game, CBS's 2014 sitcom pilot Save the Date and CBS's 2016 fantasy sitcom Angel from Hell. She also had short arcs on Two and a Half Men, The Great Indoors, and Netflix's The Ranch. Also for Netflix, Lawson starred in the recurring role of Christa on the second and third seasons of horror-comedy series Santa Clarita Diet as well as the movie Spivak in 2018.\n\nFor Hallmark Channel, Lawson has starred in My Favorite Wedding and Christmas Encore in 2017, The Story of Us and Christmas in Evergreen: Tidings of Joy in 2019.\n\nLawson starred in a recurring role as Dr. Natalie Flynn on the third season of Lethal Weapon and was featured in Treehouse, the sixth episode of Hulu's monthly horror movie anthology Into The Dark.\n\nIn 2020, she played Kay, the female lead opposite Jason Biggs, in the FOX comedy series Outmatched, \"about a blue-collar couple [...] in South Jersey trying to get by and raise four kids, three of whom just happen to be certified geniuses.\"[8]\n\nIn 2025, Lawson joined the main cast of Blue Bloods spinoff Boston Blue, in the role of Sarah Silver, half-sister of lead detective Lena Silver.[9]\n\nPersonal life [ edit ]\n\nThroughout the series run of Psych (2006–2014), Lawson was in a relationship with series lead James Roday Rodriguez.[10][11]\n\nOn November 14, 2014, Lawson became engaged to Back in the Game co-star Ben Koldyke[12] and married him on August 8, 2015, on his family's ranch in New Mexico. In early 2017, Lawson filed for divorce from Koldyke.[13]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Maggie_Lawson_by_Gage_Skidmore.jpg/250px-Maggie_Lawson_by_Gage_Skidmore.jpg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Wiki_letter_w_cropped.svg/20px-Wiki_letter_w_cropped.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Maggie_Lawson_by_Gage_Skidmore.jpg/979px-Maggie_Lawson_by_Gage_Skidmore.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Maggie_Lawson_by_Gage_Skidmore.jpg/979px-Maggie_Lawson_by_Gage_Skidmore.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Maggie_Lawson", "title": "Maggie Lawson", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Maggie_Lawson_by_Gage_Skidmore.jpg/979px-Maggie_Lawson_by_Gage_Skidmore.jpg", "width": 979, "height": 1200}, "title": "Maggie Lawson - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}