{"url": "https://en.wikipedia.org/wiki/Me_Enamor%C3%A9_(Shakira_song)", "text": "2017 single by Shakira\n\n\"Me Enamoré\" (English: \"I Fell in Love\") is a song by Colombian singer-songwriter Shakira. The song was released as the second single to anticipate Shakira's eleventh studio album El Dorado on 7 April 2017, by Sony Music Latin. Its lyrics were written by Shakira.[2] Its musical composition was done by Shakira and Rayito, who also produced the song along the co-production of The Rudeboyz and A.C.[3][4][5][6][7]\n\nArtwork and release [ edit ]\n\nOn April 6, 2017, Shakira teased the song by sending personalized postcards to fans around the world revealing the cover artwork for the single, where she appears hugging a tree. She wrote in the card: \"[I'm] very happy to share with all of you my new single 'Me Enamoré.' This song narrates a moment in my life when I was so in love that I was literally climbing trees\".[7][8][9] The same day she tweeted teasing \"tomorrow more.\"[10] The original photo used for the cover art is a nonprofessional snapshot taken in 2010, when Shakira first met her then-partner Gerard Piqué.[11]\n\nReactions to cover art [ edit ]\n\nThe cover art's reception was negative, with memes being shared on social media and being parodied by users online. Miguel Ángel Bargueño of El País asked: \"Has Shakira made the worst [single] cover art in history?\".[11] Spanish illustrator and art director Sergio Mora, who won the Latin Grammy Award for Best Recording Package in 2016 for the album artwork for El Poeta Halley by the band Love of Lesbian, stated: \"It is so hideous that it turns around and borders on genius.\"[11] Album cover art designer Rafa Sañudo said: \"It's tacky as hell.\"[11] Mario Feal noted: \"Precisely the opposite of the overproduced image expected of an international star\".[11] Domingo J. Casas pointed out: \"As a photo it’s ugly. As a family snapshot, it has value.\"[11]\n\nComposition [ edit ]\n\n\"Me Enamoré\" tells the story of when she fell in love with her former partner Gerard Piqué, whom she met in 2010 on the set of the music video for \"Waka Waka (This Time for Africa)\", the official song of the 2010 FIFA World Cup.[5]\n\nMusic video [ edit ]\n\nThe \"Me Enamoré\" official lyric video was released via Shakira's Vevo the day of the release of the song. Directed by James Zwadlo, it features the Spanish-language words along watercolor painted images, presumably for the non-Spanish speaking people to understand the song.[6]\n\nThe music video was directed by Jaume de la Iguana and shot in Barcelona and was released on 12 May 2017. Its cinematography was handled by Nono Arruga.[12]\n\nThe music video for the song garnered media attention due to the appearance of her former partner Gerard Piqué and became her twenty-first Vevo Certified video (collaborations included).[13][14]\n\nChart performance [ edit ]\n\nIn France, \"Me Enamoré\" debuted at number 72 on 14 April 2017, reaching number 41 after the release of its music video and eventually peaking at number 13 after the release of El Dorado.[15] In the United States, the song debuted at number 100 on the Billboard Hot 100, where later peaked at number 83, and at number 11 on the Hot Latin Songs chart, where it reached number five following the release of the music video and peaked at number four after the release of the album. \"Me Enamoré\" peaked at number three in Spain,[16] and has been certified three times Platinum for exceeding sales of 120,000 copies in the country.\n\nAccolades [ edit ]\n\nYear Ceremony Award Result 2017 Los 40 Music Awards Los 40 Global Show Award Nominated Your World Awards Party-Starter Song Nominated 2018 Billboard Latin Music Awards Latin Pop Song of the Year Nominated\n\nLive performances [ edit ]\n\nShakira performed live \"Me Enamoré\" for the first time at Univision's Upfront on 16 May 2017. Then, she performed the song ten days later at her El Dorado Album Release Party at The Temple House in Miami on 26 May 2017. She also performed the song at the El Dorado Album Launch in Barcelona on 8 June 2017. She performed the song on the sixth season finale of The Voice: la plus belle voix in June 2017 in Paris. She also performed with Coldplay's lead vocalist Chris Martin at Global Citizen Festival Hamburg on 6 July 2017.\n\nCredits and personnel [ edit ]\n\nCredits adapted from Tidal and Qobuz.[17][3]\n\nShakira – vocals, composer, producer\n\nAntonio Rayo Gibo – composer, producer\n\nA.C. – co-producer\n\nKevin ADG (The Rudeboyz) – co-producer\n\nChan el Genio (The Rudeboyz) – producer\n\nDave Clauss – mixing engineer, recording engineer\n\nAdam Ayan – mastering engineer\n\nCarlos Hernández Carbonell – recording engineer\n\nCharts [ edit ]\n\nCertifications [ edit ]\n\nRelease history [ edit ]", "images": ["https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/en/8/80/Shakira_Me_Enamor%C3%A9_Coverart.jpg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/80/Shakira_Me_Enamor%C3%A9_Coverart.jpg/250px-Shakira_Me_Enamor%C3%A9_Coverart.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/20px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/People_icon.svg/20px-People_icon.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Symbol_template_class_pink.svg/20px-Symbol_template_class_pink.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/8/80/Shakira_Me_Enamor%C3%A9_Coverart.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Me_Enamor%C3%A9_(Shakira_song)", "title": "Me Enamoré (Shakira song)", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/8/80/Shakira_Me_Enamor%C3%A9_Coverart.jpg", "width": 1200, "height": 1200}, "title": "Me Enamoré (Shakira song) - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}