{"url": "www.mirror.co.uk/news/uk-news/meghan-markle-words-what-duchess-13021814", "text": "Meghan Markle in her own words - what the Duchess thinks about love, work and happiness\n\nThese quotes from Meghan Markle throughout her career show that she was born to be a princess\n\nView 6 Images The public love Meghan for her style and grace (Image: Getty)\n\nLooking back at things Meghan Markle has said and done in her life so far, it seems that she was always destined for royalty.\n\n‌\n\n\n\nShe's always showed thoughtfulness, grace and intelligence - from campaigning against a sexist ad when she was just 11 years old to the humanitarian work she's been passionate about long before she married Prince Harry.\n\n‌\n\n\n\nThere's so much talk about the Duchess of Sussex every day, but what has she actually said about herself?\n\n‌\n\n\n\nAs she celebrates her 37th birthday this weekend, here's what Meghan has said on some of the most important things in her life - in her own words.\n\nView 6 Images Wise words from Meghan\n\nOn happiness and self-acceptance\n\nOn her 33rd birthday Meghan wrote on her website The Tig about the ways she struggled with the idea of fitting in - before she realised it's important to be kind and accept yourself as you are.\n\n‌\n\n\n\n\"I am 33 years old today. And I am happy. And I say that so plainly because, well…it takes time. To be happy. To figure out how to be kind to yourself. To not just choose that happiness, but to feel it.\n\n\"My 20s were brutal – a constant battle with myself, judging my weight, my style, my desire to be as cool/as hip/as smart/as \"whatever\" as everyone else. My teens were even worse – grappling with how to fit in, and what that even meant.\n\nView 6 Images Happy birthday Meghan! (Image: Getty Images Europe)\n\n‌\n\n\n\n\" You need to know that you’re enough [is a] mantra that has now engrained itself so deeply within me that not a day goes by without hearing it chime in my head.\n\n\"So for my birthday, here’s what I would like as a gift: I want you to be kind to yourself.\"\n\n‌\n\n\n\nOn her relationship with Harry\n\nIn an interview with Vanity Fair in 2016, Meghan spoke about her blossoming relationship with Prince Harry.\n\nShe said: \"We’re a couple... We’re in love.\n\n\"I’m sure there will be a time when we will have to come forward and present ourselves and have stories to tell, but I hope what people will understand is that this is our time. This is for us. It’s part of what makes it so special, that it’s just ours. But we’re happy. Personally, I love a great love story.\"\n\n‌\n\n\n\nOn the proposal\n\nView 6 Images The pair got married earlier this year (Image: Getty)\n\nIn Meghan and Harry's first interview post-engagement, she told the BBC about how the proposal happened.\n\n‌\n\n\n\n\"Just a cosy night. What were we doing? We were trying to roast a chicken. It was just an amazing surprise. It was so sweet and natural and very romantic. He got down on one knee. . . As a matter of fact, I could barely let [him] finish proposing, like, 'Can I say yes now?!'\"\n\nOn feminism\n\nIn her speech at the UN in 2015, Meghan told the story of her 11-year-old self who was angry at a sexist TV ad - and how she felt compelled to do something about it:\n\n\"I had been in school watching a TV show in elementary school and this commercial came on with the tag line for this dish washing liquid and the tag line said, ‘Women all over America are fighting greasy pots and pans’.\n\n‌\n\n\n\n\"Two boys from my class said, ‘Yeah, that’s where women belong, in the kitchen’.\n\n\"I remember feeling shocked and angry and also just feeling so hurt; it just wasn't right, and something needed to be done. So I went home and told my dad what had happened, and he encouraged me to write letters, so I did, to the most powerful people I could think of.\"\n\n\"It is said that girls with dreams become women with vision. May we empower each other to carry out such vision — because it isn't enough to simply talk about equality. One must believe it. And it isn't enough to simply believe in it. One must work at it. Let us work at it. Together.\"\n\n‌\n\n\n\nOn her humanitarian work\n\nView 6 Images Meghan visited Rwanda as part of her outreach work (Image: PA)\n\n‌\n\n\n\nIn 2016, Meghan wrote on The Tig about how she feels she can't not do humanitarian work - particularly with the responsibility of someone in the entertainment industry who is looked up to.\n\n\"I’ve never wanted to be a lady who lunches – I’ve always wanted to be a woman who works. And this type of work is what feeds my soul, and fuels my purpose.\"\n\nArticle continues below\n\nOn the Queen\n\nView 6 Images It seems as if they get on like a house on fire (Image: Getty Images Europe)\n\nIn the royal couple's engagement interview on the BBC in November 2017, Meghan spoke about how she has the utmost respect for Harry's grandmother.\n\n\"To be able to meet her through his lens, not just with his honor and respect for her as the monarch, but the love that he has for her as his grandmother… all of those layers have been so important for me so that when I met her, I had such a deep understanding and of course incredible respect for being able to have that time with her … She's an incredible woman.\"", "images": ["http://www.mirror.co.uk/footer/trust-project.svg", "https://i2-prod.mirror.co.uk/article12567040.ece/ALTERNATES/s615b/xMAIN-Prince-Harry-Marries-Ms-Meghan-Markle-Procession.jpg", "https://i2-prod.mirror.co.uk/article12489805.ece/ALTERNATES/s810/MAIN-Prince-Harry-visit-to-Cardiff-Castle11.jpg", "https://i2-prod.mirror.co.uk/article12704731.ece/ALTERNATES/s615b/The-Duchess-Of-Sussex-Undertakes-Her-First-Official-Engagement-With-Queen-Elizabeth-II.jpg", "https://i2-prod.mirror.co.uk/article11619786.ece/ALTERNATES/s615b/Prince-Harry-Meghan-Markle-Visit-Nottingham.jpg", "https://i2-prod.mirror.co.uk/article12707136.ece/ALTERNATES/s615/2_The-Duchess-Of-Sussex-Undertakes-Her-First-Official-Engagement-With-Queen-Elizabeth-II.jpg", "https://i2-prod.mirror.co.uk/article11975385.ece/ALTERNATES/s615b/1_Prince-Harry-engagement.jpg", "https://i2-prod.mirror.co.uk/article13701121.ece/ALTERNATES/s810/0_THP_CHP_071218SLUG_0158JPG.jpg", "http://www.mirror.co.uk/nav-web-static/release-v41-14493b7c888038a7d89b99cb3a7937c2b71eaebe/public/logo-reach.png", "https://i2-prod.mirror.co.uk/article12769318.ece/ALTERNATES/s810/MAIN-Why-Meghan-always-wears-shoes.jpg", "https://i2-prod.mirror.co.uk/article12707136.ece/ALTERNATES/s1200/2_The-Duchess-Of-Sussex-Undertakes-Her-First-Official-Engagement-With-Queen-Elizabeth-II.jpg", "https://i2-prod.mirror.co.uk/article13740607.ece/ALTERNATES/s810/0_MAIN-Prince-Harry-Meghan-Markle.jpg", "http://www.mirror.co.uk/footer/ipso.svg", "http://www.mirror.co.uk/assets/mirror/logos/masthead-mirror-default.svg", "https://i2-prod.mirror.co.uk/article13019990.ece/ALTERNATES/s615b/0_Meghan-Markle-Insta-6.png"], "top_img": "https://i2-prod.mirror.co.uk/article12707136.ece/ALTERNATES/s1200/2_The-Duchess-Of-Sussex-Undertakes-Her-First-Official-Engagement-With-Queen-Elizabeth-II.jpg", "keywords": [], "authors": ["Robyn Darbyshire", "Updated"], "canonical_link": "https://www.mirror.co.uk/news/uk-news/meghan-markle-words-what-duchess-13021814", "title": "what the Duchess thinks about love, work and happiness", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"page_id": 6149699161, "app_id": 123792601022133, "pages": 1814357575554395}, "description": "These quotes from Meghan Markle throughout her career show that she was born to be a princess", "author": "Robyn Darbyshire", "robots": "noarchive, max-image-preview:large", "Googlebot-News": "noarchive", "referrer": "unsafe-URL", "keywords": "Meghan Markle, Prince Harry, Royal Family", "news_keywords": "Meghan Markle, Prince Harry, Royal Family", "allowTaboolaDeepDive": "true", "vf": {"00000000-0000-4000-8000-67e599051dc3": "mirror-prod-13021814"}, "og": {"title": "Meghan Markle in her own words - what she thinks about love, work and happiness", "description": "These quotes from Meghan Markle throughout her career show that she was born to be a princess", "url": "https://www.mirror.co.uk/news/uk-news/meghan-markle-words-what-duchess-13021814", "site_name": "Daily Mirror", "locale": "en_GB", "image": "https://i2-prod.mirror.co.uk/article12707136.ece/ALTERNATES/s1200/2_The-Duchess-Of-Sussex-Undertakes-Her-First-Official-Engagement-With-Queen-Elizabeth-II.jpg", "type": "article"}, "article": {"published_time": "2018-08-03T11:55:44Z", "modified_time": "2018-08-04T14:22:39Z", "author": "https://www.mirror.co.uk/authors/robyn-darbyshire/", "section": "UK News", "tag": "Royal Family"}, "twitter": {"card": "summary_large_image", "site": "@DailyMirror", "creator": "@DailyMirror", "title": "Meghan Markle in her own words - what the Duchess thinks about love, work and happiness - The Mirror", "description": "These quotes from Meghan Markle throughout her career show that she was born to be a princess", "image": "https://i2-prod.mirror.co.uk/article12707136.ece/ALTERNATES/s1200/2_The-Duchess-Of-Sussex-Undertakes-Her-First-Official-Engagement-With-Queen-Elizabeth-II.jpg"}}, "movies": [], "publish_date": 1533297344.0, "source": "http://www.mirror.co.uk", "summary": ""}