{"url": "http://www.chicagotribune.com/entertainment/music/ct-rock-roll-hall-of-fame-20180414-story.html", "text": "Bon Jovi reunited onstage with former members for a powerful performance celebrating its admission into the Rock & Roll Hall of Fame, and the late icon Nina Simone was welcomed to the prestigious music club with show-stopping performances from Lauryn Hill and Andra Day.\n\nJon Bon Jovi, Sambora and Such were joined by current bandmates David Bryan, Tico Torres and Hugh McDonald at the Public Auditorium in Cleveland, where the Rock Hall is based.\n\nThey performed crowd favorites like “You Give Love a Bad Name” and “It’s My Life.”\n\nSambora left Bon Jovi in 2013 and Such in 1994. Each of the members spoke onstage, giving thanks for the honor and telling old stories about the New Jersey band. They all hugged as a group afterward.\n\nJon Bon Jovi, who gave a 20-minute speech onstage, said he has been writing his Rock Hall speech for years.\n\n“Some days I write the ‘Thank you’ speech, sometimes I write the ‘(Expletive) you’ speech,” he said. “In the end, it’s all about time. It took a lot of people to get us here tonight.”\n\nThey were inducted by Howard Stern, who provided many laughs at the event. He even sang some of “Wanted Dead or Alive,” getting the audience to join in.\n\nStern joked about Rock Hall co-founder Jann Wenner, questioning why he was qualified to vote on who enters the prominent organization. Stern said Wenner, who founded Rolling Stone magazine, doesn’t play any instruments “but he did start a great magazine … and now it’s the size of a pamphlet.”\n\nStern also thanked Bon Jovi for its music, which he is a big fan of, and stressed how big of a deal it is that the band has sold more than 130 million albums.\n\nThe 33rd annual Rock Hall four-hour plus ceremony kicked off with a tribute to Tom Petty, who died in October at age 66. The Killers earned a loud applause from the audience when they started performing “American Girl,” then transitioning to “Free Fallin’.”\n\n“Pay some rock ‘n’ roll respect … to the eternal Tom Petty,” frontman Brandon Flowers said, as photos of Petty were displayed in the background.\n\nLater in the event, Ann Wilson of Heart and Jerry Cantrell honored Chris Cornell with a commanding rendition Soundgarden’s “Black Hole Sun.” Cornell hanged himself in a Detroit hotel hours after a Soundgarden concert there last May.\n\nJustin Hayward, Graeme Edge, John Lodge, members of the Moody Blues, answer questions before the Rock and Roll Hall of Fame induction ceremony, Saturday, April 14, 2018, in Cleveland.\n\nThe Cars and four first-time nominees, including Nina Simone, Dire Straits, The Moody Blues and Sister Rosetta Tharpe, make up the 2018 Rock & Roll Hall of Fame class.\n\nSimone received a passionate and show-stopping tribute from groundbreaking performers who she has deeply inspired, from Lauryn Hill to Mary J. Blige.\n\nHill was exceptional, stretching her voice as wide as possible, and singing in French, in honor of Simone’s music. Hill earned a standing ovation from the audience.\n\nGrammy-nominated R&B singer Andra Day was also extraordinary, hitting high notes that also earned her applause. Blige inducted Simone, calling the singer “bold, strong, feisty and fearless.”\n\n“Her voice was so distinctive and powerful and I never heard anything like it,” the R&B superstar said.\n\nSimone, who died in 2003, was a leader in pushing for civil rights and influenced everyone from Aretha Franklin to Alicia Keys. Her brother, Sam Waymon, accepted the induction on his sister’s behalf.\n\n“They said I had three minutes, I said, ‘No, I don’t.’ I’m going to take the time necessary to say what I got to say,” Waymon said.\n\nWaymon said sharp words during his speech, including lines like, “To all the brothers out there, protect your sisters. He said he always protected Simone, and continues to do so.\n\nHe also told the crowd, “If you’re sampling (Nina’s) music, you better pay for it!”\n\nRock Hall voters have recently opened their hearts to progressive rockers, which benefited “Nights in White Satin” singers The Moody Blues, the last act to be inducted Saturday.\n\nWilson of Heart said the English rockers “are and have always been a kick ass rock band.”\n\nAnother English band, Dire Straits, was inducted at the event, but it was without its leader Mark Knopfler, or his brother David Knopfler. In an interview ahead of the event, co-founding member and bassist John Illsley said Mark “just didn’t feel like coming, it’s as simple as that.”\n\nOnstage, Illsley said of Mark’s absence: “I’ll assure you it’s a personal thing. Let’s just leave it at that.”\n\nIllsley thanked the entire band and described the group as “a collective, a brotherhood.” There was no performance following the band members’ speeches.\n\nA flawless Brittany Howard, of the critically acclaimed rock act Alabama Shakes, gave an extraordinary Tharpe impression onstage, winning over the audience with her rousing live performance in honor of the godmother of rock ‘n’ roll. Howard was backed by an equally appealing Questlove of The Roots on the drums. Felicia Collins, best known has a member of the band on “Late Show with David Letterman,” also wowed the audience when she performed a tribute to Tharpe.\n\n“It’s been long overdue. I’m honored to induct Sister Rosetta Tharpe into the Rock & Roll Hall of Fame,” Howard yelled following a video package featuring past interviews from Johnny Cash, Aretha Franklin and others praising Tharpe’s musicality.\n\nTharpe died in 1973 and was a pioneering guitarist who performed gospel music. She earned the “Award for Early Influence” on Saturday, while the other five acts were inducted as performers.\n\nFlowers of the Killers, who has covered The Cars’ songs at his live shows, was ecstatic and energetic as he inducted the band into the Rock Hall, even getting on his knee to hand the members their award as they walked onstage.\n\nInductee Ric Ocasek of The Cars speaks during the Rock and Roll Hall of Fame induction ceremony, Saturday, April 14, 2018, in Cleveland.\n\nThe Cars, founded in Boston in 1976 and known for combining New Wave and classic rock sounds, were inducted this year after being nominated twice before. Ric Ocasek paid tribute to bandmate Benjamin Orr, who died in 2000.\n\n“It’s quite strange to be here without him,” Ocasek said.\n\nElliot Easton also was emotional at the end of his speech when he thanked his mom, who he said was watching from above.\n\n“We did it mom!,” he said, earning cheers from the audience.\n\nOcasek also earned applause when he namedropped Cleveland: “I lived in Cleveland for a while. It was actually the first place I played music in front of people.”\n\nThe 2018 Rock & Roll Hall of Fame induction ceremony will air May 5 on HBO and will also be heard on SiriusXM Radio.\n\n.galleries:after {\n\ncontent: ”;\n\ndisplay: block;\n\nbackground-color: #144A7C;\n\nmargin: 16px auto 0;\n\nheight: 5px;\n\nwidth: 100px;\n\n}\n\n.galleries:before {\n\ncontent: “Entertainment Photos and Video”;\n\ndisplay: block;\n\nfont: 700 20px Georgia,serif;\n\ntext-align: center;\n\ncolor: #1e1e1e;\n\nvar playlist = ‘chi_ent_movie_trailers’,\n\nlayout = ‘autoblurb’,\n\niu = ‘%2F4011%2Ftrb.chicagotribune%2Fent’;\n\nWatch the latest movie trailers.", "images": ["https://www.chicagotribune.com/wp-content/uploads/2023/12/2560px-Chicago_Tribune_Logo.svg-1.png", "data:image/webp;base64,UklGRiQAAABXRUJQVlA4IBgAAAAwAQCdASoBAAEAAwA0JaQAA3AA/v3AgAA=", "https://www.chicagotribune.com/wp-content/uploads/migration/2018/04/15/2M5VNZTFGZFHPHID34WVXAOYMI.jpg?w=1024&h=670"], "top_img": "https://www.chicagotribune.com/wp-content/uploads/migration/2018/04/15/2M5VNZTFGZFHPHID34WVXAOYMI.jpg?w=1024&h=670", "keywords": [], "authors": ["Associated Press"], "canonical_link": "https://www.chicagotribune.com/2018/04/15/bon-jovi-reunites-as-band-enters-rock-hall-of-fame-alongside-cars-nina-simone-dire-straits-moody-blues/", "title": "Bon Jovi reunites as band enters Rock Hall of Fame — alongside Cars, Nina Simone, Dire Straits, Moody Blues", "meta_data": {"application-name": "chicagotribune", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "robots": "max-image-preview:large", "tdm-reservation": 1, "mrf": {"authors": "Associated Press", "canonical": "https://www.chicagotribune.com/2018/04/15/bon-jovi-reunites-as-band-enters-rock-hall-of-fame-alongside-cars-nina-simone-dire-straits-moody-blues/"}, "description": "Bon Jovi reunited onstage with former members for a powerful performance celebrating its admission into the Rock & Roll Hall of Fame, and the late icon Nina Simone was welcomed to the prestigious music club with show-stopping performances from Lauryn Hill and Andra Day. Jon Bon Jovi, Sambora and Such were joined by current bandmates […]", "generator": "WordPress 6.8.3", "og": {"type": "article", "title": "Bon Jovi reunites as band enters Rock Hall of Fame — alongside Cars, Nina Simone, Dire Straits, Moody Blues", "url": "https://www.chicagotribune.com/2018/04/15/bon-jovi-reunites-as-band-enters-rock-hall-of-fame-alongside-cars-nina-simone-dire-straits-moody-blues/", "description": "Bon Jovi reunited onstage with former members for a powerful performance celebrating its admission into the Rock & Roll Hall of Fame, and the late icon Nina Simone was welcomed to the prestigi…", "site_name": "Chicago Tribune", "image": {"identifier": "https://www.chicagotribune.com/wp-content/uploads/migration/2018/04/15/2M5VNZTFGZFHPHID34WVXAOYMI.jpg?w=1024&h=670", "width": 1024, "height": 670}, "locale": "en_US"}, "article": {"published_time": "2018-04-15T00:04:00+00:00", "modified_time": "2019-08-22T08:31:31+00:00"}, "twitter": {"text": {"title": "Bon Jovi reunites as band enters Rock Hall of Fame — alongside Cars, Nina Simone, Dire Straits, Moody Blues"}, "image": "https://www.chicagotribune.com/wp-content/uploads/migration/2018/04/15/2M5VNZTFGZFHPHID34WVXAOYMI.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.chicagotribune.com/wp-content/uploads/2024/02/favicon.png?w=16"}, "movies": [], "publish_date": 1523678400.0, "source": "http://www.chicagotribune.com", "summary": ""}