{"url": "http://www.popularmechanics.com/space/satellites/a1782/4218443/", "text": "On July 9, 1962, the night sky above the Pacific Ocean, from Hawaii to New Zealand, suddenly became illuminated by brilliant light, as if it were the middle of the day. A stunning artificial aurora appeared, creating a glow of green, yellow, and red, which lingered for less than an hour. Then came the blackouts. The streets of Hawaii became unlit, telephone service was disrupted, burglar alarms went off. What looked like a beautiful light show from Earth was the result of the biggest nuclear bomb ever detonated in space.\n\nFrom a tiny island in the middle of the North Pacific Ocean, the U.S. had launched a 1.4-​megaton nuclear warhead, a weapon test and a display of power during a particularly tense period of the Cold War. The experiment, dubbed Starfish Prime, generated an electromagnetic pulse, releasing a massive burst of energy 250 miles above the ground, which fried about one third of all active satellites at that point and turned out to be more destructive than anyone expected.\n\nAlamy The night sky above Honolulu becomes illuminated by the 1962 Starfish Prime test.\n\nThen, on October 22 of the same year, the U.S.S.R. conducted its own high-altitude experiments, including the Project K nuclear tests. The Soviets launched and detonated a 300-kiloton warhead some 180 miles above central Kazakhstan. The smaller yet lower and therefore more destructive blast also affected infrastructure on the ground, frying overhead telephone lines and causing the fuses to blow on their overvoltage protectors, shutting off underground power cables and knocking out a power plant. Nukes in the sky don’t stay only in the sky: With their electromagnetic radiation, they’re a threat to any technology or device that can carry a charge, and they can destroy satellites, immediately disrupting key functions that those spacecraft provide.\n\nFrom these tests, the world learned the danger of a nuclear weapon exploding in space; but today, the risks are far greater. That’s why on February 14, 2024, lawmakers were startled when Ohio congressman Mike Turner warned of a “serious national security threat.” The House Intelligence Committee chief offered no details, perhaps because key information remained classified, though the statement was quickly linked to the possibility of a Russian nuclear space weapon. Speculation immediately swirled. It was like a terrifying Mad Libs, as experts imagined ways to combine “Russia,” “space,” and “nuclear.” Was it an actual nuke or just nuclear-​powered? Was it an orbiting bomb or an antisatellite missile? Was it a worrisome weapons program being advanced, was it just bluster, or was it a cynical ploy to boost calls for more U.S. military aid to Ukraine?\n\nThe following day, officials said little, likely because intelligence was still being collected. “It is not an active capability and it has not yet been deployed,” said National Security Communications Advisor John Kirby at a White House briefing. Few experts offered much insight. “There’s not a lot of information out there,” said Victoria Samson, a space policy expert at the Secure World Foundation in Broomfield, Colorado, a nongovernmental organization that supports peaceful uses of space and promotes space diplomacy. However, based on information available to her, Russia’s space military appears to be engaged in research and development on some sort of nuclear-armed space weapon that could be deployed and used in orbit.\n\nDays later, Russian President Vladimir Putin denied claims that the country is developing a nuclear capability for space. But during a House Armed Services Committee hearing on May 1, a Pentagon official dismissed his denial, citing a Russian veto of a United Nations resolution from April that would have reinforced the ban on nukes in space by the Outer Space Treaty from 1967. Russia’s government hasn’t shied away from nuclear threats—at least not on the ground—and Russia, like the U.S., maintains a vast nuclear arsenal on hair-trigger alert and hasn’t ruled out a first-use policy.\n\nRussia’s potential space nuke—or whatever it is—is just the latest military technology countries have been developing that could be used to trick, damage, or destroy rivals’ spacecraft. And Russia is not the only potential threat: The Pentagon is closely watching China’s nuclear ambitions, as its arsenal is on its way toward rivaling those of the U.S. and Russia. Nearly 70 years after the first space race began, we’re in the midst of a new, more complex one, where security concerns and goals are paramount, often trumping science and exploration. After all, the Space Force’s budget has already surpassed NASA’s, and China and Russia also spend enormous sums annually on their space militaries. As tensions intensify between these big three powers, we could be advancing toward a new arms race, in space.\n\nAre There Laws in Space?\n\nAt first, the hazardous tests and risky brinkmanship of 1962 spurred a temporary and rare period of enthusiastic diplomacy, with international negotiators hammering out new accords, including the Partial Test Ban Treaty of 1963 and the Outer Space Treaty of 1967, which remain the only widely recognized pieces of space law ever developed. They make peaceful uses of outer space a priority, and while the Outer Space Treaty includes few specifics, it explicitly forbids the deployment of weapons of mass destruction in space. That means tests like Starfish Prime and Project K would be considered violations of international law. If Russia is working on a nuke—as Samson and her colleagues speculate— and if the country launches the warhead into orbit, that would be considered illegal as well, regardless of whether it detonates and lets loose an explosive pulse.\n\nYet space-faring powers, including Russia, can and do test other dangerous weapons that are perfectly legal. On the morning of November 15, 2021, Samson and her colleagues were startled by social media reports of an orbiting cloud of debris, looking like the remnants of a satellite destroyed by a missile. They waited to respond until they could find more credible information or statements from the U.S. Space Command or the Russian Space Agency. Later that day, it was confirmed: Russia had launched an antisatellite missile from a remote northern Russian spaceport that ascended nearly 300 miles into the sky and blasted its derelict two-ton military satellite, Cosmos 1408, into smithereens. Where that object once orbited, an expanding shrapnel field was left, careening at some 17,000 miles per hour, threatening everything in its path. The trajectory took the fragments dangerously close to the International Space Station, forcing the four NASA crew members, two Russian cosmonauts, and a European Space Agency astronaut to don their spacesuits and take shelter in their docked spacecraft, in case a disastrous collision forced them to abandon the outpost, like Sandra Bullock narrowly escaping the station in the movie Gravity, as it’s hit by debris from a blown-up Russian satellite. The real-world explosion took place in a busy lane in low Earth orbit, and although the Russian Defense Ministry claimed the fragments posed no threat to space activity, some debris flew near the Chinese space station and other spacecraft as well.\n\nKIRILL KUDRYAVTSEV The Russian Soyuz-2.1b rocket launches with a Meteor-M 2-1 weather satellite and other equipment onboard in 2017.\n\n\n\n\n\nU.S. government officials deemed Russia’s test “irresponsible” and “reckless.” To many, it served as a warning, a couple of months before Russia’s military forces invaded Ukraine, reminding its rivals what it’s willing and able to do. Not that the demonstration was necessary—Russia had previously conducted antisatellite weapons tests successfully, as have the U.S., China, and India, and thousands of chunks of hazardous space junk from those tests remain in orbit today, too.\n\nThe antisatellite weapons tests are clearly not just tests, and they look like swaggering displays of power that threaten astronauts and crucial space activities.\n\n\n\nScience Vs. Espionage\n\nWe frequently associate space with exploration and scientific discovery, not military objectives. But since the early 1950s, after the launch of Sputnik and its successors, space has had military undertones, says Bleddyn Bowen, PhD, a Durham University researcher and author of the book Original Sin, which examines geopolitics and the military and economic control of space. “The boundaries [between civil and military space] have been blurred,” he says. There’s a long history of research on space-based weapons, with the U.S. and U.S.S.R. exploring such tech as far back as the 1940s, says Bruce McClintock, a former defense attaché at the U.S. Embassy in Moscow and head of the Space Enterprise Initiative of the RAND Corporation. U.S. political leaders, from President Ronald Reagan through his Star Wars program in the ’80s to Senator Ted Cruz today, have sought to invest in the research and development of space-based weapons, albeit of the non-nuclear variety.\n\nPresident John F. Kennedy’s famous 1962 speech, in which he advocated for NASA’s Apollo Program, is another example of the role of military and geopolitical concerns in space. In those remarks, Kennedy cited “space science,” but he also argued that U.S. spacecraft were “more sophisticated” and “supplied far more knowledge” than their Soviet counterparts, and he unequivocally stated, “No nation which expects to be the leader of other nations can expect to stay behind in the race for space.”\n\nKevin Carter A SpaceX Falcon 9 rocket with a payload of 20 Starlink internet satellites on June 18, 2024, as seen from San Diego.\n\nContrary to Kennedy’s claims, at the beginning of that first space race, the two global powers advanced at a similar speed, though the U.S.S.R. achieved some milestones before the U.S., including lofting the first satellite into orbit in 1957, the first crewed space mission in 1961, the first space walk in 1965, and the first (uncrewed) lander on the moon in 1966, among other feats. But, of course, in 1969, the U.S. became the first to achieve the most momentous task: safely landing humans on the moon.\n\nBy the 1980s, the U.S. had gained supremacy in space, but in terms of military space capabilities, Russia is now close behind, and China has quickly caught up. The big three all have anti­satellite missiles, electronic weapons, laser weapons, and the ability to maneuver a spacecraft toward a target, Samson says. China now operates more satellites than Russia, though the bulk of orbiting craft remains under U.S. control, which is both a strength and a weakness, providing adversaries with many potential targets.\n\nNearly 70 years after the first space race began, we're in the midst of a new, more complex one, where security concerns and goals are paramount, often trumping science and exploration.\n\nOther military space technologies abound. The Space Force has begun investing in its own satellite armadas, shifting from a handful of billion-​ dollar craft to large collections of cheaper, smaller, and less vulnerable satellites. The U.S. and China have both been testing military spaceplanes, which resemble miniature autonomous space shuttles, apparently to launch satellites and experiment with new technologies as they’re exposed to microgravity and space radiation. Both countries have been advancing their hypersonic and ballistic missile programs, many of which go through space during their trajectories.\n\nRussia, China, and the U.S. aren’t the only nations growing their military capabilities in space. At the Secure World Foundation, Samson plays a leading role in preparing its annual report on global space military capabilities and space security. In the SWF’s most recent assessment, published in April 2024, she and her fellow analysts kept an eye on the military space capabilities of 11 countries, including the big three, as well as India, Australia, Japan, France, Iran, the U.K., and North and South Korea—a growing list to which they’ve now added Israel. In November 2023, Israel successfully operated its Arrow-3 ballistic missile defense system, codeveloped with the U.S. Missile Defense Agency, to destroy a missile fired by Houthi rebels in Yemen that traveled beyond the Earth’s atmosphere, indicating the potential ability to blow up a satellite.\n\nThe U.S. and Russia have one remaining shared space program that has endured since the 1990s: the iconic International Space Station. It has long represented a beacon of space diplomacy and served as a stage for space science. But the aging orbital structure’s days are numbered, with Russia’s module and Soyuz spacecraft facing persistent problems, such as coolant leaks and tiny holes that have sprung up over the years. Those recurring issues appear to signal Russia’s declining civilian space program, even while it continues investing in military space research and development. Final missions aboard the ISS could come as early as 2028, unless the U.S. and Russia jointly extend its life by a couple of years. When NASA finally has to deorbit it with a space tug, it will be the end of an era. As divisions grow between the two geopolitical poles—the U.S. and its allies versus China, Russia, and their allies—it’s hard to imagine another major American-Russian space alliance anytime soon.\n\nInstead, the three space powers are going their separate ways. China completed its own new, smaller, T-shaped station in November 2022. Tiangong (meaning “heavenly palace”) began hosting international science experiments, and it will eventually invite non-Chinese astronaut visitors, according to the deputy director of China’s space agency. NASA has invested in multiple commercial space station designs for an ISS successor, which would be run by private sector companies like Axiom Space, Voyager Space, and Blue Origin. In these scenarios, NASA would be among the biggest customers, with labs and tourist modules existing side by side.\n\nRussia, for its part, has no plans to play second fiddle to China or the U.S.; its government claims that its space program will launch the first module of a brand-new space station in 2027, though McClintock and other space analysts doubt the feasibility of that timeline. Whether these new and next-​generation stations will continue the legacy of the ISS remains to be seen.\n\nFront Lines of the Future\n\nToday, the atmosphere is very different from the early space race era of Starfish Prime and Project K. More than 500 times as many satellites from around 80 countries now orbit the globe, some of them costing billions of dollars and performing crucial functions like GPS navigation, communication, and supporting astronauts aboard two space stations. When we look up at the night sky today—assuming we can escape the creeping glow of light pollution—it appears unlike it did to our ancestors. With the naked eye, we can occasionally see one or even multiple space stations overhead, and witness rocket launches, new satellites moving into position, and, every once in a while, flaming space debris in the atmosphere. And thanks to artificial constellations like SpaceX’s Starlink, the glint of light-reflecting satellites is beginning to make traditional stellar constellations look different than they did for all of human history. In a few years, tens of thousands of satellites will be floating up in orbit, outnumbering the thousands of stars we can see on a clear night.\n\nVW Pics A blend of camera exposures showing the sky crowded with satellites recorded overnight June 1–2, 2022, from latitude 51° North.\n\nJust as wars moved to the sky a century ago, modern conflicts spill into space. But while military and civilian aircraft are easy to tell apart, the situation is murkier up in orbit. Many satellites provide essential services both for the military and for everyone else. This “dual-use” has turned important infrastructure like GPS, broadband internet, and Earth-observing satellites that monitor weather or military deployments into juicy targets. Satellite services that our smartphones and other devices depend on could be disrupted as easily as shipping routes on the ground. While a lasting region-wide blackout like the one in Sam Esmail’s apocalyptic 2023 movie Leave the World Behind might be unlikely, a temporary loss of GPS or broadband internet would be disorienting, especially for those in remote areas lacking backup. And if a commercial spacecraft is damaged or destroyed by antisatellite weapons, it’s not clear, from a legal perspective, who would be responsible for footing the bill.\n\nSpacecraft have mattered in Israel’s war in Gaza and Russia’s war in Ukraine. Eyes in the skies can provide important clues, especially in war zones that are dangerous for journalists. In both conflicts, observers and researchers have used radar and optical satellites to track the devastation of civilian infrastructure. Both wars have involved imaging, mapping, navigation, and internet-providing satellites. Russia, like Israel in Gaza, has also been jamming GPS and communications in Ukraine, in addition to a cyberattack that hacked and disabled ground terminals of the American satellite company ViaSat, disrupting communications for Ukrainians and other Europeans for up to two weeks in some areas on the eve of the 2022 invasion.\n\nA Booming Business\n\nIt’s not just governments meddling in military affairs. The private space industry has grown rapidly over the past decade, thanks in part to decreasing launch costs. Just as NASA, the European Space Agency, and other space agencies have networks of Earth-observing satellites, companies like California-based Planet Labs, Capella Space, and Colorado-based Maxar Intelligence have been collecting their own high-resolution imagery and providing them to researchers, media organizations, and governments. SpaceX now boasts numerous military launch contracts, and it has been delivering broadband internet services through Starlink, the largest artificial constellation ever constructed, with more than 6,000 satellites in its fleet. Early during Russia’s invasion, Elon Musk sent a truck full of Starlink satellite dishes and terminals to Ukraine, when the country’s vice prime minister, Mykhailo Fedorov, expressed concern about a loss of internet access. Then, after months of support, Musk chose not to fulfill a Ukrainian request to activate the network over occupied Crimea during Ukrainian drone strikes, posting on X (formerly Twitter), rightly or wrongly, that “SpaceX would be explicitly complicit in a major act of war and conflict escalation.” While Boeing, Lockheed Martin, and Northrop Grumman have always been military contractors, SpaceX and other companies are also becoming major players.\n\nRussia’s war in Ukraine and Israel’s war in Gaza have already revealed the growing power of commercial actors, and the problems and liabilities they could present. In addition to SpaceX’s Starlink, satellite imaging companies have mattered too, and when U.S. law has severely restricted the gathering of satellite imagery over Israel, humanitarian groups and others have had to rely on public space agency data. Other nonstate actors, like the Russian mercenary Wagner Group and the pro-Ukraine cyber hacktivist group GhostSec, now jam and spoof satellite signals, says Clayton Swope, deputy director of Aerospace Security Project at the Center for Strategic and International Studies. He includes such tactics in what his team’s report calls “the ‘normalization of deviance’ and its behaviors that we would have said are concerning, outside the norm, harmful perhaps, but they’ve become commonplace.”\n\nThanks to the expanding industry, a broader range of actors, including opposing sides of a conflict, can now quickly access a variety of imagery. This means that it’s not just government satellites, but commercial spacecraft that are now legitimate military targets, says Jessica West, a space security researcher at Project Ploughshares, a research institute based in Waterloo, Ontario. “They’re involved in warfighting and are profiting off of it. But we don’t really talk about what their responsibilities are and to what extent they’re complicit in war crimes or other human rights violations.”\n\nIs an Arms Race Inevitable?\n\nWith all the nationalist rhetoric, international suspicion, and investment in increasingly advanced arsenals, just how concerned should we be? Since Starfish Prime and Project K, no one has “intentionally” destroyed or permanently disabled another country’s spacecraft, but the U.S. is taking some preventive measures beyond merely tracking rocket and missile launches and satellite activities in orbit. For example, most spacecraft aren’t sufficiently radiation-hardened to withstand a nuclear blast, even from far away. Following talk of this potential new Russian weapon, the U.S. Space Force has been considering upgrading its missile-​tracking satellite design so they’d be more protected from such attacks.\n\nEvery military advance or perceived threat need not be met with yet more powerful and dangerous weapons, and space rivals need not gird for a fight in the skies. There are other ways to address issues of space security and instability. “The diplomatic tool should not be overlooked,” says Samson. Space diplomats have been making slow progress in their efforts to defuse geopolitical tensions and reduce the chances for military escalation, West says. International negotiators agree that the world needs new and more detailed space rules for the 21st century, as space tech has blasted ahead of what was available in the ’60s, and more space agencies and companies have the ability to design myriad spacecraft and structures in orbit and beyond. But many countries disagree about what new space rules should look like. Over the past decade, Russia and China have sought to garner support for holding talks on a potential new space treaty, but there hasn’t been much appetite for that internationally. The U.S. has called for less stringent “norms,” which can’t be enforced the way treaties can, but would nonetheless help guide activities in space. The United Nations has organized four meetings over the past couple of years, as diplomats share their concerns and goals for norms that would reduce space threats. These norms would focus on behaviors rather than capabilities; so, for example, if a government or company designs dangerous technology but never launches or uses it, it would be acceptable. A first step in this direction is a de facto moratorium on conducting orbit-polluting antisatellite missile tests, with at least 37 countries making that pledge, following Vice President Kamala Harris’s announcement in 2022 that the U.S. would no longer conduct such tests. Russia and China have resisted this move and haven’t signed the pledge, sticking to their preferance for a new treaty that would prohibit any kind of weapon in space.\n\nThere may be a way to navigate out of this diplomatic impasse, with U.S.-allied governments taking one approach and China, Russia, and their allies taking a different one, says West. Fostering an environment where space agencies and militaries communicate more openly about their intentions with their spacecraft and space technologies could lead to less escalatory rhetoric, fewer mistakes, and a reduced risk of hostilities. “Transparency is one way to bring these two discussions together,” says West, “because there needs to be some synergy between them if we’re actually going to move forward.”\n\nCassandra Steer, a space policy expert at Australian National University, agrees with this assessment. Until there’s more transparency and data sharing, however, she remains skeptical that Russia even has an advanced space nuclear weapons program, which might be something else that has been misinterpreted or blown out of proportion. Everyone has a vested interest in avoiding conflict in space, and Steer also looks forward to seeing smaller and mid-level nations, beyond the big three, taking leadership and promoting transparency. “I’m actually very hopeful and optimistic that it’s going to take place, and we’ll see more of an international pushing back against this escalatory competition between the greater powers.”\n\nalejomiranda The Chinese space station Tiangong has been hosting international science experiments since its 2022 launch.\n\n\n\nWithout open communication and clearly stated intentions, weapons portrayed as defensive or for deterrence can be viewed as offensive ones. After all, a few years before the origins of NASA, the U.S. Department of Defense was still called the Department of War. While the Trump administration often brazenly sought space “superiority” and “dominance,” the Biden administration called for maintaining a “competitive edge,” especially with respect to China’s advancing space military. But when China and Russia also strive for an edge, a space arms race seems inevitable.\n\nCould-Be Weapons Open Gallery", "images": ["https://hips.hearstapps.com/vidthumb/images/2025-popmech-tapms-ep15-sa-v01-thumb-68f0fcef95469.jpg?crop=0.5625xw:1xh;center,top&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/pmx010125feaspacewars-007-679ba2ad0a91d.jpg?crop=1xw:0.999833582958895xh;center,top&resize=2048:*", "http://www.popularmechanics.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523000000&id=social-button-icon", "http://www.popularmechanics.com/_assets/design-tokens/fre/static/icons/headphones-regular.117021e.svg?primary=%2523000000", "https://hips.hearstapps.com/vidthumb/images/2025-popmech-tapms-ep18-jc-v01-thumb-690cfba3b5a4e.jpg?crop=0.5625xw:1xh;center,top&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/spacewars-lead-679a8fa9d08da.jpg?crop=0.760xw:1.00xh;0.178xw,0&resize=768:*", "http://www.popularmechanics.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg", "https://hips.hearstapps.com/vidthumb/415455d8-5590-48df-a399-134d3bd99fae/thumb_1920x1080.0000001.jpg?crop=0.564xw:1.00xh;0.220xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/spacewars-lead-679a8fa9d08da.jpg?crop=1.00xw:0.890xh;0,0.0482xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/pmx010125feaspacewars-008-679ba2f8bba52.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/pmx090125feaglitter-002-68b863dcd2d92.jpg?crop=0.669xw:1.00xh;0.130xw,0&resize=360:*", "https://hips.hearstapps.com/vidthumb/images/2025-popmech-tapms-ep17-sa-v01-thumb-6904bd00e3b1a.jpg?crop=0.5625xw:1xh;center,top&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/pmx090125feaamradio-008-68b85cff8d7cc.jpg?crop=0.668xw:1.00xh;0.167xw,0&resize=360:*", "http://www.popularmechanics.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://hips.hearstapps.com/hmg-prod/images/space-wars-eletronic-satellite-679a940512bda.jpg?crop=0.668xw:1.00xh;0.281xw,0", "https://hips.hearstapps.com/hmg-prod/images/space-wars-break-679a9b5fc85e2.png?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/pmx010125feaspacewars-011-679ba44333a81.jpg?resize=980:*", "https://hips.hearstapps.com/vidthumb/images/2025-popmech-tapms-ep19-sa-v01-thumb-691635ad02f04.jpg?crop=0.5625xw:1xh;center,top&resize=360:*", "http://www.popularmechanics.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/pmx110125feai95collapse-001-68e7fc8f7754c.jpg?crop=0.896xw:1.00xh;0.0619xw,0&resize=360:*", "https://hips.hearstapps.com/vidthumb/18a981c0-4556-482c-90a9-c121bc31ec74/thumb_1920x1080_00001_1740753808_75436.jpg?crop=1xw:1xh;center,top", "http://www.popularmechanics.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg?primary=%2523595959", "https://hips.hearstapps.com/vidthumb/images/2025-popmech-tapms-ep12-jc-v01-thumb-68d4095bad5bb.jpg?crop=0.564xw:1.00xh;0.220xw,0&resize=360:*", "http://www.popularmechanics.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "http://www.popularmechanics.com/_assets/design-tokens/popularmechanics/static/images/logos/logo.a957255.svg?primary=%25231c6a65", "http://www.popularmechanics.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "http://www.popularmechanics.com/_assets/design-tokens/fre/static/icons/x-regular.e414d97.svg", "https://hips.hearstapps.com/hmg-prod/images/pmx010125feaspacewars-003-679b9cea08b53.jpg?crop=1.00xw:0.990xh;0,0.0102xh&resize=980:*", "http://www.popularmechanics.com/_assets/design-tokens/fre/static/icons/caret-left-regular.5546078.svg", "http://www.popularmechanics.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523000000&id=social-button-icon", "http://www.popularmechanics.com/_assets/design-tokens/popularmechanics/static/images/logos/lettermark.0ff8c32.svg?primary=%2523000", "https://hips.hearstapps.com/vidthumb/images/2025-popmech-tapms-ep16-jc-v01-thumbnail-68fa28fcbda12.jpg?crop=0.5625xw:1xh;center,top&resize=360:*", "https://hips.hearstapps.com/vidthumb/images/2025-popmech-tapms-ep14-sa-thumb-68de98c6792bb.jpg?crop=0.5625xw:1xh;center,top&resize=360:*", "http://www.popularmechanics.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523000000&id=social-button-icon", "http://www.popularmechanics.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523000000&id=social-button-icon", "http://www.popularmechanics.com/_assets/design-tokens/fre/static/icons/arrow-right.7440adc.svg", "http://www.popularmechanics.com/_assets/design-tokens/fre/static/icons/saved.ad81f1a.svg?primary=%2523000000", "http://www.popularmechanics.com/_assets/design-tokens/fre/static/icons/bookmark-simple-regular.9d9d56b.svg", "http://www.popularmechanics.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "http://www.popularmechanics.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523000000&id=social-button-icon", "http://www.popularmechanics.com/_assets/design-tokens/popularmechanics/static/images/logos/network-logo.910b3ba.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/pmx010125feaspacewars-009-679ba3947b50e.jpg?resize=2048:*", "http://www.popularmechanics.com/_assets/design-tokens/fre/static/icons/envelope-simple-regular.91a0134.svg", "https://hips.hearstapps.com/hmg-prod/images/canvasflow/d0249ed1-3c42-4afe-8bb8-18018e302e47.jpg?crop=1xw:0.872773536896xh;center,top&resize=360:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/spacewars-lead-679a8fa9d08da.jpg?crop=1.00xw:0.890xh;0,0.0482xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.popularmechanics.com/space/a62998421/escalating-arms-race-in-space/", "title": "Are We on the Verge of an Arms Race in Space?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Are We on the Verge of an Arms Race in Space?", "description": "Rumors of a space nuke made geopolitical tensions extend into orbit. Amid an Escalating Arms Race in Space with Russia and China, Is the US Falling Behind?", "keywords": "space, war", "theme-color": "#000000", "og": {"site_name": "Popular Mechanics", "title": "Amid an Escalating Arms Race in Space with Russia and China, Is the U.S. Falling Behind?", "description": "Rumors of a Russian space nuke, along with other satellite-targeting weapons, have made geopolitical tensions extend into orbit.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/spacewars-lead-679a8fa9d08da.jpg?crop=1.00xw:0.890xh;0,0.0482xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.popularmechanics.com/space/a62998421/escalating-arms-race-in-space/", "type": "article"}, "fb": {"app_id": 218456798186610}, "article": {"publisher": "https://www.facebook.com/popularmechanics", "opinion": "false", "section": "Space", "modified_time": "2025-02-04T18:53:00Z", "published_time": "2025-02-04T18:53:00Z"}, "google-site-verification": "98saqo61zkfl_yfZaXKLgLkazlZwpUcMCkqCFEO-O18", "parsely-metadata": "{\"socialHeadline\":\"Amid an Escalating Arms Race in Space with Russia and China, Is the U.S. Falling Behind?\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/spacewars-lead-679a8fa9d08da.jpg?crop=0.551xw:0.975xh;0.144xw,0.00850xh&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/spacewars-lead-679a8fa9d08da.jpg?crop=1.00xw:0.890xh;0,0.0482xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/spacewars-lead-679a8fa9d08da.jpg?crop=0.551xw:0.975xh;0.144xw,0.00850xh", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/spacewars-lead-679a8fa9d08da.jpg?crop=1.00xw:0.890xh;0,0.0482xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "timely", "sailthru.excerpt": "On July 9, 1962, the night sky above the Pacific Ocean, from Hawaii to New Zealand, suddenly became illuminated by brilliant light, as if it were the middle of the day. A stunning artificial aurora appeared, creating a glow of green, yellow, and red, which lingered for less than", "sailthru.tags": "space,Space,pop-mech-exclusives,Pop Mech Exclusives,Popular Mechanics-US", "sailthru.date": "2025-02-04 18:53:00", "sailthru.socialtitle": "Amid an Escalating Arms Race in Space with Russia and China, Is the U.S. Falling Behind?", "sailthru.contenttype": "longform-article"}, "movies": [], "publish_date": 1738695180.0, "source": "http://www.popularmechanics.com", "summary": ""}