{"url": "https://www.usatoday.com/story/money/2017/10/31/fast-food-chains-like-taco-bell-chipotle-and-shake-shack-use-alcohol-attract-crowds/698327001/", "text": "Apparently, the fast-food industry needs a stiff drink.\n\nAn increasing number of chain restaurants, such as Taco Bell and Chipotle Mexican Grill, are serving alcohol to lure in new customers who might otherwise go elsewhere to get beer, wine or cocktails.\n\nIn the competitive world of fast food, restaurants need an advantage. In the year ending in September, the chains saw no increase in customer traffic, according to the research firm NPD Group. Tacking on alcoholic beverages to an order is a way to drive up sales. Mixed drinks have a markup of as much as 90% and beer, 25%, according to restaurant consultant John Gordon of the Pacific Management Consulting Group.\n\nTaco Bell plans to open approximately 150 new locations across the United States that will serve beer and frozen mixed drinks featuring tequila, rum, vodka and whiskey. And Pizza Hut, which serves beer and wine at approximately 3,500 of its sit-down restaurants, is set to add alcohol to the menus at another 200. Chipotle is market-testing a frozen version of its margarita, while Shake Shack, which features ShackMeister Ale and red and white wine, offered a limited-time wine shake to mark the return of the NBC TV show \"Will & Grace.\"\n\n\"It creates a little bit of buzz – in both senses of the word,\" said Aaron Allen, an Orlando-based global restaurant consultant. \"A lot of beverages with alcohol will have $3-$8 ticket prices, depending on their promotional pricing. Add a few of those on and you increase the check average. You can drive revenue without having to drive traffic.\"\n\nReaching for some hooch also helps fast-food and fast-casual chains, which tend to do most of their business at breakfast and lunch, to score more dinnertime action.\n\n\"They've been trying for years to get people to come in at night. ... You're paying rent for that restaurant all day, utilities. You might as well draw as much traffic as you can,\" said Edward Jones restaurant analyst Jack Russo. \"It’s not a huge money-maker by any means. If they can (make alcohol) somewhat affordable, who knows. It might be.\"\n\nIn 2016, booze accounted for half a percent of sales, or $1.4 billion, at fast-food restaurants and other chains where customers order at a counter, like pizza stores, according to Technomic, a Chicago-based consulting firm that tracks food industry trends.\n\nJose Juarez enjoyed some ShackMeister Ale with his hot dog lunch on a recent afternoon at Shake Shake in New York City's Madison Square Park. He said he was surprised to see beer on the menu, but happy to pay $5.79 for the 16-ounce plastic cup.\n\n\"I was craving a beer and I got it,\" said the 34-year-old animator, visiting from San Jose, Calif., but he also wondered if the traditionally kid-friendly environment of any fast food restaurant, was the best place to imbibe. \"It's a family place. You don't want a guy who drinks to much. I don't know if it's completely a good idea.\"\n\nHe's not alone in his concern. Notably, the restaurants won't let you buy brewskis from your car. The chains don't serve alcohol at their drive-thrus. The majority of states have laws that ban open containers of alcohol, like beer cans or wine bottles, in cars.\n\nAnti-drunk driving advocacy group Mothers Against Drunk Driving said it's monitoring the addition of alcohol to fast-food menus and that it's paying attention to overserving, the increased availability of alcohol and the mixed messages it sends to minors.\n\n\"We're going to watch it very closely,\" said MADD national president Colleen Sheehey-Church. \"MADD is not against the responsible sale of alcohol to adults. The key words are responsible and alcohol and adults... Our concern is the public's safety once people leave the restaurants.\"\n\nFor its part, Taco Bell said when people go to one of the restaurants that serve alcohol, it's about people relaxing together, not zooming in and out.\n\n\"It's usually a social occasion, a group of friends coming together for dinner or after a night out. Customers tend to hang out a little bit more. They want shareable food and alcohol. Nothing goes better with tacos,\" said spokesman Rob Poetsch.\n\nThe greatest concern is about serving alcohol in places that tend to be popular with younger people\n\n\"The more available alcohol is, the more people will drink and the more likely it is you’ll see more problems,\" said Johns Hopkins Bloomberg School of Public Health associate professor David Jernigan. \"It’s not like adding salads to their menus.\"\n\nHe cited drunk driving, violence, suicide and alcoholism and worried about the chains' youngest customers.\n\n\"These are family-oriented restaurants. They’re really popular with kids. The idea of fast-food outlets serving alcohol is a message that alcohol is appropriate everywhere. We're talking about a very special product here. We’re not talking about milk. We're not talking about orange juice. We’re talking about 88,000 deaths in the U.S.\"\n\nBut not everyone automatically says \"cheers\" to the move to booze. Franchisees have to be willing to navigate local liquor laws that determine everything from the time alcohol may be served to servers' ages to food-sales minimums.\n\nFor chains with company-owned stores, like Chipotle, a team examines local regulations for each location to determine if it's worth it. About 50% of its approximately 2,300 U.S. restaurants serve alcohol. None are in New Jersey, for example, because getting a license there is expensive.\n\nIf Chipotle's frozen margarita test (it introduced a traditional margarita in 2013) is a success, it could be sold nationwide by the end of the year, according to chief marketing officer Mark Crumpacker.\n\nWhile some chains are reaching for alcohol some are pulling back. Burger King once had six Whopper Bars in the United States. Now, there are only three beer-serving locations — two in Florida and one in Missouri. The company declined to say why it's not adding Whopper Bars.\n\n\"It's not a platform we’re growing,\" said Alex Macedo, president of Burger King North America.\n\nAnd in January, Starbucks paused the roll-out of the Starbucks Evenings wine and craft beer menu at company-owned stores. Launched in 2010, the program peaked at 340 locations; today, it's offered at only a few U.S. airport cafes, which are run by licensees. However, the chain said it will look to integrate beer, wine and spirits into new retail formats like its new high-end concept Reserve Roasteries.\n\nFollow USA TODAY reporter Zlati Meyer on Twitter: @ZlatiMeyer", "images": ["https://www.usatoday.com/gciaf/prod/p?a=pageview&p=USAT-TEALIUM-TANGENT&m=web&k=f14ebdd6-0569-4c64-af73-99937bc06379&s=noscript", "https://www.usatoday.com/gcdn/-mm-/8493c00c14c47675262286ee5b635a31afd2f560/c=0-1779-5412-4837/local/-/media/2017/10/10/USATODAY/USATODAY/636432650468245262-Margarita-PatronBottle.jpeg?width=3200&height=1809&fit=crop&format=pjpg&auto=webp", "https://www.usatoday.com/gcdn/-mm-/873afd57b89c65a8b7ae94803779c643713150ec/c=0-5-1093-623/local/-/media/2017/10/10/USATODAY/USATODAY/636432648896681114-Pizza-Hut---New-Storefront-300dpi-.jpg?width=660&height=374&fit=crop&format=pjpg&auto=webp", "https://www.usatoday.com/gcdn/-mm-/9850e0c9b56ed77075c9ca7090ddcaf7e07760ce/c=0-72-599-671/local/-/media/2018/12/12/USATODAY/USATODAY/636802164097640301-zlati-Meyer.png?width=48&height=48&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.usatoday.com/gcdn/-mm-/8493c00c14c47675262286ee5b635a31afd2f560/c=0-1779-5412-4837/local/-/media/2017/10/10/USATODAY/USATODAY/636432650468245262-Margarita-PatronBottle.jpeg?width=3200&height=1809&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/money/2017/10/31/fast-food-chains-like-taco-bell-chipotle-and-shake-shack-use-alcohol-attract-crowds/698327001/", "title": "Fast-food chains like Taco Bell, Chipotle and Shake Shack use alcohol to attract crowds", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "theme-color": "#0098FE", "og": {"title": "Fast-food chains like Taco Bell, Chipotle and Shake Shack use alcohol to attract crowds", "description": "Alcohol can mean higher sales, new customers and bigger crowds at night.", "url": "https://www.usatoday.com/story/money/2017/10/31/fast-food-chains-like-taco-bell-chipotle-and-shake-shack-use-alcohol-attract-crowds/698327001/", "site_name": "USA TODAY", "image": {"identifier": "https://www.usatoday.com/gcdn/-mm-/8493c00c14c47675262286ee5b635a31afd2f560/c=0-1779-5412-4837/local/-/media/2017/10/10/USATODAY/USATODAY/636432650468245262-Margarita-PatronBottle.jpeg?width=3200&height=1809&fit=crop&format=pjpg&auto=webp", "width": 3200, "height": 1809}, "type": "article"}, "article": {"author": "Zlati Meyer", "content_tier": "free", "opinion": "false"}, "description": "Alcohol can mean higher sales, new customers and bigger crowds at night.", "fb": {"pages": "13652355666,48958576760,156345381090801,110471702456365,6566864515,137698179626815,315942225236045,927427260614748,183850168300771,1443524575938047,251228454889939,158095147555989,115535341805950,236655713446291,1621466394844549,250325640686,177037772444433,1972936962947967,2047091012096533,535551216797440", "app_id": 1279862243338849}, "ROBOTS": "NOODP, NOYDIR, max-image-preview:large", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.usatoday.com/gcdn/-mm-/8493c00c14c47675262286ee5b635a31afd2f560/c=0-1779-5412-4837/local/-/media/2017/10/10/USATODAY/USATODAY/636432650468245262-Margarita-PatronBottle.jpeg?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@usatoday", "creator": "@usatoday", "title": "Fast-food chains like Taco Bell, Chipotle and Shake Shack use alcohol to attract crowds", "description": "Alcohol can mean higher sales, new customers and bigger crowds at night."}}, "movies": [], "publish_date": 1509422400.0, "source": "https://www.usatoday.com", "summary": ""}