{"url": "https://en.wikiquote.org/wiki/Elvis_Presley", "text": "The image is one thing and the human being is another... it's very hard to live up to an image.\n\nElvis Aaron Presley (8 January 1935 – 16 August 1977) was an American singer, musician, and actor. Popularly known by his first name as \"Elvis,\" as \"The King of Rock and Roll\" or simply as \"The King,\" he is regarded as one of the most significant cultural figures of the 20th century.\n\nQuotes by Elvis Presley [ edit ]\n\nThe first time that I appeared on stage, it scared me to death. I really didn't know what all the yelling was about. I didn't realize that my body was moving. It's a natural thing to me.\n\nSo to the manager backstage I said, \"What'd I do? What'd I do?\" And he said, \"Whatever it is, go back and do it again.\"\n\nI'm never going to sing another song I don't believe in. I'm never going to make another picture I don't believe in.\n\nRock and roll is a music, and why should a music contribute to ... juvenile delinquency? If people are going to be juvenile delinquents, they're going to be delinquents if they hear ... Mother Goose rhymes.\n\nI like Brando's acting ... and James Dean ... and Richard Widmark. Quite a few of 'em I like. When asked to name his favorite male actors, in \"Elvis Exclusive Interview\" with Ray Green in Little Rock, Arkansas (16 May 1956), as published in Elvis — Word for Word : What He Said, Exactly As He Said It (1999)\n\n\n\nI'd like to thank the Jaycees for electing me as one of their outstanding young men. When I was a child, ladies and gentlemen, I was a dreamer. I read comic books, and I was the hero of the comic book. I saw movies, and I was the hero in the movie. So every dream I ever dreamed, has come true a hundred times... And these gentlemen over here, these are the type of people who care, they're dedicated, and they realize that it is possible that they might be building the kingdom of heaven, it's not just too far fetched, from reality. I'd like to say that I learned very early in life that \"Without a song, the day would never end; without a song, a man ain't got a friend; without a song, the road would never bend — without a song.\" So I keep singing a song. Goodnight. Thank you. Acceptance speech for the 1970 Ten Outstanding Young Men of the Nation Award (16 January 1971), published in Elvis — Word for Word: What He Said, Exactly As He Said It (1999) by Jerry Osborne, p. 188\n\nAnd these gentlemen over here, these are the type of people who care, they're dedicated, and they realize that it is possible that they might be building the kingdom of heaven, it's not just too far fetched, from reality. I'd like to say that I learned very early in life that \"Without a song, the day would never end; without a song, a man ain't got a friend; without a song, the road would never bend — without a song.\" Goodnight. Thank you.\n\nThe first time that I appeared on stage, it scared me to death. I really didn't know what all the yelling was about. I didn't realize that my body was moving. It's a natural thing to me. So to the manager backstage I said, \"What'd I do? What'd I do?\" And he said, \"Whatever it is, go back and do it again.\" Interview (March/April 1972), as quoted in The Leading Men of MGM (2006) by Jane Ellen Wayne, p. 406\n\n\n\nThe image is one thing and the human being is another...it's very hard to live up to an image. Press conference (June 1972),also quoted in Elvis Culture : Fans, Faith, & Image (1999) by Erika Lee Doss, p. 218\n\n\n\nMan, I was tame compared to what they do now. Are you kidding? I didn't do anything but just jiggle. Press conference (June 1972) as quoted in Elvis — Word for Word : What He Said, Exactly As He Said It (1999), by Jerry Osborne, p. 208\n\n\n\nA live concert to me is exciting because of all the electricity that is generated in the crowd and on stage. It's my favorite part of the business — live concerts. Press conference (5 September 1972), also quoted in Paranoia & Power : Fear & Fame of Entertainment Icons (2007) by Gene N Landrum, p. 60\n\n\n\n'To judge a man by his weakest link or deed is like judging the power of the ocean by one wave.' Handwriten message on Elvis' King James -Bible\n\n'There is a season for everything, patience will reward you and reveal all answers to your questions.'\n\n'Truth is like the sun. You can shut it out for a time, but it ain't going away.' Another handwriten message on Elvis' King James -Bible [2] No proof it was handwritten with this link.\n\n\n\nWhat honey? What is that? It's a sign, I can't see it, wait a minute. Oh, thank you darlin', thank you very much. Oh, thank you. The thought is beautiful dear, and I love you for it, but I, I haven't been caught up in this thing and I can't accept this kingship thing because to me there's only one, which is Christ. September 30, 1974. South Bend, IN. Notre Dame Ath Center. [ 1 ] [ 2 ]\n\n\n\nI had too much praise, too much flattery and fawning over and I needed to remember who I was, where I came from. One time I called a relative in Tupelo. It was Christmas and they were havin' dinner. I asked, 'What?' and she was kind of quiet, then said, 'Meat loaf.' I was shocked as we'd had the best, you know, turkey, ham, steak, everything. She said that it was near the first and they'd run out of money so they just had meat loaf. It hurt me. and so, I ate meat loaf for about eight months, every night, so I'd remember where I came from and to remind me of how many people were unable to have what I did. It was kind of a penance... originally from the book Blue Star Love by By Maia Chrystine Nartoomid.\n\n\n\nI'm strictly for [Adlai] Stevenson. I don't dig the intellectual bit, but I'm telling you man, he knows the most. Elvis Presley Was Always Too Busy to Vote for President\n\n\n\nSong lyrics [ edit ]\n\nDon't be cruel to a heart that's true.\n\nBaby, if I made you mad\n\nFor something I might have said,\n\nPlease, let's forget the past,\n\nThe future looks bright ahead.\n\nDon't be cruel to a heart that's true.\n\nI don't want no other love,\n\nBaby it's just you I'm thinking of. Don't Be Cruel , written by Otis Blackwell and Elvis Presley (1956)\n\nFor something I might have said, Please, let's forget the past, The future looks bright ahead. Don't be cruel to a heart that's true. I don't want no other love, Baby it's just you I'm thinking of.\n\nWhen you looked into my eyes,\n\nI stood there like I was hyp-notized.\n\nYou sent a feeling to my spine,\n\nA feeling warm and smooth and fine.\n\nBut all I could do were stand there paralyzed.\n\nWhen we kissed, ooh what a thrill,\n\nYou took my hand and, ooh baby, what a chill.\n\nI felt like grabbin' you real tight,\n\nSqueeze and squeeze with all my might.\n\nBut all I could do were stand there paralyzed. Paralyzed , written by Otis Blackwell and Elvis Presley (1956)\n\nI stood there like I was hyp-notized. You sent a feeling to my spine, A feeling warm and smooth and fine. But all I could do were stand there paralyzed. When we kissed, ooh what a thrill, You took my hand and, ooh baby, what a chill. I felt like grabbin' you real tight, Squeeze and squeeze with all my might. But all I could do were stand there paralyzed.\n\nA well I bless my soul\n\nWhat's wrong with me?\n\nI'm itching like a man on a fuzzy tree.\n\nMy friends say I'm actin' wild as a bug.\n\nI'm in love,\n\nI'm all shook up.\n\nMm mm oh, oh, yeah, yeah! All Shook Up , written by Otis Blackwell and Elvis Presley (1957)\n\nWhat's wrong with me? I'm itching like a man on a fuzzy tree. My friends say I'm actin' wild as a bug. I'm in love, I'm all shook up. Mm mm oh, oh, yeah, yeah!\n\nThe way she held your hand,\n\nThe little things you planned.\n\nHer memory is with you yet,\n\nThat's someone you'll never forget. That's Someone You Never Forget , from Pot Luck , written by Elvis Presley and Red West (1961)\n\nThe little things you planned. Her memory is with you yet, That's someone you'll never forget.\n\nSweetheart we're alone\n\nAnd you are mine.\n\nLet's make this night a night to remember.\n\nDon't make our love a cold dying ember,\n\nFor with the dawn, you'll be gone. You'll Be Gone , written by Elvis Presley, Red West and Charlie Hodge (1961)\n\nAnd you are mine. Let's make this night a night to remember. Don't make our love a cold dying ember, For with the dawn, you'll be gone.\n\n\n\n\n\nDisputed [ edit ] Love me tender, love me sweet,\n\nNever let me go. \"Love Me Tender\" (1956), the lyrics of this song are credited to Presley and co-writer Vera Matson, but were primarily written by Matson's husband, Ken Darby, who when asked why he credited his wife as co-writer with Presley replied \"Because she didn't write it either.\"\n\n\n\n\n\n\n\nMisattributed [ edit ] The only thing black people can do for me is shine my shoes and buy my music. Misattributed in \"He wasn't my king\" by Helen Kolawole in The Guardian (15 August 2002) apparently citing an unsourced anecdote, that has been debunked in Counterpunch (29 August 2002) which cites an article in Jet magazine (1 August 1957):\n\n\"Tracing that rumored racial slur to its source was like running a gopher to earth\", Jet wrote. Some said Presley had said it in in Boston, which Elvis had never visited. Some said it was on Edward Murrow's on which Elvis had never appeared. Jet sent Louie Robinson to the set of Jailhouse Rock \"When asked if he ever made the remark, Mississippi-born Elvis declared: 'I never said anything like that, and people who know me know I wouldn't have said it.'\" More on this misattribution at Snopes.com\n\nQuotes about Elvis Presley [ edit ]\n\nBy honoring Presley with the Medal of Freedom, the President paid tribute to someone who arguably did as much to bridge the cultural and racial divide as anyone who ever lived, an impressive and unifying act from someone usually considered the most divisive of presidents. ~ Gary Abernathy\n\nOf course, it was 1957, he had a beautiful blonde on the back of his motorcycle. Now, I wasn't watching the blonde and I didn't know who he was, so I took him down to the Las Vegas police station where I then worked and I gave him a pass... ~ Joe Arpaio\n\nI don't think any two men on this planet ever had the charisma of Elvis Presley and Jackie Wilson. The two of them remind me of each other: the charisma. ~ Hank Ballard\n\nIn Las Vegas, he was a different Elvis, putting on the blitz, the neon signs dared him. In a sense, he codified, encapsulated, permeated, embodied Americana. It was so real in its total artificiality, as Elvis brought it all together and made it work. ~ Tom Constanten\n\nThe last names, or first or given names by which people are best known and whose quotes are included below are arranged alphabetically, for ease of reference. When the person being quoted has a royal, or religious title, they can be found by looking for their first or adopted name. Examples: Bhumibol King of Thailand; Elizabeth II Queen of England; Albert II Prince of Monaco; Astrid, Princess of Norway; Deborah Duchess of Devonshire; Pope Benedict XVI .\n\n\n\n\n\nA [ edit ]\n\nWhen I was about five years old, they again showed \"Aloha from Hawaii\" here in my country, Norway. I had my parents wrapped around my finger, so they would let me stay up and watch it, because it was on after midnight. I was so amazed by the performance......... Abbath, Norway's globally renowned black metal superstar, as told to Tim Dawson of Team Rock, and published on 15 November 2016....\n\n\n\nThat is why we can waste no time promoting legitimate role models. This is where N.B.A. players come in. In 1956, Elvis Presley received his polio vaccine before one of his appearances on television, launching a highly effective vaccination campaign that by 1960 had reduced annual occurrences of polio by 90 percent. Health policy professionals suggest that public health campaigns using celebrities should focus on celebrities who are influential in particular communities in order to build trust. N.B.A. players, 81.1 percent of whom are Black, appeal to the under-35 and African-American demographics Kareem Abdul-Jabbar, in an Opinion Editorial on the Covid 19 pandemia, entitled \"We Should Let Some N.B.A. Players Jump the Vaccine Queue\", as published in the NYT's February 1, 2021 edition.\n\n\n\nIt's probably asking too much that “Ruben Brandt, Collector” sustain its pop-art ebullience across its entire running time. But the dips are hardly depressions, and there's nearly always a frisky detail to enjoy or virtuosic tableau to bathe in, all of it augmented wonderfully by Tibor Cári's appealing score. Mostly, though, Krstić, whose background encompasses set design and sculpture, painting and photography, has shown everybody how to throw down the first-feature gauntlet at the age of 66: with Warhol's holstered “Elvis I & II” facing down our hero and declaring, “Draw!” Robert Abele, reviewing for the Los Angeles Times Milorad Krstić's animated film “Ruben Brandt, Collector” and as published in their November 13, 2018 edition.\n\n\n\nBy honoring Presley with the Medal of Freedom, the President paid tribute to someone who arguably did as much to bridge the cultural and racial divide as anyone who ever lived, an impressive and unifying act from someone usually considered the most divisive of presidents. Gary Abernathy, contributor for the Washington Post, in an article dated 20 November 2018, and entitled \"Trump honoring Elvis? It's about time\", in reference to Elvis' being awarded the Presidential Medal of Freedom, in a ceremony held at the East Room in the White House, on November 16, 2018\n\n\n\nIn 2004,at age 13, I became such an Elvis fan that I wanted to either marry him or be him, then I made my parents listen. He is my mentor... Valentina Acevedo, Argentinean rocker, as noted in an interview pubished in the TUS Radios Necochea's edition of 26 January 2024.\n\n\n\nSongwriter Earl Brown was tapped to create a special finale song that reflected Elvis' emotions about the social upheaval of the time. According to the show's director Steve Binder, the resulting song, “If I Can Dream,” was recorded with Elvis in the dark, almost in a fetal position, writhing on top of the studio's cement floor. And when he got done, Elvis came in the control room and asked for the song to be played more than a dozen times. Later, Binder also crafted a gospel segment populated with racially diverse singers and dancers, which he knew would spotlight the Southern-born Presley's disdain for prejudice. Fittingly, it was the highest-rated TV special of 1968 and signalled the rebirth of Elvis's career. Lori Acken, of ReMIND Magazine, reviewing NBC-TV's 1968 Elvis special, as published on February 6, 2018\n\n\n\nI loved Elvis since i was a kid, as my dad was a huge Elvis fan. His range was incredible high, or low and he could croon. His impact on me was his love of African American music. Yolanda Adams, in a filmed interview for Gracelancom\n\n\n\nI am reminded of a comment made shortly after the death of Elvis Presley by a musician he had worked with. He pointed out that despite an impressive vocal range of two and a half octaves and something approaching perfect pitch, Elvis was totally willing to sing off-key when he thought the song required it. Those off-key notes were art. Patrick H. Adkins, The Dream Vaults of Opar\n\n\n\nI hate that I missed Elvis and I wish I would have had a chance to see him Trace Adkins, as a guest to Bill Maher's podcast, streamed live on February 14, 2024.\n\n\n\nBlack culture has historically pioneered music, dance, fashion, and it’s then been emarketed as Elvis (Presley) or whatever..... Ben Affleck, a year after he and his fourth wife Jennifer Lopez, as well as her daughter by a previous marriage, were photographed on their wedding day, in 2022, as they proudly posed inside a plush pink Cadillac they insisted had been one of Elvis' properties, the above quote from Mr. Affleck as noted in an article published in the \"Essentially Sports' March 18, 2023 edition which detailed his producing, directing and starring in the 2023 movie \"Air\", about Michael Jordan's joining the Nike brand.\n\n\n\nI was there taking in the show when it happened. Out of the crowd, I can still see it, an orange, medium sized frisbee comes floating up. I'm like ' Oh, that's going to make the stage. It did. It sailed right into Elvis, smacking him just above his right eyebrow. Bam!! I watched closely as Elvis, just a few feet away from me, absorbed the blow, then imagined the worst. He dropped to one knee, looked me right in the eye — I think he thought I was a bodyguard and not the curtain raiser I was that night — and said. 'I've been shot'. \"No, Elvis, it's just a frisbee\" I said. Not an attempted assassination, just one more painful byproduct of fame, I thought. \"Oh,\" responded Elvis, then got back to his feet and started singing again. Like he always did. For that night, at least, the show wasn't over.... Percy Ahrendt, recalling the time on June 22, 1977. 6 weeks before Elvis death, when he took a job at the Sioux Falls Arena as a curtain raiser, in a story captured in an article entitled \"Elvis feared a bullet. This bystander was there to to ease his mind\", as published in the INFORUM's July 8, 2025 online edition.\n\n\n\nHe was an extraordinary figure of his and our time, his legacy tremendous in terms of the music he created, his films, and as an entertainment personality. The generosity that he showed toward others is simply remarkable and I think it's these aspects of his character, his persona, that make him such a special person. Albert II, Prince of Monaco, after his visit to Graceland on August 7, 2010 as noted by EPE.\n\n\n\nIn an era when radio stations refused to play Chuck Berry songs, calling it “race music”, Elvis broke down barriers. Janet Albrechtsen, Australian columnist, in an article entitled \"Beware mob rule in the new racism\" published in The Australian on 23 November 2017.\n\n\n\nI've kind of been infatuated with Elvis since I was a kid, just always watching documentaries and stuff on him. It had a little bit to do with that and, honestly, I just wanted him to have something that wasn't very common. Jason Aldean, explaining why he and his wife named their first son Memphis, as published on Soundslike Nashville on September 30, 2017.\n\n\n\nI remember we were in his bathroom, he took my hand, asked me to sit down in a black leather chair, said some beautiful things and then he asked me to marry him. Ginger Alden, who found Elvis lifeless in the main bathroom at Graceland, six weeks after he asked her to marry him in that same bathroom, in an interview for CBS aired in 1982.\n\n\n\nWhen Elvis Presley died in 1977 I was no more than six. On that summer night in August I was sitting between my parents in my grandfather’s house in Italy where we were spending the summer holiday. We were watching television, then delivering to viewers the news of his death, with scenes of fans wailing at the departure of the artist who had engaged the world with his music and gyrating dancing, and personal charisma that made him adored by girls and an inspiration for boys. Last Thursday, at around midnight I received a call from one of my friends telling me that Michael Jackson had died, and one website confirmed the news even before CNN had. Both of them died, and there have still been those who say that death has not touched them and that they still live amongst us with their music and greatness. Yasser Al Ghaslan, Saudi blogger and journalist, as noted in the Global Voice's 30 June 2009 edition.\n\n\n\nAs a child, I saw Elvis Presley. So that was something, I mean he was this person with a guitar and that was the image I wanted to be. I wanted to be a musician so I got my first guitar when I was thirteen years old, and I felt, oh man, now that I have the guitar, I got the music. But it started from that.... Lucky Ali, on what pushed him towards music, in an interview with WION'a published in their April 6, 2022 edition.\n\n\n\nLet us remember that Elvis’s style — which often included all-leather outfits and flashy jumpsuits — was also controversial for its mid-century time period. So, is Post Malone truly our modern-day Presley? Judging by his care-free attitude and penchant for leather Cuban heeled boots —another, Presley favorite—the verdict would appear to be yes. Cristian Allaire, for Vogue, in an article entitled \"Is Post Malone the new Elvis Presley of today?\", as published on December 2, 2018\n\n\n\nI was standing in the hallway, just before the show, and one of the managers told him there was a girl on the telephone who was in the hospital. She said she had tickets for the show but couldn't come as she had a serious illness. And Elvis said, 'I want to talk to her', so he marched into a room and held up the entire show for fifteen minutes to talk to that girl, asking her several questions, with warmth and interest. Just before hanging up, I remember he said, 'No, honey I don't have a blue Cadillac. I've got a pink one, a black one, a white one – a pause, and then he said, oh yeah, I do have a blue one'. He was a gentleman and I respected that immensely. Lew Allen, a then 17 year old student who went on to earn an Associate's Degree in photography and a B.A. in Fine Arts/Photography from the Rochester Institute of Technology. He was asked to photograph Elvis at the Cleveland Arena in Ohio, on November 23, 1956 because of a labour strike affecting the three major newspapers, as told by Mr. Allen in an interview published in Rock paper on June 6, 2005.\n\n\n\nIt embodies everything I look for in a tune, simple and striking at the same time Herb Alpert, on why did he chose Elvis' version of \"Are you lonesome tonight\" as the lead single leading to the release of his album \"50 years\", in an article published in US Rocker's September 15, 2024 edtion.\n\n\n\nRock n' roll, through Elvis, became a target of southern segregationists, who believed that race mixing led, inevitably, to miscegenation and that exposure to black culture promoted juvenile delinquency and sexual immorality Glenn C. Altschuler, in his book \"All Shook Up: How Rock 'n Roll Changed America\" (Oxford University Press 2003)\n\n\n\nObama is like Elvis, there will always be demand for impersonators of such popular and historical people. Ilham Anas, Indonesia's most successful Obama impersonator, as reporter in This week in Asia, on November 5, 2016.\n\n\n\nAfter one of Elvis Presley's last shows, I was heading back to my car when a matron from Zachary stopped me and gushed about how wonderful he had been. Didn't you just LOVE him?\" she asked. \"Well, I thought he looked tired and sick and was just going through the motions.\" Whereupon she whacked me on the head with the rolled-up Elvis poster she was carrying. LOL. I took it in stride — nobody ever said it was easy being a music critic. ... Music critic Smiley Anders, writing for The Advocate in an article published on their March 25, 2019 edition.\n\n\n\nI discovered the blues in a funny kind of a way, from the age of seven when I was listening to my father's war-time collection of big band jazz. It had that thing about it – I didn't really know what it was –, that set the pulse racing a bit; and then I heard echoes of it again, with early Elvis Presley. Ian Anderson, singer, flautist and leader of Jethro Tull, explaining to G.Brown, of the Denver Music Examiner, his first experience with hearing the blues, starting at the age of 7, as published in that newspaper's online edition, on August 11, 2008.\n\n\n\nUnbelievable! To hear my father grouped together with Elvis Presley, William Faulkner and Eudora Welty, it's a dream. John Anderson, son of painter Waltyer Inglis Anderson, speaking of his father's induction into the Mississippi Arts and Entertainment Experience Hall of Fame, as reported by ABC center on December 16, 2017, with the other 17 members being Jimmie Rodgers, Robert Johnson, Muddy Waters, B.B. King, Leontyne Price, Elvis Presley, James Earl Jones, Jim Henson, Morgan Freeman, Oprah Winfrey, Sela Ward, George Ohr, William Faulkner, Richard Wright, Eudora Welty, Tennessee Williams, and John Grisham\n\n\n\nHis latest album, \"Piano\", is a collection of his past work, stripped down so all you hear is his beloved piano. It was hearing an Elvis Presley song that sparked his passion for the piano when he was young. About ABBA-founder Benny Andersson's decision to take up piano, at age 11 in his native Sweden, specifically after hearing \"Treat me nice\", the B side of the \"Jailhouse Rock\" single, as noted by Tom Power of CBCRadio on December 10, 2017\n\n\n\nAfter doing ‘Dr. No’ with Sean Connery, the brass at Paramount proposed that I co-star with Elvis. At first I turned the offer down, mainly because after having dated James Dean, I had imagined Elvis to be an \"ordinary\" person. So they organized a meet-up and, to my amazement, I immediately fell for his charm. He was extremely well educated and when I told him I hated Rock and that I liked Gospel, he gave me his entire collection of gospel songs. Little did I know that was his main source of inspiration. Anyways, we became instant friends and he loved to cook for me when we were on location. He told me he would have loved to live in Europe and, when I told him my husband had sold our BMW 507, he gave me another as a present. Twenty years later, in 1982, I auctioned the one Elvis gave me for US$300,000 and then the person who bought it from me later sold it for 1.2 million (USS dollars). He was in fact, a one in a billion type, a wholly adorable person and we remained in touch till his death. Swiss actress Ursula Andress in an interview published in Mujer Hoy, on 12 January 2016.\n\n\n\nBeto, he's a rock star right now, he's Elvis Presley, Maximo Anguiano, of the Texas Organizing Project, in reference to Beto O’Rourke being the candidate who could unseat Sentaro Ted Cruz in the 2018 mid-term elections.\n\n\n\nIn Vegas, we'd meet and we'd talk about everything. Slowly he started coming over to see my show; he'd sit up there and I'd come back after the show and we'd talk music. He would show up, this incredible God-like figure. He had everything, and the voice —what a great voice he had. Then, on August 17, 1977 I happened to be in Las Vegas, so when I turned on the news and learned of his death, I cried all day. He was a cool, nice man. Paul Anka, from his autobiography \"My way\"\n\n\n\nI want to celebrate his life. He was so gifted, I just cherish his memory, his generosity, and he was so private, like I am. He knew about honour, and respect, and was so considerate, and his manners, and the way he was so civilized. And as an entertainer he will never be repeated. I wanted him to know all that, and I did tell him, but very few others did... Actress and entertainer Ann Margret, in an interview with Charlie Rose, as broadcast on February 11, 1994.\n\n\n\nI have visited Graceland and you could see the man was overwhelmingly honest. He never professed any taste other than his own, that is, country boy made good. He never pretended to be anyone else. Adam Ant, leader of Adam and the Ants, a punk rock band, in an article published on September 5 2017, at the Tampa Bay Times\n\n\n\nOne day while he and Richard Davis were conversing he removed the watch from his wrist, handing it to Davis and stating there was something wrong with the back of it. When Davis turned the timepiece over to inspect it, he saw to his great surprise that the case back had been inscribed, \"To Richard, From E.P. Elvis then said, \"I guess it's yours now\". He was known for being extremely generous, often giving away his valuable personal belongings as presents so it was not surprising that he gifted his prized 18kt yellow gold Corum Buckingham to Davis. Antiquorum Auctioneers's notes for those attending the November 11 2018 auction held in Geneva, Switzerland, and highlighting the sale of a yellow 18k gold Corum 1960 Buckingham wristwatch gifted by Elvis to Richard Davis, his long time friend and last wardrobe manager, as detailed in Antiquorum webpage.\n\n\n\nIt was the early 1970s. I was 22, working in some little show in a hotel that's now gone, and he was doing a gig at the Las Vegas Hilton. We met backstage at a Tom Jones concert, then he showed me some karate moves, with a small party of folks ending up at his penthouse suite. There, he turned to me and said he had something to show me in his bedroom, so I thought, 'Oh, here comes the cliche,’ Turns out, he just wanted to read to me from Kahlil Gibran’s “The Prophet.” It was a sweet moment, as he sat on a footstool beside me and read like a child, his finger following the text. He signed the book, gave it to me and told me to have a blessed life. He was so sweet, that's what struck me the most. In retrospect, I view him as a prisoner of his fame. That, and his roots in gospel music and the church, fueled his desire to seek out more knowledge about the world and self-realization. Actress Susan Anton, as told to Michael Grossberg at Dispatchcom.\n\n\n\n( After a year of playing Elvis Presley on the screen),Austin Butler is still talking like him Not a bad person to be stuck talking like. Unfortunately, his next project is \"The Jerry Lewis Story\" LOL. Judd Apatow, poking fun at Austin Butler's Elvis accent as he emceed the 2023 Director's Guild of America Awards in an article published in the Daily Mail's February 20, 2023 edition\n\n\n\n\"Are You Lonesome Tonight?” hit No. 1 on the Billboard Hot 100 singles chart on Nov. 28, 1960, becoming Elvis' 15th No. 1 single. It would remain at the top of the chart for six weeks and nominated for Grammy Awards for Best Performance by a Pop Single Artist and Best Male Vocal Performance. A live version recorded in 1969 in which Elvis cracks up laughing almost throughout the spoken-word section would be a minor hit in England in the 1980s. At one point in that recording, Elvis becomes even more amused at one of his backup singers, who continues her part despite his laughter. That singer was Cissy Houston – Whitney Houston's mother. Charles Apple, in an article entitled \"Hitmaker\" as published in Spokane's The Spokesman-Review's November 22, 2020 edition\n\n\n\nThe biggest surprise about his singing had been revealed when he gave us a private concert and sang \"Love me tender\" a soft, ultra-slow ballad at the quaint music bungalow on the far west side of 20th Century lot. It was away from the bustle of traffic and from the big stages and it looked like the kind of cottage Walt Disney would have built for Snow White and Prince Charming. This was where Elvis felt relaxed, comfortable. So Ken Darby sat at the grand piano at the far end of the living room and Elvis stood a few feet behind him and in front of a tall stained-glass window. He stood erect, as if he was in a choir. Ken started to play the soft melody and I hardly knew that Elvis had started to sing, as his voice, barely louder than the piano, was pitched slightly higher than his usual. It had a lot of resonance and vibration and Elvis was on-key for every note, no matter how long, short, high or low. When he finished, it seemed only normal to express our amazement. \"People think all I can do is belt, I used to sing nothing but ballads before I went professional. I love to sing slow, but seldom get to do it\", he said, then continued to explain that, as a boy, an only child, he would sing like that when he sang with his mother and dad in church. \"It was a small church, only seated about 75, you couldn't sing too loud there.\" Army Archerd, a columnist for Variety then interviewing Elvis for the Photoplay magazine and who was present at the sessions, including an intimate concert for a dozen or so, which preceded the actual recording of the \"Love Me Tender\" soundtrack, as noted in a document entitled \"Photoplay (Jul-Dec 1956)\" as digitized by the Internet Archive in 2017 with funding from Media History Digital Library.\n\n\n\nWhen my cousin, four years older than me, played me two and a half minutes of music, which changed my life. That music was Elvis Presley, singing Hound Dog, and for the next six months – to my mother's absolute horror – I didn't want to hear anything but the rawest rock'n'roll I could lay my hands on. Do you know? For those who didn’t live through the Fifties, it’s really hard to imagine the enormous cultural gulf which existed between England and America at that time. Elvis himself was a God and in some of the first footage that we saw in England, seemed to us like an alien super being from a distant universe. Rod Argent English musician, speaking about his reaction when told his band the Zombies would be inducted into the Rock and Roll Hall of Fame, as noted by RollingStone's 30 March,2019 edition..\n\n\n\nI'm definitively going to make a record with him. You would be surprised what we could do together. You ask me if I think he is good. How many Cadillacs was it he bought.? That boy's no fool... Louis Armstrong, interviewed by Memphis Press Scimitar, March 1, 1957 edition.}\n\n\n\nMy cuban blood was flowing. My hips were revolving. I would have made Elvis look as if he was standing still Desi Arnaz, in his bio, \"A book\" , referring to his moves in 1939, while doing the conga.\n\n\n\nOf course, it was 1957, he had a beautiful blonde on the back of his motorcycle. Now, I wasn't watching the blonde and I didn't know who he was, so I took him down to the Las Vegas police station where I then worked and I gave him a pass... Former Arizona Sheriff Joe Arpaio, recalling his most memorable traffic stop, which involved a speeding motorcycle driven by a young Elvis, as published in an interview with CBS's channel 5 on August 8, 2018.\n\n\n\nNaming the single greatest cultural icon of the 20th century is subjective and highly debatable, but Elvis Presley's claim is one of the strongest. His unparalleled influence on music, fashion, and youth culture fundamentally reshaped popular entertainment and made him a global symbol of rebellion and charisma. Artificial intelligence's answer, via google and as of October 2, 2025, to the question on whether Elvis is indeed the greatest cultural icon of the 20th Century, the other candidates being the Beatles, Michael Jackson, Muhammad Ali, Marilyn Monroe, Walt Disney and Charles Chaplin with the latter two having been born on the 19th Century\n\n\n\nArguably some of the most important tracks in the history of Rock and Roll, Elvis' SUN recordings demonstrate what a dynamic and talented vocalist he was; the young, raw, unadulterated Elvis whom musicologist Francis Davis once called \"the greatest white blues singer”; I'm not one to argue with Mr. Davis. Art's Strange World review of the CD \"The Sun Sessions\" (15 August 2007)\n\n\n\nI am the greatest contemporary artist of all-time. Rapper ASAP Rocky´s claim, which writer Jake Boyer of \"Highnobiety\" sarcastically said \"puts him the same playing field as everyone from Michelangelo to Elvis Presley\", as published in their online page on November 22, 2017.\n\n\n\nAnd he left the game wanting. I think Bjorn could have won the U.S. Openan the Grand Slam. But by the time he left, the historical challenge didn't mean anything. He was bigger than the game. He was like Elvis or Liz Taylor or somebody. He'd lost touch with the real world Arthur Ashe, speaking abour *Bjorn Borg's immense popularity at the height of his fame, as published in the spoprtskeeda's February 19, 2025 edition.\n\n\n\nHe was stationed in Germany doing his service so on the occasion he would go visit Paris coinciding with my time there. On his first visit, he took 40 dancing girls from the Lido to the Prince des Galles Hotel. On his next, he suddenly took a great shine to me but when someone told him I was trans-sexual, he stayed away. But, if by chance we would be in the same club, he would sent me a bottle of champagne every time. He was a divine human being. April Ashley, a MBE, born George Jamieson and the first male Briton to have full sex reassignment surgery, recalling the time she met Elvis in 1959, as published in the Mirror on November 4, 2018.\n\n\n\nWhere were you when you learned of Elvis Presley's death? I was at the Mendenhall Glacier Visitor Center near Juneau, Alaska, escorting a group of senior adults. Like JFK’s assassination, the first moon landing and 9/11, it's one of the events engraved in our memory, at least for us of a certain age. Elvis may have left the building for the last time 46 years ago, but he is still very much a part of our lives. Chaplain Greg Asimakoupoulos, as published in the April 2, 2023 issue of the Kitsap Sun\n\n\n\nI found him to be an interesting person, had an entourage of good old boys, was busy with karate, breaking his hand while doing it, but he was nice and cooperative and friendly. I really liked him. Ed Asner, on the first time he met and worked with Elvis, namely during the shoot of \"Kid Gallahad\", in 1962, in an article published on July 16, 2018 on the Houston Chronicle.\n\n\n\nPrincesses Margrit of Denmark (now HRH, the Queen of Denmark), Margaret of Sweden and I, were assigned to represent the people of Scandinavia on the SAS' maiden intercontinental flight to Los Angeles. We went to Disneyland, then to the Paramount Studios. He was making a film, we watched him sing a song and then he greeted us. He was very polite, a man with an M in capital letters. He was very pretty, had been our idol and we three had heard all his records, seen all his movies, so when I found out he had died, I was very saddened. Princess Astrid of Norway, as told to Roger Mogstad, son of Tor Mogstad, the Princess's personal hairdresser on October 12, 1987, and as detailed in a clip from youtube, THE KING, THE PRINCESS & ME\n\n\n\nIn times of trouble, I put my faith in Elvis Presley, who represented the South's better angels. He was a hard worker, and although he lived the high life, he never forgot that he had been born into poverty. And he was a self-made talent, perhaps the greatest entertainer of all time, born in a two-room shack in Tupelo, Miss., in 1935. I've been to that small shotgun house many times, reflecting on what it says about America. Greatness can be born anywhere. His father Vernon was a laborer who was often out of work, and the Presleys relied on the kindness of family and neighbors to get them through the hard times.When Elvis was young, the Presleys lost it, and they ended up shuttling around Tupelo, often living in black neighborhoods, where Elvis famously developed an ear for black gospel and blues to supplement his love of the old-time gospel he knew from his own church.I still believe in my heart that most Southerners are still more like Elvis than President Trump. We are most likely to pull over and help someone stranded on the roadside. Most of the people I know in my Mississippi town would give you the shirt off their backs. Most Southern preachers don't spend Sundays in the pulpit spewing hatred and intolerance. Most people agree that racism and white supremacy are evil. Even preschoolers know it's always better to tell the truth and take your lumps than lie and evade. And yet here we are. We know right from wrong, but most of us down here voted for wrong. As Elvis once said, “Truth is like the sun. You can shut it out for a time, but it ain’t goin’ away. Ace Atkins, in his article, \"In Elvis we trust\", part of TIME magazine's August 6 special issue on the American South.\n\n\n\nElvis changed the country music scene quite a bit; he almost put country music out of business. He was white, but he sang black. It wasn't socially acceptable for white kids to buy black records at the time. Did I have any sense of how big he was going to be when he first came to RCA? Oh yeah, we knew. Back in those days, if a guy got hot in one area you could spread it around the country, maybe the world. He was already so big in East Texas and Louisiana you couldn't get him off stage with a firehose. We knew. When he came in to do “Heartbreak Hotel” I called up my wife and told her to come over. I said, You might not get a chance to see him again, he's gonna get so damn big. Chet Atkins, Pop Chronicles, Show 8 – The All American Boy: Enter Elvis and the rock-a-billies. Part 2, interview recorded January 1968.\n\n\n\nComing upon these tapes, unspooling them and watching them glide across an Ampex 440 reel-to-reel deck for the first time was the closest I'll ever get to being a real life Indiana Jones. Beyond the staggering realization of what we had found, there was a musical element that also knocked our socks off: On these tapes Glen is singing pure rock and roll and with a sense of joy, passion and wild abandon that can only have come from knowing that his idol, the avatar Elvis Presley, would be an audience of one for these recordings.” Stephen Auerbach, detailing for RollingStone what he felt after finding and playing tapes which had been lost of Glen Campbell doing demos for Elvis, as published on October 31, 2018.\n\n\n\nWhen Elvis came back from the service and he was greeted by all the publicity, the press, the photographers, reporters, and so forth, someone said to him \"Well, what do you think now that you're not number one but Avalon is ?\" And he said \" Oh, I love his song \"Venus\" and there's room for everybody.\" And I thought that was really genuine, nice compliment. Frankie Avalon, as noted in whenstarsmeetstars.\n\n\n\n1) Ed Sheeran 2) Will Smith 3) James Cordon 4) Peter Kay 5) Her Majesty Queen Elizabeth II 6) Elvis Presley 7) Prince Harry 8) Michael Jackson 9) Beyonce and 10) Kim Kardashian UK Avis Budget Group's list of most favoured celebrity travel buddies, from a poll taken in July of 2018, of over 14,000 consumers across Europe, aged 18-66+ including 1,000 British nationals\n\n\n\nI was about to say you were doing a disservice to fat Elvis who had much more dignity than Donald Trump does right now. What the hell is he talking about? He doesn’t have a clue. That’s just sad.” John Avlon's retort to Jim Acosta's comparison of former President Trumnp to what he called \"Fat Elvis\" during a CNN interview, as broadcast on May 2nd, 2021\n\n\n\nB [ edit ]\n\nI doubt it, although he did record \"Any Day Now\", and that’s one of those things where you think, “Great!”, and you hear it and it’s not so great. It was the same thing with Frank Sinatra and the Count Basie band, with Quincy Jones producing. They did \"Wives and Lovers\", which is in 3/4 time, but they did it in 4/4. I said, “Quincy, what happened?” He said: “The Basie band can’t play in 3/4.” Burt Bacharach's pompously ridiculous answer during an interview by Dave Simpson, a reporter from The Guardian on whether there were any great singers or musicians he'd wish to have worked with, or did work with, specifically Elvis Presley, Frank Sinatra, Count Basie and Quincy Jones, as published in the newspaper's May 25, 2016 edition.\n\n\n\nDid I? That was extremely immodest and foolish of me, my apologies. I would never dare to be so presumptuous. I am only interested in the legacy my father has left behind, and I would like to work towards giving it strength and respect for as long as I live. Indian entertainer and former politician Amitabh Bachchan's answer to a question posed by a reporter on whether he recalled his once saying that he would like to leave a lasting legacy in the world, to be a sort of Elvis Presley, as published on the \"Asian Age\" on May 13, 2018\n\n\n\nI'm living proof that Elvis was a pretty good driver. As innocent as the BMW 507 with its white paintwork might have looked, with a 150-horsepower V8 under the bonnet, it was something very special and Elvis drove like a maniac! Foot hard on the gas, then hard on the brakes, switching between lanes, slaloming between cars – it was like all hell had broken loose. (I was scared), and as a result wasn't quite able to enjoy the experience. The unvarnished truth is that I was just happy that we managed to get the car back to the dealership without a scratch on it. That short time I spent with Elvis was wonderful, though. The next day, I wrote to my mother , saying that I'd driven 100 miles up the autobahn with Elvis Presley. She thought I was kidding.” Gus Backus, a member of the racially mixed doo-wop group The Del Vikings, recounting for BMW Group Classic the time then Private Elvis Presley asked him (then serving with the US Air Force in Germany), to accompany him as he was test driving a BMW 507 in Frankfurt. It was after the test drive that Elvis ordered specifications be made on another BMW 507, the now famous BMW 507 chassis #70079 previously owned by German car racer Hans Stuck and which is currently housed at the BMW Museum after a two year multi million euro restoration.\n\n\n\nIn May of 1998 I was in the middle of an Elvis Presley obsession, so I went to Graceland. Everything about the place seemed awesome to me, from the giant Corinthian columns out front, to the purple and yellow room with three televisions built into the wall, to the big man’s grave out back. But what has stuck with me the most from the visit is a particular story about Elvis. Elvis had grown up poor, and I’m sure when he was poor money was important. But when he started to make more money than he could ever spend, or maybe just enough money to have every material thing he wanted, it no longer held importance to him. So, during a party at Graceland he was inside with a guest who came from a poor background, and the other partygoers were outside on the lawn. His friend commented on how sophisticated all of the partygoers seemed. Elvis walked over to his desk, pulled a stack of money from one of the drawers, opened a window, and threw the bills out the window. The partygoers scrambled after the bills, shoving each other, trying to grab as much money as they could. Elvis turned to his friend and said, “They’re not that sophisticated.” Brett Baker, for Chicago now, published on December 22, 2016.\n\n\n\ni) We can even hazard a little analysis as to what made his voice so appealing. \"That curious baritone,\" one critic called it. Actually, that is inexact. The voice had mixed propensities, hovering between tenor and bass and everything in between. Even a convincing falsetto lay within his range. One thing he was not, ever, was \"Steve-'n-Edie\", the polished, professionally accomplished Vegas artistes who once pronounced on an afternoon interview show (Mr. Lawrence enunciating the sentiment for himself and his partner/wife, Ms. Gorme), \"We don't really think of Elvis as a singer. But he was a star.\" It is only when, years later, one gets past the indignation of hearing such apparent ignorance, that the sense of the observation becomes clear. A singer is someone like Steve Lawrence rolling effortlessly (and meaninglessly) through a shlock-standard like \"What Now, My Love?\". More or less like doing the scales. A star is the persona in whom one invests one's vicarious longings, a being who is constantly hazarding — and intermittently succeeding at — the impossible stretches that every soul wishes to attempt but lacks the means or the will to. It's not a matter of virtuosity. ii) Take My Baby Left Me (1956) by Arthur \"Big Boy\" Crudup, the black Mississippi sharecropper whose That's All Right had literally been Elvis' first recording, in 1954. Crudup kept his blues in a bucket; Elvis put the lid on, and cooked; bar by bar, the song comes together; first comes D.J. Fontana's rapped-out drum riff, then a top-to-bottom run from Bill Black's stand-up bass, then the controlled gallop of Scotty Moore's lead guitar; then, last of all, Elvis singing in that imperious velvet growl of his, \"Yes, my baby left me! Never said a word\"; it is the most underestimated song in the canon; there is lightning in that bucket, and it could drive a train, any train. It literally took us into a new age. Endow a university! Elvis was a university. Whoever those mystics are who teach that the universe began with sound could use him as their full curriculum\" Jackson Baker, i) in \"Memphis Magazine\" (July 2002) ii) as published in \"The Memphis Flyer\", August 8-14, 1996 edition\n\n(1956) by Arthur \"Big Boy\" Crudup, the black Mississippi sharecropper whose had literally been Elvis' first recording, in 1954. Crudup kept his blues in a bucket; Elvis put the lid on, and cooked; bar by bar, the song comes together; first comes D.J. Fontana's rapped-out drum riff, then a top-to-bottom run from Bill Black's stand-up bass, then the controlled gallop of Scotty Moore's lead guitar; then, last of all, Elvis singing in that imperious velvet growl of his, \"Yes, my baby left me! Never said a word\"; it is the most underestimated song in the canon; there is lightning in that bucket, and it could drive a train, any train. It literally took us into a new age. Endow a university! Elvis was a university. Whoever those mystics are who teach that the universe began with sound could use him as their full curriculum\"\n\nHe was fantastic. When he danced, the people danced, the girls would actually faint because of what he was doing. The people didn't care if he was white or black, he was a good artist and they felt his music. Lavern Baker, commenting on her covering one of Presley's best early 60's songs, with a few changes in the lyrics, which she recorded in late 1961 as a answer to Presley's \"Little Sister\".\n\n\n\nPresley's voice was remarkable in the sense that, through it, he touched people in a way only great artists can do. (In fact), the people he touched are as diverse as humanity itself and, because of that his popularity has transcended race, class, national boundaries, and culture. There is no simple answer about why that is so, all I can say is he had that magic. When Elvis Presley was first popular, many people said that he did not have a good voice. Almost everyone, today, knows that he did, but more people today should see him not simply as a performer, but as an artist with a great soul. John Bakke, professor emeritus of the University of Memphis, in an interview with the US State Department, transcripted by UNUSINFO on July 18, 2006 on the legacy of Elvis Presley\n\n\n\nI don't think any two men on this planet ever had the charisma of Elvis Presley and Jackie Wilson. The two of them remind me of each other: the charisma Hank Ballard, rhythm and blues singer and songwriter, lead vocalist of the Midnighters, as noted in the book \"Jackie Wilson: Lonely Teardrops\" by Tony Douglas.\n\n\n\nWith him, it's the pictures that spoke loudest about the man behind the genius. Take Sunday Times photographer Chris Smith's classic shot in which a scowling Seve, handsome head turned from the driving rain, jacket held across his chest like a matador's cape, and he is curling his lip. It tells you everything you need to know about his mood, his game, and his grim determination to outfox the elements and annihilate his opponent. It's pure Elvis. About Seve Ballesteros, Spain's all time greatest golfer, as reported in the Sunday Times on May 8, 2011.\n\n\n\nThen, in 1954, Elvis happened. The influence that the softly spoken Mississippi native had on popular music – and in particular rockabilly – is incalculable. First billed as 'The Hillbilly Cat' (again a nod towards black and white influences), the boy with the seemingly rubber limbs sang both blues and country songs infused with elements of this new rockabilly movement to the bemusement of a music industry not yet aware of the significance of what they were listening to. They didn't know it at the time, but the music establishment had just changed forever. Two years later he signed with RCA and the ensuing exposure he received on national television introduced rockabilly to its widest audience yet and, like fire to kindling, there was no stopping its spread. Other labels swooped to sign up any artists who sang even vaguely similar to Elvis and there was a bona fide musical gold rush underway and record executives and studio bigwigs fell over themselves to capitalise on this musical trend which was now sweeping the nation – ultimately playing a big part in rockabilly's eventual downfall, as more and more people tried to make money from it, (thus) watering down its raunchiness as they tried to make it appear to as large a market as possible, and (finally) taming its sound beyond recognition. Excerpted from an article entitled \"The Roots of Rockabilly: Examining the origins of a rock n' roll movement\", by John Balfe, and as published in www.entertainment.ie\n\n\n\nI might be the biggest Elvis fan you've ever met. I mean, I've seen it all. And I just loved him. I don't know what it was. I mean, probably the same reason everybody loved Elvis. Cause he was electric. He was just electric, the greatest entertainer I've ever seen, and I think the reason why was because — and I heard him say it many times in interviews — , he always did what he felt. Genuinely did what he felt. It wasn't choreographed. It wasn't, OK, well, I'm gonna do this move at this time. It was coming up from inside of him, and it was coming out. That's what it was, and that's why people connected with it. Cause it was the real deal.” Country music songwriter and singer Frankie Ballard who, along with a few others, voted Elvis as the top entertainer in CMT Top 40 artist countdown, as published in CMT´s online edition of November 21, 2014.\n\n\n\nIt was the autumn of 1971, and two tickets to an Elvis show turned up at the offices of Creem magazine, where I was then employed. It was decided that those staff members who had never had the privilege of witnessing Elvis should get the tickets, which was how me and art director Charlie Auringer ended up in nearly the front row of the biggest arena in Detroit. Earlier Charlie had said, “Do you realize how much we could get if we sold these things?” I didn't, but how precious they were became totally clear the instant Elvis sauntered onto the stage. He was the only male performer I have ever seen to whom I responded sexually; it wasn't real arousal, rather an erection of the heart, when I looked at him I went mad with desire and envy and worship and self-projection. I mean, Mick Jagger, whom I saw as far back as 1964 and twice in ‘65, never even came close. Rock critic Lester Bangs's opening sentence in Elvis' obituary, by special request from and published by the Village Voice on 20 August 1977.\n\n\n\nI mean, don't tell me about Lenny Bruce, man – Lenny Bruce said dirty words in public and obtained a kind of consensual martyrdom. Plus which Lenny Bruce was hip, too goddam hip if you ask me, which was his undoing, whereas Elvis was not hip at all. Elvis was a goddam truck driver who worshipped his mother and would never say \"shit\" or \"fuck\" around her, and Elvis alerted America to the fact that it had a groin with imperatives that had been stifled. Lenny Bruce demonstrated how far you could push a society as repressed as ours and how much you could get away with, but Elvis kicked \"How Much Is That Doggie in the Window\" out the window and replaced it with \"Let's fuck.\" The rest of us are still reeling from the impact. Sexual chaos reigns currently, but out of chaos may flow true understanding and harmony, and either way Elvis almost single handedly opened the floodgates. Lester Bangs, \"Where Were You When Elvis Died,\" originally published in \"The Village Voice\", August 29, 1977. Republished in Psychotic Reactions and Carburetor Dung pg. 215-216\n\nthe window and replaced it with \"Let's fuck.\" The rest of us are still reeling from the impact. Sexual chaos reigns currently, but out of chaos may flow true understanding and harmony, and either way Elvis almost single handedly opened the floodgates.\n\nElvis' lowest effective note was a low-G, as heard on \"He'll Have To Go\"(1976); on \"King Creole\" (1958), he growls some low-F's; going up, his highest full-voiced notes were the high-B's in \"Surrender\"(1961) and \"Merry Christmas Baby\" (1971), the high-G at the end of \"My Way\" (1976 live version), and the high-A of \"An American Trilogy\"(1972); using falsetto, Elvis could reach at least a high-E, e.g, as in \"Unchained Melody\" (1977), so, it was very nearly a three-octave range, although more practically two-and-a-half. George Barbel, as a follow up to a question on what was Elvis' range, as published in All Experts.com, on 20th May, 2007.\n\n\n\nI have nothing to do with him and therefore no reply is necessary Brigitte Bardot's answer to a journalist who had been present at Elvis Press Conference at the Prince des Galles Hotel in Paris, on June 17, 1960, and where Elvis had stated he would welcome meeting her during what turned out to be his first of three US Army furloughs in Paris. Would she meet him? the journalist asked. As published in Briggite Bardot.net's August 16, 2017 edition.\n\n\n\nBy the time we got towards the end of our stay there, Elvis was worn out, so he got all the singers individually to do a song. Of course, all the musicians knew that I play and sang and they knew some of my songs. Elvis was obviously hesitating and thinking of something else to do, and Ronnie said: 'Let Bardwell sing'. He just went, 'Yeah, right ...'. And Guercio said, 'No, really. You wanna do something else, let him sing, because he can sing'. So Elvis went, 'Ladies and gentlemen, my bassplayer is going to sing now'. So Charlie Hodge gave me his guitar and I got Charlie's mike. Charlie was holding another mike on the guitar, for me to play it. And I didn't know what to do. I mean, how am I going to follow Kathy Westmoreland doing 'My Heavenly Father'? And Donnie Sumner said, 'Do the Hurricane song'. You know, 'Please Don't Bury Me' by John Prine. I got to the last verse of the song that's a bit off color. We were going from 'My Heavenly Father' to 'Kiss My Ass Goodbye', and it just took everybody by surprise. That was a really good moment, because I had shown Elvis a part of me that he didn't know of. He knew that what we had just done was show business, and it was good show business, because it was entertaining. I went back to the dressing room after the show, and Tom Diskin knocked on the door. We let him in, and he said 'I have a message for you from the Colonel' So I figured that I was fired when he sent Tom Diskin into the dressing room, but he said, He wants me to tell you that that's one of the funniest things he's ever seen at an Elvis Presley show'. I was thrilled with that. If I didn't do anything else I had done that. That was fun TCB Bass player Duke Bardwell's story of how how he got to sing John Prine's ‘Please Don’t Bury Me’ during the October 14th, 1974 closing show in Lake Tahoe, NV, in an interview with Arjan as published on the FECC Forum'spage.\n\n\n\nBaritones UnBound continues the second season of Asolo Rep's five-year American Character Project, an in-depth look at this nation and its people. No other voice has defined the United States quite like the booming sound of the baritone. From Sinatra to Elvis and much more, this musical journey chronicles some of the most beloved singers and songs of all time. Conceived by Broadway leading man and threetime Tony Award nominee Marc Kudisch and created by Merwin Foard, three dynamite baritones take the stage to give us a captivating musical tour of the baritone voice throughout history, namely Marc Kudisch, Jeff Mattsey, and Timothy Splain. Veteran singers Jeff Mattsey and Mark Delavan join Kudisch in an illuminating performance studded with classics from Broadway, opera and beyond. From Gregorian chants to well-known arias (“Ah! Per sempre,” “Largo”) including show tunes (“I am a Pirate King,” “Oh What a Beautiful Mornin’”) and popular music (“It Was a Very Good Year,” “It’s Now or Never,” and “Pretty Women”) Baritoners Unbound's 2015' Press Release, in an article entitled Celebrating the UnCommon Voice of the Common Ma\"n\n\n\n\nOur son's name would be Elvis.... Travis Barker, drummer for the band Blink 182, to his ex-wife Shanna Moakle, a former Miss USA, who expressed shock that Barker would tell his future bride to be Kourtney Kardashian, via an Instagram dated 9 November 2021, that he would choose that moniker due to its connection to the film \"True Romance\".\n\n\n\nAnother time we played with Herman's Hermits who were very popular. Frankly, we didn't rate them musically, but we were impressed when they told us about they having met with Elvis Presley, \"Elvo\" to us. And when they told Ian Anderson he sang like 'Elvo' he was very flattered and to this day the rest of the band and I always call Ian 'Elvo'!” Barriemore Barlow, drummer for Jethro Tull in an interview with Nick Dent-Robinson, recalling their attending Elvis' August 11, 1969 show at the International Hotel in Las Vegas on the special invitation of UK record producer Terry Ellis and as published on 03/04/2014 at the Jethro Tull Forum.\n\n\n\nIn 1956, I was President of his Los Angeles Fan Club and when I met him I noticed he had bad complexion and realized he wasn't perfect. So maybe it was a chance for me to make it in Hollywood (LOL) Gregg Barrios, award-winning playwright, poet, and journalist, from an oral history interview on June 21, 2016, San Antonio, TX.\n\n\n\nA few days before Christmas one year, Elvis was in the store buying guns for some of his friends as gifts. There was a customer off to the side looking at a display case that held nothing but expensive Browning over-under shotguns. Presley went up to the gentleman and commented on how nice the guns were. The man agreed, but said they were way out of his price range, since they were all probably in the thousand dollar plus area. Elvis asked the guy which one he would buy if he was purchasing, and the fellow said probably the Diana grade with the gold inlay. Elvis then went back to the counter where Jerry Knight was, and as he left said to Jerry, \"When that guy gets ready to leave, take that Diana grade shotgun out and put it on the counter and give it to him. Tell him Elvis said Merry Christmas.\" Jerry said he did just that, and he thought the guy was going to faint when he received the gift. Ken Barnes, who worked at Kerr's Beverly Hill's Sports Shop, as published by the Californian on December 13, 2017.\n\n\n\nNot only did Elvis give teens their own music with which to identify, he proved that much of the disposable income of this generation would be spent on music, fashion, and media of its own choosing and thus turning that generation into a high-pro!le, identifiable group with their own fashion sense, hair styles, slang, taste in music, preferences in movie stars and other favorite pastimes. Richard Barnet in his book The Story Behind the Song: 150 Songs that Chronicle the 20th Century. Westport, Conn.: Greenwood Press, 2004.\n\n\n\nI just come off the air and got a phone call telling me that they had just found Elvis dead, so I was in shock, as I thought for a moment that we had contributed to his death, minutes earlier having been, as I was, the first person to review the book that laid it all out. Moreover, given that people knew that I didnt make up stories and because of the large audience I had just reached in \"Good Morning America\", I thought that we may have had sent Elvis over the edge. I'll never know... Rona Barrett in the documentary The Definitve Elvis, The Memphis Mafia\n\n\n\nWhat's more, the asset class “fine art” is to investing,is what science fiction is to the rest of literature. The \"extreme\" characteristics of sci-fi and high-end art help teach investors—or readers—important lessons. Science fiction speaks to human nature, while art offers a window on the nature of asset markets. What then qualifies as \"extreme\"? Take Andy Warhol. In 1986, collectors could buy a Warhol \"Triple Elvis\" painting for about $200,000, but a \"Triple Elvis\" went for $81.9 million at auction in 2018. That's a 400-fold gain—an investor's dream. The average annual return of the \"Triple Elvis\" works out to about 20.6%. Pretty good. And there is nothing more fundamental to investing than returns. Barron's December 6, 2019 laud of the value of a \"Triple Elvis\" by Andy Warhol, as noted in an article entitled Don't Pay $120,000 for a Banana by Al Root. article entitled \"Other Investing Lessons From Art Basel\n\n\n\nWhile Elvis Presley and Roy Orbison were ruling the rock-pop charts in the US, he had everyone grooving to his music in Nepal. The song \"Deula yo joban timilai deula\" may have sounded similar to what was trending internationally, but was given a funky twist of his own, and arguably was responsible for introducing rock and pop to the entire nation. He became a heartthrob in his country and was soon called the Elvis Presley of Nepal because he came like a breath of fresh air in a music scene dominated by traditional tunes. About Kumar Basnet, as noted in the Kathmandu post's March 15 edition.\n\n\n\nOn the evening of the Oscars, with Austin seated next to me, I understood intimately what he felt when it was time to learn if he would climb those stairs to the stage. So, I took his hand and held it softly as the winner was announced. Although his name wasn’t called, Austin is no less a winner. The time had come for Austin to say goodbye to Elvis as he began to embrace an infinite universe of possibilities as an actor. I can’t wait to see what he brings us next. Excerpt of Angela Bassett's laud of Austin Butler, who as a result of his lead role in Baz Luhrmann's \"Elvis\", was listed as one of TIME Magazine's 100 most influential people in the world in 2023, as published on the said magazines' April 13, 2023 edition.\n\n\n\nHis generosity.. Natasha Bassett's reply to a reporter asking what in her view defines Elvis the most, as beamed live on May 25, 2022 at the opening of ELVIS, at the Cannes Film Festival\n\n\n\nHe started drawing on my front all the way down to my navel, doodling as I spoke to him, in front of hundreds at his dressing room after his August 1970 opening show at the International Hotel in Las Vegas. Incredible sensation, he used a biro!!! That night back at my hotel, alone, I undressed and there they were, the doodlings. I did not wash until they wore off... Shirley Bassey, as told to talk host Graham Norton.\n\n\n\nAs Jack Wilshere completed his first 90 minutes in the Premier League for Arsenal in over three years, and was arguably their best player in the 0-0 draw at West Ham's London Arena on Wednesday evening, \"A Little Less Conversation\", the song by Elvis Presley, was the tune that played the players off the pitch, the lyric urging for \"a little more spark\" a fair assessment of the game. But it is the line about the need for \"a little less conversation, a little more action\" that best sums up his situation at Arsenal... Adam Bate, one of Sky Sports top anchors, assessing Wilshire's performance for his network, in an article published on December 11, 2017 ( Since Elvis' \"The Wonder of you\" is the song played at Arsenal's Emirates Stadium before players enter the field this could explain West Ham fans' decision to play \"A little less conversation\" when they, in turn, feel their own team needs to improve its play).\n\n\n\nHe had a musically textured rhythmic voice that had emotional intelligence; concentrate on his voice: sweet, remorseful, defiant, suggestive. Eileen Battersby, literary correspondent, citing the reasons for her being hooked on Elvis after \"discovering\" him inadvertently as she changed the dial looking for her favorite classical music radio station, as published in the \"Irish Times\" in August of 2002.\n\n\n\nRonnie James Dio, Bon Scott, Bruce Dickinson and Elvis Presley.. Blaze Bayley, lead singer of the heavy metal band Iron Maiden, citing his biggest musical influences in an article published in Metalcastles's February 29, 2020 online edition.\n\n\n\nIn \"Mystery Train\" (1955), he rocks out with an astounding depth, Elvis' voice never sounding so rich, nor so pleading; best of all is his final spontaneous laugh & whoop of excitement, worth its weight in gold. Review of the CD \"Elvis at SUN\", by Piers Beagley, as published in EIN, on 30th June, 2004\n\n\n\nImagine Beatty in the Paul Newman part and you can kind of see it, but what about the Redford part? Apparently, Redford wasn't cast yet and Beatty had a mighty strange idea for his co-lead. Yes, that's right, he wanted Elvis Presley. Ultimately, though, Beatty did not appear in the film, reportedly because he found the two-hander was too similar to his recent \"Bonnie and Clyde\". Now, picturing Beatty and Elvis in those parts is a fascinating \"What if?\" but what the public got was probably the best possible version of that movie... About Warren Beatty having chosen Elvis as his co-star in Butch Cassidy and the Sundance Kid, a movie which he later passed on, in an article by Eric Vespe entitled \"Butch Cassidy and The Sundance Kid could've starred Warren Beatty And Elvis\" as published in the November 8, 2022 edition of Slash Film\n\n\n\nThey are two equivalent beasts even with their differences. Diego Maradona is Elvis Presley singing 'My Way' at his last concert at the Market Square Arena in Indianapolis. He embodies the deity, the absolute power, the sunset, the snowy peaks and the abyss. And Lionel Messi is Paul McCartney, the long-play list, the continuity and the health. To ask one of them to have what the other has doesn't look to be a proof of social intelligence but one of galloping dissatisfaction of a country that doesn't conform with having two of the three best footballers in history in less than 40 years. Argentinean novelist Juan José Becerra, in an article published in July of 2016 at El Clarin, his country's most prestigious newspaper.\n\n\n\nI'd have been off playing with my bow and arrow or something and Cliff Gallup had a big impact on me too, of course, but the Elvis stuff was the real start of it. It was the rocket ship taking off for a whole bunch of us Jeff Beck, explaining how after hearing his older sister's 78rpm record of \"Heartbreak Hotel\" the idea of becoming a musician instantly popped into his head, as stated in an article in Guitar Player Magazine's July 1997 issue.\n\n\n\nI met Elvis in 1968 at the Aladdin Casino in Las Vegas and had a drink with him. A lady asked him for an autograph but he didn't have a pen, so I gave him mine. Then he gave me the pen back and that's when I said, “Naw, you keep it Elvis. I don’t think anyone’s going to be asking for my autograph. William O. Beck, in an interview with Jeff Sterling for the Titusville Herald, and published on August 13, 2018.\n\n\n\nElvis is right up there with death and taxes in things that can't be avoided, Writer Joel Beers, reviewing the 1968 NBC TV Elvis Special for OC Weekly, on January 4, 2018.\n\n\n\nI was scared of him when I was a child. He was very sexual. There was something — the sexual vibe of Elvis was out there, big time. Joy Behar, who was 14 in 1956, speaking about his feelings for Elvis, as director Sofia Coppola stopped by her show, to talk about her movie \"Priscilla\", as broadcast on October 31, 2023.\n\n\n\nLike some sort of Grammy-powered \"Super Friends\", John Legend, Post Malone, Jennifer Lopez, Blake Shelton and more than a dozen more artists joined forces on February 17, 2019, for a prime time television special titled “Elvis All-Star Tribute\". The union of Post Malone and Urban demonstrated that — for Elvis Presley Enterprises, at least — the show's mission, in large part, was to affirm the idea of Elvis' universal appeal. Adam Lambert wore a blue suit and blue suede shoes during his version of \"Blue Suede Shoes\", while Jennifer Lopez went full J.Lo during \"Heartbreak Hotel\"- Another highlight was Mac Davis' solo rendition of \"Memories,\" a song he wrote for the original 1968 special. Davis, 77, the elder statesman amongst the performers (beating John Fogerty by four years), shared a poignant memory of holding the then infant Lisa Marie Presley during a visit to Elvis' Bel Air home. He later was joined by John Legend, who sang a Davis composition that has emerged as one of Elvis' biggest posthumous hits, \"A Little Less Conversation.\" Others on the show included Darius Rucker, Ed Sheeran, Kelsea Ballerini, Alessia Cara, Josh Groban, Pistol Annies and Little Big Town. Lisa Marie did not perform, but introduced a gospel medley segment featuring Carrie Underwood and Yolanda Adams; similarly, actress Riley Keough, Lisa Marie's only daughter, introduced Dierks Bentley, who contributed with the rocker, \"Little Sister\". “I’m here tonight because 50 years ago a King returned,” said Shelton, host of the program and — not coincidentally — a judge on the hit NBC vocal competition program, “The Voice.”, then adding that the original special had been often imitated but never surpassed while, in addition changing, as it also did, the game forever in music and television. John Beifuss, writing for the Commercial Appeal in an article entitled \"Post Malone, J.Lo, Blake Shelton: The Elvis '68 Comeback comeback\",as published on their February 18, 2019 edition.\n\n\n\nDifferent as our sounds were in 1956, I could see that we were in parallel tracks, Elvis was interpreting one kind of black music, R&B, while I found my inspiration in black folk songs, spirituals and calypso. ( A year passed, and while in Las Vegas) Elvis came backstage to say hello and he couldn't have been more decorous, insisting in calling me Mr. Belafonte. Only later would I learn that he had hung out for years with a lot of black musicians and had come by his style legitimately. (Alas), he performed with such put on flash that over the next years, I noticed, he inspired a whole generation of R&B players who thought they could put that flash on, and become Elvis, too.. Harry Belafonte in his autobiography, My song, published in 2011.\n\n\n\nI have been following the sound of my own voice since childhood, growing up in a family of academics in Knoxville. I spent my formative years playing air guitar while listening to the monolithic stereo console in my parents. My first concert experience was seeing an Elvis Presley in Knoxville. I was just about four years old but have some vivid memories of holding my parents' hands and people screaming, so it was kind of scary. I also remember him doing ‘Hound Dog’ and ‘Teddy Bear.’ And ‘Teddy Bear’ was such a favorite at the age of four that I brought out a big styrofoam guitar for it. Brian Bell, discussing the effect seeing Elvis show in Knoxville, on April 8, 1972 had on him, for Live4ever, published on April 15, 2007.\n\n\n\nI knew Elvis getting the bug to entertain, singing gospel music for the congregation in his own church, but there was something that was more important to him. It was black music. He wanted to be a gospel singer the way the black people sang. Long back, he'd sing to a broom, pretending it was a guitar. We thought he was crazy.... Sam Bell, Elvis' closest African American childhood friend in East Tupelo, MS, and the main source for Director Baz Luhrmann's research on Elvis' pre-teen years for his 2022 movie Elvis, in an interview taped in Memphis, TN in December of 2020\n\n\n\nMy favourite song of all time? I like Elvis' \"Love me\". Jude Bellingham,in an Mackenzie interview brooadcast on June 28, 2024.\n\n\n\nOne evening, it's said he rocked around the clock all night before disappearing into one of the rooms along with eight eager Bunnies. What happened behind closed doors remains a mystery, but Hugh Hefner was apparently so impressed that he named the spot 'The Elvis Room'. Alex Belloti, in an article entitled \"Playboy mansion secrets – ghost sightings, Elvis' wild night with Bunnies, 'sex rituals\" as published in the Daily Mirror's August 6, 2021 edtion.\n\n\n\nThe whole exhibition is focused on artists that I’ve listened to at some point in my life who represented something. Lana Del Rey, I was listening to her a lot when I was around 14, and that was really the start of me developing my own taste in music. Adele, she’s iconic as well, and a lot of people would recognize that album. Elvis Presley too — he’s a huge artist. So I wanted the album (cover) to be recognizable, but also for the Western artists to be big, just to show how important these Arab artists are as well.” Zineb Belrhiti, the UAE's top album designer, telling the Arab News why she chose Elvis images as well as those of Lana del Rey and Adele as inspiration for the album covers of Arab artists, in an article published on August 5, 2021.\n\n\n\nElvis Presley is undeniably one of the most iconic and influential figures of the 20th century. Bendigo Art Gallery's Curator Lauren Ellis' laud of Elvis, as noted in Scenestr's March 28, 2022 edition.\n\n\n\nDid you ever meet Elvis Presley? Pope Benedict XVI's question to the then terminally ill Irish comedian Frank Carson, who, in 1987, had been ordained with a Papal knighthood of the \"Order of St. Gregory\" by the now Saint Pope John Paul II. The then sitting Pope's interest, expressed some 30 years after Presley's death, may lie in the fact that he was stationed, as a young professor within the German priesthood at a town not too far from Presley's barracks during his 18 month stay in Germany with the US Army. Carson's zany reply to the Pope? \"Not yet, your Holiness, but I soon will\", (Published in the Belfast Telegraph on August 10, 2017).\n\n\n\nI think she's going to become as big as Elvis Presley. He was, incidentally, the handsomest guy I ever met in my life, and a very nice person too. Tony Bennett, referring to singer, songwriter, and actress Lady Gaga in an article on Billboard published on August 17, 2011 and during an interview with the Guardian, on 17 October, 2013.\n\n\n\nI remember the first time in '56, I saw Elvis. I'm like, I'm buying that record because it's just the look that gets you, it's almost as much as the music. I kind of always had this theory that you look and listen with your eyes and your ears at the same time. He was the first rock 'n roll artist I loved. In my life, I started with him, but as I got into music, Elvis and the Rolling Stones led me to blues. Bill Bentley,American music industry executive in an interview with Salon, published on May 25, 2018.\n\n\n\nI listen to a lot of Elvis on the school bus. My bus driver, Ken Lyons, is — was, he's not with us anymore — but he's the biggest Elvis fan. So Channel 13 on SiriusXM radio, many, many nights listening to Elvis Presley and him educating me on Elvis. He's great, he's one of a kind. You can label him however you want to, but his country career was unbelievable. He had a voice that even if you didn't see all the moves and how good looking he was and all that stuff, you just listen to his voice when he's on the Louisiana Hayride with Faron Young and it's like, 'Wow, his voice is really unbelievable.' Great singer. And lot to learn.\n\nDierks Bentley, in an interview with popculturecountry and published on their February 15,2019 edition.\n\n\n\ni) New Eminem diss!! ‘RAP ELVIS’ If he don’t respond in 48 hours he’s cancelled,“ ii) ‘Rap Elvis’ already destroyed him. mI already killed him with ‘Rap Elvis.’ Where’s he at? Where’s the response? I want to battle him face-to-face. I think he’s overrated and sucks as a rapper.” Benzino, dissing Eminem i) in an Instagram following his release of a song entitled \"Rap Elvis\" which he launched on January 31, 2024 and ii) in another instagram dated 24 February, 2024.\n\n\n\nThe reason I chose Elvis Presley' songs as the teaser for this article is to trigger some autobiographical memories for adults who were adolescents when his music topped the charts, which he dominated throughout the 1950s. Hopefully, these songs will inspire older adults, baby boomers, and people of all ages to get up from your chair and dance.... Christopher Bergland, activities of daily living in an article entitled ̊\"One More Reason to Keep Dancing̊\" as published in Psychology Today's December 19, 2018 edition.\n\n\n\nAppropriation, then, has something to do with intent. When another culture's property is exploited for profit, that's appropriation, and it's always deserving of criticism. Elvis was just being Elvis. In \"Elvis Presley:The Searcher\" an HBO documentary, its signal achievement is in showing how the singer's early years, family culture, and socioeconomic background made inevitable the musician he was to become. It makes clear that he was, first, and foremost, a committed artist, utterly dedicated to music and its ability to move people. Robby Berman, as published on the Big Think's April 19, 2018 edition, in an article entitled \"Was Elvis Presley a cultural appropriator of black music?\n\n\n\nFernest Acernaux was not playing zydeco on that accordion, it was rhythm and blues. And you couldn’t make it playing French, so we played blues and rock ‘n’ roll from Fats Domino, Bobby Blue Bland and Elvis Presley. Rod Bernard, celebrating his 72 years of pioneering \"swamp pop\", which combines New Orleans-style rhythm and blues, country and western, and Cajun and black Creole music, as ´published in the Daily Advertiser on November 6, 2017.\n\n\n\nNext stop was the Sun Studio. It was not the old one at 706 Union Avenue, by many considered the birthplace for the post war youth culture. Even if Elvis Presley was the most talented artist of his generation, had he not been born, someone else sounding similar, but not as good, would have probably surfaced in another town and in another studio. Talking about Elvis, it was six days before I arrived in Memphis and tried to meet him, albeit unsuccesfully, that I had actually seen Michael Jackson and the Jackson Five in Chicago. Since we had been sharing the same dressing room after their performance, I could have been the first person to tell Elvis that I had met his future son-in-law, later to be married to his then unborn daughter Lisa Marie.. Jonas Bernholm in his book Soul Music Odissey\n\n\n\nElvis is the greatest cultural force in the twentieth century. He introduced the beat to everything, music, language, clothes, it's a whole new social revolution – the 60's comes from it.” Leonard Bernstein, as told to TIME founder Henry Luce's top aide Richard Clurman in an article published by TIME on August 10, 2017.\n\n\n\nDescribe Elvis Presley? He was the greatest there ever was, is, or ever will be. We did not have the airwaves he had, but he delivered what he obtained brilliantly. Let me conclude by saying that I realized during those early years that Elvis and I were creating a new sound. When I heard on the radio that he had died, I had to pull my car over to the shoulder of the road as I couldn't believe the initial reports. Elvis's art was a unique art, his style influential enough to be copied by many. But, no one can copy his. The one thing Elvis had that no one else had was THAT voice Chuck Berry as published in http://www.elvis.net/whattheysay/theysayframe.html as noted in Harry DeWitts Elvis, the Sun years, and In a AugusT 18 of 1977 phone interview\n\n\n\nEventually, everybody has to die, except Elvis. Dave Berry, as published in http://www.elvis.net/whattheysay/theysayframe.html\n\n\n\nWe all had similar tastes in the band it seemed. I don't remember the first album I bought but the first record I got was Hound Dog by Elvis.And of course, everybody listens to Elvis now and then. Pete Best,the Beatles' first drummer, in an article published on May 4th, 2015 in which he was asked what was the first record he bought and whether he still listens to Elvis 40 years after his death.\n\n\n\nWelcome to the \"Veranda Suite\", Elvis Presley used to stay here... The Beverly Wilshire Hotel's Front Desk introduction to room 1001 on the 10th floor, which highlights a rooftop yurt purported to provide its guests with a one-in-a-million urban glamping experience right in the centre of the city of Los Angeles, as detailed in an article in the Telegraph on February 21, 2018.\n\n\n\ni) When you think of Vegas, of show business, of flash, of those performances, you think of Elvis. He is iconic; a lot of performers today look to that for inspiration ii) You have to have soul to sing like Elvis, and Elvis had soul\" \" Beyonce, i) as published in www.graceland.com and ii) Elvis Viva Las Vegas documentary.\n\n\n\n\"Cant's help falling in love\" it shall be About Jeff Bezos' decision for that 1961 song from Elvis' 1961 \"Blue Hawaii\" to open the festivities in connexion with his wedding Lauren Sanchez on June 27, 2025, as sang by Italian tenor Matteo Bocelli and as published in Vanity Fair's June 28, 2025 edition.\n\n\n\nElvis Presley movies – I'm a big Elvis fan – although I don't think you should feel guilty about pleasures. UK comedian Sanjeev Bhaska's answer to a question on what is his biggest guilty pleasure, in an interview with the Mail Online published on July 29, 2018.\n\n\n\nWhen they asked me where I would want them to place my statue, I said I wanted it to stand between the figures of Elvis Presley and Michael Jackson, Asha Bhosle, Superstar singer from India, on what she told the Madame Russaaud people in London on the day her statue, only the second from a woman from her country, was unveiled,as published on INDIARV's online website on October 2, 1917.\n\n\n\nThis is a case produced by the Thai Nakorn company, the best silversmiths in my country and as you can see, it reads “To Elvis Presley Hollywood 1960” with my special dedication to you, Sir, reading \" “King Bhumibol Adulyadej to the King of Rock ดnด Roll”-- King of Thailand Bhumibol Adulyadej's words while gifting Elvis with a silver case, on the ocassion of their meet-up at the Paramount Studios in Los Angeles, CA, on June 21,1960, and as published by the Pataya Mail on February 19, 2023. Incredibly, a decade later, Elvis gifted that unique combined lighter and cigarette case to an English teacher by the name of Ursula Adelaide Aylmer Nixon, who kept it until she passed away in 2021 at the age of 92, with her family then deciding to offer it for auction on 2 April 2023, where it sold for $70,000.\n\n\n\nElvis Presley is the pivotal figure in our story about a spectacular house where everything is questioned to subvert the traditional view of private space, which becomes a stage.' Alberto Biagetti, commentong on the Atelier which bears his name's forthcoming exhibit which challenges the idea of domestic space while painting a psychological portrait of a generation whose most private moments are not private at all, and as published in Wallpaper's April 17, 2023 edition.\n\n\n\nElvis Was A Democrat Joe Biden's ad, as circulated before the 2020 Presidential election.\n\n\n\nIntensity of communication, emotion, how the fusion of poetry is related to me as a listener. I'm disappointed by the bland and perfect vocal accomplishment, which I hear on so many recordings. Which is not to say that classical singers shouldn't try to become vocally masterful. I take my cue more and more from good pop singers. The other day I was looking at an early concert of Elvis Presley. It was fascinating to watch, the body language, the vocal suppleness Conor Biggs, Irish bass/baritone and classical singer, a founding member of Psallentes, a Gregorian chant ensemble, explaining to Michael Dervan, of the Irishman, for tips he looks for in a recital, as a way to better communicate with a listener, as published on that paper on February 1, 2013\n\n\n\nIn late 1959, Ibn Saud, the then King of Saudi Arabia. was spending time in Germany for medical reasons. One of his sons was a huge Elvis admirer, giving him a precious garment with golden applications, a waterpipe and a tea set with the royal crest on it, as a thank you gesture for his having left the Grunwald Hotel so that his father and his entire entourage could make total use of it. Soon after posing with the garment for the King's son at his newly rented house on #14 Goethestrasse, his friend and fellow GI Charlie Hodge had a zany idea: why couldn't he go out and walk in front of the German people, or anyone, for that matter, using the garment so as not to be recognized. This was finally done on February 1960, as he took a cab to the \"Mainzer Karneval\", a big public party, staying there for 3 days in the nearby town of Mainz which was not far from Bad Nauheim. And nobody noticed the by then Sgt Elvis Presley, in spite of him being accompanied by Hodge, plus two bodyguards all dressed as sailors as well as by a mysterious girl from Bad Nauheim, who did the translations. Elvis joined the whole programme, the clubs, the pubs, the bars, parades but stayed sober. The others did not, LOL. but they all returned safe, late at night. As published by BILD, Germany's highest selling tabloid, in an article published in March of 1960.\n\n\n\n(For) Mississippi: Elvis Presley. He served as perhaps the most important figure in the mainstream popularization of early rock, his Billboard chart legacy being equally astounding. He's scored 109 Hot 100 hits between the chart's start in 1958 and 2020 (!) and boasts the most charted albums in the archives of the Billboard 200 albums chart. Simply, he's still the King of Rock & Roll. Billboard,in an article focussing on the top 50 US artists from each of the 50 states of the Union, as published on their July 4, 2020 edition\n\n\n\nSo I said \"Why don't we turn out all the lights so we don't see this vast empty looking studio the size of a football field and make it as intimate as we can?\" We could barely make Elvis out through the glass from the control room into the studio when we cued him the backing-track. And then, Elvis started to sing. It was magic,. Next thing I know he's curled on the floor in almost a fetal position singing with a microphone next to his mouth. The hair on my arms were standing up. And that's the take that we wound up using on the soundtrack album. I did not use it in the TV show because I'm a total believer that if you're doing television I don't want anyone lip-syncing. I want the real thing. And to be completely honest, as great as the sit-down shows are, had I been able to get cameras and tape him there, it would have been even greater. I never put anybody I worked with on a pedestal, yet the first time I saw him, I was awed, first of all, by the way he looked. If he was not famous, you would still stop and stare. As a director, you're looking to see which is the good side, the bad side. Elvis was perfect from every angle. It was like a god walking in towards me... Steve Binder, director of the 1968 NBC/TV Special explaining how Elvis recorded \"If I can dream\", on June 23, 1968, exclusive for The King's court, on February 6, 2010, as well as in an interview with Vanity Fair published on August 17, 2018.\n\n\n\nHis privileged access let him show Muhammad Ali away from the ring: preaching or sleeping, posing with black leaders like Malcolm X and James Meredith or playing with his children or with Elvis Presley. About Howard Bingham, the photographer who took an estimated 1 million pictures of Muhammad Ali over more than 50 years while becoming one of the boxer's closest friends, as published in his obituary in the Seattle Times, on December 23, 2016\n\n\n\nTime magazine at the turn of the century asked its readers to tell them who they thought was the person who contributed most to the 20th century. Well, obviously people said Martin Luther King Jr, others said Nelson Mandela and Elvis Presley. But who do you think was chosen? Einstein, whose books I saw being burned in 1933... Journalist and Holocaust survivor Walter Bingham\n\n\n\nI’m a kid of the ’60s. When I was growing up I used to love going to see Elvis Presley in the cinema. I’m still a big Elvis fan. They’ve rehashed some of his music, with Elvis singing, along with the Royal Philharmonic Orchestra. Really incredible, so beautiful. Myself and my wife actually played one of the songs – And The Grass Won’t Pay No Mind – at our marriage ceremony, as we were walking into the registry office. Irish Journalist Charlie Bird in an interview with the Irish Examiner as published on their March 11, 2021 edition.\n\n\n\nThe Elvis effect, resulted in a lot more people getting poliovirus vaccinations. We need a series of ‘Elvises’ to promote vaccination for COVID-19 protection Pamela Bjorkman, structural biologist at the California Institute of Technology, in an article published by USA Today's April 19, 2021 edition.\n\n\n\nCilla would record and perform Beatles numbers throughout her career, but in the 60s and up to the mid-70s, she did more than most. Her renditions of \"Yesterday\", \"For No One\", \"Across The Universe\" and others became big favourites with radio DJs, not to mention with The Beatles, who always liked the way she interpreted their material. Previous praise from Randy Newman, for her take on one of his songs had been sweet music to her ears. And just imagine how she felt when Paul McCartney said to her that her \"Long And Winding Road\" was the song's definitive version. She had, however and this to her dying day, something to be immensely proud of – Elvis Presley had her \"You're my world\" on his famous jukebox at Graceland. About UK singer Cilla Black, in an article published at the Sunday Post̪'s December 28, 2018 edition but which nevertheless fails to highlight that it was her \"You're my world\" which was actually being played at Elvis' jukebox when the Beatles visited him at his 525 Perugia Way home in Bel Air, California on August 27, 1965.\n\n\n\nI was in a friend's studio when a buddy of his called and told him. 'I got some news for you. Do you want me to tell you now or later?' I said later because I was in the studio when President Kennedy was killed and also when Martin Luther King was killed, so I knew the effect bad news can have on a session. When the session was over he told me and I thought he was joking and it didn't hit me until I lay down to sleep. The one other time that I experienced that was when my mother and my son died. It wasn't because he wouldn't he doing any more of my songs. It was like a piece of the whole business. I mean some people you just figure are never going to die. Inside, they'll always live. When they're gone, a certain piece goes and you just can't believe it. Reaction of Otis Blackwell, the African-American songwriter, singer, and pianist, whose work significantly influenced rock and roll, to the death of Elvis Presley\n\n\n\nHe would probably be considered a baritone, but he could reach notes that most baritone singers could not. Much of his abilities emanated from a very intense desire to execute a song as he wanted to do it, which meant that he really sang higher than he would normally be able to. When the adrenaline is going, and the song is really pumping, you can get into that mode where you can actually do things, vocally, that you couldn't normally do. So he had a tremendous range because of his desire to excel and be better, and that's why he could do a lot of things that most people couldn't. Terry Blackwood, lead singer of the Gospel group, the \"Imperials\".\n\nsang higher than he would normally be able to. When the adrenaline is going, and the song is really pumping, you can get into that mode where you can actually do things, vocally, that you couldn't normally do. So he had a tremendous range because of his desire to excel and be better, and that's why he could do a lot of things that most people couldn't.\n\nThe moment he walked in, it was almost like all the guys there were bowing down to him, but he didn't care whatsoever. It was an amazing time, because the electricity just floated through the air. Everybody there was on cloud nine but he just acted the way a country boy would act. Elvis was truly a gentleman and a sweetheart of a guy. Drummer Hal Blaine, telling Rollingstone what it felt like to be with Elvis in the studio during the taping of 1968 NBC special, and in an article published on August 16, 2017.\n\n\n\nMy grandmother, known as Ms Topp at the local public school, lived on Church Street. She taught Elvis Presley music and I'll tell you a funny story about it. Years later when I asked what he was like, she said ‘Oh you know, he really was a sweet boy but he didn’t have a lick of talent’ so that tells you something about how we judge talent in our family that's for sure,” LOL. Marion Blakey, former head of Rolls-Royce North America and of the Federal Aviation Administration, recalling what she calls her \"first claim to fame\", in an interview to Tupelo's Daily Journal published on October 31, 2018.\n\n\n\nRecord producer Phil Spector, who is currently serving his sentence for the 2003 shooting death of actress Lana Clarkson,finally settled his divorce with his third wife, Rachelle Short. In the settlement, signed December 4, 2018, they are forced to sell their infamous castle and evenly divide the proceeds, while she keeps many of her vehicles, most notably a 2015 Aston Martin Vanquish and even a small aircraft. He, on the other hand, keeps his various Grammy Awards, Gold and Platinum Records, a 1965 Rolls Royce Silver Cloud III and John Lennon memorabilia, including an electric guitar and a lithograph, as well as a pair of diamond cufflinks gifted personally to him by Elvis Presley. Blast magazine, in an article entitled \"Phil Spector splits castle with ex-Wife, keeps diamond cufflinks from Elvis in divorce settlement\", published twenty days after it was finalized, in an article published on December 24, 2018.\n\n\n\nFrom Thursday to Sunday, fans traveled in a mob mentality with Tiger Woods, sprinting from hole to hole and emphatically yelling “He’s like Elvis Presley,” and, “We want to roar with you, baby!” along the way. It was the “Walking Dead” meets “Caddyshack.” A strange combination.. but the truth. Jon Blauvelt, recalling the way Tiger Woods captivated the attention of thousands upon thousands of people who stormed upon Ponte Vedra Beach for the sole reason of watching him play, as published in the Ponte Vedta Reporter on May 13, 2018.\n\n\n\nBut better Elvis should pay those multi-millions in taxes (thereby doing as much for the War on Poverty) than you or I. \"If his manager\", said Goldman, \"had sheltered his income from the taxman and invested it intelligently, Elvis Presley could have been as wealthy as Bob Hope\". Well, I ask you. But I think we can be grateful to Elvis for his grin, his pelvis, his leap, and for the punky, biracial, engaging, ineluctably erotic and still mysterious tenor of his voice. Roy Blount Jr., reviewing Albert Goldman's Elvis, for the NYT in 1981. See also Kelly Phillips Erb's essay on Forbes, focusing on Elvis being his country's highest personal taxpayer for almost a decade.\n\n\n\nHe had an amazing charisma, was so passionate about what he did, and the people could feel it. James Blunt in a 1997 filmed interview\n\n\n\nI remember well the afternoon when Elvis Presley and his mother came into the Tupelo Hardware. He wanted to buy a .22 rifle and his mother wanted him to buy a guitar. I showed him the rifle first and then I got the guitar for him to look at. I put a wood box behind the showcase and let him play the guitar for some time. Then he said he did not have that much money, which was only $7.75 plus a 2% sales tax. His mother told him that if he would buy the guitar instead of the rifle, she would pay the difference for him. The small amount of money that he had to spend had been earned from running errands and doing small jobs for people. Forrest L. Bobo, of the Tupelo Hardware store in Tupelo, MS, in an affidavit written in 1979 where he confirmed the details of the purchase of Elvis first guitar, a 1940 Kay model, paid for by both Elvis, with his savings, and his mother, for his eleventh birthday and on January 8, 1946.\n\n\n\nThere is no denying that Elvis had a great talent. He possessed a pliant voice with extensive range and a soft and enveloping timbre. Plus, he was an extremely charismatic person. It’s curious that the two songs of his I sing the mosthave a long history behind them. In both cases, Elvis' versions are extraordinary and memorable. Yet I have the wishful thinking that I too had something to say, to add, artistically speaking, to the performance of these classics. The melody of \"Love Me Tender\" comes from a sentimental ballad from the time of the American Civil War. It’s a song with roots that go back to the 1800s. As for \"Can't help falling in love\" the melody is even older, being taken from a very famous Romanza composed at the end of the 18th century, Plaisir d'amour, a well-kno", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/Elvis_Presley_-_Modern_Screen%2C_June_1958.jpg/250px-Elvis_Presley_-_Modern_Screen%2C_June_1958.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/ELVIS_light_name_-_Rock_and_Roll_Hall_of_Fame_%282014-12-30_11.57.41_by_Sam_Howzit%29.jpg/250px-ELVIS_light_name_-_Rock_and_Roll_Hall_of_Fame_%282014-12-30_11.57.41_by_Sam_Howzit%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/LVMPD_Electra_Glide_on_Lone_Mountain_Rd_During_Taffic_Control_%282%29.jpg/250px-LVMPD_Electra_Glide_on_Lone_Mountain_Rd_During_Taffic_Control_%282%29.jpg", "https://en.wikiquote.org/static/images/icons/wikiquote.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Elvis_Presley-_Billboard_ad_1956.png/250px-Elvis_Presley-_Billboard_ad_1956.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Wikipedia-logo-v2.svg/60px-Wikipedia-logo-v2.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/1957_Chevrolet_Bel_Air_Sport_Sedan_-_front_left.jpg/250px-1957_Chevrolet_Bel_Air_Sport_Sedan_-_front_left.jpg", "https://en.wikiquote.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Elvis_Presley_-_TV_Radio_Mirror%2C_March_1957_02.jpg/1200px-Elvis_Presley_-_TV_Radio_Mirror%2C_March_1957_02.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Elvis_Presley_-_TV_Radio_Mirror%2C_March_1957_01.jpg/250px-Elvis_Presley_-_TV_Radio_Mirror%2C_March_1957_01.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/62/Elvis%27_tomb.jpg/250px-Elvis%27_tomb.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Juliet_Prowse-Elvis_Presley_in_G.I._Blues.jpg/250px-Juliet_Prowse-Elvis_Presley_in_G.I._Blues.jpg", "https://en.wikiquote.org/static/images/mobile/copyright/wikiquote-wordmark-fr.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Elvis_Presley_promoting_Jailhouse_Rock.jpg/250px-Elvis_Presley_promoting_Jailhouse_Rock.jpg", "https://en.wikiquote.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Commons-logo.svg/60px-Commons-logo.svg.png", "https://en.wikiquote.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Elvis_Presley_-_TV_Radio_Mirror%2C_March_1957_02.jpg/250px-Elvis_Presley_-_TV_Radio_Mirror%2C_March_1957_02.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/President_Trump_Presents_the_Medal_of_Freedom_to_Bob_Cousy_%2848602861216%29.jpg/250px-President_Trump_Presents_the_Medal_of_Freedom_to_Bob_Cousy_%2848602861216%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Elvis_Presley_-_TV_Radio_Mirror%2C_March_1957_02.jpg/1200px-Elvis_Presley_-_TV_Radio_Mirror%2C_March_1957_02.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikiquote.org/wiki/Elvis_Presley", "title": "Elvis Presley", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.3", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Elvis_Presley_-_TV_Radio_Mirror%2C_March_1957_02.jpg/1200px-Elvis_Presley_-_TV_Radio_Mirror%2C_March_1957_02.jpg", "width": 1200, "height": 1196}, "title": "Elvis Presley - Wikiquote", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikiquote.org", "summary": ""}