{"url": "www.nydailynews.com/entertainment/gossip/sofia-vergara-joe-manganiello-slam-report-claiming-broke-article-1.3136416", "text": "Sofia Vergara and Joe Manganiello say they’re doing just fine — despite a tabloid magazine report suggesting their marriage is in shambles.\n\nThe newlyweds each lambasted a Star Magazine story claiming they had broken up, and that Vergara cheated on him. A recent cover of the publication featured a photo of Vergara dancing with another man with the headline “It’s Over!”\n\nThe image showed Vergara without her wedding ring — but both the “Modern Family” actress and her husband say the picture was photoshopped.\n\n“Big surprise everyone but Star created a fake story and then photo shopped my wife’s engagement ring off of her finger in order to sell magazines,” Manganiello, 40, wrote in a heated Instagram post. “They are run by malicious trash. Do the world a favor and don’t buy their garbage.”\n\nJoe Manganiello and Sofia Vergara each blasted a report claiming they had broken up.\n\nMeanwhile, Vergara, 44, shared a similar sentiment while contending that an unedited version of the photo on the cover — which shows Vergara dancing with another man — is on social media which proves she was indeed wearing a ring that night.\n\n“The editor of this magazine is an idiot if he is going to have my ring removed to created a ‘fake’ ‘news’ he should have made sure that he removed from social media all the other pictures of that award night in Rome where Im wearing it,” she wrote in her own Instagram post.\n\nShe went on to say that the man she’s dancing with in that photo is a producer working on her upcoming suspense thriller, “Bent,” who spent Easter at her home last month.\n\nA spokesperson for American Media, Inc., which publishes Star, refuted Vergara’s allegation that they photoshopped a photo of her to remove a ring.\n\n“Although Ms. Vergara has claimed that Star removed her wedding ring from a photograph on its cover that was taken during “that award night in Rome,” the photograph in which Ms. Vergara is pictured without her wedding ring was taken in Los Angeles on April 15, after she returned from Rome, and appears on page 34 of the magazine,” the spokesperson said in a statement.\n\nVergara and Manganiello have been together since July 2014 and married in November 2015.", "images": ["https://www.nydailynews.com/wp-content/uploads/migration/2017/05/04/HTX5KLNMDTIEHY334JCP2RRI4A.jpg?w=1024&h=670", "data:image/webp;base64,UklGRiQAAABXRUJQVlA4IBgAAAAwAQCdASoBAAEAAwA0JaQAA3AA/v3AgAA=", "https://www.nydailynews.com/wp-content/uploads/2023/08/New_York_Daily_News_nydredblack-1.svg"], "top_img": "https://www.nydailynews.com/wp-content/uploads/migration/2017/05/04/HTX5KLNMDTIEHY334JCP2RRI4A.jpg?w=1024&h=670", "keywords": [], "authors": ["Peter Sblendorio"], "canonical_link": "https://www.nydailynews.com/2017/05/04/sofia-vergara-and-joe-manganiello-slam-magazine-report-claiming-she-cheated-and-they-broke-up/", "title": "Sofia Vergara and Joe Manganiello slam magazine report claiming she cheated and they broke up", "meta_data": {"application-name": "newyorkdailynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "robots": "max-image-preview:large", "tdm-reservation": 1, "mrf": {"authors": "Peter Sblendorio", "canonical": "https://www.nydailynews.com/2017/05/04/sofia-vergara-and-joe-manganiello-slam-magazine-report-claiming-she-cheated-and-they-broke-up/"}, "description": "Sofia Vergara and Joe Manganiello say they're doing just fine — despite a tabloid magazine report suggesting their marriage is in shambles.", "generator": "WordPress 6.8.3", "og": {"type": "article", "title": "Sofia Vergara and Joe Manganiello slam magazine report claiming she cheated and they broke up", "url": "https://www.nydailynews.com/2017/05/04/sofia-vergara-and-joe-manganiello-slam-magazine-report-claiming-she-cheated-and-they-broke-up/", "description": "Sofia Vergara and Joe Manganiello say they’re doing just fine — despite a tabloid magazine report suggesting their marriage is in shambles. The newlyweds each lambasted a Star Magazine …", "site_name": "New York Daily News", "image": {"identifier": "https://www.nydailynews.com/wp-content/uploads/migration/2017/05/04/HTX5KLNMDTIEHY334JCP2RRI4A.jpg?w=1024&h=670", "width": 1024, "height": 670}, "locale": "en_US"}, "article": {"published_time": "2017-05-04T09:45:13+00:00", "modified_time": "2018-04-08T04:17:54+00:00"}, "twitter": {"text": {"title": "Sofia Vergara and Joe Manganiello slam magazine report claiming she cheated and they broke up"}, "image": "https://www.nydailynews.com/wp-content/uploads/migration/2017/05/04/HTX5KLNMDTIEHY334JCP2RRI4A.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.nydailynews.com/wp-content/uploads/2023/09/cropped-DailyNewsCamera-7.webp?w=270"}, "movies": [], "publish_date": 1493891113.0, "source": "http://www.nydailynews.com", "summary": ""}