{"url": "https://www.esquire.com/entertainment/a20764717/james-corden-revealed-who-bolted-from-carpool-karaoke/", "text": "James Corden was barreling toward an editing room to check out a rough cut of the latest Carpool Karaoke (the one with Bruno Mars, resplendent in brightly colored silk) when something caught his eye.\n\nTwo things, really: a bowl of candy and a twenty-five-foot tape measure haphazardly deposited on a credenza in an office full of members of the Late Late Show staff. The candy was Whoppers, small chocolate-covered malted-milk spheroids nestled three to a sleeve for easy snacking; the tape was a coiled ribbon of yellow metal encased in a chunk of aluminum, the kind that clips onto your belt and retracts with a satisfying whoosh.\n\n@cedric_buchet Jacket, shirt and bow tie by Ralph Lauren; sunglasses by Ray-Ban\n\n\"Hang on a minute,\" Corden said, to everyone in the office and no one in particular. \"This could be a bit, don't you think?\" It was an hour before lunch on a two-episode taping day in early December. Chris Pratt, Olivia Munn, Tracee Ellis Ross, and Stephen Fry were expected in a few hours. The writers were in the writers' room polishing monologue jokes until their poke bowls arrived. Corden, fashion-forward and show-business casual in black jeans, a black cowl-necked cardigan, and black slip-on Gucci sneakers stamped with tiny gold bees and flowers, grabbed the props and explained what he had in mind to the people in the room with the least investment in looking busy. He popped open the Whoppers and indicated through brisk dumb-show gestures that his first volunteer—a guy in a faded T-shirt and glasses with a receding frizz of light-brown hair—should open wide and place the blunt hook at the end of the tape against his bottom lip. Corden extended the length to seventy-seven inches, raised it to a 30 degree angle from the man's mouth, and placed the candy atop the resulting ramp.\n\nCollective breath was held. It was a moment fraught with potential. A Rube Goldberg variation. A test of the laws of physics.\n\nWhich, at least at first, did not cooperate. The candy rolled halfway down the chute, hit a wobble, dropped onto the floor, and bounced under a desk. Corden, his determination undimmed, adjusted the incline, tension, and torque. The second attempt was successful. Four out of six Whoppers ultimately made it onto the tongues of two employees. Corden was visibly delighted, though it must be said that visible delight seems to be his default setting. \"A triumph!\" he declared—the same word that he used to describe the pop diva Adele's post-beehive, post-baby hairdo on her edition of Carpool Karaoke, the most-watched YouTube video of 2016. \"We'll put it on the show. That's one for the Emmy reel.\"\n\nCBS The most-watched YouTube video of 2016: Adele's Carpool Karaoke.\n\nI was not born yesterday. I am prepared to believe that the Whopper spectacle was arranged for the benefit of a visiting journalistic fly on the studio wall. How else to account for the suspiciously serendipitous proximity of confection and tool? Why not Jolly Ranchers and a pair of pliers? Maybe the real gag was pranking the profile writer.\n\nBut I'm also prepared to believe that this kind of thing might be a regular occurrence around the Late Late Show studio, which occupies a suite of spacious rooms and a cavernous soundstage on the rooftop level of the sprawling CBS complex in Hollywood. A short time earlier, we had been drinking coffee in Corden's office, a cozy room decorated with pictures of his wife, Julia Carey, and their children; a signed Banksy; and a drawing—possibly Corden's favorite piece of art—of a rabbit recoiling in horror while reading Watership Down. Corden had talked about his plans for the coming year of his show. \"I'm always keen to try new things visually, with openings and sketches. I'd like to film the show somewhere else for a week.\" He popped up from his chair and padded over to the desk. \"This is what I was writing just this morning,\" he said, smoothing out a handwritten note-to-self. \"Visually better. More ambitious. And also sillier. Those three things.\"\n\nThey are overlapping categories, of course, and in a way they amount to more of the same. Less than two years after Corden took it over, The Late Late Show has established itself, against low expectations and amid stiff competition, as the most visually inventive, arguably the most ambitious, and surely the silliest specimen of the after-hours talk-show genre.\n\n@cedric_buchet Sweatshirt by Dolce & Gabbana\n\nIn the context of what may be the most tradition-bound television format in existence, Corden and Ben Winston, his longtime friend and one of the show's executive producers, insisted on novelty from the start, proposing innovations that were initially met with skepticism, even alarm, among publicists and celebrity handlers. Guests on The Late Late Show don't enter from the wings but through the banked rows of audience seats. They aren't interviewed one at a time but together, and their conversations range far beyond the usual plugging of new projects. \"It always had to be a show where the guests are doing things,\" Winston told me, and some of those things include eating disgusting foods, sharing child-care tips, and reenacting highlights from their own careers. Sometimes the interviews happen in people's houses; or, most famously, in a moving car, with singing. The bandleader and sidekick Reggie Watts makes up tunes on the spot and ad-libs lyrics about whatever has just happened onstage.\n\nThe host, for his part, doesn't sit behind a desk when he talks to his guests; he conducts his interviews from a swivel chair, which is positioned to the left of the couch, reversing the customary American setup. \"Even just having the seats the other way around,\" Corden recalled. \"I mean, the intake of breath\"—he acted out a sharp, disapproving inhalation—\" 'It just isn't done!' I was like, 'Are you fucking kidding me?' \"\n\nSome late-night hosts are notorious introverts, grouchy misanthropes fueled by insecurity and self-loathing. Corden, at thirty-eight the youngest of the current crop of post-prime-time network-television yakkers, is the other kind. A compact teddy bear of a man with a shock of blond hair and a less-than-daily commitment to shaving, he conducts himself with an impish ebullience somewhere between goofy kid brother and awesomely fun dad. (He and Julia, who were introduced by a mutual friend and married in 2012, are the parents of a six-year-old son and a two-year-old daughter.) When he discussed his ideas for the show with CBS, Corden promised \"all-out fun, and light, and positivity.\" And that is what he has tried to deliver.\n\nSome late-night hosts are grouchy misanthropes fueled by insecurity and self-loathing. Corden is the other kind.\n\nWhich is not to say that Corden is one of those comedians who are always and frantically on, deflecting seriousness with endless clowning. Talking to him one-on-one is more like conversing with a writer or an actor—both of which he was long before he started hosting a talk show. An inclination toward humility—a tendency, British as well as actorish, toward self-deprecation—sometimes seems to do battle with an impulse to reject false modesty. He can seem a bit dazzled by his recent success, and also not the least bit surprised by it. Onstage and on camera, he is a master of the emotional quick-change, shifting within a single sketch from mock chagrin to dumbstruck awe to pure mirth. In person he is no less animated but much more earnest, taking an analytical view of his work and falling back on a verbal tic that is also a real question: \"Do you know what I mean?\"\n\nWhen I met him—first over dinner at an aggressively on-trend Brentwood steakhouse and then for a long day of meetings, rehearsals, and tapings at CBS—Corden was showing a bit of fatigue. He had just returned from Miami, where he had hosted some Art Basel events and looked for art to add to his small but serious collection. After the taping wrapped, he was due to introduce Steven Spielberg at a Hollywood soiree. Then he would fly to London for a \"YouTube thing\" and back to Los Angeles to tape the last shows of the year. His debut as host of the Grammys loomed on the horizon, and shortly after that he would begin his third season of a most unlikely gig. \"I'm so scared of waking up and six months has gone by and we've just done shows,\" he said, rather than seeking out wilder, crazier gambits. What would be the fun of that?\n\nCBS The one that started it all: Mariah Carey in the hot seat, March 2015.\n\nThe afternoon of my visit, a bit called Were You Paying Attention? was being assembled, for which members of the audience would be quizzed midway through the hour about what had happened earlier on the show. Corden's explanation of it, delivered to a captive audience of me and Rob Crabbe, his other executive producer, was almost as funny as the thing itself. \"James is as enthusiastic as he seems,\" Crabbe was telling me when, as if on cue—or, for all I know, precisely on cue—Corden knocked at the door.\n\n\"The questions will be written during the first ten minutes of the show,\" he said. \"And then during the bit later on, they'll be asked something like, 'What was Stephen Fry holding in his hand in the dressing room?' If they get it right, they'll be given a gift card or something. If they get it wrong, they get kicked out of the audience.\"\n\nPerhaps unintentionally, this illuminated an unacknowledged anxiety about television, and after-midnight shows in particular: Who is paying attention, and what kind of attention is being paid?\n\nIn effect, Corden has two jobs. Four nights a week he hosts The Late Late Show, the hour-long broadcast he inherited from Craig Ferguson, which airs on CBS affiliates at 12:37 a.m. and attracts (according to the latest ratings figures) around 1.4 million viewers per episode. In traditional programming terms, his network competition at that hour is NBC's Late Night with Seth Meyers and ABC's Nightline. But really, Corden said, \"our competition is people choosing to be asleep.\" And so he and his staff must manufacture sketches that don't depend on the news cycle or the publicity requirements of visiting celebrities; that can be shared on social media; and that can, if the stars align correctly, find a semipermanent spot in the general public's overstuffed entertainment memory bank.\n\n@cedric_buchet Robe by New & Lingwood; sweater and loafers by Burberry; sunglasses by Tom Ford\n\n\"I've been doing this a long time,\" said Leslie Moonves, who has been running CBS since 1998. We were in his office, perched high above midtown Manhattan. \"The evolution of late night has been really fascinating. One guy, Johnny Carson, was dominant for all those years, and the others—the Dick Cavetts, the Joey Bishops, Chevy Chase, Joan Rivers—didn't even make a minor dent. Then, suddenly, because NBC gave The Tonight Show to Jay Leno and CBS got Letterman, it became a much broader business. ABC found Jimmy Kimmel. And then came the cable networks—the Comedy Central folks, Conan going to TBS—and you go from one to two to seven or eight of these guys.\"\n\nCorden and his counterparts continue to battle for slices of that ever-shrinking ratings pie. The numbers, in Moonves's old-school parlance. That's the job, and the tradition. There is still money to be made selling ad minutes against the real-time attention of non-cord-cutting viewers. There is also still a certain stubborn cachet attached to the spectacle of a host—nearly always, even now, a white man in a suit—telling jokes, bantering with the bandleader, and schmoozing with actors and singers plugging their latest projects. But the more valuable (if less easily monetized) currency of visibility—of what Crabbe, Moonves, and Corden all call relevance—now circulates elsewhere, in the 24/7 digital bazaar where skits, monologues, and snippets of deskside interviews circulate endlessly and compete to go viral.\n\nThe hosts and their staffs hustle to come up with repeatable, detachable digital candy—ideally involving famous people doing unlikely or mildly embarrassing things—that will hook web surfers and turn them into fans. Kimmel has Mean Tweets. Fallon has Classroom Instruments. Corden, late to the scene and behind them in the ratings, is outflanking both on the web. \"Within our first week or so,\" Ben Winston told me, \"we had created some major viral moments, with fourteen or fifteen million hits.\" These included a six-minute recap of Tom Hanks's film career and the epochal Mariah Carey Carpool Karaoke. \"We're working on the 279th episode. If we just did a chat show, we'd be devastatingly disappointed.\"\n\n\"You look at the numbers,\" Moonves said, \"and they're fine, they're fine.\" (They were, in the week of our conversation, a few hundred thousand below Seth Meyers's and around half a million below where Craig Ferguson's had been ten years before.) \"But you look at what he's doing online and it's phenomenal. And that has become, in the late-night world, more important than anything.\"\n\nCBS Even unruly man-child Justin Bieber strapped in for a sing-along.\n\nOne measure of this change—and also, in a way, of its incompleteness—is that Corden's digital triumph has fueled persistent rumors about an imminent shake-up in CBS's lineup, with him taking the 11:30 slot from the floundering Colbert. Late night is one of the last old-media battlegrounds in a disrupted landscape, and the habit of sniffing out intrigue dies hard.\n\n\"It just seems sort of silly to me. I really love him,\" Corden said, referring to Colbert. \"So I always find it slightly embarrassing. I really don't think there's any substantial evidence at all. I really don't think it exists.\"\n\nMoonves noted that Colbert has started to find his voice and build up his ratings in the wake of the 2016 election. \"Look, I'm very fortunate. I got two very successful guys, and they're very successful in different ways.\"\n\nI asked Moonves how much the time slots mattered. In 1993 and again in 2009, when the great late-night wars were fought, the 11:30 slot mattered more than anything to Letterman, Leno, and Conan. \"The Internet has changed all that,\" Moonves said. \"By and large, the guy who's better known gets the 11:30 slot, but for James's success it doesn't matter. It's almost an old way of thinking.\"\n\n\"The guy who's better known gets the 11:30 slot, but for James's success it doesn't matter.\"\n\nFor Corden, there is no \"almost\" about it. \"The only time I get really like, 'What are you talking about?' \" he said over dinner at the Brentwood steakhouse, warming up to a fine mini-rant, \"is when anyone will talk about time slots. Which is like telling the time with a sundial. Just the very notion of a television schedule for a show like this is absurd to me. I got really cross when we did that Carpool with Adele and someone wrote, 'How did a 12:30 talk-show host get Adele?' And I'm like, 'What world are you living in?' That clip has been viewed 129 million times. Those are Super Bowl numbers.\"\n\nBackstage, The Late Late Show is full of the usual rituals of comedic craft. The morning of my visit was dominated by a meeting in Corden's office in which the segment producers talked through gags and sketches and another in which the writers stared intently and silently at printouts of monologue jokes inspired by news stories, weird ads, and other familiar fodder.\n\nThe mood was relaxed and genial, with time for a few more bits of journalist-pranking. During one of the writers' meetings, I took a bathroom break and returned to find that everyone had changed seats, with the tallest, bulkiest guy in the room sitting at Corden's desk. \"He didn't even notice,\" Corden stage-whispered after I sat down, glancing mock-discreetly in my direction. \"Maybe he just thought I'd taken off my Spanx.\"\n\nRob Crabbe said that in the run-up to the show they had considered forgoing the traditional monologue. \"James does so many things well,\" Crabbe told me. \"But ironically, some of the things he'd never done before are walk out, hit a mark and tell jokes, and interview people. And those are kind of the major components of being a late-night television host.\" The monologue stayed in, but it can feel a bit stiff and self-conscious; Corden has a tendency to lean into the jokes with his right shoulder, his left hand jammed in his pocket—of, more likely than not, a made-to-measure suit from one of the luxury brands he worships—as if playing a role that doesn't quite feel natural.\n\nCBS We didn't know Michelle Obama could be any more perfect. She is.\n\nThat may be because unlike most of his peers, who grew up idolizing Carson and Letterman and cut their teeth in sketch and stand-up comedy, Corden did not pass through the usual apprenticeship of fandom. \"I feel very fortunate that I grew up without those tropes, or those influences,\" he said at the steakhouse as we tucked into a feast of halibut and broccolini, washed down with mineral water. (Though he's in no risk of going L. A. skinny, Corden seems to have adapted to the local dietary norms of carb avoidance.) \"The people who influenced me were Chris Evans, Jonathan Ross, Graham Norton, and Wogan and Parkinson. Names that will mean almost nothing\"—he looked around at the sea of tanned and toned nibblers—\"to most of the people in this restaurant. In the same way that if you went into a pub in Bradford and talked about Carson, no one would have a clue about who you were talking about.\"\n\nCorden studied acting as a teenager at a school in High Wycombe, a town halfway between London and Oxford, and soon found parts on stage, in films, and on television. He appeared in Alan Bennett's The History Boys in the West End, and on Broadway, and in the film adaptation. American audiences tuning into his early broadcasts might have recognized him as the Baker from Into the Woods. But he was frustrated with the narrow range of opportunities his early success seemed to offer. \"When The History Boys became the hottest play in London,\" he recalled, \"there were eight boys of a similar age, and they were all getting these massive film scripts. And I would get the one page of a script for a guy who drops off a television to Hugh Grant, or who works at a newsstand and sells a paper to Julianne Moore. And I was like, 'None of this is based on ability or charisma. It's only about how I look, and about the assumption that people who look like that don't fall in love in as nice a way as others. People who look like that are not as interesting.' \"\n\nIn part to counter this assumption, Corden and the Welsh actress Ruth Jones created the slice-of-life sitcom Gavin and Stacey, on which they played the title characters' best mates. A winning mixture of sweetness, absurdity, and kitchen-sink realism, the show ran on BBC for three seasons and was followed by The Wrong Mans, a sillier, more thrillerish comedy. Both shows were hits and made Corden something of a sensation in Britain. He and Winston, who had met on the set of a Channel 4 drama in 2000 and had remained close friends, worked together on awards shows and television sketches, including a 2011 bit with George Michael that was the prototype for Carpool Karaoke.\n\n\"None of this is based on ability or charisma. It's only about how I look, and about the assumption that people who look like that don't fall in love in as nice a way as others.\"\n\nIn 2012, Corden was a sensation in the West End and on Broadway with One Man, Two Guvnors, a madcap, madly British farce (loosely adapted from an eighteenth-century Italian play) that was a perfect showcase for his skills at vocal mimicry and knockabout slapstick. One night Les Moonves had a ticket. \"I was captivated,\" Moonves told me. \"I'd never heard his name before, but I said, 'We gotta do something with this guy.' \"\n\nAccounts diverge as to what happened next, when Winston and Corden were in Los Angeles pitching a sitcom in 2014. Moonves recalled that Corden was so eager to do a chat show that he joked about doing it for no money. Corden remembered being a little more skeptical. \"I said I felt like Colbert was a brilliant appointment, and that it opened a door for something different at 12:30. Otherwise it would be like having a hospital drama from eight to nine and another from nine to ten. With the same diseases.\" Winston—who'd ultimately move to Los Angeles without much hesitation to work on the show—was in Brazil with One Direction when Corden called late one night to wonder if he'd talked himself into a job. Winston didn't think much of it. \"James often comes back from meetings with offers for things he's never going to do,\" he said.\n\nBesides, Corden's career seemed to be pointing in every direction other than late night: He was a proven sitcom star with two hit Broadway shows and a Tony Award under his belt and plans for a revival of A Funny Thing Happened on the Way to the Forum. He also had a growing family and didn't like spending his children's birthdays on faraway movie sets. \"The more I thought about it,\" he said, \"the more I realized,'Here's someone offering me a chance to be at home every night with my family and try something that I might do quite well.' \" So the family—Julia was pregnant at the time—prepared to make the move from London to Los Angeles.\n\nWhen the inevitable question is asked—how did a pudgy British actor, virtually unknown in America when CBS hired him, become a dominant figure on the pop-cultural landscape, host of the Grammys and the Tonys, within a twelve-month span?—it's tempting just to say \"Carpool Karaoke\" and call it a day. The segment has helped The Late Late Show's YouTube channel surpass nine million subscribers; it is becoming its own stand-alone show on Apple Music (Corden won't be hosting the series, but he'll make an appearance in one episode); it has caused people who, in Rob Crabbe's words, \"haven't been in the passenger seat of a regular car in forty years\" to fasten their seat belts and loosen up their vocal cords.\n\nGetty Images Corden poses in a promo image for his first season as\n\nThere's no question that the segment has been—to quote a song he will surely get around to covering someday—the wind beneath Corden's wings. It plays to his strengths, after all. He looks cool-dad sporty in his trademark buttoned-up polo shirts. He has a terrific voice, full of timbre and expression even in the falsetto range, which often surprises his duet partners. (Just look at Adele's face when she hears his harmony on \"Hello.\") They, like his viewers, find the way he combines a fan's unabashed delight with serious professional chops to be irresistible. Even within the confines of the driver's seat, he exhibits an improbable physical grace and a disciplined actor's ability to convey nuances of feeling. The thing is antic, ambitious, and sometimes genuinely moving. Corden has staged an impromptu wrestling match with Anthony Kiedis, indulged Madonna's passenger-seat twerking, and chopped it up to \"Get Ur Freak On\" with Michelle Obama and Missy Elliott. His eyes filled with real tears as Stevie Wonder crooned, \"I just called to say James loves you\" over the phone to Julia.\n\nEach of those moments has attracted tens of millions of viewers. Even if those eyeballs don't convert into traditional ratings-based advertising dollars, they have helped turn Corden into something that Carson, Leno, and Letterman, in spite of their long careers as ratings magnets and profit engines, never quite managed to become: a global brand. The job of those storied hosts was to go to bed with as many Americans as possible each weeknight, which called for a certain kind of generically American appeal, and also a certain detachment. Most of their successors are trying to run that old game in new ways. Corden is different: a family man, a fan, and a pal; a working-class Brit transmitting his blend of whimsy and sincerity to every corner of the world at every hour of the day.\n\n\"He can play a role,\" Ben Winston said of his old buddy, \"act in a sketch, sing a song, perform in any way you can imagine. He's comfortable with who he is—this warm soul with talents that he's very willing to show off. People like him. They feel like he's their friend. He is their friend, and that more than anything else is why the show works.\"\n\nThe Late Late Show is now carried in more than 150 markets. In Los Angeles, its host is a local celebrity—sought after at dinner parties, doted on by the staff at the Brentwood steakhouse, recognized on the street. After dinner, we made our way to the valet line, past a small knot of youngish Wednesday-night revelers. \"Is that Mr. James Corden?\" one of them asked me as the man in question made his way to a nearby ATM.\n\nThis fan, a large fellow with a neat goatee, summoned the nerve to ask Corden for a selfie. Corden asked where he was from. \"Kuwait,\" the man said. \"We watch you all the time there.\" Corden was delighted to hear it. The manager, who was keeping a discreetly protective eye on his celebrity patron, was surprised. \"You watch him in Kuwait?\" he asked, and the two of them continued the conversation in Arabic. The only words I could understand were \"Michelle Obama\" and \"Carpool Karaoke.\" What more did I need to know?\n\nThis article appears in the March '17 issue of Esquire.", "images": ["https://hips.hearstapps.com/hmg-prod/images/esq110125billybobthorntondig-007-69137bdcdb609.jpg?crop=0.531xw:0.911xh;0.107xw,0.0335xh&resize=360:*", "https://www.esquire.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523ffffff", "https://www.esquire.com/_assets/design-tokens/esquire/static/images/logos/network-logo.910b3ba.svg?primary=%2523ffffff", "https://www.esquire.com/_assets/design-tokens/fre/static/icons/saved.ad81f1a.svg?primary=%2523FF3A30", "https://www.esquire.com/_assets/design-tokens/fre/static/icons/caret-left-regular.5546078.svg", "https://hips.hearstapps.com/esq.h-cdn.co/assets/17/06/1486396380-esq0301017corden002-cedric-buchet.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/environmental-tommy-0109-a-f-6911fe9db04d6.jpg?crop=0.667xw:1.00xh;0.216xw,0&resize=360:*", "https://hips.hearstapps.com/esq.h-cdn.co/assets/17/06/2048x1536/sd-aspect-1486476874-lead-corden-by-cedric-buchet-03.jpg?resize=768:*", "https://hips.hearstapps.com/esq.h-cdn.co/assets/17/06/1486397569-credit-cbs-esq0301017corden013.jpg?resize=980:*", "https://hips.hearstapps.com/esq.h-cdn.co/assets/17/05/1486164764-march-newsstand-cover.jpg?resize=980:*", "https://www.esquire.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://www.esquire.com/_assets/design-tokens/fre/static/icons/bookmark-simple-regular.9d9d56b.svg", "https://hips.hearstapps.com/esq.h-cdn.co/assets/17/06/1486397189-esq0301017corden005-cedric-buchet.jpg?resize=980:*", "https://www.esquire.com/_assets/design-tokens/fre/static/icons/x-regular.e414d97.svg", "https://www.esquire.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://www.esquire.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://www.esquire.com/_assets/design-tokens/esquire/static/images/logos/logo.20861e6.svg?primary=%2523000000", "https://www.esquire.com/_assets/design-tokens/fre/static/icons/envelope-simple-regular.91a0134.svg", "https://www.esquire.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/screenshot-2025-09-29-at-2-35-02-pm-68dad17cabcf5.png?crop=0.636xw:1.00xh;0.0609xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/landman-201-em-0401-00964-rt-f-691790b2d128d.jpg?crop=0.668xw:1.00xh;0.115xw,0&resize=360:*", "https://www.esquire.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://hips.hearstapps.com/esq.h-cdn.co/assets/17/06/1486397330-credit-cbs-esq030117corden012.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/environmental-t-l-0179-a-f-1-691b921b6e941.jpg?crop=0.667xw:1xh;center,top&resize=360:*", "https://www.esquire.com/_assets/design-tokens/fre/static/icons/globe-simple-regular.e7f303c.svg", "https://hips.hearstapps.com/esq.h-cdn.co/assets/17/06/1486397120-credit-cbs-esq030117corden011.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/screenshot-2025-11-18-at-10-31-38-am-691c91680245e.png?crop=0.417xw:1.00xh;0.301xw,0&resize=360:*", "https://www.esquire.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523000000&id=social-button-icon", "https://www.esquire.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/christmas-movies-1-1638382439.jpg?crop=0.503xw:1.00xh;0.247xw,0&resize=360:*", "https://www.esquire.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/vidthumb/images/daniel-craig-glass-onion-a-knives-out-mystery-1662642519.jpg?crop=0.48489583333333336xw:1xh;center,top&resize=360:*", "https://hips.hearstapps.com/esq.h-cdn.co/assets/17/06/1486396572-credit-cbs-esq030117corden009.jpg?resize=980:*", "https://www.esquire.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523000000&id=social-button-icon", "https://www.esquire.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/esq.h-cdn.co/assets/cm/15/06/54d3ed7e8cc4f_-_top-cops-08-0414-lgn.jpg?crop=0.668xw:1.00xh;0.167xw,0&resize=360:*", "https://www.esquire.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/esq.h-cdn.co/assets/17/06/1486417027-gettyimages-464664810.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/screenshot-2025-10-15-at-11-51-17-am-68efc3053226b.png?crop=0.534xw:1.00xh;0.144xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/chrishemswortharoadtriptoremember-19-2-35-691b6e8388c77.jpg?crop=0.479xw:0.719xh;0.199xw,0.248xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/index-69022e9ff1d58.jpg?crop=0.5xw:1xh;center,top&resize=360:*", "https://hips.hearstapps.com/vidthumb/7beaa1e5-82ad-4994-bbe3-e274b90e6d2c/thumb_1920x1080.0000001.jpg?crop=1xw:1xh;center,top", "https://www.esquire.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg", "https://hips.hearstapps.com/esq.h-cdn.co/assets/17/06/1486396985-esq030117-ereader-144-by-cedric-buchet.jpg?resize=980:*", "https://hips.hearstapps.com/esq.h-cdn.co/assets/17/06/3200x1600/landscape-1486476874-lead-corden-by-cedric-buchet-03.jpg?resize=1200:*", "https://www.esquire.com/_assets/design-tokens/esquire/static/images/logos/logo.20861e6.svg?primary=navLogoColor"], "top_img": "https://hips.hearstapps.com/esq.h-cdn.co/assets/17/06/3200x1600/landscape-1486476874-lead-corden-by-cedric-buchet-03.jpg?resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.esquire.com/entertainment/tv/a52856/james-corden-in-the-drivers-seat/", "title": "Grammys 2017 Host James Corden is the New King of Late Night TV", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Grammys 2017 Host James Corden is the New King of Late Night TV", "description": "When he took over 'The Late Late Show' in 2015, James Corden was a largely unknown bloke—two years later, he's the new King of the Night.", "keywords": "james corden, Grammys 2017 host, Grammys 2017, Grammys host, grammy host, grammys host 2017, grammy host 2017, whos hosting the grammys, who is hosting the grammys", "theme-color": "#000000", "og": {"site_name": "Esquire", "title": "It Doesn't Matter What Time James Corden Is on TV", "description": "When he took over 'The Late Late Show' in 2015, James Corden was a largely unknown bloke—a UK import with a part-dad, part-lad vibe. Two years later, he's become the new King of the Night.", "image": {"identifier": "https://hips.hearstapps.com/esq.h-cdn.co/assets/17/06/3200x1600/landscape-1486476874-lead-corden-by-cedric-buchet-03.jpg?resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.esquire.com/entertainment/tv/a52856/james-corden-in-the-drivers-seat/", "type": "article"}, "fb": {"app_id": 171874009543995, "pages": 84169421673}, "article": {"publisher": "https://www.facebook.com/Esquire", "opinion": "false", "section": "TV", "modified_time": "2017-02-07T13:58:00Z", "published_time": "2017-02-07T13:58:00Z"}, "google-site-verification": "1vf5i9wM7chlCFc_0XI_e-oCfDf4sEvp32sTGKoaukQ", "parsely-metadata": "{\"socialHeadline\":\"It Doesn't Matter What Time James Corden Is on TV\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/esq.h-cdn.co/assets/17/06/1600x1600/square-1486476874-lead-corden-by-cedric-buchet-03.jpg?resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/esq.h-cdn.co/assets/17/06/3200x1600/landscape-1486476874-lead-corden-by-cedric-buchet-03.jpg?resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/esq.h-cdn.co/assets/17/06/1600x1600/square-1486476874-lead-corden-by-cedric-buchet-03.jpg", "twitter": {"image": "https://hips.hearstapps.com/esq.h-cdn.co/assets/17/06/3200x1600/landscape-1486476874-lead-corden-by-cedric-buchet-03.jpg?resize=640:*", "card": "summary_large_image"}, "auto-publish": "timely", "sailthru.excerpt": "James Corden was barreling toward an editing room to check out a rough cut of the latest Carpool Karaoke (the one with Bruno Mars, resplendent in brightly colored silk) when something caught his eye. Two things, really: a bowl of candy and a twenty-five-foot tape measure haphazardly deposited on a", "sailthru.tags": "entertainment,Entertainment,tv,TV,grammy-awards-guide,The Grammys 2018 Guide,cover-stories,Cover Stories,Esquire-US", "sailthru.date": "2017-02-07 13:58:00", "sailthru.socialtitle": "It Doesn't Matter What Time James Corden Is on TV", "sailthru.contenttype": "longform-article"}, "movies": [], "publish_date": 1486475880.0, "source": "https://www.esquire.com", "summary": ""}