{"url": "https://www.instyle.com/celebrity/princess-dianas-most-iconic-style-moments", "text": "Keep reading to revisit 30 of Princess Diana’s most iconic style moments.\n\nAs a royal, Diana's style leaned conservative—marked by structured suits, covered-up gowns, and classic, modest dresses. But after her 1996 divorce from then-Prince Charles, she broke free from the constraints of royal dressing, embracing more daring, bold looks that showed off her personality. Regardless of what she wore, it was always uniquely Diana, inspiring others to dress confidently and according to their own rules.\n\nPrincess Diana is known for so many remarkable achievements—from being an incredibly devoted mother to an inspiring public figure and role model. Regardless of whether she was tending to her children or shaking hands with Mother Teresa, she did so with style and grace. After all, Lady Di had an unforgettable fashion sense. Her standout sartorial moments, both within the royal family and beyond, have even earned her the title of fashion icon with outfit formulas that are still in season . And it wasn’t just her royal wardrobe that garnered attention either.\n\n01 of 30 Preppy Princess-to-Be Lady Diana Spencer at the Young England Kindergarden Nursery School in London in 1980. Tim Graham Photo Library via Getty Images One of the reasons that the public fell in love with Diana in the first place was that she was never scared to show how she was feeling. In this purple-on-purple preppy look, Lady Di seems sweet—if not a little bored.\n\n02 of 30 Peeking Through Princess Diana wearing a black wool coat over a pink gown in 1980. Getty Images Still lacking a royal clothing allowance, the teenaged teacher's assistant topped her romantic pink evening gown with a plain wool coat for Princess Margaret's 50th birthday bash.\n\n03 of 30 The Princess Bride Princess Diana in her wedding gown in 1981. Landov She collaborated on her wedding gown with little-known design team David and Elizabeth Emanuel. \"In the end, the design process was quite simple because it was just the three of us,\" the duo wrote in A Dress for Diana. They had the future princess slip sample dresses on over her jeans: \"She was terribly excited to be trying on huge bouffant petticoats, satin skirts, and boned bodices.\" The final garment was made of British-woven silk and featured a dramatic 25-foot train.\n\n04 of 30 Hunt and Gather Prince Charles and Lady Diana Spencer at Craigowan Lodge on the Balmoral Estate in 1981. Central Press/Getty Images When Shy Di met with the press on her Scottish honeymoon, her finery was limited to her Welsh gold wedding ring inscribed with a message from the prince: \"I Love You, Diana.\"\n\n05 of 30 Something Blue Princess Diana wearing a blue, one-shoulder gown in 1982. Jayne Fincher/Getty Images The expectant princess made headlines in a single-shoulder, drop-waist Bruce Oldfield gown in vivid, blue silk. \"The English rose syndrome was never my bag,\" the designer once told a biographer. \"I liked to see her in much simpler things.\"\n\n06 of 30 Metallic Muse Princess Diana at the premiere of the James Bond film \"A View To a Kill\" in 1985. Jayne Fincher/Getty Images The princess was nicknamed \"Dynasty Di\" by the tabloids because of her wide-shouldered gowns, like this silver Bruce Oldfield. \"She was very involved,\" Oldfield has said of his client's wardrobe, but \"you'd have to be fast because she didn't have much patience.\"\n\n07 of 30 Red(ish) Velvet Princess Diana at a premiere in London in 1985. Tim Graham/Getty Images Diana wore this wine, velvet Catherine Walker dress to a London premiere in 1985. Although it looked conservative from the front, the gown had an open back that the princess accentuated with a long pearl necklace worn backward.\n\n08 of 30 Suit and Tie Princess Diana during a tour of Italy in April 1985. Jayne Fincher/Princess Diana Archive/Getty Images The Princess of Wales knew how to wear a dress like no one's business, but she could also pull off business attire. This green Jasper Conran number, complete with a matching tie, is a great example of her gender-bending 'fits.\n\n09 of 30 Bolero Babe Princess Diana in a white bolero and dress in 1985. Tim Graham/Getty Images Designer Victor Edelstein has said that the dresses he made for the princess were a collaboration: \"You each make suggestions and ask, 'What do you think?'\" In the case of this white gown and bolero, the partnership paid off. Years after she wore it to a New York event, she chose a photo of herself in the ensemble for the cover of her Christie's auction catalog.\n\n10 of 30 Unconventional Tiara Princess Diana in a teal one-shoulder gown and an emerald-and-diamond choker as a tiara in 1985. Tim Graham/Getty Images For an appearance in Melbourne, Australia, Diana accented a single-shoulder gown with an emerald-and-diamond choker worn as a tiara. The necklace was a wedding gift from the queen, who likely imagined the deco treasure being worn in a more conventional way.\n\n11 of 30 Gingham Girlie Princess Diana sitting on the steps at Highgrove in July 1986. Tim Graham Photo Library via Getty Images In 1986, Shy Di posed outside on the steps at her country home in Highgrove. The hot pink sweater layered over a white long-sleeve blouse gives preppy, especially when paired with gingham pants.\n\n12 of 30 Dark Navy Velvet Princess Diana at a Banquet in Bonn, Germany, in 1987. Tim Graham/Getty Images Victor Edelstein based this dark navy, velvet column gown on Edwardian evening designs. The princess famously wore it for a spin on the White House dance floor with John Travolta.\n\n13 of 30 Equestrian Off-Duty Princess Diana at Guards Polo Club in 1988. Tim Graham/Getty Images Proving that she needed little more than her statuesque frame to make an impression, Diana strolled the grounds at the Guards Polo Club in jeans and a sweatshirt, topped with a crisp blazer.\n\n14 of 30 Ultimate Brit Princess Diana at a wedding in the U.K. in 1989. Tim Graham/Getty Images Diana attended a U.K. wedding in a white sheath dress and dove-gray coat accessorized with a traditional British wedding hat—and an even more traditional British umbrella.\n\n15 of 30 Princess in Pink Princess Diana at a Nigerian state banquet in 1989. Alpha/Globe The princess coupled her beaded ball gown from Catherine Walker with the Spencer tiara. She was known to have dresses altered for future wearings; a version of this gown with a narrow skirt would later sell at auction for $51,750.\n\n16 of 30 Mother of Pearl Princess Diana in Hong Kong in 1989. Tim Graham/Getty Images The high collar on this Catherine Walker pearl-encrusted bolero was inspired by Elizabethan ruffs. The less historically minded press christened the ensemble \"the Elvis dress.\"\n\n17 of 30 Porcelain Florals Princess Diana at the Canadian premiere of \"Crocodile Dundee II\" in 1991. Glenn Harvey/Camera Press/Retna For the Canadian premiere of Crocodile Dundee II, Princess Di chose a floral-print, ruched dress by Catherine Walker. The extra fabric cascading down the princess's side adds tons of interest and dimension to the look.\n\n18 of 30 Lady (Diana) in Red Princess Diana wearing a raspberry-hued Victor Edelstein gown in 1991. Tim Graham/Getty Images Princess Diana looked radiant at a London Kire Te Kanawa concert in a raspberry-hued Victor Edelstein gown. She gave Chris de Burgh's 1986 \"Lady in Red\" a whole new meaning.\n\n19 of 30 Green Moment Princess Diana at the British School of Seoul in South Korea in 1992. Tim Graham/Corbis The princess visited the British School of Seoul in South Korea wearing a fitted green suit with matching pumps. It was equal parts academic, professional, and royal.\n\n20 of 30 Barbiecore Princess Diana in Wales in 1993. Tim Graham/Getty Images A hot-pink frock coat and matching skirt gave the newly separated Diana a cheerful glow. Pink hues always helped bring out Lady Di's more playful side, which you can see here via her beaming smile.\n\n21 of 30 The Revenge Dress Princess Diana wearing her infamous \"revenge dress\" in 1994. Rex USA It was the LBD worth a thousand words: In 1994, just as a documentary regarding her husband's infidelities was airing, Princess Diana strolled into a Serpentine Gallery benefit wearing this iconic number from Greek designer Christina Stambolian. The next day, every front page was devoted not to the Prince of Wales's televised confession but to images of the glowing, confident 32-year-old Diana. Ever mindful of the power of fashion, three years later, she auctioned off 79 of her favorite gowns at a Christie's auction that raised $6 million for AIDS and breast cancer charities.\n\n22 of 30 Seeing Red Princess Diana in a crimson Christian Lacroix dress in 1995. Jayne Fincher/Getty Images As a royal, Diana was required to wear British designers to boost the local economy. Post-separation (which was in 1992; the divorce was made official in 1996), Diana often donned international couture like this crimson Christian Lacroix dress, worn in Paris in 1995.\n\n23 of 30 Not-So-Shy Di Princess Diana in a white Versace dress in 1995. Tim Graham/Getty What happened to Shy Di? The princess began to favor sheath dresses that showed off her slim shape, like this white Versace number she wore to a charity concert in Italy in 1995. Seems like the black gown wasn't her only revenge dress.\n\n24 of 30 Bead Me Up Princess Diana in a plunging, beaded Catherine Walker cocktail dress in 1995. Rex USA Diana showed off her toned shoulders in a plunging, beaded cocktail dress by Catherine Walker. The beads help give this already-polished look a little playfulness and sparkle.\n\n25 of 30 Jackie O-Inspired Princess Diana in a pink Gianni Versace skirt suit with pillbox hat in 1995. Tim Graham/Getty Images Gianni Versace designed the Princess of Wales's Jackie O-inspired pink suit for a visit to the nation's troops. Her pillbox hat was by Philip Somerville. It was all proving that she could stand on her own.\n\n26 of 30 Athleisure Princess Diana in London in 1995. JOHNNY EGGITT/AFP via Getty Images It's hard to go out these days and not run into someone donned in athleisure. The trend, which mixes athletic wear with comfortable loungewear, was Princess Diana-approved. In fact, she wore a crewneck and biker shorts out in public several times.\n\n27 of 30 Nod to Culture Princess Diana in an ivory, pearl-studded shalwar kameez in London in 1996. Uppa-Ipol/Globe The Princess wore an ivory, pearl-studded shalwar kameez to a cancer fundraiser in London in 1996. The pantsuit, which was a gift from her friend Jemima Khan, inspired her to commission similar Pakistani-inspired outfits from Catherine Walker.\n\n28 of 30 Public Service Princess Diana visiting patients at an Angola hospital in 1997. Tim Graham/Getty Images Diana visited patients at an Angola hospital wearing a sleeveless chambray shirt and trim chinos. Even as a casual look, it still serves.\n\n29 of 30 Saintly White Princess Diana holding hands with Mother Theresa in NYC in 1997. Sutcliffe/Sipa Diana met with Mother Theresa in New York in a simple white suit and cap-toed pumps. This serves as another example of pared-down clothes still being fashionable enough to be in the public eye.", "images": ["https://www.instyle.com/thmb/smoPzljSNK2hyNcUsyWisM_gsis=/570x426/filters:no_upscale():max_bytes(150000):strip_icc():focal(1219x0:1221x2)/GettyImages-2220084847-0ce3ff84736e4f728284d98ebc3c3291.jpg", "https://www.instyle.com/thmb/cXBpc3s-VivAWH_kU6OzavTiE-w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/040111-princess-diana-16a_0-0dd4a7860f184060a5fa6c0b8c80757b.jpg", "https://www.instyle.com/thmb/15_rKASezuxQIezCVbty4wOEwJI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/040111-princess-diana-02a_0-fb11c930934a4e02832f636e6fede8eb.jpg", "https://www.instyle.com/thmb/V7fFRKUmxrJxzdFOFRHufBW8Y6U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1997-princess-diana-400_0-93175728d10f409c868ee2e837e04903.jpg", "https://www.instyle.com/thmb/GsQ-5pNpNd4yP1s8FvGfOwZSh7A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-52103366-bf23207262a24b6bb5ba4cf3b48f7a78.jpg", "https://www.instyle.com/thmb/6WbpD-xjXMi1cSSanZug4EzDAHA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/040111-princess-diana-01a_0-ac8c4f9226ba48f1964fcc6154f5d85a.jpg", "https://www.instyle.com/thmb/ddoqu31jUSrHzgEVDBJtaY6IUFw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/040111-princess-diana-14a_0-c82240a801844b53b63ec696d3092341.jpg", "https://www.instyle.com/thmb/-fpdvG_DNRbS45wjBMJX30h1RPg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/040111-princess-diana-03a_0-902a007e71b74b27899e6228c734816c.jpg", "https://www.instyle.com/thmb/o9JL7OgFXxadbjTCUIv4lTsJFPU=/570x426/filters:no_upscale():max_bytes(150000):strip_icc():focal(1716x0:1718x2)/RoyalFamilyLead-3cea07b0cfb443d8858a151006f20e3d.jpg", "https://www.instyle.com/thmb/J2blABl3fe8Atib0eP4wOgtmOMc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1997c-princess-diana-400_0-9493609ec03b49e99baad9f6a9514970.jpg", "https://www.instyle.com/thmb/qbesHW-t5rI4WNtTsrsFY2TMs0w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/040111-princess-diana-10a_0-54ca412f6b7e4510af1e082306e93cec.jpg", "https://www.instyle.com/thmb/MI8c0lpjoj3GOUZlf4IoDKCnI1Y=/570x426/filters:no_upscale():max_bytes(150000):strip_icc():focal(819x0:821x2)/GettyImages-2188100379-7a0766e22d404a3dbe1ccb9863dff2ae.jpg", "https://www.instyle.com/thmb/jc-A8mwQjmimh0eWW8hyQwnUR5w=/570x426/filters:no_upscale():max_bytes(150000):strip_icc():focal(2094x1301:2096x1303)/GettyImages-515207354-3863625654864039a162dd0e84b9bb19.jpg", "https://www.instyle.com/thmb/rSmeweOsIbM-2fWSEeOCopMUVvI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/080625-princess-diana-46401c9b34c94426a08ada55e9d4b592.jpg", "https://www.instyle.com/thmb/IutTH7oOnli1I9cEhi342qDu2bQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-73702246-e9027953f17947bdadc4677eff7796bd.jpg", "https://www.instyle.com/thmb/U-xe31IIrJvMqj3Y4J7-a3_knT8=/570x426/filters:no_upscale():max_bytes(150000):strip_icc():focal(1064x893:1066x895)/WilliamDianaLead-ead2dd7a891d43939667d758d63795f4.jpg", "https://www.instyle.com/thmb/JjHgr2eVYg7cAXBVWdw_AW5ajAk=/570x426/filters:no_upscale():max_bytes(150000):strip_icc():focal(559x371:561x373)/Celine-8686160b1cc84788bd2db63d3403c3a0.jpg", "https://www.instyle.com/thmb/3i1JvqkKJrl7fhvKaDsUox8Ki0s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1997d-princess-diana-400_0-6cc4698038f5476d90e19d1d0d5dab3c.jpg", "https://www.instyle.com/thmb/Qcu5CSg1C2XoJo3GqUYs_4V9PLs=/570x426/filters:no_upscale():max_bytes(150000):strip_icc():focal(1223x0:1225x2)/MeghanMarkle-92e5c451f0c74bc88abf1146e15ad382.jpg", "https://www.instyle.com/thmb/vZ1wKNDpV9RVYuHEYgGj9EHjMyc=/570x426/filters:no_upscale():max_bytes(150000):strip_icc():focal(1485x941:1487x943)/KateMiddletonLead-5dc8fbe0a401432cab60fb649ec71d9d.jpg", "https://www.instyle.com/thmb/pUy0E5Iyrm6_uU_QE1LcSjK7Bwc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/040111-princess-diana-06a_0-23a63722e21941e98cba53ffb39bfc8a.jpg", "https://www.instyle.com/thmb/fhKlaBguz5KrFNujielQ3s2ddvE=/570x426/filters:no_upscale():max_bytes(150000):strip_icc():focal(1905x0:1907x2)/PrinceWilliamKateMiddletonLead-3d35ae5a90ce4ba7ae5f8e8bc3e35863.jpg", "https://www.instyle.com/thmb/v54b5MsPLkkr8EkZ6dRlLVENV1M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1981-princess-diana-400_0-fb9fb4909d1f42be97188c60ee8026a3.jpg", "https://www.instyle.com/thmb/D9bA7O-ZU-nwS3P7E8UjX14qKkM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/040111-princess-diana-08a_0-e686e7429634417bafedb19821b4f915.jpg", "https://www.instyle.com/thmb/56hX9QG6Ylly9BhGQ9tLB9vbg4k=/570x426/filters:no_upscale():max_bytes(150000):strip_icc():focal(806x0:808x2)/GettyImages-1488336827-c9d71715a7184cb7905a72813c18f04b.jpg", "https://www.instyle.com/thmb/2jHGJClBFegWzO70x9BivLNxqzM=/570x426/filters:no_upscale():max_bytes(150000):strip_icc():focal(1833x1742:1835x1744)/William2-d5879ef93ce84c239103ec23b8cfb0ec.jpg", "https://www.instyle.com/thmb/glOvxDsiZH_aof1IUFgLgo_PY8E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1997b-princess-diana-400_0-f2b8092e67e14bd9a77d444b741911a8.jpg", "https://www.instyle.com/thmb/dIxcKq2ZFTIC0JpPiKlPaP39_s0=/570x426/filters:no_upscale():max_bytes(150000):strip_icc():focal(2437x931:2439x933)/WilliamKateLead-88ea18190851432a8681b9302bf5620d.jpg", "https://www.instyle.com/thmb/toGFEzGEVNfP_2Yimt_OoTcGPLY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/040111-princess-diana-15a_0-2ddf95b95ffa46a2b5f95d3f6899f4ae.jpg", "https://www.instyle.com/thmb/ulpctvZZ3TWsKDU4TAaOCwWodDc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1997a-princess-diana-400_0-65dd2fdaab0947339ee2f7d968091331.jpg", "https://www.instyle.com/thmb/eMZa0IhEpRVqZO8ZJX0LZesuCnY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/040111-princess-diana-11a_0-94e5f1400df0403e8d6765e88ecd4c39.jpg", "https://www.instyle.com/thmb/4EPrG1a1n_h_iFf-_fG3vVwuKhU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/040111-princess-diana-13a_0-4c87cf7a0f2742469b7e2630a83baea6.jpg", "https://www.instyle.com/thmb/9xeGlf0PfJk1Vhukl15kbeA4m6Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1994-princess-diana-400_0-58ffb78117e74bf8b32bb15a9949b3af.jpg", "https://www.instyle.com/thmb/TgVeo3kNMVrNmrdU39giXig0C24=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1980-princess-diana-400_0-ffe8a9568b914bd096ea9681ed3e4503.jpg", "https://www.instyle.com/thmb/3Tkczy3aGJFr0vlUoWUhDnheTLc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/040111-princess-diana-17a_1-9277684141ad47da80ad110542611066.jpg", "https://www.instyle.com/thmb/LSM6zL_gjFtkFgx1Url6BBKn2jU=/570x426/filters:no_upscale():max_bytes(150000):strip_icc():focal(2286x0:2288x2)/GettyImages-2151728100-c1f779adf3b6416fb151575d6157400e.jpg", "https://www.instyle.com/thmb/FJVHaX1BYZbSew2UAH4v3ID4fdY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/040111-princess-diana-07a_0-411b525f828e4ea5898564ae591578c8.jpg", "https://www.instyle.com/thmb/w-VF6voLnUYjCJ8mAP6hPbFYrBU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/080625-princess-diana-soc-bf53370f6aa7475aafa590c00e0aabd4.jpg", "https://www.instyle.com/thmb/NASnD5WAUtWZk-nV8Sq30ErFP-E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/040111-princess-diana-04a_0-0c31ec2b1ad44e468c4769a6257c4881.jpg", "https://www.instyle.com/thmb/SFPG_F5fkP3GQw1MBnDBW4FHOBA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/040111-princess-diana-05a_0-07f68712aad240abbc0ed86b1aecd0d2.jpg", "https://www.instyle.com/thmb/9LEsT96JfAZFrCCVpENS5cgZzsU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-51420423-f3df75ad5ac94df9a890afed41a1dd6c.jpg", "https://www.instyle.com/thmb/LKo1YaN-4CHFGZsphioxOim9c38=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/040111-princess-diana-09a_0-87e2f190cdaa4555919f6ab96b4cb78c.jpg", "https://www.instyle.com/thmb/FyKEs7VZlYIb-pFZqCFPvqxVdrg=/570x426/filters:no_upscale():max_bytes(150000):strip_icc():focal(2280x2134:2282x2136)/GettyImages-1172532795-c67deedd2da54e3c9be8892ef946c591.jpg", "https://www.instyle.com/thmb/9MYv7-06qsZh9WG2r_Eg8BmnuIA=/570x426/filters:no_upscale():max_bytes(150000):strip_icc():focal(1647x2026:1649x2028)/DianaLead-76b6d96c89c74ed798cc1df7c74cd2f4.jpg", "https://www.instyle.com/thmb/lssul0VWoRuFORccdca1lqoNhJk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1995-princess-diana-400_0-9445922143414ce98cc7cad256f1285f.jpg", "https://www.instyle.com/thmb/P5fHLnYIVTkf_gQ_5v1dT7uRW4g=/570x426/filters:no_upscale():max_bytes(150000):strip_icc():focal(2082x761:2084x763)/GettyImages-2197346550-8cecbe5762a84d17ae13831697e27643.jpg", "https://www.instyle.com/thmb/eujAm_V7ut3u1IIxzZlKlCUHMDc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-79729809-9e649b3514a542a5991071df403522bd.jpg", "https://www.instyle.com/thmb/C-1vSsSfdy9oOtX5gJGPz1cuL_c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/040111-princess-diana-12a_1-8e51b05f4aa54c66858afc30805e1876.jpg"], "top_img": "https://www.instyle.com/thmb/w-VF6voLnUYjCJ8mAP6hPbFYrBU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/080625-princess-diana-soc-bf53370f6aa7475aafa590c00e0aabd4.jpg", "keywords": [], "authors": ["Instyle Editors", "Our Editors", "Writers Comprise Decades Of Expertise Across The Beauty", "Fashion", "Lifestyle", "Wellness Spaces In Print", "Digital. We Prioritize Journalistic Integrity", "Factual Accuracy", "Also Having Fun With Every Story We Share.", "Instyle'S Editorial Guidelines"], "canonical_link": "https://www.instyle.com/princess-dianas-most-iconic-looks-5369926", "title": "Princess Diana's 30 Most Iconic Style Moments of All Time", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "From her wedding gown to her revenge dress, Princess Diana may have some of the most iconic royal style moments in history. Here, see 30 of her best looks, from her wedding dress to the iconic revenge dress.", "emailcontenttype": "LISTSC", "emailvertical": "INSTYLE", "sailthru.author": "InStyle Editors", "sailthru.tags": "news,celebrity", "parsely-section": "News", "parsely-tags": "InStyle,News,Celebrity,Royal Family News & Updates,Fashion,Prince Harry,Kate Middleton,Princess Diana,Prince William", "article": {"section": "instyle", "author": "https://www.facebook.com/InStyle"}, "og": {"type": "article", "site_name": "InStyle", "url": "https://www.instyle.com/princess-dianas-most-iconic-looks-5369926", "title": "Princess Diana's 30 Most Iconic Style Moments of All Time", "description": "From her wedding gown to her revenge dress, Princess Diana may have some of the most iconic royal style moments in history. Here, see 30 of her best looks, from her wedding dress to the iconic revenge dress.", "image": "https://www.instyle.com/thmb/w-VF6voLnUYjCJ8mAP6hPbFYrBU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/080625-princess-diana-soc-bf53370f6aa7475aafa590c00e0aabd4.jpg"}, "twitter": {"card": "summary_large_image", "site": "@InStyle", "title": "Princess Diana's 30 Most Iconic Style Moments of All Time", "description": "From her wedding gown to her revenge dress, Princess Diana may have some of the most iconic royal style moments in history. Here, see 30 of her best looks, from her wedding dress to the iconic revenge dress.", "image": "https://www.instyle.com/thmb/w-VF6voLnUYjCJ8mAP6hPbFYrBU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/080625-princess-diana-soc-bf53370f6aa7475aafa590c00e0aabd4.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.131.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.131.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.131.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.131.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.131.0/icons/favicons/mstile-310x150.png", "fb": {"pages": 18938064984}}, "movies": [], "publish_date": null, "source": "https://www.instyle.com", "summary": ""}