{"url": "https://www.thewrap.com/second-act-film-review-jennifer-lopez/", "text": "Say what you will about Jennifer Lopez, but one thing is true: She takes risks. Never sticking to a particular type, she has run the gamut in her choice of films from romantic comedies (“The Wedding Planner,” “Maid in Manhattan,” “Monster-in-Law”) to thrillers (“The Cell,” “Anaconda”) to biopics (“El Cantante,” “Selena”) and beyond. “Second Act” is her first live-action film since 2015’s “The Boy Next Door,” and it feels like a confused puppy, caught between a stale script and a very confused storyline that frequently loses focus.\n\nMaya (Jennifer Lopez) is a big-box store assistant manager who has goals. She wants to wow her boss (Larry Miller) in the hopes of getting a well-deserved promotion to general manager. Instead, he introduces her to the white guy (Dan Bucatinsky) with an Ivy League MBA he hired for the position. Why? Because she isn’t a college grad, and no matter how many years she has put into the store, how loved she is by her co-workers, or how much money she’s made them, no degree means no promotion.\n\nHer best friend Joan (Leah Remini) provides a shoulder to cry on while simultaneously pushing her to marry (and have a family with) boyfriend Trey (Milo Ventimiglia), from whom she is hiding a big secret. Joan’s Stanford-bound son, meanwhile, gifts his godmother Maya a fake résumé, complete with LinkedIn and Facebook accounts, as well as photoshopped pictures of a more educated and worldly version of herself. All this lands her a job interview at a major beauty brand in Manhattan where she must compete with the much younger and more business-savvy Zoe (Vanessa Hudgens).\n\nThis is the sort of story Hollywood drools over, an underdog rising to the top using a little white lie and her wits to make it. But writers Elaine Goldsmith and Justin Zackham (“The Bucket List”) decided to overstuff the script with narratives that go absolutely nowhere. Wanting to make a statement about women in the workplace, while fixating on a pro-college ideology, Goldsmith and Zackham decide to throw in an adoption story, an odd statement on the beauty industry and (yes, there’s another “and”) a romance on the rocks. Through each storyline pivot, the focus is lost, and it never reclaims any footing it may have had in the first place.\n\nHere’s what the writers don’t seem to realize: Lopez is the queen of charm (just take a look at her recent appearance on “Ellen” for proof), and had they given her a consistent character along with the chance to let her comedic chops fly, this film could have been part of the rom-com renaissance that’s currently being ushered in by other films like “To All the Boys I’ve Loved Before,” “Book Club” and “Crazy Rich Asians.”\n\nRemini, Ventimiglia and Hudgens are all wasted here, though each does what they can with the tropes they are given. While I really enjoyed Remini’s scenes and her on-point wit, the sudden jump from supportive bestie to hyper-aggressive matchmaker was strange and misguided. Meanwhile, Ventimiglia is just Jack Pearson 2.0 — still endearing, but don’t we see this every week? And while Hudgens gets to be both cunning and vulnerable, her character’s story just doesn’t fit the scope of the film.\n\nThe one thing the film does get right? The fashion. Costume designer Molly Rogers knows a thing or two about creating the ultimate New York fantasy look, having worked on “Sex and the City” in its TV and two big-screen incarnations. Lopez is a fashionista in her own right, and it’s hard to imagine that the actress (and producer) didn’t have a hand in picking out all the gorgeous outfits on display. These are the ensembles every woman imagines when she dreams of making it big — Chanel, Louboutins and much more — and whether realistic or not, the movie successfully sells the fantasy.\n\nBecause, after all, we don’t flock to see a rom-com or an underdog story for the realism; we do it because we want to get lost in a beautiful, witty romance, whether that means falling in love with a partner, a platonic friend, or ourselves. Even on that front, “Second Act” is a letdown, serving up a bland, befuddled version of a big-budget Lifetime film. Lopez deserves better, and so do her fans.", "images": ["https://i0.wp.com/www.thewrap.com/wp-content/uploads/2018/12/second-act-SECOND_Unit_01644R_rgb-1.jpg?fit=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2025/08/5x4_082025_COVER_B.png?fit=240%2C300&quality=80&ssl=1"], "top_img": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2018/12/second-act-SECOND_Unit_01644R_rgb-1.jpg?fit=618%2C412&quality=89&ssl=1", "keywords": [], "authors": ["Yolanda Machado", ".Wp-Block-Post-Author Box-Sizing Border-Box Display Flex Flex-Wrap Wrap .Wp-Block-Post-Author__Byline Font-Size Margin-Bottom Margin-Top Width", ".Wp-Block-Post-Author__Avatar Margin-Right .Wp-Block-Post-Author__Bio Font-Size Margin-Bottom .Wp-Block-Post-Author__Content Flex-Basis Flex-Grow .Wp-Block-Post-Author__Name Margin", ".Wp-Block-The-Wrap-Author-Bios__Entry Align-Items Center Display Flex Flex-Wrap Wrap Gap .Wp-Block-The-Wrap-Author-Bios__Entry .Wp-Block-The-Wrap-Author-Bios__Entry Margin-Top .Wp-Block-The-Wrap-Author-Bios__Entry-Excerpt Flex-Basis", ".Wp-Block-The-Wrap-Author-Bios Border-Top Solid", "Margin-Block Padding-Top .Wp-Block-The-Wrap-Author-Bios__Entry-Avatar Display Var --Display-No-Mobile", "Block", "Margin-Bottom .Wp-Block-The-Wrap-Author-Bios__Entry-Avatar Img Border Solid", "Border-Radius Box-Shadow Rgba", "Rgba"], "canonical_link": "https://www.thewrap.com/second-act-film-review-jennifer-lopez/", "title": "‘Second Act’ Film Review: Jennifer Lopez’s Charm Squandered in Tired Rom-Com", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "'Second Act' Film Review: Jennifer Lopez's Charm Squandered in Tired Rom-Com", "description": "The genre is having a resurgence, not that you could tell from this clichéd collection of worn-out tropes and muddled storytelling", "url": "https://www.thewrap.com/second-act-film-review-jennifer-lopez/", "site_name": "TheWrap", "image": {"identifier": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2018/12/second-act-SECOND_Unit_01644R_rgb-1.jpg?fit=618%2C412&quality=89&ssl=1", "width": 618, "height": 412, "type": "image/jpeg"}}, "article": {"author": "https://www.facebook.com/thewrap/", "published_time": "2018-12-20T14:00:44+00:00"}, "author": "Yolanda Machado", "twitter": {"card": "summary_large_image", "creator": "@thewrap", "label1": "Written by", "data1": "Yolanda Machado", "label2": "Est. reading time", "data2": "4 minutes"}, "generator": "WordPress 6.8", "article-tags": "dan_bucatinsky, elaine-goldsmith, jennifer_lopez, justin_zackham, larry-miller, leah_remini, milo_ventimiglia, movie_reviews, second-act, vanessa_hudgens", "article-section": "reviews", "article-categories": "movies, reviews", "msapplication-TileImage": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2024/05/the_wrap_symbol_black_bkg.png?fit=270%2C270&quality=80&ssl=1"}, "movies": ["https://www.youtube.com/embed/YsVo5necW6Q"], "publish_date": 1545314444.0, "source": "https://www.thewrap.com", "summary": ""}