{"url": "https://en.wikipedia.org/wiki/RuPaul%27s_Drag_Race_(season_2)", "text": "2010 season of RuPaul's Drag Race\n\nSeason of television series\n\nThe second season of RuPaul's Drag Race premiered on February 1, 2010, and aired its final episode on April 26 of the same year. On May 1, 2009, the casting website for the series opened, allowing prospective contestants to create user profiles and upload videos of themselves to be voted on by viewers; the applicant collecting the most votes being invited to become a contestant of the second season.[1] At the end of the online casting period, Jessica Wild had collected the most votes and was announced as being a season two contestant. Filming took place during the summer of 2009.[2]\n\nFor season two, the number of contestants was increased from nine to twelve, and the prizes were slightly modified: a lifetime supply of NYX Cosmetics and be the face of nyxcosmetics.com, an exclusive one year public relations contract with LGBT firm Project Publicity, be featured an LA Eyeworks campaign, join the Logo Drag Race tour, and a cash prize of $25,000. A new tradition of writing a farewell message, in lipstick on their workstation mirror, was started by Shangela, the first eliminated queen of the season. Each week's episode is followed by a behind-the-scenes show, RuPaul's Drag Race Untucked.\n\nThe theme song playing during the runway and the end credits every episode is the Gomi and RasJek remix of \"Jealous of My Boogie\" from RuPaul's album Champion. On December 6, 2011, Amazon.com released this season on DVD via their CreateSpace program.[3]\n\nThe winner of the second season of RuPaul's Drag Race was Tyra Sanchez, with Raven placing as runner-up.\n\nSahara Davenport died of heart failure at Johns Hopkins Hospital in Baltimore on October 1, 2012, at age 27.[4] She is the first contestant from RuPaul's Drag Race to pass away.[5]\n\nContestants\n\nAges, names, and cities stated are at time of filming.\n\nNotes:\n\n^ Pandora Boxx was voted Miss Congeniality by the viewers. ^ Now Kylie Sonique Love, she was referred to as Sonique on the show.\n\nContestant progress\n\nLegend:\n\nTyra Sanchez won RuPaul's Drag Race season 2.\n\nRaven was the runner-up.\n\nPandora Boxx was voted Miss Congeniality (Miss C) by the viewers.\n\nWIN indicates that the contestant won the challenge.\n\nSAFE indicates that the contestant was declared safe by the judges.\n\nIMM (Immunity) indicates that the contestant was immune for the episode.\n\nBTM (Bottom) indicates that the contestant was up for elimination.\n\nELIM (Eliminated) indicates that the contestant was eliminated.\n\nGuest indicates that the contestant returned as a guest.\n\nLip syncs\n\nLegend:\n\nThe contestant won the Lip Sync for the Crown and was declared the winner of the season.\n\nThe contestant was eliminated after their first time in the bottom.\n\nThe contestant was eliminated after their second time in the bottom.\n\nThe contestant was eliminated after their third time in the bottom.\n\nGuest judges\n\nListed in chronological order:\n\nEpisodes\n\n\n\n\n\nControversy\n\nTyra Sanchez has gone through many controversies throughout the years since her win in season 2, leading to many people calling for her to be disqualified as the winner of season 2. She has a history of inflammatory tweets [17][18] which either implicitly or explicitly call for violence, which has led to Drag Race distancing itself from her, including her being banned from RuPaul's DragCon LA 2018 after making a potential bomb threat [19] while she claims to be the victim.[20] Sanchez has come under renewed scrutiny in 2025 after posting widely criticised tweets mocking the passings of Drag Race UK Series 1 winner The Vivienne and Rupaul’s Drag Race season 4 contestant Jiggly Caliente. Renewed calls for her disqualification were made, and RuPaul seemingly responded by tweeting a GIF from a scene in season 2 where she appears to slap Tyra.[21]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/96/RuPauls-Drag-Race-S2.jpg/250px-RuPauls-Drag-Race-S2.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Tyra_Sanchez_%28cropped%29_2.jpg/250px-Tyra_Sanchez_%28cropped%29_2.jpg", "https://upload.wikimedia.org/wikipedia/en/9/96/RuPauls-Drag-Race-S2.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/20px-Symbol_category_class.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/9/96/RuPauls-Drag-Race-S2.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/RuPaul%27s_Drag_Race_season_2", "title": "RuPaul's Drag Race season 2", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/9/96/RuPauls-Drag-Race-S2.jpg", "width": 802, "height": 1200}, "title": "RuPaul's Drag Race season 2 - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}