{"url": "www.inquisitr.com/3763416/blac-chyna-shows-post-pregnancy-figure-in-nude-jumpsuit-as-she-takes-king-cairo-to-see-santa/", "text": "New mom Blac Chyna has been busy since giving birth to daughter Dream on November 10. The 28-year-old shared photos earlier this week while taking her 4-year-old son King Cairo to visit Santa at the mall.\n\nBlac Chyna, real name Angela White, posed with King as they sat next to the jolly man himself. She wore a skin-tight nude jumpsuit that flaunted her curves. In true Chyna fashion, the mom-of-two was in full glam for the fun family outing.\n\nWhile big brother King visited with Santa, his baby sister Dream was not in attendance. However, it appeared to be a special mother-son moment as Chyna stood in line to determine if she had been naughty or nice this year. Her full outfit — curves included— was on display in the video post as she laughed and talked with Santa’s helpers.\n\nBefore she even gave birth, Chyna was posting throwback photos of her pre-pregnancy body as she told fans she couldn’t wait to slim down again. Since her daughter’s delivery, Chyna has been updating fans as she loses the baby weight. She shares photos and videos on Snapchat showing her already flat stomach just weeks after giving birth.\n\nIn fact, Chyna seemed to be losing the inches so quickly that she was accused of having weight loss surgery after giving birth, reports Hollywood Life . But she quickly shut the rumors down as she attributed the flat tummy to breast feeding and being small before getting pregnant.\n\n“The only reason it got that flat is from breast-feeding and breast pumping and from my body already being small before my pregnancy.”\n\nIt seems Chyna is determined to prove to fans that she’s serious about losing the baby weight as she continues to step out in revealing outfits. She was spotted on Thursday wearing a black mini dress and thigh-high boots, according to People , that showed off her post-baby body.\n\nHowever, the model had originally said she wanted to gain 100 pounds during her pregnancy, but dropped the goal after gaining about 70.\n\n“Like no lie, my goal is to gain 100 lbs. this pregnancy. I’mma tear it up, and then I’mma snap back.”\n\nIt seems she’s sticking to her plan as she shares her progress via Snapchat and Instagram. Being about three weeks postpartum, Chyna is said to have lost more than 20 pounds in that time, according to Daily Mail . While Chyna has posted on Snapchat that she’s eating healthy, she also shared photos on Instagram of her diet products.\n\nNamely, Chyna is promoting Teami Blends Skinny tea in one Instagram post, as well as in a post during her pregnancy. However, when publicly addressing her impressive weight loss, she mainly credits breastfeeding and her pre-pregnancy figure, according to past Snapchats.\n\nYesterday, Chyna was spotted taking King to a dentist appointment when she once again put her post-pregnancy figure on display, reports Daily Mail . She was photographed wearing tight light green leggings, furry slip-on sandals, and a black zipped-up hoodie as she carried King into the building. Chyna was all smiles as she showed off her shrinking waistline and curvy assets, but once again, baby Dream was not involved in the mother-son outing.\n\nHowever, that’s not to say Chyna and Rob Kardashian are hiding their baby girl from the world. The pair have posted plenty of photos of their new little one to keep fans happy for a while. Chyna’s most recent post of her daughter came three days ago as she uploaded an image of the baby sleeping.\n\nIt seems fans have a lot to look forward to as Chyna continues to keep them updated on her weight loss journey and on how life with baby Dream is going. It’s reported Chyna and Rob still plan to tie the knot sometime in the future as he recently moved in with her to be near Dream.\n\n[Featured Image by Vivien Killilea/Getty Images]", "images": ["https://www.inquisitr.com/wp-content/uploads/2025/10/2421769f-57a4-4bff-913f-cf316747493e.jpg", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20500%20157'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20492%20142'%3E%3C/svg%3E", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo-white.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/inquisitr-logo.png", "https://secure.gravatar.com/avatar/a369debc47cbef84bcb638a0c90682fb?s=120&d=mm&r=g", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent-Dark-Mode.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20120%20120'%3E%3C/svg%3E"], "top_img": "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "keywords": [], "authors": ["News Writer"], "canonical_link": "https://www.inquisitr.com/blac-chyna-shows-post-pregnancy-figure-in-nude-jumpsuit-as-she-takes-king-cairo-to-see-santa", "title": "Blac Chyna Shows Post-Pregnancy Figure In Nude Jumpsuit As She Takes King Cairo To See Santa", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "https://www.inquisitr.com/wp-content/uploads/2024/12/favicon.png", "description": "New mom Blac Chyna has been busy since giving birth to daughter Dream on November 10. The 28-year-old shared photos earlier this week while taking her", "robots": "follow, index, max-snippet:-1, max-video-preview:-1, max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Blac Chyna Shows Post-Pregnancy Figure In Nude Jumpsuit As She Takes King Cairo To See Santa - Inquisitr News", "description": "New mom Blac Chyna has been busy since giving birth to daughter Dream on November 10. The 28-year-old shared photos earlier this week while taking her", "url": "https://www.inquisitr.com/blac-chyna-shows-post-pregnancy-figure-in-nude-jumpsuit-as-she-takes-king-cairo-to-see-santa", "site_name": "Inquisitr News"}, "article": {"tag": "King Cairo", "section": "Entertainment", "published_time": "2016-12-02T19:31:00-05:00"}, "twitter": {"card": "summary_large_image", "title": "Blac Chyna Shows Post-Pregnancy Figure In Nude Jumpsuit As She Takes King Cairo To See Santa - Inquisitr News", "description": "New mom Blac Chyna has been busy since giving birth to daughter Dream on November 10. The 28-year-old shared photos earlier this week while taking her", "site": "@theinquisitr", "creator": "@theinquisitr"}, "generator": "WP Rocket 3.18.3"}, "movies": [], "publish_date": 1480725060.0, "source": "http://www.inquisitr.com", "summary": ""}