{"url": "https://www.thefix.com/david-cassidy-revealed-he-was-still-drinking-didnt-have-dementia-prior-death", "text": "Last year, Partridge Family star David Cassidy announced that he was suffering from dementia. But just two months before he died last November, Cassidy admitted that he never had dementia, but was struggling with alcoholism throughout the end of his life.\n\n“There is no sign of me having dementia at this stage of my life. It was complete alcohol poisoning,” Cassidy explained to A&E producer Saralena Weinfield in a recorded conversation that is now part of a documentary called David Cassidy: The Last Session, which will air on June 11.\n\nAccording to People, Cassidy went on: “The fact is that I lied about my drinking,” he said. “I did this to myself to cover up the sadness and the emptiness.”\n\nIt was no secret that Cassidy battled alcoholism. He was arrested for driving under the influence three times in five years. However, after he went to inpatient rehab in 2014 he told friends and family that he was sober.\n\n“If I take another drink, I’m going to die, physically, mentally, emotionally, spiritually. I’m dead,” Cassidy told Piers Morgan during an interview following that rehab stay. “You know, they say it’s a slippery slope… It’s not a slippery slope. It’s from 12:00 to 6:00 on the clock and the whole face is ice. One sip, one drink, because there is no such thing, not to an alcoholic. You have one and you’re done. I’d be done.”\n\nAdvertisement Will insurance pay for rehab? Check your benefits now.\n\nIn 2017, footage of Cassidy during a live performance appeared to show that he was drunk. It was after that performance that he said he was suffering from a major medical issue—dementia.\n\nHowever, just before his death Cassidy revealed that this was never the case.\n\n“I have a liver disease,” he told Weinfield after he was rushed to the hospital after falling. Two months later Cassidy died of organ failure at the age of 67. Not even his two children knew that he was still problematically drinking alcohol, according to People. However, not everyone was shocked.\n\n“Part of alcoholism is lying,” Partridge Family costar Danny Bonaduce said. “When you’re an addict, you know you can’t be honest with people. You say what you want them to hear. I can’t be mad at David for that, but it’s still a tragedy.”\n\nUltimately, documentary producers said that they decided to use the confession because they felt that Cassidy wanted it made public.\n\n“He wanted to share this very private part of his life, and to be honest once and for all. And I think he succeeded in doing that,” said producer John Marks.", "images": ["https://www.thefix.com/wp-content/uploads/2018/06/DavidCassidy.jpg", "https://thefix.com/wp-content/uploads/2024/03/9251b49b-d818-4307-a507-160bcad64543.png", "data:image/svg+xml;base64,PHN2ZyB2aWV3Qm94PScwIDAgMSAxJyB4bWxucz0naHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmcnPjwvc3ZnPg=="], "top_img": "https://www.thefix.com/wp-content/uploads/2018/06/DavidCassidy.jpg", "keywords": [], "authors": ["Ryan Carandang"], "canonical_link": "https://www.thefix.com/david-cassidy-revealed-he-was-still-drinking-didnt-have-dementia-prior-death/", "title": "David Cassidy Revealed He Was Still Drinking, Didn’t Have Dementia Prior To Death", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Cassidy made the confession to a producer in a recorded conversation, which will air as part of an upcoming documentary about his life.", "og": {"locale": "en_US", "type": "article", "title": "David Cassidy Revealed He Was Still Drinking, Didn't Have Dementia Prior To Death - The Fix", "description": "Cassidy made the confession to a producer in a recorded conversation, which will air as part of an upcoming documentary about his life.", "url": "https://www.thefix.com/david-cassidy-revealed-he-was-still-drinking-didnt-have-dementia-prior-death/", "site_name": "The Fix", "image": {"identifier": "https://www.thefix.com/wp-content/uploads/2018/06/DavidCassidy.jpg", "width": 1000, "height": 689, "type": "image/jpeg"}}, "article": {"published_time": "2018-06-08T17:00:00+00:00", "modified_time": "2024-05-03T06:19:41+00:00"}, "author": "Ryan Carandang", "twitter": {"card": "summary_large_image", "label1": "Written by", "data1": "Ryan Carandang", "label2": "Est. reading time", "data2": "2 minutes"}, "generator": "Elementor 3.32.5; features: e_font_icon_svg, additional_custom_breakpoints; settings: css_print_method-external, google_font-enabled, font_display-swap", "msapplication-TileImage": "https://www.thefix.com/wp-content/uploads/2025/11/favicon.png"}, "movies": [], "publish_date": 1528477200.0, "source": "https://www.thefix.com", "summary": ""}