{"url": "https://www.thewrap.com/lowriders-review-demian-bichir-eva-longoria/", "text": "It’s not a great sign that “Lowriders” begins with mumbled, sullen narration from our protagonist, teenage tagger Danny Alvarez (Gabriel Chavarria, “East Los High”). Nor are we likely to empathize much with the kid when the camera pulls out and we see the aspiring graffiti artist racing to redecorate L.A.’s Sixth Street Bridge — and then use it as an open-air urinal — while his friends worry about the approaching sirens.\n\nClaudia (Yvette Monreal, “Faking It”) has a college scholarship to protect, so she drives off just in time, leaving Danny and his best friend Chuy (Tony Revolori, far from the lobby of “The Grand Budapest Hotel”) literally holding the bag. A couple of spray paint cans are enough to land the boys in jail, though they get bailed out soon enough by Danny’s father, Miguel (Demián Bichir).\n\nMiguel has finally built himself a quiet life, with devoted girlfriend Gloria (Eva Longoria) and an adorable stepdaughter (Montse Hernandez, “Jane the Virgin”) who’s avidly planning her quinceañera. When he’s not with them, Miguel can be found at his car repair shop in Boyle Heights, working on the revered, pristine 1961 Impala he lovingly calls Green Poison.\n\nMiguel — who doesn’t want Danny to join his other son, Francisco (Theo Rossi,”Sons of Anarchy”), behind bars — is intimidating enough to keep Danny on track for a while. But as a recovering alcoholic with lingering anger management issues and a general disdain for human communication, he’s not exactly the easiest guy to connect with. So it’s no surprise that Danny’s an easy mark for Francisco, who gets out of jail nursing a massive, eight-year grudge against his father.\n\nThe fact that this furious family feud takes place against the backdrop of utterly sincere, earnestly competitive car worship inevitably undermines the tension Pervuian director Ricardo de Montreuil intends. He and screenwriters Elgin James and Cheo Hodari Coker fumble intermittently, plotting a straight (and predictable) line of heavily-telegraphed revelations and sentimental interactions. And Danny is neither compelling nor complex enough to shoulder this kind of heavy drama.\n\nBut as the movie pulls back from Danny’s typical teenage resentments, de Montreuil wisely allows the other actors to fill more of the frame. Francisco is thinly-written, but the intensely charismatic Rossi — expect to see much more of him — fleshes the character out in fascinating ways. With his wide grins and narrowed eyes, he keeps us constantly on guard, unsure of Francisco’s motives but worried for Danny’s innocence.\n\nBichir, an Oscar nominee for 2011’s “A Better Life,” is just as impactful. Granted, there are no new insights to be found here about the generational conflict between an artistically wayward son and his old-fashioned, disapproving dad, but the understated Bichir infuses real poignancy into Miguel’s struggles with himself, his history, and his fractured family.\n\nThe film’s women don’t fare quite as well. Longoria deepens her brief scenes with warmth and intelligence, but there’s just not much for her to grab hold of. Similarly, though Monreal and Hernandez pull us in with their sweetly-open presences, neither gets a chance to do anything interesting. And as Danny’s hipster girlfriend Lorelei, Melissa Benoist — who ably carries TV’s “Supergirl” — is reduced to a caricature, a superficial symbol of ignorant gentrification.\n\nWhere de Montreuil excels, though, is in his passionate pushback against that gentrification. Mexican-American culture isn’t merely draped over the story as an added element but woven throughout with a casual practicality that respects both the primary characters and their shot-on-location East L.A. setting.\n\nAs for the cars, the movie’s true infatuation, they’re filmed with a contagious rapture; we fully believe that de Montreuil and cinematographer Andres Sanchez appreciate the high-gloss detail on every vintage GTO and hydraulically-enhanced Chevy as much as the chrome-obsessed characters do. And “Lowriders” gives us plenty of opportunity to ogle the objects of his desire: the packed weekend car clubs that Danny and Miguel frequent are shot with such relaxed intimacy, it feels as though we’re watching documentary footage.\n\nSo yes, as long as de Montreuil races down the plot’s well-worn path, the story sputters. But when he pulls off to indulge in his real passion, the movie rides just as it should — low and slow.", "images": ["https://i0.wp.com/www.thewrap.com/wp-content/uploads/2025/08/5x4_082025_COVER_B.png?fit=240%2C300&quality=80&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2017/05/Photo-6.png?fit=618%2C412&quality=80&ssl=1"], "top_img": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2017/05/Photo-6.png?fit=618%2C412&quality=80&ssl=1", "keywords": [], "authors": ["Elizabeth Weitzman", ".Wp-Block-Post-Author Box-Sizing Border-Box Display Flex Flex-Wrap Wrap .Wp-Block-Post-Author__Byline Font-Size Margin-Bottom Margin-Top Width", ".Wp-Block-Post-Author__Avatar Margin-Right .Wp-Block-Post-Author__Bio Font-Size Margin-Bottom .Wp-Block-Post-Author__Content Flex-Basis Flex-Grow .Wp-Block-Post-Author__Name Margin", ".Wp-Block-The-Wrap-Author-Bios__Entry Align-Items Center Display Flex Flex-Wrap Wrap Gap .Wp-Block-The-Wrap-Author-Bios__Entry .Wp-Block-The-Wrap-Author-Bios__Entry Margin-Top .Wp-Block-The-Wrap-Author-Bios__Entry-Excerpt Flex-Basis", ".Wp-Block-The-Wrap-Author-Bios Border-Top Solid", "Margin-Block Padding-Top .Wp-Block-The-Wrap-Author-Bios__Entry-Avatar Display Var --Display-No-Mobile", "Block", "Margin-Bottom .Wp-Block-The-Wrap-Author-Bios__Entry-Avatar Img Border Solid", "Border-Radius Box-Shadow Rgba", "Rgba"], "canonical_link": "https://www.thewrap.com/lowriders-review-demian-bichir-eva-longoria/", "title": "‘Lowriders’ Review: The Cars Are the Real Stars of This East LA Drama", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "'Lowriders' Review: The Cars Are the Real Stars of This East LA Drama", "description": "Demián Bichir gives this earnest family tale his all, but the drama pales next to the gleam of the custom cars", "url": "https://www.thewrap.com/lowriders-review-demian-bichir-eva-longoria/", "site_name": "TheWrap", "image": {"identifier": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2017/05/Photo-6.png?fit=618%2C412&quality=80&ssl=1", "width": 618, "height": 412, "type": "image/png"}}, "article": {"author": "https://www.facebook.com/thewrap/", "published_time": "2017-05-11T19:59:47+00:00", "modified_time": "2017-05-11T21:11:42+00:00"}, "author": "Elizabeth Weitzman", "twitter": {"card": "summary_large_image", "creator": "@thewrap", "label1": "Written by", "data1": "Elizabeth Weitzman", "label2": "Est. reading time", "data2": "4 minutes"}, "generator": "WordPress 6.8", "article-tags": "demian_bichir, eva_longoria, gabriel-chavarria, lowriders, melissa-benoist, montse-hernandez, movie_reviews, ricardo-de-montreuil, theo-rossi, tony-revolori, yvette-monreal", "article-section": "reviews", "article-categories": "movies, reviews", "msapplication-TileImage": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2024/05/the_wrap_symbol_black_bkg.png?fit=270%2C270&quality=80&ssl=1"}, "movies": ["https://www.youtube.com/embed/-CJj_ZZPZng"], "publish_date": 1494532787.0, "source": "https://www.thewrap.com", "summary": ""}