{"url": "https://www.mirror.co.uk/sport/boxing/deontay-wilders-girlfriend-reality-tv-13664107", "text": "Deontay Wilder's girlfriend reality TV star Telli Swift is famed for WAGS Atlanta appearance\n\nWilder had the support of his fiancee and his children as he became world heayweight champion, knocking out almost every one of his oppponents\n\nMIRROR FIGHTING'S ,DEONTAY WILDER VS TYSON FURY, PREVIEW\n\nDeontay Wilder is not the only famous name in his household.\n\n‌\n\n\n\nHis fiancee Telli Swift is a reality TV star and is often rubbing shoulders with the rich and famous at ringside.\n\n‌\n\n\n\nWilder, who hails from Tuscaloosa, Alabama, has remained true to his roots by training at his local Skyy boxing gym which means he is close to his family during training camps.\n\n‌\n\n\n\nHe has often spoken about how they provide inspiration during the heavyweight world champion's gruelling sessions.\n\nHere is everything you need to know about Ms. Swift as well as Wilder's previous marriage and children...\n\nWho is Telli Swift?\n\nMs. Swift was born in the Philippines on January 24, 1987 Swift to Vivian Crawford and Reginald Swift. She has a brother Reginald Jr.\n\n‌\n\n\n\nView 3 Images Ms. Swfit is a star in her own right (Image: Instagram/TelliSwift)\n\nTelli grew up in Japan and later moved to California. Her real name is Shuntel but she took on Telli when he became well known. She began modelling when she was just three and appeared in a variety of beauty pageants, encouraged by her mum.\n\nWhat is she known for?\n\nAs well as modelling, Telli worked as a plastic surgery nurse in Beverley Hills, as well as in the trauma unit. Most recently she was cast in WAGS Atlanta which airs on E! in the United States.\n\n‌\n\n\n\nTelli also has a website to which she uploads recipes, including one for her favourite food Lumpia, a traditional Filipino appetiser. She also has a personal blog.\n\nWhen did she meet Deontay Wilder?\n\nTelli met Wilder in 2015 at Los Angeles airport and they began dating soon afterwards.\n\nThe couple announced they were expecting a baby last year and held a party to reveal the sex. Shown on WAGS Atlanta, Wilder produced an engagement ring with a huge rock and asked his girlfriend to marry him.\n\n‌\n\n\n\nHe said: \"I love the girl though. She got my heart. That's my baby, that's my best friend.\"\n\nThe couple are yet to announce their wedding plans.\n\nView 3 Images Deontay Wilder with fiancee Telli Swift and their daughter (Image: Instagram/TelliSwift)\n\n‌\n\n\n\nDoes she have any children?\n\nYes, Telli has a son Kerron from a previous relationship who was born in 2007.\n\nAnd she and Deontay welcomed Kaorii Lee Wilder into the world in February this year.\n\nTelli blogged about her daughter: \"She’s an amazing soul!\n\n‌\n\n\n\n\"I swear having a newborn is like falling in love all over again! The feeling is beyond what words can express!!\n\n\"So I know you’ve all been waiting to hear what we’ve named her… It’s Kaorii Lee Wilder.\"\n\nView 3 Images The couple's daughter Kaorii Lee Wilder (Image: Instagram/TelliSwift)\n\n‌\n\n\n\nControversy\n\nEarly in 2018, Telli blogged about an incident that saw her accused of shoplifting. She claims she was the victim of racial profiling when she and her friend were stopped by store security.\n\nShe claimed she was held in the car parking area in full view of other customers and accused of stealing a purse. Telli was eight-and-a-half months pregnant at the time.\n\nWhat is Wilder's dating history?\n\nThe heavyweight world champion was previously married to Jessica Scales-Wilder but their eight-year relationship came to and end in 2017.\n\nArticle continues below\n\nThe couple have four children together and the eldest, daughter Naieya is the reason Wilder became a boxer. He dropped out of school and worked two jobs after she was diagnosed with spina bifida.\n\nHe turned to boxing and the rest is history.\n\nThe couple's other children are Ava, Deontay Jr and Dereon.", "images": ["https://i2-prod.mirror.co.uk/article13664138.ece/ALTERNATES/s615b/0_swiftJPG.jpg", "https://i2-prod.mirror.co.uk/article13664140.ece/ALTERNATES/s615b/0_swift3JPG.jpg", "https://www.mirror.co.uk/footer/ipso.svg", "https://www.mirror.co.uk/footer/trust-project.svg", "https://www.mirror.co.uk/nav-web-static/release-v41-14493b7c888038a7d89b99cb3a7937c2b71eaebe/public/logo-reach.png", "https://i2-prod.mirror.co.uk/article13664140.ece/ALTERNATES/s1200/0_swift3JPG.jpg", "https://www.mirror.co.uk/assets/mirror/logos/masthead-mirror-default.svg", "https://i2-prod.mirror.co.uk/article13664139.ece/ALTERNATES/s615b/0_swift2JPG.jpg", "https://cf-images.eu-west-1.prod.boltdns.net/v1/static/4221396001/19a09904-743b-4802-8f8e-f6fae17b4279/a4bdb7a0-744b-4f6a-8fae-985eaf16adb5/1280x720/match/image.jpg"], "top_img": "https://i2-prod.mirror.co.uk/article13664140.ece/ALTERNATES/s1200/0_swift3JPG.jpg", "keywords": [], "authors": ["Martin Domin", "Updated"], "canonical_link": "https://www.mirror.co.uk/sport/boxing/deontay-wilders-girlfriend-reality-tv-13664107", "title": "Deontay Wilder's girlfriend reality TV star Telli Swift is famed for WAGS Atlanta appearance", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"page_id": 6149699161, "app_id": 123792601022133, "pages": 1814357575554395}, "description": "Wilder had the support of his fiancee and his children as he became world heayweight champion, knocking out almost every one of his oppponents", "author": "Martin Domin", "robots": "noarchive, max-image-preview:large", "Googlebot-News": "noarchive", "referrer": "unsafe-URL", "keywords": "Deontay Wilder, Deontay Wilder vs Tyson Fury", "news_keywords": "Deontay Wilder, Deontay Wilder vs Tyson Fury", "allowTaboolaDeepDive": "true", "vf": {"00000000-0000-4000-8000-67e599051dc3": "mirror-prod-13664107"}, "og": {"title": "Deontay Wilder's fiancee Telli Swift is reality TV star", "description": "Wilder had the support of his fiancee and his children as he became world heayweight champion, knocking out almost every one of his oppponents", "url": "https://www.mirror.co.uk/sport/boxing/deontay-wilders-girlfriend-reality-tv-13664107", "site_name": "Daily Mirror", "locale": "en_GB", "image": "https://i2-prod.mirror.co.uk/article13664140.ece/ALTERNATES/s1200/0_swift3JPG.jpg", "type": "article"}, "article": {"published_time": "2018-11-30T18:48:16Z", "modified_time": "2020-02-18T18:29:26Z", "author": "https://www.facebook.com/mirrorfighting", "section": "Boxing", "tag": "Deontay Wilder vs Tyson Fury"}, "twitter": {"card": "summary_large_image", "site": "@DailyMirror", "creator": "@martin_domin", "title": "Deontay Wilder's girlfriend reality TV star Telli Swift is famed for WAGS Atlanta appearance - The Mirror", "description": "Wilder had the support of his fiancee and his children as he became world heayweight champion, knocking out almost every one of his oppponents", "image": "https://i2-prod.mirror.co.uk/article13664140.ece/ALTERNATES/s1200/0_swift3JPG.jpg"}}, "movies": [], "publish_date": 1543603696.0, "source": "https://www.mirror.co.uk", "summary": ""}