{"url": "www.celebritynetworth.com/richest-businessmen/lawyers/amal-clooney-net-worth/", "text": "What Is Amal Clooney's Net Worth?\n\nAmal Clooney is a British-Lebanese lawyer, activist, and author who has a net worth of $50 million. Outside of her professional career, Amal Clooney is best known for being the wife of actor George Clooney. She previously worked with the United Nations and the British Foreign and Commonwealth Office. She resigned from that role in 2020. She is now a practicing barrister at Doughty Street Chambers. She specializes in international law and human rights.\n\nEarly Life\n\nAmal Alamuddin was born on February 3, 1978, in Beirut, Lebanon. Amal (whose name means \"hope\" in Arabic) moved to England with her family when she was two years old, settling in Buckinghamshire. Her family fled because of the Lebanese Civil War, although her father later returned to his home country in 1991. Amal was raised alongside three siblings and attended an all-girls grammar school as a child.\n\nAfter graduating from secondary school, Amal attended St. Hugh's College in Oxford. After receiving a number of awards for academic excellence, she graduated in 2000 with a BA degree in Jurisprudence. She continued her post-secondary education in 2001, attending New York University School of Law to prepare for her LLM degree. During her time studying in New York, she worked under Judge Sonia Sotomayor.\n\nCareer\n\nAs a qualified lawyer, Alamuddin can work in the UK or the United States. In 2002, she was admitted to the bar in New York, and she subsequently gained similar qualifications in England in Wales. Among her most prominent legal work was at the international courts in The Hague, including the International Criminal Court.\n\nAfter working in New York City for Sullivan & Cromwell, Amal worked as a clerk at the International Court of Justice. She then worked in The Hague for the Office of the Prosecutor at the UN Special Tribunal for Lebanon. In 2010, Amal returned to Britain to work as a barrister. During this period, she was appointed to a number of United Nations commissions. During this period, she worked on several high-profile cases. These included the 2013 Drone Inquiry. She also represented Julian Assange and the entire state of Cambodia over these years.\n\nAlamuddin is also an accomplished teacher, and between 2015 and 2016, she was a visiting faculty member at Columbia Law School's Human Rights Institute. She taught courses on human rights and human rights litigation. In addition, Amal has given lectures on international criminal law at SOAS Law School, The New School, The Hague Academy of International Law, and the University of North Carolina.\n\nIn 2015, Alamuddin began a legal case on behalf of the Armenian government to gain recognition for the Armenian genocide. She continues to represent Armenia on behalf of Doughty Street Chambers and has criticized Turkey's stance as being hypocritical. Numerous Turkish-Armenians had previously campaigned to have the 1915 massacres classified as a genocide.\n\nAlso in 2015, Amal brought a case against the Government of the Philippines for the continued detention of former president Gloria Macapagal-Arroyo. The United Nations later concluded that the former's detention represented a breach of international law. Later that year, Alamuddin joined the legal team defending Mohamed Nasheed, the former president of the Maldives. Nasheed had been sentenced to 13 years in part of what has been described as a kangaroo court. She was later credited with strengthening democracy in the Maldives.\n\nAmal was quite busy in 2015, as she also worked on the so-called \"Hooded Men\" case. This case involved the illegal interrogation methods used by the British government against Irish citizens. In 2016, she spoke at the United Nations for the first time, bringing attention to the rape and slave market organized by ISIL. According to Amal, this included an online slave market on Facebook that exists even to this day.\n\nIn 2019, Amal became a special envoy at the British Foreign and Commonwealth Office, and she worked on securing global media freedom in this role. Although she was passionate about this opportunity, she resigned in 2020 in protest after the UK government allegedly broke international law in connection to Brexit.\n\nRelationships\n\nAmal became engaged to George Clooney in 2014, having met him a year prior through a mutual friend. They married later in 2014 in a ceremony held in Venice. Their wedding caused something of a media frenzy. In 2017, the media went wild once again when Amal and George announced that they were expecting their first child. Later that year, the couple welcomed twins into the world.\n\nActivism\n\nGeorge Clooney and Amal Alamuddin work together on the Clooney Foundation, which the pair co-founded in 2016. The organization strives to advance justice across the world. The couple also started the Amal Clooney Scholarship, which provides funding for one female Lebanese student to enroll in a 2-year International Baccalaureate programme.\n\nReal Estate\n\nAmal and her husband, George Clooney, have an extensive real estate portfolio. They own properties in Europe and the United States. Among their most notable residences are a villa on Lake Como in Italy and a $13 million mansion in England. Clooney owns an additional $13 million mansion in Laglio, Italy, and the couple also once owned a vacation home in San Lucas, Mexico.\n\nIn 2016, the pair purchased an apartment in the luxurious One Hundred Fifty-Third Street building in New York City. Although the cost of this apartment is unknown, the penthouse suite on this complex is worth $65 million. Some of their less notable properties are in places like Las Vegas and Studio City. Many of these properties were purchased long before Clooney married Amal.", "images": ["https://vz.cnwimg.com/thm/1JoH3482haSLevnlEMdqhrz36y0=/132x132/center/top/filters:format(webp)/2009/11/George-Clooney.jpg", "https://vz.cnwimg.com/thm/lBIrKe1YDJyqpXTrCiF7cjI9_vM=/132x132/center/top/filters:format(webp)/2025/05/Keir-Starmer.jpg", "https://vz.cnwimg.com/thm/I4dSiTJhq0kprSuO--deoPCEAmQ=/132x132/center/top/filters:format(webp)/2020/06/taylor.png", "https://vz.cnwimg.com/thm/uRsxoLs7Ymmit5ATgRtN2utad40=/221x5:381x236/132x132/filters:format(webp):strip_exif()/2009/09/P-Diddy.jpg", "https://vz.cnwimg.com/wp-content/uploads/2014/12/cloon.jpg?x46379", "https://vz.cnwimg.com/thm/ZYNKwYlhiqALDe_tezb_oUyJZfU=/132x132/center/top/filters:format(webp)/2010/03/Serj-Tankian.jpg", "https://vz.cnwimg.com/thm/z1ON08vmVp9jeRQIjvKKWpWlaPI=/132x132/center/top/filters:format(webp)/2014/10/martine-e1413953616504.jpg", "https://vz.cnwimg.com/thm/KNDSqD-9inbRekV6AGgXDEG2Scw=/375x35:810x586/132x132/filters:format(webp):strip_exif()/2015/09/GettyImages-476575299.jpg", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "http://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/thm/_hOmdPz8Ht24ZxIeZM7m4mGRouk=/132x132/center/top/filters:format(webp)/2019/11/GettyImages-1094653148.jpg", "https://vz.cnwimg.com/thm/Y14fttV9jls9mxFLuNAHJTnNWTE=/132x132/center/top/filters:format(webp)/2019/10/denzel-washington-1.jpg", "https://vz.cnwimg.com/thm/yboGsO77E1kQwELLmrwRZv_4RmE=/132x132/center/top/filters:format(webp)/2017/02/GettyImages-528215436.jpg", "https://vz.cnwimg.com/thm/lt1abKKVHSBtY-US0k9GLU9MTmM=/132x132/center/top/filters:format(webp)/2009/09/Brad-Pitt.jpg", "https://vz.cnwimg.com/thm/eLwQ8-ZlvPNMvrc4fQCcuu4qcAY=/600x300/center/top/filters:format(webp)/2014/12/cloon.jpg", "https://vz.cnwimg.com/thm/35QzSyuh7ARMDT3YuEbuHP000T0=/132x132/center/top/filters:format(webp)/2022/01/Alan-Dershowitz.png", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/thm/dXuAPIEBU--L_kRib4u0nSzjUtE=/132x132/center/top/filters:format(webp)/2020/04/Megan-Fox.jpg", "https://vz.cnwimg.com/thm/lY3-oCS-xIdiqDaOi1qHd6UaTjg=/132x132/center/top/filters:format(webp)/2009/09/Cristiano-Ronaldo.jpg", "https://vz.cnwimg.com/thm/95i5RI1LWkjHyyoolMeto-z_WeU=/132x132/center/top/filters:format(webp)/2020/01/lopez3.jpg", "https://vz.cnwimg.com/thm/KFAqJ9F4o80l6an2fe78-0jw28s=/132x132/center/top/filters:format(webp)/2019/04/rr.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2014/12/cloon.jpg?x46379", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-businessmen/lawyers/amal-clooney-net-worth/", "title": "Amal Clooney Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Amal Alamuddin Net Worth: Amal Alamuddin is a London-based British-Lebanese lawyer, activist and author who has a net worth of", "slick": {"wpversion": "3.0.1", "wppostid": 120421, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2014/12/cloon.jpg?x46379", "group": "post", "category": "lawyers:Lawyers"}, ";": "richest-businessmen:Richest Business", "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "cnw": {"wppostid": 120421}, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Amal Clooney Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-businessmen/lawyers/amal-clooney-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2014/12/cloon.jpg?x46379", "site_name": "Celebrity Net Worth", "description": "What is Amal Clooney's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2024-08-29T17:38:29+00:00", "published_time": "2020-09-06T19:01:49+00:00", "section": "Lawyers", "tag": "amal clooney worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2014/12/cloon.jpg?x46379", "title": "Amal Clooney Net Worth", "description": "Amal Alamuddin Net Worth: Amal Alamuddin is a London-based British-Lebanese lawyer, activist and author who has a net worth of"}}, "movies": [], "publish_date": 1599418909.0, "source": "http://www.celebritynetworth.com", "summary": ""}