{"url": "http://library.cqpress.com/cqresearcher/document.php?id=cqresrre2005031800&type=query&num=Hollywood", "text": "'Star' Gladiators\n\nFame and celebrity are nothing new to human civilization. As humans progressed from spending all their time hunting and gathering, those who excelled at war, sports, politics and the arts captured the imagination, says Blake at the College of New Jersey.\n\n“Many scholars find it useful to distinguish between fame and celebrity, connecting fame to the kind of renown people achieve for extraordinary talents or achievements, and celebrity for the kind of meretricious notoriety that is so prevalent today and so frequently criticized — the state of being known for being known,” notes Blake.\n\n“I'm inclined to see fluidity between these two terms, to see them as having differences in degree rather than kind,” Blake continues. “For someone like Alexander the Great, or Caesar, fame was an important, motivating force. Ovid compared fame to a spur, propelling men to greater accomplishments.\n\n“Being a celebrity adds a new dimension to this immortality, for it suggests that one is actively celebrated by the crowd. The original Latin meaning of celebrity is “to be thronged.” Along with this comes a sense of visibility, a sense of being widely recognized and known. How frequently are you seen? How visible is your face? As one wag put it, God may be famous, but Jesus is the celebrity.”\n\nThe first celebrities may have been the cave dwellers who began leaving their artistic marks some 40,000 years ago, but there are no records identifying any of them. The first known celebrities probably were the Pharaohs, such as the first “power couple,” Akhenaten and his beautiful wife Nefertiti, who lived 3,500 years ago.\n\nThe Golden Era of Greece, about five centuries before the birth of Christ, produced great thinkers like the mathematician Pythagoras and the philosopher Socrates.\n\nPerhaps not surprisingly, one of the earliest celebrities was an athlete: Milo of Kroton, a five-time Olympic wrestling champion whose fame was at its height between 532 and 516 B.C. Hans van Wees, a lecturer in ancient Greek history at University College, London, says such athletes were accorded the same high status enjoyed by today's superstars. 9\n\n“They were not only widely talked about but also given red-carpet treatment,” van Wees says. When they returned home, for instance, part of the city wall was demolished so they did not have to use the gates like “ordinary mortals,” he says.\n\nThe athletes also won the lifelong right to free meals and would advertise their fame by commissioning hymns of praise from famous poets that would be performed in their honor — probably “the next best thing to appearing on TV,” van Wees says. 10\n\nDuring the Roman Empire, other “athletes” — including the slaves who became gladiators — achieved fame. And Greeks were followed by the context of their celebrity, which speaks volumes about the political and social order of the day.\n\nBy 65 B.C., as Caesar was pitting 320 pairs of gladiators against each other in an amphitheater at one time, news of gladiators' battles spread by word of mouth. 11 Boys idolized them, often taking lessons at gladiator schools, while women were known to have affairs with them. 12\n\nA year later, Cleopatra, history's enduring icon of sex, beauty and political intrigue, was born. She lived for 39 years before famously committing suicide by raising an asp to her breast.\n\nOne of the first writers to win fame and celebrity was the Roman historian Tacitus (55-120 A.D.). His seminal work, The Annals, chronicled the nexus between fame and power in Rome.\n\nTacitus' description of Roman consul Caius Petronius, for instance, sounds like a precursor of the recent TV show, “Lifestyles of the Rich and Famous:” “His days he passed in sleep, his nights in the business and pleasures of life. Indolence had raised him to fame, as energy raises others, and he was reckoned not a debauchee and spendthrift, like most of those who squander their substance, but a man of refined luxury.” 13\n\nTacitus' nuanced examination of Petronius is just one of many instances where the writer investigated the machinations and foibles of the power players of his day. “The love of fame is the last weakness which even the wise resign,” he observed. 14\n\nIn the ensuing centuries, artists, athletes, writers, rulers, discoverers and conquerors became celebrities — until the nature of celebrity changed drastically.\n\nModern Celebrity\n\nBy the time William Shakespeare arrived on the scene in the mid-16th century, times were changing. England had a very famous woman — Elizabeth I — making history, and dramatic shifts in science, religion and culture were occurring.\n\nThe Elizabethan era saw popular theater become a major source of entertainment for the masses. The clergy and scholars may have disapproved of such “corrupt” entertainment, but it turned Shakespeare into London's most celebrated playwright.\n\nOther writers gained recognition as literacy rates improved. 15 And the more people read, the more they wanted to know about the writers.\n\nSinger Britney Spears is a popular magazine subject as much for her marriages and peccadilloes as for her talent and glamorous appearance. (AFP Photo/Jorge Uzon)\n\n“Celebrity, as we know the term, begins to appear in the 18th century with the increasing importance of the public sphere,” Blake says. “As people came to recognize the public as an entity separate from the government and the church, as newspapers began to turn their attention to items of public interest, a new class of people emerged as the recipients of widespread attention.”\n\nAlthough these individuals, were most frequently known for their exceptional skill — Alexander Pope, Jean Jacques Rousseau, Lord Byron — people were frequently interested in their private lives and their personalities, Blake says. By the middle of the 19th century, the notion of celebrity had grown to embrace well-known people in society who were glamorous or fashionable. During a trip to England, for example, American poet Ralph Waldo Emerson described meeting “celebrities of wealth and fashion.”\n\nInventors Nikola Tesla and Thomas Edison amped up the public's newfound fascination with the private lives of the well-known. Tesla, who made alternating current usable, and Edison, whose inventions included the phonograph and moving images, gave the masses the sounds and images of the famous or the soon-to-be famous.\n\nThe increasing popularity of moving pictures in the second decade of the 20th century proved pivotal in making celebrities ubiquitous in American society.\n\nStar System\n\nIn 1910, producer Carl Laemmle triggered the rise of the American movie-star phenomenon by creating the first movie star through a massive publicity campaign. Now forgotten, Florence Lawrence was known coast to coast as the “Vitagraph Girl.” 16\n\nThat same year, film companies began to move to the area later known as Hollywood, and director D. W. Griffith and Biograph Studios released “In Old California,” the first film made in Hollywood.\n\nIn 1911 Photoplay, the first, true movie fan magazine debuted and gave rise to the whole idea of a celebrity culture. Soon afterward, Motion Picture Stories, The Moving Picture World and The Motion Picture News also offered interviews and gossipy columns about the personal lives and careers of the stars. 17\n\nFascination with the private lives of public figures fueled a feverish interest in the 1921 arrest and subsequent trials of silent-film comedian Roscoe “Fatty” Arbuckle, presaging today's media frenzy over Michael Jackson. Arbuckle was charged with the rape and murder of actress Virginia Rappe during a wild party in San Francisco. Tabloids sensationalized the crime and concocted stories about Arbuckle's “bottle party.” Although he was acquitted in multiple manslaughter trials, Arbuckle saw his career end, while Hollywood was forever linked in the public's view as wild and scandalous. 18\n\nIn the wake of the Arbuckle scandal, efforts were made to police the industry, including the creation of the Hays Office, designed to clean up Hollywood through censorship and public relations.\n\nInevitably, the nation's fascination with Hollywood doings gave rise to Walter Winchell, the Jazz Era's most famous, and influential, gossip columnist. Each week he wrote six fast-paced columns that appeared in nearly 2,000 newspapers. In the 1930s he added Sunday radio broadcasts. With his columns and his distinctive, staccato radio voice, he reached 50 million homes.\n\n“Feeding the public's craving for scandal and gossip, he became the most powerful — and feared — journalist of his time,” wrote biographer Ralph D. Gardner. “His articles were loaded with snappy, acerbic banter. Broadcasts were slangy, narrated with machine-gun rapidity, a telegraph key clicking in the background. 'Good evening Mr. and Mrs. North and South America and all ships at sea,' his programs began, Let's go to press!' ” 19\n\nWinchell helped foster the rise of such modern, gossipy publications as People magazine, launched in 1974. But it was the unveiling of a technological marvel at the 1939 World's Fair that almost single-handedly ushered in a whole new world of celebrity culture. The future rival to radio and film — television — was formally introduced to the world when the Radio Corporation of America (RCA) displayed the first TV sets for sale to the American public. 20\n\nKanazawa, at the London School of Economics and Science, says TV had a profound influence on society. Kanazawa studied television's role in creating “imaginary friends” — celebrities who are seen increasingly as replacements for real friends.\n\n“The major change in the history of celebrity worship was the invention, and then subsequent spread, of television,” he says. “Before TV, the only way for people to have 'imaginary friends' was to watch a movie, or read a magazine. So the effect of the exposure to “imaginary friends” was minimal. TV changed all that. It is in your living room, you can watch it every day, and, nowadays, 24 hours a day. So we should feel a lot closer to our imaginary friends than we used to before the spread of TV.”\n\nCommunications Revolution\n\nToday's celebrity culture is largely possible because of changes in how we communicate. The printing press helped spread The Word, as well as a love of words. In 1776, it helped spread a revolution in Colonial America. A century later, the development of electrification begat the modern era of movies, radio, television and, ultimately, the Internet.\n\nBut even as recently as the late 1960s, the world of communications was a very different place from what it is today. In every major city, there were usually at least two daily newspapers, three networks and no cable or Internet. The big story of the day did not have to fight for attention with myriad other media outlets, argues David T. Z. Mindich, an associate professor of journalism and mass communication at Saint Michael's College, in Colchester, Vt.\n\n“On Feb. 27, 1968, when [CBS anchorman] Walter Cronkite made his famous remark that 'we are mired in the stalemate of Vietnam,' he was competing against two or three other news and public-affairs shows, two movies and a couple of sitcoms — 'F-Troop' and 'I Love Lucy,' ” Mindich says. “There were seven TV stations in New York City at the time, four of them devoted to news and public affairs, three to entertainment. Today, much less of the TV universe is devoted to news and public affairs, so it is much more possible to watch television all day long, and not get any news.”", "images": ["https://stpltrsrcscmnprdwus001.blob.core.windows.net/rsrcs/cq/images/celebrity-culture-cqresrre20050318/1000020050318-realworld.jpg", "http://library.cqpress.com/images/shared/footer-icons/mail.svg", "https://stpltrsrcscmnprdwus001.blob.core.windows.net/rsrcs/cq/images/celebrity-culture-cqresrre20050318/1000020050318-life.jpg", "https://stpltrsrcscmnprdwus001.blob.core.windows.net/rsrcs/cq/images/celebrity-culture-cqresrre20050318/1000020050318-mj.jpg", "http://library.cqpress.com/images/shared/video/video-embed.png", "https://stpltrsrcscmnprdwus001.blob.core.windows.net/rsrcs/cq/images/celebrity-culture-cqresrre20050318/1000020050318-dubyaandarhnold.jpg", "https://securecenter.sagepub.com/Logo/1/52cacd43-9c29-42d0-9b50-f66ead8e50e4", "https://stpltrsrcscmnprdwus001.blob.core.windows.net/rsrcs/cq/images/celebrity-culture-cqresrre20050318/1000020050318-magcovers.gif", "http://library.cqpress.com/images/shared/spinning-circles.svg", "https://stpltrsrcscmnprdwus001.blob.core.windows.net/rsrcs/cq/images/celebrity-culture-cqresrre20050318/1000020050318-coverage.gif", "http://library.cqpress.com/images/shared/icons/bullet.svg", "http://library.cqpress.com/images/cq/product-icons/cqpress.svg", "http://library.cqpress.com/images/shared/footer-icons/about.svg", "https://stpltrsrcscmnprdwus001.blob.core.windows.net/rsrcs/cq/images/celebrity-culture-cqresrre20050318/1000020050318-cover.jpg", "https://stpltrsrcscmnprdwus001.blob.core.windows.net/rsrcs/cq/images/celebrity-culture-cqresrre20050318/1000020050318-beckinsale.jpg", "https://stpltrsrcscmnprdwus001.blob.core.windows.net/rsrcs/cq/images/celebrity-culture-cqresrre20050318/1000020050318-britney.jpg", "http://library.cqpress.com/images/cq/covers/not-available/reports.jpg", "https://stpltrsrcscmnprdwus001.blob.core.windows.net/rsrcs/cq/images/celebrity-culture-cqresrre20050318/1000020050318-pageone.jpg", "https://stpltrsrcscmnprdwus001.blob.core.windows.net/rsrcs/cq/images/celebrity-culture-cqresrre20050318/1000020050318-coverspread.jpg", "https://stpltrsrcscmnprdwus001.blob.core.windows.net/rsrcs/cq/images/celebrity-culture-cqresrre20050318/1000020050318-ruobsessed.gif", "http://library.cqpress.com/images/shared/footer-icons/information.svg"], "top_img": "", "keywords": [], "authors": ["Howard Altman", "James Houran", "Dennis Mccafferty"], "canonical_link": "https://cqpress.sagepub.com/cqresearcher/report/celebrity-culture-cqresrre20050318", "title": "Celebrity Culture", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "noarchive", "citation_xml_url": "https://cqpress.sagepub.com/xml/celebrity-culture-cqresrre20050318/content.xml", "citation_publisher": "CQ Press", "citation_author": "Howard Altman", "citation_title": "Celebrity Culture", "citation_publication_date": 2005, "citation_online_date": "2005/03/18", "citation_doi": "10.4135/cqresrre20050318", "citation_pdf_url": "https://cqpress.sagepub.com/cqresearcher/report/download/celebrity-culture-cqresrre20050318.pdf", "citation_language": "en", "citation_isbn": 1000020050318, "theme-color": "#630361"}, "movies": [], "publish_date": 1132462800.0, "source": "http://library.cqpress.com", "summary": ""}