{"url": "www.marieclaire.com/celebrity/a18714598/jennifer-aniston-brad-pitt-justin-theroux-relationship-body-language/", "text": "In case you're still in denial, here's your weekly reminder that Jennifer Aniston and Justin Theroux are getting divorced after seven years together. And if you were—or maybe, still are—a #Brennifer fan, you'd know that Jen's relationship with Brad Pitt also ended after seven years, leaving us wondering: Is Jen a victim of the \"7-Year Itch\"?\n\nThe news of both divorces shocked many fans who—based on how each couple carried themselves until the end of the relationship—didn't see it coming. Did we, by chance, miss some sort of discreet signals in their body language that would have given us reason to believe separation was imminent?\n\nMaybe. Here, body language expert Patti Wood analyzes the nonverbal cues found in images of each couple, taken at three different phases of their relationships: the beginning, the marriage, and just before the divorce.\n\nJennifer Aniston and Brad Pitt\n\n(Image credit: Getty Images)\n\n1998: When they first met.\n\nWhen Jen and Brad went on their first date in 1998, they gave off relationship vibes via mutual touch. \"We're seeing it here, how often he had his arm around her waist, and she would reciprocate with her arm around him,\" Wood explains.\n\n\"That kind of ritualistic habit of touching each other in the same way is very comforting to your partner,\" she continues. \"It says, 'When we're out together, I'm going to always do this...I never want to be more than an arms length away.'\"\n\nOne thing to keep in mind about Brad is that he is a \"C personality type,\" according to Wood. This means that his facial expressions are more subtle; he tends to smile less in photos or save his smiles for more intimate, private moments.\n\n(Image credit: Getty Images)\n\n2000: When they got married.\n\nNotice Jens's smile in this photo. Wood describes it as \"real pleasure,\" which makes a lot of sense considering the photo was taken just months before Brad and Jen's wedding. And despite the space between them—which is a huge indicator of distance in a relationship—Wood says the relationship was in a good place; the pull away must have been due to movement here. We know this because other clues override the separation: the smile on Jen's face, the way their fingers are interlocked, and the placement of their feet.\n\nStay In The Know Get exclusive access to fashion and beauty trends, hot-off-the-press celebrity news, and more. Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nFeet were very important in Wood's analysis of Brad and Jen. She points out that they often stand on the \"same plane,\" meaning that \"one mate doesn't step forward,\" and that \"this is a couple that is equally balanced in power and affection.\" This was not the case in Brad's relationship with Angelina Jolie, who was always several steps ahead of him in all their photos together.\n\n(Image credit: Getty Images)\n\n2004: The year before their divorce.\n\nLook at how unusual—and almost awkward—their bodies are positioned in this photo. It's one of the few times we see Brad and Jen not in a mutual touch (think back to the first photo), but rather keeping to themselves by lying their hands flat on their own laps. Also, the fact that Brad's leg is crossed away from Jen is a clue that there is some stress in their relationship.\n\n\"Jen is making all the effort to be seen with him as his mate, as a unit, and as a couple,\" Wood explains. \"She's doing this big lean of her shoulders and a big lean of her head, saying 'We are a couple.'\"\n\nWood, who has studied many photos of Brad and Jen as a couple, says their body language toward the end of their relationship didn't show many signs of a split. But she recalls seeing a photo in 2004 of Brad with Angelina on the set of Mr. and Mrs. Smith, and knowing there would be trouble. \"I looked at them on that balcony together and I go, 'She's spider woman, she's gonna get him.' I had never been that strong about a photo read before,\" she says.\n\nJennifer Aniston and Justin Theroux\n\n2011: When they first met.\n\nIn one of the first photos of Justin and Jen together, we saw him tenderly kissing the side of her head, which Wood says was \"not a top-down kiss,\" meaning it's not the kind of kiss that says, \"You're my child or you're less-than.\"\n\nThis was a meaningful embrace that showed equanimity. Wood points out that they stopped walking down the street to share a moment together, and that's really important in the beginning of a relationship.\n\n\n\nAlso, notice how Justin and Jen are pressed against each other. This kind of body language \"shows the desire to be closer—to be merged at another level.\" There is tension on Jen's face, though Wood said this is not a relationship cue, but likely due to being photographed by the paparazzi.\n\n(Image credit: Getty Images)\n\n2015: When they got married.\n\nThe newlyweds of three months are pictured in a tight embrace, both leaning toward each other. Jen's got her head on Justin's shoulder, and their bodies are overlapping—often an indicator of nice sexual connection.\n\nWood says, here, Justin wants to be the strong man, so he's very relaxed and has a solemn expression. She points out that Jen almost has a look of sadness or relief.\n\n\"She's got compressed lips in this photo. It's almost like, 'I can't believe it. I can't believe I have this,'\" Wood says, adding that her expression would make sense at the time, considering they were just married after having been together for four years.\n\n2017: The year before their divorce.\n\nThe tension is real in this photo of Justin and Jen, taken seven months before they announced their split. Wood first points out Jen's downward, tight smile which shows \"a bit of wistfulness or sadness, and that she's compressing or withholding. There's something she's keeping inside.\"\n\nWe can't know for sure if what's making her feel that way is couple-based or not—especially since Justin looks very comfortable and at ease in this photo. Wood says Justin's body orientation—slightly angled toward her, not away from her—shows that he is fine being seen as a couple. And Jen's making the extra effort here (again!) by placing her hand in his lap. So, there were no mutual signals that would point to divorce here.\n\n(Image credit: Getty Images)\n\nConclusion\n\nIn summary: In Brad and Jen's relationship there was a balance of power and affection. Throughout their time together, they were often spotted with arms wrapped around each other in a mutual, comforting way.\n\nComparing Justin and Jen's relationship, we learned that they were a more sexualized couple. There were many instances of him kissing her forehead or looking into her eyes, which shows there was \"intimacy and heat.\"\n\nSo, we're left with the ultimate question: Will Jen and Brad get back together? Wood thinks Brad could seek the kind of stability and balance that Jen offered him. Angelina gave him an astonishingly different kind of partnership because she was \"wild,\" and completely opposite of Jen.\n\nHere's to waiting and wondering.\n\nRELATED STORIES (Image credit: Getty Images) A Brief History Lesson on Brad and Jen", "images": ["https://cdn.mos.cms.futurecdn.net/H2cfsEoqrzbuXeBydyTMPk.jpg", "https://cdn.mos.cms.futurecdn.net/LCM8h2rAfzXDaBaPiYfknT.jpg", "https://cdn.mos.cms.futurecdn.net/yVGAsVvmFsN8ANkGrgXkLJ.jpg", "https://cdn.mos.cms.futurecdn.net/4hXsQ2YzwKJ5GSmnmsECV3.jpg", "https://cdn.mos.cms.futurecdn.net/42P4Vcm4UTGrmwhGAU9wfT-200-80.jpg", "https://cdn.mos.cms.futurecdn.net/HcHkbSbyLqenuwqM8uRDHT.jpg", "https://cdn.mos.cms.futurecdn.net/9M2HNvAPq7ksn4oRxvGhzU.jpg", "https://cdn.mos.cms.futurecdn.net/8SpaBn8xSagxpPnYDv2jGj.jpg", "https://cdn.mos.cms.futurecdn.net/flexiimages/mednnv697g1760357120.png", "https://cdn.mos.cms.futurecdn.net/42P4Vcm4UTGrmwhGAU9wfT.jpg", "https://cdn.mos.cms.futurecdn.net/zCWjwfXxPagwMphD8Dc2Tj.jpg", "https://cdn.mos.cms.futurecdn.net/Y9ryouiPGrQhpQDz7pwig6.jpg", "https://cdn.mos.cms.futurecdn.net/6h5NN9SpMRAcnWzRaSnCkE.jpg", "https://sb.scorecardresearch.com/p/?c1=2&c2=10055482&cv=4.4.0&cj=1", "https://cdn.mos.cms.futurecdn.net/yB7vg7Fx6R9Jdze7a4rQsc.jpg", "https://cdn.mos.cms.futurecdn.net/zzJ5CpVBTk5ykitz5Q6AUf-2560-80.jpg", "https://cdn.mos.cms.futurecdn.net/h8nuxUZGK57owHGNVwvN3Z.jpg", "https://cdn.mos.cms.futurecdn.net/SJGyBJMUje6ak3WSCwBQu6.jpg", "https://cdn.mos.cms.futurecdn.net/ekH4VKrxvjWxCiQVdsY7Km.jpg", "https://cdn.mos.cms.futurecdn.net/6YWfrVdQCW6toi9CAYRnh7.jpg", "https://cdn.mos.cms.futurecdn.net/mkzsZ9izerjV4LPCxG4P4E.jpg", "https://cdn.mos.cms.futurecdn.net/3KT2MB6TQrMDfuUdPwBD8e.jpg", "https://cdn.mos.cms.futurecdn.net/QUeuYCEGzSzpiz2EHQdwaN.jpg", "https://cdn.mos.cms.futurecdn.net/V2yz4F63YMo6p9gA85vQwV.jpg", "https://cdn.mos.cms.futurecdn.net/8sqfeXtZBNYW7vWt9mwqYk.jpg", "https://cdn.mos.cms.futurecdn.net/y6C95sG5CDkBff75iuWWAD.jpg", "https://cdn.mos.cms.futurecdn.net/zzJ5CpVBTk5ykitz5Q6AUf.jpg", "https://cdn.mos.cms.futurecdn.net/o7aQVq9mmPKy22AnyP6eCj.jpg", "https://cdn.mos.cms.futurecdn.net/XYPR2bx4huyHRDqkM6Fpzb.jpg", "https://cdn.mos.cms.futurecdn.net/FrP8vkwDYpVwu58dY9AgX8.jpg", "https://cdn.mos.cms.futurecdn.net/aCQSPiNUky5cqB6sn9b7QP.jpg", "https://cdn.mos.cms.futurecdn.net/8hdyArQ3vTcTtJD8dZrGxh.png", "https://cdn.mos.cms.futurecdn.net/eq96K5JMYqReBSsziY5QuV.jpg", "https://cdn.mos.cms.futurecdn.net/KLEpn9AZ2q4p7AWeTfBMeV.jpg", "https://cdn.mos.cms.futurecdn.net/Gff7fxuc2JxrPmmPDLH8kL.jpg", "https://cdn.mos.cms.futurecdn.net/BMXr68TbZcXVBEtZqhgRX9.jpg", "https://cdn.mos.cms.futurecdn.net/u7y2xCupii2d2X8BMUvShe.jpg", "https://cdn.mos.cms.futurecdn.net/flexiimages/yo0epfjohr1645112637.svg", "https://cdn.mos.cms.futurecdn.net/jTN2NUVcBqT36j6sxzeqF6.jpg", "https://cdn.mos.cms.futurecdn.net/kWxfacKm9pRWFVf7hWj3qF.jpg", "https://cdn.mos.cms.futurecdn.net/R7i4RhTLpJndonfiSV49zW.jpg"], "top_img": "https://cdn.mos.cms.futurecdn.net/zzJ5CpVBTk5ykitz5Q6AUf-2560-80.jpg", "keywords": [], "authors": ["Alex Warner", "Social Links Navigation"], "canonical_link": "https://www.marieclaire.com/celebrity/a18714598/jennifer-aniston-brad-pitt-justin-theroux-relationship-body-language/", "title": "An In-Depth Analysis of Jennifer Aniston's Body Language with Justin Theroux Versus Brad Pitt", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "pub_date": "2018-02-27T10:30:29+00:00", "description": "A body-language expert compared the non-verbal cues in Jennifer Aniston's body language during her relationship with Brad Pitt and during her relationship with Justin Theroux.", "robots": "max-image-preview:large", "msapplication-TileColor": "#000000", "msapplication-TileImage": "https://cdn.mos.cms.futurecdn.net/flexiimages/l0uowirhzd1627591128.svg", "og": {"site_name": "Marie Claire", "image": {"identifier": "https://cdn.mos.cms.futurecdn.net/zzJ5CpVBTk5ykitz5Q6AUf-2560-80.jpg", "width": 2560, "height": 1440}, "type": "article", "title": "An In-Depth Analysis of Jennifer Aniston's Body Language with Justin Theroux Versus Brad Pitt", "url": "https://www.marieclaire.com/celebrity/a18714598/jennifer-aniston-brad-pitt-justin-theroux-relationship-body-language/", "description": "Were the signs there all along?"}, "article": {"publisher": "https://www.facebook.com/MarieClaire", "published_time": "2018-02-27T10:30:29Z"}, "mrf": {"tags": "region:US;articleType:News;control:standard-article;control:serversidehawk;control:van-enable-adviser-more-about;category:Celebrity;freeform:relationships;freeform:Brad Pitt;freeform:Jennifer Aniston;unindexedFreeform:celebrity"}, "twitter": {"card": "summary_large_image", "site": "@marieclaireus", "title": "An In-Depth Analysis of Jennifer Aniston's Body Language with Justin Theroux Versus Brad Pitt", "description": "Were the signs there all along?", "creator": "@marieclaireus", "image": "https://cdn.mos.cms.futurecdn.net/zzJ5CpVBTk5ykitz5Q6AUf-1200-80.jpg", "account_id": 15469402}, "google-site-verification": "G8uYPAX70T_vfdmDhxnUNSykxtjRTkSvHhloGBWT6R8", "msvalidate.01": "CC462E6DF91492086145CA5EBDCB615E"}, "movies": [], "publish_date": 1519727429.0, "source": "http://www.marieclaire.com", "summary": ""}