{"url": "https://revolt.tv/stories/2018/01/18/cardi-makes-history-recordbreaking-stats-070002bd04", "text": "Image Image Credit Mike Coppola / Staff via Getty Images Image Alt Cardi B\n\nUPDATE (April 2018): Following the release of her debut album Invasion of Privacy, Cardi B has added more stats to her résumé.\n\nAccording to Apple’s figures, the album set a new Apple Music record for the most streamed album by a female artist in a single week with more than 100 million streams worldwide. The feat shatters the previous record, which was held by Taylor Swift’s Reputation. Invasion of Privacy is now the fifth most-streamed album ever on Apple Music.\n\nMore updates have been noted below.\n\nMore than money moves, Cardi B has spent the last six months making history… moves.\n\nAs if 2017 didn’t provide enough rewards for her to bag up, the trailblazing rapper continues adding new trophies to her mantle piece. This week, Cardi surpassed Beyoncé to become the first woman to have five Top 10 singles chart simultaneously on the Hot R&B/Hip-Hop songs chart. Last week, she was announced to perform at the upcoming 2018 Grammys, where she is up for two awards. Altogether, this is all how she kicked off 2018.\n\nWith more moves to come, including a reported movie deal, we did a deep dive into Cardi B’s accomplishments to illustrate just the kind of run she is having.\n\nFirst solo female MC to top the Billboard Hot 100\n\nIn September 2017, Cardi became the first female rapper to go No. 1 in nearly 20 years without a featured credited artist. The last artist to do so was Lauryn Hill in 1998 with “Doo-Wop (That Thing).” It’s also worth noting that Cardi’s hit song also dethroned pop’s oft-record-breaking titan Taylor Swift and her comeback single “Look What you Made Me Do.”\n\nLongest-running No. 1 by solo female rapper\n\nMatching Lauryn Hill’s record wasn’t enough. In its third week at the top of the chart, Cardi’s “Bodak Yellow” became the longest-running chart-topper by a solo female artist on the Hot 100. The feat surpassed Hill’s “Doo-Wop (That Thing),” which spent two weeks at No. 1 in 1998.\n\nDebuts on the cover of ‘Rolling Stone’\n\n“I can’t believe when I got the call,” the rapper cheered in October 2017. Backed by the success of “Bodak Yellow,” the rapper secured a cover with the coveted publication.\n\nFirst woman to chart first three entries in the Hot R&B/Hip-Hop Songs’ Top 10 simultaneously\n\nIn November, Cardi B became the first woman to have her first three song entries land simultaneously within the Top 10 on the Hot R&B/Hip-Hop Songs Chart. The singles to do so were “Bodak Yellow,” Migos’ “MotorSport,” and G-Eazy’s “No Limit.” The trifecta also made Cardi one of only six women to chart three simtaneous Top 10s, including Ashanti, Nicki Minaj, Iggy Azalea, Beyoncé, and Rihanna.\n\nOfficially becomes a Grammy-nominated rapper\n\nThe rapper scored her not one, but two Grammy nods for the 2018 ceremony. “Bodak Yellow” is up for Best Rap Performance and Best Rap Song.\n\nWins three awards at 2017 BET Hip-Hop Awards\n\nCardi-mania spilled onto the BET Hip-Hop Awards, where she picked up three awards including Best New Hip-Hop Artist, Single of the Year, and Hustler of the Year.\n\nFirst rapper with first three singles in the Hot 100’s Top 10 simultaneously\n\nCardi B opened 2018 as the first rapper to have her first singles in the Billboard Hot 100’s Top 10 simultaneously. In the first week of the year, her appearances on G-Eazy’s “No Limit,” Migos’ MotorSport,” as well as her own debut single “Bodak Yellow” were all sprinkled in the Top 10 of the Hot 100.\n\nFirst woman to have five simultaneous Top 10 on Hot R&B/Hip-Hop Songs chart\n\nThe breakout rapper surpassed Beyoncé as the first woman to have five Top 10 singles simultaneously on the Hot R&B/Hip-Hop songs chart. She was previously tied with Beyoncé. As Billboard reports, the feat includes her appearances on Bruno Mars’ “Finesse” and her own single “Bartier Bardi,” along with the usual suspects “Bodak Yellow,” G-Eazy’s “No Limit,” and Migos’ “MotorSport.” Cardi now ties Drake and Kendrick Lamar for the most consecutive top 10s.\n\nScores second Billboard No. 1 on the Hot R&B/Hip-Hop Songs chart\n\nWith her appearance on Bruno Mars’ “Finesse,” Cardi collects her second chart-topper on the songs chart. The collaboration also seized the top spot of the R&B/Hip-Hop Digital Song Sales, Streaming Songs, and Airplay Gainer charts.\n\nAlbum streamed over 100 million times on Apple Music\n\nAccording to Apple Music, Invasion of Privacy has been streamed more than 100 million times worldwide, doubling the streaming numbers that T-Swift’s_Reputation_album had put on the board.\n\nMost simultaneous titles on the Billboard Hot 100\n\nInvasion of Privacy charts 13 entries on the Hot 100, passing Beyoncé for the most simultaneous titles on the ranking by a solo female.", "images": ["https://www.revolt.tv/article/2018-01-18/36845/media_14de8453a93a42d5027c4b1ebf27f49dea4bc4296.jpeg?width=1200&format=pjpg&optimize=medium", "https://revolt.tv/stories/2018/01/18/media_1ddf5d7710fc58e30076403e2e3522fba73a14e52.jpeg?width=750&format=jpeg&optimize=medium"], "top_img": "https://www.revolt.tv/article/2018-01-18/36845/media_14de8453a93a42d5027c4b1ebf27f49dea4bc4296.jpeg?width=1200&format=pjpg&optimize=medium", "keywords": [], "authors": ["Ralph Bristout"], "canonical_link": "https://www.revolt.tv/article/2018-01-18/36845/cardi-b-makes-history-all-her-record-breaking-stats-so-far", "title": "Cardi B makes history: All her record-breaking stats (so far)", "meta_data": {"description": "Spoiler alert: It's a lot.", "og": {"title": "Cardi B makes history: All her record-breaking stats (so far)", "description": "Spoiler alert: It's a lot.", "url": "https://www.revolt.tv/article/2018-01-18/36845/cardi-b-makes-history-all-her-record-breaking-stats-so-far", "image": {"identifier": "https://www.revolt.tv/article/2018-01-18/36845/media_14de8453a93a42d5027c4b1ebf27f49dea4bc4296.jpeg?width=1200&format=pjpg&optimize=medium", "secure_url": "https://www.revolt.tv/article/2018-01-18/36845/media_14de8453a93a42d5027c4b1ebf27f49dea4bc4296.jpeg?width=1200&format=pjpg&optimize=medium", "alt": "Cardi B"}, "locale": "en_US", "site_name": "REVOLT", "type": "article"}, "article": {"tag": "Cardi B"}, "twitter": {"card": "summary_large_image", "title": "Cardi B makes history: All her record-breaking stats (so far)", "description": "Spoiler alert: It's a lot.", "image": "https://www.revolt.tv/article/2018-01-18/36845/media_14de8453a93a42d5027c4b1ebf27f49dea4bc4296.jpeg?width=1200&format=pjpg&optimize=medium"}, "robots": "index, follow", "template": "article", "main-title": "Cardi B makes history: All her record-breaking stats (so far)", "dek": "Spoiler alert: It’s a lot.", "categories": "Exclusives, Interest, News", "internal-tags": "13k_drafts", "author": "Ralph Bristout", "published_on": "2018-01-18 21:40:52", "viewport": "height=device-height, width=device-width, initial-scale=1.0, minimum-scale=1.0, target-densitydpi=device-dpi", "msapplication-TileImage": "/icons/revolt-r-logo-270x270.png"}, "movies": [], "publish_date": 1516251600.0, "source": "https://revolt.tv", "summary": ""}