{"url": "https://en.wikipedia.org/wiki/Jimmy_Kimmel", "text": "American TV host and comedian (born 1967)\n\nJames Christian Kimmel (born November 13, 1967)[1][2] is an American television host and comedian. He is best known as the host and executive producer of Jimmy Kimmel Live!, which has aired on ABC since 2003. Kimmel has hosted the Primetime Emmy Awards three times, in 2012, 2016 and 2020, and the Academy Awards four times, in 2017, 2018, 2023, and 2024.\n\nBefore hosting Jimmy Kimmel Live!, Kimmel was the co-host of Comedy Central's The Man Show and Win Ben Stein's Money. Kimmel has also produced several TV shows, including Crank Yankers, Sports Show with Norm Macdonald, and The Andy Milonakis Show. In 2018, Time named him as one of the 100 most influential people in the world.[3] Kimmel has the longest tenure of any current late-night television host in the United States. At 23 seasons, his tenure hosting a single late-night comedy-variety show is second only to Johnny Carson, who hosted The Tonight Show Starring Johnny Carson for 30 seasons. After Kimmel made controversial comments on the assassination of Charlie Kirk in his monologue on September 17, 2025, ABC suspended Jimmy Kimmel Live! for a week.\n\nEarly life and family\n\nKimmel was born in Brooklyn, New York City, and grew up in the neighborhood of Mill Basin.[4] He is the eldest of the three children of Joan (née Iacono) and James John Kimmel, who worked at American Express and was an IBM executive.[5][6][7]\n\nHe was raised Catholic and was an altar boy as a child.[8][9] Kimmel's mother is of Italian descent; her grandparents migrated to the United States from Ischia, Naples, after the 1883 earthquake.[10][11] Two of his paternal great-great-grandparents were German immigrants. His family's surname was Kümmel ('caraway' in German) several generations back.[12][13][14][15] He obtained Italian citizenship in 2025.[16]\n\nHe attended P.S. 236 elementary school before the family moved to Las Vegas when he was nine years old,[5][17][18] where he befriended his neighbor Cleto Escobedo III, who would go on to be the bandleader on Jimmy Kimmel Live![19][20] He graduated from Ed W. Clark High School[21] and attended the University of Nevada, Las Vegas (UNLV), for one year before his family moved to Arizona. He attended Arizona State University for the 1985–86 academic year and left without graduating.[22][23] He received an honorary degree from UNLV in 2013.[22]\n\nKimmel's uncle, Frank Potenza (\"Uncle Frank\"), appeared on Jimmy Kimmel Live! as a regular from 2003 until he died in 2011.[24] His cousin Sal Iacono performed Kimmel's former co-hosting duties during the last season of Win Ben Stein's Money and then became a writer and sketch performer on Jimmy Kimmel Live![25] His Aunt Chippy (Concetta Potenza) is also a featured part of the show.[citation needed] His brother Jonathan works on the show as a director. His sister, Jill, is a comedian.[citation needed]\n\nCareer\n\nRadio career\n\nInspired by David Letterman's start in radio, Kimmel began working in radio while in high school. He was the host of a Sunday night interview show on UNLV's college station, KUNV.[26] While attending Arizona State University, he became a popular caller to the KZZP-FM afternoon show hosted by radio personalities Mike Elliott and Kent Voss in Phoenix, Arizona. In 1989, Kimmel landed his first paying job alongside Voss as morning drive co-host of The Me and Him Show at KZOK-FM in Seattle, Washington. Over the next 10 months, the hosts performed several stunts on air, including one that led to the loss of an $8,000 advertising contract with the Seattle Mariners.[27][28]\n\nIn 1990, Kimmel and Voss were fired by KZOK and were fired again a year later at WRBQ-FM in Tampa.[citation needed] Kimmel went on to host his own show at KCMJ in Palm Springs, California, where he recruited as his intern Carson Daly, who had been a family friend since his childhood.[29] After a morning stint at KRQQ in Tucson, Arizona, Kimmel landed at KROQ-FM in Los Angeles. He spent five years as \"Jimmy The Sports Guy\" for the Kevin and Bean morning show. During that time, he met and befriended the comedian Adam Carolla.[30]\n\nComedy Central\n\nKimmel initially did not want to do television; he began writing for Fox announcers and promotions and was quickly recruited to do the on-air promotions himself. He declined several offers for television shows from producer Michael Davies, being uninterested in the projects, until he was offered a place as the comedic counterpart to Ben Stein on the game show Win Ben Stein's Money, which began airing on Comedy Central in 1997. His quick wit and \"everyman\" personality were counterpoints to Stein's monotonous vocal style and faux-patrician demeanor. The combination earned the pair an Emmy award for Best Game Show Host.[26]\n\nIn 1999, during his time on Win Ben Stein's Money, Kimmel co-hosted (with Adam Carolla) and co-produced (with Daniel Kellison) Comedy Central's The Man Show. Kimmel left Win Ben Stein's Money in 2001 and was replaced by comedian Nancy Pimental, who was eventually replaced by Kimmel's cousin Sal Iacono. The Man Show's success allowed Kimmel, Carolla, and Kellison to create and produce, under the banner Jackhole Productions, Crank Yankers for Comedy Central (on which Kimmel plays the characters \"Elmer Higgins\", \"Terrence Catheter\", \"The Nudge\", \"Karl Malone\" and himself) and later The Andy Milonakis Show for MTV2. Kimmel also produced and co-wrote the feature film Windy City Heat, Festival Prize winner of the Comedia Award for Best Film at the 2004 Montreal Comedy Festival.\n\nJimmy Kimmel Live!\n\nIn January 2003, Kimmel permanently left The Man Show to host his own late-night talk show, Jimmy Kimmel Live!, on ABC.[31] Jimmy Kimmel Live! was created as a permanent replacement for Politically Incorrect,[32][33][34] which ABC canceled in June 2002 following widespread condemnation and advertiser boycotts over host Bill Maher's comments during the political panel talk show's first new episode after the September 11, 2001, terrorist attacks suggesting that the perpetrators were not cowards (contravening remarks made by then-President George W. Bush the day prior to the broadcast), whereas \"[American leaders had] been the cowards, lobbing cruise missiles from 2,000 miles away\".[35][36][37]\n\nIn April 2007, Stuffmagazine.com named Kimmel the \"biggest badass on TV\". Kimmel said it was an honor, but clearly a mistake. Despite its name, the show has not actually aired live since 2004, when censors were unable to properly bleep censor a curse word from Thomas Jane.[38] During the 2004 NBA Finals in Detroit, Kimmel appeared on ABC's halftime show to make an on-air plug for his show. He suggested that if the Detroit Pistons defeated the Los Angeles Lakers, \"they're gonna burn the city of Detroit down ... and it's not worth it.\" Officials with Detroit's ABC affiliate, WXYZ-TV, immediately announced that that night's show would not air on the station. Hours later, ABC officials pulled that night's show from the entire network. Kimmel later apologized.[39]\n\nIn a running gag that lasted for years, Kimmel would end his show with \"My apologies to Matt Damon, we ran out of time.\" When Matt Damon did actually appear on the show to be interviewed in 2006, he walked in and sat down only to be told just a few seconds later by Kimmel, \"Unfortunately, we are totally out of time,\" followed by \"my apologies to Matt Damon.\" Damon appeared angry, but both performers have since indicated that their faux-feud is a joke.[40] In February 2008, Kimmel showed a mock music video with a panoply of stars called \"I'm Fucking Ben Affleck\"[41] as \"revenge\" after his then-girlfriend Sarah Silverman and Damon recorded a similar video titled \"I'm Fucking Matt Damon\". Silverman's video originally aired on Jimmy Kimmel Live! going viral on YouTube.[42] Kimmel's \"revenge\" video featured himself, Ben Affleck, and a large lineup of stars, particularly in scenes spoofing the 1985 \"We Are the World\" video: Christina Applegate, Lance Bass, Don Cheadle, Lauren Conrad, Cameron Diaz, Perry Farrell, Harrison Ford, Macy Gray, Josh Groban, Joan Jett, Dom Joly, Huey Lewis, Benji Madden and Joel Madden from Good Charlotte, Meat Loaf, Christopher Mintz-Plasse, Dominic Monaghan, Brad Pitt, Rebecca Romijn, Mike Shinoda, Pete Wentz, and Robin Williams, among others.\n\nAfterwards, Kimmel's sidekick, Guillermo Rodriguez, appeared in a spoof of The Bourne Ultimatum, which starred Damon. He was then chased down by Damon, who was cursing about Kimmel being behind all this. Guillermo also stopped Damon on the red carpet one time and, before he could finish the interview, said, \"Sorry, we are out of time.\" The most recent encounter was titled \"The Handsome Men's Club\" which featured Kimmel, along with the \"Handsome Men\", who were: Affleck, Ted Danson, Patrick Dempsey, Taye Diggs, Josh Hartnett, Ethan Hawke, John Krasinski, Lenny Kravitz, Rob Lowe, Gilles Marini, Matthew McConaughey, Tony Romo, Sting and Keith Urban, speaking about being handsome and all the jobs that come with it. At the end of the skit, Kimmel has a door slammed in his face by Damon, who says they have run out of time and gives a sinister laugh. Jennifer Garner makes a surprise appearance. As a tradition, celebrities voted off Dancing with the Stars appear on Jimmy Kimmel Live!, causing Kimmel to describe himself as \"the three-headed dog the stars must pass on their way to No-Dancing Hell.\"\n\nIn October 2013, a segment titled \"Kids Table\" showcased five- and six-year-olds discussing the U.S. government shutdown and U.S. debts. When one of the children suggested \"killing all the people in China\" as a way of resolving the U.S. debt, Kimmel responded that it was \"an interesting idea\" and jokingly asked a follow-up: \"Should we allow the Chinese to live?\"[43] In an October 25 letter to a group called the 80-20 Initiative, which identifies itself as a pan-Asian-American political organization, ABC apologized for the segment, saying \"We would never purposefully broadcast anything to upset the Chinese community, Asian community, anyone of Chinese descent or any community at large.\"[43][44] More than a hundred people took to the streets in San Francisco on October 28 to protest the show and demand \"a more elaborate apology\" and that Kimmel be fired.[44] On that day's broadcast, Kimmel addressed the controversy personally, saying: \"I thought it was obvious that I didn't agree with that statement, but apparently it wasn't... So I just wanted to say, I'm sorry, I apologize.\"[45] Despite the apologies from ABC and Kimmel, protests continued. A White House petition was created to investigate the incident and reached the 100,000 signatures needed to require a response from the White House.[46] The Congressional Asian Pacific American Caucus denounced the incident and demanded a formal apology from ABC.[47]\n\nIn the summer of 2020, during the wake of George Floyd protests, Kimmel apologized for blackface impressions of media magnate Oprah Winfrey and basketball player Karl Malone in The Man Show, as well as using racial slurs in a 1996 song imitating Snoop Dogg.[48][49][50] Kimmel apologized, \"I believe that I have evolved and matured over the last 20-plus years\" and that \"I know that this will not be the last I hear of this and that it will be used again to try to quiet me\".[48][49] Footage resurfaced of a 2009 Kimmel interview with actress Megan Fox describing her sexualization on the set of Bad Boys II when she was 15-years-old, in response to which Kimmel made crude remarks.[51]\n\nWhile Kimmel and ABC had signed a three-year contract extension, running through the 2025–26 season, to continue his show in September 2022, he had considered ending the program just before the 2023 SAG-AFTRA and Writers Guild of America strikes.[52][53] During a November 2022 appearance on Stitcher's Naked Lunch podcast, Kimmel revealed that he told ABC executives, soon after the 2016 election of Donald Trump, that if he could not tell Trump jokes, then he would leave the show. It appears the executives once spoke to Kimmel about laying off Trump, not to alienate Republican viewers. Kimmel said ABC executives were right in their apprehension, as he estimates he lost around half of his audience due to Trump jokes.[54] Kimmel and Trump's feud is years-long,[55] dating back to at least 2015, when then-presidential candidate Trump cancelled a scheduled appearance on Jimmy Kimmel Live!, citing a prior obligation.[56] On his part, Kimmel has been a relentless critic of President Trump since his first term,[57] declaring, \"One of the most fun parts of my job is knowing that he hates being made fun of, and making fun of him.\"[58] This culminated with Kimmel reading and mocking a Truth Social post by then-presumptive Republican presidential nominee Trump at the closing of the 96th Academy Awards ceremony in March 2024.[59][60][61] Kimmel defended Stephen Colbert when his late talk show, The Late Show with Stephen Colbert, was cancelled, calling Paramount's cited reasons \"nonsensical\".[62]\n\nSuspension and reinstatement\n\nIn his September 15, 2025, opening monologue, Kimmel commented on reactions to the assassination of Charlie Kirk that \"[w]e hit some new lows over the weekend with the MAGA gang desperately trying to characterize this kid who murdered Charlie Kirk as anything other than one of them, and doing everything they can to score political points from it.\"[63] At the time, the FBI had not mentioned the shooter Tyler Robinson's \"background, political leanings or a possible motive, saying the investigation was ongoing\", though his mother had told prosecutors that he had shifted toward the political left and had become \"more pro-gay and trans-rights oriented\".[64] Kimmel also compared Trump's reaction to Kirk's death to \"a four-year-old mourning a goldfish\".[65]\n\nThe New York Times reported that Kimmel had planned to address the reaction to his \"MAGA gang\" comment on his September 17 show.[63] According to unnamed Hollywood Reporter sources, Kimmel felt that what he said did not require an apology,[66] and intended to defend his remark, with a source saying that it had been \"grossly mischaracterized by a certain group of people\".[67] That same day, FCC Chairman Brendan Carr said on conservative Benny Johnson's podcast that the comment was \"some of the sickest conduct possible\" and threatened regulatory action against ABC and Disney,[63][68] stating that \"companies can find ways to change conduct and take action, frankly, on Kimmel, or there's going to be additional work for the FCC ahead.\"[69] Hours later, Nexstar Media Group announced that it would pull Jimmy Kimmel Live! from all of its ABC-affiliated stations, and shortly after that ABC announced all broadcasts of the show would be halted \"indefinitely\".[63][70] According to the Times and The Hollywood Reporter, the decision to suspend the show was made by Bob Iger, the CEO of ABC's parent company Disney, and Dana Walden, Disney's television chief.[63][67]\n\nOn September 17, Anna M. Gomez, an American telecommunications attorney currently serving as a commissioner of the FCC, appeared on CNN to defend Kimmel's freedom of speech, arguing that his remarks were protected by the First Amendment.[71] Following comments by President Donald Trump backing Carr, Democratic Senator Chris Murphy accused Trump of \"using the power of the White House, in this case the power of his regulatory agencies, to try to shut down any speech that opposes him.\"[72]\n\nSupport for Kimmel was expressed by current and former late-night TV hosts, including Stephen Colbert, Jimmy Fallon, Seth Meyers, Jon Stewart, and David Letterman. On September 18, a collective Hollywood labor statement expressing unions' support and concern was issued jointly by the International Alliance of Theatrical Stage Employees (IATSE), the Directors Guild of America (DGA), the American Federation of Musicians (AFM), and the Screen Actors Guild – American Federation of Television and Radio Artists (SAG-AFTRA).[73] Over 400 creative artists signed an open letter from the American Civil Liberties Union (ACLU).[74] Fox News host Greg Gutfeld said he was not upset by the suspension, while his guests[who?] said \"there were limits to free speech on network TV.\"[75] Former Disney CEO Michael Eisner also expressed support for Kimmel and criticized the FCC for intimidating ABC and Disney,[76] as did several prominent Republicans including Senator Ted Cruz, head of FCC oversight.[77]\n\nCNN reported that Disney employees and staff members received death threats following Carr's remarks and had their email addresses and phone numbers publicized. For the company, the affair then became \"bigger than Kimmel\" and was \"a safety issue for employees and the show's advertisers.\"[78] On September 22, Disney announced that after \"thoughtful conversations\" with Kimmel, the show would return the following day. In a statement, they explained that \"some of the comments were ill-timed and thus insensitive,\" and the decision to suspend them had been made \"to avoid further inflaming a tense situation at an emotional moment for our country.\"[79][80] Sinclair Broadcast Group, which owns 31 of ABC's 205 affiliate stations, and Nexstar, which owns 32,[81] announced they would not air Kimmel's show; Sinclair said it would air news programming instead.[80][82] On September 26, Sinclair and Nexstar announced that they were ending their boycott.[83]\n\nKimmel's viewership stabilized and returned to pre-controversy numbers post suspension.[84]\n\nOther television work, 1996-2020\n\nKimmel at the Hollywood Walk of Fame on September 4, 2012\n\nIn spring 1996, Kimmel appeared as \"Jimmy the Fox Guy\" in promos on the Fox Network. His other television work included being the on-air football prognosticator for Fox NFL Sunday for four years. He has had numerous appearances on other talk shows, including Live with Regis and Kelly, The Howard Stern Show, The Ellen DeGeneres Show, and Late Show with David Letterman.\n\nHe has appeared on The Late Show five times, most recently in 2010. Kimmel served as roastmaster for the New York Friars' Club Roast of Hugh Hefner and the Comedy Central Roast of Pamela Anderson. He has appeared on ABC's Dancing with the Stars.\n\nIn August 2006, ABC announced that Kimmel would be host of their new game show Set for Life.[85] The show debuted on July 20, 2007. On April 6, 2007, Kimmel filled in for Larry King on Larry King Live. That particular broadcast dealt with paparazzi. Kimmel reproached Emily Gould, an editor at Gawker.com, for the site's alleged stalking of celebrities. On July 8, 2007, Kimmel managed the National League in the 2007 Taco Bell All-Star Legends and Celebrity Softball Game in San Francisco. He played in the game in 2004 and 2006 (in Houston and Pittsburgh, respectively). On July 11, 2007, Kimmel, along with basketball player LeBron James, hosted the 2007 ESPY Awards. The show aired on ESPN on July 15, 2007. Kimmel hosted the American Music Awards on ABC five times, in 2003, 2004, 2006, 2007, and 2008.\n\nKimmel guest-hosted Live with Regis and Kelly during the week of October 22–26, 2007, commuting every day between New York and Los Angeles. In the process, he broke the Guinness World Record for the longest distance (22,406 miles (36,059 km)) traveled in one work week.[86] Kimmel himself has questioned the record, suggesting that a world leader or the Pope must actually hold the record.[87]\n\nKimmel has performed in several animated films, often voicing dogs. His voice appeared in Garfield: The Movie and Road Trip, and he portrayed Death's Dog in the Family Guy episode \"Mr. Saturday Knight\"; Family Guy creator Seth MacFarlane later presented Kimmel with a figurine of his character on Jimmy Kimmel Live! Kimmel also did voice work for Robot Chicken. Kimmel's cousin Sal Iacono has accepted and won a wrestling match with Santino Marella.\n\nOn January 14, 2010, amid the 2010 Tonight Show host and time slot conflict, Kimmel was the special guest of Jay Leno on The Jay Leno Show's \"10 at 10\" segment. Kimmel derided Leno in front of a live studio audience for taking back the 11:35 pm time slot from Conan O'Brien, and repeatedly insulted Leno. He ended the segment with a plea that Leno \"leave our shows alone\", as Kimmel and O'Brien had \"kids\" while Leno only had \"cars\".[88]\n\nKimmel hosted the 64th Primetime Emmy Awards on September 23, 2012, and the 68th Primetime Emmy Awards on September 18, 2016.[89][90] With the presidential election only weeks away, he pointed out the role Mark Burnett played in the rise of Trump.[91] Kimmel hosted the 89th edition of the Academy Awards ceremony on February 26, 2017.[92] He returned as host for the 90th edition on March 4, 2018,[93] and the 95th edition on March 12, 2023.[94] He returned for the fourth time to host the 96th edition on March 10, 2024.[95]\n\nIn June 2018, Kimmel was challenged by U.S. Senator Ted Cruz to a one-on-one basketball game after Kimmel compared Cruz's appearance to that of a blobfish. Kimmel accepted, and the game (known as the Blobfish Basketball Classic) was scheduled to take place at Texas Southern University on June 16, with the loser donating $5,000 to the non-political charity of the winner's choice.[96] Cruz defeated Kimmel 11–9, and over $80,000 was raised from the game and donated to the charities.[97]\n\nIn November 2018, Kimmel launched his second production company, Kimmelot.[98] He was the host and co-executive producer of a celebrity edition of Who Wants to Be a Millionaire, which premiered for the show's 20th anniversary in 2020. It premiered on April 8, 2020, on ABC.[99] In June 2020, it was announced that Kimmel would return to host the 72nd Primetime Emmy Awards on September 20, 2020.[100]\n\nBooks\n\nIn July 2019, Kimmel released his first book, The Serious Goose, an interactive children's picture book featuring his own illustrations that tasks readers with helping to make the serious goose smile.[101]\n\nPodcasts\n\nFrom August 30[102][103][104] to October 10, 2023, Kimmel hosted Strike Force Five, a comedy podcast with Jimmy Fallon, Seth Meyers, Stephen Colbert, and John Oliver to support their staff members who were out of work due to the 2023 Writers Guild of America strike.\n\nInfluences\n\nKimmel's biggest influences in comedy are David Letterman and Howard Stern.[105][106] Kimmel has said of Letterman, \"His show was just so weird and different. I'd never seen anything like it. I didn't know anyone who had a sense of humor like that.\"[107] Kimmel has often joked that the only reason he got into show business was to be friends with Letterman; he has questioned why anybody would watch his show instead of Letterman's.[108]\n\nKimmel wrote a piece for Time in 2015 about his love for Letterman:\n\nAs I write this, there are only ten shows left before the funniest, most inventive and smartest man who ever wore an Alka Seltzer suit goes fishing for good. None of us who discovered Dave on our own and claimed him as our own will ever be able to satisfactorily explain to the younger people who didn't know what he did, what he meant, and what he means. I guess it doesn't matter. It's only an exhibition, not a competition. Thanks, Dave. For whatever it's worth, you're my favorite.[109]\n\nPersonal life\n\nKimmel at Citi Field with his cousin, Sal Iacono, in 2015\n\nKimmel is a practicing Catholic.[110] He has spoken publicly about having narcolepsy.[111] In 2025, he obtained Italian citizenship.[112]\n\nKimmel married Gina Maddy in 1988; they divorced in 2002.[113] Their daughter Katherine was born in 1991 and their son Kevin was born in 1993.[114][1] Kimmel became a grandfather when his oldest daughter gave birth to a girl in May 2025.[115] He had a relationship with comedian Sarah Silverman from 2002 to March 2009.[116]\n\nKimmel and Molly McNearney, a co-head writer for Jimmy Kimmel Live, started dating in October 2009.[117] They were engaged in August 2012[113][118] and married in July 2013.[119] Their daughter Jane was born in July 2014 and they have homes in Hermosa Beach, California.[120][121]\n\nTheir second child, William \"Billy\" John, was born on April 21, 2017.[122] He was born with a rare congenital heart defect,[123] tetralogy of Fallot (TOF) with pulmonary atresia,[124][125] which was first detected when he had a purplish appearance at three hours after birth. He underwent successful surgery at three days of age.[126][127] The first guests Kimmel had when his show returned following his son's birth were cardiac surgeon Mehmet Oz, who explained the condition,[128] and snowboarder Shaun White, who was born with TOF.[129] Kimmel later cited his son's condition in a monologue criticizing a previous guest, Senator Bill Cassidy, who had co-authored a congressional healthcare bill, for not living up to the \"Jimmy Kimmel test\" regarding access for patients with pre-existing conditions. The monologue was widely discussed as part of the wider debate about the American healthcare system.[130][131][132]\n\nIn 2020, a genealogy report conducted for the TV show Finding Your Roots determined that he and Martha Stewart are cousins.[133]\n\nInterests\n\nKimmel plays the bass clarinet, and he was a guest performer at a concert in Costa Mesa, California, on July 20, 2008, featuring The Mighty Mighty Bosstones, performing with the group on the song \"The Impression That I Get\".[134]\n\nKimmel co-founded the annual Los Angeles Feast of San Gennaro, a New York City annual tradition, and co-hosted the eighth annual Los Angeles version in 2009.[135] In 2018, he raised funds for Nevada U.S. Senate candidate (and eventual senator) Jacky Rosen.[136]\n\nIn 2021, Kimmel became the title sponsor of the LA Bowl for the year; in 2022, a college football bowl game began to be played annually in Inglewood's SoFi Stadium. The game became officially known as the Jimmy Kimmel LA Bowl.[137][138]\n\nFilmography\n\nKimmel at the Hollywood Walk of Fame on January 25, 2013\n\nFilm\n\nTelevision\n\nAs executive producer\n\nVideo games\n\nYear Title Voice role Notes 2012 Call of Duty: Black Ops II Himself Appeared on his own talk show\n\nDiscography\n\nAwards and nominations", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/40px-Wikidata-logo.svg.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Flag_of_Los_Angeles_County%2C_California.svg/40px-Flag_of_Los_Angeles_County%2C_California.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/20px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/GClef.svg/7px-GClef.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Animation_disc.svg/20px-Animation_disc.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Jimmy_Kimmel_and_Cousin_Sal.jpg/250px-Jimmy_Kimmel_and_Cousin_Sal.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Jimmy_Kimmel_June_2022.jpg/250px-Jimmy_Kimmel_June_2022.jpg", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Wiki_letter_w_cropped.svg/20px-Wiki_letter_w_cropped.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/JimmyKimmelHWOFJan2013.jpg/250px-JimmyKimmelHWOFJan2013.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/40px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/3/37/Jimmy_Kimmel_June_2022.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/SMirC-laugh.svg/20px-SMirC-laugh.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Radio_icon.png/21px-Radio_icon.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/JimmyKimmelHWOFSept2012.jpg/250px-JimmyKimmelHWOFSept2012.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/40px-Flag_of_the_United_States.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/40px-Blank_television_set.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/20px-Video-x-generic.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/3/37/Jimmy_Kimmel_June_2022.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jimmy_Kimmel", "title": "Jimmy Kimmel", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/3/37/Jimmy_Kimmel_June_2022.jpg", "width": 899, "height": 1200}, "title": "Jimmy Kimmel - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}