{"url": "www.mirror.co.uk/3am/celebrity-news/angelina-jolie-smiles-children-support-11153817", "text": "Skinny Angelina Jolie reveals painfully thin arms on red carpet - as Brad Pitt stays away from her Netflix premiere\n\nShe's sparked concerns she's battling more health problems since splitting from Brad\n\nAngelina Jolie revealed her painfully thin arms at the red carpet premiere of her latest film First They Killed My Father - sparking concern she's still struggling with health issues.\n\n‌\n\n\n\nThe 42-year-old actress, who was hospitalised as a result of her anorexia as a teen, has had a tough few months since splitting from Brad Pitt.\n\n‌\n\n\n\nShe's previously spoken about how her weight is affected by stress, having lost a worrying amount back in 2007 after her mother died.\n\n‌\n\n\n\nAt the time, she put it down to depression and grief.\n\nView 6 Images Ange with Shiloh, 11, as she premiered her newly directed film First They Killed My Father (Image: Getty Images North America)\n\n6 View 6 Images The star's limbs seemed skinnier than ever (Image: WENN.com) 6 View 6 Images Angelina has battled a number of health issues since her split from Brad (Image: WENN.com)\n\n‌\n\n\n\nAngelina was surrounded by her six children and co-stars as she walked the red carpet for the premiere of her new Netflix film First They Killed My Father - but there was no sign of estranged husband Brad.\n\nThe movie - co-written and directed by Angelina - tells the story of a survivor of the Khmer Rouge regime in the 1970s, when two million Cambodians were killed through forced labour, starvation and executions.\n\nIt has a personal connection to Angelina as Cambodia is where she adopted eldest son Maddox, 16, after visiting the country as a UN Goodwill Ambassador in 2001.\n\n‌\n\n\n\nView 6 Images Angelina with her six children at the Toronto International Film Festival (Image: WireImage)\n\nBut while the rest of her brood came to support her, Brad steered clear of the premiere at the Toronto International Film Festival on Monday 11 September.\n\nMaddox was joined by Pax, 13; Zahara, 12; Shiloh, 11, and Brangelina's nine-year-old biological twins Vivienne and Knox on the red carpet, and the kids all stood by their mum and beamed for the cameras.\n\n‌\n\n\n\nBut, perhaps unsurprisingly, Brad didn't appear alongside his family following conflicting reports the couple were thinking of getting back together after Angelina filed for divorce last year.\n\nBrangelina's biographer Ian Halperin said last week that the pair were going through \"spiritual counselling\" in a bid to \"consciously recouple\".\n\nBrad Pitt and Angelina Jolie are NOT getting back together as family friend rubbishes reunion claims READ MORE :\n\nView 6 Images Brad and Ange won't be getting back together, a family friend claimed (Image: Getty Images)\n\n‌\n\n\n\n\"Brad took the first step forward, then they collapsed into each other's arms. There were a lot of tears, nothing was left on the table,\" he said.\n\n\"They had it out, right there. In that moment they decided to make a fresh start - it was a 'come to Jesus meeting' that marked the beginning of a new phase in their relationship.\"\n\nBut a family friend exclusively told Mirror Online that the reports were rubbish.\n\n‌\n\n\n\n\"They are both focused on putting their children's priorities first and are getting along, but this story is clearly an outsider trying to create a storyline that doesn't exist,\" said the insider.\n\nAngelina Jolie has spoken for the first time of the emotional toll of her split with Brad Pitt READ MORE :\n\nView 6 Images Ange is moving on after a tough year of divorce and health problems (Image: REX/Shutterstock)\n\nAngelina recently spoke for the first time of the emotional toll of her split with Brad.\n\nArticle continues below\n\nThe star, 42, said the break-up last year was made worse by health problems – including a double mastectomy and Bell's Palsy.\n\nShe said: \"Sometimes it appears I'm pulling it all together but really I'm just trying to get through my days. Emotionally it’s been a very difficult year.\n\n\"I don't enjoy being single. It's not something I wanted. There's nothing nice about it. It's just hard.\"", "images": ["http://www.mirror.co.uk/footer/trust-project.svg", "https://i2-prod.mirror.co.uk/article11154214.ece/ALTERNATES/s1200/42nd-Toronto-International-Film-Festival-First-They-Killed-My-Father-A-Daughter-of-Cambodia-Remem1.jpg", "https://i2-prod.mirror.co.uk/article11061487.ece/ALTERNATES/s615b/FILE-Angelina-Jolie-Files-For-Divorce-From-Brad-Pitt.jpg", "https://i2-prod.mirror.co.uk/article11154211.ece/ALTERNATES/s615b/42nd-Toronto-International-Film-Festival-First-They-Killed-My-Father-A-Daughter-of-Cambodia-Remem.jpg", "https://i2-prod.mirror.co.uk/article11154010.ece/ALTERNATES/s615b/2017-TIFF-Premieres-Photo-Calls-And-Press-Conferences.jpg", "https://i2-prod.mirror.co.uk/article11154007.ece/ALTERNATES/s615b/2017-Toronto-International-Film-Festival-First-They-Killed-My-Father-Premiere.jpg", "https://i2-prod.mirror.co.uk/article11154011.ece/ALTERNATES/s615b/First-They-Killed-My-Father-premiere-Toronto-International-Film-Festival-Canada-11-Sep-2017.jpg", "http://www.mirror.co.uk/nav-web-static/release-v41-14493b7c888038a7d89b99cb3a7937c2b71eaebe/public/logo-reach.png", "http://www.mirror.co.uk/footer/ipso.svg", "https://i2-prod.mirror.co.uk/article11154214.ece/ALTERNATES/s615b/42nd-Toronto-International-Film-Festival-First-They-Killed-My-Father-A-Daughter-of-Cambodia-Remem1.jpg", "http://www.mirror.co.uk/assets/mirror/logos/masthead-mirror-default.svg"], "top_img": "https://i2-prod.mirror.co.uk/article11154214.ece/ALTERNATES/s1200/42nd-Toronto-International-Film-Festival-First-They-Killed-My-Father-A-Daughter-of-Cambodia-Remem1.jpg", "keywords": [], "authors": ["Emmeline Saunders", "Updated"], "canonical_link": "https://www.mirror.co.uk/3am/celebrity-news/angelina-jolie-smiles-children-support-11153817", "title": "Skinny Angelina Jolie reveals painfully thin arms on red carpet", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"page_id": 6149699161, "app_id": 123792601022133, "pages": 1814357575554395}, "description": "She's sparked concerns she's battling more health problems since splitting from Brad", "author": "Emmeline Saunders", "robots": "noarchive, max-image-preview:large", "Googlebot-News": "noarchive", "referrer": "unsafe-URL", "keywords": "Angelina Jolie, Brad Pitt, Toronto International Film Festival, Angelina Jolie children, Angelina Jolie and Brad Pitt", "news_keywords": "Angelina Jolie, Brad Pitt, Toronto International Film Festival, Angelina Jolie children, Angelina Jolie and Brad Pitt", "allowTaboolaDeepDive": "true", "vf": {"00000000-0000-4000-8000-67e599051dc3": "mirror-prod-11153817"}, "og": {"title": "Angelina Jolie reveals painfully thin arms on red carpet as Brad Pitt is no-show", "description": "She's sparked concerns she's battling more health problems since splitting from Brad", "url": "http://www.mirror.co.uk/3am/celebrity-news/angelina-jolie-smiles-children-support-11153817", "site_name": "Daily Mirror", "locale": "en_GB", "image": "https://i2-prod.mirror.co.uk/article11154214.ece/ALTERNATES/s1200/42nd-Toronto-International-Film-Festival-First-They-Killed-My-Father-A-Daughter-of-Cambodia-Remem1.jpg", "type": "article"}, "article": {"published_time": "2017-09-12T11:04:47Z", "modified_time": "2017-09-12T11:33:37Z", "author": "https://www.mirror.co.uk/authors/emmeline-saunders/", "section": "Celebrity News", "tag": "Angelina Jolie and Brad Pitt"}, "twitter": {"card": "summary_large_image", "site": "@DailyMirror", "creator": "@emm_saunders", "title": "Skinny Angelina Jolie reveals painfully thin arms on red carpet - as Brad Pitt stays away from her Netflix premiere - The Mirror", "description": "She's sparked concerns she's battling more health problems since splitting from Brad", "image": "https://i2-prod.mirror.co.uk/article11154214.ece/ALTERNATES/s1200/42nd-Toronto-International-Film-Festival-First-They-Killed-My-Father-A-Daughter-of-Cambodia-Remem1.jpg"}}, "movies": [], "publish_date": 1505214287.0, "source": "http://www.mirror.co.uk", "summary": ""}