{"url": "https://www.tor.com/2011/10/31/once-upon-a-time-vs-grimm-battle-of-the-pilots/", "text": "The shows in the Battle of the Network Fairy Tale Shows have a lot in common. Both make cute, modern-day references to the fairy tales that inspired them; both have talented casts; and both seem to like putting their orphaned protagonists in red leather jackets. They also seem to be each other’s exact opposite. Whereas Once Upon a Time is a female-led show, Grimm has a predominantly male energy. Once is light and romantic, Grimm is gritty and grounded. And while the protagonist of Once is a loner who doesn’t easily trust or let people in, the protagonist of Grimm is a romantic with family ties, friends, and a girlfriend.\n\nHow did these shows stack up after both pilots aired and the smoke cleared? Find out below!\n\nA reminder: Each episode will be graded in each category from 0-2, and then each category will be added up for the show’s grand total for the week. Weekly totals will be added throughout the season, and the show with the highest score at the end of the season will be declared Television’s Best Fairy Tale Show.\n\nOnce Upon a Time, Ep 1: “Pilot”\n\nSnow White’s (Ginnifer Goodwin) wicked stepmother (Lana Parrilla) can’t bear Snow’s happily ever after, so she puts a curse not only on Snow White and Prince Charming (Josh Dallas), but on all of the fairy tale characters as punishment. They’re banished to the modern-day town of Storybrooke, Maine; a place where time never passes, and none of its fairy tale inhabitants remember who they are. Emma Swan, a bail bonds agent (person?), holds the key to breaking the spell, but she doesn’t know it until Henry, the son she gave up for adoption years ago (Jared Gilmore), comes back into her life with a book of fairy tales and insists she come with him to Storybrooke. Skeptical at first, Emma agrees to stay in Storybrooke for a week when she notices certain things that lead her to believe that what the boy told her might not be just the product of an overactive imagination.\n\nScript (1): This is what gave me the most trouble. While both the premise of the show and the story of this episode are enjoyable, the execution of Adam Horowitz and Edward Kitsis’ script could’ve been better. Whereas the flashback device worked well on Lost to illuminate character, here it only serves to let the air out of any suspense that could be generated. The episode starts out with title cards that explain exactly what we’re going to be watching, and proceeds to give us back story before getting to the main character, whom we then have to watch discover it all over again. Other than the revelation of Henry’s relationship to Emma, there’s little to keep us guessing.\n\nThere’s also the issue of dialogue. If the choice is to have a “fairy tale half” and a “modern world half,” then the two have to be distinct. You can feel the writers trying to do that by having the fairy tale characters sound more proper and “Old World” in their speech than the modern characters, but they struggle to maintain it, and the fairy tale characters slip into lines like “take the queen out” and “there is, indeed, a catch,” which pull the viewer out of the world. It would be one thing if the entire show were set in this fairy tale world and the modern speech patterns were a choice, but in this pilot, the speech just feels sloppy.\n\nLastly, if time never passes in Storybrooke, how is there day and night? And why do they know what Emma means when she says she’s going to rent a room for “a week?” (Perhaps I’ve been watching too much Doctor Who.)\n\nPerformances (2): The cast is solid all around, but special kudos need to go to Jennifer Morrison, whose Emma Swan is a perfect blend of hard and vulnerable, and Robert Carlyle as an appropriately smarmy and deranged Rumplestiltskin/Mr. Gold.\n\nProduction (2): The show is certainly beautiful. From the elaborate costumes and sets of the fairy tale world, to the Stepford-esque design of Storybrooke, to the spare, yet colorful look of Emma’s real-world life, the look of the show is appropriate for each of the worlds that make it up. The visual effects are mostly reserved for the fairy tale world, and even things like Prince Charming’s injury look a bit “fake,” as if being depicted in a children’s book.\n\nRepresentation (1.5): One of the most wonderful things about the show is the fact that the female characters are so prominent, powerful, and nuanced. Snow White takes the lead in her relationship with Prince Charming, but not in a harsh, “man-hating” way. She makes most of the major decisions, and he trusts her. His desire to protect her are depicted as no different than her desire to protect him and their child. Emma Swan starts out as a bit of an action hero—slamming a guy’s head into a steering wheel!—but has a complex history even before we get to the fairy tale stuff. She’s a birth mother to an adopted child, something that is rarely explored on television. Of the five lead characters, three are women!\n\nWhere the show could do better, at least as of this first episode, is with racial minorities. The main cast is entirely white (though Lana Parrilla is half Puerto Rican-half Italian). The only speaking roles for black actors were the bishop performing Snow White’s wedding and Rumplestiltskin’s jailer. There were some scattered multiracial faces in crowd scenes (and one of the Seven Dwarves was Asian), but otherwise this was a lily-white production.\n\nAudience Engagement (1.5): This show will definitely appeal to viewers who love fairy tales and magic, and it’s a show that families can watch together, which earns it some mainstream cred. However, it might be a little too cute for some people. On the social media front, there’s not much activity on the Once Upon a Time Twitter or Facebook page, and what activity there is isn’t particularly interesting. ABC doesn’t seem to be actively courting an audience, merely expecting them to tune in and watch.\n\nTOTAL SCORE FOR ONCE UPON A TIME: 8 (out of 10)\n\nGrimm, Ep. 1: “Pilot”\n\nDetective Nick Burckhardt (David Giuntoli), has been noticing strange things. When the aunt who raised him (Kate Burton) falls ill, she comes to him to explain them, telling him that fairy tales aren’t stories, they’re warnings, and that he is descended from a long line of grimms, people with the unique ability to see the true natures of the fairy tale beings that live among us in the real world. As he and his partner, Hank Griffin (Russell Hornsby) solve the case of a missing little girl, Nick begins to used his newly-discovered ability in his work. Meanwhile, danger seems to be closing in on him and his girlfriend, Juliette (Bitsie Tulloch), from all directions—including that of his boss, Captain Renard (Sasha Roiz).\n\nScript (1.5): David Greenwalt and Jim Kouf’s pilot had a tight, well-paced, suspenseful script that managed to frighten even as it maintained a sense of humor and warmth. While it was clear that the episode was using the story of Little Red Riding Hood as a template, it wasn’t an exact retelling of the story. It successfully used that story as a metaphor for a crime being committed in the real world, which is what the original Grimm stories were in the first place—metaphors for real dangers. The script also does a great job of fleshing out the main character with minimal exposition.\n\nBut it, like most pilot scripts, wasn’t perfect. Having the entire resolution of the case hinge on a song heard on an iPod was farfetched (and I’m saying this regarding a show that deals in fairy tales!). From the iPod still playing The Eurhythmics’ “Sweet Dreams” hours after the person listening to it has been torn to shreds, to the attacker humming the song when the police stop by to investigate (did he listen to his victim’s iPod, or notice the song that was playing as he was attacking her?), to Hank remembering the song and using that as his Probable Cause to go back into a suspect’s home all stretches credibility.\n\nPerformances (2): Again, we have a very solid cast. Giuntoli seems like an actual person in this role, rather than a Television Hero, and he and Hornsby have wonderful on-screen chemistry. I was intrigued by Reggie Lee as Sgt. Wu, who managed to inject the few lines he had in the episode with so much personality that it made me curious about his character. And Silas Weir Mitchell is a standout, providing wonderful comedy relief as Eddie Monroe, reformed blutbad.\n\nProduction (1.5): Portland provides a lush, green backdrop for Grimm, and cinematographer, Clark Mathis, highlights this to its fullest effect. That, coupled with the soft design of the homes and many of the costumes allow the show to echo fairy tales while remaining firmly rooted in the real world. Likewise the visual effects when Nick sees a fairy tale creature’s true nature. The transformations between beast and human always look plausible.\n\nRepresentation (1.5): Grimm scores points in that, of its six lead actors, two are played by minority actors—Russell Hornsby and Reggie Lee. However, they, as well as the doctor treating Nick’s aunt, are the only minority faces we see the entire episode. The pilot doesn’t do terribly well by its female characters, either. So far, Juliette’s main purpose seems to be to look pretty, comfort Nick when he’s troubled, and to provide a focal point for his angst over his new ability. She exists only as a device in relation to his character. I hope that changes. Likewise, the hexenbeist (played by Claire Coffee) seems to exist simply to serve Captain Renard, though her connection to him is merely touched upon at the end of the episode, and we don’t see them interact much.\n\nWhat saves the show on that front, for me, is Nick’s Aunt Marie. Not only do we have an older woman who is clearly willing to fight dangerous creatures with elaborate weaponry, but she’s also a nice change from the standard Older White Man Leading Young Female to Empowerment. It’s nice that finally, after student-teacher relationships like Buffy/Giles (Buffy the Vampire Slayer), The Bride/Bill (Kill Bill), and Sweet Pea/Wise Man (Sucker Punch), we have an older woman leading a young man to empowerment. Because, you know, sometimes men can learn things from women. I know, right?\n\nAudience Engagement (2): Everyone is into procedurals in one way or another. The fact that Grimm is a police procedural that looks at fairy tales sideways means that it will not only entertain fantasy/fairy tale fans, but also people looking for a procedural other than CSI or SVU to watch. It also allows for more standalone stories, which means that viewers can easily jump on anywhere. As for more direct audience interaction, NBC is on it. The cast of Grimm, as well as NBC, are all extremely active on Twitter and Facebook, and actually talk to fans rather than simply send them links related to the show. They also allowed Twitter followers the chance to see the pilot early, as well as had a contest for a Grimm “Little Red Riding Hoodie” during the premiere.\n\nTOTAL SCORE FOR GRIMM: 8.5 (out of 10)\n\nWEEK 1 WINNER: Grimm\n\nWhew! That was a close race! What do you think? Let me know below!\n\nOnce Upon a Time airs Sundays at 8/7 Central on ABC. Grimm airs Fridays at 9/8 Central on NBC.\n\nTeresa Jusino thinks Juliette Silverton deserves better. She can be heard on the popular Doctor Who podcast, 2 Minute Time Lord, participating in a roundtable on Series 6.1. Her “feminist brown person” take on pop culture has been featured on websites like ChinaShopMag.com, PinkRaygun.com, Newsarama, and PopMatters.com. Her fiction has appeared in the sci-fi literary magazine, Crossed Genres; she is the editor of Beginning of Line, the Caprica fan fiction site; and her essay “Why Joss is More Important Than His ‘Verse” is included in Whedonistas: A Celebration of the Worlds of Joss Whedon By the Women Who Love Them, which is on sale now wherever books are sold! 2012 will see Teresa’s work in an upcoming non-fiction sci-fi anthology. Get Twitterpated with Teresa,“like” her on Facebook, or visit her at The Teresa Jusino Experience.", "images": ["https://reactormag.com/wp-content/uploads/2025/11/Barnacle_cover-300ppx.jpeg", "https://www.gravatar.com/avatar/d60db14c7712525e54c832b62fe76ef0?s=64&r=pg&d=wavatar", "https://reactormag.com/wp-content/uploads/2023/11/Group-copy-4.png", "https://www.gravatar.com/avatar/6e75ff43c1dec533807dc790001bcce0?s=64&r=pg&d=wavatar", "https://reactormag.com/wp-content/uploads/2014/12/Once-Upon-a-Time-Pilot-2.jpg", "https://reactormag.com/wp-content/uploads/2014/12/Grimm-Pilot-1.jpg", "https://reactormag.com/wp-content/uploads/2017/08/WordsRadiance-Shallan-64x64.jpg", "https://www.gravatar.com/avatar/0c22e2a9eaf513b812ef27400498e236?s=64&r=pg&d=wavatar", "https://reactormag.com/wp-content/uploads/2024/01/126320_privacyoptions-svg.svg", "https://reactormag.com/wp-content/uploads/2025/10/PhantomView_Cover_300ppx.jpeg", "https://as2.ftcdn.net/v2/jpg/14/04/89/51/1000_F_1404895184_kEXz7DM2aCTN3j2j0dlrWtLxUCS3yzfF.jpg", "https://www.gravatar.com/avatar/f39ba605755f676c19c075dbc293ee38?s=64&r=pg&d=wavatar", "https://secure.gravatar.com/avatar/1396a606ff85e03055d93ed2a3b66c4f20ea71ce02fc0591d1a960d10de32223?s=64&r=pg", "https://reactormag.com/wp-content/uploads/2023/11/Group-7902.png", "https://secure.gravatar.com/avatar/2f90c5220a89f4caba3a4fb834375d3a7c38f1571074a66abd3bf5dec2331ea8?s=64&r=pg", "https://reactormag.com/wp-content/uploads/2014/12/Once-Upon-a-Time-Pilot-3.jpg", "https://reactormag.com/wp-content/uploads/2023/11/Group-6272-1-1.png", "https://reactormag.com/wp-content/uploads/2025/11/The-Belle-of-the-Ball_Cover-300ppx.jpeg", "https://www.gravatar.com/avatar/f6e2aa4697d6a98dd6627c0a3f0249f5?s=64&r=pg&d=wavatar", "https://www.gravatar.com/avatar/43bb65509e1cfb157b298bafcf962d3e?s=64&r=pg&d=wavatar", "https://secure.gravatar.com/avatar/5d7978aac4569c3840f40360c267cf2ef9a6fd5b3e9a56851b66af403d60682b?s=64&r=pg", "https://reactormag.com/wp-content/uploads/2014/12/Grimm-Pilot-2.jpg", "https://www.gravatar.com/avatar/043312f2a13dcaf47f0e24d11c3d584c?s=64&r=pg&d=wavatar", "https://secure.gravatar.com/avatar/e3a7a3b9fe93b7a2ec51d561e9e95334e7df651a8e8566684132ee3a36f61e6d?s=64&r=pg", "https://www.gravatar.com/avatar/94f050c7e70ee0469061e85297717e00?s=64&r=pg&d=wavatar", "https://www.gravatar.com/avatar/54545ab8625c975a0ec089c45069be03?s=64&r=pg&d=wavatar", "https://reactormag.com/wp-content/uploads/2023/11/Group-copy-3.png", "https://www.gravatar.com/avatar/e67f251ff26992ef88787a840b0cda9a?s=64&r=pg&d=wavatar", "http://reactormag.com/wp-content/uploads/2014/12/Once-Upon-a-Time-Pilot-2.jpg", "https://secure.gravatar.com/avatar/eb33585913106e4cdedf3b4aef03b81e232cd2120cf49f3a23dca1f1faabbc38?s=64&r=pg", "https://www.gravatar.com/avatar/23de063d6e4526afe579084e721f8e83?s=64&r=pg&d=wavatar", "https://www.gravatar.com/avatar/734d8c4e607bce4d980e636ee0a99be6?s=64&r=pg&d=wavatar", "https://www.gravatar.com/avatar/a0a39cade7a5e885710fb6e6cc110f62?s=64&r=pg&d=wavatar", "https://reactormag.com/wp-content/uploads/2023/12/Reactor-logo_type-w-stubb-KO.svg", "https://secure.gravatar.com/avatar/?s=64&r=pg", "https://www.gravatar.com/avatar/5b2cb3a0da552c357339d458fd7486ec?s=64&r=pg&d=wavatar", "https://www.gravatar.com/avatar/eee33e95d55cbccfafdeb7edf23ecf25?s=64&r=pg&d=wavatar", "https://www.gravatar.com/avatar/2355d086d2389048f337e892b8fa1376?s=64&r=pg&d=wavatar", "https://secure.gravatar.com/avatar/ebc6cb7176e392a15e49d63e0ddb29fe8fdf7d272cd35f0a31f372eacc77afe1?s=56&r=pg", "https://www.gravatar.com/avatar/3dcb95966ccba87591d898886b614f7f?s=64&r=pg&d=wavatar", "https://www.gravatar.com/avatar/4147f986dca1b789190cd81e8a5b4a00?s=64&r=pg&d=wavatar", "https://reactormag.com/wp-content/uploads/2014/12/Grimm-Pilot-3.jpg", "https://reactormag.com/wp-content/uploads/2023/11/Group-6272.png", "https://secure.gravatar.com/avatar/0a7a8de411d2019cf3aed5338de34c48c3c975ac1d4645a342493f1940df1e89?s=64&r=pg", "https://www.gravatar.com/avatar/6f0b3ee88bee42f3ed1adaf56e3a0b11?s=64&r=pg&d=wavatar", "https://secure.gravatar.com/avatar/038094370ec688399354fc7a86ef95cfd27d84adb7bec20d718157d020100fcd?s=64&r=pg", "https://reactormag.com/wp-content/uploads/2023/11/Group-copy-2.png", "https://secure.gravatar.com/avatar/47d25a5ac2c8213d82263c500d6fa9d016c341862fccd118b8b7372535c92e6d?s=56&r=pg", "https://reactormag.com/wp-content/uploads/2014/12/Once-Upon-a-Time-Pilot-1.jpg", "https://www.gravatar.com/avatar/f96b6f058b306a80572b87cecc44b094?s=64&r=pg&d=wavatar", "https://www.gravatar.com/avatar/ce192ee6b44ac4cecc2843f4cff3a22c?s=64&r=pg&d=wavatar", "https://reactormag.com/wp-content/uploads/2025/10/Timelike-Curves_Cover_300ppx.jpeg", "https://secure.gravatar.com/avatar/7657df01afba21701b19bbb51184defc6213fc5791ef555f7cfa07a12b1e8592?s=64&r=pg"], "top_img": "http://reactormag.com/wp-content/uploads/2014/12/Once-Upon-a-Time-Pilot-2.jpg", "keywords": [], "authors": ["Teresa Jusino", "Teresa Jusino Was Born The Day Skylab Fell. Coincidence", "She Doesn'T Think So. A Native New Yorker", "Jusino Has Been Telling Stories Since She Was Three Years Old", "She Wrote A Picture Book In Crayon In Nursery School. However", "Nursery School Also Found Her Playing The Angel Gabriel In A Christmas Pageant", "So Her Competing Love Of Performing Existed An Early Age. Her Two Great Loves Competed All The Way Through Early Adulthood.", "She Attended Nyu'S Tisch School Of The Arts Where She Majored In Drama", "English Literature", "After Which She Focused On Acting"], "canonical_link": "https://reactormag.com/once-upon-a-time-vs-grimm-battle-of-the-pilots/", "title": "Once Upon a Time vs. Grimm: Battle of the Pilots - Reactor", "meta_data": {"viewport": "width=device-width,initial-scale=1,maximum-scale=2", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Once Upon a Time vs. Grimm: Battle of the Pilots - Reactor", "description": "The shows in the Battle of the Network Fairy Tale Shows have a lot in common. Both make cute, modern-day references to the fairy tales that inspired them; both have talented casts; and both seem to like putting their orphaned protagonists in red leather jackets. They also seem to be each other’s exact opposite. Whereas […]", "url": "https://reactormag.com/once-upon-a-time-vs-grimm-battle-of-the-pilots/", "site_name": "Reactor", "image": "http://reactormag.com/wp-content/uploads/2014/12/Once-Upon-a-Time-Pilot-2.jpg"}, "article": {"publisher": "https://www.facebook.com/tordotcom", "published_time": "2011-10-31T16:00:00+00:00", "modified_time": "2024-01-26T14:51:32+00:00"}, "author": "Teresa Jusino", "twitter": {"card": "summary_large_image", "creator": "@tordotcom", "site": "@tordotcom", "label1": "Written by", "data1": "Teresa Jusino", "label2": "Est. reading time", "data2": "10 minutes"}, "msapplication-TileImage": "https://reactormag.com/wp-content/uploads/2024/01/Reactor-logo_R-icon-ba422f.svg"}, "movies": [], "publish_date": 1320033600.0, "source": "https://www.tor.com", "summary": ""}