{"url": "http://abcnews.go.com/ThisWeek/week-transcript-madeleine-albright-sen-lindsey-graham-sen/story?id=12143913&page=4", "text": "November 14, 2010 — -- (BEGIN VIDEO CLIP)\n\nAMANPOUR (voice-over): Welcome to our viewers here and around the world. I'm Christiane Amanpour. And at the top of the news this week, the Gang of 20. At the big summit in Seoul, U.S. economic policies come under fire from China and Germany. Are America's woes putting its global leadership in question?\n\nOBAMA: A whole host of other countries are doing very well. Naturally, they are going to be more assertive.\n\nAMANPOUR: Former Secretary of State Madeleine Albright and Republican Senator Lindsey Graham debate America's role in the world.\n\nThen, American austerity.\n\nBOWLES: The path we're on today is not sustainable. We are headed for disaster.\n\nAMANPOUR: Two members of the president's deficit commission, Democratic Senator Kent Conrad and Honeywell International Chairman and CEO David Cote share some sobering views on tough economic choices the United States faces.\n\nAnd the coming showdown over tax cuts.\n\nBOEHNER: Making these permanent will be the most important thing we could do to help create jobs in the country.\n\nAMANPOUR: That and all the week's politics on our roundtable with George Will, New York Times columnist Paul Krugman, Ruth Marcus of the Washington Post, and Robert Kagan of the Brookings Institution.\n\nAnd the Sunday funnies.\n\nFALLON: China is expected to overtake the U.S. as the world's biggest economy in the next two years. Americans couldn't believe it. They were like, \"That hasn't happened already?\"\n\n(LAUGHTER)\n\nANNOUNCER: From all across our world to the heart of our nation's capital, ABC \"This Week\" with Christiane Amanpour starts now.\n\n(END VIDEO CLIP)\n\nAMANPOUR: And hello again.\n\nBy the time Air Force One lands in Washington this evening, it will have flown around the world, a world that is fast changing, as the president found out during his 10-day trip to Asia. ABC's senior White House correspondent Jake Tapper has been with the president and brings us this report.\n\n(BEGIN VIDEOTAPE)\n\nTAPPER (voice-over): Rebuked by American voters and reminded to focus more on the economy, President Obama began his Asian trip talking it up as a sort of international stimulus to open markets to American goods and bolster American jobs.\n\nOBAMA: We're actually doing some business while we're here. With every $1 billion we sell in exports, 5,000 jobs are supported at home. For America, this is a job strategy.\n\nTAPPER: In Mumbai, India, flanked by American CEOs, the president announced deals between U.S. and Indian companies totaling nearly $10 billion in U.S. exports and maintaining more than 50,000 American jobs.\n\nA cause for celebration, as he and the first lady joined in on the festivities marking the Hindu holiday of Diwali.\n\n(on-screen): By the end of the week here in South Korea, there was no cause for dancing. Some of the world's fastest-growing economies refused President Obama's entreaties to alter their economic policies, policies the president needs changed to fully implement his export strategy, his job strategy.\n\nOBAMA: Instead of hitting home runs, sometimes we're going to hit singles.\n\nTAPPER (voice-over): And sometimes he struck out, failing to convince South Korea to open their markets to American beef and cars. At stake: $10 billion in exports and 70,000 American jobs.\n\nFailing to convince Chinese President Hu Jintao to stop artificially building up the dollar and holding down Chinese currency.\n\nAnd failing to convince his fellow G-20 leaders to use stronger language in the joint declaration on China's currency manipulation.\n\nOBAMA: That is an irritant not just to the United States, but is an irritant to a lot of China's trading partners and those who are competing with China to sell goods around the world.\n\nTAPPER: The president was even forced to push back on attacks that the U.S. was engaging in its own currency manipulation, defending a move by the independent Federal Reserve to inject $600 billion into the U.S. economy.\n\nOBAMA: From everything I can see, this decision was not one designed to have an impact on the currency, on the dollar. It was designed to grow the economy.\n\nTAPPER: Criticisms from G-20 leaders who questioned President Obama's spending habits were made all the more relevant when the co-chairs of the president's own debt commission put forth controversial proposals to reduce the deficit.\n\nBOWLES: This debt is like a cancer that will truly destroy this country from within.\n\nTAPPER: Ones attacked by liberals and conservative, showing how difficult reducing the deficit will be. Modesty was forced upon the president in this trip full of complications.\n\nFor \"This Week,\" Jake Tapper, ABC News, traveling with the president.", "images": ["https://i.abcnewsfe.com/a/bf2f8ed5-a320-4d7e-b583-179abe072d92/trump-signs-shutdown-bill-20251112-ap-jh_1763006747268_hpMain_square.jpg?w=208", "https://i.abcnewsfe.com/a/009e3420-a5ae-477a-aeb3-edfa85648814/johnson-2-gty-jef-251118_1763480583977_hpMain_square.jpg?w=208", "https://i.abcnewsfe.com/a/a904a3c1-1e2d-4174-9130-e846e8059dee/carnivaldeath_1762746067738_hpMain_square.jpg?w=208", "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://i.abcnewsfe.com/a/7669390d-d027-4ec7-9673-1d2eccafbbec/comey-gty-er-251117_1763404424377_hpMain_square.jpg?w=208", "https://assets-cdn.abcotvs.net/static/images/DisneyPlus.svg"], "top_img": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "keywords": [], "authors": ["Abc News"], "canonical_link": "https://abcnews.go.com/ThisWeek/week-transcript-madeleine-albright-sen-lindsey-graham-sen/story?id=12143913", "title": "'This Week' Transcript: Madeleine Albright, Sen. Lindsey Graham, Sen. Kent Conrad and David Cote", "meta_data": {"viewport": "initial-scale=1.0, user-scalable=yes", "og": {"locale": "en_US", "site_name": "ABC News", "url": "https://abcnews.go.com/ThisWeek/week-transcript-madeleine-albright-sen-lindsey-graham-sen/story?id=12143913", "title": "'This Week' Transcript: Madeleine Albright, Sen. Lindsey Graham, Sen. Kent Conrad and David Cote", "description": "Transcript of 'This Week' interviews with former Secretary of State Madeleine Albright, Sen. Lindsey Graham, Sen. Kent Conrad and David Cote.", "image": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "type": "article"}, "description": "Transcript of 'This Week' interviews with former Secretary of State Madeleine Albright, Sen. Lindsey Graham, Sen. Kent Conrad and David Cote.", "keywords": "this week, christiane amanpour, foreign policy, madeleine albright, lindsey graham, kent conrad, david cote, honeywell, Article, 12143913", "theme-color": "#fff", "copyright": "2025 ABC News", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "'This Week' Transcript: Madeleine Albright, Sen. Lindsey Graham, Sen. Kent Conrad and David Cote", "lastPublishedDate": "2010-11-15T11:03:05Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/prism-story,12143913", "ipad": "abcnewsipad://link/prism-story,12143913", "googleplay": "https://abcnews.go.com/ThisWeek/week-transcript-madeleine-albright-sen-lindsey-graham-sen/story?id=12143913"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "'This Week' Transcript: Madeleine Albright, Sen. Lindsey Graham, Sen. Kent Conrad and David Cote", "description": "Transcript of 'This Week' interviews with former Secretary of State Madeleine Albright, Sen. Lindsey Graham, Sen. Kent Conrad and David Cote.", "url": "https://abcnews.go.com/ThisWeek/week-transcript-madeleine-albright-sen-lindsey-graham-sen/story?id=12143913", "image": {"identifier": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/prism-story,12143913", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/prism-story,12143913", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/ThisWeek/week-transcript-madeleine-albright-sen-lindsey-graham-sen/story?id=12143913", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/ThisWeek/week-transcript-madeleine-albright-sen-lindsey-graham-sen/story?id=12143913"}}}, "movies": [], "publish_date": null, "source": "http://abcnews.go.com", "summary": ""}