{"url": "https://www.reddit.com/r/PrettyLittleLiars/comments/6bu2i4/pretty_little_liars_stars_look_back_on_their/", "text": "Most shocking plot twists in PLL\n\n\"Pretty Little Liars\" is renowned for its intricate and often baffling plot twists. Here are some of the most shocking and memorable plot twists as shared by Redditors:\n\nEzra's Book and Alison Connection\n\nMona's Reveal as A\n\nCeCe's Identity and Transgender Reveal\n\nCeCe Drake being revealed as Alison's transgender sister, Charlotte DiLaurentis, was a highly controversial and shocking twist. \"CeCe being trans and the fact that she dated her own brother... That storyline, at least to me, always seemed like they had no intention of making her A and pulled that one out of their ass and then had to come up with an explanation of her being with Jason and the best they could do was CeCe being like 'yep, that was weird, we never had s*x though because he is my brother and that would be REALLY weird, whereas dating him was just weird'.\"\n\nAlison's Survival\n\nThe reveal that Alison was alive all along was a major plot twist that changed the entire direction of the show. \"Alison being alive\"\n\nAlex Drake's Twin Reveal\n\nThe final reveal of Alex Drake as Spencer's evil twin sister was a last-minute twist that left many viewers divided. \"The season 7 series finale. Alex Drake as Spencer’s twin was so last minute.\"\n\nMaya's Death and Nate St. Germain\n\nMaya's death and the reveal that Nate St. Germain was her killer was a dark and unexpected twist. \"Nate St. Germain being a psychotic murderer who killed Maya and was about to kill Paige and Emily + Emily killing him in self defense.\"\n\nToby's Fake Death and A Team Involvement\n\nToby's fake death and his involvement with the A Team was a shocking betrayal. \"Toby’s fake death, shocked meee\"\n\nEmily's Eggs and Wren's Sperm\n\nThe storyline where Emily's eggs were fertilized with Wren's sperm to create Alison's babies was both bizarre and shocking. \"The whole situation with Emily’s eggs and Wrens sperm impregnating Ali was just all sorts of fucked up.\"\n\nNoel Kahn's Beheading\n\nNoel Kahn's sudden and gruesome beheading was a shocking and almost comical plot point. \"Noel accidentally decapitating himself with an axe and no one giving a shit. His actual head rolled on the floor and hit Emily’s foot and we never hear about it again.\"\n\nMrs. D's Dog Digging Up Her Body\n\nThe ridiculous plot point of Mrs. D's dog digging up her body was both shocking and hilarious. \"Mrs. D adopting a dog right before her death, just so it could dig up her body and then disappear into the ether and never be mentioned again.\"\n\nThese plot twists kept viewers on the edge of their seats, even if some of them were a bit too outlandish. For more discussions and insights, consider visiting these subreddits:", "images": ["https://id.rlcdn.com/472486.gif", "https://emoji.redditmedia.com/nbgogsm7aezz_t5_3nqvj/snoo_tableflip", "https://styles.redditmedia.com/t5_2sdxf/styles/communityIcon_a4bgn3z75qi71.png?width=96&height=96&frame=1&auto=webp&crop=96%3A96%2Csmart&s=6215e3fa6fe82f428c792bf42f6efae9fe94da78", "https://www.redditstatic.com/shreddit/assets/favicon/64x64.png", "https://external-preview.redd.it/I79j6NQ3Yb0o6C3JBBcv-VgvthXu8cyFVK8aqCcZJWg.jpg?width=640&crop=smart&auto=webp&s=8ed137fc9fb5d36bdd7eea431958ccae9ff1d7f6", "https://styles.redditmedia.com/t5_2sdxf/styles/bannerBackgroundImage_ftd8mfyuq4g91.png"], "top_img": "https://www.redditstatic.com/shreddit/assets/favicon/64x64.png", "keywords": [], "authors": [], "canonical_link": "", "title": "The heart of the internet", "meta_data": {"viewport": "width=device-width, initial-scale=1, viewport-fit=cover", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black", "msapplication-navbutton-color": "#000000", "theme-color": "#000000"}, "movies": [], "publish_date": null, "source": "https://www.reddit.com", "summary": ""}