{"url": "https://www.nydailynews.com/entertainment/bobbi-kristina-brown-nick-gordon-arrested-florida-article-1.3868413", "text": "Nick Gordon, the former boyfriend of Bobbi Kristina Brown, was arrested on domestic violence charges in Florida Saturday for the second time in a year.\n\nGordon, 29, was arrested by the Seminole County Sheriff’s Office on one domestic violence charge of “battery — touch or strike,” online records show.\n\nHe posted a $500 bond, and is slated to appear in court April 6.\n\nAccording to an arrest report obtained by the Daily News, Gordon told cops that his “crazy” girlfriend Laura Leal “attacked him for no reason.”\n\nHe reportedly told police he wanted his fired-up flame out of his house after she ripped his shirt, threw a bottle at him and, amid the chaos, cut his thumb.\n\nMeanwhile, as the cops spoke to Leal, they noticed she had a “visible injury to include slightly swollen bottom lip with dried blood.” She told police she had picked up her boyfriend from a bar, and that he struck her face several times and pulled her hair as she drove, telling her that he “should make her wreck the vehicle.”\n\nLeal refused to press charges against Gordon, but he was arrested based on the visible evidence, according to the report.\n\nThe arrest comes nine months after Gordon was busted for brutally beating Leal in a jealous rage.\n\nGordon hit and punched his live-in girlfriend in the face and the back of the head with a closed fist after accusing her of trying to hook up with one of his friends last June, according to a police report.\n\nThe domestic battery and kidnapping charges were dropped in August after Leal became uncooperative.\n\nMeanwhile, Gordon was ordered to pay $36 million to Brown’s estate in 2016 months after being found legally responsible for her death.\n\nGordon was found legally responsible for the death of 22-year-old Bobbi Kristina Brown, who died in 2015.\n\nThe only daughter of Whitney Houston died in 2015 at age 22 six months after she was found face-down and unresponsive in a bathtub in her suburban Atlanta home.\n\nAn autopsy revealed a slew of drugs in her system that Brown’s family pinned on Gordon, claiming he fed her a “toxic cocktail” and placed her in the tub.\n\n“Domestic violence killed my daughter and on March, 4 2018, the Bobbi Kristina Brown Serenity House held our first event to strike back at domestic violence.” Bobby Brown said in a statement to the Daily News..\n\n“I personally would like to extend my hand to Ms. Leal and offer her services through our organization. I do not want to see any more families destroyed at the hands of domestic violence and I do not want any more women to suffer like my daughter did. We are here to assist and we hope to hear from Ms. Leal.”\n\nJust last month, Bobby Brown told Rolling Stone he felt justice for his daughter had not yet been served — and would only be once Gordon was rotting away in jail.\n\n“Justice? If he was locked up somewhere where somebody can rape him. That’s just how I feel,” the singer said. “He raped me by taking my daughter away.”", "images": ["data:image/webp;base64,UklGRiQAAABXRUJQVlA4IBgAAAAwAQCdASoBAAEAAwA0JaQAA3AA/v3AgAA=", "https://secure.gravatar.com/avatar/?s=85&d=mm&r=g", "https://www.nydailynews.com/wp-content/uploads/migration/2018/03/12/SFDRCH5OOOWEFWZ3FH6W6EBDNI.jpg?w=1024&h=670", "https://www.nydailynews.com/wp-content/uploads/2023/08/New_York_Daily_News_nydredblack-1.svg"], "top_img": "https://www.nydailynews.com/wp-content/uploads/migration/2018/03/12/SFDRCH5OOOWEFWZ3FH6W6EBDNI.jpg?w=1024&h=670", "keywords": [], "authors": ["Rachel Desantis"], "canonical_link": "https://www.nydailynews.com/2018/03/11/bobbi-kristina-browns-ex-boyfriend-nick-gordon-arrested-for-domestic-violence-in-florida/", "title": "Bobbi Kristina Brown’s ex-boyfriend Nick Gordon arrested for domestic violence in Florida", "meta_data": {"application-name": "newyorkdailynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "robots": "max-image-preview:large", "tdm-reservation": 1, "mrf": {"authors": "Rachel Desantis", "canonical": "https://www.nydailynews.com/2018/03/11/bobbi-kristina-browns-ex-boyfriend-nick-gordon-arrested-for-domestic-violence-in-florida/"}, "description": "Nick Gordon, the ex-boyfriend of Bobbi Kristina Brown, was arrested on domestic violence charges for the second time in one year Saturday.", "generator": "WordPress 6.8.3", "og": {"type": "article", "title": "Bobbi Kristina Brown’s ex-boyfriend Nick Gordon arrested for domestic violence in Florida", "url": "https://www.nydailynews.com/2018/03/11/bobbi-kristina-browns-ex-boyfriend-nick-gordon-arrested-for-domestic-violence-in-florida/", "description": "Nick Gordon, the former boyfriend of Bobbi Kristina Brown, was arrested on domestic violence charges in Florida Saturday for the second time in a year. Gordon, 29, was arrested by the Seminole Coun…", "site_name": "New York Daily News", "image": {"identifier": "https://www.nydailynews.com/wp-content/uploads/migration/2018/03/12/SFDRCH5OOOWEFWZ3FH6W6EBDNI.jpg?w=1024&h=670", "width": 1024, "height": 670}, "locale": "en_US"}, "article": {"published_time": "2018-03-11T22:29:35+00:00", "modified_time": "2018-04-07T04:26:28+00:00"}, "twitter": {"text": {"title": "Bobbi Kristina Brown’s ex-boyfriend Nick Gordon arrested for domestic violence in Florida"}, "image": "https://www.nydailynews.com/wp-content/uploads/migration/2018/03/12/SFDRCH5OOOWEFWZ3FH6W6EBDNI.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.nydailynews.com/wp-content/uploads/2023/09/cropped-DailyNewsCamera-7.webp?w=270"}, "movies": [], "publish_date": 1520807375.0, "source": "https://www.nydailynews.com", "summary": ""}