{"url": "https://www.harpersbazaar.com/culture/film-tv/a15051809/versace-family-american-crime-story-statement/", "text": "If you hadn’t heard about the Menendez brothers before this year, you surely know who they are now. New titles arriving on Netflix—including Ryan Murphy’s grisly second installment of Monsters—are reviving the buzz over a true-crime case that has been closed for decades. The spotlight falls on Lyle and Erik Menendez, brothers currently imprisoned for killing their parents in their Beverly Hills mansion in 1989.\n\nThe murders of José and Mary Louise “Kitty” Menendez shocked the world, and people across the country were captivated by the 1990s courtroom trials that followed, which ultimately resulted in both brothers being sentenced to life in prison without the possibility of parole. Now, with the Los Angeles district attorney recommending a resentencing of 50 years to life for the brothers, the Menendezes have their first shot at parole—and freedom—in years. The prosecutors filed the petition on October 24, and the hearing may go before a judge as soon as next month.\n\nGetty Images Erik and Lyle Menendez in front of their Beverly Hills home\n\nIn Monsters, Murphy focuses on some of the aspects of physical and sexual abuse that Lyle and Erik say they suffered under their father, and which ultimately motivated them to kill their parents—but the showrunner also took creative liberties that left the real-life brothers and their family members feeling misrepresented.\n\n“I believe Ryan Murphy cannot be this naive and inaccurate about the facts of our lives so as to do this without bad intent,” Erik said in a statement posted on X by his wife, Tammi. “It is sad for me to know that Netflix’s dishonest portrayal of the tragedies surrounding our crime have taken the painful truths several steps backward—back through time to an era when the prosecution built a narrative on a belief system that males were not sexually abused, and that males experienced rape trauma differently than women.”\n\nThe brothers told their story in their own words in The Menendez Brothers, a new documentary that arrived on Netflix on October 7.\n\nBelow, we break down the true story behind the Menendez brothers’ crimes.\n\nWho was the Menendez family?\n\nPatriarch José Menendez was a Cuban immigrant who moved to the United States shortly after the Cuban Revolution of the 1950s. He met and married Mary Louise Andersen, who went by the nickname Kitty. After earning an accounting degree at Queens College, José worked his way up the corporate ladder, working as an executive at Hertz and later RCA Records, according to Biography.com. In 1968, the couple had Lyle, and Erik arrived in 1970. The family moved from New York City to New Jersey before finally settling in Los Angeles, where they purchased an opulent home in Beverly Hills.\n\nLyle and Erik have maintained that their father began to sexually abuse Lyle when the older boy was between the ages of six and eight; they claim he began to sexually abuse Erik when the younger brother turned six.\n\n\n\nGetty Images\n\nLyle and Erik’s older cousin Diane Vander Molen testified in support of the brothers’ claims of abuse. Vander Molen regularly spent summers with the Menendezes, and she recalled Lyle telling her about the alleged incidents in 1976, when she was 17 and he was eight. “One night, I was in my room changing the sheets in my bed, and Lyle came in,” she told ABC in 2017. “He became very serious about asking me if he could sleep in the other bed next to mine, and saying that he was afraid to sleep in his own bed, because his father and him had been touching each other down there, indicating that it was his genital area.”\n\nVander Molen told Kitty about what Lyle had said, but the older woman refused to believe her son’s claims. “By her demeanor, I could tell that she was not believing any of this,” Vander Molen said. “And [she] went downstairs, and Lyle had already gotten into the bed next to mine, and she went ahead and yanked him by the arm and took him back upstairs, and I never heard anything else about that.”\n\nVander Molen added, “I know that they would never, ever have done what they did unless they felt that they had no choice—that it was either them or their parents. I believe that very strongly.”\n\nHow did the murders happen?\n\nOn August 20, 1989, 21-year-old Lyle and 18-year-old Erik shot their parents over a dozen times with a 12-gauge shotgun in the den of the family’s Beverly Hills home, where José and Kitty were reportedly watching television. José was shot at point-blank range, while Kitty was shot in her attempt to flee.\n\nBoth brothers have since said that an argument with their parents preceded the fatal shootings.\n\nGetty Images\n\n“I was in the foyer,” Erik said in the 2017 docuseries The Menendez Murders: Erik Tells All, according to People. “Lyle was coming out of the den and my mom was following him and saying, ‘You’re not going out,’ and Lyle said, ‘Why?’ And my mom said, ‘Because I said so,’ and then my dad came out and he told my mom to shut up. He looked at Lyle and said, ‘You’re not going out.’ He told me to go to my room and he told me he would be there in a minute.”\n\nLyle shared a similar testimony in court, recalling having said, “You’re not going to touch my brother.”\n\n“We had a big argument,” he continued, per People. “I was saying that he wasn’t going to touch Erik.”\n\n“Dad, he charged at Lyle and he yelled, ‘I do what I want in my family. He’s not your little brother, he’s my son,’ ” Erik elaborated.\n\nAfter the outburst, Lyle claimed Kitty “said that I had ruined the family, then my dad came out and took her by the arm and they walked into the den and then my dad closed the doors. I was sure that that was it. … I realized that they had been waiting for Erik to get home like I had been. And I just freaked out. I thought they were going ahead with their plan to kill us.”\n\nLyle then rushed upstairs to his brother, allegedly telling him, “It’s happening now.”\n\n“I felt like my heart was going to explode, it was just pounding,” he continued. “I felt like my life was over right then.”\n\nHow did Lyle and Erik get caught?\n\nFollowing the slaying of their parents, Lyle and Erik changed into clean clothes and purchased movie tickets for Batman, per Town & Country. When they arrived back home, Lyle called 911, pretending to have discovered his parents’ dead bodies in between hysterical sobs. (“I think I was just absolutely broken down with stress,” he later recalled in a Dateline interview.)\n\nOver the next six months, the brothers spent their late parents’ money lavishly, with Lyle buying multiple Rolexes, Erik hiring a tennis coach with a price tag of $60,000 per year, and both leasing waterfront condominiums in Marina del Rey, according to T&C. Together, they spent $1 million in the span of half a year.\n\nStill, the murders haunted the brothers. Erik ended up confessing to the crimes during a session with his psychologist, Jerome Oziel, who thereafter told his mistress, Judalon Smyth. Smyth ultimately went to the police with this information, leading to the brothers’ arrests.\n\nTheir cases became a cultural sensation, with many following the televised trials on Court TV. In 1993, they both took the stand in separate trials with defense lawyer Leslie Abramson, who argued that the brothers had murdered their parents believing that their own lives were at risk, and that they had endured traumatic physical and sexual abuse from their father. Family members testified in support of these claims, including Vander Molen, Kitty’s sister Joan Vander Molen, and the brothers’ cousin Andy Cano. Both their trials ended in a hung jury.\n\nGetty Images\n\nLyle and Erik were tried again jointly in 1996. In this new trial, the judge limited evidence that would support the brothers’ claims of abuse. They were ultimately convicted of two counts of first-degree murder and conspiracy to murder, and sentenced to life in prison without the possibility of parole.\n\nPam Bozanich, a prosecutor on the first trial, has expressed her disbelief at Erik and Lyle’s allegations of abuse. “The only way that they could go to trial and have any hope of not getting the death penalty was to make up an abuse excuse,” she told People in 2017. “This was all about money. And I was very convinced by the end of the trial that the whole thing was fabricated, based upon evidence that I gathered from various sources.”\n\nLyle told the outlet, “There’s always going to be skepticism. People think I just hopped up on the witness stand and told a story that a sleazy defense attorney made up. But many people knew there was sexual abuse in this family.”\n\nWhere are Lyle and Erik now?\n\nFollowing their conviction, Lyle and Erik were sent to separate facilities. After years of Lyle repeatedly requesting a transfer to a prison closer to his brother, he was eventually relocated in 2018 to the Richard J. Donovan Correctional Facility in San Diego, where he and Erik are both serving out their life sentences to this day.\n\nWhen they were at last reunited in person after spending more than 20 years apart, Erik and Lyle reportedly “burst into tears immediately,” journalist Robert Rand told ABC. “They just hugged each other for a few minutes without saying any words to each other. Then the prison officials let them spend an hour together in a room.”\n\nHow do the brothers feel about Ryan Murphy’s Monsters?\n\nNetflix Nicholas Chavez as Lyle Menendez, Chloë Sevigny as Kitty Menendez, Javier Bardem as José Menendez, and Cooper Koch as Erik Menendez in Monsters: The Lyle And Erik Menendez Story\n\nErik spoke out against Murphy’s portrayal of the murders in a statement shared by his wife, Tammi. “I believed we had moved beyond the lies and ruinous character portrayals of Lyle, creating a caricature of Lyle rooted in horrible and blatant lies rampant in the show,” he said. “I can only believe they were done so on purpose.”\n\nHe added, “How demoralizing to know that one man with power can undermine decades of progress in shedding light on childhood trauma. Violence is never an answer, never a solution, and is always tragic. As such, I hope it is never forgotten that violence against a child creates a hundred horrendous and silent crimes scenes darkly shadowed behind glitter and glamour and rarely exposed until tragedy penetrates everyone involved.”\n\nWhat have their family members said about the show?\n\nOn September 25, Erik and Lyle’s relatives also expressed their distaste for Murphy’s latest series, in a statement penned by Kitty’s sister, Joan.\n\n“We are virtually the entire extended family of Erik and Lyle Menéndez,” Joan began. “We are 24 strong and today we want the world to know we support Erik and Lyle. We individually and collectively pray for their release after being imprisoned for 35 years. We know them, love them, and want them home with us.”\n\n“Our family has been victimized by this grotesque shockadrama,” she continued. “The character assassination of Erik and Lyle, who are our nephews and cousins, under the guise of a ‘storytelling narrative’ is repulsive. We know these men. We grew up with them since they were boys. We love them and to this very day we are close to them. We also know what went on in their home and the unimaginably turbulent lives they have endured. Several of us were eyewitnesses to many atrocities one should never have to bear witness to.”\n\n", "images": ["https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/mormon-wives-s3-vertical-2700x4000-pre-69161bf6c5647.jpg?crop=0.821xw:0.554xh;0.120xw,0.313xh&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/x-regular.e414d97.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/environmental-cami-0004-b-f-691267d898409.jpg?crop=0.668xw:1.00xh;0.167xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1948402787-66f55bd1daaa7.jpg?crop=1.00xw:0.658xh;0,0.0756xh&resize=1200:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/caret-left-regular.5546078.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-539886710-66f55bf733141.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/harpersbazaar/static/images/logos/logo.823d7af.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/2h0rt0m-6760993bc43de.jpg?crop=0.502xw:1.00xh;0.196xw,0&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523ffffff&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/harpersbazaar/static/images/logos/network-logo.6416a85.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1948402787-66f55bd1daaa7.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/envelope-simple-regular.91a0134.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1915737726-66f55bf66d43d.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2245070659-69160eed748df.jpg?crop=0.668xw:1.00xh;0.0577xw,0&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg?primary=%2523ffffff", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-51584592-66f55bd17a824.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/tatb-noahcentineo-lanacondor-006-jpg-67169059d93fc.jpg?crop=0.418xw:1.00xh;0.239xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/shutterstock-editorial-5884281n-1598622951.jpg?crop=0.673xw:1.00xh;0.0994xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1900661345-2-685596bc438ef.jpg?crop=0.668xw:1.00xh;0.167xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/1107-biancashows-00-6914d2ec1cec1.jpg?crop=0.563xw:1.00xh;0.367xw,0&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg", "https://hips.hearstapps.com/hmg-prod/images/environmental-tommy-0101c-rt-69123734c7d04.jpg?crop=0.665xw:1.00xh;0.146xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1948402787-66f55bd1daaa7.jpg?crop=1xw:0.7371064623032312xh;0,0.0756xh", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/bookmark-simple-regular.9d9d56b.svg", "https://hips.hearstapps.com/hmg-prod/images/severance-photo-020316-67ec20c38e0b2.jpg?crop=0.415xw:1.00xh;0.405xw,0&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/globe-simple-regular.e7f303c.svg", "https://hips.hearstapps.com/hmg-prod/images/menendez-family-portrait-comp-d-prepd-66f5e116eda39.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/xhbz-best-movies-amazon-prime-685327fcec682.jpg?crop=0.566xw:1.00xh;0.0208xw,0&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/saved.ad81f1a.svg?primary=%2523000000", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/174890-0421rc-69160dea50767.jpg?crop=0.670xw:1.00xh;0.117xw,0&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523ffffff&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523ffffff&id=social-button-icon"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1948402787-66f55bd1daaa7.jpg?crop=1.00xw:0.658xh;0,0.0756xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.harpersbazaar.com/culture/film-tv/a62385571/monsters-lyle-erik-menendez-murders-true-story-explained/", "title": "The True Story Behind the Menendez Brothers’ Murders", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "\"Monsters\": The True Story of the Menendez Brothers' Murders", "description": "Ryan Murphy's latest installment of Netflix's \"Monsters\" is shining a new light on the 1989 killings of José and Kitty Menendez—but how much of it is true?", "theme-color": "#000000", "og": {"site_name": "Harper's BAZAAR", "title": "The True Story Behind the Menendez Brothers’ Murders", "description": "With the news that the Los Angeles district attorney has recommended a resentencing for the brothers, we revisit the crime that ultimately landed them behind bars", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1948402787-66f55bd1daaa7.jpg?crop=1.00xw:0.658xh;0,0.0756xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.harpersbazaar.com/culture/film-tv/a62385571/monsters-lyle-erik-menendez-murders-true-story-explained/", "type": "article"}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "opinion": "false", "section": "Film, TV & Theatre", "modified_time": "2024-10-25T13:57:00Z", "published_time": "2024-10-25T13:57:00Z"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "parsely-metadata": "{\"socialHeadline\":\"The True Story Behind the Menendez Brothers’ Murders\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1948402787-66f55bd1daaa7.jpg?crop=0.764xw:1.00xh;0.0929xw,0&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1948402787-66f55bd1daaa7.jpg?crop=1.00xw:0.658xh;0,0.0756xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1948402787-66f55bd1daaa7.jpg?crop=0.764xw:1.00xh;0.0929xw,0", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1948402787-66f55bd1daaa7.jpg?crop=1.00xw:0.658xh;0,0.0756xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "timely", "sailthru.excerpt": "If you hadn’t heard about the Menendez brothers before this year, you surely know who they are now. New titles arriving on Netflix—including Ryan Murphy’s grisly second installment of Monsters—are reviving the buzz over a true-crime case that has been closed for decades. The spotlight falls on Lyle and Erik", "sailthru.tags": "culture,Culture,film-tv,Film, TV & Theatre,Harper's BAZAAR-US", "sailthru.date": "2024-10-25 13:57:00", "sailthru.socialtitle": "The True Story Behind the Menendez Brothers’ Murders", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1729864620.0, "source": "https://www.harpersbazaar.com", "summary": ""}