{"url": "https://www.independent.co.uk/arts-entertainment/tv/news/the-walking-dead-episode-16-finale-conclude-seasons-showrunner-rick-negan-maggie-a8301006.html", "text": "Your support helps us to tell the story Read more Support Now From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it's investigating the financials of Elon Musk's pro-Trump PAC or producing our latest documentary, 'The A Word', which shines a light on the American women fighting for reproductive rights, we know how important it is to parse out the facts from the messaging. At such a critical moment in US history, we need reporters on the ground. Your donation allows us to keep sending journalists to speak to both sides of the story. The Independent is trusted by Americans across the entire political spectrum. And unlike many other quality news outlets, we choose not to lock Americans out of our reporting and analysis with paywalls. We believe quality journalism should be available to everyone, paid for by those who can afford it. Your support makes all the difference. Read more\n\nAs the climax of The Walking Dead season 8 arrives, so too does the end of the series as we know it.\n\nThis weekend's finale - titled 'Wrath' - marks the final episode with Scott Gimple in the position as showrunner - and he's making some rather big claims regarding the future of the series.\n\n“This episode isn’t just like these 15 episodes coming to a conclusion, but Angela and myself and the writers had always talked about this in many ways being sort of the conclusion of the first eight seasons,” he said. “This show will be very much a new show next year and with a bigger, new narrative. It was something I was really excited about getting into even before season 8. And so there was just a certain weight in the air of the kind of conclusion that we were getting closer to. It was a weird graduation for everybody.”\n\nThe \"bigger narrative\" Gimple hints at could well include mysterious new character Georgie (Jayne Atkinson) who was introduced earlier this season not to mention the helicopter that almost picked up Jadis (Pollyanna McIntosh).\n\nDiscussing filming of the finale with Entertainment Weekly, he said: I was there, and it was an intense vibe. It was a very hard season. And kind of everybody is in this episode. It was just intense. People were pretty to the limit this year emotionally.“\n\nNot much is known about what to expect from the finale other than the fact it will see the end of All Out War which commenced following the season 6 finale which saw the arrival of Jeffrey Dean Morgan's Negan, the leader of The Saviours. The past two seasons have been weighted by the ensuing battles led by Rick Grimes (Andrew Lincoln) and Maggie Rhee (Lauren Cohan) with the next episode set to see a showdown to end all showdowns amid what is sure to be countless deaths of big characters.\n\nThe finale will also see the surprise return of a character who was killed off earlier this season.\n\nThe Walking Dead season 8 continues on AMC every Sunday with the UK premiere arriving the next evening on FOX as well as being available to stream on NOW TV.\n\nFollow Independent Culture on Facebook", "images": ["https://static.the-independent.com/s3fs-public/thumbnails/image/2018/04/12/11/the-walking-dead-season-9.jpg?width=1200&height=800&crop=1200:800"], "top_img": "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/04/12/11/the-walking-dead-season-9.jpg?width=1200&height=800&crop=1200:800", "keywords": [], "authors": [], "canonical_link": "https://www.independent.co.uk/arts-entertainment/tv/news/the-walking-dead-episode-16-finale-conclude-seasons-showrunner-rick-negan-maggie-a8301006.html", "title": "The Walking Dead season 8 episode 16: Finale will 'conclude' all seasons thus far, says showrunner", "meta_data": {"robots": "max-image-preview:large,max-video-preview:-1", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "News", "sitename": "The Independent", "page path": "/arts-entertainment/tv/news", "page type": "Article", "adPageType": "Article Page", "description": "'This show will be very much a new one next year and with a bigger narrative'", "og": {"updated_time": "2018-04-16T02:30:02.000Z", "site_name": "The Independent", "title": "The Walking Dead showrunner says season 9 will be the beginning of a new show", "url": "https://www.the-independent.com/arts-entertainment/tv/news/the-walking-dead-episode-16-finale-conclude-seasons-showrunner-rick-negan-maggie-a8301006.html", "type": "article", "description": "'This show will be very much a new one next year and with a bigger narrative'", "image": {"identifier": "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/04/12/11/the-walking-dead-season-9.jpg?width=1200&height=800&crop=1200:800", "secure_url": "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/04/12/11/the-walking-dead-season-9.jpg?width=1200&height=800&crop=1200:800"}, "locale": "en_GB"}, "article": {"published_time": "2018-04-16T02:30:02.000Z", "modified_time": "2018-04-16T02:30:02.000Z", "section": "Culture", "subsection": "TV & Radio", "author_name": "J", "content_type": "story", "word_count": 579, "image_count": 1, "embed_count": 2, "video_count": 1, "internal_link_count": 1, "external_link_count": 5}, "date": "2018-04-16T02:30:02.000Z", "viewport": "width=device-width,initial-scale=1,minimum-scale=1", "theme-color": "#919191", "indy-test-internal-article-helmet": "indy", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "twitter": {"title": "The Walking Dead showrunner says season 9 will be the beginning of a new show", "site": "@Independent", "card": "summary_large_image", "description": "'This show will be very much a new one next year and with a bigger narrative'", "image": "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/04/12/11/the-walking-dead-season-9.jpg?width=1200&height=800&crop=1200:800"}, "keywords": "[\"The Walking Dead\",\"The Walking Dead season 8\",\"Internal\"]"}, "movies": [], "publish_date": 1523845802.0, "source": "https://www.independent.co.uk", "summary": ""}