{"url": "https://en.wikipedia.org/wiki/Live_with_Kelly_and_Ryan", "text": "American morning talk show\n\nLive with Kelly and Mark (or simply Live) is an American syndicated morning talk show hosted by Kelly Ripa and Mark Consuelos. Executive produced by Michael Gelman, the Live with... show formula has aired under various hosts since 1983 locally on WABC-TV in New York City and 1988 nationwide. As of 2016 , it is produced by WABC.[1]\n\nWith roots in A.M. Los Angeles and A.M. New York, Live began as The Morning Show, hosted by Regis Philbin and Cyndy Garvey; the show rose to national prominence as Live with Regis and Kathie Lee when Philbin was joined by Kathie Lee Gifford. The franchise has had longstanding success and has won the Daytime Emmy Award for Outstanding Talk Show and Outstanding Talk Show Hosts.[2] Since April 2023, the show has been hosted by Ripa and her husband, Mark Consuelos. Prior to Consuelos, Ripa previously co-hosted the show with Philbin, Michael Strahan, and Ryan Seacrest.\n\nProduction [ edit ]\n\nConcept [ edit ]\n\nExecutive producer Michael Gelman said in 1993, \"The real concept of the show, in a symbolic sense, is that they are husband and wife. They have their coffee mugs and they're chit-chatting about what's going on.\" It is the basis of the show's signature \"Host Chat\", an unscripted on-air conversation between the co-hosts that opens each show. Following Host Chat is a trivia segment in which the show telephones a home viewer, who must answer a question (usually about a guest on a recent show) to win a vacation for themselves and a door prize for a member of the studio audience. Shortly before the COVID-19 pandemic, the hosts started playing a new game with the contestant before the trivia question, wherein the caller gives the host two statements, one true and one false. The segment has since become \"Stump Mark!\", and if Consuelos guesses wrong, the caller wins a \"Live with Kelly and Mark\" mug, and t-shirt proclaiming, \"I Stumped Mark!\". The show then continues with interviews with celebrity guests, musical performances, and other recurring segments, including regular features showcasing fashion, food, health, and lifestyle topics.[3]\n\nThe husband and wife breakfast chat program was popular in old time radio, beginning with Ed and Pegeen Fitzgerald, and later Dick Kollmar and Dorothy Kilgallen and Tex McCrary and Jinx Falkenburg. Parodied by Woody Allen in his film Radio Days, these programs were popular locally in New York, and Philbin would have heard them in his youth.\n\nThe format of Live! has been emulated by other successful talk shows such as the British programmes This Morning and Today with Des and Mel. However, it has also proven to be resilient against similarly formatted talk shows from other syndicators or networks, seeing programs such as George & Alana, Donny & Marie, Living It Up! with Ali & Jack, The Morning Show with Mike and Juliet, and Anderson Live all launch and end in short periods of time throughout its entire run, and fail to make any headway in the traditional 9 a.m. local time slot Live! has been traditionally slotted in for most markets.\n\nThe show is broadcast live from New York City, on weekdays at 9 a.m. for stations in the Eastern Time Zone, and is tape-delayed for the rest of the country. Most affiliates also rebroadcast Live during the overnight hours, and after that, episodes stream for two months the next day on Hulu. As of 2025, two tapings a day generally take place Monday through Wednesday.[4] Although the program is generally associated with the ABC network and airs on all ABC owned-and-operated stations (to the point a common misnomer, even by companies whose stations carry the series, is that it is scheduled and produced by the network as a part of ABC Daytime[5][a]), in many markets the program is syndicated to stations affiliated with other networks.[6] Live did not air in a morning timeslot on all ABC-owned stations until September 2013, as WLS-TV in Chicago programmed the 9 a.m. timeslot with The Oprah Winfrey Show---WLS-TV was the originating station for Oprah in the 1980s---and then with Windy City Live after Oprah concluded its run in 2011. Although WLS-TV had carried the New York-based Live in an overnight timeslot earlier in its run, the show aired on other Chicago stations, including WGN-TV from 2002 through 2013.[7][8]\n\nRecurring segments [ edit ]\n\nGuinness World Record Breaker Week, New York Auto Show Week, Broadway Week, and Top Teacher Week are examples of features frequently visited on the show, highlighting a different aspect of the theme everyday that week. Live will also invite \"whiz kids\" to oppose the co-hosts at spelling, athletics, mathematics, sport stacking, and technology, among other tasks. A recurring gag with Philbin as co-host was him challenging seniors—preferably over the age of 100—at tennis, basketball, ping-pong, and bowling, for example. Regular contributors to the show include toy enthusiast Chris Byrne, style maven Lawrence Zarian, animal expert Peter Gros, automotive expert Alan Taylor, pediatrician Greg Yapalater, home and gardening show host Katie Brown, technology specialist Leo Laporte, entrepreneur Carley Roney, Science Bob, veterinarian Jennifer Jellison, and nutrition expert Wendy Bazilian.[9]\n\nSpecials [ edit ]\n\nThe show has hosted a number of specials over the years since it began. Specials have included a Halloween celebration in which the co-hosts wore dozens of costumes and portrayed some of the most famous and infamous names in pop culture.[10]\n\nIn February 2011, Live threw a wedding for a couple who wrote in with reasons why they should be married on the show.[11] Viewer submissions have also been accepted for their \"Moms Dream Come True Special\", where the co-hosts pay tribute to a select group of mothers.[12][13] The show has aired a Post-Oscar special the day after the awards ceremony live from the Dolby Theatre in Hollywood.[14]\n\nOn location [ edit ]\n\nLive has been to eight countries and nearly 25 states, logging 200,000 miles (320,000 km).[15] The list of remotes includes Tampa, Hawaii, Monaco, Banff, San Antonio, Aspen, Walt Disney World, New Orleans, Disneyland, Las Vegas, San Francisco, Paris, Detroit, Chicago, The Bronx, Los Angeles, the USS Intrepid, Minneapolis–Saint Paul, Maui, Prince Edward Island, London, Scottsdale, the White House, Charlotte, Churchill Downs, Niagara Falls, Puerto Rico, Marina del Rey, Philadelphia, Branson, Mount Rushmore, The Bahamas, and the Dolby Theatre's set for the 85th Academy Awards.\n\nHistory [ edit ]\n\nCo-host timeline [ edit ]\n\nMain co-host\n\nRecurring co-host\n\nGuest co-host\n\nSegment guest\n\nCo-hosts timeline Co-host Years Seasons 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 Regis Philbin 1988–2011 Kathie Lee Gifford 1988–2000 Kelly Ripa 2001–present Michael Strahan 2012–16 Ryan Seacrest 2017–23 Mark Consuelos 2023–present\n\nLogos Live with Regis and Kathie Lee logo from 1993 to 1997\n\nLive with Regis logo from 2000 to 2001\n\nLive! with Regis and Kelly logo from 2001 to 2009\n\nLive with Kelly and Michael logo from 2012 to 2016\n\nLive with Kelly logo from 2016 to 2017\n\nLive with Kelly and Ryan logo from May to September 2017\n\nLive with Kelly and Ryan logo from September 2017 to April 2023\n\nLive with Kelly and Mark logo from April to September 2023\n\n1983–1988: The Morning Show [ edit ]\n\nThe Morning Show, co-hosted by Regis Philbin and Cyndy Garvey, premiered locally on WABC-TV in New York on April 4, 1983. In 1984, Garvey left the show and Philbin hired Ann Abernathy, whom he remembered from his time at KABC for her engaging personality, to assume the co-host duties.[16] After Abernathy got married and decided to return to Los Angeles, Kathie Lee Johnson (later Gifford) joined Philbin officially on June 24, 1985. Their chemistry proved to be successful as The Morning Show soon became number 1 in the market[17] and went on to debut in national syndication on September 5, 1988, when the title was changed to Live with Regis and Kathie Lee.\n\n1988–2000: Live with Regis and Kathie Lee [ edit ]\n\nEarly on, Live matched its local success with impressive national ratings and established itself as a dominant fixture in American television.[18] Entertainment Weekly described Regis Philbin and Kathie Lee Gifford as \"an agreeable mismatch\" and their famous banter as \"playful, edgy, and amusing.\"[19] Gifford's positivity throughout public scandals such as the 1996 accusation that her clothing line was being run under sweatshop conditions and her husband Frank Gifford's 1997 affair with a flight attendant resonated with the female demographic of the show, but ultimately made her a media target prompting her emotional departure on July 28, 2000. \"Over a third of my life has been [at Live],\" she said. \"This is family. It is been an amazing journey.\"[16] Gifford appeared on Live! with Regis and Kelly on three occasions, for the show's 20th Anniversary special on September 14, 2007, to promote her book Just When I Thought I'd Dropped My Last Egg: Life and Other Calamities on April 14, 2009, and again as a guest to bid farewell to Philbin on his second to last show, November 17, 2011. Gifford went on to host the fourth hour of Today with Hoda Kotb; that show mainly airs an hour after Live! in most markets, though a few markets where both shows air at 10:00 a.m. against each other do exist.\n\n2000–2001: Live with Regis [ edit ]\n\nWhen looking for Gifford's replacement, Philbin and executive producer Michael Gelman teamed Philbin with a handful of potential co-hosts, including Joy Philbin, Kathleen Murphy, Rosie O'Donnell, Jann Carl, Whoopi Goldberg, Kathy Fountain, Gloria Estefan, Jillian Reynolds, Lisa Rinna, Caroline Rhea, and Suzanne Sena. This met with positive fan response and a 26 percent ratings increase.[20] Philbin won his first Daytime Emmy Award for Live during this period. Ripa auditioned four months into the search, on November 1, 2000.[21] Three months later, on the morning of February 5, 2001, Philbin officially announced that Ripa would replace Gifford as his new permanent co-host.[22]\n\n2001–2011: Live! with Regis and Kelly [ edit ]\n\nRipa's co-hosting duties began the following week, on February 12, 2001.[22] The young-audience demographic of Live! with Regis and Kelly increased by 80 percent, with Ripa credited by major outlets such as the Chicago Tribune and Entertainment Weekly for bringing a new life to the show (dubbed \"the Ripa effect\").[23][24] Seven months into Philbin's and Ripa's run, the September 11 attacks on the United States occurred, with coverage beginning twelve minutes before that day's episode would have started. The show was pre-empted for a week following the attacks and returned September 18, 2001.\n\nTogether they hosted the annual Disney Parks Christmas Day Parade during this era. In 2009, when Philbin underwent hip surgery, Nick Cannon replaced him as the host for that year's Christmas special. Ryan Seacrest also took Philbin's place on occasion. Ripa later had a stress fracture, which made it necessary for her to host the show on crutches. At times Maria Menounos filled in for Ripa, who was elsewhere on assignment for the show.\n\nShortly after celebrating his and Ripa's 10th anniversary together, Philbin announced on January 18, 2011, that he would leave Live!.[25] The show then held a \"Regis Farewell Celebration Season\", showcasing Philbin's top moments from his 28 years on the program, 1983–2011.[26] His final show aired November 18, 2011.[27]\n\nLive! with Regis and Kelly won two Daytime Emmy Awards during its run.\n\n2011–2012: Live! with Kelly (first era) [ edit ]\n\nAfter Philbin's departure, the show was renamed Live! with Kelly. Joining Ripa were various co-hosts from broadcasting and entertainment. On November 21, 2011, Jerry Seinfeld was the first of 60[28] men and women to join Ripa at the co-host desk: Reggie Bush, Kyle MacLachlan, Russell Brand, Howie Mandel, Carl Edwards, Chris Harrison, Daniel Radcliffe, Michael Buckley, Michael Catherwood, Rob Lowe, Martin Short, Neil Patrick Harris, Peter Facinelli, Boomer Esiason, Ben Mulroney, Dan Abrams, Rob Thomas, David Duchovny, Pat Kiernan, Derek Hough, D. L. Hughley, Jesse Palmer, Carson Kressley, Carrie Ann Inaba, Mark Feuerstein, Jim Parsons, Nick Lachey, Jonah Hill, Michael Strahan, Apolo Anton Ohno, Joel McHale, Cat Deeley, Tyler Perry, Andy Cohen, Alec Baldwin, Josh Groban, Jerry O'Connell, Seth Meyers, Mike Greenberg, Kristin Chenoweth, Andy Samberg, Mark Consuelos, Lucy Liu, Taye Diggs, Randy Jackson, Mario Lopez, Matthew Broderick, Mary J. Blige, Ed Robertson, Michael Bublé, Matthew Morrison, Kevin Jonas, Tony Potts, Dana Carvey, Jimmy Kimmel, Kim Kardashian, L.A. Reid, Bryant Gumbel, Daniel Dae Kim, Jussie Smollett, and Sam Champion.[29][additional citation(s) needed]\n\nIn April 2012, Live! debuted a new set described as a \"contemporary downtown-style loft, spacious and yet maintaining the studio's warmth and intimacy.\"[30] It was the first major set re-design since the start of the show's 10th season in national syndication (1997–98).\n\nIn July 2012, People magazine reported that Meyers, Groban, and Strahan were the top three contenders to replace Philbin.[31]\n\n2012–2016: Live with Kelly and Michael [ edit ]\n\nOn the September 4, 2012, episode, Michael Strahan made his 16th appearance on the show and was introduced as Ripa's permanent co-host. The former New York Giants defensive end had begun his TV career on Fox NFL Sunday, a job he said he would keep even though it shoots in Los Angeles. The Ripa-Strahan chemistry proved to be successful. Live With Kelly & Michael had been the No. 2 syndicated talk show averaging a 2.8 national rating over Strahan's entire tenure while Live With Regis & Kelly averaged a 2.6. Live With Kelly & Michael brought in 268,000 more audience members daily, on average, than the show attracted during the end of the Philbin run.[32] On January 19, 2016, the show was renewed through at least the 2019–2020 season.[33]\n\nOn April 19, 2016, it was announced that Strahan would leave Live to join Good Morning America full-time.[34] The decision was revealed to the program's production staff just after that day's broadcast of Live, and officially announced on the program by Strahan the following day. Ripa, however, was absent from that day's episode, and ABC announced later in the day that Live would have guest co-hosts through April 25, 2016. Although speculated to have been a reaction to Strahan's abrupt exit, an ABC staff member stated to Variety that Ripa's sudden absence was a \"pre-scheduled vacation\".[35]\n\nRipa returned on April 26, 2016, using the opening of the episode to address the reception to Strahan's exit, and ABC's continued commitment to Live as a series. She said she was annoyed that ABC had not given her advance notice of negotiations to move Strahan to GMA.[36] Strahan's final episode on Live occurred on May 13, 2016, and featured several flashback moments from the four years that he co-hosted the show.\n\n2016–2017: Live with Kelly (second era) [ edit ]\n\nOn May 16, 2016, Ripa began the second era of her Live career as a single host. Jimmy Kimmel joined her as her first guest co-host.\n\n2017–2023: Live with Kelly and Ryan [ edit ]\n\nOn May 1, 2017, it was announced that Ryan Seacrest would succeed Strahan as the new permanent co-host, after a yearlong syndicated co-host search. Seacrest also joined as an executive producer to the show.[37][38][39]\n\nOn September 5, 2017, Live updated the show's look with a new, modern logo, modifications to the studio, and a brand-new show opener.\n\nIn March 2020, the show began broadcasting remotely from the hosts' homes due to the COVID-19 pandemic.[40] During this period, Philbin died on July 25. On August 26, 2020, it was announced that the 33rd season would premiere on September 7, with the show returning to its New York City studio the next day.[41][42] The premiere did not have a studio audience and the hosts were seated six feet apart.[43] Beginning with the 2020–21 season, Disney Media Distribution began to authorize the show's ABC affiliates to run the show a second time daily in an overnight timeslot, allowing late night viewers to watch the show or record it, even if it were pre-empted by breaking news.\n\n2023–present: Live with Kelly and Mark [ edit ]\n\nOn February 16, 2023, Seacrest announced that he would be leaving Live in the spring, primarily due to the travel, as his primary residence is in Los Angeles. Mark Consuelos, husband of Ripa, was announced as Seacrest's replacement.[44][45] The final episode of Live with Kelly and Ryan aired on April 14. On April 17, the first episode of Live with Kelly and Mark aired.\n\nOn September 5, 2023, Live updated the show's look with a new, modern logo, modifications to the studio, and a brand-new show opener.\n\nKelly Ripa and Mark Consuelos during the \"Stump Mark!\" segment of the show\n\nOn April 7, 2025, the show relocated from the ABC Broadcast Center to Disney's new 7 Hudson Square campus; initially, the program broadcast from an atrium on the building's 10th floor while the new studio was finalized. The new studio officially premiered the following week on April 14.[46][47]\n\nCritical reception [ edit ]\n\nThe New York Daily News gave the program a positive review: \"…When it comes to the amount and playfulness of morning talk, nothing beats Live.\"[48] In 2001, 2011, 2012, 2015, and 2016 the show won the Daytime Emmy Award for Outstanding Talk Show Hosts and in its 24th year, after 21 nominations, it won the Daytime Emmy Award for Outstanding Talk Show. In addition, its co-hosts have received two TV Guide Award nominations for Favorite Daytime Talk Show and multiple People's Choice nominations for Favorite Talk Show Host.\n\nAccording to daytime television ratings, viewership averages 5 million per episode,[49] ranking #1 in all big markets, such as New York City, Pittsburgh, Los Angeles, Chicago, Philadelphia, Dallas, San Francisco, and Miami. Dominating its time periods, Live is the top-rated morning show and regularly the #1 syndicated talk show.[50] The show also streams on a day delay through Hulu, retaining two months of archives at a time.\n\nNotes [ edit ]\n\n^ Good Housekeeping is published by the is published by the Hearst Corporation and the co-owned Hearst Television airs the show on several of their stations, including non-ABC affiliates, but makes this common mistake in several places within the cited article.\n\nReferences [ edit ]\n\nOfficial website", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Live_with_Regis_and_Kathie_Lee_%281993%E2%80%931997%29.jpg/150px-Live_with_Regis_and_Kathie_Lee_%281993%E2%80%931997%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Live_with_Kelly_onscreen_logo.png/150px-Live_with_Kelly_onscreen_logo.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Live_with_Kelly_and_Mark_logo.png/250px-Live_with_Kelly_and_Mark_logo.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Live_with_Regis.png/150px-Live_with_Regis.png", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/d/d3/Live_with_Kelly_and_Mark_%282023_logo%29.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/40px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/Live_with_Kelly_%26_Mark_7_Hudson_Square_studios.jpg/250px-Live_with_Kelly_%26_Mark_7_Hudson_Square_studios.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/Live_with_Kelly_and_Ryan_logo_Sept_2017.svg/150px-Live_with_Kelly_and_Ryan_logo_Sept_2017.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Live_with_Kelly_and_Mark_%282023_logo%29.png/250px-Live_with_Kelly_and_Mark_%282023_logo%29.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Live_with_Regis_and_Kelly_%282001%E2%80%932009%29.gif/125px-Live_with_Regis_and_Kelly_%282001%E2%80%932009%29.gif", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Live_with_Kelly_and_Ryan_logo_2017.png/250px-Live_with_Kelly_and_Ryan_logo_2017.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/60px-Question_book-new.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Live_with_Kelly_and_Michael.png/250px-Live_with_Kelly_and_Michael.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Live_with_Kelly_%26_Mark_Stump_Mark_segment_9-2-2025.jpg/250px-Live_with_Kelly_%26_Mark_Stump_Mark_segment_9-2-2025.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Live_with_Kelly_and_Mark_%282023_logo%29.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Live_with_Kelly_and_Mark", "title": "Live with Kelly and Mark", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.3", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Live_with_Kelly_and_Mark_%282023_logo%29.png", "width": 1200, "height": 592}, "title": "Live with Kelly and Mark - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}