{"url": "en.wikipedia.org/wiki/List_of_Super_Bowl_halftime_shows", "text": "Halftime shows are common during many American football games. Entertainment during the Super Bowl, the annual championship game of the National Football League (NFL), is one of the more lavish of these performances and is usually very widely watched on television in the United States.\n\nBackground [ edit ]\n\nView of the halftime show at Super Bowl I\n\nDuring most of the Super Bowl's first decade (starting on January 15, 1967), the halftime show featured a college marching band. The show's second decade featured a more varied show, often featuring drill teams and other performance ensembles; the group Up with People produced and starred in four of the performances. Starting in the 1990s, to counter other networks' efforts to counterprogram the game,[1] the show was headlined by popular music acts each year, including New Kids on the Block, Michael Jackson, Gloria Estefan, Clint Black, Patti LaBelle, and Tony Bennett.\n\nStarting with Super Bowl XXXII, commercial sponsors presented the halftime show; within five years, the tradition of having a theme—begun with Super Bowl III—ended, replaced by major music productions by arena rock bands and other high-profile acts. However, following the 1992 Super Bowl halftime broadcast, which was successfully challenged in viewership by a Fox broadcast of an episode of In Living Color, the NFL opted to include the use of popular culture spectacles annually.[2][3] In the six years immediately following an incident at Super Bowl XXXVIII where Justin Timberlake exposed one of Janet Jackson's breasts in an alleged \"wardrobe malfunction\", all of the halftime shows consisted of a performance by one artist or group, with the musicians in that era primarily being rock artists from the 1960s, 1970s and 1980s. These shows were considered \"family friendly\" and the time in which they took place has been described as \"the age of reactionary halftime shows\".[4]\n\nSince Super Bowl XLV, the halftime show has returned to featuring popular contemporary musicians, with the typical format featuring a single headline artist collaborating with a small number of guest acts.\n\nThe NFL does not pay the halftime show performers an appearance fee, though it covers all expenses for the performers and their entourage of band members, management, technical crew, security personnel, family, and friends.[5] The Super Bowl XXVII halftime show with Michael Jackson provided an exception, as the NFL and Frito-Lay agreed to make a donation and provide commercial time for Jackson's Heal the World Foundation.[6][7][8] According to Nielsen SoundScan data, the halftime performers regularly experience significant spikes in weekly album sales and paid digital downloads due to the exposure.[9] For Super Bowl XLIX, it was reported by the Wall Street Journal that league officials asked representatives of potential acts if they would be willing to provide financial compensation to the NFL in exchange for their appearance, in the form of either an up-front fee, or a cut of revenue from concert performances made after the Super Bowl. While these reports were denied by an NFL spokeswoman, the request had, according to the Journal, received a \"chilly\" response from those involved.[10][11]\n\nThe process of deciding a headline performer for the Super Bowl halftime show is disputed.[12] According to The Charlotte Observer, it begins with a panel that includes the National Football League's (NFL) director of entertainment, members of its production company, and the halftime show's director and producer. A short list of potential performers is created and given to the Super Bowl's host city, who makes the final decision.[13] However, members of its host committee claimed that a headline performer is solely picked by the league, and they are notified on who was chosen in the same manner as the general public.[14]\n\nOn August 13, 2019, the NFL announced a partnership with Shawn \"Jay-Z\" Carter and his entertainment company Roc Nation to be named the league's live music entertainment strategist.[15] In that role, Jay-Z and his firm became co-producers and consultants of the Super Bowl halftime show, allowing them to be involved in selecting music for NFL usage and choosing entertainers to perform in televised promotional spots throughout the season.[16] \"We really wanted to start to focus on leading to culture,\" Seth Dudowsky, the league's head of music, explained. \"Whether that's the culture of the city, what's happening in culture at large and then focusing on it so that what we're doing feels culturally relevant and using that platform for artists to be able to be themselves and show their art on stage. We want them to feel empowered.\"[17]\n\nHistory [ edit ]\n\nThe following is a list of the performers, producers, themes, and sponsors for each Super Bowl game's show. This list does not include national anthem performers, which are listed in the article List of national anthem performers at the Super Bowl. Names in bold are headline performers.\n\n1960s [ edit ]\n\n1970s [ edit ]\n\n1980s [ edit ]\n\n1990s [ edit ]\n\n2000s [ edit ]\n\n2010s [ edit ]\n\n2020s [ edit ]\n\nAchievements [ edit ]\n\nSee also [ edit ]", "images": ["http://en.wikipedia.org/static/images/icons/wikipedia.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/19/SuperBowl_I_-_Los_Angeles_Coliseum_%28cropped%29.jpg/250px-SuperBowl_I_-_Los_Angeles_Coliseum_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/16/American_football.svg/40px-American_football.svg.png", "http://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "http://en.wikipedia.org/static/apple-touch/wikipedia.png", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "http://en.wikipedia.org/static/images/footer/wikimedia.svg"], "top_img": "http://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_Super_Bowl_halftime_shows", "title": "List of Super Bowl halftime shows", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "viewport": "width=1120", "og": {"title": "List of Super Bowl halftime shows - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}