{"url": "https://people.com/tv/tori-and-dean-10-years-5-kids-and-all-the-ups-and-downs-in-between/", "text": "From their Fiji wedding to their eventual split, here's a complete timeline of Tori Spelling and Dean McDermott's relationship.\n\nSpelling officially filed for divorce in March 2024, and the former couple settled the divorce more than a year later in November 2025.\n\n\"All Tori's ever done to this day is want me to be happy and healthy and I inflicted a lot of damage and pain on that woman,\" he told the Daily Mail. \"It's going to be living the rest of my life making amends because I took something that was really beautiful and I just tore it down year after year , day after day.\"\n\nLater that year, McDermott took full responsibility for the deterioration of his marriage to Spelling.\n\nThe couple, who share five children and have experienced many ups and downs, announced their separation in June 2023.\n\nAfter nearly two decades together, Tori Spelling and Dean McDermott have called it quits.\n\n01 of 37 2005: Tori Spelling and Dean McDermott meet Chris Polk/Getty Spelling and McDermott met in Ottawa, Canada, while filming the TV movie Mind Over Murder. Both were married to other people at the time: McDermott to Mary Jo Eustace, and Spelling to Charlie Shanian.\n\n02 of 37 May 7, 2006: Tori Spelling and Dean McDermott marry Jeff Kravitz/Getty Less than a month after finalizing her divorce from Shanian, and following McDermott's split from Eustace, the actors got married in a private ceremony in Fiji on May 7.\n\n03 of 37 March 13, 2007: Tori Spelling and Dean McDermott welcome first child Jeff Vespa/Getty On March 13, Spelling gave birth to the couple's first child, Liam. That same year, Spelling and McDermott's first reality television series, Tori & Dean: Inn Love, premiered on Oxygen. The show followed the couple as they ran a bed and breakfast, Chateau La Rue, in Fallbrook, California.\n\n04 of 37 June 9, 2008: Tori Spelling and Dean McDermott welcome first daughter Chris Polk/Getty The McDermott family welcomed a second child and first daughter, Stella, on June 9. They also moved back to Los Angeles after their stint as hotel-runners, and Tori & Dean: Inn Love got rebranded as Tori & Dean: Home Sweet Hollywood.\n\n05 of 37 2009: Dean McDermott reveals Tori Spelling has reconciled with mom Brian To/Getty Spelling reconciled with mom Candy after years of feuding. \"They have been in communications,\" McDermott told PEOPLE. \"Candy has seen the kids, which is what this is all about.\"\n\n06 of 37 May 8, 2010: Tori Spelling and Dean McDermott renew their vows Michael Bezjian/Getty The couple renewed their vows in Beverly Hills in May. The ceremony took place in a private home. McDermott marked the occasion by furnishing Spelling with a custom Darkened Diamond Eternity Band by Neil Lane. Two months later they experienced a scary moment when McDermott was admitted to the hospital with a punctured and collapsed lung after a dirt bike crash.\n\n07 of 37 October 10, 2011: Tori Spelling and Dean McDermott welcome third child David Livingston/Getty Spelling gave birth to the couple's third child and second daughter, Hattie. One month later, she conceived their fourth child. A spin-off of Tori & Dean: Home Sweet Hollywood premiered on Oxygen, Tori & Dean: sTORIbook Weddings, which chronicled the couple's venture into wedding planning. Spelling also opened up a boutique, InvenTORI, in Sherman Oaks, California.\n\n08 of 37 August 30, 2012: Tori Spelling is hospitalized during fourth pregnancy David Livingston/Getty Pregnant with her fourth child, Spelling was hospitalized for three months due to placenta previa and excessive bleeding. After waking at home in a pool of blood, Spelling was able to rouse only her daughter after calling for help. \"I had to scream for Stella and I'll never forget the look on her face when she saw me surrounded by blood everywhere. I didn't want to panic her and I said, 'Baby, will you go get Daddy? Just tell him I'm bleeding,' \" Spelling recalled. Doctors were able to stop the bleeding, but saving the baby meant Spelling had to commit to bedrest in the hospital for the duration of her pregnancy. She gave birth to son Finn in August, but was forced to undergo emergency surgery in the days after her C-section.\n\n09 of 37 March 1, 2013: Tori Spelling refutes rumors of marital trouble with Dean McDermott Tori Spelling with Dean McDermott and their children. JB Lacroix/Getty There were rumors of trouble in Spelling and McDermott's marriage, which Spelling refuted. \"It's just sad that our actual happiness would probably be deemed boring,\" she said. \"I can handle [media scrutiny.] I always have. But don't do it to a man that has done nothing but loved me and our children. He has stood by me during the good times and held my hand through the darkest moments of my life.\" However, trouble did come later that year: The couple's show, Tori & Dean: Home Sweet Hollywood, got canceled, and at the end of the year, McDermott cheated on Spelling.\n\n10 of 37 2014: Dean McDermott admits to cheating on Tori Spelling Amanda Edwards/Getty McDermott publicly admitted to cheating; when it happened, she was home with their four children, celebrating the holidays. In January, he checked himself into rehab to \"address some health and personal issues,\" he said in a statement to PEOPLE. The infidelity was addressed later in the year on the family's new reality show, True Tori. \"I feel shame. I've never felt shame before,\" he said of his transgressions. \"You were at a Christmas event, and I was f------ around. That's disgusting. That's disgusting.\" Later in the year, Spelling confirmed that the two were working through their issues. \"It's something that's going to take time to get through,\" she told PEOPLE.\n\n11 of 37 2015: Tori Spelling and Dean McDermott continue work on their marriage Randy Shropshire/Getty The couple continued to work on their marriage, and according to McDermott, things improved. \"What we went through publicly, I learned a lot, I wouldn't do it again, at the end of the day we're together, we're happy and we're working on our relationship and we have a beautiful family and a beautiful life,\" he said. \"It all worked out in the end.\" He also expressed a desire to take their relationship off television.\n\n12 of 37 April 2016: Dean McDermott proposes to Tori Spelling again Michael Simon/startraksphoto.com McDermott proposed to Spelling for the third time during a family trip to Europe that also included stops in Denmark and the French countryside. McDermott's first proposal was on Christmas Eve in 2005. He proposed again, a year later, after they were wed.\n\n13 of 37 October 2016: Tori Spelling and Dean McDermott announce fifth pregnancy Despite Spelling's complicated fourth pregnancy, the couple announced they were expecting their fifth child. \"The doctor said that considering everything that happened the last time, this is a miracle baby that Tori got pregnant and that it's okay,\" McDermott told PEOPLE.\n\n14 of 37 2016: Tori Spelling and Dean McDermott experience financial difficulties Michael Buckner/Getty The reality star and her husband were slapped with a tax lien by the state of California. The married couple owed a tax lien for $259,108.23 for unpaid state taxes from 2014, according to court documents obtained by PEOPLE in July. In March, Spelling cleared up reports of financial trouble after credit card company American Express sued her in January for failing to pay her outstanding balance of $37,981.97 since summer 2015. The mother of four explained that the rumors started after she wrote her 2013 book, Spelling It Like It Is. \"I thought I was being relatable, talking about how celebrities go through financial struggles, too, we make mistakes, too,\" she told PEOPLE. \"We're not perfect, we have made a lot of choices financially with real estate that didn't work out ... and that just escalated into this story about financial struggles, bankruptcy. To this day that haunts me!\" She added, \"We're not bankrupt, we're not struggling, we're fine!\"\n\n15 of 37 March 2, 2017: Tori Spelling and Dean McDermott welcome fifth baby Source: Tori Spelling Instagram Spelling gave birth to the couple's fifth child, son Beau Dean, on March 2, 2017. \"We are over the moon in love with baby Beau. He is a true blessing and his brothers and sisters were overjoyed to meet him! We are all truly grateful for our big beautiful and healthy family,\" Spelling told PEOPLE at the time.\n\n16 of 37 2017: Tori Spelling and Dean McDermott's relationship is \"rebuilt\" Three years after McDermott's cheating scandal, Spelling got candid about the new phase of the couple's relationship, which they reached following the birth of son Beau. \"I feel like Beau is really the pillar of the rebirth of our relationship because our relationship had to crumble for it to be rebuilt and it was really important that we just start it over,\" Spelling told PEOPLE in December.\n\n17 of 37 March 1, 2018: Police dispatched to Tori Spelling and Dean McDemott's home Gregg DeGuire/WireImage On March 1, police responded to a \"disturbance\" call at Spelling's Los Angeles home, PEOPLE confirmed. LAPD officer Rosario Herrera said police received a \"call for service\" at 7:17 a.m. to Spelling's Woodland Hills address. Officer Drake Madison told PEOPLE that the situation ended up being a \"domestic incident\" and that \"no crime\" was committed. He could not confirm who made the call. According to the audio dispatch call obtained by The Blast and TMZ, the issue involved a \"female\" with a possible \"mental illness.\" TMZ reported that Spelling called police because she thought there was someone breaking into her house, but it turned out to be her husband coming home. A source told PEOPLE that things had been tough on the Beverly Hills, 90210 alum. \"She internalizes a lot of her anxiety and she knows it's not healthy for her. Of course she's going to get to a breaking point eventually,\" the insider added. \"Tori and Dean have their ups and downs, but they love each other and family is most important to both of them.\"\n\n18 of 37 March 7, 2018: Dean McDermott calls the police to check in on his wife Charles Sykes/AP According to TMZ, McDermott called the cops to check up on his wife after she left their house on March 7. Three Ventura County Sheriff's units reportedly surrounded a building in Thousand Oaks, California, at around 9:45 a.m., while Spelling was inside. The outlet also has video of McDermott standing outside the office, holding the couple's then-1-year-old baby. TMZ reported that McDermott sounded the alarm when Spelling left home with at least one of their kids, though it remained unclear why he was so concerned about her wellbeing. Deputies reportedly located the Beverly Hills, 90210 alum at the doctor's office, spoke to her and determined she and their kids were okay. Because no crime had been committed, no further action was taken.\n\n19 of 37 May 7, 2020: Tori Spelling and Dean McDermott celebrate 14th anniversary Tori Spelling and Dean McDermott. Tori spelling/instagram The couple celebrated their 14th anniversary together by posting loving tributes to their respective Instagram accounts. Alongside a throwback photo, captured in 2006, Spelling began, \"I can't believe today is our 14 year anniversary! This pic of @imdeanmcdermott and I was taken just 6 months after we got married on May 7, 2006.\" \"I was preggers with our first babe Liam. Now, 14 years later we have 5 beautiful kiddos together,\" she continued. \"Liam, Stella, Hattie, Finn, and Beau are true creations of our love and passion for each other. Beautiful blends of the two of us. And, I have my bonus son Jack who I love & adore!\" The actress ended her tribute by thanking her husband. \"Thank you @imdeanmcdermott for being my chosen human in this lifetime. My partner in crime and my best friend,\" she wrote.\n\n20 of 37 May 7, 2020: Dean McDermott praises Tori Spelling on Instagram McDermott also showed his wife some love on their anniversary, posting a clip of the couple's 2008 \"In Love\" music video remix. \"We've been through a lot in 14 years and we're still going strong. Like the song says 'look how far we've come after all,' \" Dean captioned the post. \"Happy Anniversary Babe. 'I wouldn't wanna live without ya,' \"\n\n21 of 37 August 2020: Tori Spelling opens up about Dean McDermott's cheating Tori Spelling and Dean McDermott. Rodin Eckenroth/Getty Images Despite their loved-up posts towards the beginning of the year, in August, Spelling said on the Women on Top podcast that Dean's previous infidelity was causing issues again — because her daughter saw a clip about it online and it \"really upset her.\" Her children having access to the footage now was \"not something you think about in that moment,\" she admitted, but Spelling said she is \"so proud\" that her story \"lives online.\" She also gave insight into why she and McDermott decided to make it work, even after that difficult time: \"I make my own money. I can be a single mom, but I actually really love him and I want to work on this. If it doesn't work out, it doesn't work out, but we're going to try.\"\n\n22 of 37 June 17, 2021: Tori Spelling confirms her and Dean McDermott sleep in separate beds Tori Spelling and Dean McDermott. Gregg DeGuire/FilmMagic During an appearance on SiriusXM's Jeff Lewis Live, the host asked Spelling about \"speculation that there's problems at home.\" While she didn't confirm the speculation, exactly, she did agree that McDermott was sleeping in \"a room\" that was separate from hers. \"Right now my kids and dogs sleep in my bed,\" she said.\n\n23 of 37 December 2021: Dean McDermott absent from family holiday card When the star shared her holiday card on Instagram, McDermott was conspicuously absent from the photo and signature: \"Tori and family.\" In the comments, Spelling wrote that McDermott was missing from the photo because he was \"filming his new feature film in Canada\" when it was taken.\n\n24 of 37 January 1, 2022: Tori Spelling and Dean McDermott spend New Years apart McDermott was again noticeably absent from photos Spelling posted to ring in 2022. While Spelling was with her children in Lake Arrowhead, McDermott posted a video from home. \"I am sick as a dog,\" he said. \"I am not going to let that dampen my spirits. 2022 is going to be awesome. 2022, we're going to get through.\"\n\n25 of 37 July 2022: Dean McDermott appears in Tori Spelling's show Spelling and McDermott appeared together in an episode of her show @Home with Tori that aired in July 2022. \"You're so cute, babe,\" McDermott said as they family watched her 1989 film Troop Beverly Hills.\n\n26 of 37 June 17, 2023: Dean McDermott announces split from Tori Spelling Stefanie Keenan/Getty In a now-deleted Instagram post, McDermott announced that he and Spelling decided to separate after 18 years of marriage. \"It’s with great sadness and a very very heavy heart that after 18 years together and 5 amazing children, that @torispelling and I have decided to go our separate ways and start a new journey of our own,\" he wrote alongside a photograph of himself and Spelling, as well as an image of the now-former couple with their kids. McDermott continued: \"We will continue to work together as loving parents and guide and love our children through this difficult time.\"\n\n27 of 37 June 20, 2023: Source says Dean McDermott and Tori Spelling's split announcement was \"out of the blue\" According to a source, McDermott and Spelling's close friends were surprised to learn of the couple's separation. \"Their friends have seen their ups and downs through the years, but they really did seem to be in a good place in recent months,” an insider told PEOPLE. \"This feels really out of the blue. If this had happened a year ago, it would’ve been expected because things were terrible between them.\" A second source added: \"They were definitely trying in the last few months, and things felt way less toxic. They also made an effort to make holidays and milestones special and were much more in tune with each other.\"\n\n28 of 37 June 22, 2023: Source explains why Dean McDermott removed his post announcing his spit from Tori Spelling After McDermott removed an Instagram post that announced his split from Spelling, a source spoke to PEOPLE about the status of the pair's relationship. \"He took down the post because Tori didn’t want him to keep it up,\" the insider said. \"But he’s packing his bags and is 100 percent serious about it.\" The source added that McDermott hasn’t moved out from their family home due to financial reasons and has yet to find an apartment.\n\n29 of 37 July 17, 2023: Tori Spelling says she has \"always looked better on my own\" amid split from Dean McDermott While shopping in Los Angeles, TMZ caught up with Spelling. The outlet asked her if she felt \"blindsided\" by McDermott's divorce announcement, and she replied: \"I've always looked better on my own.\" Spelling was not wearing her wedding ring.\n\n\n\n30 of 37 October 10, 2023: Dean McDermott holds hands with new woman amid Tori Spelling split McDermott was photographed holding hands with Lily Calo, a senior account executive at Conscious Community Global. The pair were seen walking into the Department of Social Services in Los Angeles.\n\n31 of 37 October 31, 2023: Tori Spelling is spotted kissing a new man amid divorce from Dean McDermott On Halloween, Spelling was seen kissing Ryan Cramer — the CEO of Santa Monica-based agency Neuron Syndicate Inc. — outside of a nightclub in Los Angeles.\n\n32 of 37 November 15, 2023: Dean McDermott breaks silence about Tori Spelling split Rodin Eckenroth/FilmMagic; Andrew J Cunningham/Getty Images In an extensive interview with the Daily Mail, McDermott took full accountability for the deterioration of his marriage to Spelling. He explained to the outlet that his abuse of alcohol and prescription drugs led to their divorce. \"All Tori's ever done to this day is want me to be happy and healthy and I inflicted a lot of damage and pain on that woman,\" McDermott said. \"It's going to be living the rest of my life making amends because I took something that was really beautiful and I just tore it down year after year, day after day.\" Prior to their split, the dad of six, who was no longer sleeping next to Spelling, was \"drinking a fifth of tequila every night, seven days a week, and a handful of narcos [narcotics].\" McDermott shared, ”I finally surrendered to the fact that I need help. I wanted to die. I would wake up every morning going, ‘S---, I woke up again.’ And I’ve got six beautiful kids and a beautiful wife and I was pissed off that I woke up again.\"\n\n\n\n33 of 37 February 28, 2024: Dean McDermott and Tori Spelling are photographed for the first time following their split In photos obtained by Page Six, Spelling and McDermott were spotted cordially talking at a park in Agoura Hills, California. This marked the first time the exes had been seen publicly together following their separation.\n\n\n\n34 of 37 March 29, 2024: Tori Spelling files for divorce from Dean McDermott Spelling officially filed for divorce from McDermott and cited \"irreconcilable differences.\" She requested spousal support, as well as sole physical custody and joint legal custody of the pair's five children.\n\n35 of 37 March 31, 2024: Tori Spelling opens up about the \"red flags\" in her marriage to Dean McDermott In the debut episode of Spelling's podcast, misSPELLING, which was released just days after she filed for divorce, she opened up about the \"red flags\" she saw in their relationship, even early on. She said that they had been dating for four months when she first realized that \"his temper, which often was fueled by alcohol\" could become an issue. “So when he would drink, it was hard because I knew that at some point, it would turn,” she said. “And I knew, you know, it was always different. It could be 2 drinks, it could be 5, 6 drinks. And then I would just see it turn and I’m like, ‘Oh, here we go.’ And then that became my dance on the eggshells.” She added that things were \"never the same after we started having kids.\"\n\n36 of 37 October 9, 2024: Tori Spelling says Dean McDermott is \"one of my biggest supporters\" Tori Spelling and Dean McDermott. John Salangsang/Shutterstock; Paul Archuleta/FilmMagic During an interview with PEOPLE, Spelling shared that she and McDermott are \"really amicable\" exes. \"I know in Hollywood people think divorces have to be ugly, ours [is] not. We co-parent really well, we're good friends, and he's one of my biggest supporters,\" she said.", "images": ["https://people.com/thmb/gepNzv-u7OP2jTyu1bnefTObQEo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(671x0:673x2)/tori-dean-2007-73fd157453104354b8320c9b4f4f5593.jpg", "https://people.com/thmb/mFp-vUQah0GUmEjOYiaDnfSCI2M=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/tori-spelling-01-435-1-571f50c2e0334ec1862ee634116a8428.jpg", "https://people.com/thmb/5LEvwGJ3QdJs6p7yAD0CmEJPd3Y=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(713x290:715x292)/Tori-Spelling-01-061223-24d7e15012bd4a1fabf1bf6029f102dd.jpg", "https://people.com/thmb/6YMkmjVi3TmowFGegJCAptVBPY4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Amy-Schumer-Chris-Fischer-111325-68d54c198ba54698b5d309804bf32f3e.jpg", "https://people.com/thmb/xY9yDCX7ry2aMUiJv81bBeECIC8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/mcdermott-spelling-1-866b59b7eff1446b8e34775aa6c0ce74.jpg", "https://people.com/thmb/ooyQcRI8F_MddgAQSERkoFbMOc8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Miguel-and-Nazanin-Mandi-111325-1-4b5ea922b29641b9a151734194f508f1.jpg", "https://people.com/thmb/LztNjwaQ-ix4eK4edUooLhNiWi4=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/anna-kepner-3-111025-c6a90b2f57474459a89ae04e296ec343.jpg", "https://people.com/thmb/6rVCFhbjlbOB4fSdCvH9SCFOtRY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(700x268:702x270)/tori-spelling-dean-mcdermott-071823-1-65db9c1f009a4da6b2c275838d57a3e7.jpg", "https://people.com/thmb/SpW7t8hf88zAFMZuyz5p4baHzD8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/tori-spelling-holiday-card-20191209_22-6779a218cdbb48039d96664de4f6a651.jpg", "https://people.com/thmb/6BVgFQ30gWgD9XmkUm2j5s90DZk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/alex-rodriguez-Cynthia-Scurtis-Madonna-111325-33c2de3e05914ed987d94df4aced2d95.jpg", "https://people.com/thmb/wM6m62GAjlwYhZE1vEp6-L-7jMk=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/Dean-McDermott-tori-spelling-tout-111523-1aaf1d11b0654c008163f8f0a416f60a.jpg", "https://people.com/thmb/VGhPQwcXACzQiZihocXRhKEsZZE=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(728x0:730x2)/tori-dean-2005-9c6c83b6f75a4a34a9586f7ac224db54.jpg", "https://people.com/thmb/H-sQEPrjGGPPw28BS6UhBKqknBI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(299x0:301x2)/tori-dean-600x800-3bd197608a144ca4bcf623b6ec45870c.jpg", "https://people.com/thmb/NvNoUrK9ljC2RWc4SSTvcxjPtz4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/tori-dean-2008-2000-2a74638fc2a34ddfbb52915a74cd908b.jpg", "https://people.com/thmb/jcpmiasoEDHWUlt_VwOhiEiIBAw=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(691x0:693x2)/tori-dean-2014-2000-2e0fff45fb16474eb9e6bde6673afd00.jpg", "https://people.com/thmb/8xLilCS37kdOwbhE8HOa-1gKMfc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Shane-Gillis-Grace-Brassel-2025-ESPY-Awards-110725-tout-2cf00a6851874b039a21b3cf64e029b5.jpg", "https://people.com/thmb/xfLBrCi2PRPz-cyeb3JDwZAIOxM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/dylan-dreyer-today-show-family-110525-d470847cd4784b658ac9641d2b2b1125.jpg", "https://people.com/thmb/bPRr49iSek02jBass9S4e-yomVI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Drake-and-Serena-Williams-111925-1730587f36384e638ef89c0c54671fc3.jpg", "https://people.com/thmb/TJy7aPQjJJG4eeJoXbr56D_kTdw=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/tori-dean-2015-2000-97f4a19b3e7244d48c0a60f096081583.jpg", "https://people.com/thmb/eKOhiN4XTjPLCIScOX14g9vk0nQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(644x279:646x281)/Tori-Spelling-and-Dean-McDermott-8418dc310b0a46fbab062f1365be7a3a.jpg", "https://people.com/thmb/QJMKY3tZIl_WczkUQbJ-EhSInok=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/mcdermott-spelling-3-d80e7480780b408896d60a34ce86781b.jpg", "https://people.com/thmb/ITM3_E32OnZZeaH1olVDOzOySGg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(702x0:704x2)/tori-dean-2011-2000-1cada9a9f2c640749fb034e7ed042bcd.jpg", "https://people.com/thmb/RxCwyYFCFRjdOYvF-8yeCyEzxrU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/tori-spelling-dean-mcdermott-8e3925732b0348fbbfa0f5ed00d8b413.jpg", "https://people.com/thmb/BB7vYW82d0oBPiFINmr76DIy2dY=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/ben-dreyfuss-richard-dreyfuss-111925-b670f8ab6f994d1d9dfce1fa0726d205.jpg", "https://people.com/thmb/LPUebrwB-GyIlLH2U3AyIbMvAfM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/tori-spelling-435-107-3bc72be99df04a57a59a6efb27b7f910.jpg", "https://people.com/thmb/FKZuH_lCPcKpDNcsn8pN-nq46Ew=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/Angelina-Jolie-Billy-Bob-Thornton-111825-86b23fdf767748bf816a9e1be59a0075.jpg", "https://people.com/thmb/4SpiQicheebWsWB1qcS-CbDYzYE=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/khloe-kardashian-lamar-odom-111925-cd0c726941d7492f9b707b58943304a1.jpg", "https://people.com/thmb/DznEZqRI0IsG7E2RGPwuGk44ZqE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Dean-McDermott-tori-spelling-tout-111523-1aaf1d11b0654c008163f8f0a416f60a.jpg", "https://people.com/thmb/x93e4sU0UMSPvxAOcealWNkrH_U=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Eric-Mccormack-janet-holden-divorce-112223-1-c3b53e640c9247cbb8fcdb016e571f35.jpg", "https://people.com/thmb/P8bpqrL2rxTqK1UL8PJFBZloBtY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(824x0:826x2)/tori-dean-2009-2000-205d3fb03ca14b5fa3695965bdc05998.jpg", "https://people.com/thmb/F75N9T7HlADj_1dgpnHmSjtHY5Q=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/tori-dean-2010-552b209cf39a4933a5ae63d93970a7cd.jpg", "https://people.com/thmb/-wqAHoGkOeoF-hvk-7R4nqwyHwc=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(733x218:735x220)/tori-spelling-dean-mcdermott-101024-1-fb176562709c4c0db7c1ca806f08e2e9.jpg", "https://people.com/thmb/R3nNvCo-s5qS9Ap8ujE0SuaesX4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(660x0:662x2)/tori-dean-2012-2000-7bc7fdcd2b9d4f7aa470d7b0ce38a9bb.jpg", "https://people.com/thmb/AWIgLw6oCjvuGnuN6Z3n2PeyuEk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/brittany-cartwright-jax-taylor-042424-2-44111ab94387465fb3c3f9b56068c753.jpg", "https://people.com/thmb/pr-4kWVNy3_rwE5qt2RPAY5ognw=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/tori-dean-2013-2000-0b3b1a05032d4b59b58c3059d9c6cead.jpg", "https://people.com/thmb/Zb8TdlLsOwMIJ3YLlVbZWDfjBHk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Brittany-Snow-Tyler-Stanaland-110625-f03720b38192437e8cd120652959240f.jpg", "https://people.com/thmb/1y8biv50D_dBwRQRvhhst6ohpOU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/emma-chamberlain-parents-michael-sophia-8-b3317c0615a64b9abe29af60259abc07.jpg", "https://people.com/thmb/iPL6ygoplJm3OyBoODdKzwlPcI8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/khloe-kardashian-lamar-odom-111925-cd0c726941d7492f9b707b58943304a1.jpg", "https://people.com/thmb/E1QKIgh71ZfSBSS8dpOUBaoeHbM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/tori-spelling-435-97-7ba5f1d99f764b6fa2f8824295fa59b4.jpg", "https://people.com/thmb/Ez5QhPFKmYavQ6gWMsi_Xpg-4B4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/tori-spelling-2000-8dfa2170a8984ed3945ffdfd3c6d8018.jpg", "https://people.com/thmb/VM5gV5u7r4D-53x4Pqvu9t1WkHU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Nina-Dobrev-not-pretending-Tiktok-111425-tout-9bb898904aa846d98702bf022f30d105.jpg", "https://people.com/thmb/JzhgRLhyJFN-5GFZltmdcs0tCZQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/mcdermott-spelling-2-2edef9be14064f9c9a9e54f9607ee982.jpg", "https://people.com/thmb/4L2H7E7dtxfQTMSz8UuBDVVJyoE=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(768x0:770x2)/tori-dean-2006-2000-146aba43981c4359bf18e8219ae9696e.jpg", "https://people.com/thmb/ad8pDut1K0MaCL9CLidtag5TjDo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/tori-spelling-dean-mcdermott-071823-1-65db9c1f009a4da6b2c275838d57a3e7.jpg", "https://people.com/thmb/0jKnK8bSyr7Fb41sXsNwd1jtAFM=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/jenna-bush-hager-minka-kelly-today-with-jenna-and-friends-111925-7e3c2b8605fe4a96a1b712c168083adb.jpg", "https://people.com/thmb/zdFS1n2y9dNM-ndOtRjWY9G0kI4=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/Daniella-Karagach-111925-ls-1ffa54ba0f1749e380cfe98771660e16.jpg", "https://people.com/thmb/Pd2mGwyfhDikJkJtGi2uJhE1Nts=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Angelina-Jolie-Billy-Bob-Thornton-111825-86b23fdf767748bf816a9e1be59a0075.jpg"], "top_img": "https://people.com/thmb/xY9yDCX7ry2aMUiJv81bBeECIC8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/mcdermott-spelling-1-866b59b7eff1446b8e34775aa6c0ce74.jpg", "keywords": [], "authors": ["Diana Pearl", "Diana Pearl Is A Former Writer", "Reporter At People. She Left People In", "People Editorial Guidelines", "Julia Moore", "Benjamin Vanhoose", "Brianne Tracy", "Hannah Sacks", "Yamillah Hurtado", "Jp Mangalindan"], "canonical_link": "https://people.com/tv/tori-and-dean-10-years-5-kids-and-all-the-ups-and-downs-in-between/", "title": "Tori Spelling and Dean McDermott's Relationship Timeline", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Tori Spelling filed for divorce from Dean McDermott in March 2024. They share five children. Here is a complete timeline of their relationship.", "emailcontenttype": "LISTSC", "emailvertical": "PEOPLE", "sailthru.author": "Diana Pearl", "parsely-section": "Celebrity", "parsely-tags": "People.com,Celebrity,Celebrity Relationships,Person,Celebrity Breakups,Dean McDermott,Tori Spelling", "article": {"section": "People", "author": "https://www.facebook.com/peoplemag"}, "og": {"type": "article", "site_name": "People.com", "url": "https://people.com/tv/tori-and-dean-10-years-5-kids-and-all-the-ups-and-downs-in-between/", "title": "Tori Spelling and Dean McDermott's Relationship Timeline", "description": "Tori Spelling filed for divorce from Dean McDermott in March 2024. They share five children. Here is a complete timeline of their relationship.", "image": "https://people.com/thmb/xY9yDCX7ry2aMUiJv81bBeECIC8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/mcdermott-spelling-1-866b59b7eff1446b8e34775aa6c0ce74.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Tori Spelling and Dean McDermott's Relationship Timeline", "description": "Tori Spelling filed for divorce from Dean McDermott in March 2024. They share five children. Here is a complete timeline of their relationship.", "image": "https://people.com/thmb/xY9yDCX7ry2aMUiJv81bBeECIC8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/mcdermott-spelling-1-866b59b7eff1446b8e34775aa6c0ce74.jpg"}, "vf": {"url": "https://people.com/tv/tori-and-dean-10-years-5-kids-and-all-the-ups-and-downs-in-between/"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.146.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.146.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.146.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.146.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.146.0/icons/favicons/mstile-310x150.png", "fb": {"pages": 95926963131}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}