{"url": "https://people.com/celebrity/peoples-most-beautiful-a-look-back-at-the-covers/", "text": "As we celebrate Demi Moore as PEOPLE's Most Beautiful for 2025, look back at all the cover stars that came before her.\n\nLaunched in 1990, the franchise has featured some of Hollywood's top leading ladies — including inaugural cover star Michelle Pfeiffer , as well as Julia Roberts , Beyoncé , Kate Hudson and more — talking about the things that make their world beautiful — from marriage, to motherhood and even some tough life lessons.\n\nPEOPLE's World's Most Beautiful is a celebration of the stars who are redefining beauty, living life on their own terms and inspiring us all along the way.\n\n01 of 35 Michelle Pfeiffer, 1990 People Eleven PEOPLE editors decided to put out a list of the 50 Most Beautiful People in the World, taking submissions from readers, fellow staffers, casting directors and modeling agents. Pfeiffer, then 32, received the top honor, though PEOPLE editors wrote they learned three things from the process: \"That there is no such thing as perfect beauty. That people have blessedly different ideas about what's beautiful. And that most people are beautiful in some way, and that's about as beautiful as anybody really needs to be.\"\n\n02 of 35 Julia Roberts, 1991 People Editors called the 23-year-old \"a Botticelli beauty,\" and model maven Eileen Ford seconded that superlative. ''She is one of the few new great beauties,\" she said. \"She doesn't look like she's been dragged through the mud like a lot of them now do.''\n\n03 of 35 Jodie Foster, 1992 People The actress, then 29, was fresh from her second Oscar win for Silence of the Lambs when she appeared on PEOPLE's Most Beautiful issue. Sharing the honor were Mel Gibson, Elizabeth Taylor and Denzel Washington.\n\n04 of 35 Cindy Crawford, 1993 People Revlon model Crawford was a mere 27 — and married to Richard Gere — when she appeared on the cover. Her fellow cover models were Whitney Houston, Andrew Shue and Catherine Deneuve. Crawford split from Gere in 1995 and found her happily ever after in Rande Gerber, whom she married in 1988. The pair's two children — Presley and Kaia — who have followed in their mother's footsteps.\n\n05 of 35 Meg Ryan, 1994 People The actress, then 32, was still married to Dennis Quaid and promoting the film When a Man Loves a Woman when she made the cover of PEOPLE's 50 Most Beautiful issue. Daniel Day-Lewis, Toni Braxton and — whoa! — Joey Lawrence (then on Blossom) also appeared on the cover. Though Ryan split from Quaid in 2001, their son Jack has taken over the acting reins, starring in films The Boys, Novocaine, Companion and more.\n\n06 of 35 Courteney Cox, 1995 People She was only 30 (and four years into a romance with Michael Keaton) when her role as Monica Gellar on Friends landed the actress the cover (with Halle Berry and George Clooney).\n\n07 of 35 Mel Gibson, 1996 People The actor, then 40, had just earned his Oscar wins for Best Director and Best Picture for Braveheart when he appeared on the cover (alongside Michelle Pfeiffer, Brad Pitt and Brandy) for a second time.\n\n08 of 35 Tom Cruise, 1997 People Cruise was 34 — and still married to Nicole Kidman — when he graced PEOPLE's 50 Most Beautiful cover with Toni Braxton (her second appearance) and Drew Barrymore.\n\n09 of 35 Leonardo DiCaprio, 1998 People He was the king of the world at 23, starring in the mega-hit Titanic and on the cover of the Most Beautiful issue. Sharing the cover were Gwyneth Paltrow and Julia Louis-Dreyfus.\n\n10 of 35 Michelle Pfeiffer, 1999 People The actress was 41 when she graced PEOPLE's cover a second time. Sandra Bullock and Ben Affleck also shared it.\n\n11 of 35 Julia Roberts, 2000 People Fresh from three hit films — Notting Hill, Runaway Bride and Erin Brockovich — Roberts was only 32 when she appeared on the 2000 cover, alongside George Clooney and Faith Hill.\n\n12 of 35 Catherine Zeta-Jones, 2001 People The new mom to son Dylan, then 9 months old, was 31 and the star of Traffic when she landed the cover of PEOPLE's 50 Most Beautiful issue, alongside Katie Couric and Benicio Del Toro.\n\n13 of 35 Nicole Kidman, 2002 People One year after her divorce from Cruise, Kidman, then 34, had just won a Golden Globe Award (and scored an Oscar nod) for Moulin Rouge. Her fellow cover stars were Josh Hartnett and Jennifer Aniston.\n\n14 of 35 Halle Berry, 2003 People The actress, then 36, had just made history as the first-ever Black actress to win an Academy Award for Best Actress (for Monster's Ball) and was about to reprise her role as Storm in X2: X-Men United when she graced the cover. Also on the cover were Britney Spears and George Clooney (his third appearance!).\n\n15 of 35 Jennifer Aniston, 2004 People The actress talked with PEOPLE about the end of Friends — and her life with then-husband Brad Pitt. Sharing the cover with Aniston, then 35, were Beyoncé, Johnny Depp and Pitt.\n\n16 of 35 Julia Roberts, 2005 People The 37-year-old star's twins, Hazel and Phinnaeus, were just 5 months old when Roberts landed her next WMB cover, which declared her a \"Hot Mama!\"\n\n17 of 35 Angelina Jolie, 2006 People Jolie was 30 when she pulled double duty for the cover, which doubled in size from 50 to 100 Most Beautiful. Then pregnant with daughter Shiloh, the actress was named among the world's Most Beautiful, and she, with then-partner Brad Pitt and children Zahara and Maddox, were called the World's Most Beautiful Family.\n\n18 of 35 Drew Barrymore, 2007 People The newly single star — Barrymore had just split from longtime boyfriend Fabrizio Moretti — appeared on PEOPLE's Most Beautiful cover for the first time at age 32. In an unprecedented move, she posed without makeup for a photo shoot featured inside the issue. Also posing sans makeup: Jessica Biel, Rihanna and Jessica Alba.\n\n19 of 35 Kate Hudson, 2008 People Hudson's four-year-old son Ryder dominated the conversation when the actress was named Most Beautiful at age 29. Sharing cover space with her: Halle Berry and Patrick Dempsey.\n\n20 of 35 Christina Applegate, 2009 People With cancer behind her, Applegate, then 37, was radiant on her PEOPLE cover, shared with Jennifer Lopez, Robert Pattinson and Cindy Crawford, among others.\n\n21 of 35 Jennifer Lopez, 2011 People Lopez's cover reveal was extra-special: it happened during American Idol, which she was judging at the time. The mom of two, then 41, was joined by Mila Kunis and Ryan Reynolds on her issue.\n\n22 of 35 Beyoncé, 2012 People The singer arrived to her cover shoot in a helicopter — and obviously the glam didn't stop there. The new mom, 30, didn't share her cover space with any other beauties — but her issue did include an ode to the \"beauty of the photobomb,\" likely a first.\n\n23 of 35 Gwyneth Paltrow, 2013 People Paltrow's message on natural beauty (and staying fit) was a simple one. The mother of two, then 40 — and joined on the cover by fresh faces Jennifer Lawrence and Kerry Washington — also touched on the topics of motherhood and cooking with her late father.\n\n24 of 35 Lupita Nyong'o, 2014 People The inspiring Oscar winner — joined on the cover by Julia Roberts (again!), Jennifer Lawrence and Julianna Margulies — was a fun pick in part because of her amazing fashion sense. The then-31-year-old played dress-up in a bunch of gowns in a seriously glam video, and was filmed meeting her beauty icon, model Alek Wek.\n\n25 of 35 Sandra Bullock, 2015 \"That's ridiculous,\" was the 50-year-old's reaction to earning the title that year. \"What is beautiful is the honor of being Louis' mother,\" she added of parenting her then five-year-old son. \"Be a good person, be a good mom, do a good job with the lunch, let someone cut in front of you who looks like they're in a bigger hurry. The people I find most beautiful are the ones who aren't trying.\"\n\n26 of 35 Jennifer Aniston, 2016 Earning the title for a second time gave the 47-year-old actress \"this sort of very excited, teenage-y kind of moment,\" she told PEOPLE. Her interview touched on aging — \"It's funny, it's a really quick transition from not a care and now all of a sudden, we've got to really be mindful of what we put inside our bodies,\" she said.\n\n27 of 35 Julia Roberts, 2017 Covering the issue for a record fifth time (her 2010 cover was shared with Sandra Bullock's baby news), Roberts told PEOPLE she was \"flattered\" by the title and believed the best is yet to come: \"I think I'm currently peaking.\"\n\n28 of 35 Pink, 2018 Peggy Sirota In 2018, PEOPLE shifted the title from \"Most Beautiful\" to the \"Beautiful Issue\" — and Pink, 38, was the perfect person to usher in the new era. The mom of two talked about raising her children — Willow and Jameson — who joined her on the cover to be strong and how life with husband Carey Hart involves laughing a lot. \"[We] try not to take life too terribly seriously,\" she said. \"It's all about our family unit and time spent together, and much less about external stuff.\"\n\n29 of 35 Jennifer Garner, 2019 Growing up in West Virginia, 2019 cover star Garner, then 47, insisted her own style could initially be described as \"band geek-chic,\" she joked to PEOPLE. \"I was so not one of the pretty girls that I just bypassed insecurity and didn't see myself as attractive at all. It was not part of my life.\" Yet the actress was grateful to her family for keeping her so grounded. \"I felt good about myself back then! That is the lucky trick,\" she added. \"Looks weren't a big deal in my family. I don't think my parents ever said 'You're pretty' and so we just didn't think about it.\"\n\n30 of 35 Goldie Hawn, Kate Hudson & Rani Rose Fujikawa, 2020 Clockwise from top: Kate Hudson, Goldie Hawn and Rani Hudson Fujikawa cover PEOPLE. Coliena Rentmeester For the first time ever, three generations of women were featured on the cover. Goldie Hawn joined her daughter, second-time cover star Kate Hudson and her then-18-month-old, Rani Rose. \"My mom gave me the floor to be able to feel confident enough to go out and feel like my life could be my own,\" Kate told PEOPLE. \"Mom was my greatest cheerleader. And it just made me think about Rani…going, 'I hope I give her that kind of confidence,' you know?\"\n\n31 of 35 Chrissy Teigen, 2021 Mike Rosenthal In another family-focused moment, Teigen, 35, shared the 2021 cover with her kids Luna, 4, and Miles, 2 (plus, in a separate shot, her mom!). In her cover story, she touched on a range of topics, including her parenting philosophy with husband John Legend. \"I'm an open, free spirit and I love kids to be kids. For us, kindness is such a big thing. When you meet our kids, they're very warm and friendly,\" she told PEOPLE. \"You instill those things in them, but for the most part let them be creative and wondrous and spirited and curious beings.\"\n\n32 of 35 Helen Mirren, 2022 Andrew Eccles When Dame Helen Mirren learned she'd been chosen as the cover star of PEOPLE's 2022 Beautiful Issue, \"I was absolutely sort of gobstruck, as we say in England. I never considered myself 'beautiful.' And [at] my age! So I was amazed,\" the then 76-year-old Oscar winner said. It's not a false play at modesty, she made clear: \"Don't get me wrong — I love beauty and I love looking at beautiful things. But I don't like the word beauty [as it's] associated with the beauty industry—makeup and products, skincare and all the rest of it — because I think it excludes the vast majority of us who are not beautiful.\"\n\n33 of 35 Melissa McCarthy, 2023 Melissa McCarthy for PEOPLE. Ruven Afanador After Melissa McCarthy heard the news that she had been chosen to star on the cover of PEOPLE's 2023 Beautiful Issue, her first thought was, \"Did my mom and my dad have the two main votes?\" All joking aside, the Little Mermaid star, 52, admitted she was \"incredibly flattered\" over the honor. \"I thought the younger version of myself or everybody out there who isn't the youngest or whatever... I felt like it was saying something really lovely to my younger self, to my 20-year-old self,\" she told PEOPLE. \"And maybe to other people, too.\"", "images": ["https://people.com/thmb/rjwdUVSaIMTDMgmxZchxkki0L_o=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Sabrina-Carpenter-attends-the-67th-Annual-GRAMMY-Awards-022625-ad6b6464c42743febdce8268627d678e.jpg", "https://people.com/thmb/LztNjwaQ-ix4eK4edUooLhNiWi4=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/anna-kepner-3-111025-c6a90b2f57474459a89ae04e296ec343.jpg", "https://people.com/thmb/0m_Z0tUQn9mJb63177adhsR3iEQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/demi-moore-PEOPLE-t2-0894-14b312263bfd4f72a970404ca8fbc2ff.jpg", "https://people.com/thmb/z-a6ikAr22T76Ln5SY_44CzJDzA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Robby-Hoffman-and-Gabby-Windey-041825-dd489d467f2a466188f4ef70bc6f34d4.jpg", "https://people.com/thmb/-fDcQ-UpE-YHhPevUX3f3J0jHUI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(604x0:606x2)/julia-roberts7-e6506e34184c4e5a879b29200cbfc961.jpg", "https://people.com/thmb/xs-SK7c2I2lNLzAXcMzPKpC1A6c=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(149x0:151x2)/mel_gibson-15-a1b734d5089c439ba52ae81dcb285c53.jpg", "https://people.com/thmb/Eic9LxPbow9Nlc3o6NqGpc7h2F4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(149x0:151x2)/tom_cruise-108-7dd414d4d5de446cb86c2880de5773c7.jpg", "https://people.com/thmb/jWtuDKVLtJNt1PCB4O56gJ9WUnk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/SMA_COVER_JONATHAN_BAILEY_split-b37c0380f2c541c3b15d65885e713798.jpg", "https://people.com/thmb/hohWIvMQeVgbthED-9UQaNIofR4=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/Sophia-Vergara-People-Cover--67_25112019-b21af440a16845df87cc14dad1af56b0.jpg", "https://people.com/thmb/FrXcEB8L4Md5NyiSwdMBVLm8pAo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/WMB-PEOPLE_andie-macdowell-rainey-qualley-t2-1e6c54c9adfa4929bf866c95020bd4f1.jpg", "https://people.com/thmb/dhet3yXt-Br7frVby-2p_T3yn68=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(149x0:151x2)/catherine_zeta_jones-13-9a9dfe11909144d18a111fc088050d27.jpg", "https://people.com/thmb/TxdkUh0c67-DMAvGSeEGWq2_egA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/cover1-4c7e7f0890284a7fbf7d17c543277b64.jpg", "https://people.com/thmb/ERL9yRhBbRx8omlC51_s-oWziQA=/200x200/filters:no_upscale():max_bytes(150000):strip_icc()/HH44242035_Kathryn_Berger-c6d79e220b304acab27f7df141dd83e7.jpg", "https://people.com/thmb/QOLYc0frTHWO3OSYs8aQLNPNo2c=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/2014-lupita-nyongo-728a605825ad4f60b3feb7fc5f737529.jpg", "https://people.com/thmb/0w8UUwRP1GjKWLRq2K52YxyQ9Ls=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(149x0:151x2)/julia_roberts2-11-419e3cc46fa348608c74e8e0e0d88e6f.jpg", "https://people.com/thmb/LczYijxABommNQPyNGLlZwfGXes=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(149x0:151x2)/jodie_foster-4-416ed751d3b545edb405edf3a659394a.jpg", "https://people.com/thmb/yXw09ozdPpGqN3yYYD5vJE3tw_U=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/demi-moore-ghost-t-32da1ec6f606400e884a26c965df39be.jpg", "https://people.com/thmb/1qVaVsDoT5qN03FYz7vswgGGvrY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(561x0:563x2)/Helen-Mirren-Beauties-Cover-2-ab5b187ea88f4238b3d920450473c905.jpg", "https://people.com/thmb/N_bq__96CeLFBpsK6IXqvRf_ZoQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/WMB_PEOPLE_JENNIE_GARTH_FIONA_FACINELLI_0319-c12cbc8c290a4222972b6dfc5e2dae33.jpg", "https://people.com/thmb/PJR6xo4vT7ez4wCvq6oTj_-cBVA=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/PEOPLE-Demi_Moore-WMB-tout-7e4f39cc70eb4b849287e67fe077851c.jpg", "https://people.com/thmb/9NQ1nLzBqEdMpdNz9BxNKBxbEsg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(149x0:151x2)/angelina_jolie-178-a3a72d13e0a240b6a6bda8189f2850cc.jpg", "https://people.com/thmb/P5owLM7i26jDZDx_CFNJG9Rl8P4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/5-6-2019cover-2000-31b970c9803f4492bd74c6d07d130a7b.jpg", "https://people.com/thmb/IKA4biSi7dtA0ij5fQHDuTtfHtI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(313x0:315x2)/michelle-phieffer-2672165f2778411fac92da86bc1c1469.jpg", "https://people.com/thmb/NrAUhFyn8noF2Jbfws7TC_GX5p8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(149x0:151x2)/meg_ryan-5-fc717b37e3934188afa351c9e44dcd0a.jpg", "https://people.com/thmb/UfHqPtUIW1DNC5CN3V-8OZvevck=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/2009-christina-applegate-d94069fe743c461281bcc4022609846d.jpg", "https://people.com/thmb/Hf0gteXuRPFt09bm50OJjl4O3kE=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(149x0:151x2)/leonardo_dicaprio-52-8f2c1868c5e64dfa9922ee374edcad00.jpg", "https://people.com/thmb/t4UkBXJ2GVFv6WZgEUiLJtDShUk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/demi-moore-PEOPLE-t1-d0aacb91e51c489d8d103aab1cbcc889.jpg", "https://people.com/thmb/BB7vYW82d0oBPiFINmr76DIy2dY=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/ben-dreyfuss-richard-dreyfuss-111925-b670f8ab6f994d1d9dfce1fa0726d205.jpg", "https://people.com/thmb/_IXjDOZJyk9xgFhtJ5bkGcAq5ks=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(149x0:151x2)/michelle_pheiffer-cf6cfdf1e5a042ddb3a9e0ff85718116.jpg", "https://people.com/thmb/bQUl0rCZK0ZtCVgt4P5muWp3pY8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/4-12-2021-promo-main-2000-b30d4e23163640fdb0e2fdd43c057f1c.jpg", "https://people.com/thmb/V_4WowRt-JXTBoOvzwZTgKMNRmU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/julia-roberts5-2000-5b5eba5a213b4cbdb0459a7670c2559f.jpg", "https://people.com/thmb/BKzWB9XXQDwCHUMVsLwi7SwG-es=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/5-4-2020-promo-cover-bb4aeb1cd0574a6ea46fe0c341034f0f.jpg", "https://people.com/thmb/CG_fQnsZvG7UpR18v1R1ryhPWgM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/demi-moore-WMB-Charlotte-Triggs-b50c0f9151af47eaa2f8de7b701f2fd0.jpg", "https://people.com/thmb/Vj8tqKMmLLHBRg6hPA7MSkoCLYY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/People-Gabrielle_Union-Kaavia_Wade-tout-33cfbbb808e945118858745a9dd52084.jpg", "https://people.com/thmb/s0ryHm5CYQlUAOyiEjd_CE2S9HI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(753x285:755x287)/Michelle-Pfeiffer-49th-Annual-AFI-Life-Achievement-Award-2024-demi-moore-2025-EE-BAFTA-Film-Awards-lupita-nyongo-Buena-Vista-Social-Club-042125-2d659b8774554ffb98b36913badbd38a.jpg", "https://people.com/thmb/GmQTmPivudTaEYhMCOkQOPzNi08=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(149x0:151x2)/cindy_crawford-2-9a35d3c71e554c79883e0a96cae336ed.jpg", "https://people.com/thmb/ryZnEUOlupDc-CCm_BdNeiiztxw=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/MELISSA_MCCARTHY_PEOPLE_BEAUTIES-COVER-3eafe53fe763409a9208691d96e2d3da.jpg", "https://people.com/thmb/e6mT7x9NvoEY5hqLorf8siFsFHQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/SOFIA_VERGARA_promo-cover-1-ded20d7bc97843b797cbbd3ae51fc9a6.jpg", "https://people.com/thmb/Bbg6Skkhj8Xg26OVWUPQB_aTMrA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(149x0:151x2)/courteney_cox-46-9ec4d369fa8144b4ad3041721e784492.jpg", "https://people.com/thmb/tQCawHyMvvFpltxSAlFfahPSGSQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Sophia-Vergara-People-Cover--67_25112019-b21af440a16845df87cc14dad1af56b0.jpg", "https://people.com/thmb/g4D_gCz-2GaTz2xz7ZlZPKDwC3Y=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/demi-moore-people-cover-042225-17eba174701f4fde9559ee48fec03ebd.jpg", "https://people.com/thmb/Yxpqr598Rl2c7suLyRu-hVj61Ug=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(471x0:473x2)/julia-wmb-cover-9f5e21e58787496293d83210e8395704.jpg", "https://people.com/thmb/Orn5R1N5MZn51OPqUo9qFeGDaEk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/WMB_PEOPLE_JENNIE_GARTH_FIONA_FACINELLI_t2-15af6b6ba8714128b62795636e84e0a4.jpg", "https://people.com/thmb/_RpyBz8DnXbysI4mjZiUpxJoGv8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/PEOPLE-Demi_Moore-WMB-eb17cd27ad3945a9bcc0036cdad43c9a.jpg", "https://people.com/thmb/-LE0Ksrok8lH_TnBuJrGO8PeGmc=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/2011-jennifer-lopez-17af4922ba5945a9857caf91b12bf99f.jpg", "https://people.com/thmb/Q3ZOzyliUl8-BfdXNxrhjZUeMY0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/2008-kate-hudson-5bf0b5eee1cc4644a7eeaa8309588d83.jpg", "https://people.com/thmb/ons_UvMui-8hQqdtVXTIumTQcBg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(149x0:151x2)/drew_barrymore-95-038089785bf04c498915c710fde152ae.jpg", "https://people.com/thmb/-2iadMl9uz_apdf8L9F9p3WSx0Y=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/WMB-PEOPLE_andie-macdowell-rainey-qualley-0-421fde3b39dc490fb083b8c9ba5c2d26.jpg", "https://people.com/thmb/osIL_yUp_uA5Vvtgm21ZZ04-_Co=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(149x0:151x2)/halle_berry-158-6292f99cb52c4e2ea1f7bae7b4e93b42.jpg", "https://people.com/thmb/ltFaCkCxBETqus4tLgQP_oL1oe8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(561x0:563x2)/sandra-bullock-most-beautiful-ae02ad1bb8ab4c5989f07d4c3f77564a.jpg", "https://people.com/thmb/zpUokYwsCPJIEMG_lPZD79VEqWc=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(149x0:151x2)/jennifer_aniston-123-9f5665597219456ab9e6c4dc49e61ce1.jpg", "https://people.com/thmb/R8CAEgZSPk5EfzI5ACeutCZ2LjE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/demi-moore-ghost-t-32da1ec6f606400e884a26c965df39be.jpg", "https://people.com/thmb/wFz-wpZV9kmm5rcx9AuGVNX3tQQ=/600x0/filters:no_upscale():max_bytes(150000):strip_icc()/WMB-program-logo-586ecc5fb83c4baf925c129e2930feb5.png", "https://people.com/thmb/0jKnK8bSyr7Fb41sXsNwd1jtAFM=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/jenna-bush-hager-minka-kelly-today-with-jenna-and-friends-111925-7e3c2b8605fe4a96a1b712c168083adb.jpg", "https://people.com/thmb/soyFU2SfmZEqPGEYM5pW15We3RI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/People-Kelly-Ripa-Lola-WMB-tout-7cd400f15a4c49929902c880affa7658.jpg", "https://people.com/thmb/vA8UhImSWl36HcKQULZGX-BMsas=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/PEOPLE-Demi_Moore-WMB-tout-7e4f39cc70eb4b849287e67fe077851c.jpg", "https://people.com/thmb/zKabjiR0G724SzC2wk9jm1ovYwI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/2012-beyonce-ed80b500d39d4cb095d3f1c8a4f4ca85.jpg", "https://people.com/thmb/oVmWx9C60eZimDD0jDOjL8tjPq4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/2013-gwyneth-paltrow-7eda2f71ee9448dc8224721bf756adf5.jpg", "https://people.com/thmb/zdFS1n2y9dNM-ndOtRjWY9G0kI4=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/Daniella-Karagach-111925-ls-1ffa54ba0f1749e380cfe98771660e16.jpg", "https://people.com/thmb/bgY_TRKmZ3WyGk-Tbd6LTVpOHMc=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(149x0:151x2)/nicole_kidman-144-5f478f1855b44a2880ae597f2da2ea62.jpg", "https://people.com/thmb/8fl1NXWdemntwfrNULsM1AlwD_4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/jennifer-aniston-z-435-1-63d7a9ad12e64a8c8dcfbde5e552b10b.jpg"], "top_img": "https://people.com/thmb/s0ryHm5CYQlUAOyiEjd_CE2S9HI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(753x285:755x287)/Michelle-Pfeiffer-49th-Annual-AFI-Life-Achievement-Award-2024-demi-moore-2025-EE-BAFTA-Film-Awards-lupita-nyongo-Buena-Vista-Social-Club-042125-2d659b8774554ffb98b36913badbd38a.jpg", "keywords": [], "authors": ["Cara Lynn Shultz", "Cara Lynn Shultz Is A Writer-Reporter At People. Her Work Has Previously Appeared In", "People Editorial Guidelines", "Kate Hogan Was Director Of Digital Specials", "Features At People. She Started At People In", "Leaving In", "Catherine Santino", "Julie Jordan", "Nancy Mattia", "Lydia Price"], "canonical_link": "https://people.com/peoples-worlds-most-beautiful-look-back-at-the-covers-photos-11719073", "title": "See Every Celebrity PEOPLE Named the World's Most Beautiful — and Who Got the Honor in 2025", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "From a 29-year-old Jodie Foster and a baby-faced Leo to two-time covergirl Jen, see who's graced PEOPLE's World's Most Beautiful issues covers through the years.", "emailcontenttype": "LISTSC", "emailvertical": "PEOPLE", "sailthru.author": "Cara Lynn Shultz", "sailthru.tags": "from-the-magazine,worlds-most-beautiful", "parsely-section": "From the Magazine", "parsely-tags": "People.com,From the Magazine,World's Most Beautiful", "article": {"section": "People", "author": "https://www.facebook.com/peoplemag"}, "og": {"type": "article", "site_name": "People.com", "url": "https://people.com/peoples-worlds-most-beautiful-look-back-at-the-covers-photos-11719073", "title": "See Every Celebrity PEOPLE Named the World's Most Beautiful — and Who Got the Honor in 2025", "description": "From a 29-year-old Jodie Foster and a baby-faced Leo to two-time covergirl Jen, see who's graced PEOPLE's World's Most Beautiful issues covers through the years.", "image": "https://people.com/thmb/s0ryHm5CYQlUAOyiEjd_CE2S9HI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(753x285:755x287)/Michelle-Pfeiffer-49th-Annual-AFI-Life-Achievement-Award-2024-demi-moore-2025-EE-BAFTA-Film-Awards-lupita-nyongo-Buena-Vista-Social-Club-042125-2d659b8774554ffb98b36913badbd38a.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "See Every Celebrity PEOPLE Named the World's Most Beautiful — and Who Got the Honor in 2025", "description": "From a 29-year-old Jodie Foster and a baby-faced Leo to two-time covergirl Jen, see who's graced PEOPLE's World's Most Beautiful issues covers through the years.", "image": "https://people.com/thmb/s0ryHm5CYQlUAOyiEjd_CE2S9HI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(753x285:755x287)/Michelle-Pfeiffer-49th-Annual-AFI-Life-Achievement-Award-2024-demi-moore-2025-EE-BAFTA-Film-Awards-lupita-nyongo-Buena-Vista-Social-Club-042125-2d659b8774554ffb98b36913badbd38a.jpg"}, "vf": {"url": "https://people.com/peoples-worlds-most-beautiful-look-back-at-the-covers-photos-11719073"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.146.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.146.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.146.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.146.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.146.0/icons/favicons/mstile-310x150.png", "fb": {"pages": 95926963131}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}