{"url": "https://popculture.com/celebrity-couples/2018/05/27/kim-kardashian-defending-kanye-west/", "text": "Kim Kardashian never backs down from standing up for her man.\n\nThe Keeping Up with the Kardashians star regularly steps up to the plate to defend husband Kanye West, whether it be most recently over the Chicago non-profit he helped to found, his controversial opinions and political ideas, or even in his ongoing drama with Taylor Swift.\n\nVideos by PopCulture.com\n\nWest may have remained silent about many of these scandals, but he always has a fierce defender in his wife. Keep scrolling to see how Kardashian has addressed West’s critics at every turn.\n\nRhymefest\n\nOn May 26, Kardashian went to bat for her husband on Twitter after rapper Rhymefest criticized West after the rapper’s Donda’s House organization took to social media to say that West had not given the organization the financial support promised, “despite multiple attempts.”\n\nThe reality star wrote, “U haven’t been right since u got kicked out of the studio in Hawaii wearing fake Yeezy’s @RHYMEFEST. You’re over levergenging [sic] Kanye’s name & asked Kanye to donate money to u so stop w your fake community politics & lies. Truth is you haven’t been able to sustain the foundation.”\n\nThe Keeping Up With the Kardashians star added, “I saw you at our studio a few weeks ago so why didn’t you bring this up then @RHYMEFEST ? You were trying to get Kanye to listen to your sub par beats. You have the audacity to use Kanye’s mom name to try to shead a negative light on Kanye [sic].”\n\nU haven’t been right since u got kicked out of the studio in Hawaii wearing fake Yeezy’s @RHYMEFEST ? You’re over levergenging Kanye’s name & asked Kanye to donate money to u so stop w your fake community politics & lies. Truth is you haven’t been able to sustain the foundation — Kim Kardashian West (@KimKardashian) May 26, 2018\n\nShe added, “You better believe I will make it my mission to take Donda’s House from you and let my children run it the way it should be run! @RHYMEFEST.”\n\nYou better believe I will make it my mission to take Donda’s House from you and let my children run it the way it should be run! @RHYMEFEST — Kim Kardashian West (@KimKardashian) May 26, 2018\n\nThe 37-year-old ended her rant with, “Sorry to all of my followers for flooding my timeline I know you have no idea who Rhymefest is.”\n\n“Mental Health is No Joke”\n\nKardashian also stood up for her husband in April, when his social media behavior caused many media outlets to question his “erratic” behavior.\n\nAt the time, she tweeted, “Mental Health is no joke and the media needs to stop spitting that out so casually. Bottom line.”\n\nMental Health is no joke and the media needs to stop spitting that out so casually. Bottom line — Kim Kardashian West (@KimKardashian) April 25, 2018\n\n“Kanye is years ahead of his time”\n\nIn the same tweetstorm, Kardashian stood up for his husband, who was slammed for his controversial statements such as saying that slavery was a “choice.”\n\n“Kanye will never run in the race of popular opinion and we know that and that’s why I love him and respect him and in a few years when someone else says the same exact thing but they aren’t labeled the way he is and you will all praise them! Kanye is years ahead of his time,” Kardashian wrote.\n\nKanye will never run in the race of popular opinion and we know that and that’s why I love him and respect him and in a few years when someone else says the same exact thing but they aren’t labeled the way he is and you will all praise them! Kanye is years ahead of his time — Kim Kardashian West (@KimKardashian) April 25, 2018\n\n“So quick to label him”\n\nShe also stood up against people trying to suggest that his social media behavior was the start of another public mental breakdown.\n\n“To the media trying to demonize my husband let me just say this… your commentary on Kanye being erratic & his tweets being disturbing is actually scary. So quick to label him as having mental health issues for just being himself when he has always been expressive is not fair,” she wrote.\n\nTo the media trying to demonize my husband let me just say this… your commentary on Kanye being erratic & his tweets being disturbing is actually scary. So quick to label him as having mental health issues for just being himself when he has always been expressive is not fair — Kim Kardashian West (@KimKardashian) April 25, 2018\n\n“He’s a free thinker”\n\nEven after West implied that he was in the Sunken Place, a reference to the movie Get Out, while in their home, Kardashian stood up for his ability to express himself.\n\n“He’s a free thinker, is that not allowed in America? Because some of his ideas differ from yours you have to throw in the mental health card? That’s just not fair. He’s actually out of the sunken place when he’s being himself which is very expressive,” she wrote.\n\nHe’s a free thinker, is that not allowed in America? Because some of his ideas differ from yours you have to throw in the mental health card? That’s just not fair. He’s actually out of the sunken place when he’s being himself which is very expressive — Kim Kardashian West (@KimKardashian) April 25, 2018\n\n“This is HIS opinion”\n\nWest also drew anger from fans after publicly supporting President Donald Trump, saying the two shared the same “dragon energy.” Kardashian did distance herself from his political affiliation, but also defended her husband’s right to have his own opinion.\n\n“Now when he spoke out about Trump… Most people (including myself) have very different feelings & opinions about this. But this is HIS opinion. I believe in people being able to have their own opinions, even if really different from mine. He never said he agrees with his politics,” she wrote on Twitter.\n\nNow when he spoke out about Trump… Most people (including myself) have very different feelings & opinions about this. But this is HIS opinion. I believe in people being able to have their own opinions,even if really different from mine\n\nHe never said he agrees with his politics — Kim Kardashian West (@KimKardashian) April 25, 2018\n\n“All of the exciting things happening”\n\nKardashian also justified her husband’s business decisions a day after he announced he had fired his manager. Many took this as a sign that he was deteriorating mentally.\n\n“Yesterday it was announced that Kanye had parted ways with some business people and media outlets made this about Kanye’s mental health. Rather than just a simple business decision. So I’m glad he tweeted about the state of his company and all of the exciting things happening,” she wrote.\n\nYesterday it was announced that Kanye had parted ways with some business people and media outlets made this about Kanye’s mental health. Rather than just a simple business decision. So I’m glad he tweeted about the state of his company and all of the exciting things happening — Kim Kardashian West (@KimKardashian) April 25, 2018\n\n“Season 6 was genius”\n\nIn March 2018, after West’s fashion line Yeezy got criticized for its look, Kardashian tweeted, “Season 6 was genius. All of my Japan looks are season 7 & will be online soon. Yeezy does not play by fashion rules. The show room was strictly shoes & always intended for that.”\n\nSeason 6 was genius. All of my Japan looks are season 7 & will be online soon. Yeezy does not play by fashion rules. The show room was strictly shoes & always intended for that. https://t.co/xkaYC98G7u — Kim Kardashian West (@KimKardashian) March 6, 2018\n\n“You do not work for Yeezy”\n\nAlso in March, after posts made by unaffiliated Twitter handle @theyeezymafia spread incorrect information about the brand, Kardashian tweeted, “How can a verified account represent Yeezy with false information. You do NOT work for Yeezy and NOT affiliated. How are you gonna believe an account that posts fake color ways.”\n\nHow can a verified account represent Yeezy with false information. You do NOT work for Yeezy and NOT affiliated. How are you gonna believe an account that posts fake color ways ??? https://t.co/xkaYC98G7u — Kim Kardashian West (@KimKardashian) March 6, 2018\n\nTaylor Swift\n\nDuring the couple’s ongoing feud with Taylor Swift, during which in 2016 she denied knowing that West was going to rap the line, “I made that b— famous” about her, Kardashian posted a video on Snapchat of West and Swift discussing the “Famous” lyrics. After the world lost its mind about the petty move, the “Bad Blood” singer basically went underground for a year.\n\nTaylor Swift\n\nIn June 2016, prior to unleashing the receipts, Kardashian told GQ in her cover story that Swift in fact did know about the lyrics regarding her. “She totally approved that,” said the reality star. “She totally knew that that was coming out. She wanted to all of a sudden act like she didn’t. I swear, my husband gets so much s— for things [when] he really was doing proper protocol and even called to get it approved.”\n\nOf calling the singer a “b—,” Kardashian also defended her man and the use of the word: “I mean, he’s called me a b— in his songs. That’s just, like, what they say. I never once think, ‘What a derogatory word! How dare he?’ Not in a million years.”\n\nPhoto credit: Twitter/@kimkardashian", "images": ["https://popculture.com/wp-content/uploads/sites/5/2025/11/molly-dangerously-obese.png?w=300", "https://sb.scorecardresearch.com/p?c1=2&c2=8568956&cj=1", "https://popculture.com/wp-content/uploads/sites/5/2024/09/509733a3-2776-41c2-ae2f-87bd457740ba.jpg?w=300", "https://popculture.com/wp-content/uploads/sites/5/2025/05/robert-irwin.jpg?w=300", "https://popculture.com/wp-content/uploads/sites/5/2021/03/14024377-87b5-44da-926d-abcee03cd657.png?w=640", "https://popculture.com/wp-content/themes/popculture-2024/assets/images/popculture-logo-white.png", "https://popculture.com/wp-content/uploads/sites/5/2024/04/1c80a318-ac01-429c-ae50-dcd1a2e17f40.jpg?w=300", "https://popculture.com/wp-content/uploads/sites/5/2025/10/boston-blue-faith-and-family-sonequa-martin-green-donnie-wahlberg-cbs.jpg?w=300", "https://popculture.com/wp-content/uploads/sites/5/2024/10/PopCulture-logo_1f401e.png", "https://popculture.com/wp-content/uploads/sites/5/2024/10/14024377-87b5-44da-926d-abcee03cd657.png?w=640", "https://popculture.com/wp-content/uploads/sites/5/2022/04/45511bc5-8791-4d0b-a2e9-34e9c9011b24.png?w=300", "https://popculture.com/wp-content/uploads/sites/5/2025/11/cma-awards-getty.jpg?w=300", "https://pixel.quantserve.com/pixel/p-RxPFZR-mKeJrq.gif", "https://popculture.com/wp-content/uploads/sites/5/2024/07/70afec6a-3143-4947-b047-428e525611d4.jpg?w=300"], "top_img": "https://popculture.com/wp-content/uploads/sites/5/2021/03/14024377-87b5-44da-926d-abcee03cd657.png?w=640", "keywords": [], "authors": ["Anna Rumer", ".Wp-Block-Savage-Platform-Post-Byline Font-Family Var --Wp--Custom--Typography--Font-Family--Secondary", "Font-Size Var --Wp--Custom--Typography--Font-Size--Sm", "Font-Weight Var --Wp--Custom--Typography--Font-Weight--Bold", "Line-Height Var --Wp--Custom--Typography--Line-Height--Xxs", ".Wp-Block-Savage-Platform-Post-Byline A Font-Weight Var --Wp--Custom--Typography--Font-Weight--Black", "Text-Decoration None", ".Wp-Block-Savage-Platform-Post-Byline Font-Family Var --Wp--Custom--Typography--Font-Family--Primary", "Font-Size Var --Wp--Custom--Typography--Font-Size--Tiny", "Media Min-Width"], "canonical_link": "https://popculture.com/celebrity-couples/news/kim-kardashian-defending-kanye-west/", "title": "12 Times Kim Kardashian Has Publicly Defended Kanye West", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "12 Times Kim Kardashian Has Publicly Defended Kanye West", "description": "Kim Kardashian never backs down from standing up for her man. The Keeping Up with the Kardashians star regularly steps up to the plate to defend husband Kanye West, whether it be most recently over the Chicago non-profit he helped to found, his controversial opinions and political ideas, or even in his ongoing drama with […]", "url": "https://popculture.com/celebrity-couples/news/kim-kardashian-defending-kanye-west/", "site_name": "PopCulture.com", "image": {"identifier": "https://popculture.com/wp-content/uploads/sites/5/2021/03/14024377-87b5-44da-926d-abcee03cd657.png?w=640", "width": 640, "height": 320, "type": "image/png"}}, "article": {"published_time": "2018-05-28T00:40:00+00:00", "modified_time": "2024-10-07T13:40:00+00:00"}, "author": "Anna Rumer", "twitter": {"card": "summary_large_image", "label1": "Written by", "data1": "Anna Rumer", "label2": "Est. reading time", "data2": "6 minutes"}, "generator": "WordPress 6.8.3", "msapplication-TileImage": "https://popculture.com/wp-content/uploads/sites/5/2024/10/cropped-PopCulture-icon_a9e4e3.png?w=270"}, "movies": [], "publish_date": 1527393600.0, "source": "https://popculture.com", "summary": ""}