{"url": "https://www.thewrap.com/the-keepers-what-has-happened-since-the-netflix-series-debuted/", "text": "Netflix’s “The Keepers” debuted two months ago, and since then, filmmaker Ryan White has seen positive developments in the case: More victims have spoken out and police are investigating further into Father Joseph Maskell’s past life.\n\n“I am seeing that ‘The Keepers’ is having a positive impact, not just in the sense that more victims have come forward but it is also having a positive impact in showing people that they aren’t alone and that it’s possible to move forward and confront your painful past,” White told TheWrap during a recent interview.\n\nWhite said that many new victims have come out of the woodwork since the series was released: “A lot of people watched the series and realized that they weren’t the only ones and now have the courage to talk about it. Hopefully, it will lead to a lot of healing.”\n\nThere has also been a lot of movement in terms of investigating Maskell. “The Keepers” explores the murder of Sister Catherine Cesnik, who disappeared in November 1969 and whose body was discovered in January of 1970. The documentary investigates whether Maskell had Sister Cathy killed because she was about to expose him and others for sexual abusing teenage students at Archbishop Keough High School. Maskell died in 2001, and until his death, he had denied the allegations.\n\nAccording to CNN, Father Maskell’s body was exhumed in February to see whether his DNA matched the DNA from the murder scene. Two days before “The Keepers” was released, Baltimore County Police found that the DNA profile did not match.\n\n“No one’s prevailing theory was that his DNA would be there,” White added, referring to many people’s idea that Maskell ordered the murder but himself did not orchestrate it. “It’s a huge outward sign that they are taking Maskell seriously as a suspect now, and it definitely begs the question why these tests weren’t done when he was alive and Jean Wehner [Jane Doe] was coming forward. He could’ve been arrested.”\n\nAccording to White, the documentary prompted a lot of digging into Maskell’s past, specifically when he relocated to Ireland. According to the Baltimore Sun, Maskell worked as a psychologist amid his sexual abuse allegations in the United States. Whether he assessed any children or teens during his time in Ireland could not yet be determined by the agency doing the review.\n\n“We were only concentrating in our documentary for the most part on certain parts of Maskell’s character but he had a long career before and after his time at Keough,” White said. “A predator doesn’t stop abusing so it’s been a sad truth that people from other sides of his career — and from Keough — have come out of the woodwork.”\n\nMoreover, a few days after the documentary was released, the Baltimore Police Department launched an online form for people to report sexual offenses related to the docuseries.\n\n“We have been contacted by victims from the past who want to report the sex offenses that occurred to them,” the department wrote on its Facebook page.\n\nIn July, a Change.org petition was launched and has since garnered over 42,000 signatures asking the Archdiocese of Baltimore to release information they have on Maskell. White told TheWrap he had asked for these documents during the making of the documentary, and is “dubious” whether they would even release them now.\n\nLastly, a few weeks before the series came out, Maryland extended the statute of limitations for victims of childhood sexual abuse, on which the senate voted unanimously. The previous statute of limitations provided that child sex abuse victims could only sue until age 25 — now, they can sue until the age of 38.\n\n“It might be people doing the right thing for the wrong reasons but it’s good news for sexual abuse victims,” White added.\n\nHowever, the major developments in the case since the documentary’s debut won’t change White’s mind about making a second season. Previously, he had said he wouldn’t want to make a follow-up season given how “painful” the process was for all the people involved.\n\n“I’m still standing behind that, but I’m not going to say never,” White said about a second season. “There is a lot of information coming to us right now and there could be certain developments that I would document. But, at the moment, I’m not dead set on that. I’m still preoccupied with promoting the series and to make sure it has the largest impact that it can have. I’m still very happy where it ended. The series will end up shaking the branches in Baltimore and nationwide to have more information coming out that could lead to justice and murder being solved.”", "images": ["https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/07/Beatrice-Verhoeven.png?resize=150%2C150&quality=80&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2025/08/5x4_082025_COVER_B.png?fit=240%2C300&quality=80&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2017/05/TheKeepers.jpg?fit=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/07/Beatrice-Verhoeven.png?fit=53%2C58&quality=80&ssl=1"], "top_img": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2017/05/TheKeepers.jpg?fit=618%2C412&quality=89&ssl=1", "keywords": [], "authors": ["Beatrice Verhoeven", "Film Editor", "Twitter", ".Wp-Block-Post-Author Box-Sizing Border-Box Display Flex Flex-Wrap Wrap .Wp-Block-Post-Author__Byline Font-Size Margin-Bottom Margin-Top Width", ".Wp-Block-Post-Author__Avatar Margin-Right .Wp-Block-Post-Author__Bio Font-Size Margin-Bottom .Wp-Block-Post-Author__Content Flex-Basis Flex-Grow .Wp-Block-Post-Author__Name Margin", ".Wp-Block-The-Wrap-Author-Bios__Entry Align-Items Center Display Flex Flex-Wrap Wrap Gap .Wp-Block-The-Wrap-Author-Bios__Entry .Wp-Block-The-Wrap-Author-Bios__Entry Margin-Top .Wp-Block-The-Wrap-Author-Bios__Entry-Excerpt Flex-Basis", ".Wp-Block-The-Wrap-Author-Bios Border-Top Solid", "Margin-Block Padding-Top .Wp-Block-The-Wrap-Author-Bios__Entry-Avatar Display Var --Display-No-Mobile", "Block", "Margin-Bottom .Wp-Block-The-Wrap-Author-Bios__Entry-Avatar Img Border Solid"], "canonical_link": "https://www.thewrap.com/the-keepers-what-has-happened-since-the-netflix-series-debuted/", "title": "‘The Keepers’: Here’s What Has Happened Since the Netflix Series Debuted", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "'The Keepers': Here's What Has Happened Since the Netflix Series Debuted", "description": "Docuseries prompts further investigation into Father Joseph Maskell's past, more victims speak out", "url": "https://www.thewrap.com/the-keepers-what-has-happened-since-the-netflix-series-debuted/", "site_name": "TheWrap", "image": {"identifier": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2017/05/TheKeepers.jpg?fit=618%2C412&quality=89&ssl=1", "width": 618, "height": 412, "type": "image/jpeg"}}, "article": {"author": "https://www.facebook.com/thewrap/", "published_time": "2017-07-24T22:26:55+00:00"}, "author": "Beatrice Verhoeven", "twitter": {"card": "summary_large_image", "creator": "@thewrap", "label1": "Written by", "data1": "Beatrice Verhoeven", "label2": "Est. reading time", "data2": "4 minutes"}, "generator": "WordPress 6.8", "article-tags": "baltimore, catherine-cesnik, facebook, ireland, jean-wehner, maskell, ryan-white, the-keepers, united_states", "article-section": "tv", "article-categories": "news, tv", "msapplication-TileImage": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2024/05/the_wrap_symbol_black_bkg.png?fit=270%2C270&quality=80&ssl=1"}, "movies": [], "publish_date": 1500935215.0, "source": "https://www.thewrap.com", "summary": ""}