{"url": "https://web.archive.org/web/20150212022316/http://www.laweekly.com:80/news/10-chilling-new-things-about-charles-manson-detailed-in-his-new-biography-4175174", "text": "Jeff Guinn's new book posits Charles Manson as a con man who preyed on young women using the tricks he learned as a pimp and by reading Dale Carnegie.\n\nThere's a new biography of Charles Manson out this month -- which seems like the last thing America needs, in light of the reams of print that have already been devoted to the wannabe pop star who led his \"family\" to commit nine murders in the summer of 1969, terrifying Los Angeles.\n\nAnd yet Manson: The Life of Times and Charles Manson by Jeff Guinn is riveting, a thoroughly researched biography that manages to be a breezy page-turner. Even those who've already read extensively about the Manson murders and their aftermath may find new insight into the pint-sized West Virginia-born con man who convinced a bevy of middle-class young women (and a few men) to murder for him.\n\nAmong the revelations? Manson studied Scientology. Yep, L.A.'s favorite \"religion\" also influenced its most notorious mass murderer -- in prison, \"Charlie adopted those aspects of [L. Ron] Hubbard's teachings that lent themselves to manipulating others,\" Guinn reports. \"His September 1961 report [by prison officials] noted, 'He appears to have developed a certain amount of insight into his problems through the study of [Scientology]. Manson is making progress for the first time in his life.'\"\n\nBut Hubbard isn't responsible for Manson turning into Manson. Turn the page to find out 10 chilling new things we learned from Guinn's biography -- including the unlikely book the author credits for transforming Manson into a guru who fooled dozens of kids into following him straight into \"Helter Skelter.\"\n\n10. Manson learned his most effective techniques by studying Dale Carnegie. Carnegie, a salesman, had published How to Win Friends and Influence People in 1936, sharing his techniques for convincing others to do what you want. Good information for a salesman, yes, but supremely helpful for a con man.\n\nAfter stealing a car in Ohio and driving it to L.A., where his mother was living, Manson was sent to prison in San Pedro -- and there he enrolled in a Carnegie course. It changed his life.\n\n\"Charlie had always evinced limited reading skills, but in this Carnegie class he proved that he could not only read but fully comprehend printed material if he was sufficiently engaged, and if instructors were helpful enough,\" Guinn writes. \"Virtually every word in the Carnegie publications resonated with Charlie. For the first time in his life he was considered an outstanding pupil.\" How to Win Friends, Guinn reports, \"seemed to formally codify all the ways Charlie had manipulated people since childhood.\" Acquaintances would later recall Manson using just those techniques on the young women in his \"family.\"\n\n9. In Manson's previous life, he was a square. Manson is associated strongly with '60s counterculture -- after all, he found his calling on Haight-Ashbury, painted himself as a guru to the young women he recruited, and kept them tripping on acid and sexually pliant (free love, don't you know?). But as a young man in the '50s, Manson loved Frank Sinatra and, yes, Perry Como. He married a nice girl named Rosalie at 19 and had a baby soon thereafter. And he might have made it work, had Rosalie not left him during his time in prison in San Pedro. He got out in 1967 and, with nowhere to go and only a vague dream of being a pop star, convinced his parole officer he should move to San Francisco. That's where he realized the time's changing morals (and hordes of lost kids) could work for him, and the rest is history.\n\n8. Manson was so controlling, he banned the women who followed him from wearing eyeglasses. In the Haight and by trolling around Los Angeles, Manson picked up a half-dozen women who, over time, became the core of the Manson \"family.\" Nice girls from middle-class homes, these women fell for Manson's manipulation -- using Carnegie's techniques and his own sociopathy, he expertly exploited their daddy issues.\n\nBy the time he moved his small commune to Spahn Ranch, an old movie set used to shoot Westerns near Simi Valley, he'd banned books, wristwatches, calendars and clocks. \"Eyeglasses weren't allowed either,\" Guinn writes. \"Charlie explained that whatever the state of their vision, that was their natural way to see the world, and only natural things were good. New members were relieved of their glasses immediately; some of them developed permanent squints.\"\n\nTurn the page for more chilling facts, including which Hollywood star's boyfriend cheated on her with the Manson girls.\n\nCandice Bergen, 1967\n\n7. Candice Bergen's boyfriend cheated on her -- repeatedly -- with the Manson girls. Manson used the women who followed him to gain favor with men he needed something from -- first he broke down their sexual inhibitions by sleeping with them; then he shared them with men of his choosing. Once he settled in L.A., it was only natural that there would be connections to Hollywood. One early recruit? Didi Lansbury, daughter of Angela.\n\nAnd among the men who regularly partook of the women in Manson's stable were both Dennis Wilson of The Beach Boys and Terry Melcher, who was the son of Doris Day, a record producer with great success in his own right, and, yes, ostensibly in a committed relationship with Bergen, herself a successful actress.\n\nLater, Melcher would lie to investigators about his interaction with the Manson girls. Asked whether he'd had sex with the girls, he'd shown them a picture of Bergen: \"When I've got beauties like these to get in bed with,\" he asked, \"why would I want to screw any of Manson's clap-ridden, unwashed dogs?\" Ah, but he did. And it was Melcher's interactions with Manson in part that led Manson's gang to Sharon Tate's home that deadly night in August 1969.\n\n6. Manson and his family escaped notice because their hangout at Spahn Ranch fell between the jurisdiction of various law enforcement agencies. Local authorities knew there were 100 or so hippies living at Spahn Ranch -- and they knew drug use and car thievery were probably rampant. But they put aside their suspicions for an all-too-predictable reason: \"Spahn Ranch was along the Los Angeles–Ventura county line and there was some question about jurisdiction,\" Guinn reports. \"Neither county police department really wanted to take responsibility for law enforcement in the area, so nobody kept an eye on what Charlie and the family got up to.\"\n\n5. The LAPD nearly let Manson and his followers get away with murder. Perhaps the most shocking thing in Manson is how dimwitted the LAPD was. After Manson's followers killed five people on Cielo Drive (the \"Tate murders,\" after their most famous victim, actress Sharon Tate) and two people in Los Feliz (the LaBianca murders) just 24 hours later, it took the police almost three months to connect the two crimes, Guinn reports. That's despite major similarities in the two crimes, including words written in the victims' blood on the walls. And though a man living near Cielo Drive recovered the gun used as a murder weapon soon after the crime, it was only by hounding the cops that he managed to get them to connect it to the murders -- four months later.\n\n4. Even after Manson was arrested, his followers were convinced The Beatles would be on his side. When Rolling Stone came to interview the \"family\" after Manson's arrest but before his trial, in February 1970, they demanded money to tell their story. They also wondered aloud why The Beatles hadn't rushed to his aid. \"Tell them to call,\" they told the journalists. \"Give them our number.\"\n\nTurn the page for more, including the way the Manson girls nearly killed a witness against them.\n\n3. Manson's lawyer was so annoying, and so boring, that at one point in his trial, the jury asked for NoDoz. Manson hired Irving Kanarek mainly to annoy the crap out of the prosecutors and the judge. Guinn writes, \"Somehow Charlie had learned about Kanarek, who routinely confounded judges and prosecutors and put juries to sleep by extending trials with drawn-out questioning of witnesses and frequent objections that seemed like filibusters.\" The downside is that he annoyed the jury, too. At one point, even Manson himself shouted, \"You're just making things worse!\" Too late. Manson was sentenced to death, although the sentence later was reduced to life in prison.\n\n2. The Manson girls went so far as to try to murder a witness -- by dosing her hamburger with acid. Two of Manson's followers lured a key witness to Hawaii, where they bought her a hamburger. As she was swallowing the last bites, Guinn relates, one of the Manson girls said casually, \"Just imagine if there were 10 tabs of acid in that.\" Before losing consciousness, the witness begged a stranger to call the prosecutor. She was treated for a drug overdose and survived; the \"girls\" who gave her the tainted hamburger were charged with attempted murder.\n\n1. As Manson rotted in prison, his hold over his \"girls\" continued. Sentenced to life in prison, Manson saw his followers carry out an unsuccessful assassination attempt on President Gerald Ford. He was happy to suggest he was still controlling them. He founded a new group called the \"Order of the Rainbow,\" and ordered them to avoid sexual intercourse, meat, cigarettes, makeup and even \"movies with violence.\" His new goal? To save the environment.\n\nJeff Guinn reads from Manson at Vroman's on August 14 at 7 p.m. Follow the L.A. Weekly on Twitter @LAWeekly. Follow Sarah Fenske @sarahfenske.", "images": ["https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/235x132/5368947/24fc/CBS_Los_Angeles.PNG", "https://web.archive.org/web/20150212022316im_/http://www.laweekly.com/theme/law/img/logo-150.png", "https://web.archive.org/web/20150212022316im_/http://assets.myvoicenation.com/img/image.png", "https://web.archive.org/web/20150212022316im_/http://media.laweekly.com/10255453.212.jpg", "https://web.archive.org/web/20150212022316im_/http://pixel.quantserve.com/pixel/p-a4LDpi_DEopn-.gif", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/235x132/5237002/0e5c/13991433420_fe9b7f7c18_o.jpg", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/235x132/5378112/7a56/Damian_Flickr_ok.PNG", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/580x328/5382870/dbd5/Erica_Cherup.PNG", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/235x132/5261019/71b0/feature1-2_12-4-14.jpg", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/235x132/2385830/9bc3/post_image_kim_kardashian_old_school_buckley_frame.jpg", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/235x132/2391929/087a/sammy_davis_nixon.jpg", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/235x132/5002959/a02b/Coroner3.jpg", "https://web.archive.org/web/20150212022316im_/https://www.facebook.com/tr?id=733442463387695&ev=NoScript", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/235x132/5381192/7f75/image006.jpg", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/235x132/5381303/c7b7/10288342.0.jpg", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/235x132/5382870/dbd5/Erica_Cherup.PNG", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/235x132/5343646/d3f0/feature1-1_1-22-15.jpg", "https://web.archive.org/web/20150212022316im_/http://assets.myvoicenation.com/img/reload.png", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/original/4175174/538c/vogue_bergen.jpg", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/235x132/5261014/9467/news1-1_12-4-14.jpg", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/235x132/5220819/046b/news1-1_11-20-14.jpg", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/235x132/5334806/967a/feature1-1_1-15-15.jpg", "https://web.archive.org/web/20150212022316im_/http://media.laweekly.com/10230894.212.jpg", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/580x328/5380430/baea/news1-1_2-12-15.jpg", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/580x328/5381166/dc76/Beyonce_Sony_BMG.jpg", "https://web.archive.org/web/20150212022316im_/http://assets.myvoicenation.com/img/audio.png", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/235x132/5381166/dc76/Beyonce_Sony_BMG.jpg", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/235x132/4393141/9816/santa_monica_66_Eric_Demarcq.JPG", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/original/4175174/92e6/manson_book.jpg", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/235x132/5321381/e834/dovcharney_com.jpg", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/235x132/2393110/2665/_ashLAYHERdwn.jpg", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/580x328/5381192/7f75/image006.jpg", "https://web.archive.org/web/20150212022316im_/http://media.laweekly.com/10287622.212.jpg", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/235x132/5381439/f26b/10288484.0.jpg", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/235x132/5210993/d9ee/pornhub.jpg", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/235x132/5146123/db36/Adriano_Aguillo_Flickr_ok.PNG", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/235x132/5323195/3d00/norris.jpg", "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/235x132/5363425/2440/10267592.0.jpg"], "top_img": "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/original/4175174/538c/vogue_bergen.jpg", "keywords": [], "authors": ["Jennifer Swann", "Dennis Romero", "Gene Maddaus"], "canonical_link": "https://web.archive.org/web/20150212022316/http://www.laweekly.com/news/10-chilling-new-things-about-charles-manson-detailed-in-his-new-biography-4175174", "title": "10 Chilling New Things About Charles Manson Detailed in His New Biography", "meta_data": {"description": "There's a new biography of Charles Manson out this month -- which seems like the last thing America needs, in light of the reams of print that have alre...", "keywords": "Los Angeles news, California news, Los Angeles events, California events, LA Weekly", "og": {"type": "article", "title": "10 Chilling New Things About Charles Manson Detailed in His New Biography", "description": "There's a new biography of Charles Manson out this month -- which seems like the last thing America needs, in light of the reams of print that have alre...", "url": "https://web.archive.org/web/20150212022316/http://www.laweekly.com/news/10-chilling-new-things-about-charles-manson-detailed-in-his-new-biography-4175174", "image": {"identifier": "https://web.archive.org/web/20150212022316im_/http://images.laweekly.com/imager/b/original/4175174/538c/vogue_bergen.jpg", "height": 400, "width": 294}, "site_name": "LA Weekly"}, "article": {"published_time": "2013-08-12T07:30:45-07:00", "modified_time": "2015-01-31T16:00:07-08:00", "section": "News", "tag": "Books and Literature"}, "twitter": {"title": "10 Chilling New Things About Charles Manson Detailed in His New Biography", "description": "There's a new biography of Charles Manson out this month -- which seems like the last thing America needs, in light of the reams of print that have alre...", "card": "summary", "creator": "@sarahfenske", "image": "http://images.laweekly.com/imager/b/original/4175174/538c/vogue_bergen.jpg", "site": "@laweekly"}, "viewport": "width=device-width, initial-scale=1", "mobile-web-app-capable": "yes", "theme-color": "#0053b8"}, "movies": [], "publish_date": 1376317845.0, "source": "https://web.archive.org", "summary": ""}