{"url": "https://www.biography.com/people/steve-harvey-20631517", "text": "We may earn commission from links on this page, but we only recommend products we back.\n\n(1957-)\n\nWho Is Steve Harvey?\n\nSteve Harvey got his start in stand-up comedy. He went on to land a hosting gig on Showtime at the Apollo and his own WB sitcom, and became one of the four comedians featured in Spike Lee's . Harvey launched a long-running radio program in 2000, channeling its content into the best-selling relationship book . He went on to host a pair of daytime talk shows and currently hosts the long-running game show Family Feud.\n\nEarly Life and Career\n\nBroderick Steven Harvey was born in Welch, West Virginia, on January 17, 1957. He was the youngest of five children born to Eloise and Jesse Harvey, a coal miner who passed away in 2000 of black lung disease.\n\nWhen Harvey was young, his family moved to Cleveland, where he graduated from Glenville High School in 1974 before heading back to his home state to attend West Virginia University. After finishing school, Harvey spent his early 20s working a number of jobs — insurance salesman, postman, even wannabe professional boxer — without finding anything that really seemed like his true calling.\n\nHarvey eventually found that on the stage, performing stand-up comedy for the first time in 1985. After honing his act through several years of performances in small clubs, he came close to hitting the big time by the end of the decade, making it to the finals of the Second Annual Johnnie Walker National Comedy Search in 1989.\n\n'Showtime at the Apollo' and 'The Steve Harvey Show'\n\nFrom there, Harvey's career really took off. In 1993, he took over as the host of Showtime at the Apollo, the famed syndicated variety show filmed at Harlem's legendary Apollo Theater. Harvey would stay on Showtime at the Apollo until 2000, but his hosting duties on the iconic show were far from the only thing on his plate.\n\nIn 1996, he got his own sitcom, , on the fledgling WB network. One of the few programs to gain any traction at all on the WB before the emergence of and , The Steve Harvey Show gained a devoted following among a mostly African American audience and stayed on the air until 2002. The show also proved notable for launching a productive professional partnership between Harvey and a younger comic named Cedric the Entertainer, who played Harvey's best friend on the show and would later join him on a groundbreaking national stand-up tour.\n\nThe Kings of Comedy\n\nOn that tour, called The Kings of Comedy, Harvey and Cedric the Entertainer joined Bernie Mac and D.L. Hughley on a four-man barnstorming road show that became a surprise nationwide hit. In 1999, The Kings of Comedy became the highest-grossing comedy tour ever to date in the United States, raking in more than $19 million.\n\nHarvey and his three sidekicks became national celebrities, a status only heightened by the release of Spike Lee's 2000 documentary, , which captured the highlights of a two-night show in North Carolina before a hugely enthusiastic audience. Fans who saw the show on screen felt the same way; the film, which cost only $3 million to make, eventually earned more than $38 million at the box office.\n\nWhile Harvey's role as the Kings of Comedy's M.C. remains the most iconic performance of his career, the comedian used the fame that came from the movie as the foundation upon which to build a virtual one-man multimedia empire.\n\nRadio Show, More Film and TV Roles\n\nIn 2000, he launched a daily talk radio show, The Steve Harvey Morning Show. Originally aired only in Los Angeles and Dallas, the show eventually gained national syndication and continues to air daily on dozens of stations across the country. Harvey won Radio & Records magazine's national Syndicated Personality/Show of the Year award in 2007.\n\nEven while transforming himself into a major radio personality, Harvey continued to pursue work in stand-up and acting as well. The Steve Harvey Show on the WB went off the air after a six-year run in 2002, but Harvey soon took on other projects. He hosted a short-lived reality-show contest, Steve Harvey's Big Time, which aired on the WB from 2003-05. He also made his big-screen acting debut in a minor role in 2003's , before winning larger supporting parts in (2004), (2004) and (as a voice actor) in the animated (2005).\n\nBooks\n\nIn 2009, Harvey became a best-selling author of relationship advice books. Growing out of a segment on his radio show in which he served up hilariously blunt advice to women callers frustrated in their relationships with men, Harvey's books seemed based on the general principle that men are dogs and women need to treat them accordingly. While critics dismissed Harvey's advice as little more than a collection of overblown stereotypes, fans took to his blunt, comedic approach to self-help for the lovelorn. Both Harvey's debut, (2009), and its follow-up, (2010), broke onto best-seller lists, the former later adapted for the big screen as in 2012.\n\nAmistad 'Act Like a Lady, Think Like a Man' by Steve Harvey Now 40% Off $10 at Amazon\n\n'Family Feud' and Talk Shows\n\nIn 2010, Harvey won another iconic TV role, taking over as host of the venerable game show Family Feud. On Family Feud, Harvey found a very agreeable niche in which he was able to flash his quick wit and try out new material on a nationwide audience, while also getting to work with everyday people. \"The producers are going, 'Wow, you really know how to handle everyday people,' and yeah, because really I just got this money I got recently,\" Harvey explained at the time.\n\nIn 2012, the TV personality launched his daytime talk show, Steve Harvey. The program fared well, earning its host multiple Daytime Emmy Awards and an NAACP Image Award. In 2017, Harvey folded production and began hosting a new talk show, Steve, which focused more on celebrity guests and less on the human interest stories that were a hallmark of his previous show.\n\nMiss Universe Host and 'Little Big Shots'\n\nIn 2015, Harvey was tapped to host the Miss Universe pageant in Las Vegas. The show concluded with a major gaffe in which Harvey mistakenly announced Miss Colombia as the winner, before correcting himself and declaring Miss Philippines the victor. Despite the mix-up, Harvey returned to host Miss Universe the following year in the Philippines, and hosted the 2017 and 2018 pageants as well.\n\nMeanwhile, the TV star was named host of another program, Little Big Shots. Premiering in March 2016 on NBC, the show featured kids displaying their talents across a range of disciplines that included music, dancing and martial arts. Little Big Shots was quickly renewed for a second season in 2017 and then a third season. However, in May 2019 it was announced that Melissa McCarthy would replace Harvey as the show's host.\n\nPersonal and Family Life\n\nA born-again Christian, Harvey has been married three times. He has twin daughters, Brandi and Karli, and a son, Broderick Jr., from his first marriage, and a son, Wynton, from his second. He enjoys spending time with his large, blended family (his current wife, Marjorie Bridge Harvey, whom he wed in 2007, brought three previous children of her own into their marriage). The comedian is also the proud head of The Steve Harvey Foundation, which offers mentoring programs to young men.\n\nHarvey explained his focus on family and charity to The New York Times in 2010: \"I'm 53, I'm thinking about the responsibility of being a father, and my listeners, and I've just gotten to a place where it's got to be more than jokes. I know it sounds corny, but I'm starting really to think about my life in terms of 'What are they going to say about me?' Do I want it just to be said this guy was a king of Comedy? Well, it's not enough. Been there, done that. The sense of wanting to do something meaningful is upon me now.\"\n\nQuick Facts\n\nFULL NAME: Broderick Stephen Harvey Sr.\n\nBORN: January 17, 1957\n\nBIRTHPLACE: Welch, WV\n\nASTROLOGICAL SIGN: Capricorn\n\n\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right, contact us!", "images": ["https://www.biography.com/_assets/design-tokens/biography/static/images/logos/logo.5ec9b18.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/actor-dwayne-johnson-attends-the-black-adam-photocall-at-nh-news-photo-1758907441.pjpeg?crop=0.551xw:0.827xh;0.253xw,0&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/images/badges/on-sale.a1a1608.svg", "https://www.biography.com/_assets/design-tokens/biography/static/images/logos/network-logo.04aa008.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/sydney-sweeney-attends-the-lionsgate-presentation-during-news-photo-1762354205.pjpeg?crop=0.551xw:0.827xh;0.239xw,0.0673xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/actor-james-dean-poses-for-a-warner-bros-publicity-shot-for-news-photo-1760127578.pjpeg?crop=0.8173xw:1xh;center,top&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://hips.hearstapps.com/hmg-prod/images/cynthia-erivo-attends-the-77th-annual-tony-awards-at-david-news-photo-1728393569.jpg?crop=1.00xw:0.673xh;0,0.0738xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/pictured-eddie-murphy-on-february-15-2015-news-photo-1762808496.pjpeg?crop=0.631xw:0.942xh;0.111xw,0.0577xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://www.biography.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://www.biography.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://hips.hearstapps.com/hmg-prod/images/claire-danes-attends-the-world-premiere-of-downton-abbey-a-news-photo-1762895763.pjpeg?crop=1.00xw:0.744xh;0,0.0842xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1228405267.jpg?crop=1xw:1.0xh;center,top&resize=640:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://www.biography.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/megan-moroney-performs-onstage-during-the-2024-cma-music-news-photo-1762964027.pjpeg?crop=0.495xw:0.743xh;0.332xw,0.0745xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/actor-john-candy-poses-for-a-photo-session-on-april-12-1993-news-photo-1760022606.pjpeg?crop=1.00xw:0.804xh;0,0.0536xh&resize=360:*", "https://hips.hearstapps.com/vidthumb/images/inkt-ep04-thumbnail-682dd7da2d33d.jpg?crop=1xw:1xh;center,top", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1723044902-act-like-a-lady-think-like-a-man-66b393c5e6626.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/cynthia-erivo-at-the-wicked-for-good-new-york-premiere-held-news-photo-1763498079.pjpeg?crop=0.636xw:0.947xh;0.176xw,0.0526xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1228405267.jpg?crop=1.00xw:0.502xh;0,0&resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/of-southern-california-torch-of-liberty-dinner-1995-penny-news-photo-1760551191.pjpeg?crop=1xw:0.87783xh;center,top&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/eddie-murphy-attends-the-80th-annual-golden-globe-awards-at-news-photo-1762788000.pjpeg?crop=1.00xw:0.669xh;0,0.0791xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1146827623.jpg?crop=1.00xw:1.00xh;0,0&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://hips.hearstapps.com/rover/profile_photos/b50d4909-0f39-4b73-b482-46d0a9078d40_1682363012.file?fill=1:1&resize=120:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1228405267.jpg?crop=1.00xw:0.502xh;0,0&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.biography.com/actors/steve-harvey", "title": "Comedian, Actor, Host", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Steve Harvey - Comedian, Actor, Host", "description": "Comedian Steve Harvey is a radio and TV show host who has also written relationship advice books. He is most known for 'Family Feud' and 'Steve Harvey Morning Show'.", "keywords": "First Name: Harvey, Birth City: Welch, School: New York University Film School, Birth Year: 1957, Birth State: West Virginia, Last Name: Lee, Birth Month/Day: January 17, Group: Famous Black Comedians, Industry/Interest Area: Comedy, Industry/Interest Area: Film, Industry/Interest Area: Television, Life Events/Experience: Wrote Best-selling Books, Industry/Interest Area: Writing and Publishing, School: Morehouse College, Birth Month: 1, Astrological Sign: Capricorn, Birth Country: United States", "theme-color": "#000000", "og": {"site_name": "Biography", "title": "Steve Harvey - Comedian, Actor, Host", "description": "Comedian Steve Harvey is a radio and TV show host who has also written relationship advice books.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1228405267.jpg?crop=1.00xw:0.502xh;0,0&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.biography.com/actors/steve-harvey", "type": "article"}, "article": {"publisher": "https://www.facebook.com/Biography", "opinion": "false", "section": "Famous Actors", "modified_time": "2024-08-26T20:35:00Z", "published_time": "2024-08-26T20:35:00Z"}, "parsely-metadata": "{\"socialHeadline\":\"Steve Harvey - Comedian, Actor, Host\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1228405267.jpg?crop=1.00xw:1.00xh;0,0&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1228405267.jpg?crop=1.00xw:0.502xh;0,0&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1228405267.jpg?crop=1.00xw:1.00xh;0,0", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1228405267.jpg?crop=1.00xw:0.502xh;0,0&resize=640:*", "card": "summary_large_image"}, "auto-publish": "never", "sailthru.excerpt": "(1957-)Who Is Steve Harvey?Steve Harvey got his start in stand-up comedy. He went on to land a hosting gig on Showtime at the Apollo and his own WB sitcom, and became one of the four comedians featured in Spike Lee's The Original Kings of Comedy. Harvey launched a long-running radio", "sailthru.tags": "actors,Famous Actors,Biography-US", "sailthru.date": "2024-08-26 20:35:00", "sailthru.socialtitle": "Steve Harvey - Comedian, Actor, Host", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1724704500.0, "source": "https://www.biography.com", "summary": ""}