{"url": "https://web.archive.org/web/20170929133420/http://time.com/4944028/taylor-swift-reputation-album-theories/", "text": "For much of the past year, Taylor Swift has kept a fairly low profile. So when she dropped her buzzy music video in August for \" Look What You Made Me Do ,\" the first single off her forthcoming album Reputation, the Internet more or less lost its collective mind over it. This fervor was only intensified by the deliberate air of intrigue Swift cultivated: she cleared her social media accounts prior to the song's release and hasn't done any press for her new music — not even showing up to the 2017 MTV Video Music Awards where the \"LWYMMD\" video debuted.\n\nWith this aura of mystery surrounding Swift's new music — and her reference-laden music video — it should come as no surprise that fans have offered up plenty of theories about the album, due Nov. 10. While some of the theories are pure speculation, inspired by \"likes\" on Tumblr from Swift or her team, others are rooted in the imagery and lyrics of the attention-grabbing \"LWYMMD\" — and considering Swift's history of leaving secret messages for fans in her liner notes and elsewhere, there's reason to believe that some of them could be true.\n\nAhead of the album's release, we've culled the best theories about Swift's new music.\n\nEach Taylor persona in her \"Look What You Made Me Do\" video lineup corresponds to a song on the album\n\nSwift has confirmed that Reputation will include 15 tracks, with \"Look What You Made Me Do” listed as the 6th track on the album. Tumblr user darkbluetennesseas noted that Swift appeared to like a theory on the platform which stated that the 15 different versions of Taylor in the song's video might each correspond to a track on the album. It seems plausible, especially considering that the 6th Taylor in the lineup is one that claims to be gathering \"receipts,\" a seeming reference to the themes of exposure and distrust in the song. If this theory is to be believed, it follows that the 10th track might represent a more innocent Swift and the 5th one could touch on themes of victimhood.\n\nThe real Taylor Swift isn't actually a part of the lineup\n\nTumblr users were also quick to note that there was one Swift persona standing on the wing of her private jet in the background of the lineup shot, leading many to believe that that Swift represents who the singer really is right now. It's an especially salient point for Swift to make given her apparent move away from saccharine sweetness with the art and themes of Reputation , her edgiest album to date. This is also reinforced with the imagery of her past personas, many of whom represent certain eras or songs in her career, ranging from the nerdy ingenue in \"You Belong With Me\" to an elegantly dressed, Met Gala-bound global celebrity known for her \"squad.\"\n\nShe's hinting in \"LWYMMD\" that Calvin Harris once proposed to her\n\nA Tumblr user by the name of dallas-dante pointed out that in the \"LWYMMD\" music video, there appears to be jewelry that spells out the word \"no\" on one side of Swift's jewel-filled bathtub. On the other side, there seems to be a locket that resembles a necklace that Swift's former boyfriend Calvin Harris gave to her. Later in the video, there's an empty engagement ring box, leading fans to believe that Swift turned down a marriage proposal from Harris, though neither party ever spoke of one.\n\nSwift is aware of an Internet conspiracy theory that she died\n\nSwift is one of many celebrities who have been rumored to have been killed and replaced with a doppelgänger (others include Miley Cyrus, Paul McCartney and perhaps most infamously Avril Lavigne.) Swift's decision to wipe her social media accounts and then post cryptic videos made one Reddit user think that she might really, as rumor has it, have died and been replaced, a notion some fans felt was corroborated by the much discussed spoken-word part of the song, during which she states that \"the old Taylor can't come to the phone right now...'cause she's dead.\" One Tumblr user suggested that the death reference could also refer to a mural, shown below, that mocked the negative exposure Swift received after her beef with Kim Kardashian and Kanye West escalated.\n\nThe snakes flanking her in the \"LWYMMD\" video are a nod to perceptions of her after the Kimye Snapchat reveal\n\nIt's no big secret that Swift's favorite number is 13 (which also happens to be her birth date, in December), so it's interesting that in the \"LWYMMD\" video, she's flanked by just 12 snakes. Tumblr user lost-in-tays-land suggested that Swift is positioning herself as the 13th snake, a wry nod to the emoji that Kimye fans spammed her with after Kim Kardashian West released Snapchat footage of Swift talking to Kanye West on the phone about the infamous \"Famous\" line. (See here for the backstory on that feud.)\n\nThe graveyard suggests that Swift will no longer be hiding her work as a ghostwriter\n\nIn the video's opening graveyard scene, Swift's zombie persona is digging a grave next to a tombstone that has the pseudonym — Nils Sjoberg — she used when she wrote Calvin Harris' hit with Rihanna, \"This Is What You Came For.\" While Swift didn't reveal that she had written the song until after she and Harris broke up , some fans theorize that the new Swift will be taking full credit for everything she does from here on out.\n\nThe graveyard also reveals how Swift feels about criticism of her collaborators\n\nIn the graveyard scene, Swift's music video director and longtime collaborator Joseph Kahn also has a tombstone. This could speak to how Kahn has also been heavily criticized for his work with Swift, most notably with the \"Wildest Dreams\" video he directed, which was widely panned as a romanticized look at colonialism in Africa. If Swift's reincarnation as a take-no-prisoners boss in the following scenes are any indication, this could mean that she thinks he'll be rising above the haters, too.\n\n\"Look What You Made Me Do\" isn't about one of Swift's frenemies. It's about media scrutiny\n\nA Tumblr user pointed to the car crash in the \"LWYMMD\" video as a poignant visual declaration that Swift's revenge song might actually be about the media as opposed to longtime foes like Katy Perry or Kanye West. When Swift's persona in the video gets into a car crash, the paparazzi is more concerned with taking pictures of her than making sure she's okay. Along with Swift's album title, Reputation , and her album art, which features a collage of newspaper headlines of her name, it's fair to assume that we could be hearing more critiques of the media on other tracks on the album.\n\nThe tower of Taylors is Swift's answer to Kanye West's \"Famous\"\n\n\"I feel like me and Taylor might still have sex/ Why? I made that b-tch famous\": Call it the line heard 'round the world — or at the very least, the line that started what might be the greatest feud of a generation — but Kanye's lyric in \"Famous\" that name-checked Swift definitely hit a nerve with the pop star. While Swift addressed it pointedly during her Grammy acceptance speech for Album of the Year in 2016, by literally standing atop on a tower of her past selves from her different albums in the the \"LWYMMD\" video, she might be suggesting the way in which she's built her success and her fame of her own accord — not Kanye's.\n\nThe whole \"LWYMMD\" video is a Jacob's Ladder scenario\n\nVulture 's Jesse David Fox has one of the more unusual theories about Swift's new music, but one that's plausible nonetheless. Fox maintains that the video is a Jacob's Ladder scenario (getting its name from the 1990 horror film ) where something is so outlandish because it was, in reality, the dream of a dying person. This point is supported by Swift's line that she'll \"be the actress starring in your bad dreams,\" and the phone call in which she says that \"old Taylor can't come to the phone right now\" because \"she's dead.\"", "images": ["https://web.archive.org/web/20170929133420im_/https://timedotcom.files.wordpress.com/2017/09/bpl-banner-719x48.jpg", "https://web.archive.org/web/20170929133420im_/https://timedotcom.files.wordpress.com/2017/09/bpl-banner-1232x48.jpg", "https://web.archive.org/web/20170929133420im_/https://timedotcom.files.wordpress.com/2017/09/screen-shot-2017-09-29-at-8-18-15-am.png?h=52", "https://web.archive.org/web/20170929133420im_/https://timedotcom.files.wordpress.com/2017/09/bpl-banner-300x50.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://web.archive.org/web/20170929133420im_/http://time.com/4944028/taylor-swift-reputation-album-theories/", "https://web.archive.org/web/20170929133420im_/https://timedotcom.files.wordpress.com/2017/08/taylor-swift-music-video-01.jpg?w=720&quality=85", "https://web.archive.org/web/20170929133420im_/https://timedotcom.files.wordpress.com/2017/08/taylor-swift-music-video-01.jpg?w=720", "https://web.archive.org/web/20170929133420im_/https://timedotcom.files.wordpress.com/2017/09/patriot-statue.jpeg?h=52", "https://web.archive.org/web/20170929133420im_/https://timedotcom.files.wordpress.com/2017/09/gettyimages-855232536.jpg?h=52"], "top_img": "https://web.archive.org/web/20170929133420im_/https://timedotcom.files.wordpress.com/2017/08/taylor-swift-music-video-01.jpg?w=720", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20170929133420/http://time.com/4944028/taylor-swift-reputation-album-theories/", "title": "Taylor Swift's New Album Reputation: 10 Convincing Theories", "meta_data": {"description": "Taylor Swift's upcoming album, \"Reputation,\" has the Internet abuzz with conspiracy theories about the hidden references in her new songs.", "keywords": "taylor swift conspiracy theory, taylor swift reputation, taylor swift music theory, taylor swift reputation theory, taylor swift lwymmd theory, taylor swift album 2017, taylor swift look what you made me do meaning, taylor swift album tracks, taylor swift calvin harris locket, taylor swift feud", "news_keywords": "taylor swift conspiracy theory, taylor swift reputation, taylor swift music theory, taylor swift reputation theory, taylor swift lwymmd theory, taylor swift album 2017, taylor swift look what you made me do meaning, taylor swift album tracks, taylor swift calvin harris locket, taylor swift feud", "og": {"site_name": "Time", "type": "article", "locale": "en_US", "url": "https://web.archive.org/web/20170929133420/http://time.com/4944028/taylor-swift-reputation-album-theories/", "title": "10 Convincing Theories About Taylor Swift's New Album", "description": "From those snakes to hints at a marriage proposal", "image": "https://web.archive.org/web/20170929133420im_/https://timedotcom.files.wordpress.com/2017/08/taylor-swift-music-video-01.jpg?w=720"}, "author": "Cady Lang", "fb": {"app_id": 53177223193}, "twitter": {"site": "@TIME", "title": "10 Convincing Theories About Taylor Swift's New Album", "description": "From those snakes to hints at a marriage proposal", "card": "summary_large_image"}, "article": {"author": "http://time.com/author/cady-lang/"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}