{"url": "www.thehollywoodgossip.com/2018/07/kylie-jenner-and-travis-scott-try-to-bury-breakup-rumors-with-pd/", "text": "Kylie Jenner and Travis Scott Try to Bury Breakup Rumors with PDA Pic\n\nReading Time: 3 minutes\n\nIn a little over a week, sweet baby Stormi Webster will turn 6 months old. Yes, really.\n\nIn the mean time, Kylie Jenner and Travis Scott just had their GQ cover, but they’re not limiting their PDA to magazines. They’re also cozying up on social media.\n\nAfter rumors of the two breaking up after a massive fight, this may be an effort to silence those stories.\n\nKylie Jenner used her social media savvy to build her brand — and an (almost) billion-dollar makeup empire.\n\nBut Travis Scott is no stranger to social media. He even still uses Snapchat!\n\nAnd it was on Snapchat that the rapper shared a cuddly PDA photo of him with Kylie.\n\nThe black-and-white photo is simply captioned \"first ferdi.\"\n\nWhile Ferdi can be short for Ferdinand, in this context, it is simply slang for \"a very cute-ass boy.\" We’re not joking.\n\nRecently, Kylie and Travis were reportedly in a heated argument.\n\nIt was said to have started while the two were having dinner, with the young couple leaving dinner in a huff after only 45 minutes.\n\nAccording to eyewitnesses, the situation seemed to have deteriorated further once they returned to the hotel room, because Travis apparently left the hotel room in a hurry.\n\nIn fact, it was even speculated that Kylie had kicked Travis out for the night, but that was purely speculation.\n\nA lot of people have felt that the couple who conceived just weeks after they began dating and whom many believe are only together because of Stormi are just not a great match.\n\nSo, are they trying (and failing) to make it work just to remain together for Stormi’s sake?\n\nAs part of her interview for their recent GQ cover, Kylie wrote that it is \"normal\" for them to get \"in a little fight\" from time to time\n\n\"When we fight, it’s usually just because we’ve been away from each other for too long and we didn’t see each other for, like, two weeks,\" Kylie explains.\n\nThat sounds pretty toxic. Isn’t absence supposed to make the heart grow fonder?\n\n“And we have Stormi now,\" Kylie says. \"And I can’t travel with her. She’s too young. So it’s harder to see each other.\"\n\nSo, usually, Kylie stays at home with Stormi while Travis goes on tour to rap, and apparently to do his best DoodleBob impression.\n\nIf this very normal dynamic between the two of them is really causing them to fight, then it probably speaks to deeper, underlying issues, right?\n\nWe don’t know what these arguments are about on the surface.\n\nBut couples who argue a lot — and we cannot stress enough that, no matter what you saw or heard on teen dramas, that is not healthy — tend to have unspoken reasons for disagreements.\n\nMaybe it’s just Kylie missing Travis or vice-versa.\n\nOr maybe it’s Kylie resenting that her life has been totally transformed while Travis goes on tour whenever he wants to.\n\nKylie continues to avoid showing her baby’s face in order to punish fans who made up rumors about her having a different baby daddy.\n\nBeing a celebrity and a parent can lead to a lot of difficult choices, including how much exposure — if any — a baby should receive.\n\nBut Kylie and Travis may feel, as many fans believe, that they are obligated to stay together for Stormi’s sake.\n\nBeing a parent comes with a host of obligations, but staying in a toxic relationship is not one of them.\n\nSure, this sweet, cuddly photo that they shared might mean that they’ve made nice … but, realistically, how long is that going to last?", "images": ["https://cdn.thehollywoodgossip.com/uploads/2025/11/2552_D085_00216R-H-2025-80x80.webp", "https://cdn.thehollywoodgossip.com/uploads/2025/11/GettyImages-1154615733-80x80.jpg", "https://cdn.thehollywoodgossip.com/uploads/2022/02/thg-logo.png", "https://cdn.thehollywoodgossip.com/uploads/2025/11/GettyImages-2159895990-6-80x80.jpg", "http://www.thehollywoodgossip.com/wp-content/uploads/2018/07/covering-gq-741x1024.png", "https://cdn.thehollywoodgossip.com/uploads/2025/11/GettyImages-2247300883-80x80.jpg", "https://cdn.thehollywoodgossip.com/uploads/2024/12/1206_annaduggar_header-80x80.png", "https://cdn.thehollywoodgossip.com/uploads/2025/11/1119_janellebrown_angelamoody_header-80x80.png", "https://cdn.thehollywoodgossip.com/uploads/2025/11/69023040a27d084abe99b818-80x80.webp", "https://cdn.thehollywoodgossip.com/uploads/2025/11/1119_tekashi6ix9ine_header-80x80.jpg", "https://cdn.thehollywoodgossip.com/uploads/2018/05/travis-scott-and-kylie-jenner-make-first-ever-red-carpet-appeara-scaled.jpg"], "top_img": "http://www.thehollywoodgossip.com/wp-content/uploads/2018/07/covering-gq-741x1024.png", "keywords": [], "authors": ["Simon Delott"], "canonical_link": "https://www.thehollywoodgossip.com/2018/07/kylie-jenner-and-travis-scott-try-to-bury-breakup-rumors-with-pd/", "title": "Kylie Jenner and Travis Scott Try to Bury Breakup Rumors with PDA Pic", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Kylie Jenner and Travis Scott Try to Bury Breakup Rumors with PDA Pic", "description": "In a little over a week, sweet baby Stormi Webster will turn 6 months old. Yes, really. In the mean time, Kylie Jenner and Travis Scott just had their GQ cover", "url": "https://www.thehollywoodgossip.com/2018/07/kylie-jenner-and-travis-scott-try-to-bury-breakup-rumors-with-pd/", "site_name": "The Hollywood Gossip", "updated_time": "2022-04-27T10:33:04+00:00", "image": "http://www.thehollywoodgossip.com/wp-content/uploads/2018/07/covering-gq-741x1024.png", "article": {"published_time": "2018-07-23 14:40:51", "modified_time": "2022-04-27 10:33:04"}}, "article": {"published_time": "2018-07-23T14:40:51+00:00", "modified_time": "2022-04-27T10:33:04+00:00"}, "twitter": {"card": "summary", "title": "Kylie Jenner and Travis Scott Try to Bury Breakup Rumors with PDA Pic", "description": "In a little over a week, sweet baby Stormi Webster will turn 6 months old. Yes, really. In the mean time, Kylie Jenner and Travis Scott just had their GQ cover", "image": "http://www.thehollywoodgossip.com/wp-content/uploads/2018/07/covering-gq-741x1024.png", "label1": "Written by", "data1": "Simon Delott", "label2": "Est. reading time", "data2": "3 minutes"}, "author": "Simon Delott", "generator": "WordPress 6.8.3", "theme-color": "#000000", "msapplication-TileImage": "https://cdn.thehollywoodgossip.com/uploads/2024/07/cropped-THG-LOGO-270x270.jpg"}, "movies": [], "publish_date": 1532356851.0, "source": "http://www.thehollywoodgossip.com", "summary": ""}