{"url": "https://www.festival-cannes.com/en/infos-communiques/communique/articles/cate-blanchett-jury-president-of-the-festival-de-cannes-2018", "text": "“I have been to Cannes in many guises over the years; as an actress, producer, in the marketplace, the Gala-sphere and in Competition,” she declared, “but never solely for the sheer pleasure of watching the cornucopia of films this great festival harbours.”\n\n\n\nCate Blanchett follows Pedro Almodóvar, Jury President of the 70th edition, whose jury awarded the Palme d’or to The Square by Swedish director Ruben Östlund.\n\n\n\n\"I am humbled by the privilege and responsibility of presiding over this year's jury,” she continued. “This festival plays a pivotal role in bringing the world together to celebrate story; that strange and vital endeavour that all peoples share, understand and crave.\"\n\n\n\nPierre Lescure, Festival de Cannes President and Thierry Frémaux, General Delegate, said: \"We are delighted to welcome such a rare and unique artist whose talent and convictions enrich both screen and stage. Our conversations from this autumn tell us she will be a committed President, a passionate woman and a big-hearted spectator.”\n\n\n\nCate Blanchett is one of those actors for whom performing is a permanent delight, whatever the role she takes to stage or screen. In film, always under the eye of great directors, she switches between independent ventures and lavish productions, and appears in the credits of all notable contemporary English-language cinema: The Lord of the Rings trilogy by Peter Jackson, Benjamin Button by David Fincher, Babel by Alejandro González Iñárritu, The Life Aquatic by Wes Anderson, The Good German by Steven Soderbergh, Coffee and Cigarettes by Jim Jarmusch. To this non-exhaustive list, we must add Steven Spielberg, Terrence Malick, Sally Potter, Ridley Scott, Woody Allen and Todd Haynes.\n\n\n\nWhen she is not on screen, Blanchett’s commitment to the theatre all over the world is palpable. Alongside her producing partner Andrew Upton, she was CEO and co-Artistic Director of the Sydney Theatre Company from 2008 to 2013 and Blanchett has won awards for her work on stage in New York, Washington, London, Paris (she performed in Jean Genêt’s The Maids alongside Isabelle Huppert, Jury President in 2009) and also in Sydney, of course, where she soared in Liv Ullman’s production of A Streetcar Named Desire.\n\n\n\nIn 2012, Blanchett was awarded the Chevalier de l’Ordre des Arts et des Lettres by the French Minister for Culture and also the Centenary Medal for Service to Australian Society, both for her significant contribution to the arts. In 2015, she was honoured with a Lifetime Achievement Award from the Australian Academy of Cinema and Television Arts before she was made a Companion in the Order of Australia in 2017.\n\n\n\nBack on the screen, Blanchett won the 2014 Oscar for best actress for her performance in Blue Jasmine by Woody Allen. This award came in addition to the Oscar she was awarded in 2004 for best supporting actress in The Aviator by Martin Scorsese in which she played an unforgettable Katharine Hepburn – it is the first time that an actress has won an Oscar for playing another actress… who also won an Oscar.\n\n\n\nCate Blanchett was also nominated for her performance in Carol by Todd Haynes, a film that she co-produced and which was presented in Competition at Cannes in 2015. And not forgetting that in 2008 she also received two Oscar nominations, best actress for Elizabeth the Golden Age by Shekhar Kapur (with whom she collaborated 10 years earlier in Elizabeth) and best supporting actress for I’m Not There by Todd Haynes (for which she won the best actress prize at the Mostra in Venice), making her one of only five actors in the history of the Academy to have been nominated for both categories in the same year.\n\n\n\nRecently, Cate Blanchett was seen in the Marvel super-production Thor: Ragnarok and will be appearing in Ocean’s 8, the first chapter in an entirely female saga, produced by Warner and due to be released after Cannes, late spring 2018. In the same year, she will appear in the highly-anticipated film adaptation of Maria Semple’s Where’d You Go Bernadette, directed by Richard Linklater. She can then be seen in The House with a Clock in its Walls, directed by Eli Roth.\n\n\n\nCate Blanchett is also a Goodwill Ambassador for the United Nations High Commissioner for Refugees, where she focuses on issues of statelessness for refugees around the world.\n\n\n\nThe Festival de Cannes 2018 will take place from May 8th – 19th and, exceptionally, will open on a Tuesday and end on a Saturday.", "images": ["https://cdn.festival-cannes.com/media/uploads/2024/02/logo-loreal.svg", "https://cdn.festival-cannes.com/media/uploads/2023/01/logo-chopard.svg", "https://img.festival-cannes.com/eyJidWNrZXQiOiJtZWRpYSIsImtleSI6InVwbG9hZHNcLzIwMThcLzExXC9Pc2NhcnMxLmpwZyIsImVkaXRzIjp7InJlc2l6ZSI6eyJ3aWR0aCI6MjAwLCJmaXQiOiJjb3ZlciJ9fX0=", "https://img.festival-cannes.com/eyJidWNrZXQiOiJtZWRpYSIsImtleSI6InVwbG9hZHNcLzIwMjNcLzA0XC9kZWZhdWx0LXNoYXJlLnBuZyIsImVkaXRzIjp7InJlc2l6ZSI6eyJ3aWR0aCI6MTYwMCwiZml0IjoiY292ZXIifX19", "https://img.festival-cannes.com/eyJidWNrZXQiOiJtZWRpYSIsImtleSI6InVwbG9hZHNcLzIwMThcLzAxXC9DQi1IZWFkc2hvdF9zaXRlLnBuZyIsImVkaXRzIjp7InJlc2l6ZSI6eyJ3aWR0aCI6MTAyOCwiZml0IjoiY292ZXIifX19", "https://cdn.festival-cannes.com/media/uploads/2024/02/logo-kering.svg", "https://img.festival-cannes.com/eyJidWNrZXQiOiJtZWRpYSIsImtleSI6InVwbG9hZHNcLzIwMThcLzExXC9TZW1hbmEyMDE4X0RFRi5qcGciLCJlZGl0cyI6eyJyZXNpemUiOnsid2lkdGgiOjIwMCwiZml0IjoiY292ZXIifX19", "https://img.festival-cannes.com/eyJidWNrZXQiOiJtZWRpYSIsImtleSI6InVwbG9hZHNcLzIwMjNcLzA0XC9ibXdfd2hpdGUtY29sb3VyX3JnYi5wbmciLCJlZGl0cyI6eyJyZXNpemUiOnsid2lkdGgiOjE2MDAsImZpdCI6ImNvdmVyIn19fQ==", "https://img.festival-cannes.com/eyJidWNrZXQiOiJtZWRpYSIsImtleSI6InVwbG9hZHNcLzIwMThcLzEyXC9Sb3V0ZS0zLmpwZyIsImVkaXRzIjp7InJlc2l6ZSI6eyJ3aWR0aCI6MjAwLCJmaXQiOiJjb3ZlciJ9fX0=", "https://cdn.festival-cannes.com/media/uploads/2024/04/jpm.svg", "https://img.festival-cannes.com/eyJidWNrZXQiOiJtZWRpYSIsImtleSI6InVwbG9hZHNcLzIwMThcLzEyXC9BQ1RVLVNPUlRJRS1zY2FsZWQuanBnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoyMDAsImZpdCI6ImNvdmVyIn19fQ==", "https://cdn.festival-cannes.com/media/uploads/2023/01/logo-mastercard.svg"], "top_img": "https://img.festival-cannes.com/eyJidWNrZXQiOiJtZWRpYSIsImtleSI6InVwbG9hZHNcLzIwMjNcLzA0XC9kZWZhdWx0LXNoYXJlLnBuZyIsImVkaXRzIjp7InJlc2l6ZSI6eyJ3aWR0aCI6MTYwMCwiZml0IjoiY292ZXIifX19", "keywords": [], "authors": [], "canonical_link": "https://www.festival-cannes.com/en/press/press-releases/cate-blanchett-jury-president-of-the-festival-de-cannes-2018/", "title": "Cate Blanchett, Jury President of the Festival de Cannes 2018", "meta_data": {"viewport": "width=device-width, initial-scale=1", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Festival de Cannes", "application-name": "Festival de Cannes", "msapplication-TileColor": "#000000", "msapplication-config": "https://www.festival-cannes.com/wp-content/themes/fdc/favicons/browserconfig.xml", "theme-color": "#c5a26e", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "“I have been to Cannes in many guises over the years; as an actress, producer, in the marketplace, the Gala-sphere and in Competition,” she", "og": {"locale": "en_US", "type": "article", "title": "Cate Blanchett, Jury President of the Festival de Cannes 2018 - Festival de Cannes", "description": "“I have been to Cannes in many guises over the years; as an actress, producer, in the marketplace, the Gala-sphere and in Competition,” she", "url": "https://www.festival-cannes.com/en/press/press-releases/cate-blanchett-jury-president-of-the-festival-de-cannes-2018/", "site_name": "Festival de Cannes", "image": {"identifier": "https://img.festival-cannes.com/eyJidWNrZXQiOiJtZWRpYSIsImtleSI6InVwbG9hZHNcLzIwMjNcLzA0XC9kZWZhdWx0LXNoYXJlLnBuZyIsImVkaXRzIjp7InJlc2l6ZSI6eyJ3aWR0aCI6MTYwMCwiZml0IjoiY292ZXIifX19", "width": 1200, "height": 630, "type": "image/png"}}, "article": {"publisher": "https://www.facebook.com/festivaldecannes/"}, "twitter": {"card": "summary_large_image", "site": "@Festival_Cannes"}, "msapplication-TileImage": "https://img.festival-cannes.com/eyJidWNrZXQiOiJtZWRpYSIsImtleSI6InVwbG9hZHNcLzIwMjNcLzA1XC9jcm9wcGVkLWRlZmF1bHQtaWNvbi5wbmciLCJlZGl0cyI6eyJyZXNpemUiOnsid2lkdGgiOjI3MCwiaGVpZ2h0IjoyNzAsImZpdCI6ImNvdmVyIn19fQ=="}, "movies": [], "publish_date": null, "source": "https://www.festival-cannes.com", "summary": ""}