{"url": "https://www.reddit.com/r/lucifer/comments/8qm7kx/tv_scoop_awards_2018_vote_for_the_best_drama/", "text": "Best episodes that showcase Lucifer's charm\n\nLucifer Morningstar is known for his charming and charismatic personality, which is often on full display in various episodes. Here are some of the best episodes that showcase Lucifer's charm, as highlighted by Redditors:\n\nSeason 1\n\n\"Manly Whatnots\" (S01E04): Lucifer tries to seduce Chloe to get over his infatuation, leading to some charming and humorous interactions. \"I like how it's a complete reversal of the usual trope: instead of him concealing his identity and people not believing him.\"\n\nSeason 2\n\n\"Candy Morningstar\" (S02E14): Lucifer introduces a ditzy stripper named Candy to the department, revealing a clever con. \"I loved everything that came out of Candy's mouth, including her moments of seemingly accidental wisdom. I really wanted her to stick around through the end of the season just because her bubbliness and her stupidity made everyone uncomfortable. But BOOM Lucifer conned us all.\"\n\nSeason 3\n\n\"It Never Ends Well for the Chicken\" (S03E10): A noir-themed episode where Lucifer takes on a different persona. \"I got the full set 👍\"\n\nSeason 4\n\n\"Someone's Been Reading Dante's Inferno\" (S04E01): Lucifer returns from Hell, dealing with the aftermath of his actions. \"Crime solving devil, it makes sense.\"\n\nSeason 5\n\n\"Family Dinner\" (S05E09): Lucifer has a tense family dinner with his mother and Amenadiel, showcasing his wit and charm under pressure. \"My favorite Lucy\"\n\nSeason 6\n\nFor more discussions and insights, you might want to check out these subreddits:", "images": ["https://external-preview.redd.it/AYfYVpnUJTL7hCY8yHcw79YwssA16bMJA-KeZvNjKq8.jpg?width=640&crop=smart&auto=webp&s=fd66165e61545cfaaa5fb73100498796169edc1e", "https://styles.redditmedia.com/t5_2sbp9/styles/communityIcon_q7xchpz2h7z61.png?width=96&height=96&frame=1&auto=webp&crop=96%3A96%2Csmart&s=3d0678ae5060121fc9c9ccef9a8ab4f4a1371c52", "https://id.rlcdn.com/472486.gif", "https://www.redditstatic.com/shreddit/assets/favicon/64x64.png", "https://styles.redditmedia.com/t5_2sbp9/styles/bannerBackgroundImage_z6ngy9v8v7z61.jpg?format=pjpg&s=daff677c35f6efe7ab8db3ed7b145cd9d5d9aa5b"], "top_img": "https://www.redditstatic.com/shreddit/assets/favicon/64x64.png", "keywords": [], "authors": [], "canonical_link": "", "title": "The heart of the internet", "meta_data": {"viewport": "width=device-width, initial-scale=1, viewport-fit=cover", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black", "msapplication-navbutton-color": "#000000", "theme-color": "#000000"}, "movies": [], "publish_date": null, "source": "https://www.reddit.com", "summary": ""}