{"url": "https://www.organicauthority.com/energetic-health/how-katie-holmes-got-into-the-best-shape-of-her-life", "text": "How Katie Holmes Got Into the Best Shape of Her Life\n\nActress Katie Holmes is definitely not Joey Potter anymore. Not only is she wearing a stylish new pixie cut, but she’s also sporting some serious biceps.\n\nThe “Dawson’s Creek” alum underwent some intense training for an upcoming role in which she plays an ex-Marine. According to her recent interview with Women’s Health, Holmes is “a startling combination of litheness and sinew.”\n\nSo just how did the actress get into such tip-top shape? We break down the star’s tough-yet-doable new workout.\n\nShe Does SoulCycle\n\n“I like that sense of community,” Holmes explains to the magazine. “Being surrounded by other people adds an element of inspiration, ‘like, if she can do it, I can do it too.'”\n\nGroup fitness classes are extremely beneficial for a number of reasons. As Holmes mentioned, they are an amazing way of motivating yourself and others to dig deeper and push yourself further. Plus, group fitness is a great way to get a workout in without having to think or plan a workout — perfect for people on the go — and a fitness class instructor will help you with technique and form, which will only make you perform better.\n\nFactor in a positive environment like SoulCycle — which also predicts you’ll burn between 500 to 700 calories per sweat session — and you’re in for one fat-burning, life-affirming ride.\n\nShe Lifts Weights\n\nHolmes worked out with a trainer for her intense new role, which involved two-hour sessions with a number of squats, crunches, and working out with weights. “I was a five-pound-weight person, and now I can do 15, 20,” she said.\n\nStrength training is a vital component of exercise. It not only builds muscle but can prevent disease, improve mood, and help you lose weight. In fact, lifting weights is known to boost your metabolism, creating an after-burn effect, which means you’ll be blasting calories even while you’re at rest.\n\nNot to mention it helps create those sculpted — or should we say ‘sinewy’ — arms and legs just like Holmes’.\n\nShe Boxes\n\n“I’ve been doing a lot of boxing, which I had never done before. It’s thrilling,” Holmes told the magazine. “You can get out the stress of the day. I just go in there and think of all the mundane things that bother me. Traffic! I put off all my phone calls till after boxing, because it puts me in a much calmer place.”\n\nHolmes is the latest star to fall in love with boxing, but there’s a good reason why. Boxing is one of the most intense cardiovascular activities for athletes of many different fitness levels by providing high-intensity, calorie-burning routines that helps strengthen your arms, legs, and core. It’s also known to bust stress, helping to alleviate feelings of depression and anxiety.\n\nThe Takeaway\n\nPerhaps the ultimate takeaway from Holmes’ workout is her dedication to changing it up. By switching up your exercise routine you’re constantly challenging your body, which will lead to more results and put you at less risk of hitting that dreaded plateau. Though her workout is tough, what you will discover about yourself through your fitness journey is well worth it.\n\nAs Holmes tells the mag, “Your broken self is more beautiful than your original, pure self. It’s not really your broken self, but it’s your traveled self. That’s what I thought was beautiful.”\n\nRelated on Organic Authority\n\nThe Top 5 Fitness Trends Worth the Hype\n\n3 Ways Celebs Cope With Their Anxiety Through Exercise\n\nMeghan Markle’s 5 Simple Health and Fitness Essentials You Gotta Try", "images": ["https://www.organicauthority.com/wp-content/uploads/2024/05/MTY4NTgxODA3MjM3NzY4OTgy.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201920%201920'%3E%3C/svg%3E", "https://www.organicauthority.com/wp-content/uploads/2024/05/img_1155-428x428.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%2030%2030'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20601%20207'%3E%3C/svg%3E", "https://www.facebook.com/tr?id=533469367234380&ev=PageView &noscript=1", "https://www.organicauthority.com/wp-content/uploads/2024/05/how-katie-holmes-got-into-the-best-shape-of-her-life.png", "https://www.organicauthority.com/wp-content/uploads/2024/05/how-katie-holmes-got-into-the-best-shape-of-her-life-1000x630.png", "https://www.organicauthority.com/wp-content/uploads/2024/04/MTc0MzE3MDkyMzUzMzUzMzUw.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%2070%2070'%3E%3C/svg%3E"], "top_img": "https://www.organicauthority.com/wp-content/uploads/2024/05/how-katie-holmes-got-into-the-best-shape-of-her-life.png", "keywords": [], "authors": ["Brianne Hogan", "Brianne", "Hogan", "Is", "A", "Canadian", "Writer", "Currently", "Based", "In"], "canonical_link": "https://www.organicauthority.com/energetic-health/how-katie-holmes-got-into-the-best-shape-of-her-life", "title": "How Katie Holmes Got Into the Best Shape of Her Life", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "pubexchange": {"image": "https://www.organicauthority.com/wp-content/uploads/2024/05/how-katie-holmes-got-into-the-best-shape-of-her-life-428x342.png"}, "description": "For an upcoming new role, Katie Holmes trained like a marine. Now she's in the best shape of her life. Here's how she did it.", "og": {"locale": "en_US", "type": "article", "title": "How Katie Holmes Got Into the Best Shape of Her Life", "description": "For an upcoming new role, Katie Holmes trained like a marine. Now she's in the best shape of her life. Here's how she did it.", "url": "https://www.organicauthority.com/energetic-health/how-katie-holmes-got-into-the-best-shape-of-her-life", "site_name": "Organic Authority", "image": {"identifier": "https://www.organicauthority.com/wp-content/uploads/2024/05/how-katie-holmes-got-into-the-best-shape-of-her-life.png", "width": 1000, "height": 800, "type": "image/png"}}, "article": {"publisher": "https://www.facebook.com/OrganicAuthority", "published_time": "2024-09-10T19:17:13+00:00"}, "author": "Brianne Hogan", "twitter": {"card": "summary_large_image", "creator": "@OrganicAuthorit", "site": "@OrganicAuthorit", "label1": "Written by", "data1": "Brianne Hogan", "label2": "Est. reading time", "data2": "3 minutes"}, "msapplication-TileImage": "https://www.organicauthority.com/wp-content/uploads/2024/04/cropped-favicon-512x512-1-270x270.png", "generator": "WP Rocket 3.19.4"}, "movies": [], "publish_date": 1725995833.0, "source": "https://www.organicauthority.com", "summary": ""}