{"url": "https://www.biography.com/people/dwayne-johnson-11818916", "text": "We may earn commission from links on this page, but we only recommend products we back.\n\n1972–present\n\nLatest News: Dwayne Johnson Stars in The Smashing Machine\n\nDwayne Johnson stars in the biographical sports drama The Smashing Machine, portraying real-life MMA fighter Mark Kerr. Directed by Benny Safdie, the film explores Kerr’s fight both inside and outside the ring, showing his struggles with addiction and depression.\n\nThe 53-year-old actor opened up to Variety about how he prepared for the role, calling his transformation into the ferocious heavyweight champion “the hardest thing” he’s ever done. “There was a physical transformation, prosthetics, vocal transformation—he has a very specific way of talking,” Johnson said in September. Still, the emotional transformation took a much greater toll on him.\n\n“I knew I’d have to go to dark places—into trauma, pain, stuff I didn’t want to touch for years,” he said. “But I knew, if I was going to do this, I had to open myself up. This movie gave me a place to put all that stuff. I don’t know if it’s method—whatever it is—I went for it.”\n\nJohnson, a former professional wrestler himself, knew Kerr from training in the same gym in the ‘90s. He worked with Kerr during filming to really hone his character. “I could talk to him: ‘Hey man, what were you thinking?’ And he’d say, ‘I never lost.’ But the truth is, the win became the enemy,” he said. “The movie isn’t about winning or losing. It’s about pressure—and how we survive it.”\n\nThe Smashing Machine arrives in theaters October 3.\n\n\n\nWho Is Dwayne Johnson?\n\nDwayne “The Rock” Johnson is an actor and former professional wrestler known for his eight WWE Championship wins and action-packed film roles. Born into a professional wrestling family, Johnson first rose to fame as a WWE star in the late 1990s, adopting the now famous persona of “The Rock.” He then parlayed his fame into a film career, landing his first leading role in 2002’s The Scorpion King. The actor has since continued to take on action-oriented roles in such films as Hercules, Central Intelligence, the Fast & Furious franchise, and the Jumanji reboot film series. In October 2025, Johnson stars as MMA fighter Mark Kerr in the biographical sports drama The Smashing Machine.\n\nQuick Facts\n\nFULL NAME: Dwayne Douglas Johnson\n\nBORN: May 2, 1972\n\nBIRTHPLACE: Hayward, California\n\nSPOUSE: Dany Garcia (1997-2008); Lauren Hashian (2019-present)\n\nCHILDREN: Simone (Ava Raine), Jasmine, Tiana\n\nASTROLOGICAL SIGN: Taurus\n\nHEIGHT: 6 ft. 4 in.\n\nWhere Is Dwayne Johnson From?\n\nDwayne Douglas Johnson was born on May 2, 1972, in Hayward, California, to Rocky Johnson (born Wayde Bowles) and Ata Maivia Johnson. His father, a professional wrestler, was Black Nova Scotian and his mother is of Samoan descent. When Johnson was born, his father was married to another woman, but his parents later wed when he was 5 years old. Though he had two older half-siblings, Curtis and Wanda Bowles, he was raised as an only child.\n\nGrowing up, Johnson frequently moved around to accommodate Rocky’s pro wrestling career, attending a new school nearly every year. In his early years, he lived in upward of 13 states, including North Carolina, Connecticut, Hawaii, Florida, Georgia, and Tennessee. “I spent a lot of my childhood in the back seat of a car just driving from town to town as my dad would wrestle,” Johnson recalled to in November 2024. This nomadic lifestyle led him to struggle in school, earning poor grades. It also caused his family to struggle financially, leading to periods of poverty.\n\nWith his father seldom at home, Johnson looked up to his maternal grandfather, pro wrestler Peter “High Chief” Fanene Maivia, for guidance. After Maivia died of cancer, however, Johnson started acting out. When Johnson was 13 years old, he moved to Auckland, New Zealand, to live with his mother’s family before returning to the United States the following year. By age 14, he was living with his mother in a small apartment in Honolulu, Hawaii, where he briefly attended William McKinley high school. It was around this time that he started stealing and getting into trouble.\n\n“I was a very angry teenager,” he told British GQ in November 2016. “I didn’t like my parents fighting, my dad being on the road, not making much money. It was tough...and I was getting into a lot of fights.” His time in Hawaii soon came to end, however, when he and his mother were abruptly evicted from their home. Following the eviction, they moved in with his father in Memphis, Tennessee. It was also around this time that he began lifting weights and gaining muscle mass.\n\nAt age 15, Johnson’s family moved to Bethlehem, Pennsylvania, where he attended Freedom High School for two years. Though he continued to get into fights and even got arrested for theft, he also channeled his aggression into football. Johnson graduated high school in 1990 and went on to play college football at the University of Miami, showing promise with his size and athleticism until being slowed by injuries. After consulting with his coaches, he refocused his efforts on his academics, eventually earning a bachelor's degree in criminology and physiology in 1995. That same year, Johnson tried his hand at professional football when he was signed to the Canadian Football League’s Calgary Stampeders but was soon cut from the team after just two months.\n\nBecoming “The Rock”\n\nWith few prospects left in football, Johnson turned to professional wrestling, following in his father and grandfather’s footsteps. He began wrestling in a few non-televised matches in early 1996, defeating the Brooklyn Brawler in a house show that March. After a couple of matches, Johnson made his debut in the United States Wrestling Association (USWA) under the name Flex Kavana in May, winning a tag team championship with Bart Sawyer.\n\nHe soon signed a contract with the World Wrestling Entertainment (WWE), debuting as Rocky Maivia that November at the WWE’s Survivor Series. After his “good guy” character proved unsuccessful, however, he pivoted, turning into a villainous heel when he joined The Nation of Domination in August 1997. Johnson eventually took over the wrestling group’s leadership and began calling himself “The Rock.” He later joined another band of elite wrestlers known as “The Corporation” and began a notorious feud with Steve Austin. Also known as “The People’s Champ,” The Rock went on to win a combined 17 WWE titles over his acclaimed career.\n\nJohnson stopped wrestling full-time in 2004 to focus on his acting, before returning part-time in 2011 to create a feuding storyline with John Cena. He wrestled his last full match against Cena in at WrestleMania 29 in April 2013, which he lost. Johnson later competed in a six-second match against Eric Rowan in 2016 at WrestleMania 32, quickly winning with his signature moves The Rock Bottom and the People’s Elbows. After going three years with no matches, he announced his official retirement from wrestling in 2019.\n\nTim Nwachukwu // Getty Images Dwayne “The Rock” Johnson during Night One of WrestleMania 40 on April 06, 2024.\n\nJohnson later made a surprise appearance at Friday Night Smackdown in September 2023 and joined the board of directors of WWE’s parent company TKO the following January. In an interview with LADbible in November 2024, he explained wrestling “provided me a platform and a way to express myself in ways that nothing else would allow,” aside from his acting career. “So the opportunity for me to become a director, sit on the board, take that position, is just another way that I could help the company grow,” Johnson said. He has since made several more appearances, notably competing in a with Roman Reigns at 2024’s WrestleMania XL.\n\nMovies and TV Shows\n\nThe Mummy Returns and The Scorpion King\n\nOutside the ring, The Rock leveraged his fame into a successful acting career, eventually dropping the stage name and simply going by Dwayne Johnson. He scored his first scripted acting gig in a 1999 episode of That ‘70s Show, making a brief appearance as his pro wrestler father, Rocky Johnson before portraying himself in a series of TV cameos. Johnson made a big splash in his film debut The Mummy Returns in 2001, appearing as the supernatural villain Mathayus, the Scorpion King. He soon reprised this half-man, half-scorpion character in the 2002 spinoff The Scorpion King.\n\nThe Game Plan and Tooth Fairy\n\nMichael Tran // Getty Images\n\nJohnson next starred in the action flicks The Rundown (2003) and Walking Tall (2004) and tried his hand at comedy in 2005’s Be Cool with John Travolta and Uma Thurman, playing a gay, Samoan bodyguard. “There were people around me at that time who didn’t think playing a gay guy was a good career move. But for me, it seemed a clear choice,” he told British GQ. “I trusted my instinct and I realized, just like in wrestling, I had to be me.”\n\nThe actor briefly dropped “The Rock” moniker before the release of the 2006 dark comedy Southland Tales, but was later credited as Dwayne “The Rock” Johnson in 2007’s The Game Plan, in which he played a football star who unexpectedly finds out he’s the father of a young daughter (Madison Pettis).\n\nContinuing to appear in family friendly films, Johnson next starred in the 2009 adventure movie Race to Witch Mountain with AnnaSophia Robb, and The Tooth Fairy (2010), portraying a hockey player forced to become a real-life tooth fairy.\n\nFast & Furious Franchise\n\nThat same year, Johnson played a heroic police officer in the buddy-cop parody The Other Guys, starring Will Ferrell and Mark Wahlberg, and portrayed an ex-con seeking vengeance for the murder of his brother in Faster. In 2011, he starred as hard-nosed federal agent Luke Hobbs in Fast Five, an installment in the Fast & Furious franchise. Johnson's antagonist character revitalized the film series, shifting its focus from street racing to heists.\n\nHe went on to reprise his role as Hobbs in Fast & Furious 6 (2013), Furious 7 (2015), The Fate of the Furious (2017), and Fast & Furious Presents: Hobbs & Shaw (2019). Johnson reportedly did not appear in 2021’s F9 over a real-life feud with star Vin Diesel but returned for Fast X in 2023. He is set to appear in the franchise’s final film, Fast & Furious 11, in 2026.\n\n\n\nBallers and Central Intelligence\n\nIn the midst of filming the Fast & Furious movies, he starred in Michael Bay’s 2013 flick Pain & Gain, took on the titular strong man in 2014’s Hercules, and dominated the big screen in the 2015 action film San Andreas. Johnson also debuted his first dramatic comedy series that same year, playing Spencer Strasmore, a retired pro footballer turned financial planner, on HBO’s Ballers. The show ran for five seasons, ending in 2019. Around the same time, he teamed up with Kevin Hart in the 2016 action-comedy Central Intelligence, playing a lethal CIA agent.\n\nMoana and Jumanji Reboot Series\n\nAlso in 2016, he voiced the demigod Maui for the Disney animated hit Moana, later reprising his role in the 2024 sequel Moana 2. Johnson was a busy man in 2017, taking on starring roles in a big-screen adaptation of the 1990s lifeguard series Baywatch and the Jumanji reboot. In Jumanji: Welcome to the Jungle, he played Dr. Smolder Bravestone, the muscular adult avatar of nerdy teenager Spencer. The film was a box office hit, grossing nearly $1 billion worldwide. Johnson reprised his role in the 2019 sequel Jumanji: The Next Level, which also performed well commercially.\n\nSkyscraper and Rampage\n\nIn 2018, he played a below-the-knee amputee with a prosthetic leg in action movie Skyscraper, partaking in death-defying stunts while infiltrating a burning skyscraper. However, there was some criticism about casting Johnson, a person without limb-loss, in the role. Next up for the action star was Rampage, based on the popular 1980s arcade game, which premiered in theaters that same year. Johnson returned to his wrestling roots by appearing as himself in 2019’s Fighting with My Family, based on the true story of female wrestling champion Saraya “Paige” Bevis.\n\nJungle Cruise, Red Notice, and Young Rock\n\nNBC // Getty Images Dwayne Johnson on the set of Young Rock with Angela Honig.\n\nIn 2021, Johnson played a wisecracking riverboat skipper alongside Emily Blunt in Jungle Cruise and an FBI agent in the art heist movie Red Notice with Ryan Reynolds and Ana de Armas. That same year, he debuted Young Rock, a television series about his life. The show, which starred Johnson and other actors playing younger versions of the actor, ran for three seasons on NBC, ending in 2023.\n\nBlack Adam and Red One\n\nJohnson next starred in the 2022 DC Comics film Black Adam, playing the titular superhero. Despite showing promise, the movie flopped at the box office. While a sequel was initially in the works, the actor later confirmed new leadership at DC Studios halted plans for a follow up. Two years later, Johnson appeared in the Christmas action flick Red One, playing an operative for Santa Claus.\n\nThe Smashing Machine\n\nAfter countless comedies and action flicks, Johnson takes on his first dramatic role in the 2025 biographical sports drama The Smashing Machine, portraying real-life MMA fighter Mark Kerr. The actor told in October that he underwent a hefty physical transformation for the role, gaining 30 pounds and wearing 21 prosthetics. “I've never worked harder, and we like hard work, it's what we all like to do,” he said. “But man, I had never worked harder for a role.”\n\nXFL Co-Owner\n\nIn August 2020, Johnson announced he teamed up with his ex-wife and a sports management company to buy the American football minor league XFL, which went bankrupt earlier in the year, for $15 million. “The acquisition of the XFL with my talented partners, Dany Garcia and Gerry Cardinale, is an investment for me that’s rooted deeply in two things—my passion for the game and my desire to always take care of the fans,” Johnson said in a statement. “With pride and gratitude for all that I’ve built with my own two hands, I plan to apply these callouses to the XFL, and look forward to creating something special for the players, fans, and everyone involved for the love of football.”\n\nWife Lauren Hashian and Daughters\n\nAxelle/Bauer-Griffin // Getty Images Dwayne Johnson with wife Lauren Hashian in 2023.\n\nJohnson is married to singer and music producer Lauren Hashian. The couple met on the set of The Game Plan in 2006 and began dating the following year. They welcomed their first child, a daughter named Jasmine, in December 2015, and their youngest daughter, Tiana, followed in April 2018. After 12 years of dating, Johnson and Hashian skipped an engagement and tied the knot in Hawaii in August 2019. They currently reside in Los Angeles.\n\nJohnson was previously married to businesswoman and bodybuilder Dany Garcia. They met while students at the University of Miami. Johnson and Garcia wed in 1997. They welcomed their daughter, Simone, in August 2001, before splitting up in 2008. After their divorce, she became his manager. Following the Johnson family tradition, Simone signed to the WWE in 2020 under the name Ava Raine.\n\nNet Worth\n\nAs of October 2025, Johnson has an estimated net worth of $800 million, according to Celebrity Net Worth. In addition to his wrestling and acting careers, he is the co-owner of the XFL.\n\nQuotes\n\nSuccess isn’t overnight. It’s when every day you get a little better than the day before. It all adds up.\n\nI've never gone wrong trusting my gut. It was really the only thing that I had going into acting. I didn't have the background-Juilliard or performing-arts school or anything like that. You can get great people around you, smart minds and great resources, but it’s still from here [points to heart].\n\n\n\nI never wanted to be pigeon-holed or defined as the actor who only worked in one genre. I want to be able to work in all different genres.\n\n\n\nMy philosophy is, it’s always very rewarding when you can make an audience laugh.\n\n\n\nFact Check: We strive for accuracy and fairness. If you see something that doesn't look right, contact us!", "images": ["https://www.biography.com/_assets/design-tokens/biography/static/images/logos/logo.5ec9b18.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/actor-dwayne-johnson-attends-the-black-adam-photocall-at-nh-news-photo-1758907441.pjpeg?crop=0.551xw:0.827xh;0.253xw,0&resize=640:*", "https://www.biography.com/_assets/design-tokens/biography/static/images/logos/network-logo.04aa008.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/sydney-sweeney-attends-the-lionsgate-presentation-during-news-photo-1762354205.pjpeg?crop=0.551xw:0.827xh;0.239xw,0.0673xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/actor-james-dean-poses-for-a-warner-bros-publicity-shot-for-news-photo-1760127578.pjpeg?crop=0.8173xw:1xh;center,top&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://hips.hearstapps.com/hmg-prod/images/cynthia-erivo-attends-the-77th-annual-tony-awards-at-david-news-photo-1728393569.jpg?crop=1.00xw:0.673xh;0,0.0738xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/pictured-eddie-murphy-on-february-15-2015-news-photo-1762808496.pjpeg?crop=0.631xw:0.942xh;0.111xw,0.0577xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/dwayne-the-rock-johnson-reacts-during-a-tag-team-fight-news-photo-1759437406.pjpeg?crop=0.801xw:0.801xh;0.0967xw,0.199xh&resize=980:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://www.biography.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://hips.hearstapps.com/hmg-prod/images/charlie-hunnam-attends-the-2024-met-gala-celebrating-news-photo-1729104230.jpg?crop=1.00xw:0.667xh;0,0.0741xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/mark-kerr-and-dwayne-johnson-attend-the-smashing-machine-news-photo-1759437214.pjpeg?crop=1.00xw:0.753xh;0,0.0528xh&resize=1200:*", "https://www.biography.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://hips.hearstapps.com/hmg-prod/images/once-upon-a-time-in-episode-310-pictured-dwayne-johnson-as-news-photo-1759437732.pjpeg?crop=0.969xw:0.969xh;0.0311xw,0.0311xh&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/claire-danes-attends-the-world-premiere-of-downton-abbey-a-news-photo-1762895763.pjpeg?crop=1.00xw:0.744xh;0,0.0842xh&resize=360:*", "https://hips.hearstapps.com/rover/profile_photos/5fcff581-7d28-4053-b059-6459ddbfb3bf_1723555868.file?fill=1:1&resize=120:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://www.biography.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/megan-moroney-performs-onstage-during-the-2024-cma-music-news-photo-1762964027.pjpeg?crop=0.495xw:0.743xh;0.332xw,0.0745xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/actor-john-candy-poses-for-a-photo-session-on-april-12-1993-news-photo-1760022606.pjpeg?crop=1.00xw:0.804xh;0,0.0536xh&resize=360:*", "https://hips.hearstapps.com/vidthumb/images/inkt-ep04-thumbnail-682dd7da2d33d.jpg?crop=1xw:1xh;center,top", "https://hips.hearstapps.com/hmg-prod/images/cynthia-erivo-at-the-wicked-for-good-new-york-premiere-held-news-photo-1763498079.pjpeg?crop=0.636xw:0.947xh;0.176xw,0.0526xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/of-southern-california-torch-of-liberty-dinner-1995-penny-news-photo-1760551191.pjpeg?crop=1xw:0.87783xh;center,top&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/actor-dwayne-the-rock-johnson-arrives-at-the-world-premiere-news-photo-1759437607.pjpeg?crop=0.936xw:0.874xh;0.0639xw,0.126xh&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/eddie-murphy-attends-the-80th-annual-golden-globe-awards-at-news-photo-1762788000.pjpeg?crop=1.00xw:0.669xh;0,0.0791xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1146827623.jpg?crop=1.00xw:1.00xh;0,0&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://hips.hearstapps.com/rover/profile_photos/b50d4909-0f39-4b73-b482-46d0a9078d40_1682363012.file?fill=1:1&resize=120:*", "https://hips.hearstapps.com/hmg-prod/images/dwayne-johnson-and-lauren-hashian-attend-the-65th-grammy-news-photo-1759437876.pjpeg?crop=0.884xw:0.432xh;0.0656xw,0.0608xh&resize=980:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/mark-kerr-and-dwayne-johnson-attend-the-smashing-machine-news-photo-1759437214.pjpeg?crop=1.00xw:0.753xh;0,0.0528xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.biography.com/actors/dwayne-johnson", "title": "Dwayne Johnson: Biography, Actor, Professional Wrestler", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Dwayne Johnson: Biography, Actor, Professional Wrestler", "description": "Dwayne Johnson rose to fame as professional wrestler “The Rock.” He then became a box-office star in films including “The Scorpion King” and “Fast and the Furious” franchise.", "keywords": "alert", "theme-color": "#000000", "og": {"site_name": "Biography", "title": "Dwayne Johnson Went to ‘Dark Places’ to Transform Into Mark Kerr in ‘The Smashing Machine’", "description": "The 53-year-old worked with Kerr for the film, which arrives in theaters October 3.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/mark-kerr-and-dwayne-johnson-attend-the-smashing-machine-news-photo-1759437214.pjpeg?crop=1.00xw:0.753xh;0,0.0528xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.biography.com/actors/dwayne-johnson", "type": "article"}, "article": {"publisher": "https://www.facebook.com/Biography", "opinion": "false", "section": "Famous Actors", "modified_time": "2025-10-03T19:56:00Z", "published_time": "2025-10-03T19:56:00Z"}, "parsely-metadata": "{\"socialHeadline\":\"Dwayne Johnson Went to ‘Dark Places’ to Transform Into Mark Kerr in ‘The Smashing Machine’ \"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/mark-kerr-and-dwayne-johnson-attend-the-smashing-machine-news-photo-1759437214.pjpeg?crop=0.668xw:1.00xh;0.136xw,0&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/mark-kerr-and-dwayne-johnson-attend-the-smashing-machine-news-photo-1759437214.pjpeg?crop=1.00xw:0.753xh;0,0.0528xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/mark-kerr-and-dwayne-johnson-attend-the-smashing-machine-news-photo-1759437214.pjpeg?crop=0.668xw:1.00xh;0.136xw,0", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/mark-kerr-and-dwayne-johnson-attend-the-smashing-machine-news-photo-1759437214.pjpeg?crop=1.00xw:0.753xh;0,0.0528xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "never", "sailthru.excerpt": "1972–presentLatest News: Dwayne Johnson Stars in The Smashing MachineDwayne Johnson stars in the biographical sports drama The Smashing Machine, portraying real-life MMA fighter Mark Kerr. Directed by Benny Safdie, the film explores Kerr’s fight both inside and outside the ring, showing his struggles with addiction and depression. The 53-year-old actor", "sailthru.tags": "actors,Famous Actors,Biography-US", "sailthru.date": "2025-10-03 19:56:00", "sailthru.socialtitle": "Dwayne Johnson Went to ‘Dark Places’ to Transform Into Mark Kerr in ‘The Smashing Machine’", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1759521360.0, "source": "https://www.biography.com", "summary": ""}