{"url": "en.wikipedia.org/wiki/Bruce_Springsteen", "text": "American rock musician (born 1949)\n\nBruce Frederick Joseph Springsteen (born September 23, 1949) is an American singer, songwriter, and guitarist. Nicknamed \"the Boss\", Springsteen has released 21 studio albums spanning six decades; most of his albums feature the E Street Band, his backing band since 1972. Springsteen is a pioneer of heartland rock, combining commercially successful rock with poetic, socially conscious lyrics that reflect working class American life. He is known for his energetic concerts, some of which last more than four hours.\n\nSpringsteen released his first two albums, Greetings from Asbury Park, N.J. and The Wild, the Innocent & the E Street Shuffle, in 1973. Although both were well received by critics, neither earned him a large audience. He changed his style and achieved worldwide popularity with Born to Run (1975). Springsteen followed with Darkness on the Edge of Town (1978) and The River (1980), Springsteen's first album to top the Billboard 200 chart. After the solo acoustic album Nebraska (1982), he recorded Born in the U.S.A. (1984) with the E Street Band, which became his most commercially successful album and the 23rd-best selling album ever as of 2024. All seven singles from Born in the U.S.A. reached the Top 10 of the Billboard Hot 100, including the title track. Springsteen mostly hired session musicians for the recording of his next three albums, Tunnel of Love (1987), Human Touch (1992), and Lucky Town (1992). He reassembled the E Street Band for Greatest Hits (1995), and recorded the acoustic album The Ghost of Tom Joad (1995) and the EP Blood Brothers (1996) solo.\n\nSpringsteen then released The Rising (2002), which was dedicated to the victims of the September 11 attacks. He released two more folk albums, Devils & Dust (2005) and We Shall Overcome: The Seeger Sessions (2006), his first cover album. Springsteen followed with two more albums with the E Street Band, Magic (2007) and Working on a Dream (2009). His next albums, Wrecking Ball (2012) and High Hopes (2014), topped album charts worldwide. In 2017, 2018 and 2021, Springsteen performed the critically acclaimed show Springsteen on Broadway, in which he performed songs and told stories from his 2016 autobiography; an album version from the Broadway performances was released in 2018. He released the solo album Western Stars in 2019, Letter to You with the E Street Band in 2020, and a solo covers album entitled Only the Strong Survive in 2022. Letter to You reached No. 2 in the US, making Springsteen the first artist to release a top-five album in six consecutive decades.\n\nA prominent musician from the album era, Springsteen has sold more than 140 million records worldwide, making him one of the best-selling music artists of all time. His accolades include 20 Grammy Awards, two Golden Globes, an Academy Award, and a Special Tony Award. He was inducted into the Songwriters Hall of Fame and the Rock and Roll Hall of Fame in 1999, received the Kennedy Center Honors in 2009, was named MusiCares person of the year in 2013, and was awarded the Presidential Medal of Freedom in 2016 and the National Medal of Arts in 2023. In 2010, Rolling Stone ranked Springsteen 23rd on its list of the \"100 Greatest Artists of All Time\", describing him as \"the embodiment of rock and roll\". In 2025, Springsteen became one of only five artists to gross over $2.3 billion in touring thanks to his 2023-2025 Tour with the E Street Band.\n\nEarly life and education [ edit ]\n\nSpringsteen attended Freehold High School in Freehold Borough, New Jersey, where a former teacher described him as a \"loner who wanted nothing more than to play his guitar\". He graduated in 1967, but felt so alienated that he skipped his graduation ceremony. [ 2 ]\n\nBruce Frederick Joseph Springsteen was born at Monmouth Medical Center in Long Branch, New Jersey, on September 23, 1949,[3] to Douglas Frederick \"Dutch\" Springsteen (1924–1998) and his wife, Adele Ann (née Zerilli; 1925–2024).[4] Springsteen's father[5][6] worked as a bus driver and other jobs.[5] His father had mental health issues throughout his life, which worsened in his later life.[7] His mother, who was originally from the Bay Ridge neighborhood of Brooklyn, New York,[8] worked as a legal secretary and was the family's main breadwinner.[9] He is of Dutch, Irish, and Italian descent,[10] and grew up Catholic in Freehold, New Jersey.[11]\n\nSpringsteen's paternal ancestors were among the early Dutch families who, in the 17th century, settled in colonial-era America, then part of the Dutch Republic known as New Netherland.[12] Springsteen's paternal ancestor, John Springsteen, was a patriot in the American Revolution, which evolved into the Continental Army during the American Revolutionary War. The Springsteen surname originates in Groningen, a province in the Netherlands,[13] and is topographic, translating to \"jump stone\" and meaning a stepping stone used on unpaved streets or between two houses.[14][15] Springsteen's Italian maternal grandfather was born in Vico Equense and emigrated through Ellis Island.[16] He arrived in the United States unable to read or write English, but went on to become a lawyer and impressed the young Springsteen as being \"larger than life\".[17]\n\nSpringsteen has two younger sisters, Virginia (born 1951) and Pamela (born c. 1962). Pamela Springsteen worked briefly as an actress and later as a photographer; she took photos for three Springsteen albums, Human Touch, Lucky Town, and The Ghost of Tom Joad.[18]\n\nSpringsteen attended the St. Rose of Lima Catholic School in Freehold, where he was at odds with the nuns and rebelled against the strictures imposed upon him, though some of his later music reflected a Catholic ethos and included Irish Catholic hymns with a rock music twist.[19] In 2012, Springsteen said that it was his Catholic upbringing rather than his political ideology that most influenced his music. He said his faith gave him a \"very active spiritual life\" but joked that this \"made it very difficult sexually\" and added \"once a Catholic, always a Catholic\".[7][20] He grew up hearing fellow New Jersey singer Frank Sinatra on the radio, and became interested in being a musician by the age of seven after seeing Elvis Presley's performances on The Ed Sullivan Show in 1956 and 1957. Soon after, his mother rented him a guitar from Mike Diehl's Music in Freehold for $6 a week and took a few weeks of guitar lessons, but quit after it failed to provide him with the instant gratification he desired.\n\nIn ninth grade, Springsteen entered Freehold High School, a public high school, but did not fit in there either. A former teacher said Springsteen was a \"loner who wanted nothing more than to play his guitar\". He graduated in 1967, but felt so alienated that he skipped his graduation ceremony.[2] He briefly attended Ocean County College, but dropped out.[19] At age 19, Springsteen was called for his draft physical, but failed it because of a concussion he suffered in a motorcycle accident two years earlier combined with his behavior at induction, both of which reportedly made him unacceptable for military service. In failing his examination, Springsteen likely avoided service in the Vietnam War.[22] In 1969, when he was 20 years old, Springsteen's parents and sister Pamela moved to San Mateo, California; he and his sister Virginia, who was married and pregnant at the time, remained in Freehold.[23][24][25][26]\n\nCareer [ edit ]\n\n1964–1972: Early career [ edit ]\n\nIn 1964, Springsteen saw the Beatles' televised appearances on The Ed Sullivan Show. Inspired, he bought his first guitar for $18.95 at the Western Auto appliance store.[27] Thereafter, he started playing for audiences with a band called the Rogues at local venues, including Elks Lodge in Freehold. Later that year, his mother took out a loan to buy him a $60 Kent guitar, an act he later memorialized in his song \"The Wish\". In 1965, he went to the house of Tex and Marion Vinyard, who sponsored young bands in town. They helped him become the lead guitarist and subsequently one of the lead singers of the Castiles, a band that recorded two original songs at a public recording studio in Brick Township and played a variety of venues, including Cafe Wha? in Greenwich Village. Marion Vinyard said she believed the young Springsteen when he promised he would make it big.[31] In the late 1960s, Springsteen performed briefly in a power trio known as Earth, who played in various clubs in New Jersey and at a major show at the Hotel Diplomat in New York City.\n\nFrom 1969 through early 1971, Springsteen performed with the band Child, which later changed its name to Steel Mill and included Danny Federici, Vini Lopez, Vinnie Roslin, and later Steven Van Zandt and Robbin Thompson. Steel Mill performed at various Jersey Shore venues and also outside of New Jersey, in Richmond, Virginia;[32] Nashville, Tennessee; and California, and gathered a cult following. In his January 1970 review of Steel Mill's show at The Matrix, music critic Philip Elwood wrote in the San Francisco Examiner that he had \"never been so overwhelmed by a totally unknown talent\"[33] and called Steel Mill \"the first big thing that's happened to Asbury Park since the good ship Morro Castle burned to the waterline of that Jersey beach in '34\". Elwood praised the band's \"cohesive musicality\" and called Springsteen \"a most impressive composer\".[34] In San Mateo, Steel Mill recorded three original Springsteen songs at Pacific Recording.[35]\n\nThis was different, shifted the lay of the land. Four guys, playing and singing, writing their own material. [...] Rock 'n' roll came to my house where there seemed to be no way out [...] and opened up a whole world of possibilities. —Springsteen on the impact of the Beatles [ 27 ]\n\nAs Springsteen sought to shape a unique and genuine musical and lyrical style, he performed with the bands Dr. Zoom & the Sonic Boom from early-to-mid-1971, the Sundance Blues Band in mid-1971, and the Bruce Springsteen Band from mid-1971 to mid-1972.[36] His songwriting ability included, as his future record label described it in early publicity campaigns, \"more words in some individual songs than other artists had in whole albums\". He brought his skills to the attention of several people who went on to prove influential to his career development, including managers Mike Appel and Jim Cretecos, who in turn brought him to the attention of John Hammond, a talent scout at Columbia Records. In May 1972, Springsteen auditioned for Hammond.[37]\n\nIn October 1972, Springsteen formed a new band for the recording of his debut album, Greetings from Asbury Park, N.J. The band eventually became known as the E Street Band, although the name was not used until September 1974.[38][39] Springsteen acquired the nickname \"the Boss\" during this period, since he took on the task of collecting his band's nightly pay and distributing it among his bandmates.[40] The nickname also reportedly sprang from games of Monopoly, which Springsteen played with other Jersey Shore musicians.[41]\n\n1972–1974: Initial struggle [ edit ]\n\nSpringsteen was signed to Columbia Records in 1972 by John Hammond, who had signed Bob Dylan to the same label a decade earlier. His debut album, Greetings from Asbury Park, N.J., was released in January 1973, establishing him as a critical favorite.[42] Because of Springsteen's lyrical poeticism and folk rock-rooted music exemplified on tracks like \"Blinded by the Light\" and \"For You\", and his connection with Hammond and Columbia Records, critics initially compared Springsteen to Bob Dylan. \"He sings with a freshness and urgency I haven't heard since I was rocked by 'Like a Rolling Stone'\", Crawdaddy magazine editor Peter Knobler wrote in a March 1973 profile of Springsteen's that included photographs taken by Ed Gallucci.[43][44] Knobler is the journalist who discovered Springsteen in the rock press.[45] Crawdaddy was an early champion of Springsteen; Knobler profiled him in the magazine three times, in 1973, 1975, and 1978.[46] In June 1976, Springsteen and the E Street Band acknowledged the magazine's support by giving a private performance at the magazine's 10th Anniversary Party in New York City.[47]\n\nSpringsteen's second album, The Wild, the Innocent & the E Street Shuffle, was released in November 1973, eleven months after Greetings from Asbury Park. Like Springsteen's inaugural album, The Wild, the Innocent & the E Street Shuffle was met with critical acclaim but limited commercial success. Springsteen's songs became grander in form and scope with the E Street Band providing a less folksy, more rhythm and blues vibe, and lyrics that romanticized teenage street life. \"4th of July, Asbury Park (Sandy)\" and \"Incident on 57th Street\" became fan favorites, while \"Rosalita (Come Out Tonight)\" continues to rank among Springsteen's most beloved concert numbers. \"Rosalita\" is the ninth-most played song in Springsteen's concert catalog; as of June 2020, he has played it live 809 times.[48]\n\nIn February 1974, the Stone Pony, a music venue and bar, opened on Ocean Avenue in Asbury Park, and Springsteen played there regularly. Several years later, in the early 1980s, prior to the start of the Born in the U.S.A. Tour in June 1984, Springsteen also met his second and current wife Patti Scialfa at the Stone Pony during her performance there. A regular venue for Springsteen, Jon Bon Jovi, Southside Johnny, and other acts from the area, the Stone Pony has since been described as \"an integral part of music history for decades.\"[49]\n\nAfter seeing Springsteen's performance at the Harvard Square Theater in 1974, music critic Jon Landau wrote that he \"saw rock and roll future, and its name is Bruce Springsteen.\"[50] Springsteen met Landau in Boston a month prior and the two became close friends; Landau subsequently became the co-producer of Springsteen's next album, Born to Run, in February 1975. As Springsteen's last-ditch effort at a commercially viable record, Springsteen became bogged down in the recording process while striving for a \"Wall of Sound\" production. When his manager, Mike Appel, orchestrated the release of an early mix of \"Born to Run\" to nearly a dozen radio stations, anticipation built toward the album's release.\n\nThe album took over 14 months to record, with six months spent recording \"Born to Run\" alone. E Street Band members David Sancious and Ernest Carter departed after \"Born to Run\" was completed, and were replaced by Roy Bittan and Max Weinberg on piano and drums, respectively. Springsteen battled with anger and frustration throughout the sessions, saying he heard \"sounds in [his] head\" that he could not explain to the others in the studio.[60] He also dealt with two producers who had opposing views. During the recording of \"Tenth Avenue Freeze-Out\", Steven Van Zandt conceived the horn parts for the horn players on the spot in the studio after Springsteen and Bittan had failed to write proper ones by the time the players arrived to record. He joined the E Street Band shortly thereafter. Mixing for Born to Run lasted until July 20, 1975, just before a concert tour began.\n\nBorn to Run was mastered while the band was on the road. Springsteen was furious at the initial acetate, throwing it into the swimming pool of the hotel he was staying at. He contemplated scrapping the entire project and re-recording it live before he was stopped by Landau. Springsteen was sent multiple mixes as he was on the road and rejected all of them until August when he approved the final one.\n\n1975–1983: Born to Run and breakthrough success [ edit ]\n\nSpringsteen and the E Street Band in February 1977\n\nBorn to Run was released in August 1975. It proved to be a breakthrough album[70][71][72] that catapulted Springsteen to worldwide fame.[73] The album peaked at No. 3 on the Billboard Top LPs & Tape chart, eventually going seven times platinum in the US. The album's two singles, \"Born to Run\" and \"Tenth Avenue Freeze-Out\" reached No. 23 and 83, respectively, on the Billboard Hot 100.[76] According to author Louis Masur, the album's success was tied to the fears of growing old held by a generation of late teenagers. In October 1975, Springsteen appeared on the covers of both Newsweek and Time in the same week, becoming the first artist to do so.[78] The magazines' cover stories resulted in a media backlash, as critics began wondering if Springsteen was for real or the product of record company promotion.[80][81] Springsteen was hurt by the backlash and disliked his newfound attention. When the E Street Band arrived in London for their first concerts outside North America, Springsteen personally tore down promotional posters in the lobby of the Hammersmith Odeon.\n\nA legal battle with Appel kept Springsteen out of the studio for nearly a year, during which time he kept the E Street Band together through extensive touring across the U.S. and continued writing new material.[86] Reaching a settlement with Appel in May 1977, Springsteen returned to the studio, and the subsequent nine-month recording sessions with the E Street Band produced Darkness on the Edge of Town. The record stripped the \"Wall of Sound\" production of Born to Run for a rawer hard rock sound. Its lyrics focus on ill-fortuned people who fight back against overwhelming odds.\n\nReleased in June 1978, Darkness on the Edge of Town sold fewer copies than its predecessor,[93] but remained on the Billboard chart for 167 weeks, selling three million copies in the U.S. Its three singles—\"Prove It All Night\", \"Badlands\", and \"The Promised Land\"—performed modestly. The supporting Darkness Tour was Springsteen's largest up to that point and featured shows that lasted upwards of three hours in length. The staff of Ultimate Classic Rock said the tour solidified Springsteen and the E Street Band as \"one of the most exciting live acts in rock 'n' roll\".[97]\n\nBy the late 1970s, Springsteen earned a reputation as a songwriter whose material could provide hits for other bands. Manfred Mann's Earth Band had achieved a U.S. No. 1 pop hit with a heavily rearranged version of Greetings' \"Blinded by the Light\" in early 1977. Patti Smith reached No. 13 with her version of Springsteen's unreleased \"Because the Night\" with revised lyrics by Smith in 1978. The Pointer Sisters hit No. 2 in 1979 with Springsteen's then unreleased \"Fire\". Between 1976 and 1978, Springsteen provided four compositions to Southside Johnny and the Asbury Jukes, including \"The Fever\" and \"Hearts of Stone\", and collaborated on four more with Steven Van Zandt, producer of their first three albums. In September 1979, Springsteen and the E Street Band joined the Musicians United for Safe Energy anti-nuclear power collective at Madison Square Garden for two nights, playing an abbreviated set while premiering two songs from his upcoming album. The subsequent No Nukes live album, as well as the following summer's No Nukes documentary film, represented the first official recordings and footage of Springsteen's fabled live act and Springsteen's first tentative dip into political involvement.[100]\n\nThe recording sessions for Springsteen's fifth album, The River, lasted 18 months. The 20-track double album was an attempt at capturing the energy and feel of the E Street Band playing live on stage[103] and featured a mix of party songs and introspective ballads.[104] Released in October 1980, The River became Springsteen's biggest and fastest-selling album yet, topping the U.S. Billboard chart. The single \"Hungry Heart\" became his first top ten single as a performer, reaching number five, while \"Fade Away\" reached No. 20.\n\nSeveral songs on The River foreshadowed the direction of Springsteen's next record, the minimalist, folk-inspired solo effort Nebraska, released in September 1982. Springsteen recorded the songs on the album as demo recordings at his home in Colts Neck, New Jersey, intending to re-record them with the E Street Band, but after poor test sessions he decided to release the recordings as is.[109] The album chronicled dark hardships felt by everyday blue-collar workers, as well as bleak tales of criminals, cops, and gang wars. Nebraska sold minimally compared to Springsteen's three previous albums, but reached No. 3 on the Billboard chart. Nevertheless, it surprised critics, who praised it as a brave artistic statement.\n\n1984–1986: Born in the U.S.A. and cultural phenomenon [ edit ]\n\nSpringsteen performing in Oslo, Norway, in May 1981\n\nIn 1984, Springsteen released Born in the U.S.A., which sold 30 million worldwide, and became one of the best-selling albums of all time,[113] with seven singles hitting the top ten. The title track was a bitter commentary on the treatment of Vietnam veterans, some of whom were Springsteen's friends. The lyrics in the verses were entirely unambiguous when listened to, but the anthemic music and the title of the song made it hard for many, from politicians to the common person, to get the lyrics—except those in the chorus, which could be read many ways.[114] The song made a huge political impact, as he was advocating for the rights of the common working-class man.[115]\n\nThe song was widely misinterpreted as patriotic, and in connection with the 1984 presidential campaign became the subject of considerable folklore. In 1984, conservative columnist George Will attended a Springsteen concert and then wrote a column praising Springsteen's work ethic. Six days after the column's publication, then President Ronald Reagan, in a campaign rally in Hammonton, New Jersey, made brief mention of the song, saying, \"America's future rests in a thousand dreams inside your hearts. It rests in the message of hope in the songs of a man so many young Americans admire—New Jersey's own, Bruce Springsteen.\" Two nights later, at a concert in Pittsburgh, Springsteen told the crowd, \"Well, the president was mentioning my name in his speech the other day and I kind of got to wondering what his favorite album of mine must've been, you know? I don't think it was the Nebraska album. I don't think he's been listening to this one.\" He then began playing \"Johnny 99\", with its allusions to closing factories and criminals.[116]\n\n\"Dancing in the Dark\" was the biggest of seven hit singles from Born in the U.S.A., peaking at No. 2 on the Billboard singles chart. The video for the song showed a young Courteney Cox dancing on stage with Springsteen, which helped start the actress's career. The song \"Cover Me\" was written by Springsteen for Donna Summer, but his record company persuaded him to keep it for the new album. A big fan of Summer's work, Springsteen wrote another song for her, \"Protection\". Videos for Born in the U.S.A. were directed by Brian De Palma and John Sayles. Springsteen played on the \"We Are the World\" song and album in 1985. His live cover of the Jimmy Cliff song \"Trapped\" from that album received moderate airplay on US Top 40 stations as well as reaching No. 1 on the Billboard Top Rock Tracks chart.[117]\n\nThe Born in the U.S.A. period represented the height of Springsteen's visibility in popular culture and the broadest audience he would ever reach (aided by the release of Arthur Baker's dance mixes of three of the singles). From June 15 to August 10, 1985, all seven of his albums appeared on the UK Albums Chart: the first time an artist had charted their entire back catalogue simultaneously.[118] Live/1975–85, a five-record box set (also on three cassettes or three CDs), was released near the end of 1986 and became the first box set to debut at No. 1 on the U.S. album charts. It is one of the most commercially successful live albums of all time, ultimately selling 13 million units in the U.S. During the 1980s, several Springsteen fanzines were launched, including Backstreets magazine.[119]\n\n1987–1999: Tunnel of Love, Academy Award and Hall of Fame [ edit ]\n\nSpringsteen released the much more sedate and contemplative Tunnel of Love in October 1987. The album is a mature reflection on the many faces of love found, lost and squandered, and the full sound of the E Street Band is included only selectively. Although it sold less than Born in the U.S.A., it was a commercial success, reaching No. 1 on the Billboard 200.[121] On July 19, 1988, Springsteen's concert in East Germany attracted 300,000 spectators. Journalist Erik Kirschbaum called the concert \"the most important rock concert ever, anywhere\" in his 2013 book Rocking the Wall. Bruce Springsteen: The Berlin Concert That Changed the World. The concert had been conceived by the Socialist Unity Party's youth wing in an attempt to placate the youth of East Germany, who were hungry for more freedom and the popular music of the West. However, it is Kirschbaum's opinion that the success of the concert catalyzed opposition to the regime in East Germany, and helped contribute to the fall of the Berlin Wall the following year.[122]\n\nLater in 1988, Springsteen headlined the worldwide Human Rights Now! tour for Amnesty International. In October 1989, he dissolved the E Street Band.[123] In 1992, after risking fan accusations of \"going Hollywood\" by moving to Los Angeles and working with session musicians, Springsteen released two albums at once: Human Touch and Lucky Town. An electric band appearance on the acoustic MTV Unplugged television program (later released as In Concert/MTV Plugged) was poorly received and cemented fan dissatisfaction.[125]\n\nU.S. President Bill Clinton with Springsteen in December 1997\n\nSpringsteen won an Academy Award in 1994 for his song \"Streets of Philadelphia\", which appeared on the soundtrack to the film Philadelphia. The video for the song shows Springsteen's actual vocal performance, recorded using a hidden microphone, to a prerecorded instrumental track. This technique was developed on the \"Brilliant Disguise\" video. In 1995, after temporarily re-organizing the E Street Band for a few new songs recorded for his first Greatest Hits album (a recording session that was chronicled in the documentary Blood Brothers), and also one show at Tramps in New York City, he released his second folk album, The Ghost of Tom Joad. The album was inspired by John Steinbeck's The Grapes of Wrath and by Journey to Nowhere: The Saga of the New Underclass, a book by Pulitzer Prize-winning author Dale Maharidge and photographer Michael Williamson. Rolling Stone characterized the album as Springsteen's first overtly social statement since Born in the U.S.A., drawing a strong parallel to Nebraska, due to its acoustic nature and Depression-era storytelling sensibility reminiscent of Woody Guthrie. The album is noted for its bleak, unrelenting atmosphere, focusing on characters who are broken by life's hardships, with few escapes and little musical relief from the dark, desolate scenarios portrayed.[128]\n\nSpringsteen supported the album on the lengthy, worldwide, small-venue solo acoustic Ghost of Tom Joad Tour. The tour presented many of his older songs in drastically reshaped acoustic form. Springsteen explicitly reminded his audiences to \"shut the fuck up\" and not to clap during the performances.[129] Following the Ghost of Tom Joad Tour, Springsteen moved from California back to New Jersey with his family.[130] In 1998, he released the sprawling, four-disc box set of outtakes, Tracks. Later, he would acknowledge that the 1990s were musically a \"lost period\" for him: \"I didn't do a lot of work. Some people would say I didn't do my best work.\"[131]\n\nSpringsteen was inducted into the Rock and Roll Hall of Fame in 1999 by Bono (the lead singer of U2), a favor he returned in 2005.[132] In 1999, Springsteen and the E Street Band reunited and began their extensive Reunion Tour, which lasted over a year. Highlights included a record sold-out, 15-show run at Continental Airlines Arena in East Rutherford, New Jersey and a ten-night, sold-out engagement at New York City's Madison Square Garden. A new song played at these shows, \"American Skin (41 Shots)\" (about the police shooting of Amadou Diallo), proved controversial.\n\n2002–2007: The Rising, Devils & Dust, and other releases [ edit ]\n\nThe scene outside Giants Stadium during Springsteen's record-setting, 10-night stand at the stadium on The Rising Tour in July 2003\n\nIn 2002, Springsteen released his first studio effort with the full band in 18 years, The Rising, produced by Brendan O'Brien. The album, mostly a reflection on the September 11 attacks, was a critical and popular success. The title track gained airplay in several radio formats, and the record became Springsteen's best-selling album of new material in 15 years. Kicked off by an early-morning Asbury Park appearance on The Today Show, The Rising Tour commenced; the band barnstormed through a series of single-night arena stands in the U.S. and Europe. Springsteen played an unprecedented 10 nights at Giants Stadium in New Jersey.[134]\n\nThe Rising won the Grammy for Best Rock Album and was nominated for Album of the Year at the 45th Annual Grammy Awards in 2003. In addition, \"The Rising\" won the Grammy for Best Rock Song and for Best Male Rock Vocal Performance, and nominated for Song of the Year.[135] At the ceremony, Springsteen performed the Clash's \"London Calling\" with Elvis Costello, Dave Grohl, and E Street Band member Steven Van Zandt and No Doubt's bassist, Tony Kanal, in tribute to Joe Strummer.[136] In 2004, Springsteen and the E Street Band participated in the Vote for Change tour, with John Mellencamp, John Fogerty, the Dixie Chicks, Pearl Jam, R.E.M., Bright Eyes, the Dave Matthews Band, Jackson Browne, and other musicians.[137]\n\nAn acoustic guitar number by Springsteen during the Devils & Dust Tour at the Festhalle Frankfurt in June 2005\n\nThe solo record Devils & Dust was released in April 2005. It is a low-key, mostly acoustic album, in the same vein as Nebraska and The Ghost of Tom Joad. Some of the material was written almost 10 years earlier, during or shortly after the Ghost of Tom Joad Tour; a few of the songs had been performed at that time but unreleased.[138] The title track concerns an ordinary soldier's feelings and fears during the Iraq War. The album topped the charts in ten countries. Springsteen began the solo Devils & Dust Tour at the same time as the album's release, playing both small and large venues. Attendance was disappointing in a few regions, and except in Europe tickets were easier to get than in the past.[139]\n\nIn April 2006, Springsteen released We Shall Overcome: The Seeger Sessions, an American roots music project focused around a big folk sound treatment of 15 songs popularized by the radical musical activism of Pete Seeger. A tour began the same month, with the 18-strong ensemble of musicians dubbed the Seeger Sessions Band (and later shortened to the Sessions Band). The tour proved very popular in Europe, selling out everywhere and receiving some excellent reviews,[140] including its opening act in New Orleans, Louisiana following Hurricane Katrina,[141] but newspapers reported that a number of U.S. shows suffered from sparse attendance.[142][143][144]\n\nSpringsteen's next album, Magic, was released in October 2007. Recorded with the E Street Band, it had 10 new Springsteen songs plus \"Long Walk Home\", performed once with the Sessions band, and a hidden track (the first included on a Springsteen studio release), \"Terry's Song\", a tribute to Springsteen's long-time assistant Terry Magovern, who died in July 2007.[145] Magic debuted at No. 1 in the U.S.,[146] Ireland and the UK. Springsteen supported the album on the Magic Tour, his first tour with the E Street Band since 2003.[148] It was the final tour for longtime E Street member Danny Federici, who died in 2008.\n\n2008–2011: Political involvement, Super Bowl XLIII, and Kennedy Center Honors [ edit ]\n\nSpringsteen supported Barack Obama's 2008 presidential campaign.[150] He gave solo acoustic performances in support of Obama's campaign throughout 2008,[151] culminating with a November 2 rally at which he debuted the song \"Working on a Dream\" in a duet with Scialfa.[152] Following Obama's electoral victory on November 4, Springsteen's song \"The Rising\" was the first song played over the loudspeakers after Obama's victory speech in Chicago's Grant Park. Springsteen was the musical opener for the Obama Inaugural Celebration on January 18, 2009, which was attended by over 400,000 people.[153] He performed \"The Rising\" with an all-female choir. Later he performed Woody Guthrie's \"This Land Is Your Land\" with Pete Seeger.\n\nOn January 11, 2009, Springsteen won the Golden Globe Award for Best Song for \"The Wrestler\", from the Darren Aronofsky film by the same name.[154] After receiving a heartfelt letter from lead actor Mickey Rourke, Springsteen supplied the song for the film for free.[155]\n\nSpringsteen performed at the halftime show at Super Bowl XLIII on February 1, 2009,[156] agreeing to perform after having declined on prior occasions.[157] A few days before the game, Springsteen gave a rare press conference at which he promised a \"twelve-minute party\".[158][159] It has been reported that this press conference was Springsteen's first press conference in more than 25 years.[160] His 12-minute 45-second set, with the E Street Band and the Miami Horns, included abbreviated renditions of \"Tenth Avenue Freeze-Out\", \"Born to Run\", \"Working on a Dream\", and \"Glory Days\", the latter complete with football references in place of the original baseball-themed lyrics. The set of appearances and promotional activities led Springsteen to say, \"This has probably been the busiest month of my life.\"[161]\n\nFireworks go off at the conclusion of the \"E! Street! Band!\" exhortation during the final shows at Giants Stadium in October 2009\n\nWorking on a Dream, dedicated to Federici, was released in late January 2009.[158] The supporting Working on a Dream Tour ran from April to November 2009. The band performed five final shows at Giants Stadium, opening with a new song highlighting the historic stadium, and Springsteen's Jersey roots, named \"Wrecking Ball\".[162]\n\nSpringsteen received the Kennedy Center Honors on December 6, 2009. President Obama gave a speech in which he asserted that Springsteen had incorporated the lives of regular Americans into his expansive palette of songs. Obama added that Springsteen's concerts were not just rock-and-roll concerts, but \"communions\". The event included musical tributes from Melissa Etheridge, Ben Harper, John Mellencamp, Jennifer Nettles, Sting, and Eddie Vedder.[163]\n\nThe 2000s ended with Springsteen named one of eight Artists of the Decade by Rolling Stone magazine[164] and with Springsteen's tours ranking him fourth among artists in total concert grosses for the decade.[165]\n\nClarence Clemons, the E Street Band's saxophonist and founding member, died on June 18, 2011, of complications from a stroke.[166]\n\n2012–2018: Autobiography and Broadway show [ edit ]\n\nSpringsteen's 17th studio album, Wrecking Ball, was released in March 2012. The album consists of eleven tracks plus two bonus tracks. Three songs previously only available as live versions, \"Wrecking Ball\", \"Land of Hope and Dreams\", and \"American Land\", appear on the album.[167] Wrecking Ball became Springsteen's tenth No. 1 album in the U.S., tying him with Elvis Presley for third most No. 1 albums of all time, behind the Beatles (19) and Jay Z (12) as of 2009.[168] The supporting Wrecking Ball Tour shortly after its release. On July 31, 2012, in Helsinki, Finland, Springsteen performed his longest concert at four hours and six minutes with 33 songs.[169]\n\nIn 2012, Springsteen campaigned for President Barack Obama's re-election in the 2012 presidential election, appearing and performing at Obama rallies in Ohio, Pittsburgh, Iowa, Virginia, and Wisconsin. At the rallies, he briefly spoke to the audience and performed a short acoustic set that included a newly written song titled \"Forward\".[170][171][172]\n\nSpringsteen in 2012\n\nAt year's end, the Wrecking Ball Tour was named Top Draw by the Billboard Touring Awards for having the highest attendance of any tour that year. Financially, the tour grossed second to the one by Roger Waters.[173] Springsteen finished second only to Madonna as the top money maker of 2012, with $33.44 million.[174] The Wrecking Ball album, along with the single \"We Take Care of Our Own\", was nominated for three Grammy Awards, including Best Rock Performance and Best Rock Song for \"We Take Care of Our Own\" and Best Rock Album.[175][176] Rolling Stone named Wrecking Ball the number one album of 2012 on their Top 50 list.[177]\n\nIn late July 2013, the documentary Springsteen & I, directed by Baillie Walsh and produced by Ridley Scott, was released simultaneously via a worldwide cinema broadcast in over 50 countries and in over 2000 movie theaters.[178]\n\nSpringsteen performing during the Stand Up for Heroes special in 2014\n\nSpringsteen released his eighteenth studio album, High Hopes, in January 2014. The first single and video were of a newly recorded version of the song \"High Hopes\", which Springsteen had previously recorded in 1995. The album was the first by Springsteen in which all songs are either cover songs, newly recorded outtakes from previous records, or newly recorded versions of songs previously released. The 2014 E Street Band touring lineup appears on the album, including material they had recorded with Clemons and Federici before their deaths.[179] High Hopes became Springsteen's eleventh No. 1 album in the US.[180] It was his tenth No. 1 in the UK, tying him for fifth all-time with the Rolling Stones and U2.[181] Rolling Stone named High Hopes the second best album of the year (behind U2's Songs of Innocence) on their Top 50 Albums of 2014 list.[182]\n\nSpringsteen made his acting debut in the final episode of season three of Van Zandt's show Lilyhammer, which was named \"Loose Ends\" after a Springsteen song on the Tracks album.[183]\n\nOn August 6, 2015, Springsteen performed \"Land of Hope and Dreams\" and \"Born to Run\" on the final episode of The Daily Show with Jon Stewart, as Stewart's final 'Moment of Zen'. On October 16, to celebrate the 35th anniversary of The River, Springsteen announced The Ties That Bind: The River Collection box set. Released on December 4, it contains four CDs (including many previously unreleased songs) and three DVDs (or Blu-ray) along with a 148-page coffee table book. In November 2015, \"American Skin (41 Shots)\" was performed with John Legend at Shining a Light: A Concert for Progress on Race in America.[184] Springsteen made his first appearance on Saturday Night Live since 2002 on December 19, 2015, performing \"Meet Me in the City\", \"The Ties That Bind\", and \"Santa Claus Is Comin' to Town\".[185]\n\nSpringsteen and the E Street Band performing at Wembley Stadium in June 2016\n\nThe River Tour 2016 began in January 2016 in support of The Ties That Bind: The River Collection box set. All first-leg shows in North America included an in-sequence performance of the entire The River album along with other songs from Springsteen's catalog, and all dates were recorded and made available for purchase.[186] In April 2016, Springsteen was one of the first artists to boycott North Carolina's anti-transgender bathroom bill.[187]\n\nChapter and Verse, a compilation from throughout Springsteen's career dating back to 1966, was released in September 2016. The same month, Simon & Schuster published his 500-page autobiography, Born to Run. The book rose quickly to the top of The New York Times Best Sellers List.[188]\n\nOn September 7, 2016, at Citizens Bank Park in Philadelphia, Pennsylvania, Springsteen performed for four hours and four minutes, his longest-ever show in the United States.[189][190] The River Tour 2016 was the top-grossing worldwide tour of 2016; it pulled in $268.3 million globally and was the highest-grossing tour since 2014 for any artist topping Taylor Swift's 2015 tour, which grossed $250.1 million.[191]\n\nSpringsteen supported Hillary Clinton's 2016 presidential campaign by performing an acoustic set of \"Thunder Road\", \"Long Walk Home\" and \"Dancing in the Dark\" at a rally in Philadelphia on November 7, 2016. On November 22, Springsteen was presented with the Presidential Medal of Freedom award by Barack Obama.[192][193] On January 12, 2017, Springsteen and Scialfa performed a special 15-song acoustic set for Barack and Michelle Obama at the White House's East Room two days before the president gave his farewell address to the nation.[194][195]\n\nSpringsteen during a performance of Springsteen on Broadway in 2017\n\nSpringsteen on Broadway, an eight-week run at the Walter Kerr Theatre on Broadway in New York City in fall 2017, was announced in June 2017.[196] The show included Springsteen reading excerpts from his 2016 autobiography Born to Run and performing other spoken reminiscences.[197] Originally scheduled to run from October 12 through November 26, the show was extended three times; the last performance occurred on December 15, 2018.[198][199][200] For Springsteen's production of Springsteen on Broadway, he was honored with a Special Tony Award at the 72nd Tony Awards in 2018.[201]\n\nThe live album Springsteen on Broadway was released in December 2018. It reached the top 10 in more than 10 countries and No. 11 in the United States.[202]\n\n2019–2021: Western Stars [ edit ]\n\nSpringsteen's nineteenth studio album, Western Stars, was released in June 2019.[203]\n\nIt was announced on July 23, 2019, that Springsteen would premiere his film, Western Stars, at the Toronto Film Festival in September 2019. He co-directed the film along with longtime collaborator Thom Zimny. The film features Springsteen and his backing band performing the music from Western Stars to a live audience.[204][205] The film was released in theaters in October 2019, and the film's soundtrack, Western Stars – Songs from the Film, was also released that day.[206]\n\nOn May 29, 2020, Springsteen appeared remotely during a livestream, no-audience concert by the Dropkick Murphys at Fenway Park in Boston. Springsteen performed the Dropkick Murphys song \"Rose Tattoo\" and his song \"American Land\", sharing co-vocals with Ken Casey on both songs. The event marked the first music performance without an in-person audience at a major U.S. arena, stadium or ballpark during the COVID-19 pandemic.[207] The livestream attracted over 9 million viewers and raised over $700,000 through charitable donations.[208]\n\nSpringsteen's twentieth studio album, Letter to You, was released in October 2020.[209][210] An accompanying documentary of the same name was released the same month.[211][212] The documentary was shot exclusively in black and white and was directed by Thom Zimny.[212] The album was supported by two singles, \"Letter to You\" and \"Ghosts\", released in September.[209][210][213] In November, Springsteen was featured as a guest singer for Bleachers' single, \"Chinatown\".[214] Letter to You reached No. 2 in the US, making Springsteen the first artist to release a top-five album in six consecutive decades.[215]\n\nSpringsteen and the E Street Band were musical guests on the December 12, 2020, episode of Saturday Night Live, where they performed \"Ghosts\" and \"I'll See You in My Dreams\". This marked the band's first performance since 2017 and their first to promote Letter to You. Garry Tallent and Soozie Tyrell opted to remain at home due to COVID-19 concerns; this was the first time Tallent had missed a performance with the band, and Jack Daley of the Disciples of Soul filled in for him.[216]\n\nIn February 2021, it was announced that Springsteen was releasing an eight-part podcast on Spotify titled Renegades: Born in the USA that would feature himself in conversation with Barack Obama discussing a wide range of topics including family, race, marriage, fatherhood, and the state of the U.S.[217] Springsteen performed co-lead vocals and guitar on John Mellencamp's song \"Wasted Days\", released in September 2021.[218]\n\nOn June 7, 2021, Springsteen announced that his Springsteen on Broadway shows would return for a limited run at Jujamcyn's St. James Theatre beginning on June 26, 2021.[219] In an interview with E Street Radio's Jim Rotolo on June 10, 2021, Springsteen said that he did not plan on playing any shows in 2021 but was talked into the Broadway shows by a \"friend\".[220] During the same interview, Springsteen also announced an upcoming collaboration with the Killers.[221]\n\nOn September 11, 2021, Springsteen performed \"I'll See You in My Dreams\" in tribute to the victims of the September 11 attacks.[222]\n\nOn December 13, 2021, Springsteen gave a surprise four-song performance at the John Henry's Friends benefit concert for children diagnosed with Autism where he was joined by Steve Earle and the Dukes as his backing band.[223] On December 16, 2021, Springsteen sold the masters of his entire catalog and the coinciding music publishing rights to Sony Music for $500 million. This topped what Bob Dylan and Taylor Swift received for their catalogs by $200 million.[224] This sale, along with his Broadway shows and projects with Obama, helped him top the Rolling Stone list of the highest-paid musicians of 2021.[225]\n\nSince 2022: Only the Strong Survive, collaborations, touring, and The Lost Albums [ edit ]\n\nOn May 24, 2022, it was announced that he would be launching an international tour with the E Street Band in 2023, the first such since 2017.[226]\n\nSpringsteen performing in Seattle, February 2023\n\nIn November, Springsteen released his twenty-first studio album, Only the Strong Survive, a covers album of classic soul music songs from the 1960s and 1970s.[227] To promote the album, Springsteen performed on The Tonight Show Starring Jimmy Fallon in mid-November, along with a special Thanksgiving episode on November 24.[228][229][230]\n\nOn February 1, 2023, Springsteen and the E Street band launched their first tour in six years, due to conclude in July 2025.\n\nIn a November 2022 interview, Springsteen confirmed that he planned a Volume 2 of the album; at the time, he said it was \"probably three-quarters recorded\".[231][232]\n\nSpringsteen provided vocals on the song \"History Books\" by the Gaslight Anthem, the title track on the band's October 2023 album.[233] The same month, he collaborated with Bryce Dessner on \"Addicted to Romance\", an original song for the She Came to Me soundtrack album.[234][235] In September, Springsteen announced the postponement of eight shows scheduled for September. Springsteen was undergoing treatment for peptic ulcer disease and doctors recommended he not perform live. A few days later, the remaining twelve shows scheduled for November through December 2023 were also postponed to dates in March and April, and between August and November 2024. In total, twenty-nine shows on the tour were postponed due to Springsteen's illness along with Springsteen and other members of the band having COVID-19.[236][237][238]\n\nJake Clemons and Springsteen during a performance in Cardiff in May 2024\n\nIn April 2024, 20th Century Studios announced a biographical film, Springsteen: Deliver Me from Nowhere, based on the 2023 book by Warren Zanes about the making of Nebraska. It is written and directed by Scott Cooper; Jeremy Allen White will play Springsteen and perform his own singing.[239][240] That year, Springsteen contributed guitar to a re-release of Mark Knopfler's \"Going Home: Theme of the Local Hero\" in aid of the Teenage Cancer Trust.[241] His eighth compilation album, Best of Bruce Springsteen, was released on April 19.[242] In October, Disney+ and Hulu released a documentary about Springsteen's 2023–2024 tour, Road Diary: Bruce Springsteen and the E Street Band.[243] The documentary made its debut at the Toronto International Film Festival in September 2024.[244] In July 2024, Forbes reported that Springsteen had a net worth of more than $1.1 billion, thanks to his tours and the sale of his back catalogue in 2021,[245] making him one of the richest celebrities and musicians. During his August 23, 2024, show in Philadelphia, Springsteen denounced rumors of a farewell tour.[246]\n\nIn April 2025, Springsteen announced the Tracks II: The Lost Albums collection, which was released on June 27, 2025. It features seven full-length albums of unreleased material dating from 1983 to 2018. The collection includes 83 songs, 74 of which were previously unreleased. A twenty-song companion album, Lost and Found: Selections from The Lost Albums, was also released on June 27.[247][248] On May 21, 2025, Springsteen released the Land of Hope & Dreams EP. The four-song EP features songs from the tour opener in Manchester on May 14, 2025.[249] A 17-minute documentary entitled Inside Tracks II: The Lost Albums was released on June 20, 2025; it gives viewers an in-depth look at each Lost Album.[250]\n\nIn a June 2025 interview with Rolling Stone, Springsteen confirmed that a new solo album is completed and will be released in 2026, Only the Strong Survive, Volume 2 is also completed, and a Tracks III box set will be released in the next three years. Springsteen also at first denied the existence of the long-rumored Electric Nebraska album, but a month after the interview corrected himself and confirmed that songs from those sessions existed. Springsteen discussed the future of the E Street Band, saying he wants to \"play more often with less dates\" and that \"it’s very exciting to play with the E Street Band now, and I’m looking forward to doing a good deal of it in the future. But that future is finite.\" He said he would also like to do another solo tour similar to his Broadway shows. Springsteen said there will never be a farewell tour and that he hopes to still be onstage in his nineties.[251]\n\nSpringsteen and the E Street Band's 2023–2025 Tour was the highest-grossing tour of their career grossing close to $730 million worldwide and placing it as one of the top ten highest-grossing tours ever. It more than doubled their previous all-time gross from their 2012–2013 Wrecking Ball Tour. It also made Springsteen one of just five artists ever to have grossed over $2.3 billion touring in his career.[252]\n\nOn August 22, 2025, Springsteen released the song \"Lonely Night in the Park\" to celebrate the upcoming 50th anniversary of the Born to Run album. A low quality version of the song appeared on various fan released bootlegs over the years and in 2005 was briefly played on SiriusXM's E Street Radio channel.[253]\n\nArtistry and legacy [ edit ]\n\nI spent most of my life as a musician measuring the distance between the American Dream and American reality. —Springsteen at a rally for presidential candidate Barack Obama on November 2, 2008 [ 254 ]\n\nWidely regarded as one of the greatest songwriters of all time,[255] Springsteen has been called a \"rock 'n' roll poet\" who \"[radiates] working-class authenticity\".[256] He is a pioneer of heartland rock, a genre combining mainstream rock music with working class thematic concerns and socially conscious lyrics. According to Rolling Stone, his work \"epitomizes rock's deepest values: desire, the need for freedom and the search to find yourself.\"[257] Often described as cinematic in their scope, Springsteen's lyrics frequently explore highly personal themes such as individual commitment, dissatisfaction and dismay with life in a context of everyday situations.[258] Springsteen's themes include social and political commentary[259][260] and are rooted in the struggles faced by his own family of origin.[261]\n\nA shift in Springsteen's lyrical approach began with the album Darkness on the Edge of Town,[262] in which he focused on the emotional struggles of working class life,[263][264] alongside more typical rock and roll themes. Reviewing Born in the U.S.A., Rolling Stone critic Debby Miller noted that \"Springsteen ignored the British Invasion and embraced instead the legacy of Phil Spector's releases, the sort of soul that was coming from Atlantic Records, and especially the garage bands that had anomalous radio hits. He's always chased the utopian feeling of that music\".[265]\n\nJon Pareles included Springsteen among the \"pantheon\" of artists of the album era.[266] \"Springsteen is the quintessential album-era rock star,\" writes Ann Powers, who argues that while other acts like the Beatles, the Rolling Stones, and Marvin Gaye probably made better individual works, \"none [had] used the long-player form itself more powerfully over the arc of a career, not only to establish a world through song, but to inhabit an enduring persona\". He used it to lyricize \"America's slide from industrial-era swagger into service-economy anomie\". In her mind, Springsteen needed the \"track-by-track architecture of albums to flesh out characters, relate each to the other, extend metaphors and build a palpable, detail-strewn landscape through which they could travel\". He simultaneously grew musically \"both with his stalwart E Street Band (a metaphor itself for the family connections and community spirit his songs celebrate or lament) and in more minimalist projects.\"[267]\n\nSpringsteen and the E Street Band have frequently appeared in lists ranking the best live acts of all time.[268][269][270] In Forbes, Steve Baltin wrote: \"There has never been a live experience in music that captures the feeling of liberation and optimism rock and roll is supposed to bring you more than a Springsteen and the E Street Band show.\"[268] In January 2023, Rolling Stone named Springsteen the 77th-greatest singer of all time.[271] In April 2023, the governor of New Jersey issued a proclamation announcing September 23 \"Bruce Springsteen Day\".[272]\n\nSpringsteen's songs have been the subject of various scholarly articles analyzing his music and lyrics.[273] The Bruce Springsteen Special Collection houses academic journals and papers on Springsteen published since the 1980s. Springsteen himself said in 2001: \"The Collection has almost 1,000 books and magazines on myself and the band–more stuff than every place except my mother's basement!\"[274]\n\nIn 2003, Rolling Stone's 500 Greatest Albums of All Time list included Born to Run (18),[275] Born in the U.S.A. (85),[276] The Wild, the Innocent & the E Street Shuffle (132),[277] Darkness on the Edge of Town (151),[278] Nebraska (224),[279] The River (250),[280] Greetings from Asbury Park, N.J. (379),[281] and Tunnel of Love (475).[282] In 2004, on their 500 Greatest Songs of All Time list, Rolling Stone included \"Born to Run\" (21), \"Thunder Road\" (86),[283] and \"Born in the U.S.A.\" (275).[284] In 2010, Rolling Stone ranked Springsteen 23rd on its list of the \"100 Greatest Artists of All Time\", describing him as \"the embodiment of rock and roll\".[257]\n\nPersonal life [ edit ]\n\nRelationships [ edit ]\n\nSpringsteen briefly dated artist Karon Bihari in the 1970s, who claimed the Darkness on the Edge of Town song \"Candy's Room\" was about her. He also had relationships with photographer Lynn Goldsmith, model Karen Darvin and, for four years in the 1980s, actress Joyce Hyser.[286]\n\nIn the early 1980s, he met Patti Scialfa at the Stone Pony the evening she was performing alongside his friend Bobby Bandiera, with whom she wrote \"At Least We Got Shoes\" for Southside Johnny. Springsteen liked her voice and after the performance he introduced himself to her. They soon started spending time together and became friends.[287]\n\nEarly in 1984, Springsteen asked Scialfa to join the E Street Band for the Born in the U.S.A. Tour, which began in June 1984. According to the book Bruce by Peter Ames Carlin, they seemed about to become a couple through the first leg of the tour, but Springsteen was introduced to actress Julianne Phillips and married her shortly after midnight on May 13, 1985, at Our Lady of the Lake Catholic Church in Lake Oswego, Oregon.[289][290][291] Opposites in background, the two had an 11-year age difference and Springsteen's traveling took its toll on their relationship. Many of the songs on Tunnel of Love described the unhappiness he felt in his relationship with Phillips.\n\nThe Tunnel of Love Express Tour began in February 1988 and Springsteen convinced Scialfa to postpone her own solo record and join the tour.[293] Scialfa moved in with Springsteen shortly after he separated from Phillips.[294] On August 30, 1988, citing irreconcilable differences, Phillips filed for divorce in Los Angeles,[295] and a settlement was reached in December and finalized on March 1, 1989.[296][297] They had no children.\n\nSpringsteen received press criticism for the apparent haste in which he and Scialfa started their relationship. In a 1995 interview with The Advocate, he told Judy Wieder about the negative publicity the couple subsequently received: \"It's a strange society that assumes it has the right to tell people whom they should love and whom they shouldn't. But the truth is, I basically ignored the entire thing as much as I could. I said, 'Well, all I know is, this feels real, and maybe I have got a mess going here in some fashion, but that's life.'\"[298] Years later, he reflected, \"'I didn't protect Juli... some sort of public announcement would have been fair, but I felt overly concerned about my own privacy. I handled it badly, and I still feel badly about it. It was cruel for people to find out the way they did.'\"[299]\n\nSpringsteen and Scialfa lived in New Jersey before moving to Los Angeles, where they decided to start a family. On July 25, 1990, Scialfa gave birth to the couple's first child, Evan James Springsteen.[301] On June 8, 1991, Springsteen and Scialfa married at their Los Angeles home in a private ceremony, only attended by family and close friends. Their second child, Jessica Rae Springsteen, was born on December 30, 1991.[301] Their third child, Samuel Ryan Springsteen, was born on January 5, 1994.[301] In a 1995 interview, Springsteen said, \"I went through a divorce, and it was really difficult and painful and I was very frightened about getting married again. So part of me said, 'Hey, what does it matter?' But it does matter. It's very different than just living together. First of all, stepping up publicly—which is what you do: You get your license, you do all the social rituals—is a part of your place in society and in some way part of society's acceptance of you ... Patti and I both found that it did mean something.\"[298]\n\nWhen their children reached school age in the 1990s, Springsteen and Scialfa moved back to New Jersey to raise them away from paparazzi. The family owns and lives on a horse farm in Colts Neck Township and has a home in Rumson; they also own homes in Los Angeles and Wellington, Florida.[303] Evan graduated from Boston College; he writes and performs his own songs and won the 2012 Singer/Songwriter Competition held during Boston College's Arts Festival.[304] Jessica graduated from Duke University and is a nationally ranked champion equestrian.[305] She made her show-jumping debut with Team USA in August 2014.[306] Sam is a firefighter in Jersey City.[307] On July 17, 2022, Springsteen and Scialfa became grandparents when their son Sam and his fiancée had a daughter.[308]\n\nHealth [ edit ]\n\nSpringsteen at the 2025 New York Film Festival for Springsteen: Deliver Me from Nowhere\n\nSpringsteen has avoided hard drugs his entire life.[309] Van Zandt said in 2012, \"[Springsteen is] the only guy I know—I think the only guy I know at all—who never did drugs.\"[309] Springsteen has spoken about his struggles with depression, which he began to address in his 30s after years of denial.[310] During this time, he also became frustrated with being an underweight \"fast food junkie\" who had to be helped off the stage after a show due to his poor health. He later began following a mostly vegetarian diet while running up to six miles on a treadmill and lifting weights three times a week.[309] A 2019 Consequence article celebrating his 70th birthday revealed that he still maintains this routine and diet.[311] In September 2023, Springsteen announced the postponement of all his concerts in the US beginning in that month and through December, due to his ongoing treatment for peptic ulcer disease.[312]\n\nReligion [ edit ]\n\nWhile rejecting religion in his earlier years, Springsteen stated in his 2016 autobiography Born to Run, \"I have a personal relationship with Jesus. I believe in his power to save, love [...] but not to damn.\" In terms of his lapsed Catholicism, he said that he \"came to ruefully and bemusedly understand that once you're a Catholic you're always a Catholic ... I don't participate in my religion but I know somewhere... deep inside... I'm still on the team.\"[313]\n\nWealth [ edit ]\n\nIn a 2017 interview with Tom Hanks, Springsteen admitted that he evaded taxes early in his career since the government had not paid attention to his taxes prior to his 1975 appearance on the cover of Time.[314] Most of his income over the next several years went towards paying back his taxes; by his 30th birthday, he had only $20,000, despite multiple bestselling records and tours.[314] Forbes \"conservatively\" estimated Springsteen's net worth at US$1.1 billion in 2024.[315]\n\nHobbies [ edit ]\n\nSpringsteen is a model railroader. He collects and runs HO scale model trains.[316]\n\nPolitical views and activism [ edit ]\n\nSpringsteen with U.S. President Joe Biden in the East Room at the White House in March 2023\n\nSpringsteen announced his endorsement of Barack Obama's 2008 presidential campaign in April 2008.[150] He appeared at several rallies in support of Obama throughout that year.[151] At one rally in Ohio, Springsteen discussed the importance of \"truth, transparency and integrity in government, the right of every American to have a job, a living wage, to be educated in a decent school, and a life filled with the dignity of work, the promise and the sanctity of home\".[317] Despite saying that he would sit out the 2012 presidential election, Springsteen campaigned for Obama's re-election in Ohio, Iowa, Virginia, Pittsburgh, and Wisconsin.[170][171][172]\n\nSpringsteen supports LGBTQ rights and gay marriage. In 2009, he posted the following statement on his website: \"I've long believed in and have always spoken out for the rights of same sex couples and fully agree with Governor Corzine when he writes that 'The marriage-equality issue should be recognized for what it truly is—a civil rights issue that must be approved to assure that every citizen is treated equally under the law.'\"[318] In 2012, he lent his support to the Four 2012, an ad campaign for gay marriage. Springsteen noted in the ad, \"I couldn't agree more with that statement and urge those who support equal treatment for our gay and lesbian brothers and sisters to let their voices be heard now.\"[319] In April 2016, Springsteen cancelled a show in Greensboro, North Carolina, days before it was to take place to protest the state's newly passed Public Facilities Privacy & Security Act, also referred to as the \"bathroom law\", which dictates which restrooms transgender people are permitted to use and prevents LGBTQ citizens from suing over human rights violations in the workplace. Springsteen released a statement on his website. The Human Rights Campaign celebrated Springsteen's statement, and he has received praise and gratitude from the LGBTQ community.[320]\n\nDuring a 2017 show in Perth, Australia, Springsteen made a statement celebrating the post-inauguration Women's March against the incoming Trump administration in cities worldwide: \"We're a long way from home, and our hearts and spirits are with the hundreds of thousands of women and men that marched yesterday in every city in America, and in Melbourne ... [They] rallied against hate and division and in support of tolerance, inclusion, reproductive rights, civil rights, racial justice, LGBTQ rights, the environment, wage equality, gender equality, healthcare, and immigrant rights. We stand with you. We are the new American resistance.\"[321][322][323]\n\nSpringsteen is a staunch critic of Donald Trump, whom he calls the \"conman from Queens\".[324] During Trump's first term as president of the United States in October 2019, Springsteen said Trump \"doesn't have a grasp of the deep meaning of what it means to be an American\",[325] and in June 2020 called him a \"threat to our democracy\".[326] Springsteen's song \"The Rising\" was featured prominently in the 2020 Democratic National Convention in support of Joe Biden, accompanied with a new video and campaign slogan, #TheRising.[327] On October 13, 2020, author Don Winslow released a video critical of Trump prior to his campaign event in Pennsylvania. The video features Springsteen's song \"Streets of Philadelphia\".[328] A few days prior to the 2020 United States presidential election, Springsteen provided narration for a campaign ad that spotlights Biden's upbringing in Scranton, Pennsylvania with \"My Hometown\" playing throughout the ad.[329] Biden used \"We Take Care of Our Own\" as one of his theme songs, as Obama had before him in 2012.[330] On October 3, 2024, Springsteen endorsed Vice President Kamala Harris in the 2024 United States presidential election,[331] and gave a speech at one of her campaign rallies on October 24.[332]\n\nDuring a show in Manchester, England, on May 14, 2025, Springsteen spoke out against Trump and called his administration \"corrupt, incompetent, and treasonous\". Two days later, Trump responded on Truth Social by calling Springsteen \"highly overrated\" and \"dumb as a rock\".[333] Tino Gagliardi, the president of the American Federation of Musicians defended Springsteen, saying, \"Musicians have the right to freedom of expression, and we stand in solidarity with all our members.\"[334] On May 19, Trump called for a major investigation into Springsteen, Beyoncé, Oprah, and other celebrities for their endorsement of Harris. He claims that Harris illegally paid them to support her 2024 campaign for president.[335] Musicians such as Neil Young and Eddie Vedder spoke out in defense of Springsteen saying his freedom of speech rights were being violated.[336] Springsteen included recordings of his Manchester remarks as part of a live EP release, Land of Hope and Dreams.[337]\n\nAchievements and awards [ edit ]\n\nSpringsteen receiving the Presidential Medal of Freedom at the White House from President Barack Obama in 2016\n\nSpringsteen has sold more than 140 million records worldwide and more than 71 million records in the United States, making him one of the world's best-selling artists.[338][339] He has earned numerous awards for his work, including 20 Grammy Awards,[340] two Golden Globes,[341] an Academy Award,[342] and a Special Tony Award (for Springsteen on Broadway).[343] Springsteen was inducted into both the Songwriters Hall of Fame[344] and the Rock and Roll Hall of Fame[345] in 1999, received the Kennedy Center Honors in 2009,[346] was named MusiCares person of the year in 2013,[347] and was awarded the Presidential Medal of Freedom by President Barack Obama in 2016.[348]\n\nIn May 2021, Springsteen became the eighth recipient of the Woody Guthrie Prize, a prize that honors an artist who speaks out for social justice and carries on the spirit of the folk singer.[349] In March 2023, Springsteen was awarded the 2021 National Medal of Arts from President Joe Biden at the White House. Springsteen was supposed to receive the award in 2021 but the COVID-19 pandemic postponed the ceremonies.[350]\n\nIn March 2024, it was announced that Springsteen would be named an Academy Fellow by The Ivors Academy in May 2024. On May 23, 2024, Springsteen became the first international songwriter that the academy has inducted into the Fellowship in its 80-year history.[351]\n\nOn October 18, 2025, Springsteen received the Academy Museum of Motion Pictures inaugural Legacy Award \"for an artist whose body of work has inspired generations of storytellers and deeply influenced our culture.\"[352] On November 3, 2025, he was inducted Into the 2025 class of Library Lions by the New York Public Library.[353]\n\nDiscography [ edit ]\n\nStudio albums\n\nConcert tours [ edit ]\n\nA banner hanging at Xfinity Mobile Arena in Philadelphia, recognizing Springsteen's 53 sellout concerts at the arena as of 2014; as of 2023, Springsteen has performed 67 sellout concerts at the Philadelphia venue. [ 354 ]\n\nSpringsteen has developed a reputation for energetic and long-lasting live performances.[355][356]\n\nHeadlining tours [ edit ]\n\nResidency [ edit ]\n\nCo-headlining tours [ edit ]\n\nSee also [ edit ]\n\nReferences [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/1/18/Springsteen_On_Broadway_-_Walter_Kerr_Theater_-_Thursday_2nd_November_2017_SpringsteenBroadWay021117-27_%2826448770829%29.jpg/250px-Springsteen_On_Broadway_-_Walter_Kerr_Theater_-_Thursday_2nd_November_2017_SpringsteenBroadWay021117-27_%2826448770829%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/Bruce_Springsteen_20080815.jpg/250px-Bruce_Springsteen_20080815.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/43/SpringsteenWembley050616_%2859_of_60%29.jpg/250px-SpringsteenWembley050616_%2859_of_60%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Freehold_High_School.jpg/250px-Freehold_High_School.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Bruce_Springsteen_Springsteen-79.jpg/960px-Bruce_Springsteen_Springsteen-79.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Bruce_Springsteen_performing_at_Climate_Pledge_Arena_in_Seattle%2C_Washington_27_February_2023.jpg/250px-Bruce_Springsteen_performing_at_Climate_Pledge_Arena_in_Seattle%2C_Washington_27_February_2023.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Bruce_Springsteen_Springsteen-76.jpg/250px-Bruce_Springsteen_Springsteen-76.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/64/141105-D-KC128-981_%2815541591358%29.jpg/250px-141105-D-KC128-981_%2815541591358%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/20081102_Bruce_Springsteen_at_Barack_Obama_rally_in_Cleveland.JPG/250px-20081102_Bruce_Springsteen_at_Barack_Obama_rally_in_Cleveland.JPG", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/BruceSpringsteenPhillySelloutBanner.jpg/250px-BruceSpringsteenPhillySelloutBanner.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/40px-Wikiquote-logo.svg.png", "http://en.wikipedia.org/static/images/footer/wikimedia.svg", "http://en.wikipedia.org/static/images/icons/wikipedia.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Stone_Pony_Asbury_Park_NJ1.jpg/250px-Stone_Pony_Asbury_Park_NJ1.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/00/American_Land_ESB_Fireworks_Giants_100309.jpg/250px-American_Land_ESB_Fireworks_Giants_100309.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/SpringsteenCardiff050524_%28118_of_166%29_%2853705484155%29.jpg/250px-SpringsteenCardiff050524_%28118_of_166%29_%2853705484155%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/91/20081102_Bruce_Springsteen_Michelle_and_Barack_Obama.JPG/250px-20081102_Bruce_Springsteen_Michelle_and_Barack_Obama.JPG", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Bruce_Springsteen_Presidential_Medal_of_Freedom.jpg/250px-Bruce_Springsteen_Presidential_Medal_of_Freedom.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Bruce_Springsteen_Springsteen-79.jpg/250px-Bruce_Springsteen_Springsteen-79.jpg", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Bundesarchiv_Bild_183-1988-0719-38%2C_Bruce_Springsteen%2C_Konzert_in_der_DDR.jpg/250px-Bundesarchiv_Bild_183-1988-0719-38%2C_Bruce_Springsteen%2C_Konzert_in_der_DDR.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Bruce_Springsteen_2005.jpg/250px-Bruce_Springsteen_2005.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/20081102_Bruce_Springsteen_and_Barack_Obama_hug.JPG/250px-20081102_Bruce_Springsteen_and_Barack_Obama_hug.JPG", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Springsteen_05051981_01_200.jpg/190px-Springsteen_05051981_01_200.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Bruce_Springsteen_Milan_2006_05_12.jpg/250px-Bruce_Springsteen_Milan_2006_05_12.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/20px-Symbol_category_class.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Bruce_Springsteen_at_the_New_Haven_Coliseum_%287238976872%29.jpg/250px-Bruce_Springsteen_at_the_New_Haven_Coliseum_%287238976872%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Springsteen_On_Broadway_-_Walter_Kerr_Theater_-_Thursday_2nd_November_2017_SpringsteenBroadWay021117-43_%2826448754919%29_%28cropped%29.jpg/250px-Springsteen_On_Broadway_-_Walter_Kerr_Theater_-_Thursday_2nd_November_2017_SpringsteenBroadWay021117-43_%2826448754919%29_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/President_Bill_Clinton_and_Bruce_Springsteen.jpg/250px-President_Bill_Clinton_and_Bruce_Springsteen.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/23/P20230321CS-0553.jpg/250px-P20230321CS-0553.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Bruce_Springsteen_and_the_E_Street_Band_1977.jpg/250px-Bruce_Springsteen_and_the_E_Street_Band_1977.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/21/RisingTourGiantsStadiumLot.jpg/250px-RisingTourGiantsStadiumLot.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/78/Bruce_Springsteen_sig.svg/250px-Bruce_Springsteen_sig.svg.png", "http://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Bruce_Springsteen_%26_Steven_Van_Zandt_%287479347764%29.jpg/250px-Bruce_Springsteen_%26_Steven_Van_Zandt_%287479347764%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/40/SpringsteenMadison.jpg/250px-SpringsteenMadison.jpg", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Bruce_Springsteen_-_Roskilde_Festival_2012.jpg/250px-Bruce_Springsteen_-_Roskilde_Festival_2012.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Bruce_Springsteen_Springsteen-79.jpg/960px-Bruce_Springsteen_Springsteen-79.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Bruce_Springsteen", "title": "Bruce Springsteen", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Bruce_Springsteen_Springsteen-79.jpg/960px-Bruce_Springsteen_Springsteen-79.jpg", "width": 800, "height": 1200}, "title": "Bruce Springsteen - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}