{"url": "https://www.nydailynews.com/entertainment/tv/kevin-james-tv-wife-killed-kevin-wait-article-1.3563140", "text": "Kevin James’ sitcom “Kevin Can Wait” killed off a major character to give life to new storylines.\n\nViewers were surprised this summer to learn that Donna Gable, the on-screen wife of James’ character Kevin Gable, would not be returning for Season 2, which premiered last month. Leah Remini, who starred alongside James for nine seasons of “The King of Queens,” has since joined the full-time cast.\n\nThe decision to have Donna, played by Erinn Hayes, die on the show stunned fans, but James says the character’s death was not a reflection of Hayes’ talent or a chemistry issue — but a way to open up new plot possibilities.\n\n“I get that people are like ‘Whoa, why would you do this?’ But it really felt like a thing like this was needed for this show to drive forward,” James said.\n\n“Now, I have to deal with my daughter in a different way, and she’s gonna go to college, or one’s getting married, or the holidays. And it deals with things in a different, weightier way.”\n\nJames, 52, explained he was originally supposed to star as a single father on the show but he and the producers ultimately decided to give him a wife along with three kids.\n\nThe show’s makers, however, realized a change was needed after the first season if the series was going to have a lengthy life.\n\nLeah Remini joined the show at the end of Season 1.\n\n“The plot of the show didn’t have enough drive,” James said. “If we got through a second season, I wouldn’t see us getting through a third one. We were literally just running out of ideas.”\n\nJames said he’s unsure if the show will address Donna’s death further, considering it’s meant to be a lighthearted sitcom. So far, the series has mostly sidestepped her absence. In the first episode, James’ character received a letter from her gym saying they’ve missed her.\n\n“So do I,” he says.\n\nThe second season has already brought other major changes. Remini’s full-time role on the show as Vanessa Cellucci — James’ former partner on the police force — comes after she made a well-received guest appearance on the two-part Season 1 finale.\n\n“When she came on … it was just the greatest,” James said. “Fans loved it, everybody on the crew loved it. We just knew right away, so we thought, ‘How can we get her here full-time to be on the show?'”\n\nFor Remini, it was a dream come true to work with James again after appearing together in over 200 episodes of “The King of Queens” from 1998 to 2007.\n\nThe 52-year-old said he was originally supposed to star as a single father on the show, but he and the producers ultimately decided to give his character a wife.\n\n“It could’ve been next year, 10 years from now. It could’ve been 10 years earlier. I would’ve taken any opportunity to work with Kevin again,” Remini said. “I’ve worked with other leading men after Kevin, but there’s something very special that you just can’t kind of explain when something works with somebody.”\n\nThe first few episodes of season two focus on the friendship of their characters, who come to run a small security firm together called Monkey Fist.\n\n“These were ex-partners,” Remini says of her and James’ characters. “They worked together, and we haven’t even begun to go into the back story of that in exploring what their relationship was other than a few sentences here and there.”\n\nRemini — who relocated from Los Angeles to the East Coast for the show’s filming on Long Island — said it didn’t take any time whatsoever for her and James to recapture the rapport showcased on “The King of Queens.” Just like old times, they trade witty one-liners and sarcasm as Remini’s character gets frustrated by James’ character’s antics.\n\nRemini, 47, and James say they both are playing characters with personalities that mirror their own — and fans love it.\n\n“It’s not necessarily they relate to the characters, it’s they relate to the people who we are in a way,” James said. “Which is great to me.”\n\nJames and Remini starred with Jerry Stiller (l.) in “The King of Queens” from 1998 to 2007.\n\nNeither James nor Remini is ruling out eventually exploring a romantic plotline for their characters.\n\n“You have to at some point,” Remini said. “It’s not a ‘no,’ it’s just there’s so many episodes to do before that.”\n\nWhatever happens, they’re thrilled to be sharing a studio again.\n\n“It brings back so many amazing memories,” Remini said. “And now, we’re creating new ones.”\n\n“Kevin Can Wait” airs Mondays on CBS.", "images": ["https://www.nydailynews.com/wp-content/uploads/migration/2017/10/14/7PXU7A7X54BU3DVUNEXXKSPAPU.jpg?w=1024&h=670", "data:image/webp;base64,UklGRiQAAABXRUJQVlA4IBgAAAAwAQCdASoBAAEAAwA0JaQAA3AA/v3AgAA=", "https://www.nydailynews.com/wp-content/uploads/2023/08/New_York_Daily_News_nydredblack-1.svg"], "top_img": "https://www.nydailynews.com/wp-content/uploads/migration/2017/10/14/7PXU7A7X54BU3DVUNEXXKSPAPU.jpg?w=1024&h=670", "keywords": [], "authors": ["Peter Sblendorio"], "canonical_link": "https://www.nydailynews.com/2017/10/14/kevin-james-explains-why-he-killed-off-kevin-can-wait-wife-and-brought-on-former-tv-wife-leah-remini/", "title": "Kevin James explains why he killed off ‘Kevin Can Wait’ wife and brought on former TV wife Leah Remini", "meta_data": {"application-name": "newyorkdailynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "robots": "max-image-preview:large", "tdm-reservation": 1, "mrf": {"authors": "Peter Sblendorio", "canonical": "https://www.nydailynews.com/2017/10/14/kevin-james-explains-why-he-killed-off-kevin-can-wait-wife-and-brought-on-former-tv-wife-leah-remini/"}, "description": "Kevin James says the decision was not a reflection of Erinn Hayes' talent or a chemistry issue.", "generator": "WordPress 6.8.3", "og": {"type": "article", "title": "Kevin James explains why he killed off ‘Kevin Can Wait’ wife and brought on former TV wife Leah Remini", "url": "https://www.nydailynews.com/2017/10/14/kevin-james-explains-why-he-killed-off-kevin-can-wait-wife-and-brought-on-former-tv-wife-leah-remini/", "description": "Kevin James’ sitcom “Kevin Can Wait” killed off a major character to give life to new storylines. Viewers were surprised this summer to learn that Donna Gable, the on-screen wife …", "site_name": "New York Daily News", "image": {"identifier": "https://www.nydailynews.com/wp-content/uploads/migration/2017/10/14/7PXU7A7X54BU3DVUNEXXKSPAPU.jpg?w=1024&h=670", "width": 1024, "height": 670}, "locale": "en_US"}, "article": {"published_time": "2017-10-14T18:27:49+00:00", "modified_time": "2018-04-07T14:06:02+00:00"}, "twitter": {"text": {"title": "Kevin James explains why he killed off ‘Kevin Can Wait’ wife and brought on former TV wife Leah Remini"}, "image": "https://www.nydailynews.com/wp-content/uploads/migration/2017/10/14/7PXU7A7X54BU3DVUNEXXKSPAPU.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.nydailynews.com/wp-content/uploads/2023/09/cropped-DailyNewsCamera-7.webp?w=270"}, "movies": [], "publish_date": 1508005669.0, "source": "https://www.nydailynews.com", "summary": ""}