{"url": "https://www.brides.com/story/kate-middleton-competes-prince-william-hockey", "text": "History was made when Prince William married Kate Middleton in the biggest royal wedding of the century on April 29, 2011. Though the couple celebrated their union with a lavish celebration that was befitting of their future status as King and Queen of England, their relationship actually has pretty humble roots.\n\nFrom the moment they met in college to the birth of their third child 17 years later and the heartbreaking announcement that the princess is coping with a cancer diagnosis, here is everything you need to know about Prince William and Kate Middleton's relationship.\n\nPrince William and Kate Middleton first met in 2001 while they were students at the University of St. Andrews in Scotland.\n\nAfter nearly 10 years together (although with a break-up in between), the couple announced their engagement in 2010, with the prince proposing with the late Princess Diana's iconic sapphire engagement ring.\n\nIn 2011, Will and Kate wed in Westminster Abbey and officially became the Duke and Duchess of Cambridge.\n\nSince their wedding, the couple has welcomed three children: Prince George in 2013, Princess Charlotte in 2015, and Prince Louis in 2018.\n\nOn April 29, 2021, the duo celebrated 10 years of marriage. They marked the occasion by releasing two new portraits and a sweet video of their family on Instagram.\n\nFollowing Queen Elizabeth II's death, Prince William and Kate Middleton adopted the titles of the Duke and Duchess of Cornwall and Cambridge; one day later, on September 9, 2022, they officially became the Prince and Princess of Wales.\n\nOn March 22, 2024, Kate shared news of her cancer diagnosis with the world.\n\nSeptember 2001: Two Students in Scotland\n\nThe pair first met at the University of St. Andrews in Scotland in 2001. Kate was studying art history while Prince William was working towards a degree in geography.\n\nApril 2001: The Dress That Started It All\n\nWhile the duo met at the start of school, it wasn't until a fateful spring semester fashion show that Kate really caught the attention of the young prince. The story goes, Kate was modeling a revealing sheer dress for a charity fashion show and Prince William reportedly paid 200 euros for a front-row seat. The rest, as you already know, is history!\n\nOctober 2002: And Then They Were Roommates\n\nFor their second year at university, the couple moved out of their dorm rooms and into a flat together along with two other friends.\n\nHandout\n\nJune 2005: A Graduation Celebration\n\nIn 2005, the young couple graduated from St. Andrews and celebrated their accomplishments together. The Middleton family later shared this adorable throwback from graduation day! Oh, to be young and in love!\n\nMarch 2007: A Brief Break-Up\n\nWill and Kate officially crushed our dreams when reports revealed that the young couple broke up in 2007. During their time apart, Kate took a vacation to Ireland and while she was unhappy about their status at the time, she later said that the split was good for both of them. \"You can get consumed by a relationship when you're younger and I really valued that time for me as well, although I didn't think it at the time,\" she said during her engagement interview in 2010.\n\nJuly 2007: Back Together Again\n\nTheir break-up, however, was short-lived and the couple reconciled a few months later. Kate was seen attending a Princess Diana tribute concert with her sister, Pippa, and sat just two rows behind her royal beau.\n\nApril 11, 2008: Another Graduation\n\nIn the spring of 2008, Prince William graduated from the Royal Air Force and, of course, Kate was by his side during the ceremony.\n\nGetty Images\n\nNovember 16, 2010: A Proposal in Kenya\n\nThe moment the world has been waiting for has finally come: Prince William proposed to Kate Middleton while vacationing in Kenya in the fall of 2010, however, the Palace didn't officially announce the news until a few weeks later. William used his mother's engagement ring, a priceless blue sapphire, to pop the question.\n\nApril 29, 2011: The Wedding of the Century\n\nThousands gathered outside of Westminster Abbey and millions tuned in on TV to witness Kate marry her prince. The bride wore a now-iconic long-sleeve lace gown by Sarah Burton for Alexander McQueen and had her sister and maid-of-honor, Pippa, wear a custom white creation as well. Following the ceremony, the newlyweds stood on the Buckingham Palace balcony to exchange not one, but two kisses in front of the celebratory crowds.\n\nDecember 3, 2012: A Future King Is on the Way\n\nA year and a half after Will and Kate became husband and wife, the Palace announced the couple was expecting their first child! The very same day, Kate was hospitalized with acute morning sickness—something she has since suffered from during every pregnancy.\n\nGetty Images\n\nJuly 22, 2013: Prince George Is Born\n\nThe royal couple officially became parents in 2013 when they welcomed their first son, Prince George. Kate gave birth at St. Mary's Hospital in London, and the new parents posed in the exact same spot Prince William's parents, Prince Charles and Princess Diana, did on his birthday.\n\nGetty Images\n\nMay 2, 2015: It's a Girl!\n\nIn 2015, Will and Kate welcomed a daughter, Princess Charlotte. Just like they did with Prince George nearly two years before, the couple posed for photos with the newborn, who is now fourth in line to the British throne.\n\nGetty Images\n\nApril 23, 2018: Welcoming Another Prince\n\nThe couple gave birth to another boy, Prince Louis, on April 23, 2018, just a month before Prince William's brother, Prince Harry, was set to marry Meghan Markle. The young prince is now fifth in line to the throne—behind his grandfather Prince Charles, his father Prince William, and siblings Prince George and Princess Charlotte.\n\nWPA Pool / Pool / Getty Images\n\nMay 19, 2018: Celebrating Prince Harry and Meghan Markle's Wedding\n\nLess than a month after welcoming their third child, the proud parents stepped out for Prince Harry and Meghan Markle's wedding, which took place on May 19, 2018. On the big day, Prince George served as a pageboy while Princess Charlotte was a bridesmaid.\n\nPool/Samir Hussein / Contributor / Getty Images\n\nOctober 12, 2018: All Smiles at Princess Eugenie's Wedding\n\nWill and Kate attended Princess Eugenie's wedding to Jack Brooksbank and were spotted holding hands—a rare moment of PDA for the usually reserved couple. Years later, a video of Kate watching Prince George and Princess Charlotte walk down the aisle went viral; Kate can be spotted breaking into a wide grin as she sees her kids hit the aisle.\n\nNovember 2020: Saying Goodbye to a Member of the Family\n\nWill and Kate took to Instagram to post a photo in honor of their beloved dog, Lupo, who sadly passed away. \"Very sadly last weekend our dear dog, Lupo, passed away. He has been at the heart of our family for the past nine years and we will miss him so much. - W & C,\" they wrote.\n\nApril 29, 2021: Celebrating Ten Years of Marriage\n\nIn 2021, Will and Kate celebrated a decade of marriage, and they marked the occasion by sharing two new portraits, taken by photographer Chris Floyd, on Instagram.\n\nThey later posted a video clip of their entire family at the beach with the caption, \"Thank you to everyone for the kind messages on our wedding anniversary. We are enormously grateful for the 10 years of support we have received in our lives as a family. W & C.\"\n\nJanuary 9, 2022: Kate Turns 40\n\nIn honor of Kate's 40th birthday, the pair released three new portraits of the duchess photographed Paolo Roversi on Instagram. \"Delighted to share a new portrait of The Duchess ahead of her 40th birthday tomorrow. This is one of three new portraits which will enter the permanent collection of the @nationalportraitgallery, of which The Duchess is Patron,\" Will and Kate wrote.\n\nMax Mumby/Indigo / Contributor / Getty Images\n\nSeptember 9, 2022: The New Prince and Princess of Wales\n\nFollowing the death of Queen Elizabeth II on September 8, 2022, Will and Kate adopted new royal titles. On that day, they temporarily became the Duke and Duchess of Cornwall and Cambridge; one day later, on September 9, their new titles as the Prince and Princess of Wales were officially announced, E! News reports. \"With Catherine beside him, our new Prince and Princess of Wales will, I know, continue to inspire and lead our national conversations, helping to bring the marginal to the centre ground where vital help can be given,\" King Charles III said of the couple during his first official announcement following Queen Elizabeth II's death.\n\nKarwai Tang / Contributor / Getty Images\n\nDecember 2, 2022: Date Night at the Earthshot Prize Awards\n\nWill and Kate visited Boston, Massachusetts, to attend the Earthshot Prize Awards, but they turned the evening—and the entire trip!—into a romantic getaway. The duo kicked off their visit to the U.S. with courtside seats at a Boston Celtics game on November 30, 2022; later that week, the duo got all dressed up (Kate donned a neon green gown rented for just $91 while Will wore a blue velvet suit, Insider reports) for the awards ceremony.\n\nMarch 22, 2024: Kate Shares News of Her Cancer Diagnosis\n\nOn January 16, 2024, Kensington Palace released a statement stating that Kate had undergone planned abdominal surgery that had been successful, but further information around the nature of the surgery wasn't shared. \"The Princess of Wales appreciates the interest this statement will generate,\" the palace said at the time. \"She hopes that the public will understand her desire to maintain as much normality for her children as possible; and her wish that her personal medical information remains private.\"\n\nAfter weeks of speculation from the public, Kate took to Instagram to share a personal update about her condition; in that video, which was released on March 22, 2024, the princess confirmed that she was receiving treatment for an undisclosed form of cancer. \"This, of course, came as a huge shock, and William and I have been doing everything we can to process and manage this privately for the sake of our young family,” Kate said in the video.\n\n\n\nApril 18, 2024: Will Promises to Look After His Wife\n\nNearly a month after Kate shared the news of her cancer diagnosis with the world, Prince William has resumed his royal work. During his first public engagement on April 18, 2024, a 71-year-old woman named Rachel Candappa, a volunteer at the food distribution charity he was visiting, presented him with cards for his wife, People reports. Candappa also told the prince to look after his wife, to which Will replied, \"I will.\"\n\nJune 14, 2024: An Update on Kate's Health\n\nWhile the duo has been understandably quiet about Kate's health status, the Princess of Wales issued a rare statement via Instagram on June 14, 2024. \"I have been blown away by all the kind messages of support and encouragement over the last couple of months. It really has made the world of difference to William and me and has helped us both through some of the harder times,\" she wrote.\n\n\n\nShe went on to add, \"I am making good progress, but as anyone going through chemotherapy will know, there are good days and bad days. On those bad days you feel weak, tired and you have to give in to your body resting. But on the good days, when you feel stronger, you want to make the most of feeling well. My treatment is ongoing and will be for a few more months. On the days I feel well enough, it is a joy to engage with school life, spend personal time on the things that give me energy and positivity, as well as starting to do a little work from home.\"\n\nShe also included an update that indicates when royal watchers might see her next: As it turns out, she may play a role in the Trooping the Colour event taking place this weekend. \"I’m looking forward to attending The King’s Birthday Parade this weekend with my family and hope to join a few public engagements over the summer, but equally knowing I am not out of the woods yet,\" she noted.\n\n", "images": ["https://www.brides.com/thmb/A12hBiLLCOLjzBOK-6ULlho-BdM=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/princess-diana-wedding-dress-recirc-getty-9-22-6a3d1517f35147338aa650841e5d0427.jpg", "https://www.brides.com/thmb/6ImknY_x2D33Dm_HeU_vIpEXKTY=/200x200/filters:no_upscale():max_bytes(150000):strip_icc()/ScreenShot2022-01-05at1.35.51PM-456e1422df8b4ea6ac037a34dc227a2d.png", "https://www.brides.com/thmb/dJ9a-DbrxhRR0VNQsveruP_vODs=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/kate-middleton-dress-recirc-getty-9-10-b17a8fea5f91451ba1fe14f6071682df.jpg", "https://www.brides.com/thmb/rEZ5TcIScBjdTpF2WkMPwYYjFL0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/kate-middleton-prince-william-george-charlotte-prince-harry-wedding-b6881e0ccd024ba1934a0236af683744.jpg", "https://www.brides.com/thmb/Ia3RkT_PrOrLuneSrp4KjId8Z60=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/tom-holland-zendaya-red-carpet-getty-primary-1025-c070dcd16add48829e940334f37ea2c8.jpg", "https://www.brides.com/thmb/99pP21_jHCaAFWY-7qLDj-ZuOlI=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/selena-gomez-benny-blanco-recirc-getty-9-30-63e2d599988c4d6c958b6ef2beebec62.jpg", "https://www.brides.com/thmb/xGmsoOCaxGWhHAI1qNmeUgRR43U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-113287633-93b4584a4b3b45d6999970e5383819c1.jpg", "https://www.brides.com/thmb/NnF13YccE18jFBN0ba9uOGErAWo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/kate-middleton-prince-william-college-graduation-fc7b02173b3f44d9908e859aa5b01a13.jpg", "https://www.brides.com/thmb/dmcS4n0UoOOlrm4QeiFUomEF8rU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/prince-william-kate-middleton-queen-elizabeth-memorial-f7aefcad11a04d7ba26071d1ac6584aa.jpg", "https://www.brides.com/thmb/5zT6gpe-iCxtMNIkKzBLU2W6Pvs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/kate-middleton-prince-william-engagement-announcement-94aeeadbc8294490b0550d90a4fcc3ca.jpg", "https://www.brides.com/thmb/XCcxg_orZjp37rqYgIa9ixMiR3A=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/ririprimary-1eb76ffee280496a856776bc13e0453f.png", "https://www.brides.com/thmb/tN1fD6h9-jjZMp6uKp9H1bI6s6g=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/william-and-kate-recirc-getty-7-3-0c72d235e8e34fbbad37687f4d147aeb.jpg", "https://www.brides.com/thmb/9-Ui6yJYV9Rp0bgaOZ_lcOSyQX4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/kate-middleton-prince-willian-pricess-eugenie-wedding-1d822fed343c469ea030b3b237d52db3.jpg", "https://www.brides.com/thmb/fdTJrXmlZH3ISoAn7-KNBsPNuIY=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/princess-beatrice-engagement-ring-recirc-getty-10-8-cb4e23a2c1e240c39f1cb8d1afde6653.jpg", "https://www.brides.com/thmb/DHvHZm1-TKm4EHny-7jJjfalnrc=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/millie-bobby-brown-jake-bongiovi-recirc-getty-10-6-6e8851200c9d49aa81206441544ff05c.jpg", "https://www.brides.com/thmb/SMInGaQY4HTtEyRZsAH1Mf4EjNg=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/kate-middleton-fascinator-recirc-getty-1-22-92691b6fb3c3473c9195736694935ca3.jpg", "https://www.brides.com/thmb/JJLP80bZPWaRz-2rLDq8_2gJeKg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-950362332-77e75515d9c44dc5bb3cfe31281814ef.jpg", "https://www.brides.com/thmb/PrmkwSkxVgBJzoy_7ARdlFEYARk=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/kristin-kyle-juszczyk-recirc-getty-10-2-2e19c8ed28874ecca97ae930da17237f.jpg", "https://www.brides.com/thmb/9y5aI7WuM6TV3x2j-ipn47NEzhI=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/100225-charles-marriages-recirc-28cf12a4bd5e434db595007c9b3498ec.jpg", "https://www.brides.com/thmb/QkAbKAlMOn724HSthIFxiG7G66k=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/will-and-kate-wedding-recirc-getty-7-9-88e66308dac143aea8668ec00892574f.jpg", "https://www.brides.com/thmb/0lnMSge8lRLLlOccaZqIyFzss14=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-174293677-3d7dba50361f42faac1882ebcde2c243.jpg", "https://www.brides.com/thmb/CpScQR7dZKa7dgURvBl7FdJNsP4=/200x200/filters:no_upscale():max_bytes(150000):strip_icc()/DSC03763-54bce324f1bd48f5af0910efb178cb7e.jpg", "https://www.brides.com/thmb/hL23y7ZaktzUga8dwoi5yuQwb1g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-113287633-d927c1cd21884458b0e76f6a11a906eb.jpg", "https://www.brides.com/thmb/NsddO54Ps9kGOMQONLuBg3_x7eA=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/prince-harry-kate-middleton-recirc-getty-9-4-251b98b274684ab38e87fbb0c0055328.jpg", "https://www.brides.com/thmb/5j4SyOs0TB3RsGenbnj1yrSPo8Y=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/kate-and-william-carriage-recirc-getty-3-25-656d42d616254250ba5a264394a0762c.jpg", "https://www.brides.com/thmb/SM4rkdh5J9CGfLvhn4dbB7rSBOo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/kate-middleton-prince-william-earthshot-awards-6edd557e01554a008118bd078b6a820a.jpg", "https://www.brides.com/thmb/v-w-JVBmzuweyQrTolB3XtaSswc=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/royal-wedding-traditions-diana-charles-getty-recirc-1124-29708a59ac5a4a44a816508afd553b5d.jpg", "https://www.brides.com/thmb/dtquhjd6pN79qdnKKe6mXVRV-90=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/goldie-hawn-kurt-russell-recirc-getty-10-7-ef4ed3fd779a45eb936ce7337796037b.jpg", "https://www.brides.com/thmb/B8lqMQUwbtyGbFNoc8WzJc9QNM4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-472012872-fd572e4f647647b18c9921761921868b.jpg"], "top_img": "https://www.brides.com/thmb/hL23y7ZaktzUga8dwoi5yuQwb1g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-113287633-d927c1cd21884458b0e76f6a11a906eb.jpg", "keywords": [], "authors": ["Gabriella Rello Duffy", "Gabis The Senior Editorial Director For", "Brides'S Editorial Guidelines", "Maggie Kreienberg Is An Editor At"], "canonical_link": "https://www.brides.com/kate-middleton-prince-william-relationship-timeline-4795884", "title": "Prince William and Kate Middleton's Relationship Timeline", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "From the moment they met in college to the birth of their children, here is everything you need to know about Prince William and Kate Middleton's relationship, including their current royal roles and news that the couple is now coping with the princess's cancer diagnosis.", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "BRIDES", "sailthru.author": "Gabriella Rello Duffy", "sailthru.tags": "news,celebrity-and-royal-weddings", "parsely-section": "News", "parsely-tags": "Brides,News,Celebrity & Royal Weddings", "article": {"section": "Brides"}, "og": {"type": "article", "site_name": "Brides", "url": "https://www.brides.com/kate-middleton-prince-william-relationship-timeline-4795884", "title": "Everything You Need to Know About Prince William and Kate Middleton's Relationship", "description": "From the moment they met in college to the birth of their children, here is everything you need to know about Prince William and Kate Middleton's relationship, including their current royal roles and news that the couple is now coping with the princess's cancer diagnosis.", "image": "https://www.brides.com/thmb/hL23y7ZaktzUga8dwoi5yuQwb1g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-113287633-d927c1cd21884458b0e76f6a11a906eb.jpg"}, "twitter": {"card": "summary", "site": "@Brides", "title": "Everything You Need to Know About Prince William and Kate Middleton's Relationship", "description": "From the moment they met in college to the birth of their children, here is everything you need to know about Prince William and Kate Middleton's relationship, including their current royal roles and news that the couple is now coping with the princess's cancer diagnosis.", "image": "https://www.brides.com/thmb/xGmsoOCaxGWhHAI1qNmeUgRR43U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-113287633-93b4584a4b3b45d6999970e5383819c1.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.129.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.129.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.129.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.129.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.129.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://www.brides.com", "summary": ""}