{"url": "https://money.usnews.com/money/personal-finance/spending/articles/2017-08-31/18-best-labor-day-sales-for-2017", "text": "With prices of everyday goods still high due to inflation, it’s still financially difficult for the average consumer to make big purchases like mattresses, appliances, and furniture. So, it’s more important than ever to save some money where you can by taking advantage of holiday sales events.\n\nLabor Day weekend, which this year starts on Sept 2 and runs through Monday, Sept 4, is known for offering considerable discounts on pricey items like refrigerators, mattresses, and large furniture pieces. It’s one of the best times of year to purchase these home products, either online or in stores.\n\nAnd while you have the option to shop sales in-person at these stores open on Labor Day, with so many retailers offering free shipping and quick delivery for the holiday —not to mention offering free in-store pickup for online purchases—it might make more sense for you to order online to secure the deal you want\n\nAll weekend long, major retailers like Best Buy, Home Depot, Lowe’s, Wayfair, and Walmart will be offering Labor Day sales on some of the most popular items from well-known brands like GE, LG, Dyson, Shark, Tempur-Pedic, and many others. But some of these sales start early and extend after the holiday ends, sometimes up to a week or more, before or after.\n\nHere are some of the best deals we found last year.\n\nGetty Images\n\nLabor Day Appliance Sales\n\nMost major appliance stores, like The Home Depot, Lowe’s, and Best Buy, are running competitive sales for the Labor Day weekend this year.\n\nThe home improvement retailer is cutting prices on all types of appliances through Sept. 13. This includes up to $700 off select appliances, plus instant savings of up to $1,000 when you purchase more than one appliance. Buy two appliances and get $100 off or $300 off three, $400 off four, $500 off five, and $1,000 off six or more. The home improvement retailer is also taking $100 off select laundry sets.\n\nThat means you can score some nice discounts on items like refrigerators, washers and dryers, cooktops, ranges, and range hoods, as well as smaller appliances such as vacuums, coffee makers, and toaster ovens. Brand names on sale included LG, Samsung, Frigidaire, KitchenAid, and GE, among others. Free delivery was also included for most large appliances over $369.\n\n\n\nThe big-box home improvement store has one of the largest appliance selections out there, and many highly rated models are on sale for Labor Day. Through Sept. 13, shoppers can get up to $1,500 off select appliances, and get $100 off laundry sets priced at $1,396 or more. Outdoor grills are also selling for up to 40% off. Major appliances from name brands like LG, Whirlpool, Haier, Bosch, and Maytag were on sale, as were smaller items like ice makers, robot vacuums, air conditioners, and air purifiers.\n\nWhile you shop the Labor Day sale at Lowe’s, keep in mind the retailer offers special financing, free in-store pickup, and free local delivery on appliances that cost $396 or more. You can also opt for interest-free financing for up to 12 months on purchases of $299 or more.\n\n\n\nThrough Sept 13, the tech and appliance retailer’s Labor Day sale is offering a number of deals for the Labor Day holiday. This includes up to 40% or more off select appliances, as well as 10% off kitchen packages and an extra $100 off laundry sets. It's also offering Best Buy gift cards up to $200 with the purchase of select Samsung refrigerators that are also on sale for up to $1,200 off the regular price.\n\nIf you apply and are approved for a My Best Buy credit card, you can finance your appliance purchase of $1,499 or more into 24 monthly payments with no interest. You'll also earn Best Buy rewards, which are points you can apply for credit toward future purchases. The retailer offers free delivery on major appliance orders of $399 or more and free standard installation on select products.\n\nThe mass retailer doesn’t carry all of the major appliance brands, but you should be able to find Labor Day deals this year on more budget-friendly names like Avanti, RCA, Midea, Arctic King, and Danby mixed in with some options from Frigidaire, Whirlpool, and GE. If you’re looking for smaller-size appliances, including air fryers and stand mixers, Walmart’s Labor Day sale may be a good bet to get one at a great price.\n\nWhen shopping for appliances during this sale, be careful to look at the \"Sold and Shipped by\" information on the product page. Walmart mixes in products sold by resellers who may have different shipping and return policies.\n\nSamsung is offering several discounts for Labor Day, starting with an offer on home appliance packages that will award you a prepaid Mastercard of up to 10% of the pre-tax subtotal on three or more appliances, or a spend of at least $2,999. You can also get up to $475 off select appliances when bought in bundles, including $125 off two items, $250 off three items, or $475 off four items or more.\n\nCheck out more sales in our Best Labor Day Appliance Sales roundup.\n\nSaatva\n\nLabor Day Mattress Sales\n\nLabor Day is one of the best times of year to buy a new bed. There’s usually no shortage of Labor Day mattress sales at the most well-known brands and mattress retailers. Here are some of our favorite 2023 Labor Day mattress sales:\n\nThe mattress company is offering 33% off everything with prices starting at $359 for mattresses for Labor Day, It's also discounting the price of its add-on bedding package from $599 to $159. This set includes two cooling pillows, a sheet set, and a mattress protector.\n\nPlus, nightstands and dressers were 33% off and some bedding, like duvet covers and weighted blankets, are also discounted as part of the brand’s end-of-summer clearance sale.\n\nWe name the Nectar Memory Foam mattress our No. 2 pick for Best Mattresses for Back Pain.\n\n\n\nThe mattress brand’s Labor Day sale offers up to 20% off sitewide through Sept 12, including all of its mattresses and several other items on the company’s website, such as pillows, bedding, and mattress protectors. The company even has a line of dog beds, which are also 20% off. You can also get 50% off bed frames, including adjustable models.\n\nThe Casper Original Hybrid Mattress takes the No. 1 spot in our Best Mattresses rating.\n\n\n\nThe luxury mattress brand’s Labor Day weekend includes an exclusive offer for U.S. News readers. Those looking to purchase a Saatva mattress can take $400 off all mattress orders of $1,000 or more, plus receive 10% off mattress toppers and other bedding items through Sept. 12 by clicking through this link.\n\nOther savings include $100 off bed frames and adjustable bases with a mattress purchase, up to $40 off foundations, $60 off pairs of pillows, and more. Delivery and white glove set-up are free on most items at Saatva. The company will also take away your old mattress.\n\n\n\nThe mattress company offered $450 off any mattress with promo code AS450 during its 2023 Labor Day sale. Adjustable bed bundles are 30% off with a new mattress. Plus, sheets, pillows, and mattress protectors are discounted by 10% with coupon code TAKE 10. You can also get an Amerisleep bundle of a mattress and an adjustable bed frame for 30% off the regular price.\n\n\n\nShoppers can save money with a 25% sitewide discount with code LDS25 during the mattress company’s 2023 Labor Day sale. This included mattresses, bedding, foundations, and adjustable bases, but the total savings depended on how much was spent and required a promo code. Those who purchase a mattress also receive two free dream pillows. Helix makes six hybrid mattress models as well as options for heavier sleepers and children. The company also offers bases, pillows, and accessories like mattress toppers and bed sheets.\n\nThe Helix Midnight is tied at No. 7 in our Best Mattresses rating.\n\n\n\nWhen U.S. News readers shop at Nolah they will receive an extra $100 off mattresses, already up to $1,200 off, when they use code USNEWS100 during checkout. Your mattress purchase also includes two free pillows.\n\nThe Nolah Evolution 15-inch hybrid mattress is No. 6 in 360 Reviews’ Best Mattresses rating and appears in these other 2023 ratings. The Nolah Evolution 15-Inch ships for free in the contiguous U.S. and comes with a lifetime warranty and 120-night sleep trial.\n\n\n\nFor more links to great deals, check out our Best Labor Day Mattress Sales roundup.\n\nBed, Bath, & Beyond\n\nLabor Day Furniture Sales\n\nLabor Day deals will also be happening at major furniture retailers like Overstock and Wayfair as well as shopper-favorite boutique brands like Floyd, Burrow, and Outer. Here are some of last year’s best deals:\n\nAt the beginning of August, Overstock rebranded itself Bed, Bath & Beyond after buying the name of the former home goods retailer that closed its doors earlier in the summer. The online retailer has thousands of new furniture pieces and you’ll find steep discounts on everything from a new bed frame to a wine bar cabinet. During this year's Labor Day sale, shoppers can get up to 70% off all furniture and score free shipping on every piece. Deals also included accent items like rugs and lamps, with no official exclusions.\n\nIf you download and shop using the mobile app, you'll also get an extra 25% off your order through 8/31. Plus, everything on the site ships for free during the entire sale.\n\n\n\nWayfair is offering up to 60% off furniture during Labor Day weekend, and you'll find the deepest discounts on clearance items when you scope out the Warehouse Closeout section. You'll find big discounts on items like patio furniture and other outdoor items such as outdoor pillows and cushions, outdoor lighting, grills, and gardening decor like planters.\n\nWayfair ships most items over $35 for free and has a 30-day return policy. The retailer also offers financed monthly payment options, as well as lease-to-own programs.\n\n\n\nHouzz\n\nThis furniture retailer offers styles you won't find at the bigger stores. For Labor Day it's offering up to 85% off select furniture across categories, including indoor and outdoor pieces, as well as accessories like area rugs, home decor, and lighting. Patio furniture and other outdoor home decor are up to 75% off.\n\nHouzz offers free shipping on any order over $49 and items can be returned within 30 days.\n\n\n\nRaymour & Flanigan\n\nThis nationwide furniture retailer is taking up to 30% off sitewide for Labor Day. You can also get $25 off your first purchase when you sign up as a new member of the Raymour & Flanigan email list, You'll immediately receive a coupon code after you register. There are deals on single items such as sofas and recliners, as well as complete dining room and bedroom sets. The company also offers deals on mattresses from popular brands such as Sealy, Purple, Tempur-Pedic, and more.\n\nThe retailer offers free white glove delivery on select items, while other furniture may incur delivery fees that can be as high as $150. If you live near a Raymour & Flanigan retail location, you can arrange free pickup of your item.\n\n\n\nAshley kicked off its Labor Day sale in early August and it will run through Sept 11. The furniture retailer is offering a variety of furniture on sale for under $699.99. You can find beds starting at $100, chests and dressers starting at $163, sofas starting at $256, and dining room tables starting at $279.\n\nThe retailer is also offering free doorstep delivery. Plus, if you need to spread out your payments, through Sept 11 you can get 0% interest financing up to 60 months on any purchase in-store using the Ashley Advantage Synchrony credit card. There are also 12-month financing options, as well, if you prefer a shorter pay-back period.\n\n\n\nFor more links to great sales, check out our Best Labor Day Furniture Sales roundup.\n\nFind Labor Day Coupons Online\n\nLooking for some coupons and promo codes you can use when shopping Labor Day sales this year? We have them all for you in one place. Check out our U.S. News Deals coupons site, where you can search for your favorite brands and retailers to see what they’re currently offering.\n\nYou can also visit brands’ and retailers’ websites to see if they have sale and clearance sections or offer promo codes directly on their sites.\n\nWhat Are the Best Labor Day Deals?\n\nLabor Day is an excellent time to make big purchases that you’ve been putting off all year as you’ll likely reap the biggest savings on higher-ticket items. You’ll typically find some of the best Labor Day deals on mattresses, refrigerators, washers and dryers, furniture, and TVs.\n\nEnd-of-season items like patio furniture and grills also often go on sale as retailers try to clear out their inventory to make room for colder-weather merchandise. If you have a place to securely store these items until next year, Labor Day weekend is a good time to buy them at a discount.\n\nWe’ll be keeping an eye on sales from these manufacturers and retailers that offered Labor Day deals last year, as deals should be similar this year. If you’re looking for the top current deals, see Best Deals articles on Mattresses, Laptops, TVs, Tires, Cell Phones, Apple Products, Vacuums, Travel, and VPNs.\n\nLabor Day Deals – Tips To Save\n\nSave the most during your Labor Day shopping with these tips:\n\nCompare prices and price-match policies\n\nWith product prices higher due to inflation, every little bit of saving helps, particularly with a pricey purchase like a refrigerator or mattress. Prices may vary by brand and retailer, so check several before making your final decision.\n\nWhile you’re looking around for the best price, check to see if a retailer will match the price of its competitors. This is advantageous if the return policy or extended warranty, for example, is better at one retailer versus another. Many retailers offer price matching, but if you can’t find the information on the website, check with the store’s customer service.\n\nBuy an older model\n\nWhile you can find deals on new models, the best deals will be reserved for the older ones that brands and retailers are trying to clear from their inventory. With September seeing new washers, dryers, and dishwashers hitting the market, Labor Day sales could be a great time to find price cuts on the older models.\n\nConsider a floor model\n\nIf it’s possible to purchase a mattress or appliance model that’s on display, you can sometimes save big. Plus, if it’s a little scratched or dented and you don’t mind, you can ask if the retailer will discount it further.\n\nUse a credit card with rewards\n\nIf you’re going to use a credit card for a major purchase, you may as well use one that gives you cash-back rewards or points that you can use for later savings. Many credit card companies offer these types of promotions, so take advantage of them if possible.\n\nMore Deals To Save\n\nLearn More\n\nRelated 360 Reviews\n\nWhy You Can Trust Us", "images": ["https://www.usnews.com/object/image/00000184-aa41-d967-a5e5-bfefc9e60000/saatva-classic-mattress.png?update-time=1669303821978&size=responsiveFlow300", "https://www.usnews.com/object/image/0000018a-3975-d443-a1fa-bb7ff0300000/castalia-chesterfield-sectional-sofa.jpg?update-time=1693181264078&size=responsiveFlow300", "https://www.usnews.com/object/image/00000182-efcb-d602-a5f6-ffdbc35b0000/istock-1332363471.jpg?update-time=1661880603999&size=responsive640", "https://www.usnews.com/static/img/usn-logo-large.svg", "https://www.usnews.com/dims4/USNEWS/2db0791/2147483647/thumbnail/970x647/quality/85/?url=https%3A%2F%2Fwww.usnews.com%2Fcmsmedia%2F10%2F11%2F7ed7ebda43799134d2ca1cbcd9fb%2Fistock-1332363471.jpg", "https://www.usnews.com/object/image/00000142-9255-d33c-abc6-ff554e620001/24462FE_PR_111123gifts.jpg?update-time=1447084634234&size=responsiveSquare150", "https://www.usnews.com/object/image/00000186-2714-dbf2-a38f-ff35773d0000/gettyimages-1098390206.jpg?update-time=1675692957767&size=responsiveFlow300", "https://www.usnews.com/object/image/00000182-8d55-d6ff-a18e-dd75cc940000/istock-1166892600.jpg?update-time=1660228782235&size=responsiveSquare150", "https://www.usnews.com/object/image/00000180-4c60-d41c-a7ed-7d79723a0000/istock-1307615661.jpg?update-time=1650548970208&size=responsiveSquare150", "https://www.usnews.com/object/image/00000180-61c1-d187-a5cb-ffdd1def0000/lindsayboyers-headshot-copy.png?update-time=&size=responsiveSquare300", "https://www.usnews.com/object/image/00000182-5f4c-d73d-a5ea-fffcaa390000/kathryn-mccann-core-katie-core.jpg?update-time=1659456524790&size=responsiveSquare300", "https://money.usnews.com/static-atlas/assets/img/usn-logo-large.svg"], "top_img": "https://www.usnews.com/dims4/USNEWS/2db0791/2147483647/thumbnail/970x647/quality/85/?url=https%3A%2F%2Fwww.usnews.com%2Fcmsmedia%2F10%2F11%2F7ed7ebda43799134d2ca1cbcd9fb%2Fistock-1332363471.jpg", "keywords": [], "authors": ["Lindsay Boyers", "Kathryn Core", "David Dritsas", "Aug.", "At A.M."], "canonical_link": "https://deals.usnews.com/deals/best-labor-day-deals", "title": "Best Labor Day Sales 2023", "meta_data": {"optimizely": "Optimizely is supported by this application but is not enabled for this page.", "viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0", "description": "Look forward to deep discounts on appliances, furniture, and mattresses during Labor Day 2023. Here’s a look at some of the best sales and deals going on right now.", "keywords": "Lindsay Boyers,Kathryn Core,David Dritsas,Seasonal Deals - 360,U.S. News Deals,Best Deals", "zone": "home", "robots": "max-image-preview:large", "fb": {"pages": 5834919267, "app_id": 130063997038366}, "brightspot.contentId": "0000016c-cf0d-df9c-a3ff-cf0fb1600000", "og": {"site_name": "US News & World Report", "title": "Best Labor Day Sales 2023", "description": "Appliances, mattresses, and furniture will see some of the biggest discounts during Labor Day weekend sales this year.", "url": "https://deals.usnews.com/deals/best-labor-day-deals", "image": {"identifier": "https://www.usnews.com/dims4/USNEWS/2db0791/2147483647/thumbnail/970x647/quality/85/?url=https%3A%2F%2Fwww.usnews.com%2Fcmsmedia%2F10%2F11%2F7ed7ebda43799134d2ca1cbcd9fb%2Fistock-1332363471.jpg", "secure_url": "https://www.usnews.com/dims4/USNEWS/2db0791/2147483647/thumbnail/970x647/quality/85/?url=https%3A%2F%2Fwww.usnews.com%2Fcmsmedia%2F10%2F11%2F7ed7ebda43799134d2ca1cbcd9fb%2Fistock-1332363471.jpg"}, "type": "article"}, "twitter": {"image": "https://www.usnews.com/dims4/USNEWS/2db0791/2147483647/thumbnail/970x647/quality/85/?url=https%3A%2F%2Fwww.usnews.com%2Fcmsmedia%2F10%2F11%2F7ed7ebda43799134d2ca1cbcd9fb%2Fistock-1332363471.jpg", "card": "summary_large_image", "site": "@USNews", "title": "Best Labor Day Sales 2023", "description": "Appliances, mattresses, and furniture will see some of the biggest discounts during Labor Day weekend sales this year."}, "google-site-verification": "owJBuFHD3VHcTSsnPSOYizmUcs3GSBjbx09vBbBi1MM", "msvalidate.01": "A8E47FA91124063A4A9C78AD5273DC0F", "sailthru.date": "2023-08-29T08:00Z", "sailthru.author": "Lindsay Boyers, Kathryn Core, David Dritsas", "sailthru.site_portal": "U.S. News Deals", "sailthru.description": "Appliances, mattresses, and furniture will see some of the biggest discounts during Labor Day weekend sales this year.", "sailthru.title": "Best Labor Day Sales 2023", "sailthru.vertical": "Deals", "vertical": "Deals", "sailthru.image.full": "https://www.usnews.com/dims4/USNEWS/2db0791/2147483647/thumbnail/970x647/quality/85/?url=https%3A%2F%2Fwww.usnews.com%2Fcmsmedia%2F10%2F11%2F7ed7ebda43799134d2ca1cbcd9fb%2Fistock-1332363471.jpg", "sailthru.tags": "seasonal-deals-360", "preview": "With prices of everyday goods still high due to inflation, it’s still financially difficult for the average consumer to make big purchases like mattresses, appliances, and furniture. So, it’s more important than ever to save some money where you can by taking advantage of holiday sales events. Labor ..."}, "movies": [], "publish_date": 1504152000.0, "source": "https://money.usnews.com", "summary": ""}