{"url": "https://en.wikipedia.org/wiki/Roma_Downey", "text": "Irish actress, producer and author\n\nRoma Downey (born 6 May 1960) is an Irish actress, producer, and author. She gained recognition for her role as Monica the angel, in the CBS television series Touched by an Angel, which ran for nine seasons. Downey portrayed Jacqueline Kennedy Onassis in the Emmy Award-winning miniseries A Woman Named Jackie. Downey stars in and produces the television series The Baxters. She has a stage career, performing with the Abbey Theatre, the National Theatre of Ireland, and appearing on and off Broadway.\n\nDowney has starred in and served as an executive producer for CBS television movies, including Borrowed Hearts and Second Honeymoon. As President of Lightworkers Media, the faith and family division of MGM, she and her husband, Mark Burnett, produced the miniseries The Bible, in which she played Mary, mother of Jesus. In collaboration with Burnett, Downey has produced feature films, including Ben-Hur (2016), Son of God, Little Boy, Woodlawn, Resurrection, Messiah, and Country Ever After. They produced The Dovekeepers for CBS and A.D. The Bible Continues for NBC. Downey was the executive producer of the documentary Faithkeepers, which focuses on the persecution of Christians in the Middle East, as well as Bump Along the Way and the short film Rough, which won the IFTA for Best Short Film in 2021.[2] Downey produced the Amazon Prime feature film On a Wing and a Prayer. This film closed the Sarasota Film Festival, where Downey received a Lifetime Achievement Award. Downey additionally executive produced and starred as Elizabeth Baxter in the family drama series The Baxters, released in Spring 2024 on Amazon Prime Video, based on the best-selling book series by Karen Kingsbury. Her newest film entitled Merv produced under her label Mrs. B Productions releases winter of 2025 on Amazon Prime.\n\nVariety recognized Downey and Burnett as \"trailblazers,\" and listed Downey as one of its \"100 Most Powerful Women in Hollywood\".[3] The Hollywood Reporter included the couple in its \"Most Influential People of 2013,\" and named Downey one of the \"100 Women in Entertainment Power\" in 2014.[4] She was honored on Variety's \"Women of Impact\" list in 2014.[5] On 11 August 2016, Downey received a star on the Hollywood Walk of Fame. In 2021, she was honored with the Lifetime Achievement Award at the International Christian Film & Music Festival,[6] and was named an Officer of the Order of the British Empire (OBE) for her services to the arts, drama, and the community in Northern Ireland.[7]\n\nDowney is a published author, with several books, including the New York Times best-seller Box of Butterflies (2018). Her most recent work, Be an Angel: Devotions to Inspire and Encourage Love and Light Along the Way, was released in 2023. She serves as an ambassador for Operation Smile, participating in missions to Honduras, Vietnam, and Jordan.\n\nEarly life [ edit ]\n\nRoma Downey was born and raised in Derry, Northern Ireland, in the Bogside district,[8] in 1960. Roma is named after her two grandmothers, Ro from Rose and Ma from Mary, joined to make Roma. She attended Thornhill College, a Catholic girls school. Her mother, Maureen O'Reilly Downey, a housewife with an interest in the performing arts, died from a heart attack at age 48 when Downey was ten years old. Her father, Patrick Downey, was a mortgage broker.[8][9] Her father died when Downey was 20. Originally, she planned to be a painter and earned a Bachelor of Arts at Brighton College of Art. Roma studied BA (Hons) Expressive Arts at Brighton Polytechnic. Based at the Falmer campus, she combined Art and Drama for her degree. She then went on to study acting in London at The Drama Studio.\n\nCareer [ edit ]\n\nShe joined the Abbey Players, based at the Abbey Theatre in Dublin, and toured the United States in a production of The Playboy of the Western World.[10] Downey moved to New York City after an agent, whom she met during the tour of The Playboy of the Western World, suggested she had potential for success there. She took a job as a coat checker at an Upper West Side restaurant, before getting cast in Broadway shows.[11]\n\nThe production led to a nomination during the Broadway run for the Helen Hayes Best Actress Award in 1991.[12] She also starred on Broadway in The Circle with Sir Rex Harrison and also at the Roundabout Theater and The Public Theater in New York City.[13]\n\nDowney played the role of Jacqueline Kennedy Onassis in the American television miniseries A Woman Named Jackie (1991) which won the Emmy Award for Outstanding Miniseries in 1992.[14]\n\nTouched by an Angel [ edit ]\n\nDowney in 1998\n\nDowney's role as Jacqueline Kennedy led to her most famous role, as the angel Monica, on the CBS series Touched by an Angel, opposite singer-actress, Della Reese and John Dye, which ran from 1994 to 2003.\n\nShe received one nomination and one win at the TV Guide awards for favorite actress and also received two Emmy Award nominations and two Golden Globe nominations. Downey has said the character Monica interested her because it was a strong female role, which were \"few and far between\" and for its spiritual aspects:\n\nIt was pilot season of ‘94 and I was reading through endless junk scripts that were being sent my way. Typically the roles were to play his wife or his girlfriend — leading roles for women were few and far between. Suddenly a very unusual script turned up. \"Now this is curious,\" I remember thinking. Because I'm a person of faith, the spiritual aspects got my attention. Also, the actress in me was delighted to read a show that had not one but two strong female roles - female angels. I was to audition for Monica and I very much liked Della Reese, who of course ended up playing Tess.[15]\n\nDowney has also spoken of her deep and lasting love for and friendship with Della Reese.[16] The two remained close until Reese's death on 19 November 2017.[17] She commented that Reese was \"such an influence on my life. She was my mother. I was a girl without a mother and for certain God brought her into my life. She was one of the lasting gifts of Touched by an Angel.\"[18]\n\nThe Bible [ edit ]\n\nOn 24 May 2011, Downey and husband Mark Burnett announced they were producing a 10-hour docudrama for the History channel, The Bible, based on stories from the Bible scheduled to air in 2013.[19] They began planning it in 2009 and lined up their own financing.[20] The full production cost was US$22 million.[21] Downey and Burnett wanted to stay as true to the content in the Bible as possible so they put together a wide variety of pastors and academics to review the script and filming. For example, they worked with Pastors Joel Osteen and Rick Warren and academics such as Craig A. Evans and Mark Goodacre.[22]\n\nThe Bible has been watched by over 100 million viewers in the United States alone[23][24] The series has been the number one downloaded series in iTunes and ranked on Amazon's best sellers in movies and television.[24] A theatrical release was released on 28 February 2014 in the United States, under the title Son of God.[25] The Bible was nominated for the 2013 Primetime Emmy Award for Outstanding Miniseries or Movie. Downey played the role of Mary, the mother of Jesus.[24] The Bible was filmed in 2012 in Morocco.[26][27]\n\nIn July 2013, it was announced that Downey and Burnett would produce A.D., the sequel to The Bible.[28] In December 2013, NBC ordered A.D.. The series covered the spread of Christianity after the death and resurrection of Jesus Christ.[29]\n\nOther work [ edit ]\n\nDowney also produced and starred in television movies including Borrowed Hearts and Second Honeymoon.[13] During the run of Touched by an Angel, she recorded the spoken-word album Healing Angel.[30] and wrote the children's book Love Is A Family.[31] She also co-authored a book with her husband, A Story of God and All of Us. She hosted It's a Miracle (TV series), on the Pax Network and appeared on stage in A Picasso at the Geffen Theatre in Los Angeles. She portrayed Annie Sullivan in the TV movie Monday After the Miracle (1998).[32] She has hosted Saturday Night Live,[33] was one of People's most beautiful people. She is a spokesperson for the volunteer group Operation Smile.[34] In 2009, she starred in the movie Come Dance at My Wedding alongside John Schneider. On 16 July 2011, she appeared with actress Marion Ross in the made-for-TV movie Keeping up with the Randalls, broadcast on the Hallmark Channel.[35] Downey is the executive producer of the animated video series, Little Angels, which was released on DVD with 20th Century Fox Home Entertainment on 14 February 2012.[36]\n\nIn December 2013, CBS announced a new miniseries with Downey and Burnett, The Dovekeepers based on the New York Times bestseller by Alice Hoffman. The miniseries aired in 2015.[37] In September 2014, MGM acquired a 55% interest in One Three Media and Lightworkers Media. The two companies consolidated into a new film and television company, United Artists Media Group. Burnett became UA's CEO and Downey became president of LightWorkers Media.[38][39]\n\nDowney executive produced a re-telling of Ben-Hur,[40] starring Jack Huston, which was released in August 2016.[41]\n\nOn 16 November 2016, it was announced Downey and her husband were starting the religious-themed TV network Light TV airing on Fox stations and affiliates.[42] It was reported on 5 December 2020, that Light TV would stop broadcasting and be replaced by TheGrio.TV.[43]\n\nDowney is the author of several books, including Unexpected Blessings and Box of Butterflies, which became a New York Times best seller.\n\nShe acquired the adaptation rights to the book series \"Redemption\" by Karen Kingsbury and worked on the development of the spin-off series The Baxters for 10 years, until its release in 2024.[44]\n\nPersonal life [ edit ]\n\nDowney is married to television producer Mark Burnett. She has two step-sons, James Burnett and Cameron Burnett, and a daughter, Reilly Marie Downey Anspaugh (born 3 June 1996) from her previous marriage to director David Anspaugh. She was also previously married to actor Leland Orser. Reilly is named after her grandmother, Maureen O'Reilly Downey.[8] On Thanksgiving Day 2006, Burnett proposed to Downey during a family vacation in Zihuatanejo, Mexico.[45] They wed on 28 April 2007 in their Malibu home.[46] Her Touched by an Angel co-star, Della Reese, officiated at the wedding.\n\nDowney is a \"Smile Ambassador\" for the non-profit organization Operation Smile which provides surgeries for children around the world who were born with severe cleft lip and palate.[47] She has traveled on several international missions with the group to Vietnam, Honduras and Jordan.[48]\n\nDowney received the Sally Award by the Salvation Army for her contribution to entertainment and helping those in need on 1 October 2015.[49]\n\nDowney was raised as a Roman Catholic.[50][51][52]\n\nOn 18 April 2009, Downey and Burnett delivered the keynote address and accepted honorary doctorate degrees[53] at Pepperdine University's Graziadio School of Business and Management commencement ceremony.[54]\n\nIn 2014, Roma Downey and her husband were recipients of the Anti-Defamation League's Entertainment Industry Award.[55][56] The husband and wife are heavily involved with philanthropic organizations Operation Smile and Compassion International. In 2015, they partnered with the Institute for Global Engagement to launch the Cradle Fund (TCF).[57] TCF is focused on raising $25 million to help Middle Eastern minorities displaced by ISIS to return to a home where they can practice their faith without fear. As of 2019, they have helped more than 10,000 displaced Christian refugees to relocate.[58]\n\nIn February 2016, Downey and Burnett gave the keynote address at the National Prayer Breakfast held in Washington DC by President Obama.[citation needed]\n\nDowney also has a Doctor of Fine Art (DFA) honorary degree from the University of Ulster for her outstanding contribution to acting and philanthropy,[59] and she and Burnett received honorary Doctor of Letters degrees from Nyack College in 2014.[60]\n\nIn 2010, Downey graduated from the University of Santa Monica with a master's degree in Spiritual Psychology.[61]\n\nDowney was appointed Officer of the Order of the British Empire (OBE) in the 2021 Birthday Honours for services to the arts, drama and the community in Northern Ireland.[62][7]\n\nFilmography [ edit ]\n\nTelevision [ edit ]\n\nFilm [ edit ]\n\nFeature film roles Year Title Role Notes 1995 The Last Word Roxy 2004 Funky Monkey Megan 2008 At Jesus' Side Petra Voice role 2014 Son of God Mother Mary\n\nProducer [ edit ]\n\nDiscography [ edit ]\n\nIn 1999, Downey signed with RCA Victor Records and recorded a CD called Healing Angel, released on 14 September 1999.[30]\n\nStage [ edit ]\n\nAwards and nominations [ edit ]\n\nPublications [ edit ]\n\n\"Love Is a Family.\" (2001). Harper Entertainment ISBN 978-0060393748\n\n\"Box of Butterflies: Discovering the Unexpected Blessing All Around Us.\" (2018). ISBN 978-1501150937\n\nISBN \"Unexpected Blessings: 90 Inspirations to Nourish Your Soul and Open Your Heart.\" (2022). Howard Books ISBN 978-1982199227\n\nISBN \"A Message in the Moon.\" (2023). Convergent Books ISBN 978-0593235171\n\nISBN \"Be an Angel: Devotions to Inspire and Encourage Love and Light Along the Way.\" (2023). Convergent Books ISBN 978-0593444023\n\nReferences [ edit ]\n\nNotes [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/e/e9/Roma_Downey_2015.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Roma_Downey_1998.jpg/250px-Roma_Downey_1998.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Roma_Downey_2015.jpg/250px-Roma_Downey_2015.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Roma_Downey_2015.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Roma_Downey", "title": "Roma Downey", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.3", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Roma_Downey_2015.jpg", "width": 899, "height": 1200}, "title": "Roma Downey - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}