{"url": "https://popculture.com/music/2017/07/30/r-kelly-cult/", "text": "R. Kelly isn’t holding back in the aftermath of allegations that he’s holding women against their will at his homes, in what’s been described as a “sex cult.”\n\nThe “Ignition (Remix)” singer performed his first performance since the allegations surfaced in Virginia Beach on Saturday night. Kelly’s show is typically full of sensual aspects, including women asked to rub and grind on the singer.\n\nVideos by PopCulture.com\n\nUp Next: R. Kelly Accused of Holding Women Against Their Will in Abusive ‘Cult’\n\nDespite pressure from outside sources, Kelly stuck to his normal show structure. He acknowledged those you told him to tone it down for the show and told the audience he had no intentions of altering his onstage behavior.\n\n“They hired R. Kelly, so I got to do the R. Kelly show, he told the audience. “That’s just what it is. It’s all entertainment y’all. Don’t get caught up in it. It’s all entertainment; that’s all it is.”\n\nMore: Who Are the Women Targeted by R. Kelly’s Alleged Cult?\n\nHe continued, “For those of you who don’t agree with my show, I imagine y’all need to leave right now, because its about to get freakier than a motherf—er on this stage tonight.”\n\nHe then proceed into a segment where we asked a female audience member to rub all over his body, including his groin area.\n\nThe allegations broke two weeks ago, with multiple families of the women living with Kelly coming forward.\n\nScroll through to see all the allegations against Kelly and his response, as previously reported by PopCulture.com‘s Sarah Halper.\n\nThe Accusations Against R. Kelly\n\nFamily members of several women have told the police that the R&B legend is holding their daughters against their will in an abusive “cult” he formed. Three former members of Kelly’s inner circle have spoken up about these claims and are telling similar stories.\n\nAccording to a report published by BuzzFeed News on Monday, the 50-year-old, whose full name is Robert Slyvester Kelly, has been holding the women at his homes in Atlanta, Georgia, and Chicago, Illinois.\n\nParents of a 21-year-old aspiring singer from Georgia said they have had limited contact with their daughter since she met Kelly backstage at a concert in Indio, California in May 2015.\n\nTwo other parents are fighting to get their daughter back from Kelly’s ownership. Their daughter, an aspiring professional singer from Florida, met Kelly when she was 17 years old and moved into one of his rental properties shortly after she was of the legal age of consent.\n\nAs the parents try and work with the police to get their daughters home, the former members of Kelly’s inner circle – Cheryl Mack, Kitti Jones and Asante McGree – provided details supporting the parent’s worst fears. The women said Kelly has six females living in his properties and controls every aspect of their lives. He tells them what they can eat, how they dress, when they can bathe, when they are allowed to sleep and how they are suppose to engage in sexual encounters that he records and shares with his friends.\n\nOne of the parents said their daughter is “brainwashed” and “looked like a prisoner” the last time she saw her.\n\nIn addition to his controlling manner, Kelly requires the women to call him “Daddy,” while he calls them his “babies.” Each woman must ask his permission to leave the Chicago recording studio they stay at or their assigned rooms in his “guest house” in Atlanta.\n\n“R. Kelly is the sweetest person you will ever want to meet,” McGee said. “But Robert is the devil.”\n\nWho are the women?\n\nAccording to Mack, Jones and McGee, the women that live with Kelly, in addition to the 21-year-old Georgia singer, include:\n\nA 31-year-old “den mother” who teaches the newcomers the ways Kelly likes to be pleasured sexually. This woman was best friends with the girl that sued Kelly in 2008 for filming her in a sexual encounter at as a minor.\n\nA 25-year-old woman who has been apart of Kelly’s crew for seven years.\n\nA 19-year-old model, who is relatively new to the “cult.” She was photographed in public with Kelly and named on multiple gossip websites, which is very uncommon for women in his circle.\n\nAn Atlanta songwriter who began her relationship with Kelly in 2009 when she was 19 years old.\n\nAn 18-year-old singer from Polk County, Florida, who Mack says is Kelly’s “favorite – his number-one girl.”\n\nThe women in his inner circle are of legal age. In 2008, he was tried in Illinois on 14 charges of making child pornography and was acquitted. The prosecutors focused only on a single videotape that showed him having sex with a 14-year-old girl.\n\nWhat are the rules?\n\nMack, the star’s former personal assistant, says Kelly has a long list of rules for the women. “You have to ask for food. You have to ask to go use the bathroom. … [Kelly] is a master at mind control. … He is a puppet master,” she said.\n\nKelly confiscates all of the women’s cell phones and makes sure they do not contact their friends or family. He gives them new phones that they can only use to contact him or others with his permission.\n\nThe “I Believe I Can Fly” singer films his sexual activities with each girl and shows the videos to the men in his circle.\n\nHe does not let the women dress in any clothes that will show off their figure. He tells them to dress in jogging suits because “he doesn’t want their figures to be exposed; he doesn’t want them to look appealing.”\n\nWhen the women are in the same room as other men, they are expected to “turn around and face the wall in their jogging suits because he doesn’t want them to be looked at by anyone else.”\n\nIf any of the rules are broken, Kelly punishes them physically and verbally. For example, Jones, who lived with and had sexual relationship with Kelly, was once held against a tree and slapped for being too friendly to a male cashier at a restaurant.\n\nThe Atlanta singer’s parents’ plea for help…\n\nBackstage at the Fantasy Springs Resort Casino in Indio, California, in May 2015, J. and her then-19-year-old daughter met with the R&B singer. The meeting was to help the teenager’s music career move forward. After meeting for the first time in Atlanta the month earlier, Kelly flew the mother and daughter to his concert in California.\n\n“When we got to go backstage with R. Kelly, we stayed there over two hours,” said J. “One-on-one with just me and my daughter and him. We went back to talk about the music. He listened to her CD. He was going to help her with her CD, and I was really impressed with him at first, because I have always been an R. Kelly fan.”\n\nAlthough J. heard about past sexual misconduct accusations against Kelly, she wasn’t too worried about her daughter being around him in her presence.\n\nAfter their daughter’s backstage visit with Kelly, the aspiring singer secretly talked to him on her cell phone without her parent’s permission.\n\n“As far as I know, we weren’t talking to [Kelly] anymore,” J. said. “Or at least I wasn’t talking to him anymore.”\n\nIn June 2015, J. and Tim believed their daughter was going to visit a Georgia university, but instead went to Kelly’s concert in Oklahoma City. This was the first time the teenager had sex with Kelly and later told her parents about the event. As the singer and Kelly grew closer, it began to appear all he cared about was sex and not advancing her music career.\n\nShe recorded a conversation she had with Kelly and it immediately became clear his intentions.\n\n“I miss my baby,” Kelly told the woman, before asking her what she was wearing. After she replied, he told her: “I want you to get in the habit of telling me what color panties you got on every day,” he instructed repeatedly.\n\nThe Atlanta singer’s parents plea for help (continued)…\n\nHowever, now two years later, J. and her husband Tim are desperate to get their daughter home.\n\nTheir daughter isn’t seen as a missing person in the eyes of the law because she is considered an adult. They now she is living with Kelly, but believe she is there “against her will” in what they call a “cult.”\n\nThe last time they saw their daughter was on December 1, 2016.\n\n“It was as if she was brainwashed. [She] looked like a prisoner — it was horrible,” J. said. “I hugged her and hugged her. But she just kept saying she’s in love and [Kelly] is the one who cares for her. I don’t know what to do. I hope that if I get her back, I can get her treatment for victims of cults. They can reprogram her. But I wish I could have stopped it from happening.”\n\nThe police in both Illinois and Georgia have completed welfare checks in the past year, but they did not lead to any charges for Kelly. The aspiring singer from Georgia told the police she was “fine and did not want to be bothered.”\n\nThe singer enrolled in college, but her studies quickly declined. Her college roommate, identified as T.S., recalls plenty of times being told disturbing details of the girl’s relationship with Kelly.\n\nIn the middle of her first semester in college, the singer began losing weight, chopped off her long hair and dyed in blonde because Kelly liked it that way.\n\nAfter numerous attempts at saving their daughter and failing, the parents are begging for help.\n\n“It’s not about my daughter, per se. It’s about all the girls,” Tim said. “It’s about my daughter, and I understand that. But the abuse that my daughter is actually enduring, nobody should go through.”\n\nMore parents are speaking out…\n\nThe parents of the aspiring Florida singer have also spoken out. A similar situation occurred with their daughter and the Georgia singer. Kelly was “supposed to be a music relationship” for their daughter, but that quickly changed.\n\n“My thing was I trusted. I have never been in the music industry before, ever,” Theresa, the Florida singer’s mother, said. “He is a lyrical genius — he is R. Kelly! And the fact is he went to court, he was never found guilty — he was acquitted — and we were led to believe there was no truth in it. Now I got all of these people asking about why my daughter is there, telling me, ‘All of that, the charges against Kelly, was true.’ Well, how come you didn’t tell me that before?”\n\nThe Florida singer first met Kelly in Orlando on April 18, 2015.\n\n“During the show, they were pulling people out of the audience,” Theresa said. “A guy said, ‘Oh yeah, her.’ He pulled her up onstage.”\n\nKelly and the then 17-year-old girl exchanged numbers, and started a relationship over phone calls and text messages – all of which was kept a secret.\n\nOne day, the parents started worrying about their daughter who had not returned home from school. They found out she was with Kelly at a near by hotel and called the police. After the hotel incident, the teenager was only allowed to talk to Kelly when a parent was present. After a few weeks, Kelly offered to take her on tour with him to “mentor her.”\n\nThe parents allowed it, seeing it as an “opportunity” for her and made sure she had a female guardian with her. Shortly after the tour, the teen moved in with Kelly and lost contact with her parents.\n\nMcGee, one of the women who left Kelly, said he is “obsessed” with the Florida singer and she is “head over heels” for him. Kelly even “would go into the kitchen and cook for her.”\n\nIt appears no lawyer or police authority can help the parents get their daughters home, since they are not considered kidnapped or missing.\n\n“I have not talked to my daughter in more than a year,” Theresa said. “We’ve had deaths in the family, birthdays, and I haven’t heard from her and she hasn’t been here for any of it. I didn’t even hear from her on Mother’s Day. All I want to do is bring her home.”\n\nR. Kelly Finally Responds to ‘Cult’ Accusations\n\nR&B singer R. Kelly finally spoke out about those accusations on Friday.\n\nIn a video message for fans posted to Twitter, Kelly said, “I just want to let all of my fans out there know that, despite all of the crap y’all hearing, I will be coming to the East Coast to do my show — and believe me, y’all, it’s a bunch of crap.”\n\nAt the time of the initial report, Kelly’s civil lawyer, Linda Mensch, issued a statement on his behalf.\n\n“Mr. Robert Kelly is both alarmed and disturbed at the recent revelations attributed to him,” the statement reads. “Mr. Kelly unequivocally denies such allegations and will work diligently and forcibly to pursue his accusers and clear his name.”", "images": ["https://popculture.com/wp-content/uploads/sites/5/2025/11/molly-dangerously-obese.png?w=300", "https://sb.scorecardresearch.com/p?c1=2&c2=8568956&cj=1", "https://popculture.com/wp-content/uploads/sites/5/2024/09/509733a3-2776-41c2-ae2f-87bd457740ba.jpg?w=300", "https://popculture.com/wp-content/uploads/sites/5/2025/05/robert-irwin.jpg?w=300", "https://popculture.com/wp-content/uploads/sites/5/2021/03/14024377-87b5-44da-926d-abcee03cd657.png?w=640", "https://popculture.com/wp-content/themes/popculture-2024/assets/images/popculture-logo-white.png", "https://popculture.com/wp-content/uploads/sites/5/2024/04/1c80a318-ac01-429c-ae50-dcd1a2e17f40.jpg?w=300", "https://popculture.com/wp-content/uploads/sites/5/2025/10/boston-blue-faith-and-family-sonequa-martin-green-donnie-wahlberg-cbs.jpg?w=300", "https://popculture.com/wp-content/uploads/sites/5/2024/10/PopCulture-logo_1f401e.png", "https://popculture.com/wp-content/uploads/sites/5/2021/04/70839b1d-3826-4242-9848-ca2fff9b687f.jpg?w=300", "https://popculture.com/wp-content/uploads/sites/5/2022/04/45511bc5-8791-4d0b-a2e9-34e9c9011b24.png?w=300", "https://pixel.quantserve.com/pixel/p-RxPFZR-mKeJrq.gif", "https://popculture.com/wp-content/uploads/sites/5/2024/07/70afec6a-3143-4947-b047-428e525611d4.jpg?w=300"], "top_img": "https://popculture.com/wp-content/uploads/sites/5/2021/03/14024377-87b5-44da-926d-abcee03cd657.png?w=640", "keywords": [], "authors": ["John Connor Coulston", ".Wp-Block-Savage-Platform-Post-Byline Font-Family Var --Wp--Custom--Typography--Font-Family--Secondary", "Font-Size Var --Wp--Custom--Typography--Font-Size--Sm", "Font-Weight Var --Wp--Custom--Typography--Font-Weight--Bold", "Line-Height Var --Wp--Custom--Typography--Line-Height--Xxs", ".Wp-Block-Savage-Platform-Post-Byline A Font-Weight Var --Wp--Custom--Typography--Font-Weight--Black", "Text-Decoration None", ".Wp-Block-Savage-Platform-Post-Byline Font-Family Var --Wp--Custom--Typography--Font-Family--Primary", "Font-Size Var --Wp--Custom--Typography--Font-Size--Tiny", "Media Min-Width"], "canonical_link": "https://popculture.com/music/news/r-kelly-cult/", "title": "R. Kelly Encourages Fan to Touch His Body During Seductive Concert Amid ‘Cult’ Accusations", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "R. Kelly Encourages Fan to Touch His Body During Seductive Concert Amid 'Cult' Accusations", "description": "R. Kelly isn’t holding back in the aftermath of allegations that he’s holding women against their will at his homes, in what’s been described as a “sex cult.” The “Ignition (Remix)” singer performed his first performance since the allegations surfaced in Virginia Beach on Saturday night. Kelly’s show is typically full of sensual aspects, including […]", "url": "https://popculture.com/music/news/r-kelly-cult/", "site_name": "PopCulture.com", "image": {"identifier": "https://popculture.com/wp-content/uploads/sites/5/2021/03/14024377-87b5-44da-926d-abcee03cd657.png?w=640", "width": 640, "height": 320, "type": "image/png"}}, "article": {"published_time": "2017-11-08T20:29:00+00:00", "modified_time": "2024-10-07T13:34:17+00:00"}, "author": "John Connor Coulston", "twitter": {"card": "summary_large_image", "label1": "Written by", "data1": "John Connor Coulston", "label2": "Est. reading time", "data2": "11 minutes"}, "generator": "WordPress 6.8.3", "msapplication-TileImage": "https://popculture.com/wp-content/uploads/sites/5/2024/10/cropped-PopCulture-icon_a9e4e3.png?w=270"}, "movies": [], "publish_date": 1501387200.0, "source": "https://popculture.com", "summary": ""}