{"url": "www.cosmopolitan.com/entertainment/celebs/a14510038/selena-gomez-mom-relationship-justin-bieber-family/", "text": "11 min read\n\nIt’s a truth universally acknowledged that the internet loves nothing more than talking about Selena Gomez and Justin Bieber’s relationship even though (1) they’ve been broken up for literal years, (2) they’ve both entirely moved on, (3) he’s married to Hailey Baldwin Bieber, and (4) she's in a whole relationship with music producer Benny Blanco. Like, Jelena is over!\n\nAnd TBH, people still clinging to that unsinkable ship miiiiight be interested to know that Sel has actually dated more than one person in her life—including some truly wild-card celebrities like Orlando “They’re Taking the Hobbits to Isengard” Bloom (we forgot about this relationship too, don’t worry), Taylor Lautner during his peak sexy Twilight wolf years, and the one and only Nick Jonas.\n\nThere's a lot to unpack here, so let's get into it, shall we?\n\n2008: Nick Jonas\n\nIt was short-lived, but yep. Selena and Nick dated in 2008 and she even starred in the “Burnin’ Up” music video, which graced us with this lil smirk:\n\nHollywood Records // YouTube\n\nObviously, Nick and Miley Cyrus also had a thing in this era, but Sel told W magazine in 2016 that it was never an issue: “We never feuded. We both liked the same guy when we were 16.…We are now completely settled in our own lives.” Moving along!\n\n2009: Taylor Lautner\n\nI know, right? Whomst knew? Selena briefly dated Taylor after they met while she was filming Ramona and Beezus and he was filming Twilight: New Moon. But public interest in the relationship ended up killing their vibe. Here’s what Selena told Seventeen at the time:\n\n“Kristen [Stewart] was staying in my hotel. He would visit her, so we were constantly running into each other in the lobby—and we ended up meeting. We would go out to lunch and dinner, but I knew he had paparazzi following him and I had paparazzi following me. So we literally just wanted to hang out, go bowling and stuff, and it went a little too far, I think. People were getting a little crazy about us.”\n\nKevin Mazur // Getty Images\n\nClearly, the two remained on good terms though, because this picture ^ was taken a few years after they dated. Oh, and Taylor went on to date Sel’s close friend and fellow Taylor, Taylor Swift. The singer even allegedly wrote “Back to December” about him, and when asked what he thought of the song in 2016, he mused, “That’s what she does.” Cool.\n\nDecember 2009—April 2014: Justin Bieber\n\nOn December 31, 2009, Justin serenaded Selena with “One Less Lonely Girl” during Dick Clark's New Year's Rockin' Eve. Ahem:\n\nKevin Winter/DCNYRE2010 // Getty Images\n\nThen, most of 2010 was filled with interviews where both Justin and Selena would dodge dating rumors. It even got to a point where Selena called Justin her “little brother,” and knowing their history now, that's a little more awkward than we remember it being. 😅\n\nHowever! Justin and Selena were spotted eating pancakes at IHOP in 2010, which I think we can all agree is the most romantic thing two people can do together. At first, Selena attempted to shut down rumors, telling Us Weekly, “It was just pancakes.” But, like, there’s no such thing as *just* pancakes.\n\n\n\nThe couple spent the next few years hitting red carpets, including the premiere of Katy Perry: Part of Me. Wow, the only thing that says love more than pancakes is a Katy Perry doc, truly.\n\nGetty Images\n\nThings were pretty up and down for these two, and then the Billboard Music Awards hit in May 2013. Not super important, except for the fact that Taylor Swift was caught on camera making a fully disgusted face when she saw them kissing backstage:\n\nDespite Sel’s friends clearly not being here for it, Jelena continued to date on and off through April 2014—when they reportedly had a fight at Coachella after Selena allegedly found photos of Kylie Jenner on Justin’s phone. Tabloids at the time reported that Selena “flipped out” and they briefly broke up. Which brings us to…\n\nApril 2014: Orlando Bloom\n\nOutlets reported that Selena and Orlando hooked up to make Miranda Kerr and the Biebs jealous after they allegedly flirted at the Victoria’s Secret Fashion Show. Please be advised that Justin was wearing this outfit at the time:\n\nCBS Photo Archive // Getty Images\n\nBoth Selena and Elf Bae Orlando denied their romance after being seen “chilling outside” of a Chelsea Handler show, but just wait, because what happens next has me legit all:\n\nGiphy\n\nJune 2014—October 2014: Justin Bieber (Again)\n\nJust a couple of months later, Justin made it clear he and Selena were back together with THIS not-at-all-dramatic black-and-white photo captioned, “Our love is Unconditional.” Like, we get it, Justin. Calm down.\n\nInstagram\n\nThe next month (that’d be July), Orlando was seen punching Justin in Ibiza (yes, you read that right) and then Justin posted and deleted a photo of Miranda looking all kinds of fire on Instagram. You! Cannot! Make! This! Stuff! Up!\n\nInstagram\n\nSelena and Justin managed to make it work until October, when tabloids reported that Justin’s “secret liaisons” with Kendall Jenner were the reason behind the split.\n\nJanuary 2015—March 2015: Zedd\n\nSelena and Zedd started appearing on each other’s Instagrams while working on music together, but it didn’t take fans long to read into literally every appearance they made and assume they were dating….\n\nKevin Mazur // Getty Images\n\nWhich they were! And in case you need proof, here’s a pic Zedd posted of Selena in bed:\n\nInstagram\n\nThis dude opened up about dating Selena a few years after their breakup, saying:\n\n“Reporters were calling my parents. People were hacking my friends’ phones. I was pissed. [Although] I kind of knew what I was getting myself into.…She is one of the most talked about people in the world, but I had no idea how much that would change my life.”\n\nDecember 2015: Niall Horan\n\nSelena was linked to One Direction member Niall Horan after they were spotted on a date at the Santa Monica pier. Oh, and they were also seen “kissing, hugging, and dancing close to one another” at Jenna Dewan’s 35th birthday party.\n\nMeanwhile, just a month before, Justin was spotted serenading Selena with “My Girl” at a Beverly Hills bar:\n\nEither way, Selena friend-zoned Niall when Entertainment Tonight asked if they were dating, saying, “Oh my god! No. I love him, I always have. He’s amazing.” To be fair, they do go way back! Here they are hanging at the VMAs before all these rumors in 2013:\n\nTheo Wargo // Getty Images\n\nJanuary 2016: Samuel Krost\n\nSelena briefly dated Gigi Hadid’s friend Samuel Krost, also known as Fyre Festival’s booker. Like, CAN YOU IMAGINE THE THINGS HE’S SEEN? Anyway, Samuel confirmed their relationship after Instagramming and deleting, “Selena is a real girl with a real heart and real feelings. All you superficial who are just unhappy with your love lives, understand that love is real. Although we have ventured on separate paths, at least I know that love exists. I love you, Sel.”\n\nMarch 2016: Charlie Puth\n\nCharlie Puth and Selena Gomez tried to deny they were hooking up in March 2016 despite reports to the contrary, and it took literally years for Charlie to admit that they were dating. During an interview with Billboard, he said the relationship was “very short-lived, very small, but very impactful. And it really messed me up. I’m trying to put this the best way possible: It wasn’t like I was the only person on her mind. And I think I knew that going in—what I was getting myself into.”\n\nKevin Mazur // Getty Images\n\nHmmm, I wonder who he could be talking about?! Guess that explains why Charlie said “Fuck you, Justin Bieber” during a concert that same month.\n\nMay 2016: Orlando Bloom (Again)\n\nGuess who’s back! Selena and Orlando dusted off their ~vibes~ and were seen getting suuuper handsy in photos obtained by TMZ. And let me just say, the pics were EXTREMELY 👀. Especially because Orlando was reportedly dating Katy Perry at the time, who hit Twitter with this cryptic musing:\n\nJanuary 2017—October 2017: The Weeknd\n\nSelena and The Weeknd broke the internet after they were spotted kissing next to some literal dumpsters in Santa Monica. The couple spent the next few months traveling to Italy and making out on a yacht, and they finally went Instagram official right in time for Coachella in April 2017:\n\nThe next month, they went red carpet official at the Met Gala:\n\nGetty Images\n\nAnd in August, we got this cuteness on The Weeknd’s IG:\n\nGetty Images\n\nSelena ended up having a kidney transplant in September, and despite reports from People that The Weeknd was “one of her biggest supports,” they split up the next month. A source told People, “She and Abel have been going back and forth for a few months about their relationship. It’s been hard with him being on tour and her shooting in New York. That wasn’t easy on them.” Said source also added, “It’s been hard for them to come to the realization that this is the direction things were heading, but it’s been hard for months.”\n\nOctober 2017—March 2018: Justin Bieber (For the Last Time)\n\nWelp, this dude’s back again. Justin and Selena were seen grabbing breakfast and attending a church service one day before Selena’s breakup with The Weeknd and wasted no time making it clear they were back together. We’re talking public bike rides, hockey game kissing sessions—the whole PR thing. Unfortunately, March 2018 hit and the couple once again broke up. And we all know how this story ends: with Justin marrying Hailey Baldwin and Selena releasing two scathing breakup songs about him.\n\nThat said!!! Sel and Hails seem to have repaired the rift?!?!? IDK what else there is to say because I’m personally still actively recovering from it, so ¯\\_(ツ)_/¯.\n\nOctober 2019: Niall Horan (Again... Maybe)\n\nNothing was official, but the internet lowkey melted down thanks to Selena being spotted multiple times with Niall Horan. AGAIN. I mean, yeah, they were hanging out in a group, but look at his arm around her!\n\nOctober 2021: ...Chris Evans?\n\nAlright, TBD if this checks out, BUT! The rumor mill was buzzing about Chris Evans and Selena in late 2021.\n\nGetty Images\n\nThe evidence? Selena and Chris were apparently spotted hanging out together in Los Angeles (leaving a studio, restaurants, etc.), plus Chris followed Selena on Insta…along with, like, 200 million+ other people. However, the rumors were put to rest once it was confirmed that Chris was actually dating Portuguese actor Alba Baptista (whom he's now married to 🥺❤️). Then, plot twist! In May 2022, Selena hinted at her dating status in a TikTok where she directly said to the camera, “No, I’m fine. I’m totally fine being single, it’s a real thing. It’s fine.” She then panned over to her group of four friends who were all paired off in twos looking super loved-up.\n\nHowever, that clearly was nawt the case for long because she then began dating…\n\nAugust 2022: Andrea Iervolino\n\nJust days after hosting a star-studded party at her Los Angeles home in July 2022, the actor made her way to Italy in *very* good company c/o Italian Canadian film producer Andrea Iervolino. At the time, pics of Sel aboard a yacht in Positano alongside Andrea were released, and I don’t think anyone has personally known peace since.\n\nInterestingly enough, this wasn’t the first time the two had been romantically linked, so there’s that. 👀 Anyway! A source at the time dished to Entertainment Tonight that Sel “is more open to love, but she is also very much focused on herself and her work right now. She’s in a very healthy place. She is feeling fantastic and very mentally, physically, and emotionally healthy.” That said, the two did spend quite a lot of time during her trip dancing, hugging, sharing forehead kisses, and looking generally ~in love~ on their yacht, as one does when in Italia.\n\nSeptember 2022: Drew Taggart\n\nIn news not a single soul saw coming, Us Weekly reported that Selena and The Chainsmokers's Drew Taggart were an item. According to a source who chatted with the publication, the singer and DJ “aren’t trying to hide their romance by sneaking around at members only clubs,” but are still “very casual and low-key” doing things like bowling and movie dates and generally “having a lot of fun together.”\n\nHowever, Selena debunked the rumor herself pretty swiftly, confirming she is indeed single.\n\nInstagram\n\nAnd this all makes sense since there seemed to be some conflicting dates and receipts. TL;DR: The DJ was spotted on vacation circa December 31, 2022 with Eve Jobs, so the timing of it all didn't exactly square.\n\nMarch 2023: Zayn Malik (Maybe)\n\nIn March 2023, a TikToker posted a surprising vid explaining that both she and her friend work at hot spots often frequented by celebs before sharing a screenshot of her convo with that friend in which she wrote, “Tell me how Selena Gomez and Zayn just walked into [the restaurant] hand in hand making out and I seated them.”\n\nThe user then went on to share further evidence that made the pairing seem likely. Case in point? The fact that, at the time, the One Direction alum had only followed only 18 people on Instagram—one of them being Selena. Plus, although the actor followed a few more individuals than Zayn did—ahem, 247 people, to be exact—, he was one of the lucky few. However, it seems as though the two have since fizzled out, with Sel quietly unfollowing Zayn’s Instagram account in June 2023. As for the singer? Not too long after, fans noticed that he, too, hit the unfollow button.\n\nDecember 2023—RTFN: Benny Blanco\n\nSelena seemingly confirmed she was dating Benny by responding “facts” on a post speculating about their relationship status:\n\nAnd then defended him to fans hitting up her comments:\n\nAnd she dropped a B ring on her finger!\n\nInstagram\n\nPer an Entertainment Tonight source who opened up about the sitch when rumors initially began swirling back in December 2023, “Selena and Benny have been casually seeing each other for a while and more recently, it became more official. Things have been going really well between them and Selena is happy. She thinks Benny is very funny and of course, extremely talented. Selena is in a great place in her life and feels content and relaxed. She is enjoying where things are going.”\n\nCurrently, the two are still as loved up as ever, with them even posting Valentine's Day snaps and birthday tributes that we truly can't get enough of.\n\nBenny Blanco // Instagram\n\nOh, and they're even out here discussing kids, which 🥺❤️. During a May 2024 interview with Howard Stern (per Page Six), the producer was asked whether he wants to “have kids with Selena.” In response, Benny said, “It’s always a topic of conversation to me every day. That’s my next goal, to check the box. I have a ton of godkids; I’ve got a ton of nephews. I love being around kids.”\n\nLove this for them! And for all the deets on Benny and his 'ship with Sel, head right on over this way.", "images": ["http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2025-11-13-at-8-26-25-am-6915dccd7e9c7.png?crop=0.563xw:1.00xh;0.219xw,0&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/cosmopolitan/static/images/logos/logo.eca17dd.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/selena-6511db05b53e1.gif?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/sel-1572385846.png?resize=980:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://hips.hearstapps.com/hmg-prod/images/selling-the-oc-cast-leave-6915b3b002820.jpg?crop=0.505xw:1.00xh;0.274xw,0&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523000000&id=social-button-icon", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-501017436-1626283600.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/giphy-1-1572384683.gif?resize=980:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/prince-andrew-duke-of-york-and-king-charles-iii-attend-news-photo-1763066178.pjpeg?crop=0.758xw:1.00xh;0.122xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2025-11-11-at-6-41-51-am-69132f5ba5e7e.png?crop=1.00xw:0.846xh;0,0&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/selena-gomez-weeknd-instagram-1503608184.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/1471283244-selena-gomez-justin-bieber-katy-perry-movie-premiere-1572380481.jpg?resize=980:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/headphones-regular.117021e.svg?primary=%2523ffffff", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-157460645-1626283412.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/362300405-1945645975821614-4415035223524135426-n-65723d792d7bf.jpg?crop=1xw:0.45xh;0,0.201xh", "https://hips.hearstapps.com/hmg-prod/images/m-the-puppet-master-jeff-probst-addresses-the-remaining-news-photo-1585256153.jpg?crop=0.676xw:1.00xh;0.0401xw,0&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523ffffff&id=social-button-icon", "http://www.cosmopolitan.com/_assets/design-tokens/cosmopolitan/static/images/logos/logo.eca17dd.svg?primary=%2523000000", "https://hips.hearstapps.com/hmg-prod/images/wicked-brand-collabs-2025-69028628d3416.png?crop=0.502xw:1.00xh;0.498xw,0&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/cosmopolitan/static/images/logos/network-logo.722abed.svg?primary=%2523ffffff", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523000000&id=social-button-icon", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/selena-gomez-and-benny-blanco-attend-the-77th-primetime-news-photo-1759177674.pjpeg?crop=0.748xw:1.00xh;0.159xw,0&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-122728966-1572460350.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/selena-weeknd-met-gala-2017-1-1493732633.jpg?resize=980:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/bookmark-simple-regular.9d9d56b.svg", "https://hips.hearstapps.com/hmg-prod/images/singers-selena-gomez-and-justin-bieber-perform-during-dick-news-photo-1695669742.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/img-7359-1674214251.jpeg?crop=1.00xw:0.946xh;0,0.0535xh&resize=980:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523000000&id=social-button-icon", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/x-regular.e414d97.svg", "https://hips.hearstapps.com/hmg-prod/images/1471284201-justin-bieber-selena-gomez-unconditional-1572381118.jpg?resize=980:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/globe-simple-regular.e7f303c.svg", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/sarah-ferguson-duchess-of-york-attends-the-traditional-news-photo-1763131536.pjpeg?crop=0.883xw:1.00xh;0.0595xw,0&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2021-10-07-at-6-25-05-pm-1633645522.png?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/bgus-3411556-011-69147eba7c6d9.jpg?crop=1.00xw:0.668xh;0,0&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/568669905-1390146615809557-6973902315575227966-n-68fa6145198d0.jpg?crop=1xw:0.6417100694444444xh;center,top&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/1471284403-justin-bieber-instagrams-miranda-kerr-1572381092.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-177675304-1626283793.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/img-4502-65730ed60f4b3.jpeg?resize=980:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/disney-night-its-the-most-enchanting-night-of-the-season-as-news-photo-1759888936.pjpeg?crop=0.732xw:0.916xh;0.146xw,0.0581xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/362300405-1945645975821614-4415035223524135426-n-65723d792d7bf.jpg?crop=0.702xw:0.281xh;0,0.201xh&resize=1200:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/saved.ad81f1a.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/season-3-momtok-is-back-but-damaging-revelations-and-news-photo-1763047973.pjpeg?crop=0.668xw:1.00xh;0.167xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2024-02-15-at-7-52-01-am-65ce090ba7648.png?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/7-67c4f5ac0e058.jpg?crop=0.505xw:1.00xh;0.248xw,0&resize=300:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523000000&id=social-button-icon", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/clock-regular.b2f2888.svg", "https://hips.hearstapps.com/hmg-prod/images/untitled-design-2024-09-18t103848-899-66eae66b47c2d.png?crop=0.330xw:0.660xh;0.335xw,0.0929xh&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/caret-left-regular.5546078.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-501007472-1626283934.jpg?resize=980:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/envelope-simple-regular.91a0134.svg"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/362300405-1945645975821614-4415035223524135426-n-65723d792d7bf.jpg?crop=0.702xw:0.281xh;0,0.201xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.cosmopolitan.com/entertainment/celebs/a29627851/selena-gomez-dating-history-past-boyfriends/", "title": "Selena Gomez's Ex Boyfriend List", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Selena Gomez's Dating History - Selena Gomez's Ex Boyfriend List", "description": "Check out Selena Gomez's dating history—from Justin Bieber to Nick Jonas and Orlando Bloom.", "keywords": "HreflangEvergreen", "theme-color": "#000000", "og": {"site_name": "Cosmopolitan", "title": "Here’s Everyone Selena Gomez Has Ever Dated, From Nick Jonas to Benny Blanco", "description": "This also includes not one, but * two * members of One Direction. 👀", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/362300405-1945645975821614-4415035223524135426-n-65723d792d7bf.jpg?crop=0.702xw:0.281xh;0,0.201xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.cosmopolitan.com/entertainment/celebs/a29627851/selena-gomez-dating-history-past-boyfriends/", "type": "article"}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "opinion": "false", "section": "Celebs", "modified_time": "2024-06-10T21:08:00Z", "published_time": "2024-06-10T21:08:00Z"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "parsely-metadata": "{\"socialHeadline\":\"Here’s Everyone Selena Gomez Has Ever Dated, From Nick Jonas to Benny Blanco\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/362300405-1945645975821614-4415035223524135426-n-65723d792d7bf.jpg?crop=1.00xw:0.801xh;0,0&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/362300405-1945645975821614-4415035223524135426-n-65723d792d7bf.jpg?crop=0.702xw:0.281xh;0,0.201xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/362300405-1945645975821614-4415035223524135426-n-65723d792d7bf.jpg?crop=1.00xw:0.801xh;0,0", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/362300405-1945645975821614-4415035223524135426-n-65723d792d7bf.jpg?crop=0.702xw:0.281xh;0,0.201xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "timely", "sailthru.excerpt": "It’s a truth universally acknowledged that the internet loves nothing more than talking about Selena Gomez and Justin Bieber’s relationship even though (1) they’ve been broken up for literal years, (2) they’ve both entirely moved on, (3) he’s married to Hailey Baldwin Bieber, and (4) she's in a whole relationship", "sailthru.tags": "entertainment,Pop Culture,celebs,Celebs,selena-gomez,Selena Gomez,celebrity-relationship-timelines,Celebrity Relationship Timelines,Cosmopolitan-US", "sailthru.date": "2024-06-10 21:08:00", "sailthru.socialtitle": "Here’s Everyone Selena Gomez Has Ever Dated, From Nick Jonas to Benny Blanco", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1718053680.0, "source": "http://www.cosmopolitan.com", "summary": ""}