{"url": "https://en.wikipedia.org/wiki/Hennessy_Carolina", "text": "American influencer and fashion designer (born 1995)\n\nHennessy Carolina Almánzar (born December 22, 1995),[1] is an American influencer, fashion designer and TV personality. Born and raised in New York City, she gained popularity on the VH1 reality TV series Love & Hip Hop: New York.[2][3] She is the younger sister of rapper Cardi B.[4]\n\nEarly life [ edit ]\n\nHennessy Carolina Almánzar was born on December 22, 1995, in the Bronx, New York City,[5][6] to Carlos Julio Almánzar, a White Dominican, and Belkis Clara Durán, a Mixed-race Dominican of Spanish, African, and Taíno descent.[7] She was named after the cognac Hennessy, as her father arrived intoxicated on Hennessy at her birth and suggested the name to her mother.[8][9] She identifies as Afro-Latina and has an older sister, Belcalis Marlenis Almánzar (born 1992), also known as Cardi B.[10] She completed her early education at a local private high school before attending Renaissance High School for Musical Theater & Technology, a vocational high school located on the Herbert H. Lehman High School campus.[11][12]\n\nCareer [ edit ]\n\nHennessy Carolina began her career in late 2015, posting videos on the Vine app alongside her elder sister, Cardi B.[13] Following Vine's success, she transitioned to television.[14] In 2016, Hennessy appeared as herself on episodes of Love & Hip Hop: Check Yourself, after auditioning for the Love & Hip Hop TV series.[15]\n\nHennessy appeared on Love & Hip Hop: New York, with a total of 12 episode appearances throughout the show's run from 2016 to 2018. She first appeared as a guest star in Season 6 of Love & Hip Hop: New York, playing herself as Cardi B's friend and confidante.[16][17] She later joined the supporting cast in Season 7, where she acted as a matchmaker for Cardi B and producer Swift Star.[18] At the Season 7 reunion, Hennessy got into a physical altercation with Major Galore while defending her sister.[19] After leaving the show, Hennessy made a one-episode appearance in Season 8.[20] Additionally, she filmed scenes for two more episodes, but they were cut from the main broadcast and released as bonus content on VH1's website.[21]\n\nHennessy appeared on The Challenge: Champs vs. Stars, a special mini-series of MTV's The Challenge,[22] specifically Season 2, which premiered on April 17, 2018.[23] In an interview, Hennessy admitted that appearing on Champs vs. Stars was intimidating. \"To be honest, I was really scared of going on the show because they do a lot,' she said. Although the $150,000 prize goes to a charity of their choice, the competition is complicated by political tensions between The Challenge veterans and celebrity contestants\".[24] She withdrew from the competition after multiple confrontations with cast members, citing concerns for her well-being.[25]\n\nIn a 2018 interview with Paper Magazine, Hennessy reflected on her and her sister Cardi B's rise to fame. \"It's a blessing, but it comes with challenges,\" she said. \"Sometimes you can't express your opinion, and not everyone will agree with you. Overall, it's a blessing.\"[26] Hennessy walked the runway for Philipp Plein's show in Milan in September 2018.[27] Although she was nervous.[28]\n\nIn November 2018, Hennessy collaborated with Boohoo on a limited-edition collection.[29][30] The collection featured sequined dresses, glittery separates, jewel-tone blazers, and strappy heels, all priced under £70 and available in sizes UK 6-24.[31][32] Hennessy appeared on two episodes of the television game show Hip Hop Squares in 2019.[33][34] That same year, in August, she landed a campaign with Moschino.[35][36][37] In a 2019 interview with Galore, Hennessy shared her career aspirations: \"I want to dominate the fashion industry and I would eventually like to get into the makeup industry.[38][39] As of October 2024, Hennessy has accumulated over 8 million followers on Instagram.[40][41]\n\nFilmography [ edit ]\n\nTelevision [ edit ]\n\nPersonal life [ edit ]\n\nHennessy Carolina publicly identified as bisexual in an instagram post in 2018.[42][43] She was in a relationship with Michelle \"Mel\" Diaz from 2017 to 2021.[44]", "images": ["https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Hennessy_Carolina", "title": "Hennessy Carolina", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "viewport": "width=1120", "og": {"title": "Hennessy Carolina - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}