{"url": "en.wikipedia.org/wiki/Lisa_Kudrow", "text": "American actress (born 1963)\n\nLisa Valerie Kudrow ( KOO-droh; born July 30, 1963) is an American actress. She rose to international fame for her role as Phoebe Buffay in the American television sitcom Friends, which aired from 1994 to 2004. The series earned her Primetime Emmy, Screen Actors Guild, Satellite, American Comedy and TV Guide awards. Phoebe has since been named one of the greatest television characters of all time and is considered to be Kudrow's breakout role, spawning her successful film career.\n\nKudrow initially appeared in a 1989 episode of the hit sitcom Cheers playing a character named Emily. She also starred in several episodes of the show Mad About You (1993) as Ursula, before auditioning and earning the role of Phoebe on Friends; her character on Mad About You was written into the Friends storyline as Phoebe's twin. In the late 1990s, Kudrow starred in the cult comedy film Romy and Michele's High School Reunion (1997) and followed it with an acclaimed performance in the comedy/drama The Opposite of Sex (1998), which won her the New York Film Critics Circle Award for Best Supporting Actress and a nomination for the Independent Spirit Award for Best Supporting Female. She created, produced, wrote, and starred in the HBO mockumentary series The Comeback, which initially lasted for one season in 2005 but was revived for a critically acclaimed second season in 2014 and has since been announced to return for a third season in 2026. She was nominated for the Primetime Emmy Award for Outstanding Lead Actress in a Comedy Series for both seasons.\n\nIn 2007, Kudrow received praise for her starring role in the film Kabluey and appeared in the film P.S. I Love You. She produced and starred in the Showtime program Web Therapy (2011–2015), which was nominated for a Primetime Emmy Award. She is a producer on the TLC/NBC reality program Who Do You Think You Are, which has been nominated for a Primetime Emmy Award five times. She played Honey the dog on the FOX animated series HouseBroken.\n\nKudrow has also had roles in Analyze This (1999) and its sequel Analyze That (2002), Dr. Dolittle 2 (2001), Bandslam (2008), Hotel for Dogs (2009), Easy A (2010), Neighbors (2014) and its sequel Neighbors 2: Sorority Rising (2016), The Girl on the Train (2016), The Boss Baby (2017), Long Shot (2019) and Booksmart (2019).\n\nEarly life [ edit ]\n\nLisa Valerie Kudrow[1] was born in the Encino neighborhood of Los Angeles on July 30, 1963,[2] the daughter of Nedra, a travel agent, and Lee Kudrow, a doctor who specialized in treating headaches.[2] She has an older sister, Helene, and two older brothers, David and Derrick.[3] She was raised in a middle-class Jewish family and had a Bat Mitzvah.[4][5] Some of her ancestors came from Ilya, in what is now Belarus.[6] Almost all Jews in Ilya were murdered during the Holocaust, including Kudrow's paternal great-grandmother. Her paternal grandmother left Belarus for Brooklyn, where her father grew up.[7]\n\nKudrow attended Portola Middle School in the Tarzana neighborhood of Los Angeles.[8] She graduated from Taft High School in the Woodland Hills neighborhood, which was attended at the same time by rapper Eazy-E and actress Robin Wright. She received her A.B. in biology from Vassar College in Poughkeepsie, New York, intending to become an expert on headaches like her father.[9] While breaking into acting, she worked for her father for eight years and earned a research credit on his study on the comparative likelihood of left-handed individuals developing cluster headaches.[10]\n\nCareer [ edit ]\n\n1989–1994: Pre-Friends [ edit ]\n\nAt the urging of comedian Jon Lovitz, who was a childhood friend of her brother,[4] Kudrow began her comedic career as a member of The Groundlings, an improv and sketch comedy school in Los Angeles. She has credited Cynthia Szigeti, her improv teacher at The Groundlings, for changing her perspective on acting, calling her \"the best thing that happened, on so many levels\".[11][12] Briefly, Kudrow joined with Conan O'Brien and director Tim Hillman in the short-lived improv troupe Unexpected Company.[13] She was also the only regular female member of the Transformers Comedy Troupe.[14] She played a role in an episode of the NBC sitcom Cheers. She tried out for Saturday Night Live in 1990, but Julia Sweeney was chosen instead.[15] She had a recurring role as Kathy Fleisher in three episodes of season one of the Bob Newhart sitcom Bob (CBS, 1992–1993), a role she played after taking part in the series finale of Newhart's previous series Newhart.[16] Prior to Friends, she appeared in at least two network-produced pilots: NBC's Just Temporary (also known as Temporarily Yours) in 1989, playing Nicole; and CBS' Close Encounters (also known as Matchmaker) in 1990, playing a Valley girl.[17]\n\nKudrow was cast as Roz Doyle in Frasier, but the role was re-cast with Peri Gilpin during the taping of the pilot episode. In 2000, Kudrow explained that when rehearsals started, \"I knew it wasn't working. I could feel it all slipping away, and I was panicking, which only made things worse.\"[4] Her first recurring television role was Ursula Buffay, the eccentric waitress on the NBC sitcom Mad About You.\n\n1994–2004: Friends and worldwide recognition [ edit ]\n\nKudrow, the oldest actor of the main cast, reprised the character of Ursula on the NBC sitcom Friends, in which she co-starred as massage therapist Phoebe Buffay, Ursula's twin sister.[18] Praised for her performance, Kudrow was the first Friends cast member to win an Emmy Award with her 1998 honor as Outstanding Supporting Actress in a Comedy Series for her starring role as Phoebe on Friends (NBC, 1994–2004).[19] Kudrow received critical acclaim for playing Phoebe. According to the Guinness Book of World Records (2005), Kudrow and co-stars Jennifer Aniston and Courteney Cox became the highest paid TV actresses of all time, earning $1 million per episode for the ninth and tenth seasons of Friends.[20] Phoebe has since been named one of the greatest television characters of all time. She played Phoebe until the show ended in 2004. The program was a massive hit and Kudrow, along with her co-stars, gained worldwide recognition. Her character, Phoebe, was especially popular. Entertainment Weekly voted Phoebe on Friends as Kudrow's best performance.[21]\n\nDuring her tenure on Friends, Kudrow appeared in several comedy films such as Romy and Michele's High School Reunion, Hanging Up, Marci X, Dr. Dolittle 2, Analyze This and its sequel Analyze That, and dramatic films, such as Wonderland and The Opposite of Sex. She also guest-starred on numerous television series during Friends, including The Simpsons, Hope and Gloria and King of the Hill, and hosted Saturday Night Live.[22]\n\n2004–present: Post-Friends [ edit ]\n\nFollowing Friends, Kudrow starred as protagonist Valerie Cherish on the single-season HBO series The Comeback (premiered June 5, 2005), about a has-been sitcom star trying for a comeback. She also served as co-creator, writer, and executive producer. Nine years after the original season, HBO revived the series in 2014 for an abbreviated second season. Kudrow received two Emmy nominations for Outstanding Lead Actress in a Comedy Series for her work on The Comeback.[23] Her production company is 'Is or Isn't Entertainment'.[24] Kudrow serves as the executive producer for the U.S. version of the British television series Who Do You Think You Are?, in which celebrities trace their family trees. The subjects of the first series included Kudrow herself, in which it was discovered her great-grandmother was murdered in the Holocaust.[25][26]\n\nKudrow co-created an improvised comedy webseries, Web Therapy on Lstudio.com. The improv series, which launched online in 2008, has earned several Webby nominations and one Outstanding Comedic Performance Webby for Kudrow, who plays therapist Fiona Wallice. She offers her patients three-minute sessions over iChat.[23] In July 2011, a reformatted, half-hour version of the show premiered on Showtime,[27][28] before being cancelled in 2015 after four seasons.[29] Kudrow has guest starred on multiple television series such as Cougar Town, BoJack Horseman, Angie Tribeca, Unbreakable Kimmy Schmidt, and Scandal.[30]\n\nKudrow has appeared in multiple comedic films such as Happy Endings, Hotel for Dogs, Easy A, Neighbors and its sequel Neighbors 2: Sorority Rising, Long Shot, and Booksmart. She also appeared in the romantic drama film P.S. I Love You and co-starred in the thriller film The Girl on the Train.[31] In 2020, Kudrow played Hypatia of Alexandria in season 4 episode 12 of The Good Place \"Patty\", and starred as Maggie Naird in the Netflix comedy series, Space Force.[32] She reunited with her Friends cast mates for an HBO Max unscripted television special titled Friends: The Reunion in May 2021. She is currently, along with Mary McCormack, an executive producer of the syndicated game show, 25 Words or Less; sometimes, Kudrow herself is one of the two celebrity guests playing with a contestant on the show.[33]\n\nIn December 2024, Kudrow starred as Lydia in the Netflix comedy-drama No Good Deed, a role for which she gained positive reviews from critics.[34][35][36]\n\nPersonal life [ edit ]\n\nKudrow married French advertising executive Michel Stern on May 27, 1995. They live in Beverly Hills, California, and have a son born on May 7, 1998.[37][38] Kudrow's pregnancy was written into the fourth season of Friends, with her character having triplets as a surrogate mother for her half-brother and his wife.[39] In addition to her Beverly Hills home, Kudrow maintained a penthouse in Park City, Utah, which she sold in April 2017.[40] She revealed in 2019 that she had experienced body dysmorphic disorder while working on Friends.[41]\n\nFilmography [ edit ]\n\nKey † Denotes works that have not yet been released\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nAwards and nominations [ edit ]\n\nKudrow has been honored with numerous accolades over her career. For her role in the sitcom Friends, she received six nominations at the Primetime Emmy Awards, winning in 1998 for Outstanding Supporting Actress in a Comedy Series, won two Screen Actors Guild Awards, one Satellite Award, one American Comedy award, and one TV Guide award.\n\nIn total, she has received fifteen Emmy nominations, with her most recent nomination in the 2021 Primetime Emmy Awards, twelve nominations and two wins at the Screen Actors Guild Awards, one win and eight nominations at the American Comedy Awards, one Golden Globe nomination, one Banff Rockie award, one Blockbuster Entertainment award, one Chicago Film Critics Association nomination, one Chlotrudis award, two Critics' Choice Television nominations, one Dorian award, one Gracie award, one Independent Spirit nomination, one MTV Movie & TV nomination, one National Society of Film Critics nomination, one New York Film Critics Circle award, one Nickelodeon Kids' Choice nomination, one Online Film Critics Society nomination, one People Magazine award, five nominations and one win at the Satellite Awards, three nominations and one win at the Teen Choice Awards, two Streamy nominations, two nominations and one win at the TV Guide Awards, one Viewers for Quality Television nomination and seven nominations and four wins at the Webby Awards.", "images": ["http://en.wikipedia.org/static/images/icons/wikipedia.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Lisa_Kudrow_at_TIFF_2009.jpg/250px-Lisa_Kudrow_at_TIFF_2009.jpg", "https://upload.wikimedia.org/wikipedia/commons/b/b0/Lisa_Kudrow_at_TIFF_2009.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Lisa_Kudrow_signature.svg/250px-Lisa_Kudrow_signature.svg.png", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/40px-Wikiquote-logo.svg.png", "http://en.wikipedia.org/static/images/footer/wikimedia.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Lisa_Kudrow_at_TIFF_2009.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Lisa_Kudrow", "title": "Lisa Kudrow", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Lisa_Kudrow_at_TIFF_2009.jpg", "width": 797, "height": 1200}, "title": "Lisa Kudrow - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}