{"url": "https://www.inquisitr.com/4277732/selena-gomez-shows-off-in-sheer-dress-on-date-night-with-the-weeknd/", "text": "Selena Gomez has been making headlines this week as she steps out wearing daring date night outfits. The 24-year-old singer was photographed in a black dress on Tuesday that was made shockingly sheer under the camera flashes.\n\nE! News reported on Selena’s little black dress , which showed off her slim figure in ways she may not have anticipated.\n\n“The former Disney star rocked a skin-tight, see-through black dress that left little to the imagination.”\n\nAll eyes were on the high-profile couple as Gomez walked to dinner with The Weeknd following his concert in New York City. The site quoted a source who witnessed the couple dining at the popular Carbone restaurant as Selena’s outfit is said to have turned heads.\n\n“A source dished some details about the couple’s evening and couldn’t help but comment on Gomez’s style, noting that ‘what she was wearing turned heads when she walked in and out.’”\n\nTMZ also picked up on the headline as the site told Gomez to “ beware the camera flash (NSFW) ” as it was apparent she opted to go braless during this particular date night.\n\n“Looks like the only support Selena Gomez is getting these days is from her bf, The Weeknd… based on the braless shots of her leaving dinner in NYC.”\n\nhttps://www.instagram.com/p/BVDOuBhA9Va/\n\nTMZ went on to mention another time Gomez was spotted in a sheer black ensemble back in 2015 as she must now know flashing lights would cause her little black dress to become see-through.\n\n“On the way out, the paps started snapping… and the flashes turned her little black dress see-through. It’s the curse of the LBD, really… and Selena knows it well.”\n\nThe Weeknd, real name Abel Tesfaye, shared a PG-rated image of Gomez during their New York date night to his Instagram. In just eight hours, the photo received over 1 million likes. Abel simply captioned the post “glow” as Selena’s face captures the lights of the restaurant.\n\nHis followers also commented things such as “queen” and “goals” on the post as they expressed support of the relationship. One Instagram user even stated that dating The Weeknd has changed Selena as they implied it as a positive thing. Others informed Tesfaye and Gomez they should stay together long term.\n\n“Ya’ll belong together foreverrr.”\n\nhttps://www.instagram.com/p/BU-mlF0AbEU/\n\nIndeed, it appears as if the couple is enjoying one another’s company quite a bit as they continue to be spotted in public together. Selena was photographed attending The Weeknd’s international concerts before taking a trip to his hometown in Canada. Of course, that was after their romantic trip to Italy together when they first took their relationship public.\n\nThis week, Gomez has been hanging out with Tesfaye in New York where he was scheduled to perform. She seems to be enjoying her time in the city as she recently posted a series of photos documenting yet another date night look.\n\nThe “Bad Liar” shared three images depicting her steamy date night outfit on Monday before she was spotted hand in hand with Abel. Her fans shared their thoughts on the sultry look as over 6 million people liked Selena’s “date night” post.\n\n“You are so beautiful and so is your dress.”\n\nhttps://www.instagram.com/p/BU-msH8ggkA/\n\nTMZ reported on Selena’s “ silky date night ” with Abel as the couple was seen holding hands in Harlem.\n\n“Selena Gomez and The Weeknd turned the streets of Harlem into their own runway show… flanked by bodyguards, of course.”\n\nThe site detailed the couple’s outfits as The Weeknd stuck to his causal attire while Gomez turned heads in her sleek silk gown.\n\n“The couple stepped out Monday night dressed to the nines — more so Selena, but Abel was rocking a sweet jacket too — as they did dinner at famed Italian restaurant RAO’s.”\n\nThe article reminded readers of the first time Selena and Abel were spotted together as they kissed near garbage bins outside a restaurant. Now, they’re not afraid to step out in the spotlight together, and Gomez isn’t shy when it comes to flaunting impressive date night outfits.\n\n[Featured Image by Jesse Grant/Getty Images]", "images": ["https://www.inquisitr.com/wp-content/uploads/2025/10/2421769f-57a4-4bff-913f-cf316747493e.jpg", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20500%20157'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20492%20142'%3E%3C/svg%3E", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo-white.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/inquisitr-logo.png", "https://secure.gravatar.com/avatar/a369debc47cbef84bcb638a0c90682fb?s=120&d=mm&r=g", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent-Dark-Mode.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20120%20120'%3E%3C/svg%3E"], "top_img": "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "keywords": [], "authors": ["News Writer"], "canonical_link": "https://www.inquisitr.com/selena-gomez-shows-off-in-sheer-dress-on-date-night-with-the-weeknd", "title": "Selena Gomez Shows Off In Sheer Dress On Date Night With The Weeknd", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "https://www.inquisitr.com/wp-content/uploads/2024/12/favicon.png", "description": "Selena Gomez has been making headlines this week as she steps out wearing daring date night outfits. The 24-year-old singer was photographed in a black dress", "robots": "follow, index, max-snippet:-1, max-video-preview:-1, max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Selena Gomez Shows Off In Sheer Dress On Date Night With The Weeknd - Inquisitr News", "description": "Selena Gomez has been making headlines this week as she steps out wearing daring date night outfits. The 24-year-old singer was photographed in a black dress", "url": "https://www.inquisitr.com/selena-gomez-shows-off-in-sheer-dress-on-date-night-with-the-weeknd", "site_name": "Inquisitr News"}, "article": {"tag": "the weeknd", "section": "Entertainment", "published_time": "2017-06-08T00:55:00-04:00"}, "twitter": {"card": "summary_large_image", "title": "Selena Gomez Shows Off In Sheer Dress On Date Night With The Weeknd - Inquisitr News", "description": "Selena Gomez has been making headlines this week as she steps out wearing daring date night outfits. The 24-year-old singer was photographed in a black dress", "site": "@theinquisitr", "creator": "@theinquisitr"}, "generator": "WP Rocket 3.18.3"}, "movies": [], "publish_date": 1496897700.0, "source": "https://www.inquisitr.com", "summary": ""}