{"url": "https://itsblossom.com/jennifer-lawrence-trouble-clothes-ad/", "text": "Dior was so close to doing a great thing, but then fumbled at the last minute. For the label’s Cruise 2019 collection, designer Maria Grazia Chiuri based her collection on the beautiful clothing worn by Mexican Escaramuza Charra riders. However, Chirui’s inspiration fell flat when her clothing appeared on Dior’s face, Jennifer Lawrence. Now, both Dior and Lawrence are being accused of cultural appropriation.\n\nEscaramuza is a traditional Mexican sport that is comprised of 10 to 16 women on horseback doing choreographed dancing and stunts to Mexican music. The sport first began at the birth of the Mexican revolution, during which women were allowed to participate and appear at the front of the battle in their traditional dress.\n\nThe wardrobe of the Escaramuza is as beautiful and precise as their routines, and an Escaramuza team must adhere to strict guidelines when crafting their uniform. Frills, shawls, ornaments, boots, and hats are all musts, and give fashion labels like Dior a lot to drool over.\n\nHowever, by putting Jennifer Lawrence — who is neither Mexican nor Latina — in clothing inspired by such culturally important dress for Mexican women has many questioning whether or not Dior cares about the cultural significance of the Escaramuza at all.\n\nLawrence said in a behind-the-scenes clip from the photoshoot featured on Dior’s Instagram, “One of the main inspirations of this collection is the traditional women riders of Mexico. I’m really excited that this collection is looking at and celebrating these women’s heritage through such a modern lens.”\n\nMany fault Dior for lacking the wherewithal to cast a Mexican model as the face of the collection. Although Lawrence should have seen through the culturally appropriative problem, it’s more disappointing that Dior is just that oblivious.\n\nhow many marketing meetings did the @Dior team go through before deciding Jennifer Lawrence was the best face for a “modern Mexican” inspired line — indigo (@indigogurt) November 14, 2018\n\nWell this is super fucked up! This collection was inspired by 'women riders in Mexico' but is faced by Jennifer Lawrence and the shoot took place in California.....for real @Dior ????? https://t.co/7U5WMHHEk2 — Margot Woll (@margotwoll) November 13, 2018\n\nDior did feature a team of Escaramuza, wearing uniforms from Chirui’s collection, in the the label’s Cruise 2019 fashion show. However, the models presenting the inspired clothing on the runway were primarily white. It’s a bit boggling how Dior completely missed the mark.\n\n[fm_youtube url=\"https://www.youtube.com/watch?v=whY-5h4w6Ok\"]\n\nThis cultural appropriation slip up is an obvious reminder that the fashion industry still has a long road ahead of them in terms of diversification and inclusion. Labels must become more aware of the impact they have on culture and society, and do more to make formative statements with their collections.", "images": ["https://itsblossom.com/wp-content/uploads/2018/11/dior.png", "https://secure.gravatar.com/avatar/15582943fcd700a6a538709c95c9fbdf139ada5007a578504e3471ec0115136d?s=96&d=mm&r=g"], "top_img": "https://itsblossom.com/wp-content/uploads/2018/11/dior.png", "keywords": [], "authors": ["Abssar Ch"], "canonical_link": "https://itsblossom.com/fashion/jennifer-lawrence-trouble-clothes-ad/", "title": "Jennifer Lawrence Is In Serious Trouble For The Clothes She’s Wearing In This Ad", "meta_data": {"robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Discover the best DIY projects, life hacks, and crafty ideas to add a little magic to your daily routine.", "og": {"locale": "en_US", "type": "website", "title": "Inspiration For Your Most Creative Self", "description": "DIY projects, life hacks, and crafty ideas to make everyday life easier and more fun.", "url": "https://www.stgitsblsm.wpenginepowered.com", "site_name": "Blossom", "image": {"identifier": "https://itsblossom.com/wp-content/uploads/2018/11/dior.png", "width": 595, "height": 595, "type": "image/png"}}, "article": {"published_time": "2018-11-15T18:04:57+00:00"}, "author": "Abssar ch", "twitter": {"card": "summary_large_image", "label1": "Written by", "data1": "Abssar ch", "label2": "Est. reading time", "data2": "2 minutes", "domain": "stgitsblsm.wpenginepowered.com", "url": "https://www.stgitsblsm.wpenginepowered.com", "title": "Inspiration For Your Most Creative Self", "description": "DIY projects, life hacks, and crafty ideas to make everyday life easier and more fun."}, "tags": "clothing,cultural appropriation,Dior,Dior Cruise 2019,Escaramuza Charra,ezaramuza,fashion,Jennifer Lawrence,Maria Grazia Chiuri,mexican,mexico,news,trending,Trending Topics", "msapplication-TileImage": "https://itsblossom.com/wp-content/uploads/2023/11/fav.png", "viewport": "width=device-width, user-scalable=yes, maximum-scale=1"}, "movies": [], "publish_date": 1542305097.0, "source": "https://itsblossom.com", "summary": ""}