{"url": "https://www.visitdeepcreek.com/pages/MemberNews1", "text": "Posted 11/17/25\n\nOAKLAND, Md., Nov. 14, 2025 /PRNewswire/ -- First United Corporation (NASDAQ: FUNC) and First United Bank & Trust today announced that Carissa L. Rodeheaver, Chairman of the Board, President, and Chief Executive Officer, will retire at the conclusion of the 2026 annual meeting of shareholders currently scheduled for May 7, 2026. To facilitate the succession of management, effective January 1, 2026, Ms. Rodeheaver will serve as Executive Chairman of the Corporation and the Bank until her retirement.\n\nCarissa Rodeheaver has served as CEO since 2016, leading the Company through transformative growth, innovation, and strategic expansion. Under her leadership, First United achieved record financial performance, increased stock price, delivered steady dividend payments, and enhanced its reputation as a trusted industry leader by maintaining a balanced approach to growth and risk management.\n\n\"It has been the honor of my 33+ year career to serve First United and its stakeholders,\" said Rodeheaver. \"I am deeply proud of what we've accomplished together through our commitment to community banking and am confident in the Company's future.\"\n\nDuring her tenure, Rodeheaver championed initiatives that enhanced shareholder value, advanced digital transformation, and fostered a culture of integrity, inclusion, and community engagement, including having established the First United Community Dreams Foundation and launch of the Company's trademarked financial education platform, Finture. Rodeheaver was instrumental in steering First United through shifting regulatory environments and economic challenges, all while strengthening its commitment to customer-focused philosophies and operational excellence.\n\nThe Board of Directors has implemented a succession plan whereby Jason B. Rush, Senior Vice President & Chief Operating Officer, will succeed Rodeheaver as President and Chief Executive Officer of both the Corporation and the Bank effective January 1, 2026, and the boards of directors intend to elect Mr. Rush to serve as a director of the Corporation and the Bank. Mr. Rush has served as Senior Vice President and Chief Operating Officer of the Corporation and the Bank since January 2017 and has held various roles since joining the Bank in 1993.\n\n\"On behalf of the Board, I want to express our deepest gratitude to Carissa Rodeheaver for her visionary leadership and unwavering commitment to excellence,\" said Brian R. Boal, Lead Independent Director. \"Thanks to her dedication to long-term growth and focus on leadership development, First United is well-positioned for continued success.\"\n\nFollowing retirement, Rodeheaver will remain available in an advisory capacity to support a seamless transition and looks forward to dedicating more time to family, travel and those items that bring her personal joy.\n\nFirst United Corporation operates one full-service commercial bank, First United Bank & Trust. The Bank, which is celebrating its 125th anniversary in 2025, has a network of community offices in Garrett, Allegany, Washington, and Frederick counties in Maryland, as well as Mineral, Berkeley, and Monongalia counties in West Virginia. First United's website can be located at MyBank.com. As of September 30, 2025, the Corporation posted assets of $2 billion.", "images": ["https://growthzonecmsprodeastus.azureedge.net/sites/578/2018/07/gcchamber_stackedlogo_20210916.jpg", "https://growthzonecmsprodeastus.azureedge.net/sites/578/2021/12/cropped-SLA_sm-2-32x32.png", "https://growthzonecmsprodeastus.azureedge.net/sites/578/2018/07/Maryland-Tourism-Logo_URL_4C_website2.jpg", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAALkAAABkAQAAAADydqwAAAAAAnRSTlMAAHaTzTgAAAAZSURBVEjH7cEBDQAAAMKg909tDjegAAB4MwnEAAEAx8GgAAAAAElFTkSuQmCC", "https://growthzonecmsprodeastus.azureedge.net/sites/578/2018/07/248.jpg", "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2021/12/SLA_sm-2.png", "https://growthzonecmsprodeastus.azureedge.net/sites/578/2018/07/Annual_AGF_Logo.jpg", "https://growthzonecmsprodeastus.azureedge.net/sites/578/2018/07/MountainMarylandLogo_NEWwebsite-3.jpg"], "top_img": "https://growthzonecmsprodeastus.azureedge.net/sites/578/2021/12/cropped-SLA_sm-2-32x32.png", "keywords": [], "authors": [], "canonical_link": "https://www.visitdeepcreek.com/member-news/", "title": "Member News", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Member News", "description": "First United Corporation Announces Planned Retirement of Chairman of the Board, President & CEO Carissa L. Rodeheaver Posted 11/17/25 OAKLAND, Md., Nov. 14, 2025 /PRNewswire/ — First United Corporation (NASDAQ: FUNC) and First United Bank & Trust today announced that Carissa L. Rodeheaver, Chairman of the Board, President, and Chief Executive Officer, will retire at…", "url": "https://www.visitdeepcreek.com/member-news/", "site_name": "Garrett County Chamber of Commerce"}, "article": {"modified_time": "2025-11-17T15:01:05+00:00"}, "twitter": {"card": "summary_large_image"}, "generator": "WordPress 6.1.1", "msapplication-TileImage": "https://growthzonecmsprodeastus.azureedge.net/sites/578/2021/12/cropped-SLA_sm-2-270x270.png", "google-site-verification": "0ybERtUepYNzK3mfAaYBnaB8PEQIF0svZs4YjZzsDPs"}, "movies": [], "publish_date": null, "source": "https://www.visitdeepcreek.com", "summary": ""}