{"url": "https://www.harpersbazaar.com/celebrity/latest/a23457080/meghan-markle-prince-harry-first-public-appearance-one-year-anniversary/", "text": "16 min read\n\nLong before she was a royal, Meghan Markle was asked in an interview whether she would date Prince William or Prince Harry, to which she offhandedly replied, “Harry, sure.” Now, the two are happily married with two kids.\n\nTheir love story began with a blind date in 2016 and peaked with a royal wedding in 2018. But in 2020, following waves of British-tabloid harassment, the Duke and Duchess of Sussex made the decision to live their lives outside of the monarchy. Since then, the two have launched their own careers and projects—including Meghan’s award-winning podcast, Archetypes, and Harry’s tell-all memoir, Spare.\n\nAhead, see highlights from the pair’s relationship through the years.\n\nNovember 11, 2025: Meghan honors Harry on Veterans Day.\n\nIn honor of Veterans Day, Meghan shares a sweet tribute to Harry, who served in the British Army for a decade, during which he was deployed to Afghanistan twice. Her post features a video of her husband from that time, with the caption: “As my husband says, ‘Once served. Always serving.’”\n\n“Thank you to all who served, sacrificed, and continue to serve,” she continues. “Honoring you on Veterans Day. And every day.”\n\nOn the same night, Harry and Meghan show up to support Serena Williams at the Baby2Baby Gala, and celebrate Kris Jenner’s 70th birthday at Jeff Bezos’s Los Angeles home. For the occasion, they pull out matching black looks: hers, a high-slit black dress with long sleeves and a figure-hugging silhouette; and his, a velvet black blazer worn open to reveal a white button-down, satin bowtie, and red poppy pin in honor of Remembrance Sunday.\n\nRMCL, NGRE // BACKGRID\n\nThe duo heads to Los Angeles’ Dodger Stadium to cheer on their team with matching hats and tons of spirit. Photos from the evening show Meghan and Harry jumping up from their seats to celebrate, and the former layering a cozy sweater over her classic white button-down.\n\nJoe Scarnici // Getty Images\n\nOctober 26, 2025: They get into the fall festivities.\n\nFor the ultimate Sunday family activity, the couple takes their children pumpkin picking days before Halloween. In a video on Meghan’s Instagram, the children run around a maze, pick out pumpkins, and go for hayrides—while the adults cut out the jack-o’-lanterns and watch on.\n\nOctober 2025: They spend a week in NYC.\n\nMeghan shares an Instagram reel full of pizza slices, NYC-themed cookies, and couple moments from their trip to New York. During their time in the city, they make a public appearance for the Project Healthy Minds Gala, where they are honored with the Humanitarians of the Year Award for their work with the Archewell Foundation, and even manage to step out for a fall date night.\n\nKristina Bumphrey // Getty Images\n\nSeptember 15, 2025: Meghan wishes Harry a HBD with a steamy throwback.\n\nFor another throwback moment, Meghan shares an old photo of Harry in his military uniform in honor of his 41th birthday. In the pic, his red hair is messy, and he is giving the camera a smoldering, unbothered look. “Oh hi, Birthday Boy 🔥,” she captions it.\n\nJune 2025: Meghan shares sweet throwback videos for several summer holidays.\n\nOn Lilibeth’s fourth birthday, Meghan shares two photos of Harry with their daughter, and later posts a behind-the-scenes look from the hospital, where she and Harry danced the day away. “Both of our children were a week past their due dates,” she shares. “So when spicy food, all that walking, and acupuncture didn’t work—there was only one thing left to do!”\n\nLater, on Father’s Day, she continues the nostalgia run with the sweetest video montage celebrating Harry’s journey as a father—including new clips of their growing family.\n\nAnd, on July 4, she lets us in on how her children are continuing her and Harry’s traditions: “Our second date was the 4th of July 2016 and H brought me cupcakes to celebrate. Now, all these years later, our two children are in on the tradition.”\n\nMay 19, 2025: They celebrate their 7th wedding anniversary.\n\nMeghan takes to Instagram to share a glimpse behind the curtain, with a collage of intimate family photos, including selfies from their early years, several sweet notes, and even a sonogram. She captioned the post with: “Thanks to all of you (whether by our side, or from afar) who have loved and supported us throughout our love story—we appreciate you.”\n\nMay 9, 2025: They attend Beyoncé’s Cowboy Carter tour in LA.\n\nThe couple puts a cowboy twist on date night fashion while dancing the night away at Beyoncé’s Cowboy Carter show in LA. In a photo shared to the artist’s website, Meghan and Harry cozy up in a suite, wearing western-themed looks.\n\nBeyoncé.com\n\nMarch 2025: Harry makes a cameo in Meghan’s Netflix show.\n\nHarry appears in the season one finale of Meghan’s lifestyle show, With Love, Meghan. Harry joins various other friends and loved ones—including Meghan’s mom, Doria Ragland—for a garden brunch. “Well done. You did a great job. I love it,” he tells Meghan while embracing her.\n\nNetflix\n\nIn another scene, Meghan confirms her official last name change—correcting Mindy Kaling, after she calls her by her maiden name. “It’s so funny you keep saying Meghan Markle. You know I'm Sussex now,” she shared. “You have kids and you go, I share my name with my children… I didn’t know how meaningful it would be to me but it just means so much to go, this is our family name. Our little family name.”\n\nFebruary 2025: They attend the winter Invictus Games.\n\nMeghan joins Harry for the first winter sports iteration of the Invictus Games, held this year in Canada. The two attend events together, meet with competitors, and even take some time to go tubing.\n\n“It’s incredible to be back in Canada. Canada couldn’t be more appropriate to host the first Winter Games. Everyone is so excited,” Harry says in an interview with People. “To have my wife here supporting me is amazing. I love that she’s by my side. It’s such an important piece to this whole adventure.”\n\nEric Charbonneau // Getty Images\n\nAugust 20, 2024: They travel to Colombia.\n\nThe Sussexes embark on a four-day trip to Colombia, where they visit local schools and charities, host empowerment panels, participate in Invictus Games training sessions, and get to know local communities and their customs. They are guided for most of the trip by Vice President Francia Márquez, who invited the couple to visit the country, and throughout their stay, Meghan shows off a string of inspiring vacation outfits.\n\nHarper’s Bazaar follows the couple on the ground as the exclusive media outlet assigned to the visit. See all the photos here.\n\nEric Charbonneau // Getty Images\n\nMay 10, 2024: They look so in love on visit to Nigeria.\n\nAhead of the Invictus Games, the couple arrives in Nigeria for a days-long trip to meet with locals about sports, mental health programs, leadership initiatives, and more.\n\nAt a school visit in the morning, Harry delivers a touching speech about mental wellness to some young kids, prompting wife Meghan to gush about him once he’s done.\n\nKOLA SULAIMON // Getty Images\n\n“Every single person in this room—the youngest, the oldest, every single person—has mental health,” the prince says. “And the more you talk about it, the more you can kick stigma away—far, far away into long grass—and then everybody will have the opportunity to be able to share how they’re feeling, how they’re coping, and then you can help other people.”\n\nAs Harry hands over the mic, Meghan says, “You see why I’m married to him?” There are cheers and a whoop. “It so inspiring, because he speaks the truth,” she adds.\n\nKOLA SULAIMON // Getty Images\n\nMarch 4, 2023: Harry says Meghan \"saved\" him.\n\nIn a livestream conversation with Dr. Gabor Maté, author of The Myth of Normal: Trauma, Illness, and Healing in a Toxic Culture, the prince opens up about the way Meghan changed his life and helped \"save\" him from himself during a time when he felt \"stuck\" within the royal institution.\n\n\n\n\"My wife saved me. I was stuck in this world, and she was from a different world and helped draw me out of that,\" Harry says. \"But none of the elements of my life now would have been possible without me seeing it for myself.\"\n\nHe continues, \"My partner is an exceptional human being, and I'm eternally grateful for the wisdom and the space that she has been able to give me.\"\n\nJanuary 10, 2023: Harry releases his memoir, Spare.\n\nIn his much-awaited book, the prince reveals one shocking personal truth after another—including the way he lost his virginity, the day he re-created his mother's last moments, and the brutal physical fight he had with his brother, Prince William.\n\nHe also writes a lot about his wife, reflecting on her relationship with Will and Princess Kate, giving details about their life together in England, recalling Meghan's mental health battle, and speaking of the moment they knew they had to step away from the royal family.\n\nDecember 8, 2022: Their Netflix docuseries, Harry & Meghan, premieres.\n\nThe royal pair drop their Netflix docuseries, Harry & Meghan, which offers intimate glimpses into their relationship in its beginning stages, their life and struggles in the royal family, and their current lifestyle now.\n\nOctober 19, 2022: Meghan opens up about her and Harry's life at home.\n\nIn a rare video interview with Variety, Meghan shares new details surrounding her quiet home life in Montecito with Harry, which involves working collaboratively on their projects and raising their two kids, Archie, 3, and Lilibet, 1—a packed routine Meghan calls a \"true blessing.\"\n\n\"We share an office. We work from home, as most people started to do during lockdown,\" Meghan says. \"It allows us to have significant time with our kids at this really special moment in their lives. We'll never get this time back.\"\n\nShe adds that on a normal day, \"I make breakfast, and we get the kids set for the day. We do a lot of joint calls and Zooms, but also try to divide what we can focus our energies on so we can accomplish even more.\"\n\nSeptember 10, 2022: They reunite with the royals at Queen Elizabeth II's funeral.\n\nHarry and Meghan return to the United Kingdom to pay their respects to Queen Elizabeth II, who passed away on September 8 at Balmoral Castle. The two are photographed with William and Kate, who share newly minted titles as Prince and Princess of Wales.\n\nChris Jackson // Getty Images The Prince and Princess of Wales and the Duke and Duchess of Sussex outside Windsor Castle at the late Queen Elizabeth II’s funeral.\n\nOctober 23, 2021: They release Harry & Meghan: An African Journey.\n\nThe two release their documentary Harry & Meghan: An African Journey, which gives a glimpse into their royal tour in South Africa. The project reveals a first glimpse of baby Archie, as well as details on the intense media scrutiny and rumored royal rifts the Sussexes have faced.\n\nIn one interview, Meghan gets candid for the first time about the extent of her struggles within the royal family and reflects on her naiveté surrounding what she thought it would be like living in the spotlight as an American-born royal.\n\n\"In all fairness I had no idea, which probably sounds difficult to understand and hear,\" Meghan says. \"But when I first met my now-husband, my friends were really happy because I was so happy, but my British friends said to me, 'I'm sure he's great but you shouldn't do it because the British tabloids will destroy your life.'\"\n\nShe continues, \"And I very naively—I'm American, we don't have that there—[I said], 'What are you talking about? That doesn't make any sense. I'm not in any tabloids.' I didn't get it. So it's been, yeah, it's been complicated.\"\n\nJune 4, 2021: Princess Lilibet is born.\n\nMeghan and Harry welcome their second child, Princess Lilibet of Sussex, at Santa Barbara Cottage Hospital in California. Their newborn daughter's name, \"Lilibet Diana,\" takes after the pet name of great-grandmother Queen Elizabeth and honors her paternal grandmother, the late Princess Diana.\n\nMay 21, 2021: Harry discusses Meghan's mental health struggles.\n\nIn an episode of The Me You Can't See, Harry's Apple TV series dedicated to de-stigmatizing mental health, the prince gets candid about the devastating toll royal life has had on Meghan, and recalls his concern at her suicidal thoughts.\n\n\"Meghan decided to share with me the suicidal thoughts and the practicalities of how she was going to end her life,\" the Duke of Sussex explains. \"The scariest thing for her was her clarity of thought. She hadn't lost it. She wasn't crazy. She wasn't self-medicating, be it through pills or through alcohol. She was absolutely sober. She was completely sane.\"\n\n\n\nHarry continues, \"The thing that stopped her from seeing it through was how unfair it would be to me after everything that happened to my mum and to now be put in the position of losing another woman in my life with a baby inside of her, our baby.\"\n\nMarch 7, 2021: They break their silence on their royal leave in a tell-all interview with Oprah Winfrey.\n\n\n\nFollowing months spent away from the limelight after leaving the royal family, the two make an official public reappearance in a bombshell interview on Oprah Winfrey's Emmy-nominated television special, Oprah with Meghan and Harry. During the talk, they reveal unnerving new details surrounding the extent of their traumatic experiences with the royal family—from the overt racism Meghan experienced from unspecified royal members, to the ongoing harassment and slander against the pair by the British tabloids.\n\nIn a heartbreaking part of the interview, the duchess confesses that around six months into her first pregnancy, during the height of royal tensions, she was suffering so much that she \"didn't want to be alive anymore.\"\n\n\"I thought my family would help, but every single ask, request, warning, whatever, it just got met with total silence, total neglect,\" Harry later adds. \"We spent four years trying to make it work. We did everything that we possibly could to stay there and carry on doing the role and doing the job. But Meghan was struggling.\"\n\nJanuary 8, 2020: They announce their royal exit.\n\nFollowing months of tabloid attacks on Meghan—and ongoing rumors surrounding the Sussexes' rising tensions with the rest of the royal family—the duke and duchess finally announce in an official joint statement shared to their Instagram page that they have decided to step down as senior members of the royal family.\n\n\"After many months of reflection and internal discussions, we have chosen to make a transition this year in starting to carve out a progressive new role within this institution,\" their message reads. \"We intend to step back as ‘senior’ members of the Royal Family and work to become financially independent, while continuing to fully support Her Majesty The Queen.\"\n\nThey continue, \"It is with your encouragement, particularly over the last few years, that we feel prepared to make this adjustment. We now plan to balance our time between the United Kingdom and North America, continuing to honour our duty to The Queen, the Commonwealth, and our patronages. This geographic balance will enable us to raise our son with an appreciation for the royal tradition into which he was born, while also providing our family with the space to focus on the next chapter, including the launch of our new charitable entity.\"\n\nIn the months following Harry and Meghan's royal exit, the pair spend time in both Canada and the United States. They have since moved permanently to California.\n\nMay 6, 2019: Archie Mountbatten-Windsor is born.\n\nThe two welcome their first royal child together, Prince Archie of Sussex.\n\nIn his first television interview fresh off the birth, Harry says elatedly, \"I'm so incredibly proud of my wife. As every father and parent would ever say, your baby is absolutely amazing. But this little thing is absolutely to die for. So I'm just over the moon.\"\n\nDecember 25, 2018: They spend the holidays with William and Kate.\n\nHarry and Meghan spend their first Christmas as a royal pair with the then Duke and Duchess of Cambridge.\n\nStephen Pond // Getty Images\n\nJuly 10, 2018: The Sussexes and Cambridges make their first major appearance.\n\nIn their first major royal event as royal newlyweds, the Sussexes get together with William and Kate to honor the Centenary of the RAF at Buckingham Palace, where they observe a flypast for the occasion.\n\nMax Mumby/Indigo // Getty Images\n\nMay 19, 2018: They get married.\n\nHarry and Meghan marry at St. George's Chapel at Windsor Castle in a star-studded ceremony that becomes the most-watched royal wedding in the world.\n\nOn this day, Meghan is officially granted her royal title at the occasion: Meghan, Duchess of Sussex.\n\nBEN STANSALL // Getty Images\n\nNotable attendees at the wedding include Serena Williams, George Clooney, and James Corden, as well as several of Meghan's Suits costars: Patrick J. Adams (Mike Ross), Gabriel Macht (Harvey Specter), and Sarah Rafferty (Donna Paulsen).\n\nIdris Elba, a longtime friend of Harry's, is also in attendance, and deejays at the reception, where upon Meghan's request, he plays Whitney Houston's \"I Wanna Dance with Somebody\" during the new royal's first dance with Harry.\n\nFebruary 28, 2018: They appear with the Duke and Duchess of Cambridge.\n\nThe fiancés appear publicly for the first time with Prince William and Kate Middleton—who at the time are expecting their third royal child, Prince Louis—at the first annual Royal Foundation Forum held at Aviva.\n\nChris Jackson // Getty Images\n\nNovember 27, 2017: They announce their engagement.\n\nKensington Palace announces that the pair have officially gotten engaged following about a year of dating.\n\nMeghan's parents, Thomas Markle and Doria Ragland, express their congratulations in a public statement shared by the palace on Twitter.\n\n\"We are incredibly happy for Meghan and Harry,\" they write in the statement. \"Our daughter has always been a kind and loving person. To see her union with Harry, who shares the same qualities, is a source of great joy for us as parents. We wish them a lifetime of happiness and are very excited for their future together.\"\n\nThe Prince and Princess of Wales additionally offer their congratulations to the new fiancés.\n\n\"We are very excited for Harry and Meghan,\" the then Duke and Duchess of Cambridge say of the engagement, via their Twitter. \"It has been wonderful getting to know Meghan and to see how happy she and Harry are together.\"\n\nFollowing the confirmation from Kensington Palace, the newly engaged couple make an appearance on BBC for their first-ever joint interview, divulging fresh details surrounding their relationship—including how they first met and how they've been looking ahead to their future royal roles.\n\nAt this time, Meghan expresses her excitement over what's in store for her as a soon-to-be duchess and says how she plans to utilize her new platform.\n\n\"You realize, once you have access or a voice that people are willing to listen to, with that comes a lot of responsibility, which I take seriously,\" Meghan says. \"At the same time, I think in these beginning few months, and now being boots on the ground in the U.K., I'm excited to just really get to know more about the different communities here, smaller organizations who are working on the same causes that I've always been passionate about under this umbrella, and also being able to go around to the Commonwealth.\"\n\n\"I think it's just the beginning of a—,\" she continues, at which point Harry chimes in to say, \"There's a lot to do.\"\n\nSeptember 2017: They meet each other's family members.\n\nThe pair make an affectionate joint appearance in Toronto for the Invictus Games—which Harry also hosts—where they are joined by Meghan's mother, Doria Ragland.\n\nKarwai Tang // Getty Images\n\nLater in the month, Us Weekly reports that Meghan has been introduced to Harry's grandmother Queen Elizabeth II.\n\nSeptember 5, 2017: Meghan publicly acknowledges her relationship for the first time.\n\nMeghan discusses her relationship with Harry during a cover interview for Vanity Fair.\n\n\"We're in love,\" she tells the magazine. \"I'm sure there will be a time when we will have to come forward and present ourselves and have stories to tell, but I hope what people will understand is that this is our time. This is for us. It's part of what makes it so special, that it's just ours. But we're happy. Personally, I love a great love story.\"\n\nShe also gets candid about the relationship's accompanying challenges.\n\n\"It comes in waves,\" she says, \"some days it can feel more challenging than others.\"\n\nShe adds, \"Right out of the gate it was surprising the way things changed. But I still have this support system all around me, and, of course, my boyfriend's support.\"\n\nMay 6, 2017: They attend their first public event together.\n\nThe two are captured sharing a kiss during a polo event in Ascot, in what marks their first public appearance together as a couple.\n\nNovember 8, 2016: Their relationship is Kensington confirmed.\n\nFollowing romance rumors that began the previous month, Kensington Palace releases a statement on social media confirming Harry and Meghan's relationship. In a reprimanding address, the palace implores the public to stop their ongoing harassments of Harry and \"his girlfriend, Meghan Markle.\"\n\n\"Prince Harry is worried about Ms Markle's safety and is deeply disappointed that he has not been able to protect her,\" the note reads. \"It is not right that a few months into a relationship with him that Ms Markle should be subjected to such a storm.\"\n\nA month later, in December, the two are photographed together for the first time, followed by another sweet outing in London around the holidays.\n\nAugust 2016: They take a trip to Africa.\n\nFollowing their electric first date, Harry and Meghan take a trip to Botswana, and their romantic connection blossoms.\n\n\"It was three, maybe four, weeks later that I managed to persuade her to come join me in Botswana, and we camped out with each other, under the stars,\" Harry recalls of the romantic trip during their post-engagement BBC interview. \"She came and joined me for five days out there, which was absolutely fantastic. Then we were really by ourselves, which was crucial to me to make sure that we had a chance to get to know each other.\"\n\nThe following summer, Meghan and Harry return to Botswana to celebrate their first anniversary, per Vanity Fair.\n\nMonths later, the prince gets down on one knee, proposing to her with an engagement ring featuring an African stone, as well as two smaller diamonds from one of Princess Diana's brooches.\n\nJuly 2016: They meet through a mutual friend.\n\nThe prince and Suits actress first connect online through a mutual friend. Harry later reveals in the first episode of Harry & Meghan that a Snapchat photo of their friend and Meghan using the dog filter piqued his interest and prompted him to reach out to ask who Meghan was.\n\n\"Meghan and I met over Instagram. I was scrolling through my feed and someone who was a friend had a video of the two of them, like a Snapchat,\" Harry explains. \"With dog ears. That was the first thing. I was like, 'Who is that?'\"\n\nFollowing direct messages over Instagram, the two go out on a blind date in London, while Meghan is in town for Wimbledon—and Harry shows up late.\n\n\"You were late,\" Meghan points out to Harry, adding, \"And I didn't know him. So I was like, 'Oh, is this what he does?'\"\n\nThe quick date eventually leads to sparks, and in light of their long-distance circumstances, the two set a schedule to see each other every several weeks.", "images": ["https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/meghan-markle-and-prince-harry-attend-the-wheelchair-tennis-news-photo-1680656215.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/x-regular.e414d97.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/caret-left-regular.5546078.svg", "https://www.harpersbazaar.com/_assets/design-tokens/harpersbazaar/static/images/logos/logo.823d7af.svg?primary=%2523ffffff", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2151728037-67d33e4679c52.jpg?crop=0.663xw:0.500xh;0.123xw,0.00240xh&resize=1200:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/harpersbazaar/static/images/logos/network-logo.6416a85.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/meghan-duchess-of-sussex-prince-harry-duke-of-sussex-at-news-photo-1760196157.pjpeg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=currentColor&id=link-out-embed", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/envelope-simple-regular.91a0134.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523ffffff&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2151727911-663e2eb40141b.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/meghan-duchess-of-sussex-prince-harry-duke-of-sussex-prince-news-photo-1680706533.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/bgus-3411556-002-6910acfeb0376.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/catherine-princess-of-wales-prince-william-prince-of-wales-news-photo-1680648758.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg?primary=%2523ffffff", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2199023202-67d33cedc951f.jpg?resize=980:*", "https://hips.hearstapps.com/rover/profile_photos/21445446-1bde-4290-a24e-2bdd274be027_1521573573.jpg?fill=1:1&resize=160:*", "https://hips.hearstapps.com/hmg-prod/images/with-love-meghan-n-s1-e8-00-32-03-14r-67c6216f1297b.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg", "https://hips.hearstapps.com/hmg-prod/images/britains-prince-harry-duke-of-sussex-and-his-wife-meghan-news-photo-1680653977.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/bookmark-simple-regular.9d9d56b.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2166961796-2-6751b9b28fe97.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/globe-simple-regular.e7f303c.svg", "https://hips.hearstapps.com/hmg-prod/images/screenshot-2025-05-10-at-12-28-34-pm-681f7f17d13ed.png?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2151728037-67d33e4679c52.jpg?crop=1xw:0.84375xh;0.123xw,0.00240xh", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/saved.ad81f1a.svg?primary=%2523000000", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2151728037-663e2eff05d1f.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2243431637-69020b99bf240.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=currentColor&id=link-out-embed", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/prince-william-duke-of-cambridge-catherine-duchess-of-news-photo-1680705911.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/prince-harry-meghan-markle-catherine-duchess-of-cambridge-news-photo-1680706951.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/clock-regular.b2f2888.svg"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2151728037-67d33e4679c52.jpg?crop=0.663xw:0.500xh;0.123xw,0.00240xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.harpersbazaar.com/celebrity/latest/a43480804/prince-harry-meghan-markle-relationship-timeline/", "title": "Meghan Markle and Prince Harry’s Complete Relationship Timeline", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Meghan Markle and Prince Harry’s Complete Relationship Timeline", "description": "Track the Sussexes’ royal romance in its entirety—from their first blind date to their famous royal exit and current low-key family life.", "theme-color": "#000000", "og": {"site_name": "Harper's BAZAAR", "title": "Duchess Meghan Honors Prince Harry on Veterans Day With a Sweet Throwback", "description": "See a complete timeline of their royal romance", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2151728037-67d33e4679c52.jpg?crop=0.663xw:0.500xh;0.123xw,0.00240xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.harpersbazaar.com/celebrity/latest/a43480804/prince-harry-meghan-markle-relationship-timeline/", "type": "article"}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "opinion": "false", "section": "Celebrity News", "modified_time": "2025-11-11T21:30:00Z", "published_time": "2025-11-11T21:30:00Z"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "parsely-metadata": "{\"socialHeadline\":\"Duchess Meghan Honors Prince Harry on Veterans Day With a Sweet Throwback\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2151728037-67d33e4679c52.jpg?crop=0.550xw:0.825xh;0.175xw,0&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2151728037-67d33e4679c52.jpg?crop=0.663xw:0.500xh;0.123xw,0.00240xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2151728037-67d33e4679c52.jpg?crop=0.550xw:0.825xh;0.175xw,0", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2151728037-67d33e4679c52.jpg?crop=0.663xw:0.500xh;0.123xw,0.00240xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "timely", "sailthru.excerpt": "Long before she was a royal, Meghan Markle was asked in an interview whether she would date Prince William or Prince Harry, to which she offhandedly replied, “Harry, sure.” Now, the two are happily married with two kids.  Their love story began with a blind date in 2016 and", "sailthru.tags": "celebrity,Celebrity,latest,Celebrity News,celebrity-relationships,Celebrity Relationship News,royal-news,Latest Royal News,Harper's BAZAAR-US", "sailthru.date": "2025-11-11 21:30:00", "sailthru.socialtitle": "Duchess Meghan Honors Prince Harry on Veterans Day With a Sweet Throwback", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1762896600.0, "source": "https://www.harpersbazaar.com", "summary": ""}