{"url": "https://www.thesun.co.uk/sport/7804275/deontay-wilder-fiancee-telli-swift-divorce-jessica-scales-wife/", "text": "AFTER being demolished by Zhelei Zhang a year ago, Deontay Wilder is set for two confidence-building comeback fights before eyeing a mouthwatering double-header with Anthony Joshua.\n\nThe former WBC heavyweight champ returns against little-known Tyrrell Herndon on Saturday, June 28, 2025 — Here’s everything you need to know about his ex-fiancee Telli Swift.\n\nWho is Telli Swift?\n\nTelli Swift was born on January 24, 1987, in Zambales, Philippines.\n\nShe grew up in Japan and later moved to California.\n\nHer real name is Shuntel, only taking on ‘Telli’ once she was famous.\n\nShe began modelling when she was just three and appeared in a variety of beauty pageants.\n\nTelli is a reality TV star in her own right and is often seen rubbing shoulders with the rich and famous.\n\nHow they met\n\nTelli met Dontay Wilder in 2015 — the pair began dating shortly afterwards.\n\nSpeaking exclusively to The Sun in 2019, Telli said: “We met at LAX airport four years ago.\n\n“We saw each other from a distance at check-in, then again at TSA, then he finally spoke to me while we were both going to our gates.\n\nMOST READ IN BOXING INKED UP Conor Benn's tattoos explained: What do they say and what are their meanings?\n\n“While we were talking, my friend came — I just got out of the hospital from an infection in my leg, which I thought I was going to get amputated if the antibiotics didn’t work.\n\n“I completely stopped talking to him and told my friend what happened with my leg and he left.\n\n“Leave it to Instagram DMs — we got in touch with each other two weeks before my family reunion, which so happened to be in Alabama, where Deontay is from. The rest is history.”\n\nWilder was initially reluctant to propose, fearing he would get his heart broken again, but eventually did so on an episode of Wags Atlanta.\n\nHe said: “I love the girl, though. She got my heart. That’s my baby, that’s my best friend.\n\n“Even though I know I got a real woman and I love her to death, I know that I could give my all to a person and still get f****d over.\n\n“I’m definitely not closed-minded about it, because like I said, I found my best friend.”\n\nThe proposal, on February 15, 2018, was timed to coincide with their child’s gender reveal party, when they found out they were having a daughter.\n\nBreak-up\n\nWilder and Telli’s relationship deteriorated over several years, culminating in a highly public breakup in 2025.\n\nThe split was marked by allegations of domestic violence and legal action.\n\nIn April 2025, Telli was seen moving on with NFL player John Johnson III, while she and WIlder were both embroiled in ongoing court proceedings.\n\nIn June 2024, Telli filed for, and was granted, a temporary restraining order against Wilder in Los Angeles.\n\nIt stated that Wilder must stay at least 100 yards away from Telli, their daughter, and her son until a scheduled court date in June 2025, which was reportedly on the 25th — however, nothing has been reported about the outcome as of June 27, 2025.\n\nTelli accused Wilder of repeated physical abuse, including choking her at least five times since 2018 — once in front of their children — spitting on her and nearly suffocating her by pressing her face into a pillow, per TMZ.\n\nAccording to multiple outlets, she also alleged that Wilder slammed her son’s head against a car, accessed her laptop without consent, sent disturbing messages to her contacts, used home surveillance to spy on her and threw her out of their Atlanta residence shortly after she underwent surgery in April 2024.\n\nTelli claimed Wilder subjected her to constant ridicule, threats to destroy her belongings and coercive sexual demands, expecting intercourse “multiple times a day”, as reported by Marca.\n\nShe expressed fear for her safety, particularly after Wilder’s devastating loss to Zhilei Zhang in June 2024, stating that his emotional state and history of violence made her believe he could become physically violent.\n\nIn her application for the order, Telli said: “I believe Deontay is capable of being physically violent towards me upon his return in June because he has expressed that he is furious with me since April and has been physically abusive with me in the past.”\n\nWilder’s divorce from Jessica Scales-Wilder\n\nWilder married Jessica Scales in 2009 and proceeded to have four children with her — two sons and two daughters.\n\nTheir eldest child, Naieya, has spina bifida, with the boxer often calling her an inspiration as she battles the disability.\n\nThe three others are called Ava, Deontay Jr, and Dereon.\n\nWilder reportedly had an affair with Telli Swift, and eventually divorced Jessica in 2017 after eight years of marriage.\n\nSince then, Jessica has kept a low profile, focusing on being a mum to her children.", "images": ["https://www.thesun.co.uk/wp-content/uploads/2023/12/l-deontay-wilder-attend-heavyweight-562212684.jpg?strip=all&w=211", "https://www.thesun.co.uk/wp-content/uploads/2024/06/NINTCHDBPICT000475630271.jpg?strip=all&w=208", "https://www.thesun.co.uk/wp-content/uploads/2024/06/l-television-personality-telli-swift-452423032.jpg?strip=all&w=300", "https://www.thesun.co.uk/wp-content/uploads/2025/06/NINTCHDBPICT000452422458.jpg?strip=all&w=296", "https://www.thesun.co.uk/wp-content/uploads/2023/04/ac-horoscope-daily-04-thursday.jpg?quality=80&strip=all&w=300&h=192&crop=1", "https://www.thesun.co.uk/wp-content/uploads/2025/06/image-684172d55d.jpg?quality=90&strip=all", "https://www.thesun.co.uk/wp-content/uploads/2022/10/RAS-SPORT-PREVIEW-CONOR-BENN-TATTOOS-1.jpg?quality=90&strip=all&w=300&h=192&crop=1", "https://www.thesun.co.uk/wp-content/uploads/2025/11/silhouette-soldier-patrolling-1027725603_691656.jpg?quality=80&strip=all&w=300&h=192&crop=1", "https://www.thesun.co.uk/wp-content/uploads/2024/06/l-television-personality-telli-swift-452423032-e1751021202258.jpg?quality=90&strip=all&crop=0px%2C59px%2C3000px%2C2001px&resize=1920%2C1080", "https://www.thesun.co.uk/wp-content/uploads/2024/06/SPL5524402_003_Deontay-Wilder-and-Telli-Swift-were-spotted-holding-hands-as-arriving-at-Catch-Steak.jpg?strip=all&w=702"], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2024/06/l-television-personality-telli-swift-452423032-e1751021202258.jpg?quality=90&strip=all&crop=0px%2C59px%2C3000px%2C2001px&resize=1920%2C1080", "keywords": [], "authors": [], "canonical_link": "https://www.thesun.co.uk/sport/7804275/deontay-wilder-fiancee-telli-swift-divorced-jessica-scales/", "title": "Who is Deontay Wilder’s ex-fiancee Telli Swift?", "meta_data": {"copyright": "Copyright 2025 NYP Holdings. All rights reserved.", "viewport": "width=device-width, initial-scale=1", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "robots": "noarchive,noodp,max-image-preview:large", "google-site-verification": "eixRLq6ZFPfabL_W12if1QGJxwbBXFQhFO5J0Vc27EE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "description": "AFTER being demolished by Zhelei Zhang a year ago, Deontay Wilder is set for two confidence-building comeback fights before eyeing a mouthwatering dou", "generator": "WordPress 6.5.7", "sailthru.tags": "Explainers,Deontay Wilder,Tyson Fury,Boxing,Sport", "sailthru.date": "2025-06-27 11:55:30", "sailthru.title": "Who is Deontay Wilder’s ex-fiancee Telli Swift?", "sailthru.description": "AFTER being demolished by Zhelei Zhang a year ago, Deontay Wilder is set for two confidence-building comeback fights before eyeing a mouthwatering double-header with Anthony Joshua. The former WBC heavyweight...", "sailthru.image.full": "https://www.thesun.co.uk/wp-content/uploads/2024/06/l-television-personality-telli-swift-452423032-e1751021202258.jpg?quality=90&strip=all", "sailthru.image.thumb": "https://www.thesun.co.uk/wp-content/uploads/2024/06/l-television-personality-telli-swift-452423032-e1751021202258.jpg?quality=90&strip=all&w=50", "bingbot": "noarchive", "keywords": "Explainers", "article": {"opinion": "false", "content_tier": "free", "published_time": "2025-06-27T10:55:30+00:00", "modified_time": "2025-06-27T10:56:38+00:00", "publisher": 161385360554578, "tag": "Explainers, Deontay Wilder, Tyson Fury", "author": 161385360554578}, "og": {"type": "article", "title": "Get to know Deontay Wilder’s ex-fiancee Telli Swift", "url": "https://www.thesun.co.uk/sport/7804275/deontay-wilder-fiancee-telli-swift-divorced-jessica-scales/", "description": "AFTER being demolished by Zhelei Zhang a year ago, Deontay Wilder is set for two confidence-building comeback fights before eyeing a mouthwatering double-header with Anthony Joshua. The former WBC …", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2024/06/l-television-personality-telli-swift-452423032-e1751021202258.jpg?quality=90&strip=all&crop=0px%2C59px%2C3000px%2C2001px&resize=1920%2C1080", "secure_url": "https://www.thesun.co.uk/wp-content/uploads/2024/06/l-television-personality-telli-swift-452423032-e1751021202258.jpg?quality=90&strip=all&w=1024"}, "locale": "en_GB"}, "twitter": {"text": {"title": "Who is Deontay Wilder’s ex-fiancee Telli Swift?"}, "card": "summary_large_image", "site": "@thesun"}, "fb": {"app_id": 144647118961553, "pages": 855362047874372}, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?w=270"}, "movies": [], "publish_date": 1751021730.0, "source": "https://www.thesun.co.uk", "summary": ""}