{"url": "https://en.wikipedia.org/wiki/Jenna_Bush_Hager", "text": "American journalist, author, and television personality\n\n\"Jenna Bush\" redirects here; not to be confused with Jenna Busch\n\nJenna Welch Bush Hager (née Bush; born November 25, 1981)[1] is an American news personality, author, and journalist. She is the host of Today with Jenna & Friends, the fourth hour of NBC's morning news program, Today. Hager and her fraternal twin sister, Barbara, are the daughters of the 43rd U.S. President George W. Bush and former First Lady Laura Bush. Hager is also a granddaughter of the 41st U.S. President George H. W. Bush and former First Lady Barbara Bush, great-granddaughter of former U.S. Senator Prescott Bush, niece of former Florida Governor Jeb Bush, and first cousin of former Land Commissioner of Texas George P. Bush.\n\nAfter her father's presidency ended, Hager became an author, an editor-at-large for Southern Living magazine, and a television personality on NBC, being featured, most prominently, as a member of The Today Show as a correspondent, contributor and co-host.[2]\n\nEarly life and education [ edit ]\n\nJenna Welch Bush was born on November 25, 1981, at Baylor University Medical Center in Dallas, Texas, after her older twin sister Barbara.[1][3] She was named after her maternal grandmother, Jenna Hawkins Welch.[4] While living in Dallas, she and Barbara attended first Preston Hollow Elementary School and then The Hockaday School. In 1994, after her father was elected Governor of Texas and the family moved to Austin, Texas, Bush was a student at St. Andrew's Episcopal School and attended Austin High School from 1996 until her graduation in 2000. She was a Senate page.[better source needed][5]\n\nAs her father became President in 2001, she attended the University of Texas at Austin and took summer classes at New York University. She was a legacy member of Kappa Alpha Theta, her mother's sorority.[6][7][8][9] Jenna Bush graduated from the University of Texas at Austin with a degree in English, in 2004.\n\n2004 U.S. presidential election [ edit ]\n\nJenna Bush (second from right) witnesses her father taking the oath on Inauguration Day on January 20, 2005.\n\nJenna and Barbara asked their father not to run for President of the United States in 2000: \"Oh, I just wish you wouldn't run. It's going to change our life.\" Her father told them that he and her mother needed to live their lives.[10] In the winter of 2003, she and Barbara opted to become involved in the 2004 campaign.[10] In response to this decision, she made media appearances during the summer of 2004, prior to the election. She and her sister made several joint public appearances, including giving a speech to the Republican Convention on August 31, 2004.[11] She made headlines when she was found sticking her tongue out to media photographers at a campaign stop in St. Louis.[12] Jenna and Barbara took turns traveling to swing states with their father, and they also gave a seven-page interview and photo shoot in Vogue.[4] Jenna later confirmed that Barbara and Jenna also developed a friendship with John Kerry's daughters, Alexandra and Vanessa, who campaigned on behalf of their father.[13]\n\nCareer [ edit ]\n\nTeaching [ edit ]\n\nBefore leaving Washington, D.C. in summer 2006, Hager worked at Elsie Whitlow Stokes Community Freedom Public Charter School for a year and a half as a teacher's aide.[14] She took a leave of absence from the charter school position to work at a shelter as part of an internship for UNICEF's Educational Policy Department in Latin America, specifically Panama.[15][16] After her internship for UNICEF, Hager returned to her position at the charter school in Washington, D.C.[17] She has done work as a part-time reading coordinator at the SEED Public Charter School in Baltimore, Maryland, and she has contributed a monthly news story about education for the Today show.[18]\n\nJenna Hager (left), with her mother, her twin sister, and Elmo, at the Sesame Workshop Fifth Annual Benefit Dinner (2007)\n\nWriting [ edit ]\n\nIn 2007, Hager began marketing a book proposal with the assistance of Robert B. Barnett, a Washington attorney.[15] The title of the book is Ana's Story: A Journey of Hope, and it chronicles her experiences working with UNICEF sponsored charities in Latin America, including visits to drought-stricken Paraguay in 2006, while working as an intern for United Nations Children's Fund.[15][19][20] HarperCollins announced in March 2007 it would publish the book, and it was released September 28, 2007, with an initial printing of 500,000 copies.[21] Her share of the profits will go to UNICEF, while the remainder will go to the woman whose life is the basis of the book, assisting in the young woman's continuing education.[22] During the book tour, Hager appeared on The Ellen DeGeneres Show. During the interview, Hager telephoned her parents.[23] Hager wrote a second book, in conjunction with her mother, designed to encourage children to read.[24] The book, entitled Read All About It!, was published on April 22, 2008, also by HarperCollins.[24]\n\nOn November 26, 2012, Hager was named editor-at-large of Southern Living magazine.[25]\n\nNBC News (2009–present) [ edit ]\n\nSince 2009, Jenna Bush has worked at NBC News as a correspondent and at Today as both a contributor and an anchor. In August 2009, NBC hired Hager as a correspondent and contributor for The Today Show.\n\nJenna Hager reading at her grandfather's funeral service (2018)\n\nAs time progressed, Hager's profile increased on Today, including filling in as the orange-room anchor during the 7AM-9AM hours and substituting for Kathie Lee Gifford or Hoda Kotb during the fourth hour.[26]\n\nIn 2018, she interviewed Michelle Obama in a discussion about her life in the White House, the challenges of raising her daughters in the spotlight, and her book, Becoming.[27] They also discussed the political atmosphere and political bipartisanship, with Obama stating that, despite their political differences, Hager's father, George W. Bush, is a \"beautiful, funny, kind, sweet man\".[28]\n\nIn March 2019, Hager started Read with Jenna, a monthly book club on Today Show.[29] In April 2019, Hager began co-anchoring the fourth hour of Today with Hoda Kotb following Kathie Lee Gifford's departure.[30]\n\nIn 2019, Hager was able to participate with Willie Geist in a special episode of How Low Will You Go, which aired on the Today Show.[31]\n\nIn 2021, Hager reacted emotionally to the storming of the United States Capitol, stating live on air:\n\nI have had the privilege of standing on those steps for several inaugurations, not just for family members but for the first black president of the United States of America. I kissed my grandfather goodbye in that rotunda. I have felt the majesty of our country in those walls, and nobody can take that from any of us.[32]\n\nIn February 2022, Hager signed a first-look deal with Universal Studio Group.[33]\n\nOn a November 2022 episode of Today with Hoda and Jenna, Hager confessed that she \"never wears underwear\".[34][35][36] Later that month, she appeared on Watch What Happens Live and told host Andy Cohen that she did not wear underwear during a dinner she had with King Charles, then Prince Charles, the night before Queen Elizabeth II died.[37]\n\nIn February 2023, she announced her third book, Love Comes First, and sources reported \"Jenna's Top Picks\"[38] and other endorsement deals.\n\nSports investment [ edit ]\n\nIn February 2021, The Washington Post reported that Chelsea Clinton, Hager, Dominique Dawes, and Briana Scurry were part of an investment group, investing in the Washington Spirit professional soccer club in the National Women's Soccer League.[39][40]\n\nBook Club Picks [ edit ]\n\nIn March 2019 on the Today Show, Hager introduced her book club Read with Jenna.[41]\n\nIn 2022, Hager expanded her book list to children's reading, called Read with Jenna Jr.[43]\n\nIn September 2023, Hager introduced the podcast she hosts, \"Open Book with Jenna,\" wherein she interviews authors.[44]\n\nPersonal life [ edit ]\n\nBush met Henry Chase Hager during the 2004 presidential campaign. They became engaged in August 2007. Before proposing, Hager asked President Bush for permission to marry his daughter.[45] Their relationship became public when the two appeared together at a White House dinner for the Prince of Wales and his new wife the Duchess of Cornwall (now King Charles III and Queen Camilla) in November 2005. Henry Hager attended St. Christopher's School, in Richmond, Virginia, and he holds an MBA from the Darden Graduate School of Business Administration at the University of Virginia. He worked as a U.S. Department of Commerce aide, for Carlos Gutierrez, and as a White House aide, for Karl Rove.[46] He is the son of former Virginia Republican Party Chairman John H. Hager, who previously served as Lieutenant Governor of Virginia and as the U.S. Department of Education Assistant Secretary, under George W. Bush.[47] The wedding took place during a private ceremony, on May 10, 2008, at her parents' Prairie Chapel Ranch, near Crawford, Texas. Henry and Jenna Hager have three children.[48][49][50][51]\n\nUnlike most of her relatives (but like her twin sister, Barbara), Hager is not a member of the Republican Party. While registering to vote in New York, she mistakenly registered with the Independence Party of New York while meaning to declare herself a nonpartisan.[52] In 2010, Jenna Bush Hager and Barbara Bush told People that they preferred not to identify with any political party, stating, \"We're both very independent thinkers.\"[53][54][55]\n\nHager serves on the board of the Greenwich International Film Festival.[56][57]\n\nPublications [ edit ]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Tom_Sawyer_1876_frontispiece.jpg/20px-Tom_Sawyer_1876_frontispiece.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Flag_of_Maryland.svg/40px-Flag_of_Maryland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Hager_with_Bushes.jpg/250px-Hager_with_Bushes.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/20px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/The_Funeral_of_President_George_H.W._Bush_%2831265100837%29.jpg/250px-The_Funeral_of_President_George_H.W._Bush_%2831265100837%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Seal_of_the_President_of_the_United_States.svg/120px-Seal_of_the_President_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Flag_of_Texas.svg/40px-Flag_of_Texas.svg.png", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/President_George_W._Bush_takes_the_Oath_of_Office.jpg/250px-President_George_W._Bush_takes_the_Oath_of_Office.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/George-W-Bush.jpeg/120px-George-W-Bush.jpeg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Bush_daughters.png/250px-Bush_daughters.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Jenna_Bush_Hager_2017_2.jpg/250px-Jenna_Bush_Hager_2017_2.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/commons/0/06/Jenna_Bush_Hager_2017_2.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/40px-Flag_of_the_United_States.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/20px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/62/Mrs._Laura_Bush_and_daughters_pose_for_a_photo_with_Sesame_Street_character_Elmo.jpg/250px-Mrs._Laura_Bush_and_daughters_pose_for_a_photo_with_Sesame_Street_character_Elmo.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/0/06/Jenna_Bush_Hager_2017_2.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jenna_Bush_Hager", "title": "Jenna Bush Hager", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/0/06/Jenna_Bush_Hager_2017_2.jpg", "width": 857, "height": 1200}, "title": "Jenna Bush Hager - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}