{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/lorenzo-lamas-net-worth/", "text": "What is Lorenzo Lamas' net worth?\n\nLorenzo Lamas is an American actor who has a net worth of $1.5 million. If you were expecting Lorenzo Lamas' net worth to be higher, keep in mind he has been married and divorced SIX times, and he has filed for bankruptcy several times. More info on his bankruptcy filings is in the section below, and his relationships are later in this article.\n\nLorenzo Lamas first gained attention playing Lance Cumson on the primetime soap opera \"Falcon Crest,\" which ran from 1981 to 1990. His portrayal of the charming yet troubled playboy earned him a Golden Globe nomination and solidified his heartthrob status. After \"Falcon Crest,\" Lamas transitioned into action roles, most notably starring as Reno Raines in the syndicated crime drama \"Renegade\" (1992–1997), where he played a falsely accused ex-cop on the run who helps others while searching for justice.\n\nIn addition to his television success, Lamas appeared in a number of B-action films throughout the '90s and early 2000s, often performing his own stunts and martial arts sequences. His film credits include \"Snake Eater,\" \"CIA: Code Name Alexa,\" and \"Terminal Justice.\" He later embraced reality TV and stage work, appearing on \"Celebrity Apprentice,\" touring with musical theater productions, and working as a licensed helicopter pilot.\n\nFinancial Problems\n\nLorenzo Lamas has filed for Chapter 7 bankruptcy twice—first in 2004 and again in 2014—both revealing significant financial distress tied to lifestyle expenses, tax debt, and support obligations.\n\nIn his 2004 filing, Lamas reported:\n\n$433,000 in assets\n\n$617,000 in liabilities\n\n$21,826 in monthly expenses vs. $10,922 in monthly income\n\nOver $6,000/month in alimony payments\n\nDebts including $48,000 on a Hummer, $20,000 on a Harley-Davidson, and nearly $200,000 on a private plane\n\nThough much of his debt was discharged in the 2004 case, Lamas filed again in 2014 after depleting most of his remaining financial reserves, including a previously exempt $215,000 retirement account. His 2014 bankruptcy filing showed a dramatically worsened financial picture:\n\n$322,000 in total debt $285,000 in unpaid federal and state taxes $19,000 in unpaid spousal and/or child support\n\nJust $9,100 in total assets, including $430 in checking $2,300 in books $1,200 in clothing\n\nReported $0 in personal income\n\nHousehold relying solely on his wife's income: $2,400/month\n\nMonthly expenses: over $7,000\n\nThough the bankruptcy discharged some unsecured debts, the majority—including taxes and support—were not eligible for discharge, meaning Lamas remained liable for nearly all of the $300,000+ owed. These filings paint a clear picture of financial overextension and long-term liability that persisted even after court relief.\n\nEarly Life\n\nLorenzo Lamas was born on January 20, 1958, in Santa Monica, California. His mother was Norwegian actress Arlene Dahl, and his father was Argentine actor Fernando Lamas. They divorced in 1960. In 1969, when Lorenzo was 11, his father married film star Esther Williams.\n\nHe was primarily raised in Pacific Palisades, California, before moving to New York in 1971. He attended the Admiral Farragut Academy in Pine Beach, New Jersey, for high school, where he graduated in 1975.\n\nCareer\n\nLamas had developed an interest in acting as a child, having studied acting in Tony Barr's Film Actors Workshop. Soon after finishing high school, he landed his first TV acting role in 1976. He also had a minor non-speaking role in the 1978 musical, \"Grease.\" In the late 1970s and into the early 1980s, Lamas continued landing television guest roles in shows like \"Switch,\" \"Sword of Justice,\" \"Dear Detective,\" \"Secrets of Midland Heights,\" \"Fantasy Island,\" The Love Boat,\" and \"Hotel.\"\n\nIn 1980, Lamas landed the role of Lance Cumson in a new series to be called \"The Vintage Years.\" However, the show was reimagined and later became the prime-time drama series \"Falcon Crest.\" The show became very popular on CBS, airing for nine seasons from 1981 to 1990. For his work on the show, Lamas was nominated for a Golden Globe award and two Soap Opera Digest Awards. He was also the only actor to appear in all 227 episodes of \"Falcon Crest.\"\n\nWhile on Falcon Crest, Lamas also starred in the 1984 movie Body Rock. The movie was very poorly received, and Lamas was nominated for a Golden Raspberry Award for Worst Actor. The film was later included on a list of \"The 100 Most Enjoyably Bad Movies Ever Made.\"\n\nTowards the end of his run on \"Falcon Crest,\" Lamas began taking roles in more action-oriented films, as he had trained extensively in martial arts. He starred in movies like the \"Snake Eater\" trilogy from 1989 to 1992, \"Bounty Hunter\" in 1993, \"Gladiator Cop\" in 1995, and \"Terminal Justice\" in 1996. He also appeared in a wide number of other low-budget action films in the early 1990s.\n\nIn 1992, Lamas earned his next recurring leading role by playing Reno Raines, a falsely accused cop, in the syndicated series \"Renegade.\" The show ran from 1992 to 1997 and was seen in over 100 countries. The show allowed Lamas to display his interest in Harley-Davidson motorcycles and to grow his hair out long, as it was part of his character's signature look.\n\nIn 2004, Lamas landed another recurring role as Hector Ramirez on the soap opera \"The Bold and the Beautiful.\" Lamas remained on the show until 2006. In August of 2007, Lamas starred in \"The King and I\" as the King of Siam. The play was performed at the Ogunquit Playhouse in Ogunquit, Maine. The same year, he also performed in the title role in \"Dracula\" at Kean University's Premiere Stages in Union, New Jersey. He continued working in theater by performing as El Gallo in \"The Fantasticks\" at the Casa Manana Theatre in Fort Worth, Texas, in 2008, followed by a performance in \"A Chorus Line\" back in Ogunquit in 2009.\n\nThroughout the 2010s, Lamas continued landing roles in films, television series, and movies. Some of his credits include roles in \"Big Time Rush,\" \"The Joe Schmo Show,\" \"Workaholics,\" \"Lucha Underground,\" and \"Jane the Virgin.\" He also appeared as a contestant on the reality TV series \"Celebrity Apprentice\" in 2015.\n\nWhile Lamas has continued acting, he also began working as a helicopter pilot in the mid-2010s. He often flies people on day trips from Los Angeles to the Grand Canyon and also has worked for the company HeliNY, based in New York City.\n\nPersonal Life\n\nLamas has been married six times and has six children. His first wife was Victoria Hilbert, with whom he was married from 1981 to 1982. He then married his publicist, Michele Cathy, in 1983 and remained with her until 1985. During this time, he had a son, Alvaro, and a daughter, Shayne. After his divorce from Cathy, he began a relationship with Daphne Ashbrook. The two did not marry but did have a daughter together, Paton Lee, in 1988.\n\nIn 1989, Lamas married his third wife, Kathleen Kinmont. They remained married until 1993. He then married Shauna Sand in 1996 and had three daughters with her – Alexandra, Victoria, and Isabella – before divorcing in 2002. After their divorce, he then began a relationship with Shawna Craig, and the two eventually married, though they divorced in 2018. In April of 2020, Lamas began dating a woman named Kenna Scott. They became engaged in February of 2021 and married in 2023. He filed for divorce in July 2025, but his filing lists the date of separation as January 2025.\n\nLamas developed an interest in various martial arts when he was a young man. He started training in Taekwondo in 1979 and earned a 3rd-degree black belt. He subsequently began training in Karate, Jujitsu, Aikido, and Shotokan and earned black belts in each.\n\nReal Estate\n\nIn May 1996, shortly after marrying Shauna Sand, Lorenzo paid $1.795 million for a 5,000-square-foot gated estate in Los Feliz. The home featured four bedrooms, a guesthouse, pool, spa, and panoramic city views. He sold this home in October 1999 for $1.9 million. In 1994, he paid $550,000 3-acre, 3,500-square-foot property in Poway, near San Diego. He listed this home for $1.2 million in 1996, he accepted $900,000 in September 1996. In 2022, he paid $710,000 for a home in Las Vegas, Nevada. This remains his primary home, and today it is worth around $900,000.", "images": ["https://vz.cnwimg.com/thm/1JoH3482haSLevnlEMdqhrz36y0=/132x132/center/top/filters:format(webp)/2009/11/George-Clooney.jpg", "https://vz.cnwimg.com/thm/I4dSiTJhq0kprSuO--deoPCEAmQ=/132x132/center/top/filters:format(webp)/2020/06/taylor.png", "https://vz.cnwimg.com/thm/uRsxoLs7Ymmit5ATgRtN2utad40=/221x5:381x236/132x132/filters:format(webp):strip_exif()/2009/09/P-Diddy.jpg", "https://vz.cnwimg.com/thm/NEa6OlAV-g5hw4ayxkOPSR1cmIU=/132x132/center/top/filters:format(webp)/2018/11/kk.jpg", "https://vz.cnwimg.com/thm/cT9B_Ifa04VOubuLddM4J_nYwVo=/132x132/center/top/filters:format(webp)/2019/08/fl.jpg", "https://vz.cnwimg.com/thm/KNDSqD-9inbRekV6AGgXDEG2Scw=/375x35:810x586/132x132/filters:format(webp):strip_exif()/2015/09/GettyImages-476575299.jpg", "https://vz.cnwimg.com/thm/Ew9QECaAZwkJvDxsSk93AN5tppo=/132x132/center/top/filters:format(webp)/2011/05/Shayne-Lamas-e1591385275399.jpg", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "https://vz.cnwimg.com/thm/eCPlMetcK3baIGGQn-dAyUWUinM=/132x132/center/top/filters:format(webp)/2017/05/GettyImages-862990968-e1591386007730.jpg", "https://vz.cnwimg.com/thm/_hOmdPz8Ht24ZxIeZM7m4mGRouk=/132x132/center/top/filters:format(webp)/2019/11/GettyImages-1094653148.jpg", "https://vz.cnwimg.com/thm/Y14fttV9jls9mxFLuNAHJTnNWTE=/132x132/center/top/filters:format(webp)/2019/10/denzel-washington-1.jpg", "https://vz.cnwimg.com/thm/yboGsO77E1kQwELLmrwRZv_4RmE=/132x132/center/top/filters:format(webp)/2017/02/GettyImages-528215436.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/thm/IoWqGPmFDjvC6iTqcDsspXBuxqo=/132x132/center/top/filters:format(webp)/2018/03/GettyImages-821622848.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/thm/dXuAPIEBU--L_kRib4u0nSzjUtE=/132x132/center/top/filters:format(webp)/2020/04/Megan-Fox.jpg", "https://vz.cnwimg.com/thm/UBt7IE2dYc8awc4AHcyTUXmX9y8=/600x300/center/top/filters:format(webp)/2021/07/Lorenzo-Lamas.jpg", "https://vz.cnwimg.com/wp-content/uploads/2021/07/Lorenzo-Lamas.jpg?x46379", "https://vz.cnwimg.com/thm/LlyuDRRPhGKBCSl5NLd4uZYm7zY=/132x132/center/top/filters:format(webp)/2014/01/app2.jpg", "https://vz.cnwimg.com/thm/lY3-oCS-xIdiqDaOi1qHd6UaTjg=/132x132/center/top/filters:format(webp)/2009/09/Cristiano-Ronaldo.jpg", "https://vz.cnwimg.com/thm/95i5RI1LWkjHyyoolMeto-z_WeU=/132x132/center/top/filters:format(webp)/2020/01/lopez3.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2021/07/Lorenzo-Lamas.jpg?x46379", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/lorenzo-lamas-net-worth/", "title": "Lorenzo Lamas Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Lorenzo Lamas is an American actor who has a net worth of $1.5 million. If you were expecting Lorenzo Lamas' net worth to be higher, keep in mind he has been married and divorced SIX", "slick": {"wpversion": "3.0.1", "wppostid": 4984, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2021/07/Lorenzo-Lamas.jpg?x46379", "group": "post", "category": "actors:Actors"}, ";": "richest-celebrities:Richest Celebrities", "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "cnw": {"wppostid": 4984}, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Lorenzo Lamas Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/lorenzo-lamas-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2021/07/Lorenzo-Lamas.jpg?x46379", "site_name": "Celebrity Net Worth", "description": "What is Lorenzo Lamas's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2025-07-09T16:01:41+00:00", "published_time": "2021-07-02T00:57:07+00:00", "section": "Actors", "tag": "richest reality stars"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2021/07/Lorenzo-Lamas.jpg?x46379", "title": "Lorenzo Lamas Net Worth", "description": "Lorenzo Lamas is an American actor who has a net worth of $1.5 million. If you were expecting Lorenzo Lamas' net worth to be higher, keep in mind he has been married and divorced SIX"}}, "movies": [], "publish_date": 1625187427.0, "source": "https://www.celebritynetworth.com", "summary": ""}