{"url": "https://people.com/tv/bachelor-becca-kufrin-talks-arie-luyendyk-jr/", "text": "Becca Kufrin is opening up about her heartbreaking split from Arie Luyendyk Jr.\n\n“He’s a good person, I don’t think he’s a monster and purposely did this to hurt me and make me feel this way. But it’s just the result of his actions,” Kufrin, 27, tells PEOPLE exclusively in this week’s issue, on stands Friday. “At the end of the day, I don’t think he thought through everything of how ending things with Lauren would be, how being engaged to me would be and what breaking up with me and going back to her would be. I don’t think he thought it through, but I don’t think he did it maliciously to break my heart.”\n\nAs promised by ABC, Bachelor Nation saw one of the the reality series’ most dramatic finales on Monday evening’s episode. After first ending his relationship with Lauren Burnham during the final rose ceremony in Peru, Luyendyk Jr. got down on one knee and proposed to Minneapolis-based publicist Kufrin.\n\nABC\n\n“That morning, I woke up and I was very oddly calm. I just felt it in my heart. I just knew it was me — that him and I were going to be together,” Kufrin shares about the morning of her engagement. “There were still nerves, but I never was too anxious or worked up about it because I just felt it was right with us.”\n\nUpon getting engaged, Kufrin felt overjoyed. “I felt like my heart was going to burst because it was just so filled with love to be with him and share that news with our friends and family. There was so much excitement and joy,” she says. “It was an overabundance.”\n\nPaul Hebert/ABC\n\nBut after filming wrapped and the newly engaged couple returned back to the U.S., Luyendyk Jr. was unsettled with his decision — admitting on the show that he still had feelings for 26-year-old Burnham.\n\n“I never thought for a million years that once the going started to get tough that he would throw in the towel and jump ship and say, ‘Oh sorry, I changed my mind.’ I didn’t think we were at that point whatsoever,” says Kufrin.\n\nAfter having a sit-down conversation with Burnham, Luyendyk Jr. decided to call off his engagement with Kufrin during a weekend trip to Los Angeles.\n\nWant to get all of PEOPLE’s best stories when you’re on the go? Download the SmartNews app on your mobile device and follow PEOPLE for more of the best celebrity and entertainment news!\n\n“I thought we were just going to have a nice romantic weekend. The night before he had turned off his phone, which I thought was strange, and it wasn’t until the moment when he walked into the house when he didn’t have his suitcases with him, I was like What’s going on?” she shares.\n\nReflecting on the tear-filled moment Luyendyk Jr. broke up with Kufrin, she says, “It was embarrassing the way he broke up with me with the full cameras and crew around.”\n\n“There was a better and more tactful way to do it,” she says of getting dumped on national television. “A breakup is hard enough, and to have it all filmed and have to re-watch it and know that people all across the country are watching you get your heart broken, it is embarrassing. It’s not fun. I wouldn’t wish it on my worst enemy. It was like a slap in the face.”\n\n“I wish he would have been more honest with me. From the questions I was asking, I would have appreciated the full truth. I was obviously blindsided like, Did I miss something? I was asking you these things and you didn’t tell me. What did I miss? How could I have not seen any of this to the extent of how it played out?” she shares.\n\n“At one point I asked him if he wanted to make it work with Lauren and his response was, ‘Yeah I want to try.’ So in that instance I knew. I knew at that point, okay I’m sure he’s going to try to make up for lost time and he’ll probably go there soon to make it work and to reconcile with her,” she says.\n\nWATCH: ‘Bachelor’ Arie ‘Pillow Lips’ Luyendyk Jr. Reveals His Go-To Kissing Tips\n\nWhile Kufrin credits Luyendyk Jr. for being “open and honest in the fact that he had told Lauren he loved her too,” she says that “red flags were being raised” when season 22 of the series premiered Jan. 1.\n\n“At that point, I knew that he had liked some of her Instagram photos so we had a conversation about it. And that was the first time that he really threw it out that he should have a conversation with her and just apologize for how things had ended with her, that he had felt guilty,” she says.\n\nSays Kufrin: “He had told me, ‘I still have feelings for her, I’m trying to work through them.’ He said it was hard for him to always talk about it in interviews with the press, to relive that relationship. He said he couldn’t close that chapter until everything was said and done and the finale aired. That whole time we were just looking at the end goal of this week to finally be done with that and move on and be together and work through it as a team.”\n\nRealizing that Luyendyk Jr. was still liking Burnham’s photos on social media, Kufrin admits she “definitely went through all of the emotions. I was upset, I was angry at times, I felt betrayed. When I started noticing those little things like the Instagram likes, I was trying to come at it from a relationship standpoint to compromise and talk through it.”\n\n“I would question if he was ready to be engaged and if he was ready at that point to get down on one knee and if not, I’d still stand by him and want to work through it. But of course I’m going to go through all the emotions. I’m a girl, I’m a human being. There was still jealousy there. You’re engaged to me, why are you liking another person’s photos or still wanting to contact them?” she shares.\n\nUltimately, Kufrin wishes Luyendyk Jr. had “been much more open and honest about the extent of his feelings” — and not proposed to her.\n\n“I wish he hadn’t proposed. At that point I loved him and I wanted to be with him. Even if on that last day, he said, ‘I’m still uncertain, this is a big move, I don’t want to get down on one knee unless I’m 1000 percent sure, but I still want to be with you,’ I would have been fine with that. I would have been like, ‘I love you, I still want to be with you.’ I even asked him a couple times if he felt like he was certain like that was the right move at that point and every time he said, ‘I’m happy with the decision and I feel confident in us,’ ” Kufrin says. “From what he was telling me and from even that grand gesture, I thought nobody would do that unless they did feel 100 percent confident.”\n\nKufrin says she “can’t fault” Luyendyk Jr. “for falling in love with Lauren and following his heart because I would never want anyone to stay in a relationship where they felt trapped and it wasn’t right,” but she wishes he’d done things differently.\n\n“He did get down on one knee, he did propose to me, he did say, ‘I’m committing to you, I choose you every day.’ That’s something that I only wanted to happen once in my life, and it’s been robbed from me ,and I can never have that one time moment again. And the second part is that he lied or hid his true feelings and emotions for weeks and weeks and weeks,” she says. “The number one thing that I value in a relationship is honesty and loyalty, and I feel like I wasn’t given that.”\n\nWATCH: The Bachelor’s Arie Luyendyk Jr. Says He Fell for Two Women on the Show\n\nAlthough Kufrin is heartbroken over the situation, she has no “ill will towards” Burnham.\n\n“At the end of the day, we both just fell in love with the same guy and she can’t help that. The only person that I can fault in this is Arie and the way he handled it,” she shares. “I do feel a little bad that it’s going to be really tough for them when all of this is said and done. Social media is a hard world to navigate through, and there’s going to be a lot of negativity and I don’t think she deserves that. If they want to make it work, then they will, and I hope they’re strong enough to get through it all.”\n\nWith her breakup behind her, Kufrin says she’s ready for “this chapter of Arie to be done and close it and put it on the shelf and put it away” and only wants Luyendyk Jr. to have what makes him happy.\n\n“At the end of the day I wouldn’t’ change the experience because I met so many amazing people and I fell in love and I had this great experience and memories,” she says. “I’m still going to feel a sense of compassion for him because I did love him but at this point, I want him to be happy, I want to be done and not have to worry about them anymore.”\n\n“They’re going to be together and do their thing. I wanted to move on and have my person that I can focus on and live my life with,” shares Kufrin. “At the end of the day, I do forgive him.”\n\nThe live two-hour After the Final Rose special airs Tuesday at 8 p.m. ET on ABC.\n\n—With NATALIE STONE", "images": ["https://people.com/thmb/LztNjwaQ-ix4eK4edUooLhNiWi4=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/anna-kepner-3-111025-c6a90b2f57474459a89ae04e296ec343.jpg", "https://people.com/thmb/4SKe_lEchVCl1MyXJ2oPEU8eFvw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/shep-rose-craig-conover-austen-kroll-111825-ed0a5cfc01334d9fa96d00ac52bba2d5.jpg", "https://people.com/thmb/tx3CFTThcwra3E9IDPIDgeY-LsE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/MEL-OWENS-Engagement-ring-111225-5923d433b598498a8823b24550f19a86.jpg", "https://people.com/thmb/GfeEXkE2XAscnDcsdqvnlsMBpAE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Golden-Bachelor-Gerry-Turner-and-Theresa-Nist-Seen-Together-for-the-First-Time-Since-Divorce-111325-925470e2cc544b48a6bab2a718fb8910.jpg", "https://people.com/thmb/hrpIf_Ds6fRnwyzQj3Z_T0v7wRw=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/alex-rodriguez-Cynthia-Scurtis-Madonna-111325-33c2de3e05914ed987d94df4aced2d95.jpg", "https://people.com/thmb/6BVgFQ30gWgD9XmkUm2j5s90DZk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/alex-rodriguez-Cynthia-Scurtis-Madonna-111325-33c2de3e05914ed987d94df4aced2d95.jpg", "https://people.com/thmb/i3yO7KWh5oL6W3qHNuf41NtTgH0=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/brittany-cartwright-jax-taylor-042424-2-44111ab94387465fb3c3f9b56068c753.jpg", "https://people.com/thmb/8XyJWhwnPioKQSvglc89b5zIvWs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Gerry-Turner-theresa-tout-121223-b1587d12f7124b9c9c0b94815594d0d1.jpg", "https://people.com/thmb/_49IieX4BvKSMraPsh9mips_oDU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/bachelor-7-1-2000-21f7386a52e6475691c696f95f2a0ce7.jpg", "https://people.com/thmb/vuOerWMcJ-XtcLIxXKZUHCyEIxg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/seeking-sister-wife-111025-a4788ae53978433e8c73c8d812496cca.jpg", "https://people.com/thmb/K6qBa7qmNXMKC4dzIoe_CB9-8bs=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/bachelor-becca-arie-breakup-1-1640d783cd7d49bea3abbe4ab1a90170.jpg", "https://people.com/thmb/uKKi1M7GmKHA0aVJSOC2qklFapE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/mel-owens-peg-munson-golden-bachelor-111325-42efe59dada446d9bd1f718573f4151c.jpg", "https://people.com/thmb/BB7vYW82d0oBPiFINmr76DIy2dY=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/ben-dreyfuss-richard-dreyfuss-111925-b670f8ab6f994d1d9dfce1fa0726d205.jpg", "https://people.com/thmb/7nVi-aqhARmealdbMVzY7ae_0Fc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/avril-lavigne-mod-sun-110725-1-cddff8a22812471892c45af53228f8bb.jpg", "https://people.com/thmb/cdr5Zbe3Os5huoAHXHYiALIhYGM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/chris-harrison-1-4c6ec188ecb84a938d5faa5dd4bdcffb.jpg", "https://people.com/thmb/IPznnXNy9eUpiVWxiUf86M2Dc8M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/bachelor-split-2000-95d9ed7d96b34096a895ac9f52aea60d.jpg", "https://people.com/thmb/AWIgLw6oCjvuGnuN6Z3n2PeyuEk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/brittany-cartwright-jax-taylor-042424-2-44111ab94387465fb3c3f9b56068c753.jpg", "https://people.com/thmb/Zb8TdlLsOwMIJ3YLlVbZWDfjBHk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Brittany-Snow-Tyler-Stanaland-110625-f03720b38192437e8cd120652959240f.jpg", "https://people.com/thmb/1y8biv50D_dBwRQRvhhst6ohpOU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/emma-chamberlain-parents-michael-sophia-8-b3317c0615a64b9abe29af60259abc07.jpg", "https://people.com/thmb/bHqUr0JCVp8wk8JOGwUY3t3njYY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Mel-Cindy-Golden-Bachelor-111325-5fafc5719c214131b93f2be28047a8f6.jpg", "https://people.com/thmb/n1lBhwgQdeStaeIYBsh8drGmQcY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/denise-richards-Aaron-Phypers-111625-cb8fde66dd78412c9c27aa8fbb91610c.jpg", "https://people.com/thmb/houJgFYu3h_jBt0tQwFzaIKWRpY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/golden-bachelor-mel-owens-main-042325-0c580dad2f294daa82ca7a941097b7b9.jpg", "https://people.com/thmb/0jKnK8bSyr7Fb41sXsNwd1jtAFM=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/jenna-bush-hager-minka-kelly-today-with-jenna-and-friends-111925-7e3c2b8605fe4a96a1b712c168083adb.jpg", "https://people.com/thmb/AVJWQvUlZPPzzgUPpqRgR969rYQ=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/Brittany-Snow-Tyler-Stanaland-110625-f03720b38192437e8cd120652959240f.jpg", "https://people.com/thmb/YjVJ_APv3yBQMjgO7tyd4o47P3Y=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Mel-Owens-Golden-Bachelor-042225-0fc58b6db15f472fae1aa1127f5ab357.jpg", "https://people.com/thmb/zdFS1n2y9dNM-ndOtRjWY9G0kI4=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/Daniella-Karagach-111925-ls-1ffa54ba0f1749e380cfe98771660e16.jpg"], "top_img": "https://people.com/thmb/IPznnXNy9eUpiVWxiUf86M2Dc8M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/bachelor-split-2000-95d9ed7d96b34096a895ac9f52aea60d.jpg", "keywords": [], "authors": ["Aili Nahas", "Aili Nahas Is The Former West Coast Deputy News Director At People. She Left People In", "People Editorial Guidelines", "Julia Moore", "Brianne Tracy", "Natasha Dye", "Yamillah Hurtado", "Kimberlee Speakman", "Liza Esquibias", "Stephanie Wenger"], "canonical_link": "https://people.com/tv/bachelor-becca-kufrin-talks-arie-luyendyk-jr/", "title": "Bachelor: Becca Kufrin Talks Breakup with Arie Luyendyk Jr.", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Becca Kufrin is speaking out following her painful breakup with Arie Luyendyk Jr.", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "PEOPLE", "sailthru.author": "Aili Nahas", "parsely-section": "Celebrity", "parsely-tags": "Celebrity Relationships,Celebrity,Person,Reality TV,Celebrity Breakups,Lauren Burnham,Becca Kufrin,Arie Luyendyk Jr.,The Scoop", "article": {"section": "People", "author": "https://www.facebook.com/peoplemag"}, "og": {"type": "article", "site_name": "People.com", "url": "https://people.com/tv/bachelor-becca-kufrin-talks-arie-luyendyk-jr/", "title": "The Bachelor's Becca Kufrin Breaks Her Silence After Arie Luyendyk Jr. Ends Their Engagement", "description": "Becca Kufrin is speaking out following her painful breakup with Arie Luyendyk Jr.", "image": "https://people.com/thmb/IPznnXNy9eUpiVWxiUf86M2Dc8M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/bachelor-split-2000-95d9ed7d96b34096a895ac9f52aea60d.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "The Bachelor's Becca Kufrin Breaks Her Silence After Arie Luyendyk Jr. Ends Their Engagement", "description": "Becca Kufrin is speaking out following her painful breakup with Arie Luyendyk Jr.", "image": "https://people.com/thmb/IPznnXNy9eUpiVWxiUf86M2Dc8M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/bachelor-split-2000-95d9ed7d96b34096a895ac9f52aea60d.jpg"}, "vf": {"url": "https://people.com/tv/bachelor-becca-kufrin-talks-arie-luyendyk-jr/"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.146.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.146.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.146.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.146.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.146.0/icons/favicons/mstile-310x150.png", "fb": {"pages": 95926963131}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}