{"url": "https://www.inquisitr.com/4613819/mandy-moore-says-this-is-us-is-about-to-get-really-dark-warns-fans-of-heavy-episode-trilogy/", "text": "Mandy Moore has a warning for This Is Us fans. The actress, who plays matriarch Rebecca Pearson on NBC’s hit drama series, says the next three episodes of the show will get darker as the focus shifts to each of the Pearson siblings and their pasts.\n\nThe next three episodes of This Is Us will each revolve around one of The Big Three—Kevin (Justin Hartley), Kate (Chrissy Metz) and Randall (Sterling K, Brown). The episodes, titled “Number One,” “Number Two,” and “Number Three” will heavily feature the characters’ teen counterparts, played by Logan Shroyer, Hannah Zeile and Niles Fitch, respectively. But because the Big Three’s teen years was also the era that their dad, Jack (Milo Ventimiglia), passed away, viewers will experience the family’s dark times in the flashback sequences.\n\n“There’s darkness coming,” Moore told E! News of the upcoming This Is Us episodes.\n\n“The next three episodes are sort of a trilogy of sorts and they go to some deeply darkly places.”\n\nMandy Moore revealed that viewers will likely have “a lot of opinions about” the three episodes, and asked that fans just be patient, hinting there will be “bigger payoffs later” this season.\n\n“I would just suggest that people be patient,” Mandy said. “It will all unfold in a spectacular way, and I don’t think people will be disappointed.”\n\nIn an interview with People , Mandy Moore admitted she had to prepare herself for some of the “heavy” episodes that are coming up.\n\n“I’m scared about the rest of the season because I know we have some real heavy moments coming up this season that need to be addressed in regard to [Jack’s] passing, so I’m trying to prepare myself for that,” the This Is Us star said.\n\nThis Is Us fans have been clamoring for more clues on how Jack died ever since it was revealed mid-last season that the character is not alive in the present day. Jack is only seen in flashbacks through the late 1990s, and his wife has married his best friend, Miguel (Jon Huertas). The Season 2 premiere ended with Rebecca pulling up to a burnt-out Pearson family home with her husband’s personal belongings on the seat beside her as she let out an agonizing wail.\n\nMoore revealed that shooting the scene that depicted the aftermath of the house fire was a surreal experience. This Is Us producers built a facade of the Pearson’s Pittsburgh house and then burned it, but Mandy didn’t see the set before filming the scene. When the actress pulled up to the burnt-out house for the scene, it was actually the first time she had ever seen the burnt remains of the Pearson’s family home.\n\n“My reaction of seeing the house for the first time was my genuine reaction to seeing it for the first time,” Moore told People . “I really didn’t take a peek before the camera was rolling. So it wasn’t super difficult to get into that frame of mind and tap into that raw emotion.”\n\nBased on Mandy Moore’s hints about the upcoming episodes of This Is Us , it sounds like viewers won’t have any problem tapping into raw emotions either.\n\nTake a look at the promo for the upcoming This Is Us episode trilogy.\n\nhttps://www.youtube.com/watch?v=SP_oxuGXoeM\n\nThis Is Us airs Tuesdays at 9 p.m. ET on NBC.\n\n[Featured Image by Ron Batzdorff/NBC]", "images": ["https://www.inquisitr.com/wp-content/uploads/2025/10/2421769f-57a4-4bff-913f-cf316747493e.jpg", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20500%20157'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20492%20142'%3E%3C/svg%3E", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo-white.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/inquisitr-logo.png", "https://secure.gravatar.com/avatar/cb440770d59aff1d3176c9268e512a1f?s=120&d=mm&r=g", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent-Dark-Mode.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20120%20120'%3E%3C/svg%3E"], "top_img": "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "keywords": [], "authors": ["News Writer"], "canonical_link": "https://www.inquisitr.com/mandy-moore-says-this-is-us-is-about-to-get-really-dark-warns-fans-of-heavy-episode-trilogy", "title": "Mandy Moore Says ‘This Is Us’ Is About To Get Really Dark, Warns Fans Of Heavy Episode Trilogy", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "https://www.inquisitr.com/wp-content/uploads/2024/12/favicon.png", "description": "Mandy Moore has a warning for This Is Us fans. The actress, who plays matriarch Rebecca Pearson on NBC’s hit drama series, says the next three episodes of the", "robots": "follow, index, max-snippet:-1, max-video-preview:-1, max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Mandy Moore Says ‘This Is Us’ Is About To Get Really Dark, Warns Fans Of Heavy Episode Trilogy - Inquisitr News", "description": "Mandy Moore has a warning for This Is Us fans. The actress, who plays matriarch Rebecca Pearson on NBC’s hit drama series, says the next three episodes of the", "url": "https://www.inquisitr.com/mandy-moore-says-this-is-us-is-about-to-get-really-dark-warns-fans-of-heavy-episode-trilogy", "site_name": "Inquisitr News"}, "article": {"tag": "This Is Us", "section": "Entertainment", "published_time": "2017-11-10T11:56:00-05:00"}, "twitter": {"card": "summary_large_image", "title": "Mandy Moore Says ‘This Is Us’ Is About To Get Really Dark, Warns Fans Of Heavy Episode Trilogy - Inquisitr News", "description": "Mandy Moore has a warning for This Is Us fans. The actress, who plays matriarch Rebecca Pearson on NBC’s hit drama series, says the next three episodes of the", "site": "@theinquisitr", "creator": "@theinquisitr"}, "generator": "WP Rocket 3.18.3"}, "movies": [], "publish_date": 1510332960.0, "source": "https://www.inquisitr.com", "summary": ""}