{"url": "https://en.wikipedia.org/wiki/Jamie_Bell", "text": "English actor (born 1986)\n\nFor the singer with the band Triple 8, see Jamie Bell (singer)\n\nAndrew James Matfin Bell (born 14 March 1986) is an English actor. He rose to prominence with his debut performance in Billy Elliot (2000), for which he won the BAFTA Award for Best Actor, becoming the youngest-ever winner in the category. He is also known for his portrayals of Tintin in The Adventures of Tintin (2011) and Ben Grimm/The Thing in Fantastic Four (2015).\n\nOther notable film credits include Nicholas Nickleby (2002), King Kong (2005), Jumper (2008), Jane Eyre (2011), Man on a Ledge (2012), Snowpiercer, Filth, Nymphomaniac (all 2013), Rocketman (2019), and All of Us Strangers (2023). He earned a second BAFTA nomination for his leading role in Film Stars Don't Die in Liverpool (2017). On television, Bell starred as Abraham Woodhull in the AMC historical drama series Turn: Washington's Spies (2014–2017).\n\nEarly life [ edit ]\n\nAndrew James Matfin Bell[1] was born on 14 March 1986 in Billingham, Teesside, England, where he grew up with his mother, Eileen Matfin and his elder sister Kathryn.[2] His father, John Bell, a toolmaker, left before Jamie was born.[3][4] Bell began his involvement with dancing after he accompanied his sister to her ballet lessons.[5]\n\nCareer [ edit ]\n\n2000s [ edit ]\n\nIn 1999, Bell was chosen from a field of over 2,000 boys for the role of Billy Elliot, an 11-year-old boy who dismays his working-class widowed father and elder brother by taking up ballet.[6] Bell's performance received widespread acclaim, and 14-year-old Bell won London Film Critics' Circle Award for British Newcomer of the Year, British Independent Film Award for Best Newcomer, Evening Standard British Film Award for Most Promising Newcomer, and BAFTA Award for Best Actor in a Leading Role, becoming one of the youngest winners of the awards. His lack of an Oscar nomination was met with criticism. He also appeared in Close and True, an ITV legal drama shown in 2000, which starred Robson Green, James Bolam, Kerry Ann Christiansen and Susan Jameson.\n\nBell served as Honorary Jury President of the 2001 Giffoni Film Festival. In 2002, he appeared as the disabled servant Smike in an adaptation of Nicholas Nickleby and a young soldier in Deathwatch. In the following years, he portrayed a teenager on the run in Undertow, a gun-toting pacifist in Dear Wendy, a disaffected Southern California teenager in The Chumscrubber, and the young Jimmy in the 2005 film version of King Kong. Also in 2005, he starred opposite Evan Rachel Wood in the Green Day video \"Wake Me Up When September Ends\", directed by Samuel Bayer.[7] In 2007, he played the title character in Hallam Foe – for which he was nominated for the best actor award at the British Independent Film Awards – and appeared as himself in lonelygirl15 spin-off KateModern.[8] He had roles in two 2008 films: the sci-fi film Jumper and the World War II drama Defiance. In the second film he plays Asael Bielski, the third of the Bielski Brothers, leaders of a partisan group that saved 1,200 lives during the Holocaust.\n\nIn 2009, producers announced that Bell would play the title role in the motion capture film The Adventures of Tintin, alongside Andy Serkis and Daniel Craig.[9][10] The film was released in 2011.[11]\n\n2010s [ edit ]\n\nBell appeared in a number of films during the early 2010s, beginning with the 2011 films The Eagle as Esca and Jane Eyre as St John Rivers. In 2013, he starred alongside James McAvoy in the film Filth and appeared as Edgar in Snowpiercer.[12]\n\nFrom 2014 to 2017, Bell appeared as Abraham Woodhull in Turn: Washington's Spies. In 2015, he played the Thing in the Fantastic Four reboot.[13][14] The film would go down in infamy as one of the worst comic book films ever made. In 2022, Bell would say of it, \"I don't think [it deserves a second look.] Save your money, save your time.\"[15]\n\nIn 2017, Bell had starring roles in 6 Days and Film Stars Don't Die in Liverpool. The latter earned him a nomination for the BAFTA Award for Best Actor in a Leading Role. In 2019, he had a supporting role as Bernie Taupin in the biographical musical film based on the life of Elton John, Rocketman.[16]\n\nIn 2023, he appeared in the critically acclaimed movie All of Us Strangers as the protagonist's father.\n\nPersonal life [ edit ]\n\nBell dated American actress Evan Rachel Wood for a year in 2005 after they had met at the Sundance Film Festival. Wood was aware of the false claims that they had first met while co-starring in the music video for Green Day's song \"Wake Me Up When September Ends\" and has stated they were \"already dating and very much in love by that point.\"[17] Five years later, in mid-2011, it was reported that Bell and Wood had rekindled their relationship.[18] The couple married in a small ceremony in California on 30 October 2012.[19][20] They have one son, born in July 2013.[21] The couple announced that they had separated on 28 May 2014.[22]\n\nStarting in 2020, Wood and Bell were in dispute over the custody of their son.[23] Bell said he was deprived of contact with him when Wood moved from Los Angeles to Nashville; Wood claimed she did this to protect the child from former fiancé Marilyn Manson.[24] Bell argued in court that Wood's story defied credibility, and accused her of \"withholding our son from me for other reasons of her own invention.\"[25] In May 2023, Wood accepted terms for their son staying in Los Angeles with Bell, while seeing him \"one extended weekend per month\" and holidays.[26]\n\nIn late 2015, Bell began dating his Fantastic Four co-star Kate Mara,[27] and in January 2017 the couple became engaged.[28] On 17 July 2017, they announced that they had married.[29] They have a daughter, born in May 2019.[30] On 17 November 2022, his wife announced on her Instagram account that she had given birth to a son in the previous week.[31]\n\nBell is an atheist.[32] He is also a keen football fan and an avid supporter of Arsenal F.C.[33]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nVideo games [ edit ]\n\nYear Title Role Notes 2005 King Kong Jimmy 2008 Jumper: Griffin's Story Griffin O'Conner\n\nMusic videos [ edit ]\n\nAccolades [ edit ]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Jamie_Bell-8448_%28cropped%29.jpg/960px-Jamie_Bell-8448_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Jamie_Bell-8448_%28cropped%29.jpg/250px-Jamie_Bell-8448_%28cropped%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Jamie_Bell-8448_%28cropped%29.jpg/960px-Jamie_Bell-8448_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jamie_Bell", "title": "Jamie Bell", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Jamie_Bell-8448_%28cropped%29.jpg/960px-Jamie_Bell-8448_%28cropped%29.jpg", "width": 900, "height": 1200}, "title": "Jamie Bell - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}