{"url": "https://meaww.com/lucy-hale-and-ryan-rottman-spark-dating-rumor-after-riley-smith", "text": "Lucy Hale and Ryan Rottman spark dating rumors\n\nLucy Hale and Ryan Rottman spark dating rumor as the pair head out together and shy from holding hands in front of the cameras\n\nLooks like Lucy Hale has moved on! The actress was spotted hanging out with Ryan Rottman. As reported by E! the two stepped out to grab Starbucks. Lucy stepped out wearing a casual attire. The actress wore a pink top with blue jeans and paired it with the perfect summer sunglasses. Meanwhile, Ryan opted for denim jeans with a washed out grey sweater.\n\nWhile the pair seemed to enjoy their day out, they were spotted holding hands at a point in time. The two have not yet commented on their relationship. Prior to this, Lucy was dating her Life Sentence co-star Riley Smith. The two kept their romance under wraps for the longest period and it wasn't until the two were spotted kissing on Valentine’s Day that their relationship was confirmed.\n\nLucy often shared the photos from behind the scenes and with the cast and crew on her social media. Unfortunately for her, it was announced that the show will not be returning for a second season. Lucy, who plays the role of Stella Abbot took to Twitter to announce that the show had been canceled. Lucy wrote she was emotionally involved in the show and the news about its cancelation came as a shock.\n\n\"I was emotionally attached to this story and to everyone involved so I’m a little shell-shocked right now, but I feel fortunate that we got to tell a beautiful story,” she wrote at the time. “Sometimes things don’t resonate with the audience, and shows just don’t work but I’m so proud of what we accomplished & for the experience I had. Life Sentence was a show that a lot of us needed, and I am beyond grateful for those who gave our show a chance.”\n\nThe drama was first aired on March 7, 2018, and narrates the story of a young girl who was diagnosed with terminal cancer and had been living a day at a time as though she was dying for the last eight years. However, she later finds out that her cancer has been cured and is forced to adjust to her post-cancer world and amend the self-destructive choices she made.\n\n\"Life Sentence was a show that a lot of us needed and I am beyond grateful for those who gave our show a chance,\" Lucy said. \"Somewhere in the universe, the Abbotts will continue their dysfunctional lives & Stella will continue to be a manic pixie dream girl. That chapter is closing before I want it to, but taking this as a life lesson. Things don’t always work out in our favor & it’s up to us what we do with it.\" She concluded the post by saying, It’s been a helluva last year for me and I want to give a huge thank you to the support I’ve been shown! Love love love to all of you. We created something important and pure an no cancellation can take that away.\"", "images": ["https://d2a0gza273xfgz.cloudfront.net/16521/uploads/9f8a6140-5f75-11ea-b226-85197462b238_800_420.jpeg"], "top_img": "https://d2a0gza273xfgz.cloudfront.net/16521/uploads/9f8a6140-5f75-11ea-b226-85197462b238_800_420.jpeg", "keywords": [], "authors": ["Mar"], "canonical_link": "https://meaww.com/lucy-hale-and-ryan-rottman-spark-dating-rumor-after-riley-smith", "title": "Lucy Hale and Ryan Rottman spark dating rumors", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "Lucy Hale and Ryan Rottman spark dating rumor as the pair head out together and shy from holding hands in front of the cameras", "robots": "index,follow,max-image-preview:large", "og": {"image": {"identifier": "https://d2a0gza273xfgz.cloudfront.net/16521/uploads/9f8a6140-5f75-11ea-b226-85197462b238_800_420.jpeg", "width": 1200, "height": 630}, "site_name": "https://meaww.com", "locale": "en_US", "description": "Lucy Hale and Ryan Rottman spark dating rumor as the pair head out together and shy from holding hands in front of the cameras", "url": "https://meaww.com/lucy-hale-and-ryan-rottman-spark-dating-rumor-after-riley-smith", "type": "article"}, "twitter": {"card": "photo", "image": "https://d2a0gza273xfgz.cloudfront.net/16521/uploads/9f8a6140-5f75-11ea-b226-85197462b238_800_420.jpeg"}, "article": {"published_time": "2018-07-03T03:12:18.000Z", "modified_time": "2020-03-06T06:42:42.000Z", "section": "news", "tag": "Florida,jacksonville florida,St. Johns River in Jacksonville,strong river current", "publisher": "https://www.facebook.com/meawwcom/"}, "keywords": "Florida,jacksonville florida,St. Johns River in Jacksonville,strong river current,animals,funny,inspiring,lifestyle,news,parenting,relationships,science-nature,wholesome,work,article,articles,viral,post,fun,read"}, "movies": [], "publish_date": 1530587538.0, "source": "https://meaww.com", "summary": ""}