{"url": "https://tvline.com/2018/02/06/once-upon-a-time-cancelled-ending-season-7/", "text": "Once Upon a Time's \"happily ever after\" is coming sooner than expected; the ABC drama's current seventh season will be its last.\n\n\"Seven years ago, we set out to create a show about hope, where even in the darkest of times, a happy ending would always be possible,\" Adam Horowitz and Eddy Kitsis, the creators and executive producers of Once Upon a Time, said in a statement Tuesday. \"But we never imagined the happy ending that was actually in store for all of us — years and years of adventure, romance, magic and hope. We're so grateful to our brilliant collaborators — the cast, crew, and writers — as well as our partners at the studio and network for making this journey possible. But most of all, we want to thank the fans. Their fierce loyalty and devotion was the real magic behind Once Upon a Time. We hope they join us for these last few hours as we journey to the Enchanted Forest for one more adventure.\"\n\nABC President Channing Dungey — sister of Once's Ursula, Merrin Dungey — adds, \"When we first heard Adam and Eddy's pitch for Once Upon a Time, we knew it was something incredibly special. For seven years, they have captivated us with their creativity and passion while reimagining some of our most beloved Disney fairytales, creating an undeniable global hit. Saying goodbye will be bittersweet, but Once Upon a Time will forever be part of the ABC legacy and we can't wait for fans to join us in this epic final chapter.\"\n\nOnce Upon a Time premiered in Oct. 2011 to 12.8 million total viewers and a 3.9 demo rating, quickly laying claim as that TV season's No. 1 drama launch and spawning a (short-lived) Wonderland-based offshoot in fall of 2013. This season's cast-changing \"requel\" storyline thus far is averaging 2.5 million total viewers and a 0.5 rating in a new Friday night time slot, besting only Agents of S.H.I.E.L.D. and Ten Days in the Valley among ABC dramas.\n\nNew episodes of Once Upon a Time — now the series' final episodes — return Friday, March 2 at 8/7c.\n\nAre you ready to say goodbye to Once Upon a Time? Drop a comment with your thoughts below.", "images": ["https://www.tvline.com/img/TVLine-Icon-RGB-Default-Color.svg", "https://www.tvline.com/img/TVLine-Logo-RGB-Default-Color.svg", "https://www.tvline.com/tvline/news/once-upon-a-time-cancelled-ending-season-7-912970/once-upon-a-time-cancelled.jpg"], "top_img": "https://www.tvline.com/tvline/news/once-upon-a-time-cancelled-ending-season-7-912970/once-upon-a-time-cancelled.jpg", "keywords": [], "authors": ["Andy Swift"], "canonical_link": "https://www.tvline.com/news/once-upon-a-time-cancelled-ending-season-7-912970/", "title": "Once Upon A Time Cancelled", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "max-image-preview:large", "thumbnail": "https://www.tvline.com/tvline/news/once-upon-a-time-cancelled-ending-season-7-912970/once-upon-a-time-cancelled.jpg", "description": "'Once Upon a Time' has been cancelled after seven seasons on ABC.", "mrf": {"tags": "Content Type:Legacy Article;Primary Category:News;Category:News;Headline Approver:Unknown;Trello Board:Legacy"}, "og": {"site_name": "TVLine", "title": "Once Upon A Time Cancelled - TVLine", "image": "https://www.tvline.com/tvline/news/once-upon-a-time-cancelled-ending-season-7-912970/once-upon-a-time-cancelled.jpg", "description": "'Once Upon a Time' has been cancelled after seven seasons on ABC.", "type": "article", "url": "https://www.tvline.com/news/once-upon-a-time-cancelled-ending-season-7-912970/"}, "twitter": {"title": "Once Upon A Time Cancelled - TVLine", "description": "'Once Upon a Time' has been cancelled after seven seasons on ABC.", "site": "@TVLine", "card": "summary_large_image", "image": "https://www.tvline.com/tvline/news/once-upon-a-time-cancelled-ending-season-7-912970/once-upon-a-time-cancelled.jpg"}, "article": {"published_time": "2018-02-06T20:09:15+00:00", "modified_time": "2018-02-06T21:07:05+00:00", "author": "Andy Swift"}}, "movies": [], "publish_date": 1517893200.0, "source": "https://tvline.com", "summary": ""}