{"url": "https://web.archive.org/web/20171016181337/http://time.com/4983806/sophie-turner-joe-jonas-relationship-timeline/", "text": "To the surprise of many of their fans, Sophie Turner and Joe Jonas have officially announced their engagement . The Game of Thrones star and DNCE frontman took to Instagram Sunday to share matching photos of Turner's newly blinged-out hand resting on top of Jonas's with the captions, \"I said yes,\" and, \"She said yes,\" respectively.\n\nHere's everything we know about Turner and Jonas's whirlwind romance.\n\nThe beginning\n\nThe pair first began appearing in photos together in late October, early November of 2016 after they partied together on Halloween.\n\nLess than a week later, they were spotted cuddling up at a pre-MTV Europe Music Awards Kings of Leon concert in the Netherlands.\n\n\"They were really close together,” one concertgoer reportedly told People . “I didn’t look very often because I was seated more in front of the room. The two or three times I was watching they were kissing. She was all smiley and he looked really sweet.\"\n\nSophie with Joe Jonas today in Rotterdam! 😳😍 A post shared by Sophie Turner (@thesophieturner) on Nov 5, 2016 at 1:34pm PDT\n\nTheir relationship appeared to be getting even more serious when they attended a friend's wedding together over Thanksgiving weekend after spending some quality time with Jonas's family.\n\nAbout last night table 5 madness... #rp @pariscarney A post shared by Nick Jonas (@nickjonas) on Nov 27, 2016 at 2:15pm PST\n\nZaZa was chilling with Sansa Stark when these Jonas Brothers moved in on her convo. But she was like, \"y'all can hang with us.\" #petrofftothealtar #hellozaza A post shared by Berndt Mader (@admiral_bernside) on Nov 27, 2016 at 7:03pm PST\n\nInstagram official\n\nTurner finally gave fans the long-awaited confirmation they were waiting on when she shared a photo of Jonas on a boat in Miami in January. \"Miami daze,\" she captioned the shot, which Jonas left a winky face comment on.\n\nMiami Daze A post shared by Sophie Turner (@sophiet) on Jan 1, 2017 at 2:43pm PST\n\nThe two were photographed at the CAA talent agency's pre-Golden Globes 2017 party later that week. However, Turner evaded questions about their relationship on the red carpet leading up to the awards show. \"I'm not saying anything. I'm very happy,\" she told Extra when asked about Jonas. \"I'm not saying anything. I don't know who you're talking about, really.\"\n\nUnder wraps\n\nIn a May interview with InStyle , Turner admitted that she was intent on keeping the details of her love life \"pretty private.\"\n\n\"I found it easier to date someone who understands the industry or is in that world,\" she explained. \"You realize that you’re not going to see each other all the time. And you don’t feel like a jerk when you’re like, 'My publicist says I can’t do this...'\"\n\nTwo months later, she elaborated further on the downside of trying to maintain a \"very happy\" relationship in the public eye. \"You do feel like you're living in a fishbowl,\" she told Marie Claire . \"It's frustrating [that] it's the most mundane things that make the news—how boring!\"\n\nTurner also seemed to hint that Jonas was responsible for helping her come out of her shell somewhat.\n\n\"I very much isolated myself for a while and forgot what was fun. Going out with friends, going out to eat, not really having a care,\" she told the U.K.'s Sunday Times in July. \"And people I've met recently in my life have drawn me out of that. It really helps you own those insecurities. The things I tortured myself about before, I can forget about.\n\nPuppy love\n\nThe two revealed that they had adopted a dog together in September, with Turner sharing a photo of their Siberian Husky puppy, Porky Basquiat, on Instagram while Jonas fawned over the pup in an Instagram story.\n\n\"Meet the newest addition to the krew @porkybasquiat ,\" Turner wrote.\n\nMeet the newest addition to the krew @porkybasquiat 🐶 A post shared by Sophie Turner (@sophiet) on Sep 2, 2017 at 12:48pm PDT\n\nEngagement\n\nThe first true confirmation of Turner and Jonas's relationship came on Oct. 15 when the pair announced their engagement on Instagram.\n\nThose close to the couple were quick to express their excitement about the impending union, with Jonas's younger brother, Nick Jonas, and Turner's longtime best friend , Maisie Williams , re-posting the engagement shot. \"Ahh! Congratulations to my brother...and sister in law to be on your engagement,\" Nick wrote . \"I love you both so much.\"\n\n\"Congratulations to my beautiful girlfriend on her engagement,\" Williams added . \"This is just one of MANY life milestones we'll share. Love you both.\"", "images": ["https://web.archive.org/web/20171016181337im_/https://timedotcom.files.wordpress.com/2017/10/joe-jonas-sophie-turner-engagement.jpg?w=720", "https://web.archive.org/web/20171016181337im_/https://timedotcom.files.wordpress.com/2017/09/bpl-banner-300x50.jpg", "https://web.archive.org/web/20171016181337im_/http://time.com/4983806/sophie-turner-joe-jonas-relationship-timeline/", "https://web.archive.org/web/20171016181337im_/https://timedotcom.files.wordpress.com/2017/10/car-exhaust-air-pollution.jpg?h=52", "https://web.archive.org/web/20171016181337im_/https://timedotcom.files.wordpress.com/2017/10/donald-trump-republicans-agenda.jpg?h=52", "https://web.archive.org/web/20171016181337im_/https://timedotcom.files.wordpress.com/2017/09/bpl-banner-719x48.jpg", "https://web.archive.org/web/20171016181337im_/https://timedotcom.files.wordpress.com/2017/09/bpl-banner-1232x48.jpg", "https://web.archive.org/web/20171016181337im_/https://timedotcom.files.wordpress.com/2017/10/mayim-bialik.jpg?h=52"], "top_img": "https://web.archive.org/web/20171016181337im_/https://timedotcom.files.wordpress.com/2017/10/joe-jonas-sophie-turner-engagement.jpg?w=720", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20171016181337/http://time.com/4983806/sophie-turner-joe-jonas-relationship-timeline/", "title": "Sophie Turner and Joe Jonas Engaged: Relationship Timeline", "meta_data": {"description": "To the surprise of many of their fans, Game of Thrones star Sophie Turner and musician Joe Jonas have officially announced their engagement.", "keywords": "sophie turner, sophie turner engaged, sophie turner joe jonas, sophie turner joe jonas engaged, sophie turner instagram, joe jonas sophie, joe jonas engaged, is joe jonas engaged, who is sophie turner engaged to, is sophie turner engaged", "news_keywords": "sophie turner, sophie turner engaged, sophie turner joe jonas, sophie turner joe jonas engaged, sophie turner instagram, joe jonas sophie, joe jonas engaged, is joe jonas engaged, who is sophie turner engaged to, is sophie turner engaged", "og": {"site_name": "Time", "type": "article", "locale": "en_US", "url": "https://web.archive.org/web/20171016181337/http://time.com/4983806/sophie-turner-joe-jonas-relationship-timeline/", "title": "A Complete History of Sophie Turner and Joe Jonas's Romance", "description": "The Game of Thrones star and DNCE frontman have announced their engagement", "image": "https://web.archive.org/web/20171016181337im_/https://timedotcom.files.wordpress.com/2017/10/joe-jonas-sophie-turner-engagement.jpg?w=720"}, "author": "Megan McCluskey", "fb": {"app_id": 53177223193}, "twitter": {"site": "@TIME", "title": "A Complete History of Sophie Turner and Joe Jonas's Romance", "description": "The Game of Thrones star and DNCE frontman have announced their engagement", "card": "summary_large_image"}, "article": {"author": "http://time.com/author/megan-mccluskey/"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}