{"url": "www.inquisitr.com/4673859/brad-pitt-angelina-jolie-divorce-jolies-cancer-reportedly-scared-brad-pitt-led-to-their-split/", "text": "Brad Pitt and Angelina Jolie supported each other when they were a couple. Even after their split in September 2016, none of the stars have publicly spoken ill about the other one. Angelina Jolie’s recent podcast conversation has made some to believe that the reason behind her split with husband Brad Pitt was her cancer scare. One publication, Philippine Daily Inquirer , even reported that Jolie supposedly said her health concerns led to her divorce with Pitt. Reportedly, the actor was afraid of her cancer and decided to end the marriage.\n\nIn a recent interview on the Hollywood Reporter ‘s podcast for her film First They Killed My Father , Angelina Jolie candidly revealed that her health problems reportedly took a toll on her married life with Brad Pitt.\n\nBack in 2013, Angelina Jolie underwent a preventive double mastectomy after learning from her doctors that she had an 87 percent risk of developing breast cancer due to a defective BRCA1 gene. Angelina’s mother, Marcheline Bertrand, also had breast cancer and died from ovarian cancer when she was just 56 years old. Her double mastectomy lowered her chances of developing breast cancer to under 5 percent, and Angelina Jolie followed it up with a reconstructive surgery involving allografts and implants.\n\n“I do not feel any less of a woman. I feel empowered that I made a strong choice that in no way diminishes my femininity,” she wrote in one of her op-eds for the New York Times .\n\nGossip Cop debunked the Inquirer ‘s claims and stated that Jolie’s cancer scare did not play a role in her and Pitt’s divorce. The site also confirmed that Brad Pitt and Angelina Jolie’s divorce was not caused by infidelity or because of any involvement of a third party, claims that were mentioned in the Inquirer report. In reality, the September 2016 split was caused after a drunken Brad Pitt got into an argument with their son Maddox aboard a plane.\n\nGossip Cop made it clear that during her recent interview, Angelina was only talking about her film By The Sea and all the difficulties she had to face during her work on that project.\n\nDespite all the claims or speculations that Brad Pitt was afraid of Angelina Jolie’s cancer and decided to end the marriage, the Fight Club movie actor told in the past that Angelina did all the surgeries for their kids and her family.\n\n“There was no vanity to my wife’s approach. It was mature. There was a strength in that. It was just another one of those things in life that makes you tighter and she was doing it for the kids, and she was doing it for her family so we could be together,” Brad Pitt revealed during his previous interview on The Today Show.\n\nAngelina Jolie also confessed during the podcast that she became an actress so that she can pay her late mother Marcheline Bertrand’s bills. Despite the initial success, the actress revealed she never truly felt at home in front of the camera. The actress-turned-director added that acting is a creative job and it helped her in exploring different times in history.", "images": ["https://www.inquisitr.com/wp-content/uploads/2025/10/2421769f-57a4-4bff-913f-cf316747493e.jpg", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20500%20157'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20492%20142'%3E%3C/svg%3E", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo-white.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/inquisitr-logo.png", "https://secure.gravatar.com/avatar/ec436e1595ee1fd93e8f144c4cf0a508?s=120&d=mm&r=g", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent-Dark-Mode.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20120%20120'%3E%3C/svg%3E"], "top_img": "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "keywords": [], "authors": ["News Writer"], "canonical_link": "https://www.inquisitr.com/brad-pitt-angelina-jolie-divorce-jolies-cancer-reportedly-scared-brad-pitt-led-to-their-split", "title": "Brad Pitt, Angelina Jolie Divorce — Jolie’s Cancer Scare Did Not Lead To Split [Debunked]", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "https://www.inquisitr.com/wp-content/uploads/2024/12/favicon.png", "description": "Brad Pitt and Angelina Jolie supported each other when they were a couple. Even after their split in September 2016, none of the stars have publicly spoken", "robots": "follow, index, max-snippet:-1, max-video-preview:-1, max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Brad Pitt, Angelina Jolie Divorce — Jolie’s Cancer Scare Did Not Lead To Split [Debunked] - Inquisitr News", "description": "Brad Pitt and Angelina Jolie supported each other when they were a couple. Even after their split in September 2016, none of the stars have publicly spoken", "url": "https://www.inquisitr.com/brad-pitt-angelina-jolie-divorce-jolies-cancer-reportedly-scared-brad-pitt-led-to-their-split", "site_name": "Inquisitr News"}, "article": {"tag": "Brad Pitt", "section": "News", "published_time": "2017-12-09T00:05:00-05:00"}, "twitter": {"card": "summary_large_image", "title": "Brad Pitt, Angelina Jolie Divorce — Jolie’s Cancer Scare Did Not Lead To Split [Debunked] - Inquisitr News", "description": "Brad Pitt and Angelina Jolie supported each other when they were a couple. Even after their split in September 2016, none of the stars have publicly spoken", "site": "@theinquisitr", "creator": "@theinquisitr"}, "generator": "WP Rocket 3.18.3"}, "movies": [], "publish_date": 1512795900.0, "source": "http://www.inquisitr.com", "summary": ""}