{"url": "https://www.huffingtonpost.com/entry/jimmy-kimmel-shares-adorable-health-update-after-sons-heart-surgery_us_59737ac5e4b09e5f6ccfb1c6", "text": "LOADING ERROR LOADING\n\nNearly three months ago, Jimmy Kimmel broke down in tears during a powerful monologue on his late-night show about his newborn son’s recent open heart surgery.\n\nHis candor drew much-needed attention to the importance of providing all Americans, especially those with pre-existing conditions like his son, with adequate health care.\n\nAdvertisement\n\nOn Friday, Kimmel took to Twitter to share the first photo of William “Billy” Kimmel since opening up about his health struggles.\n\n“Billy is 3 months old & doing great. Thx for the love & support. Please remind your Congresspeople that every kid deserves the care he got,” Kimmel wrote alongside a photo of his smiling baby boy.\n\nBilly is 3 months old & doing great. Thx for the love & support. Please remind your Congresspeople that every kid deserves the care he got pic.twitter.com/XcvvM6XFJ3 — Jimmy Kimmel (@jimmykimmel) July 21, 2017\n\nAdvertisement\n\nKimmel’s wife and co-head writer Molly McNearney also posted an update with a different photo of their son looking just as happy, encouraging Americans once again to get involved in health care reform.\n\n“Billy’s looking out for a lot of his buddies at Children’s Hospital. Remind your Congresspeople to protect them,” she wrote.\n\nBilly's looking out for a lot of his buddies at Children's Hospital. Remind your Congresspeople to protect them. pic.twitter.com/UbFp2UgqGH — Molly McNearney (@mollymcnearney) July 21, 2017\n\nAdvertisement\n\nAfter welcoming their son in April, Kimmel and McNearney learned that Billy had congenital heart disease. The newborn underwent a successful open-heart surgery at just three days old and returned home six days later.\n\n“Before 2014, if you were born with congenital heart disease like my son was,” Kimmel explained at the time, “there was a good chance you’d never be able to get health insurance because you had a pre-existing condition.”\n\nStories That Inspire You Your Support Fuels Our Mission Your Support Fuels Our Mission Become a Member Today As the year ends, our reporting does not slow down. Support the journalists who continue asking questions and telling stories with depth and care. Your membership today helps ensure we start the new year strong. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. Support HuffPost Already a member? Log in to hide these messages.\n\nThe speech quickly went viral as the Republican-dominated Senate debated repealing Obamacare and replacing it with a new health care plan that threatens to cut funding for millions, especially for those with pre-existing conditions.\n\nAdvertisement\n\nHe also revealed that his son will likely needed an additional surgery somewhere between the ages of 3- and 6-months-old.\n\n“If your baby is going to die and it doesn’t have to, it shouldn’t matter how much money you make,” he added. “I think that’s something, whether you’re a Republican or a Democrat or something else, we all agree on.”\n\nCelebrate Truth This Season Your Support Fuels Our Mission Your Support Fuels Our Mission The holidays can get loud. But some stories cut through the noise -- the ones that make sense of the chaos and hold power to account. Support the newsroom built on clarity, accountability, and a healthy dose of reality. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. “Our fierce, independent reporting and unvarnished perspective hold power to account and inform millions of readers. Please support this hard-hitting journalism.” Monthly Annually SAVE 16% Support $5/month (about $0.17/day) Silver Huffposter 🤍 Monthly recurring supporter-only email\n\nFewer requests for financial support Support $10/month (about $0.33/day) Gold Everything in the Silver Tier\n\nAd-free access on the HuffPost website OR HuffPost apps\n\nSay goodbye to annoying video interruptions while you read. No more autoplay videos. Support $20/month (about $0.67/day) Platinum HuffPoster 🏆 Everything in the Gold Tier\n\nAd-free access on the HuffPost website AND HuffPost apps\n\nEarly access to new features\n\nMembership to Platinum Club focus group Make a One Time Contribution Support HuffPost Already a member? Log in to hide these messages.", "images": ["https://img.huffingtonpost.com/asset/5cc855a6240000090c524d4f.jpg?ops=100_100", "https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "https://img.huffingtonpost.com/asset/59738dcd2100003400fc832c.png?cache=lYdkSsw6Bn&ops=1200_630", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNkYAAAAAYAAjCB0C8AAAAASUVORK5CYII=", "https://img.huffingtonpost.com/asset/691c87541700009d2b9c5f37.jpg?ops=50_50"], "top_img": "https://img.huffingtonpost.com/asset/59738dcd2100003400fc832c.png?cache=lYdkSsw6Bn&ops=1200_630", "keywords": [], "authors": ["Senior Reporter", "Whitney Snyder", "Editor-In-Chief Huffpost"], "canonical_link": "https://www.huffpost.com/entry/jimmy-kimmel-shares-adorable-health-update-after-sons-heart-surgery_n_59737ac5e4b09e5f6ccfb1c6", "title": "Jimmy Kimmel Shares Adorable Health Update After Son's Heart Surgery", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "The 3-month-old is \"doing great.\"", "keywords": "Health and Medicine,Babies,Jimmy Kimmel,Congenital Heart Disease", "fb": {"app_id": 46744042133}, "og": {"title": "Jimmy Kimmel Shares Adorable Health Update After Son's Heart Surgery", "type": "article", "image": {"identifier": "https://img.huffingtonpost.com/asset/59738dcd2100003400fc832c.png?cache=lYdkSsw6Bn&ops=1200_630", "url": "https://img.huffingtonpost.com/asset/59738dcd2100003400fc832c.png?cache=lYdkSsw6Bn&ops=1200_630", "type": "image/png", "width": 1200, "height": 630}, "url": "https://www.huffpost.com/entry/jimmy-kimmel-shares-adorable-health-update-after-sons-heart-surgery_n_59737ac5e4b09e5f6ccfb1c6", "site_name": "HuffPost", "locale": "en_US", "description": "The 3-month-old is \"doing great.\""}, "article": {"tag": "Health and Medicine,Babies,Jimmy Kimmel,Congenital Heart Disease", "section": "Entertainment", "published_time": "2017-07-22T18:30:32Z", "modified_time": "2017-07-22T18:30:32Z"}, "twitter": {"card": "summary_large_image", "site": "@HuffPostEnt", "title": "Jimmy Kimmel Shares Adorable Health Update After Son's Heart Surgery", "image": {"identifier": "https://img.huffingtonpost.com/asset/59738dcd2100003400fc832c.png?cache=lYdkSsw6Bn&ops=1200_630", "width": 1200, "height": 630}, "description": "The 3-month-old is \"doing great.\""}, "al": {"ios": {"url": "huffpostnews:///?editionID=us&entryID=us_59737ac5e4b09e5f6ccfb1c6", "app_store_id": 306621789, "app_name": "HuffPost"}}, "bingbot": "noarchive", "robots": "max-snippet:-1,max-image-preview:large,max-video-preview:-1", "google-site-verification": "97Mj-wW7u8U1NOnkW1rfH-I1kgO0-a9YsgoesOk41R8"}, "movies": [], "publish_date": 1500748232.0, "source": "https://www.huffingtonpost.com", "summary": ""}