{"url": "https://www.biography.com/people/miley-cyrus-299134", "text": "1992-present\n\nMiley Cyrus Now: Singer Sued for Allegedly Copying Bruno Mars Song\n\nMiley Cyrus is a Grammy winner for the second year in a row thanks to her collaboration with multi-genre star Beyoncé.\n\nBeyoncé's track “II Most Wanted,” featuring the 32-year-old Cyrus, won the award for Best Country Duo/Group Performance on Sunday. The win is the third Grammy overall for Cyrus, who earned trophies for Record of the Year and Best Pop Solo Performance in 2024 for “Flowers.”\n\nThe song from Beyoncé's chart-topping album Cowboy Carter beat out a pair of other hit collaborations: “I Had Some Help” featuring Morgan Wallen and Post Malone, as well as “Cowboys Cry Too” with Kelsea Ballerini and Noah Kahan.\n\nWho Is Miley Cyrus?\n\nMiley Cyrus is a Grammy-winning singer and actor. The daughter of country star Billy Ray Cyrus, she began acting at a young age, landing the starring role on the hit show Hannah Montana in 2004. Cyrus went on to release several successful albums, including 2008’s Breakout and 2010’s Can’t Be Tamed, while becoming increasingly known for her wild behavior. Her 2013 single “Wrecking Ball,” backed by a controversial video, became her first No. 1 hit. Along with retaining a presence on radio, Cyrus served as a coach on The Voice for two seasons. The singer won her first Grammy Awards in 2024 for her hit song “Flowers” and a third in 2025 for the single “II Most Wanted” with Beyoncé.\n\nQuick Facts\n\nFULL NAME: Miley Ray Cyrus\n\nBORN: November 23, 1992\n\nBIRTHPLACE: Franklin, Tennessee\n\nSPOUSE: Liam Hemsworth (2018-2020)\n\nASTROLOGICAL SIGN: Sagittarius\n\nEarly Life and Career\n\nBorn Destiny Hope Cyrus on November 23, 1992, in Franklin, Tennessee, Miley Cyrus is the daughter of 1990s country star Billy Ray Cyrus. She changed her name to Miley Ray Cyrus in 2008, legally adopting the nickname she was given as a baby for often smiling.\n\nMiley grew up on the family farm, near Nashville, Tennessee, with two siblings and three half-siblings. Her godmother is country music icon Dolly Parton. Cyrus was passionate about acting at a young age, appearing on her father’s television series, Doc, and in Tim Burton’s Big Fish (2003).\n\nDive Deeper Miley Cyrus and Dolly Parton Share a Special Bond\n\nHannah Montana\n\nIn 2004, Cyrus beat out 1,000 hopefuls to land the starring role of Miley Stewart on the hit Disney show Hannah Montana. The tween series features a young pop superstar (Montana) who hides her celebrity identity to be an everyday teen in real life (Stewart).\n\nTo accommodate filming, the entire family moved to Los Angeles with Billy Ray joining his daughter on screen as her fictional dad-manager. Her star on the rise, Cyrus released a successful Hannah Montana soundtrack album in 2006.\n\nIn 2007, Cyrus’s double album, Hannah Montana 2: Meet Miley Cyrus, led to the launch of the Best of Both Worlds Tour. The concert series sold out in record time and was extended by 14 dates to help placate disappointed fans. Her successful 3-D concert film collected $31.3 million during its opening weekend in February 2008.\n\nEnthusiasm for Cyrus’ TV alter ego remained strong through the end of the decade. Hannah Montana: The Movie scored at the box office, bringing in more than $79 million following its April 2009 release. Cyrus bid farewell to the role with the conclusion of Hannah Montana in early 2011.\n\nAlbums and Hit Songs\n\nBreakout, The Time of Our Lives, and Can’t Be Tamed\n\nCyrus’ second studio album, Breakout, became a huge hit in 2008, reaching the top of the pop album charts. The following year she released the EP The Time of Our Lives, featuring the hit singles “Party in the U.S.A.” and “When I Look at You,” the former becoming one of the singer’s most successful song to date, selling more than 5.38 million copies and earning a spot among the best-selling singles of all time. The young star followed that success with the release of a new album, 2010’s Can’t Be Tamed.\n\n“We Can’t Stop,” “Wrecking Ball,” and Bangerz\n\nCyrus sought to distance herself from her Hannah Montana persona by cutting her hair short and wearing edgy fashions, but no one was quite prepared for how far she would go: At the MTV Video Music Awards (VMAs) in August 2013, Cyrus stunned the audience with her raunchy performance of her single “We Can’t Stop.”\n\nAround this time, she appeared nude in the video of a follow-up single “Wrecking Ball.” However, the swirling controversy seemed to bolster sales of Cyrus’ fourth studio album, Bangerz, released in October 2013. Meanwhile, “Wrecking Ball” became her first U.S. single to top the pop charts and earned her Video of the Year honors at the 2014 VMAs.\n\nMiley Cyrus & Her Dead Petz and Younger Now\n\nNamed host of the 2015 VMAs, Cyrus concluded her efforts that evening by announcing the release of a new, free album. A departure from her pop roots, Miley Cyrus & Her Dead Petz explored themes of psychedelia as it wound through its 23 tracks. The album drew mixed reviews, with some critics praising the artist’s willingness to push creative boundaries while retaining a sense of radio-friendly tracks. Her follow-up album, Younger Now (2017), featuring the lead single “Malibu,” marked a return to more conservative fare.\n\nShe Is Coming and Plastic Hearts\n\nHer seventh studio album on the way, Cyrus released its first installment, the seven-track EP She Is Coming, in May 2019, with the single “Mother’s Daughter” arriving a couple of weeks later. Cyrus followed with “Slide Away” that August, before teaming with Ariana Grande and Lana Del Rey for “Don’t Call Me Angel,” from the Charlie’s Angels soundtrack.\n\nHer full album Plastic Hearts followed in November 2020 and reached No. 2 on the Billboard 200. It’s most successful song was “Midnight Sky.” Even bigger success was just ahead.\n\n“Flowers” and Endless Summer Vacation\n\nCyrus kicked off 2023 by releasing “Flowers,” which quickly became her second No. 1 hit song. It topped the Billboard Hot 100 for eight weeks and anchored her eighth studio album, Endless Summer Vacation, that arrived in August. Both the song and the album were commercially and critically successful, earning the singer six Grammy nominations.\n\nIn February 2024, Cyrus accepted her first Grammy Awards. “Flowers” won Record of the Year and Best Pop Solo Performance.\n\nThe following year, Cyrus won her third Grammy—for Best Country Duo/Group Performance for the track “II Most Wanted” with Beyoncé.\n\nMovies and TV\n\nThe Last Song, LOL, and So Undercover\n\nIn 2010, Cyrus starred in the romantic drama The Last Song, a movie based on a novel of the same name by Nicholas Sparks. Her coming-of-age drama LOL (2012) also was geared toward tween audiences, while her attempt to branch out slightly, as a private investigator in So Undercover (2012), wound up as a direct-to-video release in the United States.\n\nThe Night Before, A Very Murray Christmas, and Crisis in Six Scenes\n\nCyrus resumed her film work in 2015 by appearing as herself in two holiday comedies: The Night Before, starring Seth Rogen and Joseph Gordon-Levitt, and the Bill Murray variety special A Very Murray Christmas. The following year she teamed with Woody Allen to star in the Amazon series Crisis in Six Scenes.\n\nThe Voice\n\nAlready a veteran of the small screen, Cyrus put her hosting duties to task once again as one of the new female coaches of season 11 of The Voice, the other being Alicia Keys. The women competed to discover the top artist, alongside veteran coaches Adam Levine and Blake Shelton. Cyrus left at the end of the season but returned for season 13 in 2017.\n\nBlack Mirror and Bright Minded\n\nFollowing a small, uncredited voice role in Guardians of the Galaxy Vol. 2 (2017), Cyrus was the center of attention in the June 2019 season 5 opener of the TV series Black Mirror, in which she played a pop star named Ashley O. The following spring, she launched the interview show Bright Minded: Live with Miley on Instagram Live as a way of helping the public cope with the coronavirus outbreak.\n\nCopyright Infringement Lawsuits\n\nIn 2018, Jamaican singer-songwriter Michael May, who performs under the name Flourgon, filed a lawsuit alleging Cyrus’ 2013 hit “We Can’t Stop” was based on his 1988 song “We Run Things.” According to his complaint, Cyrus had lifted the lyrics “We run things / Things don’t run we” from May’s “We run things / Things no run we,” and “significantly incorporated” his “vocal melody/rhythm/cadence/inflection.” Cyrus agreed to pay Flourgon $300 million in a settlement that was finalized in early 2020.\n\nMore than four years later, Cyrus is again facing a lawsuit over her second No. 1 hit, “Flowers.” In September 2024, a music rights company sued the singer over claims that the Grammy-winning track copies elements from Bruno Mars’ song “When I Was Your Man.” Mars isn’t affiliated with the company, which owns a share of the song’s copyright. Cyrus’ legal team filed a motion for dismissal in November 2024, but the suit remains ongoing.\n\nBooks\n\nIn 2008, Cyrus stirred up controversy by posing for revealing shots taken by famed photographer Annie Leibovitz, which appeared in Vanity Fair magazine. The resulting criticism prompted an “embarrassed” Cyrus to apologize to fans, though years later she tweeted that she wasn’t sorry at all, with a four-letter word for emphasis.\n\nIn 2009, Cyrus provided a look into her life with the autobiography Miles to Go, featuring previously unseen photos, family stories and “a look at her inner circle of loved ones.” In a statement around this time, Cyrus said of the book, “I am so excited to let fans in on how important my relationship with my family is to me. I hope to motivate mothers and daughters to build lifetimes of memories together and inspire kids around the world to live their dreams.”\n\nEx-Husband Liam Hemsworth\n\nCyrus, who has made headlines for her romantic life, briefly dated Nick Jonas of the musical group the Jonas Brothers in 2007. She was also romantically linked to model Justin Gaston and actor Carter Jenkins, among other celebrities.\n\nIn June 2012, after three years of dating, Cyrus announced her engagement to actor and Hunger Games star Liam Hemsworth. The pair called it quits in September 2013, and although they later rekindled their relationship and got married on December 23, 2018, they separated again the following summer.\n\nQuotes\n\nI hope to motivate mothers and daughters to build lifetimes of memories together and inspire kids around the world to live their dreams.\n\n\n\nDon’t believe everything you read, folks.\n\n\n\nFact Check: We strive for accuracy and fairness. If you see something that doesn’t look right, contact us!", "images": ["https://www.biography.com/_assets/design-tokens/biography/static/images/logos/logo.5ec9b18.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2189275794-crop-675c4d3701992.jpg?crop=0.646xw:0.646xh;0.165xw,0.0144xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/miley-cyrus-attends-the-versace-fw23-show-at-pacific-design-news-photo-1707096564.jpg?crop=0.622xw:0.934xh;0.167xw,0.0663xh&resize=640:*", "https://www.biography.com/_assets/design-tokens/biography/static/images/logos/network-logo.04aa008.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/zach-bryan-attends-the-58th-academy-of-country-music-awards-news-photo-1698437227.jpg?crop=1.00xw:0.681xh;0,0.116xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1309300538-67d08c4768498.jpg?crop=1.00xw:0.673xh;0,0.0398xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://hips.hearstapps.com/hmg-prod/images/cynthia-erivo-attends-the-77th-annual-tony-awards-at-david-news-photo-1728393569.jpg?crop=1.00xw:0.673xh;0,0.0738xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/lainey-wilson-attends-charlize-therons-africa-outreach-news-photo-1746804440.pjpeg?crop=1.00xw:0.668xh;0,0.0684xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/rihanna-attends-the-savage-x-fenty-celebration-of-lavish-news-photo-1758829666.pjpeg?crop=0.516xw:0.344xh;0.283xw,0.0645xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/keith-urban-attends-the-2024-cmt-music-awards-at-moody-news-photo-1742328453.pjpeg?crop=1.00xw:0.668xh;0,0&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://www.biography.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://www.biography.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://hips.hearstapps.com/rover/profile_photos/5fcff581-7d28-4053-b059-6459ddbfb3bf_1723555868.file?fill=1:1&resize=120:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://www.biography.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/miley-cyrus-and-dolly-parton-attend-musicares-person-of-the-news-photo-1698079569.jpg?crop=1.00xw:0.282xh;0,0.0568xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/miley-cyrus-attends-the-67th-annual-grammy-awards-at-crypto-news-photo-1738550349.pjpeg?crop=0.902xw:0.678xh;0.0593xw,0.106xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/81st-golden-globe-awards-taylor-swift-on-the-red-carpet-of-news-photo-1719260997.jpg?crop=0.361xw:0.461xh;0.558xw,0.0847xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/sean-diddy-combs-on-friday-september-15-2023-news-photo-1711468298.jpg?crop=0.674xw:1.00xh;0.137xw,0&resize=360:*", "https://hips.hearstapps.com/vidthumb/images/inkt-ep04-thumbnail-682dd7da2d33d.jpg?crop=1xw:1xh;center,top", "https://hips.hearstapps.com/hmg-prod/images/puerto-rican-singer-bad-bunny-attends-the-premiere-of-news-photo-1757619516.pjpeg?crop=0.668xw:1.00xh;0.119xw,0&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/bruce-springsteen-attends-the-road-diary-bruce-springsteen-news-photo-1743790328.pjpeg?crop=0.668xw:1.00xh;0.167xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/kesha-attends-iheartradio-hot-99-5s-jingle-ball-2024-news-photo-1751485010.pjpeg?crop=0.630xw:0.947xh;0.205xw,0.0529xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://hips.hearstapps.com/rover/profile_photos/b50d4909-0f39-4b73-b482-46d0a9078d40_1682363012.file?fill=1:1&resize=120:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/miley-cyrus-attends-the-67th-annual-grammy-awards-at-crypto-news-photo-1738550349.pjpeg?crop=0.902xw:0.678xh;0.0593xw,0.106xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.biography.com/musicians/miley-cyrus", "title": "Miley Cyrus: Biography, Musician, Actor, 2025 Grammy Winner", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Miley Cyrus: Biography, Musician, Actor, 2025 Grammy Winner", "description": "Actor and singer Miley Cyrus achieved early fame as the star of the TV series ‘Hannah Montana’ and has become a successful pop artist.", "keywords": "alert", "theme-color": "#000000", "og": {"site_name": "Biography", "title": "A Hit Collab with Beyoncé Gives Miley Cyrus Another Grammy Win", "description": "Cyrus received her third award in two years, this time for Best Country Duo/Group Performance, with the single “II Most Wanted.”", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/miley-cyrus-attends-the-67th-annual-grammy-awards-at-crypto-news-photo-1738550349.pjpeg?crop=0.902xw:0.678xh;0.0593xw,0.106xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.biography.com/musicians/miley-cyrus", "type": "article"}, "article": {"publisher": "https://www.facebook.com/Biography", "opinion": "false", "section": "Famous Musicians", "modified_time": "2025-02-03T03:07:00Z", "published_time": "2025-02-03T03:07:00Z"}, "parsely-metadata": "{\"socialHeadline\":\"A Hit Collab with Beyoncé Gives Miley Cyrus Another Grammy Win\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/miley-cyrus-attends-the-67th-annual-grammy-awards-at-crypto-news-photo-1738550349.pjpeg?crop=0.630xw:0.945xh;0.274xw,0.0553xh&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/miley-cyrus-attends-the-67th-annual-grammy-awards-at-crypto-news-photo-1738550349.pjpeg?crop=0.902xw:0.678xh;0.0593xw,0.106xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/miley-cyrus-attends-the-67th-annual-grammy-awards-at-crypto-news-photo-1738550349.pjpeg?crop=0.630xw:0.945xh;0.274xw,0.0553xh", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/miley-cyrus-attends-the-67th-annual-grammy-awards-at-crypto-news-photo-1738550349.pjpeg?crop=0.902xw:0.678xh;0.0593xw,0.106xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "timely", "sailthru.excerpt": "1992-presentMiley Cyrus Now: Singer Sued for Allegedly Copying Bruno Mars SongMiley Cyrus is a Grammy winner for the second year in a row thanks to her collaboration with multi-genre star Beyoncé.Beyoncé's track “II Most Wanted,” featuring the 32-year-old Cyrus, won the award for Best Country Duo/Group Performance on Sunday. The", "sailthru.tags": "musicians,Famous Musicians,grammy-awards,Grammy Awards,Biography-US", "sailthru.date": "2025-02-03 03:07:00", "sailthru.socialtitle": "A Hit Collab with Beyoncé Gives Miley Cyrus Another Grammy Win", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1738552020.0, "source": "https://www.biography.com", "summary": ""}