{"url": "www.huffingtonpost.com/2012/11/15/justin-bieber-selena-gomez-relationship-rumors-proposals-jealousy-too-needy-desperate_n_2136627.html", "text": "LOS ANGELES, CA - AUGUST 28: Singer Justin Bieber (L) and actress/singer Selena Gomez arrive at the 2011 MTV Video Music Awards at Nokia Theatre L.A. LIVE on August 28, 2011 in Los Angeles, California. (Photo by Christopher Polk/Getty Images)\n\nNo doubt, you are still distraught after learning nearly a week ago that Selena Gomez broke up with Justin Bieber.\n\nNothing make sense anymore: Black is white, up is down and you are questioning if love even exists. Well, hold on tight, because things are about to get even crazier when it comes to \"Jelena\" breakup rumors.\n\nAdvertisement\n\nThe pop-star power couple are splitsville now, but rumors that Bieber, 18, proposed to his 20-year-old girlfriend, not once but twice, in the months before the breakup are gaining traction. Proposal rumors developed out of a blind item from earlier this month, and there is talk that their relationship began as a PR arrangement -- which was fine for Gomez, who saw it as a job from the get go -- but Bieber actually fell for her and wanted to make things official.\n\nThis isn't the first time we've heard that their relationship was a publicity stunt and it's not the first time we've heard engagement rumors. There were multiple reports the couple was engaged or that Bieber had proposed throughout their nearly two year relationship, and more recently it was reported that Gomez's team had encouraged her to stay with Bieber because it was good for her brand.\n\nWhile the proposals are likely a bit of a stretch, it definitely sounds like Gomez wasn't as into the relationship as the teen pop star and she also wasn't about to be made a fool of, because of his tendency to flirt with other women.\n\nAdvertisement\n\nAccording to Gossip Cop, Gomez had \"trust issues\" with Bieber, but she also wasn't able to spend as much time with him as he wanted. Sources told the website that the teen heartthrob was \"very needy,\" and \"constantly complaining” for her to “make time for him.\"\n\nMultiple sources told E! news that the breakup was \"a long time coming\" and jealousy had been building up for some time between the pair.\n\nThough it was a photo of Biebs with model Barbara Palvin that sparked rumors he'd already moved on, sources say it was a photo of Gomez kissing her \"Parental Guidance\" co-star Nat Wolff that set the couple on rocky ground. The kiss happened while the actors were filming a scene, but it sounds like Bieber and Gomez have been playing a game of emotional chicken -- trying to see who can make the other jealous.\n\nAdvertisement\n\n\"They're young. Of course they have their jealous streaks. Justin has gotten jealous, and so has Selena,\" a source told E! News.\n\nTheir relationship sounds less than ideal, so it's not shocking that Gomez would want out. RadarOnline is also reporting that jealousy contributed to the downfall of \"Jelena,\" and sources say that Bieber has promised he'll stop texting other girls if Gomez takes him back.\n\nStories That Inspire You Your Support Fuels Our Mission Your Support Fuels Our Mission Become a Member Today As the year ends, our reporting does not slow down. Support the journalists who continue asking questions and telling stories with depth and care. Your membership today helps ensure we start the new year strong. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. Support HuffPost Already a member? Log in to hide these messages.\n\n\"He is texting her like crazy trying to stay in her good graces,\" the source told the website. \"If either one of them slows down and they actually have the chance to spend time together again, they will end up back together.\"\n\nAdvertisement\n\nBieber is reportedly desperate to get back with Gomez, but it doesn't look like the breakup has slowed him down -- at all. The pop star has kept himself busy by posting shirtless photos to Twitter, riding around on his $20,000 Ducati, and hanging out with Ashley Olsen at a Textile Elizabeth & James event -- that's just weird.\n\nUPDATE: Selena must be tired of the constant texts she's reportedly getting from the Biebs, as sources tell TMZ she's spent the last day blocking her phone number and other communication devices so he can't contact her. Though she's still following him on Twitter, the source says she wants no contact with the pop star. It's not surprising, since sources also say the breakup \"absolutely, positively involved another woman.\"\n\nCelebrate Truth This Season Your Support Fuels Our Mission Your Support Fuels Our Mission The holidays can get loud. But some stories cut through the noise -- the ones that make sense of the chaos and hold power to account. Support the newsroom built on clarity, accountability, and a healthy dose of reality. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. “Our fierce, independent reporting and unvarnished perspective hold power to account and inform millions of readers. Please support this hard-hitting journalism.” Monthly Annually SAVE 16% Support $5/month (about $0.17/day) Silver Huffposter 🤍 Monthly recurring supporter-only email\n\nFewer requests for financial support Support $10/month (about $0.33/day) Gold Everything in the Silver Tier\n\nAd-free access on the HuffPost website OR HuffPost apps\n\nSay goodbye to annoying video interruptions while you read. No more autoplay videos. Support $20/month (about $0.67/day) Platinum HuffPoster 🏆 Everything in the Gold Tier\n\nAd-free access on the HuffPost website AND HuffPost apps\n\nEarly access to new features\n\nMembership to Platinum Club focus group Make a One Time Contribution Support HuffPost Already a member? Log in to hide these messages.", "images": ["https://img.huffingtonpost.com/asset/691c87541700009d2b9c5f37.jpg?ops=50_50", "https://img.huffingtonpost.com/asset/default-entry.jpg?ops=1200_630", "https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "https://img.huffingtonpost.com/asset/5bb515ea2200004301dc4cd2.jpeg?ops=scalefit_720_noupscale"], "top_img": "https://img.huffingtonpost.com/asset/default-entry.jpg?ops=1200_630", "keywords": [], "authors": ["Whitney Snyder", "Editor-In-Chief Huffpost"], "canonical_link": "https://www.huffpost.com/entry/justin-bieber-selena-gomez-relationship-rumors-proposals-jealousy-too-needy-desperate_n_2136627", "title": "Justin Bieber, Selena Gomez Relationship Rumors: Proposals, Jealousy, Bieber Desperate To Reconcile (UPDATE)", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "Justin Bieber Proposed? Too Needy? Desperate To Get Selena Back?", "keywords": "Celebrity Splits,Selena Gomez,Justin Bieber,celebrity,Video,Celebrity Couples", "fb": {"app_id": 46744042133}, "og": {"title": "Justin Bieber Proposed? Too Needy? Desperate To Get Selena Back?", "type": "article", "image": {"identifier": "https://img.huffingtonpost.com/asset/default-entry.jpg?ops=1200_630", "url": "https://img.huffingtonpost.com/asset/default-entry.jpg?ops=1200_630", "type": "image/jpeg", "width": 1200, "height": 630}, "url": "https://www.huffpost.com/entry/justin-bieber-selena-gomez-relationship-rumors-proposals-jealousy-too-needy-desperate_n_2136627", "site_name": "HuffPost", "locale": "en_US", "description": "Justin Bieber Proposed? Too Needy? Desperate To Get Selena Back?"}, "article": {"tag": "Celebrity Splits,Selena Gomez,Justin Bieber,celebrity,Video,Celebrity Couples", "section": "Celebrity", "published_time": "2012-11-15T15:40:33Z", "modified_time": "2012-11-15T19:42:48Z"}, "twitter": {"card": "summary_large_image", "site": "@HuffPostEnt", "title": "Justin Bieber Proposed? Too Needy? Desperate To Get Selena Back?", "image": {"identifier": "https://img.huffingtonpost.com/asset/default-entry.jpg?ops=1200_630", "width": 1200, "height": 630}, "description": "Justin Bieber Proposed? Too Needy? Desperate To Get Selena Back?"}, "al": {"ios": {"url": "huffpostnews:///?editionID=us&entryID=us_5bb515eae4b0d5899c162009", "app_store_id": 306621789, "app_name": "HuffPost"}}, "bingbot": "noarchive", "robots": "max-snippet:-1,max-image-preview:large,max-video-preview:-1", "google-site-verification": "97Mj-wW7u8U1NOnkW1rfH-I1kgO0-a9YsgoesOk41R8"}, "movies": [], "publish_date": 1352955600.0, "source": "http://www.huffingtonpost.com", "summary": ""}