{"url": "https://www.twincities.com/2018/02/04/meet-ryan-mckenna-the-kid-that-took-a-selfie-with-justin-timberlake-at-super-bowl-lii/", "text": "To place an obituary, please include the information from the obituary checklist below in an email to obits@pioneerpress.com. There is no option to place them through our website at this time. Feel free to contact our obituary desk at 651-228-5263 with any questions.\n\nGeneral Information:\n\nYour full name,\n\nAddress (City, State, Zip Code),\n\nPhone number,\n\nAnd an alternate phone number (if any)\n\nObituary Specification:\n\nName of Deceased,\n\nObituary Text,\n\nA photo in a JPEG or PDF file is preferable, TIF and other files are accepted, we will contact you if there are any issues with the photo.\n\nAd Run dates\n\nThere is a discount for running more than one day, but this must be scheduled on the first run date to apply.\n\nIf a photo is used, it must be used for both days for the discount to apply, contact us for more information.\n\nPolicies:\n\nVerification of Death:\n\nIn order to publish obituaries a name and phone number of funeral home/cremation society is required. We must contact the funeral home/cremation society handling the arrangements during their business hours to verify the death. If the body of the deceased has been donated to the University of Minnesota Anatomy Bequest Program, or a similar program, their phone number is required for verification.\n\nPlease allow enough time to contact them especially during their limited weekend hours.\n\nA death certificate is also acceptable for this purpose but only one of these two options are necessary.\n\nGuestbook and Outside Websites:\n\nWe are not allowed to reference other media sources with a guestbook or an obituary placed elsewhere when placing an obituary in print and online. We may place a website for a funeral home or a family email for contact instead; contact us with any questions regarding this matter.\n\nObituary Process:\n\nOnce your submission is completed, we will fax or email a proof for review prior to publication in the newspaper. This proof includes price and days the notice is scheduled to appear.\n\nPlease review the proof carefully. We must be notified of errors or changes before the notice appears in the Pioneer Press based on each day’s deadlines.\n\nAfter publication, we will not be responsible for errors that may occur after final proofing.\n\nOnline:\n\nChanges to an online obituary can be handled through the obituary desk. Call us with further questions.\n\nPayment Procedure:\n\nPre-payment is required for all obituary notices prior to publication by the deadline specified below in our deadline schedule. Please call 651-228-5263 with your payment information after you have received the proof and approved its contents.\n\nCredit Card: Payment accepted by phone only due to PCI (Payment Card Industry) regulations\n\nEFT: Check by phone. Please provide your routing number and account number.\n\nRates:\n\nThe minimum charge is $162 for the first 12 lines.\n\nEvery line after the first 12 is $12.\n\nIf the ad is under 12 lines it will be charged the minimum rate of $162.\n\nObituaries including more than 40 lines will receive a 7.5% discount per line.\n\nOn a second run date, receive a 20% discount off both the first and second placement.\n\nPlace three obituaries and the third placement will be free of charge.\n\nEach photo published is $125 per day. For example: 2 photos in the paper on 2 days would be 4 photo charges at $500.\n\nDeadlines:\n\nPlease follow deadline times to ensure your obituary is published on the day requested.\n\nHours Deadline (no exceptions) Ad Photos MONDAY – FRIDAY 9:00AM – 5:00 PM Next Day Publication Must receive obituary content and payment same day by 4:30PM Make changes by 5:00PM Must receive photo(s) by 4:30PM SATURDAYS 10:00AM – 2:00PM Sunday Publication Must receive obituary content and payment same day by 1:30PM Make changes by 2:00PM Must receive photo(s) by 1:30PM SUNDAYS CLOSED\n\nMEMORIAM (NON-OBITUARY) REQUEST\n\nUnlike an obituary, Memoriam submissions are remembrances of a loved one who has passed. The rates for a memoriam differ from obituaries.\n\nPlease call or email us for more memoriam information\n\nPlease call 651-228-5280 for more information.\n\nHOURS: Monday – Friday 8:00AM – 5:00PM (CLOSED WEEKENDS and HOLIDAYS)\n\nPlease submit your memoriam ad to memoriams@pioneerpress.com or call 651-228-5280.", "images": ["https://www.twincities.com/wp-content/uploads/2022/04/TwinCitiesPioneerPress_HighRes.jpg", "data:image/webp;base64,UklGRiQAAABXRUJQVlA4IBgAAAAwAQCdASoBAAEAAwA0JaQAA3AA/v3AgAA=", "https://www.twincities.com/wp-content/uploads/2018/02/image_40037873-e15178054866331.jpg?w=1024&h=576"], "top_img": "https://www.twincities.com/wp-content/uploads/2018/02/image_40037873-e15178054866331.jpg?w=1024&h=576", "keywords": [], "authors": ["Dane Mizutani"], "canonical_link": "https://www.twincities.com/2018/02/04/meet-ryan-mckenna-the-kid-that-took-a-selfie-with-justin-timberlake-at-super-bowl-lii/", "title": "Meet Ryan McKenna, the kid who took a selfie with Justin Timberlake at Super Bowl LII", "meta_data": {"application-name": "twincities", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "robots": "max-image-preview:large", "tdm-reservation": 1, "mrf": {"authors": "Dane Mizutani", "canonical": "https://www.twincities.com/2018/02/04/meet-ryan-mckenna-the-kid-that-took-a-selfie-with-justin-timberlake-at-super-bowl-lii/"}, "description": "With megastar Justin Timberlake walking right toward him during the Super Bowl LII halftime show at U.S. Bank Stadium, 13-year-old Ryan McKenna knew he had to take his shot. He quickly stopped the video he was recording and raced to open the camera app on his iPhone. In that moment, little Ryan McKenna went viral.", "generator": "WordPress 6.8.3", "fb": {"pages": 276896490404}, "og": {"type": "article", "title": "Meet Ryan McKenna, the kid who took a selfie with Justin Timberlake at Super Bowl LII", "url": "https://www.twincities.com/2018/02/04/meet-ryan-mckenna-the-kid-that-took-a-selfie-with-justin-timberlake-at-super-bowl-lii/", "description": "With megastar Justin Timberlake walking right toward him during the Super Bowl LII halftime show at U.S. Bank Stadium, the 13-year-old knew he had to take his shot.", "site_name": "Twin Cities", "image": {"identifier": "https://www.twincities.com/wp-content/uploads/2018/02/image_40037873-e15178054866331.jpg?w=1024&h=576", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2018-02-05T02:41:05+00:00", "modified_time": "2018-02-06T04:39:54+00:00"}, "twitter": {"site": "@pioneerpress", "text": {"title": "Meet Ryan McKenna, the kid who took a selfie with Justin Timberlake at Super Bowl LII"}, "image": "https://www.twincities.com/wp-content/uploads/2018/02/image_40037873-e15178054866331.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.twincities.com/wp-content/uploads/2017/06/cropped-faviconwhite-copy.jpg?w=270"}, "movies": [], "publish_date": 1517720400.0, "source": "https://www.twincities.com", "summary": ""}