{"url": "https://people.com/tv/bachelor-and-bachelorette-couples-whos-still-together/", "text": "Here is where every Bachelor Nation couple is today.\n\nMost recently, Bachelor in Paradise season 10 wrapped up in September 2025, culminating in the engagement of Spencer Conley and Jess Edwards .\n\nAs fans know well, a lot can happen once filming ends and contestants return to real life. The franchise's alumni includes Bachelor Nation fairytales, like JoJo Fletcher and Jordan Rodgers and Joey Graziadei and Kelsey Anderson , to couples whose relationships didn't quite stand the test of time, like The Golden Bachelor's Gerry Turner and Theresa Nist , who split after three months of marriage in April 2024.\n\nSince then, Bachelor Nation has expanded to The Bachelorette , as well as spinoffs like Bachelor in Paradise and The Golden Bachelor . But no matter what iteration of the series fans are tuned in for, it typically ends with fairytale proposals and happily ever afters.\n\nMore than 20 years after the first season of The Bachelor premiered on ABC in 2002, the franchise has become the start of countless love stories.\n\n01 of 90 Spencer Conley & Jess Edwards, Bachelor in Paradise Season 10 Disney/Bahareh Ritter Edwards and Conley were the only couple who got engaged on the season finale of Bachelor in Paradise season 10. This meant that they gave up the $250,000 cash prize that was offered to the final four contestants in exchange for leaving the show separately — a first for the franchise — but ultimately, they decided their relationship was more important. “It was an easy decision to choose love,” Edwards told PEOPLE in September 2025. “I think that finding your person, and finding your soulmate and the love of your life is more than money could ever buy.” At the time, they also shared that Edwards would be moving to Dallas to join Conley in early 2026.\n\n02 of 90 Andrew Spencer & Alexe Godin, Bachelor in Paradise Season 10 Disney/Bahareh Ritter Instead of getting engaged on the Bachelor in Paradise season 10 finale, Andrew Spencer asked Alexe Godin to be his girlfriend, and she said yes. The couple has remained together since filming was completed, and on the finale, Godin shared her plans to move to Chicago to be with Spencer.\n\n03 of 90 Dale Moss & Kat Izzo, Bachelor in Paradise Season 10 Disney/Bahareh Ritter Though Dale Moss and Kat Izzo had a rocky end to their season of Bachelor in Paradise, they ultimately left the show as a couple. They didn't get engaged on the show, but they have continued to date.\n\n04 of 90 Jeremy Simon & Bailey Taylor Brown, Bachelor in Paradise Season 10 Jeremy and Bailey on Bachelor in Paradise. Disney/Bahareh Ritter After falling in love on the beach, Jeremy Simon and Bailey Taylor Brown have decided to take their love to the next level. During a September 2025 episode of Bachelor Happy Hour, Brown revealed that she is planning to move in with Simon \"by the end of the year.\" “We’re working towards meeting everyone that really matters and I feel like it’s been really good,\" she said.\n\n05 of 90 Grant Ellis & Juliana Pasquarosa, The Bachelor Season 29 Juliana Pasquarosa and Grant Ellis on 'The Bachelor'. Anne Marie Fox/Disney via Getty Fans watched Grant Ellis and Juliana Pasquarosa get engaged on the March 2025 Bachelor finale, but less than three months later, they decided to go their separate ways. Ellis shared the news in a post on his Instagram Stories in June 2025. “This is one of the harder things I've had to write, but I want to share it honestly. Juliana and I have decided to end our relationship,\" he wrote. “We both gave this our best and poured a lot of love into each other, but after a lot of deep conversations, we've come to the understanding that we're simply not the right fit long term.\" At the time, Pasquarosa shared a statement of her own on Instagram, writing, \"Marriage is a commitment, and it’s one we both still believe in deeply. After a lot of honest conversations and reflection, we’ve come to the decision that this chapter of our lives is meant to continue on separate paths.\"\n\n\n\n06 of 90 Aaron Bryant & Eliza Isichei, Bachelor in Paradise Season 9 ABC/Craig Sjodin Bachelor in Paradise season 9 was a particularly tough season for post-show romance, including Aaron Bryant and Eliza Isichei. Despite the fact that the two left the show engaged, just four days after the season finale aired, Bryant announced on Instagram that he and Isichei had parted ways. “We’re leading out amicable split with nothing but positivity and mutual respect for one another,” he wrote. Our new app is here! Free, fun and full of exclusives. Scan to download now!\n\n07 of 90 John Henry Spurlock & Kat Izzo, Bachelor in Paradise Season 9 Craig Sjodin/abc John Henry Spurlock and Izzo were another couple who broke off their engagement days after the finale of Bachelor in Paradise season 9 aired. Spurlock and Izzo announced their breakup in a post on Instagram that has since been deleted. “With mutual love and respect, Kat and I have recently decided to part ways,” said the post. “Our relationship has been filled with wonderful memories and growth, something we looked forward to sharing with you. While our paths are taking different directions due to our career goals not aligning, we are grateful for the love and support we’ve received from our family, friends, and Bachelor Nation.”\n\n08 of 90 Joan Vassos & Chock Chapple, The Golden Bachelorette Disney/Christopher Willard On the inaugural season of The Golden Bachelorette, Joan Vassos (who left Turner's season of The Golden Bachelor early) fell in love with Chock Chapple, and the couple got engaged on the show's finale. In July 2025, Vassos confirmed that she and Chapple are still together, though they aren't planning their wedding just yet. \"We are in a good place,\" Vassos said during an episode of Bachelor Happy Hour; Golden Hour. \"We don't need to have a wedding certificate to say that we are in a good place.\"\n\n09 of 90 Jenn Tran & Devin Strader, The Bachelorette Season 21 DISNEY/John Fleenor Jenn Tran made history as the first Asian-American Bachelorette, and when she got engaged to Devin Strader on the season 21 finale, it seemed like her happily ever after had finally begun. But by that season's edition of After the Final Rose, their engagement had fallen apart, with Tran admitting that \"things were just different\" after they left Hawaii, where the couple had gotten engaged.\n\n10 of 90 Gerry Turner & Theresa Nist, The Golden Bachelor Gerry Turner and Theresa Nist. Disney/John Fleenor The very first Golden Bachelor was one for the books! Lead Turner fell in love with contestant Nist, a financial services professional and grandmother of six. The two wed on Jan. 4, 2024, in a live special airing on ABC. But three months later during an emotional interview on Good Morning America, they dropped a bombshell: they were divorcing after just three months of marriage. \"Theresa and I have had a number of heart-to-heart conversations, and we've looked closely at our situation, our living situation and so forth, and we've kind of come to the conclusion mutually that it's probably time for us to dissolve our marriage,\" Turner said.\n\n11 of 90 Joey Graziadei & Kelsey Anderson, The Bachelor Season 28 Joey Graziadei and Kelsey Anderson. John Fleenor/Disney During a three-hour finale on March 25, 2024, Graziadei proposed to Anderson after his other finalist, Daisy Kent, walked away by choice. \"I knew early on that there was something different about you, and I just wanted to learn more,\" Graziadei began as he held Anderson's hands during his proposal. \"There is nothing difficult about choosing you, and I can't wait another minute to tell you that I love you.\" Anderson supported Graziadei during his run on Dancing with the Stars season 33, which he won.\n\n12 of 90 Charity Lawson & Dotun Olubeko, The Bachelorette Season 20 Craig Sjodin/abc Another engagement in the books! On the season finale of her Bachelorette season, Charity Lawson said \"yes\" to finalist Dotun Olubeko. “You have been able to make me feel so incredibly special,” Olubeko said to Lawson in his romantic proposal. “You have made me feel adored and validated and wanted. And to receive that from a woman of your caliber, Charity, I don’t think you understand what that means to me. But I’m certain that I want to spend the rest of my life showing you.” The two are still together and are taking wedding planning \"day by day,\" the couple told PEOPLE in March 2025.\n\n\n\n13 of 90 Zach Shallcross & Kaity Biggar, The Bachelor Season 27 Craig Sjodin/ABC via Getty Zach Shallcross popped the question at the end of his run as Bachelor when he proposed to Kaity Biggar during the show's season 27 finale in March 2023. After the show, they lived together in Austin, Texas, where they spent time \"getting to know each other more and more.\" Shallcross and Biggar tied the knot on May 23, 2025.\n\n\n\n14 of 90 Gabby Windey & Erich Schwer, The Bachelorette Season 19 Gabby Windey and Erich Schwer got engaged during the September 2022 finale of The Bachelorette. By early November, however, PEOPLE confirmed the two had gone their separate ways. In August 2023, Windey introduced her new love, comedian Robby Hoffman, whom she wed in January 2025.\n\n15 of 90 Rachel Recchia & Tino Franco, The Bachelorette Season 19 Craig Sjodin/instagram Windey's co-Bachelorette, Rachel Recchia, also got engaged on the finale to Tino Franco, but on After the Final Rose, she revealed he'd cheated on her. \"I slowly was pulling on that string and revealing more and more. It really didn't work out, he cheated on me,\" she told host Jesse Palmer. \"It's just heartbreaking. This is the person I thought I was gonna spend the rest of my life with and start a family with.\"\n\n16 of 90 Clayton Echard & Susie Evans, The Bachelor Season 26 Craig Sjodin/abc Talk about drama! Echard broke up with his final two women — Recchia and Windey — in Iceland and decided to try to pursue a relationship with Susie Evans, who had left after learning he had been intimate with both Recchia and Windey and said \"I love you\" to all three. Following Iceland, Evans reached out to Echard and they got together, he revealed on After the Final Rose. On Sept. 23, 2022, the pair announced their split in a joint Instagram statement.\n\n17 of 90 Brandon Jones & Serene Russell, Bachelor in Paradise Season 8 Craig Sjodin/ABC Brandon Jones and Serene Russell left Bachelor in Paradise Season 8 as an engaged couple, but their love didn't last long after leaving the beach. Less than a year after their season finale aired, the former couple announced that they were going their separate ways in May 2023. \"After many months, today we have ultimately decided to end our engagement,\" they wrote in a joint Instagram post that has since been deleted. \"We have tried to work privately on our relationship which has been incredibly challenging in the public eye. This has been immensely hard to accept and painful, as there is a lot of love between the two of us.\"\n\nRussell is now dating fellow Bachelor Nation member Brendan Morais.\n\n18 of 90 Johnny DePhillipo & Victoria Fuller. Bachelor in Paradise Season 8 Craig Sjodin/ABC via Getty Though Johnny DePhillipo and Victoria Fuller also got engaged on Bachelor in Paradise's season 8 finale, their love story was over by the time the reunion came around. On the reunion, Fuller revealed that she was actually dating fellow Bachelor Nation star Greg Grippo. She stated that she had \"absolutely not\" cheated on DePhillipo, but her ex-fiancé didn't agree. \"I still consider talking to someone else while we're working on our issues cheating or emotional cheating,\" he said on the reunion. Fuller's relationship with Grippo didn't end up going the distance, either; by April 2024, the two had broken up.\n\n19 of 90 Michelle Young & Nayte Olukoya, The Bachelorette Season 18 ABC/Christopher Willard Although Michelle Young and Nayte Olukoya got engaged on the season 18 Bachelorette finale, the couple broke up six months after the finale aired. They ended their relationship amicably, as Young wrote in an Instagram post: \"I will never stop wanting to see you succeed.\" Olukoya added to his Instagram Story, \"Michelle and I will always cheer each other on, but moving forward, we will be cheering from a distance.\" Young married Jack Leius in June 2025.\n\n20 of 90 Joe Amabile & Serena Pitt, Bachelor in Paradise Season 7 Serena Pitt/Instagram \"Grocery Store Joe\" Amabile got his start on Becca Kufrin's season of The Bachelorette, but got eliminated during the first night. But when he returned for Bachelor in Paradise season 5, he found love with his now ex, Kendall Long, whom he dated through January 2020. When Amabile returned again for Paradise season 7, it seemed like all hope was lost. He was about ready to leave the beach — until he sparked a connection with The Bachelor season 25's Serena Pitt. Amabile and Pitt became one of three couples to get engaged on the beaches of Paradise in the summer of 2021. In October of 2022, the pair quietly wed at a New York City courthouse, and had a bigger celebration the following year.\n\n21 of 90 Kenny Braasch & Mari Pepin, Bachelor in Paradise Season 7 Kenny Braasch and Mari Pepin ahead of the two-night season finale of \"Bachelor in Paradise\" at Ka'teen in Hollywood, California. Stewart Cook/ABC via Getty Boy-band manager Kenny Braasch and former Miss Maryland Mari Pepin were attracted to each other right off the bat during Bachelor in Paradise season 7. In the end, Braasch proposed to Pepin. In November 2023, they exchanged vows in front of family and friends in Puerto Rico. In March 2024, they threw a second bash in Chicago.\n\n22 of 90 Riley Christian & Maurissa Gunn, Bachelor in Paradise Season 7 Hatnim Lee/Getty During the season 7 finale, Maurissa Gunn and Riley Christian became the pair became the first Black couple to get engaged in BiP history. Sadly, the couple split in January 2022. In February of that year, Gunn posted on social media that the breakup wasn't easy, though she added, \"But let me tell you today I feel amazing.\"\n\n23 of 90 Noah Erb & Abigail Heringer, Bachelor in Paradise Season 7 Abigail Heringer/Instagram Though it seemed like things were over for Abigail Erb and Noah Heringer after the '80s-themed Paradise Prom, the traveling nurse and financial manager confirmed after the Bachelor in Paradise season 7 finale that they were back together. Heringer and Erb got married on Oct. 7, 2024, sharing their plans to start a family with PEOPLE. \"I say no more than four, five [kids]. We'll see how it goes,\" Heringer said. \"But we're not doing 10!\"\n\n24 of 90 Brendan Morais & Pieper James, Bachelor in Paradise Season 7 Pieper James and Brendan Morais. Craig Sjodin/ABC Morais and Pieper James stirred up controversy when it became clear they came to Paradise with one goal in mind — to date each other. They left the beach together amid pressure from their fellow contestants. By October 2023, the pair had seemingly split. Morais has since begun dating Russell, who got engaged to Jones during the season 8 Bachelor in Paradise finale.\n\n25 of 90 Chris Conran & Alana Milne, Bachelor in Paradise Season 7 Chris Conran and Alana Milne in July 2024. Chris Conran/Instagram Like Morais and James, Conran and Milne created some drama on the beaches of Mexico when rumors circulated that the two had already hit it off before the show started filming. The cast quickly turned on Conran, accusing him of coming on the show with ulterior motives of furthering his connection with Milne and gaining social media followers. Ultimately, Conran and Milne ended up packing their bags and leaving — but not together. The two quickly got back together, however, and moved in together in Salt Lake City. They got engaged in March 2025 while on vacation in Bali, Indonesia.\n\n26 of 90 Katie Thurston & Blake Moynes, The Bachelorette Season 17 Craig Sjodin/ABC She said yes! During the latest dramatic season of The Bachelorette, Moynes made a splash when he joined during episode four and made an instant connection with Thurston. Prior to the show, \"we had talked very casually in DMs,\" Thurston told PEOPLE, but their romance blossomed as they got to know each other better. Moynes popped the question during the season 17 finale. After a few months of dating long-distance, the pair ultimately called it quits on Oct. 25. In a statement confirming their split, they shared that they have \"concluded that we are not compatible as life partners.\" Thurston later wed Jeff Arcuri in March 2025.\n\n27 of 90 Clare Crawley & Dale Moss, The Bachelorette Season 16 Dale Moss and Clare Crawley. Warner bros. \"Congratulations, you've just blown up The Bachelorette,\" Chris Harrison told Claire Crawley when she decided just a few episodes into season 16 to ride off into the sunset with Moss. The pair had an undeniable connection that led to Crawley rejecting the rest of her suitors in favor of getting to know Moss better; an emergency call to jeweler Neil Lane and a heartfelt proposal followed. Just over two months after their big twist, the pair announced they were splitting up. Though they briefly reunited, in September 2021, PEOPLE confirmed that they had split once again. Crawley and Mascot Sports CEO Ryan Dawkins wed in February 2023. Their daughter arrived on Jan. 15, 2024. Moss is now dating Izzo, whom he connected with on Bachelor in Paradise season 10.\n\n28 of 90 Tayshia Adams & Zac Clark, The Bachelorette Season 16 Craig Sjodin/ABC After Crawley's sudden departure, season 16 of The Bachelorette continued with Tayshia Adams stepping in to meet the remaining men. Lo and behold, she found her happy ending, too — at least temporarily. \"If you had told me in March that I'd be getting engaged at the end of the year, I would not have believed it for a second,\" said Adams, who got engaged to addiction recovery specialist Clark on the show's December 2020 finale. \"But I want to experience life with [Zac] by my side. He's what I've always wanted.\" But on Nov. 22, 2021, PEOPLE confirmed the pair had ended their engagement, just weeks after running the New York City Marathon together.\n\n29 of 90 Becca Kufrin & Thomas Jacobs, Bachelor in Paradise Season 7 Becca Kufrin, Thomas Jacobs. Thomas Jacobs/Instagram All is well that ends well! Fan-favorite Kufrin has found her happily ever after, confirming on Oct. 6, 2021, that she and Jacobs were back together after breaking up during the season 7 finale of the hit summer spinoff Bachelor in Paradise. \"You know what they say…Third time's a charm,\" she wrote in an Instagram tribute. \"I'm sorry for breaking up with you on national television, but I'll take every day to make it up to you, Tommy. Thanks for making my heart smile far more than it ever has. Now time to start this real life\" Kufrin first appeared on the franchise on season 22 of The Bachelor, getting engaged to Arie Luyendyk Jr. before they famously split. Stepping into the spotlight as The Bachelorette on season 14, the Minnesota-born publicist got engaged to Garrett Yrigoyen on the show in 2018. Two years later, she announced they had called it off. Jacobs, meanwhile, joined Bachelor Nation on Thurston's The Bachelorette season, before ultimately falling for Kufrin on BiP. On May 29, 2022, the pair announced their engagement and surprised fans with the unconventional proposal — Kufrin proposed to Jacobs! They welcomed a baby boy in September 2023 and married a month later in October.\n\n31 of 90 Becca Kufrin & Garrett Yrigoyen, The Bachelorette Season 14 Raymond Hall/GC Images Kufrin broke tradition when she told PEOPLE she was engaged before the start of her big season — but was able to keep the winner under wraps until the August 2018 finale. In August 2020, after two years together, the pair called it quits. Kufrin confirmed the split on the podcast she cohosts with fellow Bachelorette alum, Rachel Lindsay, Bachelor Happy Hour. She has since married Jacobs and the two share a son together.\n\n32 of 90 Matt James & Rachael Kirkconnell, The Bachelor Season 25 Matt James and Rachael Kirkconnell. Rachael Kirkconnell/instagram The Bachelor season 25 pair were over before their finale ever aired. After James chose not to propose on his finale — based on hesitancy to rush into marriage - past social media posts of Kirkconnell's surfaced that showed her wearing Native American attire as a costume and dressed up at a 2018 antebellum-themed party. Though she apologized, on the After the Final Rose special in March 2021, James explained why the two were no longer together, despite professing love for one another on their finale. \"As Rachael acknowledged in her apology, there's a lot of work that needs to be done. I have to take a step back and allow her to put in that work,\" said James. \"And I'm looking forward to seeing her put in that work.\" However, in late April, he told PEOPLE he and Kirkconnell were working things out, explaining, \"I'm not pursuing any relationships right now outside of that.\" Despite rekindling their romance, James and Kirkconnell announced their breakup in January 2025, four years after they met on the show.\n\n33 of 90 Peter Weber & Madison Prewett, The Bachelor Season 24 ABC/John Fleenor Two days after sharing that they were giving their relationship a shot on After the Final Rose, the pair announced that they were splitting. Peter wrote on Instagram, \"Madi and I have mutually decided to not pursue our relationship any further. Believe me, this was not easy for either of us to be ok with, but after a lot of honest conversations, we have agreed that this is what makes most sense for the two of us. The love and respect I have for Madi will continue to endure.\" She announced her engagement to boyfriend Grant Troutt on July 31, 2022, and they wed that November.\n\n34 of 90 Colton Underwood & Cassie Randolph, The Bachelor Season 23 John Fleenor/ABC After a dramatic conclusion to Colton Underwood's season, he ended up together, though not engaged, to Randolph. By May 2020, the pair announced they were \"just meant to be friends\" in complementary Instagram posts. However, three months later, Randolph filed for a restraining order against Underwood, accusing him of planting a tracking device in her car, showing up to her home unannounced and sending alarming text messages. The court granted her a temporary restraining order until Oct. 6. In April 2021, Underwood publicly came out on Good Morning America. \"I've ran from myself for a long time. I've hated myself for a long time, and I'm gay. And I came to terms with that earlier this year and have been processing it,\" the reality star said. \"The next step in all of this was letting people know. I'm still nervous. It's been a journey, for sure. I'm emotional, but in such a good, happy, positive way.\" He announced his engagement to Jordan C. Brown in February 2022, and in May 2023, they wed.\n\n35 of 90 Arie Luyendyk Jr. & Becca Kufrin, The Bachelor Season 22 Lorenzo Bevilaqua/ABC/Getty Images; Craig Sjodin/ABC At the end of Arie Luyendyk Jr.'s Bachelor journey, viewers were treated to a two-part finale, which included an engagement, a subsequent split and a second engagement over the span of two nights. So, what exactly happened? Shortly after popping the question to Kufrin, Luyendyk Jr. began having doubts and ultimately made the decision to end things with his newly minted fiancée — on camera. As for his reasoning, Luyendyk Jr. admitted he wanted to give a relationship with runner-up Lauren Burnham a chance. On After the Final Rose, Luyendyk Jr. and Burnham reunited, with the Bachelor getting down on one knee — once again — to propose to Burnham. She accepted. In November 2018, Luyendyk Jr. and Burnham announced they were expecting their first child, a girl, and in January 2019, they tied the knot in Hawaii. The couple welcomed daughter Alessi in May 2019, and expanded their family again with boy-girl twins in June 2021, welcoming daughter Senna and son Lux. The couple welcomed their fourth child, daughter Livvy Rowe, in September 2025.\n\n36 of 90 Chris Bukowski & Katie Morton, Bachelor in Paradise Season 6 John Fleenor via Getty The Bachelor in Paradise couple may have left Mexico engaged and ready to start a future together, but their romance was short-lived. At the September 2019 reunion, Morton told Chris Harrison that she was struggling with their relationship and had chosen to stop wearing her engagement ring. The pair reconciled in September and Morton put her ring back on, but in December 2019, both stars confirmed they'd decided to split. \"We've reached a point in our story where we agree it's best to go our separate ways,\" each wrote on Instagram. \"We have chosen to love and respect each other as friends.\" He moved on with fellow Bachelor Nation alum Anna Redman in 2022.\n\n37 of 90 Hannah Godwin & Dylan Barbour, Bachelor in Paradise Season 6 John Fleenor via Getty This love triangle is officially just a line. After struggling to decide between Dylan Barbour and Blake Horstmann for much of the season, Hannah Godwin finally chose Barbour and they left Bachelor in Paradise engaged. After several years together, the pair walked down the aisle in August of 2023.\n\n38 of 90 Tayshia Adams & John Paul Jones, Bachelor in Paradise Season 6 John Paul Jones and Tayshia Adams. Craig Sjodin/ABC/Getty (2) After a dramatic stint on Bachelor in Paradise ended with the pair going their separate ways, Adams made the bold move to show up on John Paul Jones' doorstep after the show ended to ask for a second chance. She had originally broken up with Jones after he told her that he loved her. In September 2019, the pair confirmed their relationship status, but by Oct. 31, the pair had split. \"We truly did the best we could, but at this time have decided that what is best for the both of us is to go our separate ways,\" Adams wrote in a since-deleted Instagram post. \"We are the best of friends and will continue to remain in each other's life because regardless of the situation, we make each other happy💕💕.\"\n\n39 of 90 Caelynn Miller-Keyes & Dean Unglert, Bachelor in Paradise Season 6 Jon Kopaloff/Getty Images Dean Unglert had initially left Paradise without Caelynn Miller-Keyes, but returned to beg her for a second chance. Though she was skeptical, she took a leap of faith, and the pair are still together. In October 2022, they got engaged. The pair wed in the summer of 2023.\n\n40 of 90 Demi Burnett & Kristian Haggerty, Bachelor in Paradise Season 6 Demi Burnett and Kristian Haggerty. John Fleenor via Getty The women made history as the first same-sex couple on the franchise when Kristian Haggerty entered Bachelor in Paradise in pursuit of her ex, Demi Burnett. Burnett proposed to Haggerty on the beaches of Paradise in the September 2019 finale, and Haggerty returned the favor by popping the question on the reunion show. Sadly, they split in October 2019. The pair each shared photos from their relationship to their respective Instagram accounts, accompanied by the same lengthy caption. In part, it read, \"What has always been at the forefront of our relationship is love and care for one another ...With a heavy heart full of love for one another we have decided it is best for us to take a step back from our relationship ... We will forever be proud of the impact our love story has made.\"\n\n41 of 90 Rachel Lindsay & Bryan Abasolo, The Bachelorette Season 13 Rachel Lindsay found love with Miami native Bryan Abasolo. At the time, though, Abasolo's windy proposal was nearly overshadowed by her heart-wrenching breakup with runner-up Peter Kraus. Lindsay herself, however, shut down any accusations that she chose the wrong man: \"At the end, it was not tough for me,\" she told PEOPLE. \"Going through it, I felt Bryan was perfect for me. Obviously nobody's perfect - but perfect for me.\" In August 2019, after a two-year engagement, the pair wed in an \"island chic\" wedding in Mexico and spent their honeymoon relaxing in Greece. More than four years later, Abasolo filed for divorce. Their divorce was finalized in January 2025.\n\n42 of 90 JoJo Fletcher & Jordan Rodgers, The Bachelorette Season 12 Ray Tamarra/GC Images It seems that on The Bachelorette, the women know their heart early on. In season 12, Fletcher gave Rodgers the first impression rose, and throughout the season, they had crazy, off-the-charts chemistry. So when Fletcher sent her runner-up Robby Hayes home, no one was surprised — and people were even less shocked when Rodgers got down on one knee. Rodgers did surprise Fletcher with another proposal in August 2019 — three years after they got engaged on The Bachelorette. The pair planned to wed in June 2020, but bumped their big day to May 2021 due to the COVID-19 pandemic. Fletcher later said they were delaying the nuptials again amid the ongoing outbreak, but the pair wed on May 14, 2022, six years after their engagement on The Bachelorette season 12 finale. The couple announced they're expecting their first baby in August 2025.\n\n43 of 90 Chris Randone & Krystal Nielson, Bachelor in Paradise Season 5 Chris Randone/Instagram Chris Randone and Krystal Nielson were the villains of their seasons. However, they got their own happy endings when they found love in Paradise, leaving their season engaged. The pair were married in July 2019 in a wedding officiated by Chris Harrison, which aired on season 6 of Bachelor in Paradise. However, Paradise was lost when the couple announced their split on Valentine's Day 2020. \"It hurts to announce that at this moment, we have mutually decided to separate. Never did we imagine this scenario, but we've come to a point where we both need to work on ourselves,\" they said in a statement to Bachelor Nation. She announced her engagement to Miles Bowles in 2022, and they got married the following year. In August 2025, Randone proposed to Sophie Gunter.\n\n46 of 90 Jordan Kimball & Jenna Cooper, Bachelor in Paradise Season 5 Jordan Kimball and Jenna Cooper. Paul Hebert via Getty (2) Though Jordan Kimball and Jenna Cooper left Bachelor in Paradise season 5 planning to walk down the aisle, their happily ever after was over just one day after their proposal aired. Kimball called off their engagement following allegations that Cooper had been seeing another man while they were together in September 2018. (She continues to deny the allegations.) Today, Kimball is married to Christina Creedon and the couple shares two children. Cooper is now married to Karl Hudson, and they also share two children.\n\n47 of 90 Nick Viall & Vanessa Grimaldi, The Bachelor Season 21 Nick Viall/Instagram The Bachelorette and Bachelor in Paradise mainstay seemed to have found love with fan-favorite Vanessa Grimaldi, a special education teacher from Montreal. Following a whirlwind courtship, the couple called it quits after five months together, in August 2017. In January 2023, Viall announced he was engaged to longtime girlfriend Natalie Joy, and they welcomed their first child in February 2024. They wed in April 2024. Grimaldi married boyfriend Josh Wolfe in August 2021.\n\n49 of 90 Derek Peth & Taylor Nolan, Bachelor in Paradise Season 4 Derek Peth and Taylor Nolan attend SUGARCANE bar grill opening in 2017. Owen Hoffmann/Patrick McMullan via Getty Derek Peth and Taylor Nolan were the only couple to leave Bachelor in Paradise season 4 engaged, but their love story didn't last long. Less than a year later, the former couple confirmed to PEOPLE that they'd called off their engagement in June 2018. “We put everything we could into our relationship and are heartbroken to go forward separately, but we know this is the best decision for the both of us,\" Nolan and Peth said in a statement. \"We will still be present in each other’s lives with support, admiration and respect for each other.”\n\n50 of 90 Amanda Stanton & Josh Murray, Bachelor in Paradise Season 3 ABC/Rick Rowell He proposed to Andi Dorfman during his previous stint on The Bachelor franchise, and Josh Murray walked away from the 2016 season of Paradise with yet another new love. After the finale, he moved to southern California to be with Amanda Stanton and her daughters. Unfortunately, the engagement didn't last — they announced their split in January 2017. Stanton married boyfriend Michael Fogel in the summer of 2022.\n\n51 of 90 Lace Morris & Grant Kemp, Bachelor in Paradise Season 3 Rick Rowell/ABC Two months after the 2016 Bachelor in Paradise finale, Lace Morris and Grant Kemp were living together in San Francisco and looking forward to planning their wedding. Yet, in November 2016, the couple split. Kemp announced his engagement to Chloe Metcalfe in 2022.\n\n52 of 90 Carly Waddell & Evan Bass, Bachelor in Paradise Season 3 Rick Rowell/ABC Despite a rocky beginning to their relationship, Carly Waddell fell head over heels for Evan Bass. The couple tied the knot in June, announced they were expecting their first child together in August and welcomed their baby girl in February 2018. In November 2019, the pair welcomed their second child into the world, a baby boy named Charles Wolfe. Sadly, in December 2020, they announced they were going their separate ways. \"We have made the difficult decision to separate,\" the former couple said in a joint statement. \"We will always cherish our time together and continue to have the utmost respect for one another as we focus on what's best for the future of our family. We greatly appreciate everyone's love and support and kindly ask that you please respect our family's privacy as we navigate through this.\n\n53 of 90 Ben Higgins & Lauren Bushnell, The Bachelor Season 20 Source: Lauren Bushnell/Instagram She may not have received the first impression rose, but there was always something special between Ben Higgins and Lauren Bushnell. Months after his proposal, they were still going strong: Bushnell moved to Higgins' home city of Denver, and they starred in their own reality show, Ben & Lauren: Happily Ever After. However, unresolved feelings about their time on the show always weighed on them - even sending them to couples' counseling - and in May 2017, they announced their split to PEOPLE. Both have since moved on; Higgins wed Jessica Clarke in November 2021, while Bushnell wed Chris Lane in October 2019.\n\n54 of 90 Kaitlyn Bristowe & Shawn Booth, The Bachelorette Season 11 Rick Rowell/ABC When Shawn Booth stepped out of the limo, it was clear that he only had eyes for Kaitlyn Bristowe — and she felt the same. The infatuation only grew from there: Booth proposed during the finale, she accepted, and after the show was over, they subsequently moved in together in Nashville. But the pair announced their split in a November 2018 statement to PEOPLE after months of speculation that they were on the rocks. \"After three incredible years, we have decided to go our separate ways,\" they wrote. \"This difficult decision comes after thoughtful, respectful consideration. Even though we are parting as a couple, we're very much committed to remaining friends.\"\n\n55 of 90 Britt Nilsson & Brady Toops, The Bachelorette Season 11 Britt Nilsson and Brady Toops. Rick Rowell/ABC For the first time in franchise history, suitors had the chance to choose between two women for the title of Bachelorette. The men ended up choosing Bristowe over Britt Nilsson, but that wasn't the end of Nilsson's journey. Brady Toops, a singer-songwriter from Nashville, decided to leave the show in order to pursue Nilsson. Their romance was documented briefly on Bristowe's season and though the couple remained together once filming wrapped, they ultimately split in the spring of 2015. In September 2017, Nilsson married her boyfriend of two years, Jeremy Byrne. On June 23, 2020, the couple welcomed their first child, a baby girl named Noa Ellis Joy, followed by daughter Alya Karolina Grace in July 2022.\n\n56 of 90 Chris Soules & Whitney Bischoff, The Bachelor Season 19 Chris Soules and Whitney Bischoff attend the screening of \"WINNING: The Racing Life Of Paul Newman\" on April 16, 2015 in Hollywood, California. Paul Archuleta/FilmMagic Though he admitted that he was on the way to falling in love with runner-up Becca Tilley, Chris Soules ended up proposing to fertility nurse Whitney Bischoff in the finale. Nearly seven months after Soules got down on one knee, the couple announced their split in a joint statement: \"They part with nothing but respect and admiration for one another and will continue to be supportive friends.\"\n\n57 of 90 Andi Dorfman & Josh Murray, The Bachelorette Season 10 Javier Pesquera/ABC/Getty While she initially leaned toward Viall, Dorfman chose Josh Murray and their season ended in a proposal. The couple split in January 2015, despite seeming happy and in love just days prior. Dorfman went on to marry Blaine Hart in Italy in 2023.\n\n58 of 90 Juan Pablo Galavis & Nikki Ferrell, The Bachelor Season 18 Rick Rowell/ABC After a tumultuous season, Juan Pablo Galavis gave Nikki Ferrell the final rose. There was no proposal, however, as the father of one couldn't even say, \"I love you.\" The couple appeared on season 5 of Couples Therapy, but it couldn't save their relationship — they split in October 2014.\n\n59 of 90 Desiree Hartsock & Chris Siegfried, The Bachelorette Season 9 Francisco Roman/ABC Desiree Hartsock's road to the altar as the ninth Bachelorette wasn't smooth, but she eventually chose Chris Siegfried after having her heart broken by Brooks Forrester. The season ended in a proposal, and the couple married in January 2015. They have three sons: Asher, Zander and Noah.\n\n60 of 90 Sean Lowe & Catherine Giudici, The Bachelor Season 17 Todd Wawrychuk/ABC/Getty After finishing third in Emily Maynard's season, Sean Lowe became the 17th Bachelor and proposed to Catherine Giuidici in the finale, promising, \"I want to spend the rest of my life telling you that I love you and making you feel like the most special, beautiful woman in the world.\" Their nuptials were televised on ABC in January 2014. More reasons to celebrate? They welcomed their first child, son Samuel Thomas, in July 2016, and their second, son Isaiah, in May 2018. Daughter Mia joined the family in December 2019.\n\n61 of 90 Ben Flajnik & Courtney Robertson, The Bachelor Season 16 NICK RAY/ABC While Ben Flajnik's season of The Bachelor ended with a proposal, he and Courtney Robertson broke up during the airing of season 16. They got back together, as they revealed on their After the Final Rose special, but broke up for good in October 2012.\n\n62 of 90 Emily Maynard & Jef Holm, The Bachelorette Season 8 Rick Rowell/ABC/Getty Maynard chose Jef Holm in the eighth season of The Bachelorette, and he popped the question in response. Their relationship was short-lived, however — they split after two months, in October 2012. Maynard got engaged to automotive management consultant Tyler Johnson in January 2014; they married that June and have since welcomed four young sons and a daughter. (Maynard also has a daughter, Ricki, from previous relationship.)\n\n63 of 90 Brad Womack & Emily Maynard, The Bachelor Season 15 MARK WESSELS/ABC Brad Womack wasn't the only one going after a second chance at love in season 15. After leaving season 11 of The Bachelor without a bride-to-be, Womack's season 15 ended in a proposal to Maynard, who had jumped back into the dating pool after her fiancé died in a plane crash years earlier. Womack and Maynard broke up while their season was airing, reunited after the finale, then announced their amicable split to PEOPLE in June 2011.\n\n64 of 90 Ashley Hebert & J.P. Rosenbaum, The Bachelorette Season 7 Adam Taylor/ABC via Getty Sadly, another beloved Bachelorette couple went their separate ways. On Oct. 14, 2020, Ashley Hebert and J.P. Rosenbaum announced that they would be splitting up after nearly eight years of marriage, with Rosenbaum officially filing in July 2021. \"It is with a heavy heart that I share with you that, after months of separation, Jp and I have amicably decided to go our separate ways,\" Hebert wrote alongside a photo of the couple dancing. Hebert was the seventh Bachelorette, and her season ended in a proposal from Rosenbaum. They married in December 2012, and their nuptials aired on ABC. In September 2014, Hebert gave birth to their son, Fordham Rhys. In November 2016, they welcomed their second child, daughter Essex.\n\n66 of 90 Tanner Tolbert & Jade Roper, Bachelor in Paradise Season 2 Tanner Tolbert and Jade Roper attend Premiere of Holiday Touchdown: A Chiefs Love Story on November 30, 2024 in Kansas City, Missouri. Jason Davis/Getty There were a lot of ups and downs on the second season of Bachelor in Paradise, but one thing remained consistent throughout: Jade Roper and Tanner Tolbert's romance. They ended things with a proposal and had a televised Bachelor wedding in early 2016. They welcomed daughter Emmy in August 2017, and welcomed their second child, a boy, in July 2019, and their third child, son Reed, was born in 2020.\n\n67 of 90 Holly Durst & Blake Julian, Bachelor in Paradise Season 2 Courtesy Holly Julian Though Holly Durst voted Blake Julian off on the second season of Bachelor Pad, she handed him a note at the rose ceremony telling him that it wasn't the end for them. Indeed, it wasn't — the pair got engaged in September 2011 and married in June 2012. In 2019, they welcomed a daughter via adoption.\n\n68 of 90 Ali Fedotowksy & Roberto Martinez, The Bachelorette Season 6 Matt Klitshcer/ABC/Getty The sixth Bachelorette, Ali Fedotowsky chose Roberto Martinez in the finale. He proposed, but they split in November 2011. Fedotowsky told PEOPLE, \"We both realized we were unhappy more than we were happy.\" Fedotowsky went on to marry TV host Kevin Manno, with whom she has two children.\n\n69 of 90 Marcus Grodd & Lacy Faddoul, Bachelor in Paradise Season 1 Francisco Roman/ABC/Getty Marcus Grodd and Lacy Faddoul met during the first season of Bachelor in Paradise, and the two hit it off almost immediately. At the final rose ceremony, Grodd proposed, and the couple wed in August — or so viewers thought. Grodd revealed to PEOPLE that his and Faddoul's nuptials were never legal and that \"she became a different person.\"\n\n70 of 90 Cody Sattler & Michelle Money, Bachelor in Paradise Season 1 Francisco Roman/ABC/Getty Though they left the first season of Bachelor in Paradise as a couple, Cody Sattler and Michelle Money amicably split in December 2014, before rekindling the relationship and working through their relationship issues on Marriage Booty Camp: Reality Stars in 2016. They split again soon after. In January 2023, Money announced her engagement to golfer Mike Weir, and married him that same year.\n\n71 of 90 Kiptyn Locke & Tenley Molzahn, Bachelor in Paradise Season 1 Greg Zabilski/ABC/Getty Runners-up Kiptyn Locke and Tenley Molzahn didn't manage to take home the top prize, but they did walk away as a couple. They broke up in March 2013 after a two-and-a-half-year relationship, but reunited in February 2014. However in March 2015, Locke announced he was expecting his first child, a son — with his new girlfriend, Samm Murphy.\n\n72 of 90 Jake Pavelka & Vienna Girardi, The Bachelor Season 14 MARK BRENDEL/ABC Pilot Jake Pavelka proposed to Vienna Girardi during his reign as The Bachelor, but the couple split just a few short months following the finale.\n\n73 of 90 Jillian Harris & Ed Swiderski, The Bachelorette Season 5 MARIO PEREZ/ABC The fifth Bachelorette, Jillian Harris chose Ed Swiderski and her season ended in a proposal. But the couple split sometime in 2010, after rumors swirled that he'd dated two other women during his time on the show. Harris is now married to Justin Pasutto, with whom she has two children.\n\n74 of 90 Jason Mesnick & Melissa Rycroft, The Bachelor Season 13 MATT KLITSCHER/ABC Jason Mesnick proposed to Melissa Rycroft, but ended up reversing his decision on one of the most wild After the Final Rose specials ever. There, he broke up with Rycroft and asked runner-up Molly Malaney for a second chance; she accepted, and the couple tied the knot in February 2010 and now have a daughter together. Meanwhile, Rycroft has three children with Tye Strickland, whom she married in 2009.\n\n75 of 90 Matt Grant & Shayne Lamas, The Bachelor Season 12 ADAM LARKEY/ABC On The Bachelor: London Calling, Matt Grant proposed to Shayne Lamas, but the two called it off not long after their televised engagement.\n\n76 of 90 Deanna Pappas & Jesse Csincsak, The Bachelorette Season 4 ADAM LARKEY/ABC After being sent home by Womack, Deanna Pappas became The Bachelorette and chose snowboarder Jesse Csincsak to get down on one knee. Despite setting a wedding date — May 9, 2009 — the couple parted ways in November 2008. Pappas still found love within the Bachelor franchise, however; she went on to marry Stephen Stagliano - the twin brother of Michael Stagliano, who appeared on Jillian Harris's season of The Bachelorette - in October 2011. They welcomed their first child in February 2014 and a second two years later, however, they announced they were divorcing in January 2023 after 11 years of marriage. In August 2010, Csincsak married Ann Lueders, who appeared on Mesnick's season of The Bachelor. They, too, welcomed a daughter in 2014, and have since had two more children.\n\n77 of 90 Brad Womack, The Bachelor Season 11 CRAIG SJODIN/ABC/Getty Though he chose both Pappas and Jenni Croft as finalists, Womack ended up rejecting both in the season finale.\n\n78 of 90 Andy Baldwin & Tessa Horst, The Bachelor Season 10 Craig Sjodin/ABC/Getty Andy Baldwin proposed to Tessa Horst on the finale of The Bachelor: Officer and a Gentleman, but the two ended their engagement one month later. They continued their relationship for a little while longer, but she went on to break up with him less than one year later.\n\n79 of 90 Lorenzo Borghese & Jennifer Wilson, The Bachelor Season 9 CRAIG SJODIN/ABC In one of the few seasons not to end in a proposal, Lorenzo Borghese (a prince!) chose to pursue a relationship with Jennifer Wilson on the finale of The Bachelor: Rome and offered her a promise ring. Spoiler: They broke up one month later.\n\n80 of 90 Travis Lane Stork & Sarah Stone, The Bachelor Season 8 CRAIG SJODIN/ABC Dr. Stork and schoolteacher Sarah Stone barely made it to the airing of the pre-taped finale; he never proposed, and the couple announced their breakup once the season finished airing.\n\n81 of 90 Jen Schefft & Jerry Ferris, The Bachelorette Season 3 BOB D'AMICO/ABC Jen Schefft chose Jerry Ferris over John Paul Merritt in her season of The Bachelorette, but ultimately rejected him when he proposed.\n\n82 of 90 Charlie O'Connell & Sarah Brice, The Bachelor Season 7 Craig Sjodin/ABC/Getty Brother to Jerry O'Connell, Charlie O'Connell chose not to propose to finalist Sarah Brice but pursued a relationship with her regardless. They dated from 2005 to 2007, and though they reunited once, they ended it for good in 2010.\n\n83 of 90 Meredith Phillips & Ian McKee, The Bachelorette Season 2 CRAIG SJODIN/ABC Meredith Phillips chose Ian McKee in her season of The Bachelorette and he proposed, but the couple broke up less than one year after the finale.\n\n84 of 90 Byron Velvick & Mary Delgado, The Bachelor Season 6 CRAIG SJODIN/ABC Byron Velvick proposed to Mary Delgado and the two were together for five years before splitting in December 2009.\n\n85 of 90 Jesse Palmer & Jessica Bowlin, The Bachelor Season 5 Michael Hickey/WireImage Just one month after proposing, Jesse Palmer and Jessica Bowlin ended their relationship, blaming long distance. Now, he's the host of the franchise, and quietly wed love Emely Fardo in June of 2020.\n\n86 of 90 Trista Rehn & Ryan Sutter, The Bachelorette Season 1 Dala Yitzhak/ABC/Getty One of the franchise's biggest success stories, Trista Rehn and Ryan Sutter tied the knot in a televised ceremony in December 2003. The couple has two children together — a boy named Maxwell and a girl named Blakesley.\n\n87 of 90 Bob Guiney & Estella Gardinier, The Bachelor Season 4 Craig Sjodin/ABC/Getty Bachelor Bob Guiney did not propose to Estella Gardinier during his reign, though she did accept a promise ring. The two split five months later but remain friendly to this day.\n\n88 of 90 Andrew Firestone & Jen Schefft, The Bachelor Season 3 Mitch Haaseth/ABC/Getty Andrew Firestone proposed to Schefft, and the two were together for 10 months before parting ways amicably in December 2003. But don't worry about them: both have their own happy, non-Bachelor families.\n\n89 of 90 Aaron Buerge & Helene Eksterowicz, The Bachelor Season 2 Craig Sjodin/ABC/Getty Helene Eksterowicz was dumped by Bachelor Aaron Buerge just five weeks after he presented her with a 2-carat engagement ring. In February 2004, the couple teamed up to hawk the giant rock.", "images": ["https://people.com/thmb/A6Qy9voU2qoFMOYpF9VOYUMhnZA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/jake-pavelka-660-2-2e50dec8c6374c2dbc5dfd3ca8916c99.jpg", "https://people.com/thmb/eTQ1fVsvOtfLqCEQ4tULqIEukKU=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/Golden-Bachelor-Gerry-Turner-and-Theresa-Nist-Seen-Together-for-the-First-Time-Since-Divorce-111325-925470e2cc544b48a6bab2a718fb8910.jpg", "https://people.com/thmb/LztNjwaQ-ix4eK4edUooLhNiWi4=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/anna-kepner-3-111025-c6a90b2f57474459a89ae04e296ec343.jpg", "https://people.com/thmb/wxTgEh8QE5v_dHcyzjANGEBCahQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(649x0:651x2)/kaitlyn-bristowe-7be79739c4a84cf8ae9cfd16af85084f.jpg", "https://people.com/thmb/6Xgv9s-0uP8VcpbwZup9bVsD5hM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(728x255:730x257)/demi-burnett-kristian-haggerty-100225-3edfde1235434485b1fd48903ed435b4.jpg", "https://people.com/thmb/IfeAJ4ki4OAo6yJUJgzoqd0mxsQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/jillian-harris-435-3-1d75445e3e9a4b48b0a3d7862e6a1a56.jpg", "https://people.com/thmb/VKPkUSR0RmYCCgZ3Z12u3XeW-Es=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/KAT-DALE-BACHELOR-IN-PARADISE-072125-a095100ccf454ecf97a9179425398b85.jpg", "https://people.com/thmb/ZEh8lGL0Zh2ZXN1Og_qb3fuH1MA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/bachelorette-finale-65-13052022-6d6afda377824936a2ad99a4f0d0b9e2.jpg", "https://people.com/thmb/_E0Y59p5dqBQ2gryy42VeKGAxIA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/marcus-grodd-660-afa3d8f70249486d8a4e45e1b4adc281.jpg", "https://people.com/thmb/Jr12g3qPK7r6Izw7edyINYUR3VE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/debbie-mel-owens-golden-bachelor-103025-1-b04871314ddd40a3a2d1c726f22e409d.jpg", "https://people.com/thmb/IH4Q2Vtwqnexfdeczb6XUVETqL0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/aaron-buerge-435-322cf2e13e9d4cc2bad833fcebfbf6ff.jpg", "https://people.com/thmb/BNE3dNCab68YFaOsbFlgJ0mKhUw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/vanderpump-rules-season-12-cast-110325-59238eb623564588a447f0a599d028f3.jpg", "https://people.com/thmb/nDDLRccAHRbnl-TN5skuMXoMI8M=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/andy-baldwin-435-642948e2f39949db8546ff89f35d43d4.jpg", "https://people.com/thmb/rP8iYwWG1O7rDqv0hyYxC1RaxVM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/jen-schefft-435-3-bddd88a77a4c428b9b5a0c0ca2031128.jpg", "https://people.com/thmb/8P6_w6Ju9sFID9NlSY6E0Bt25NQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(748x0:750x2)/gettyimages-8279226301-9702279f2deb4a01a9c2fc3b4fd322c1.jpg", "https://people.com/thmb/ThNu_ybYM6KX3wMGIC85dnzS1FA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/bachelor-in-paradise-080425-8dfc4f3b954f4c9eb371ebf056bdf56a.jpg", "https://people.com/thmb/TFV52tDDXpRWZX6ARxR6ToNc-QY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/bachelor-couples-still-together-4-86462fa8cb1f43418fb629c13f67ca28.jpg", "https://people.com/thmb/3fJsqqRaefRiKCMV-cB2p7F2qEA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/bachelore_bachelorette-2000-8fb12d99efb44ab5ab3ffc1fbd2eead6.jpg", "https://people.com/thmb/1Hfd2nR1CMZ3zmbP02AR5fEUHqk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(6738x5624:6740x5626)/clare-crawley-dale-moss-63a1cfc3637c42ed81fe4512b7c6f0a3.jpg", "https://people.com/thmb/8CApOpVhMQpDkji46NZ2Rfx7MOQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/152211_4418-2000-43a8a65e8d1442359a22b77ee41b7fbe.jpg", "https://people.com/thmb/VcW6w7-CGFw9YXYR1f7_A7ic_s4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(702x0:704x2)/bachelor-couples-still-together-1-ce722536d82a4c2881f85626d8123d7c.jpg", "https://people.com/thmb/WCmKtLmvwsPymOocevRWfp-oaPI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/joan-vassos-chock-060525-1070a234402c4f429b4542a8499eb0cc.jpg", "https://people.com/thmb/faFZ8efEG2-Hr02dGQnhCwUme54=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(699x0:701x2)/katie-thurston-2-d2e905602d24499e8a0cd29f0b0dd18f.jpg", "https://people.com/thmb/7yESkfhoL1Q450pDMwrlhqrZjxg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/bachelor-in-paradise-1-68dd6238c89d412eaf38e7899db4f932.jpg", "https://people.com/thmb/P-xCv_ytK6oDB0zfzJYAVoWX9m4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/gabby-erich-bachelorette-0920-efe882f770d648c693e86842b5eed9d3.jpg", "https://people.com/thmb/ZqtqLyHphJ0kvqeC6nRWyRXESRk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(399x0:401x2)/carly-evan-800-2-a9a1f48f5ab448e2948adfd2b61f8908.jpg", "https://people.com/thmb/UvuX4BdhLBvM4ImnXqc0oSeO2ZQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(501x229:503x231)/kenny-braasch-mari-pepin-100225-7c2355b0319946db8b2dcee6b6b61f72.jpg", "https://people.com/thmb/ZHyJXU3WxDIQoxTkSHP0vv8BYdM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(469x87:471x89)/noah-erb-abigail-heringer-5f6cfe6f8ed1489dbb11ac1e6306b347.jpg", "https://people.com/thmb/HYjgtDN3UkDma5A_cWe5CJV3CMg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/couple-1-881823819f7e4733b8a422bdbdf93b9f.jpg", "https://people.com/thmb/Zk2utxQk5aHzIQja9d-XnBghkjw=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/travis-stork-435-a2ff55e957ef4072a0fb6437d015ed9e.jpg", "https://people.com/thmb/gVYQMcVGW92nO5fgcYOAk_TmkMI=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/Mel-Owens-Golden-Bachelor-042225-0fc58b6db15f472fae1aa1127f5ab357.jpg", "https://people.com/thmb/GfeEXkE2XAscnDcsdqvnlsMBpAE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Golden-Bachelor-Gerry-Turner-and-Theresa-Nist-Seen-Together-for-the-First-Time-Since-Divorce-111325-925470e2cc544b48a6bab2a718fb8910.jpg", "https://people.com/thmb/brdlVViMWyLkCAOfQpxh_68-h2I=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/golden-bachelor-mel-owens-peg-cindy-110525-d30d64f4a9fc4cbfadc7775eff01d183.jpg", "https://people.com/thmb/nwV3LfoiFBgmE50J6yTpSF13PKk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/emily-maynard-435-6-8e61098f3d4641ee92b02a34e8cbaa64.jpg", "https://people.com/thmb/NaK08IG6z4p2bQT8QSURKFi1vaE=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x269:751x271)/Bachelor-in-Paradise-Brandon-and-Serene-04-112222-d05f91d7184f499c86cc406de1a671b4.jpg", "https://people.com/thmb/n19FUw5CuT-Rgt8-b2vfqo_gpyI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/jojo-jordan-435-a825a31feb2f4de3a42ccaee5ab0437e.jpg", "https://people.com/thmb/62ONV8zfTvlwrS-J2F67J-M5mbE=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/meredith-phillips-435-1-ba1aa98dcf2f420380f8ca049d09783f.jpg", "https://people.com/thmb/iP3imV3mt0zlNsm1M8OTFoUtWyQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/dean-and-caelynn-tout-5dee1f4403ee4d11a73ba7d34ab3bad5.jpg", "https://people.com/thmb/e_ZdGGZnTtVTv3cB-OcoxUTwTAs=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Matt-James-and-Rachael-Kirkconnell-e81a195e31bd4e6192ac7446c5f56259.jpg", "https://people.com/thmb/uKKi1M7GmKHA0aVJSOC2qklFapE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/mel-owens-peg-munson-golden-bachelor-111325-42efe59dada446d9bd1f718573f4151c.jpg", "https://people.com/thmb/dL6ijleC8r4-tdRrGdvJ3NOekO4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/alex-michel-435-7baa7295f08c4e42a7878f163215f33b.jpg", "https://people.com/thmb/9Q2OU1KKDKNuJZd01sEQ5wloQPY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/golden-bachelor-mel-owens-cindy-peg-111225-0d1d70338cb2406bae2f9deee6f62c03.jpg", "https://people.com/thmb/BB7vYW82d0oBPiFINmr76DIy2dY=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/ben-dreyfuss-richard-dreyfuss-111925-b670f8ab6f994d1d9dfce1fa0726d205.jpg", "https://people.com/thmb/cI6vrhCj9qevFLs-4kbreAUzFy8=/168x168/filters:no_upscale():max_bytes(150000):strip_icc()/People_Onsite_ATF_Overlay_DesktopVersion_070125_qr_code11-6a9808bc1dfa4c2a9603155d7a5343d3.png", "https://people.com/thmb/x527hSwInHID7cTUh6cWUgd4Gqo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/bachelor-in-paradise4-9125-de8c8765537547e4859158e7d97c10aa.jpg", "https://people.com/thmb/GYvW1drQEYRRQRRtnWPTIAb_NsI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/the-bachelor-1-2-1-5c72e3b25fba42ef9933c8a9e6e9fdf9.jpg", "https://people.com/thmb/F_HEZ-07vBS8_oaMqS3zgJbDqEM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/jason-mesnick-1-435-c4bafbeaac004c88b6294c1579ee18c0.jpg", "https://people.com/thmb/q6SAm1N33gYRGC_U-qgs3_FVvWI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(431x359:433x361)/serena-pitt-joe-amabile-8473b6d0626248f68d0f01d9707f6030.jpg", "https://people.com/thmb/94nVrIKCwFMOj4ja_S9K5fLDvJ4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(539x369:541x371)/maurissa-gunn-riley-christian-b8f56895a12c4c4a8aed53082a50e3ce.jpg", "https://people.com/thmb/mEUmbRy6I7UVcEC1EN6BiQ4e7Is=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/lorenzo-borghese-1-435-15c27fa5bb274a02a9d02dda78d4912e.jpg", "https://people.com/thmb/niBqAkZ9-eD49ptbpHzZ9p5q5KE=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/charlie-oconnell-435-1-f95cb3a51f354b0fb3b3ab9b7d41e1e6.jpg", "https://people.com/thmb/eJfPxLH_oXAYIfFC-ZsMzgNF61c=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(246x0:248x2)/holly-durst-495-57f58cc8884e4c68b28ac89d9fd51517.jpg", "https://people.com/thmb/QtlNHDMs8LyvPtP0A4NVlL4lx-4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/Derek-Peth-Taylor-Nolan-050625-d4dd0c44af114b2698553116371a0eb8.jpg", "https://people.com/thmb/YjVJ_APv3yBQMjgO7tyd4o47P3Y=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Mel-Owens-Golden-Bachelor-042225-0fc58b6db15f472fae1aa1127f5ab357.jpg", "https://people.com/thmb/zdFS1n2y9dNM-ndOtRjWY9G0kI4=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/Daniella-Karagach-111925-ls-1ffa54ba0f1749e380cfe98771660e16.jpg", "https://people.com/thmb/RZlr9YHoMi-jqQuTk7IRay0SNTc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Gerry-Turner-and-his-finalists-Theresa-Nist-and-Leslie-Fhima11302369-46c30e6d82a74a8da96790e0b47a17f5.jpg", "https://people.com/thmb/PtdddXpK8B1tGn_SadFL8VMaTiA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/bachelor-in-paradise12112329-bbfeecdc03504b878fcbe53e76dad66a.jpg", "https://people.com/thmb/hL9m8zfrPoaIxPXhoWWsIrAJMD0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/becca-kufrin2-2000-ed2b1111df7145689b7b0a18fd579bbb.jpg", "https://people.com/thmb/t8YAvygxa9x7WNG3C8EyTIwObzE=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(899x159:901x161)/Michelle-Young-Nayte-Olukoya-1-464ac0d56283479e994cb06b9f07915d.jpg", "https://people.com/thmb/t-xMnazqNKHl-1TRcV3LeYwfha0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/gerry-turner-theresa-nist-121124-11e8664a91ee4b4984221537f5203785.jpg", "https://people.com/thmb/Lz--SDbKO1JVUxQ4If31UcAPePo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Carol-Freeman-Branstine-Golden-Bachelor-102825-tout-032a3806e5e242978fab3940ae68c249.jpg", "https://people.com/thmb/dpTF9MJfkHSvHn2wkD3wqMhTh7c=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/bob-guiney-435-854174071ca644c8b34af0be375e96ff.jpg", "https://people.com/thmb/lDFjcqM3A5iMwfX-3Y9qLAThTUk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/nick-vanessa-bachelor-1-dc004a479c264c76b3c433b42a57c4db.jpg", "https://people.com/thmb/hOeESeJ7SzpcXJwK883VaWJO1UQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Taylor-Frankie-Paul-091025-4d4931e79a60485396023938bc1a9728.jpg", "https://people.com/thmb/STP1mRo1xo44GXEue4rGDjlLkSE=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/jordan-jenna-bip-9c0f38ac0abd4725ab5581b8a7fb897d.jpg", "https://people.com/thmb/Hzstfa4Zo8E81m2_VzH4_rI5Ty8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(506x301:508x303)/becca-kufrin-1-787d88a1dcaf44f099079f451a99c4e9.jpg", "https://people.com/thmb/VnFjj-ulUS4M8T1hfPpCVx2yJtQ=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/mel-owens-peg-munson-golden-bachelor-111325-42efe59dada446d9bd1f718573f4151c.jpg", "https://people.com/thmb/BlTjYzGgHBdgsxy0nCM2ZIU65HM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/byron-velvick-435-d26365f1647740f88771498799ccdc8f.jpg", "https://people.com/thmb/1JEEMhz0S_v6UfNv2a5zAH_riaU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(707x465:709x467)/jenn-tran-devin-bachelorette-090624-4c3744d5ca3343a9a936109717321790.jpg", "https://people.com/thmb/2ToZUIbbZ_jquJloGfFZ8q_hDDw=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/andi-dorfman-435-3-a73e2b8f63694d55baf9fe0dd97d3983.jpg", "https://people.com/thmb/sU_fzsX69PNgjDmOuv6-fe4kQe0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/SUSIE-CLAYTON-ECHARD15-f40003f6918c41cfa7106f31b0fd7134.jpg", "https://people.com/thmb/0LrNqsIEQn_ocFrgJFB_3J5akIk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/chris-bukowski-katie-morton-3-d46773c1e4b74a81a544556aaa9667a3.jpg", "https://people.com/thmb/sMgU6aLKKB19YG9flRylUsQBH4M=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/kiptyn-locke-1-660-fb44df78abde4dc9bdcfe57774dfaf44.jpg", "https://people.com/thmb/Ojrb5pT9Ohiz9UA-40Scsm1O0Ac=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(740x244:742x246)/joey-grazidei-kelsesy-anderson-ryan-sutter-trista-rehn-split-100825-03c7882ba6c84198a93a5f7b6a1caf54.jpg", "https://people.com/thmb/SQTM7WDH0i0yXqBW4AxEFuyN3S4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(506x192:508x194)/tanner-tolbert-jade-roper-100225-115f5ce4b82747b8bf56a3d93f3d1d32.jpg", "https://people.com/thmb/QmSYYHVTqxFd1sORcluz-lGVECU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/josh-murray-435-1-8360496f65e14dba897dc8c3d24d6bb2.jpg", "https://people.com/thmb/jezaBUMgOab7Dz7AwLI35NOdfjs=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(989x174:991x176)/Johnny-DePhillipo-Victoria-Fuller-bip-112322-fa9e46a81c76497e996a3405337e6efc.jpg", "https://people.com/thmb/Y5t7eOe41N4WLC-1oMA1fxBjZjU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(494x317:496x319)/chris-conran-alana-milne-100225-3e3f58fc7c754d288a06532e2c9ef7a5.jpg", "https://people.com/thmb/eypWd_4ox7hbT__sKDIJTnJ_JZg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/cody-sattler-660-9f6270074300468cadcfe33e614b4158.jpg", "https://people.com/thmb/hQttLBLIyJNH3ijvgmXz3usYr0Y=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(659x379:661x381)/Bachelor-Zach-Shallcross-kaity-0327-1-d91d7f0fe0964aaba8859cdbe1a02e99.jpg", "https://people.com/thmb/t3nbH1WIlPoICJR0mFvZWACOmg8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/brendan-morais-pieper-james-2-a2889a86110b4d65993f4ca34ea51f79.jpg", "https://people.com/thmb/ogOfrXNh66kP4S1P1F62PqacNJY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(799x0:801x2)/gettyimages-1169608836-2000-82e527837cf84a1898c1d506e560c570.jpg", "https://people.com/thmb/_Fg6pocGwiFVMemj8RGcdor-mHI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/theresa-nist-gerry-turner-launch-of-Hulu-on-Disney-041224-1-ec3c1719cf044a348f70bdd40256e61d.jpg", "https://people.com/thmb/MmQGii6FG3If3en9bNUDvOmJpTQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/trista-rehn-660-1-084ac9ff933a491c9fe390fe1730588e.jpg", "https://people.com/thmb/CxMWltBohSI02rLsqueJm1ZrGYk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(799x0:801x2)/sfsee-2000-8ab9dbc0b5c945b0ac29bba556f6d14f.jpg", "https://people.com/thmb/tx4tPKMsmxlj9ayOoOohfRDF6Vs=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/bachelorette-finale-08212352-b8058f4df679451287b1ad11e5a34187.jpg", "https://people.com/thmb/1DpTwRG4d-19uyjl2Mv67TfvWEo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/juan-pablo-435-4-3fe1bf11978c43e6a09f9d9f2216c7a4.jpg", "https://people.com/thmb/houJgFYu3h_jBt0tQwFzaIKWRpY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/golden-bachelor-mel-owens-main-042325-0c580dad2f294daa82ca7a941097b7b9.jpg", "https://people.com/thmb/swCGQ90A8VX7SpMKQVyci619Vn0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/ben-higgins-e-435-c8beabc15d27433f92720b484c8df4df.jpg", "https://people.com/thmb/p9oyHx7T3tPsDi_EFTeMlYAfnDY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/eliza-isichei-aaron-bryant-bachelor-in-paradise-120723-716673a3164f4b959dd66ac64187789e.jpg", "https://people.com/thmb/2gLyUtXugGVuUSKsbkToKFOL4uo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/andrew-firestone-435-58184edff9a2453e82dc2b4c5d4d065a.jpg", "https://people.com/thmb/RqikRNGLCwD61YQ8aCSfY5h9ZRY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(399x0:401x2)/bachelor-engagements-800-1-4acacdf21c6a49ee8f5f98ab6dd0a8a9.jpg", "https://people.com/thmb/AV8LlEwVJgiEuOMhoedGLWZD-Ew=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(678x0:680x2)/jesse-palmer-7e18393b8bfa4eff8059af7283402409.jpg", "https://people.com/thmb/tx3CFTThcwra3E9IDPIDgeY-LsE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/MEL-OWENS-Engagement-ring-111225-5923d433b598498a8823b24550f19a86.jpg", "https://people.com/thmb/yjDK_i_zHmTpdod9zd4ux0w_Z3U=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(873x0:875x2)/bachelor-couples-still-together-5-2000-94f8d439ea25454e8da99c82b9fe95f4.jpg", "https://people.com/thmb/P37a_jS1VLTZ4nGE0_oxTn8oscI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/gerry-theresa-12-120123-15db1b5db14941d892bb8394283ca8a3.jpg", "https://people.com/thmb/eFtsRbA9EVDG7D8rZZhYUtmwGFo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(745x292:747x294)/bachelor-in-paradise-jess-edwards-spencer-conley-090125-6884744b396e4e468da32e9fb2f7709b.jpg", "https://people.com/thmb/hcRuoSb3o2e4Ev4FwKiJ9l-f04o=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/brad-womack-435-1-90e9d707dcd340b88f4d41bed6147c64.jpg", "https://people.com/thmb/NUxN-FQ1Zn41EZekBeShi09RHUY=/200x200/filters:no_upscale():max_bytes(150000):strip_icc()/janine-henni-57d47b03f624493fb0e9843f319ac2c8.jpg", "https://people.com/thmb/ABBBow7V6Oeyp-FbHW-Ccr7bz_c=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/grant-ellis-juliana-pasquarosa-bachelor-052025-a64d67cf6d714613a9b543408a3d30ce.jpg", "https://people.com/thmb/4s9c58wAHi0JKP4vFnD6sudgJxQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(742x357:744x359)/chris-soules-whitney-bischoff-100225-dea958eeab6a482ca9bcf1cbf8990cc7.jpg", "https://people.com/thmb/ZGgMDH5IAdYhz11ug6pChYpZSc0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(909x0:911x2)/bachelor-couples-still-together-3-2000-eecce15a8d3543bda22f435ef70130da.jpg", "https://people.com/thmb/9Vw-08RzkFqMJUG7AYGF9MZN164=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/deanna-pappas-435-3-edbda58ec3b24f04b11d65cfcae3134c.jpg", "https://people.com/thmb/k9yrb1xtjKz7nyCr-Rd42TJq-Go=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/matt-grant-435-4341a0285f27493e8144bda8a1f66759.jpg", "https://people.com/thmb/-mmi7Iy3h1eiz_jU4-dCnkmjsVY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(734x213:736x215)/KELSEY-A-JOEY-GRAZIADEI-proposal-tout-2-032524-bef4c9ba09e24fa5ad2eddff2b551ea9.jpg", "https://people.com/thmb/wn-tISgkNc5BTGUQ2Eig0p8innc=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/ben-flajnik-660-2-e444afc225714dd0a46ac107aa6ca621.jpg", "https://people.com/thmb/5WwvANhT0wB6LUYS0fqIame8VPM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(519x179:521x181)/Zac-Tayshia-2-ff9ed3b2304e45fa89a8682030cb263e.jpg", "https://people.com/thmb/XBRo0LwXNhvEHET59ZxlQr1hGIU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/desiree-hartstock-660-2-dbaa9605cf0a4edbb518b29714cecaea.jpg", "https://people.com/thmb/OnPvhpQHyaLX6sBNWRDp2mo2AGc=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(399x0:401x2)/britt-nilson-800-0f43d1272ad24a0daeed317344019691.jpg", "https://people.com/thmb/V3R-W-EOawWEW1rWCx3Xhv6ObQM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/brad-womack-1-660-819505fb9b594012bc7eb28e1de3f4bc.jpg", "https://people.com/thmb/bHqUr0JCVp8wk8JOGwUY3t3njYY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Mel-Cindy-Golden-Bachelor-111325-5fafc5719c214131b93f2be28047a8f6.jpg", "https://people.com/thmb/DUhwWjaTTcO0KzMbzujzOuf1rhU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/ali-fedotowsky-435-9-52ba0a6809ba48818a8ef3cca4dcadb3.jpg", "https://people.com/thmb/RB7CgGO0rtdDwfxqsmuJ4Zd3drY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/ashley-hebert-435-8-e4a499f2fbd8443dbc97aa574f5fe19f.jpg", "https://people.com/thmb/0jKnK8bSyr7Fb41sXsNwd1jtAFM=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/jenna-bush-hager-minka-kelly-today-with-jenna-and-friends-111925-7e3c2b8605fe4a96a1b712c168083adb.jpg", "https://people.com/thmb/Eb3apJSzrpLzapWpQ8B1He6IEHk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/sean-lowe-435-11-01a1f89385e64857884759c8f3cac03b.jpg"], "top_img": "https://people.com/thmb/Ojrb5pT9Ohiz9UA-40Scsm1O0Ac=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(740x244:742x246)/joey-grazidei-kelsesy-anderson-ryan-sutter-trista-rehn-split-100825-03c7882ba6c84198a93a5f7b6a1caf54.jpg", "keywords": [], "authors": ["Janine Henni", "People Editorial Guidelines", "Caroline Blair", "Kimberlee Speakman", "Stephanie Sengwe", "Michelle Lee", "Liza Esquibias", "Charna Flam", "Julia Moore", "Stephanie Wenger"], "canonical_link": "https://people.com/bachelor-and-bachelorette-couples-where-are-they-now-11821361", "title": "Where Are All 90 Bachelor Nation Couples Now? All About Their Lives After the Final Rose", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "For some Bachelor Nation couples, TV love was forever. Here's what to know about which couples from 'The Bachelor,' 'The Bachelorette,' 'Bachelor in Paradise,' 'The Golden Bachelor' and 'The Golden Bachelorette' are still together.", "emailcontenttype": "LISTSC", "emailvertical": "PEOPLE", "sailthru.author": "Janine Henni", "sailthru.tags": "reality-tv-shows", "parsely-section": "Entertainment", "parsely-tags": "People.com,Entertainment,TV,Reality TV", "article": {"section": "People", "author": "https://www.facebook.com/peoplemag"}, "og": {"type": "article", "site_name": "People.com", "url": "https://people.com/bachelor-and-bachelorette-couples-where-are-they-now-11821361", "title": "Where Are All 90 Bachelor Nation Couples Now? All About Their Lives After the Final Rose", "description": "For some Bachelor Nation couples, TV love was forever. Here's what to know about which couples from 'The Bachelor,' 'The Bachelorette,' 'Bachelor in Paradise,' 'The Golden Bachelor' and 'The Golden Bachelorette' are still together.", "image": "https://people.com/thmb/Ojrb5pT9Ohiz9UA-40Scsm1O0Ac=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(740x244:742x246)/joey-grazidei-kelsesy-anderson-ryan-sutter-trista-rehn-split-100825-03c7882ba6c84198a93a5f7b6a1caf54.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Where Are All 90 Bachelor Nation Couples Now? All About Their Lives After the Final Rose", "description": "For some Bachelor Nation couples, TV love was forever. Here's what to know about which couples from 'The Bachelor,' 'The Bachelorette,' 'Bachelor in Paradise,' 'The Golden Bachelor' and 'The Golden Bachelorette' are still together.", "image": "https://people.com/thmb/Ojrb5pT9Ohiz9UA-40Scsm1O0Ac=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(740x244:742x246)/joey-grazidei-kelsesy-anderson-ryan-sutter-trista-rehn-split-100825-03c7882ba6c84198a93a5f7b6a1caf54.jpg"}, "vf": {"url": "https://people.com/bachelor-and-bachelorette-couples-where-are-they-now-11821361"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.146.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.146.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.146.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.146.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.146.0/icons/favicons/mstile-310x150.png", "fb": {"pages": 95926963131}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}