{"url": "https://variety.com/2018/tv/news/allison-mack-bail-hearing-sex-cult-arrest-keith-raniere-1202785044/", "text": "Bail for “Smallville” actress Allison Mack was set at $5 million in a Tuesday hearing at Brooklyn Federal Court as she was released to serve home detention at her parents’ house in Los Alamitos, Calif.\n\nMack was indicted on April 19 on charges of sex trafficking, sex trafficking conspiracy and forced labor conspiracy in New York federal court. She appeared before Magistrate Judge Viktor V. Pohorelsky at the Brooklyn courthouse in New York’s Eastern District.\n\nThe expectation is that Mack is cutting a deal with prosecutors to provide information against Nxivm founder Keith Raniere, who was arrested last month in Mexico and remains in federal custody. A bail hearing for Raniere is set for next week.\n\nHer mother, Melinda Mack, was in court and put up her home in Los Alamitos, Calif. as collateral for the bail, in addition to property and a bank account owned by Allison Mack.\n\nPopular on Variety\n\nThe actress accused of helping run a secretive sex cult appeared in court in gray-green jail scrubs. She spoke softly in court and did not appear to make eye contact with her mother during the hearing. After standing before the judge to sign the bond, Melinda Mack turned her head to watch her daughter being led out of the courtroom.\n\nMack was not handcuffed but she kept her hands clasped behind her back during the 15-minute hearing. The petite 35-year-old said few words and stayed grim-faced but nodded repeatedly. Her shoulder-length blond hair was messy.\n\nLater, as Melinda Mack left the courthouse, she and Allison Mack’s attorney, William McGovern, refused to comment on the case.\n\nAllison Mack was released on the condition she serve home detention with electronic monitoring. The conditions of her bail allow her to travel to Southern California and to the New York City area where her criminal attorneys are based. Mack’s attorneys said she intended to return to her parents home as soon as possible.\n\nMack’s father, opera singer Jonathan Mack, was not in court but is obligated to co-sign her bail collateral arrangement by May 4. The judge instructed Allison Mack not to associate with anyone connected, past or present, to the Nxivm group that is the source of the sex trafficking charge she faces. According to court documents, Mack is accused of trying to destroy emails, text messages and other material connected with the case against her and Raniere.\n\nBefore the hearing, prosecutors and Mack’s attorneys huddled on an agreement to severely restrict Mack’s ability to access the Intenet and online communications. The side agreed to conditions that she would have access to a phone that would limit her to reviewing emails only from her lawyers.\n\nMack was a regular on the WB Network/CW drama “Smallville” throughout its 10-season run. Her arrest in connection with what prosecutors maintain was a brutal sex cult revolving around Raniere has shocked those who worked with her on “Smallville.” That show was filmed in Vancouver, where Nxivm has a large following.\n\nMack is accused of masterminding a scheme with Raniere to recruit young women into a secretive group that purported to be focused on women’s empowerment but in reality served as a sex ring for Raniere and others. The women were instructed to serve as “slaves” to male “masters.” According to court documents the women were subjected to brutal conditions including extremely restrictive diets to keep them thin, sleep deprivation, and submitting to being scarred by a branding tool with a symbol that incorporated Raniere’s initials.", "images": ["https://variety.com/wp-content/themes/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c4=&cv=3.9&cj=1", "https://variety.com/wp-content/uploads/2018/04/allison-mack1.jpg?w=1000&h=563&crop=1"], "top_img": "https://variety.com/wp-content/uploads/2018/04/allison-mack1.jpg?w=1000&h=563&crop=1", "keywords": [], "authors": ["Cynthia Littleton", ".Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow", "Class", "Wp-Block-Co-Authors-Plus", "Display Inline", ".Wp-Block-Co-Authors-Plus-Avatar", "Where Img", "Height Auto Max-Width", "Vertical-Align Bottom .Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow .Wp-Block-Co-Authors-Plus-Avatar", "Vertical-Align Middle .Wp-Block-Co-Authors-Plus-Avatar Is .Alignleft .Alignright"], "canonical_link": "https://variety.com/2018/tv/news/allison-mack-bail-hearing-sex-cult-arrest-keith-raniere-1202785044/", "title": "Allison Mack Released on $5 Million Bond in Sex Trafficking Case", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://variety.com/wp-content/themes/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Bail for \"Smallville\" actress Allison Mack was set at $5 million in a Tuesday hearing at Brooklyn Federal Court.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "robots": "max-image-preview:large", "generator": "WordPress 6.7.4", "author": "Cynthia Littleton", "tags": "Allison Mack, Smallville", "fragment": "!", "og": {"type": "article", "title": "Allison Mack Released on $5 Million Bond in Sex Trafficking Case", "url": "https://variety.com/2018/tv/news/allison-mack-bail-hearing-sex-cult-arrest-keith-raniere-1202785044/", "description": "Bail for \"Smallville\" actress Allison Mack was set at $5 million in a Tuesday hearing at Brooklyn Federal Court.", "site_name": "Variety", "image": {"identifier": "https://variety.com/wp-content/uploads/2018/04/allison-mack1.jpg?w=1000&h=563&crop=1", "width": 1000, "height": 563, "alt": "Allison Mack"}, "locale": "en_US"}, "article": {"published_time": "2018-04-24T19:30:27+00:00", "modified_time": "2018-04-24T22:47:21+00:00"}, "twitter": {"description": "Bail for \"Smallville\" actress Allison Mack was set at $5 million in a Tuesday hearing at Brooklyn Federal Court.", "site": "@variety", "creator": "@Variety_Cynthia", "card": "summary_large_image", "title": "Allison Mack Released on $5 Million Bond in Sex Trafficking Case", "image": "https://variety.com/wp-content/uploads/2018/04/allison-mack1.jpg?w=1000&h=563&crop=1"}}, "movies": [], "publish_date": 1524598227.0, "source": "https://variety.com", "summary": ""}