{"url": "www.huffingtonpost.com/entry/jennifer-garner-and-ben-affleck-file-for-divorce_us_58f0bf56e4b0da2ff85fdbe5", "text": "LOADING ERROR LOADING\n\nIt took them two years, a superhero franchise and a countless trips to the Brentwood farmer’s market, but Jennifer Garner and Ben Affleck have officially filed for divorce.\n\nThe couple apparently coordinated their filing sans lawyers, according to TMZ, which was first to break the news, with Garner sending her court papers in Thursday and Affleck responding shortly after.\n\nAdvertisement\n\nThe two are seeking joint legal and physical custody of their children, Violet, 11, Seraphina, 8, and Samuel, 4, so it looks like they’re avoiding a Brangelina-style situation entirely.\n\nThe decision to officially divorce comes amid speculation that the former Hollywood golden twosome were reconciling, as the two have continued to act very much like a couple (going on vacations together, praising each other in the press and co-parenting their children) since announcing their split in June 2015.\n\nBut according to sources per People magazine, Garner and Affleck have taken their sweet time to iron out the details, like division of property and assets, as well as spousal support, since they do not have a prenuptial agreement.\n\nAdvertisement\n\nThe two reportedly remain “super amicable” and have done everything with their children in mind.\n\n“They always planned to divorce despite what people said. If you look at their first statement it says divorce, not separate,” a source told the magazine. “They just did it the way they wanted to and did what was best for their kids. There was no catalyst, it was just time. Nothing has changed, they are and still will be putting their kids first.”\n\nThe divorce could be made final within the year, so until then let’s raise a toast to Bennifer 2.0 and their love story. It’s the end of an era.\n\nCelebrate Truth This Season Your Support Fuels Our Mission Your Support Fuels Our Mission The holidays can get loud. But some stories cut through the noise -- the ones that make sense of the chaos and hold power to account. Support the newsroom built on clarity, accountability, and a healthy dose of reality. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. “Our fierce, independent reporting and unvarnished perspective hold power to account and inform millions of readers. Please support this hard-hitting journalism.” Monthly Annually SAVE 16% Support $5/month (about $0.17/day) Silver Huffposter 🤍 Monthly recurring supporter-only email\n\nFewer requests for financial support Support $10/month (about $0.33/day) Gold Everything in the Silver Tier\n\nAd-free access on the HuffPost website OR HuffPost apps\n\nSay goodbye to annoying video interruptions while you read. No more autoplay videos. Support $20/month (about $0.67/day) Platinum HuffPoster 🏆 Everything in the Gold Tier\n\nAd-free access on the HuffPost website AND HuffPost apps\n\nEarly access to new features\n\nMembership to Platinum Club focus group Make a One Time Contribution Support HuffPost Already a member? Log in to hide these messages.", "images": ["https://img.huffingtonpost.com/asset/5cc855a6240000090c524d4f.jpg?ops=100_100", "https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "https://img.huffingtonpost.com/asset/58f0c35d2600004500c45b07.jpeg?cache=fnZr7zJFKi&ops=1200_630", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNkYAAAAAYAAjCB0C8AAAAASUVORK5CYII=", "https://img.huffingtonpost.com/asset/691c87541700009d2b9c5f37.jpg?ops=50_50"], "top_img": "https://img.huffingtonpost.com/asset/58f0c35d2600004500c45b07.jpeg?cache=fnZr7zJFKi&ops=1200_630", "keywords": [], "authors": ["Senior Reporter", "Whitney Snyder", "Editor-In-Chief Huffpost"], "canonical_link": "https://www.huffpost.com/entry/jennifer-garner-and-ben-affleck-file-for-divorce_n_58f0bf56e4b0da2ff85fdbe5", "title": "Ben Affleck & Jennifer Garner File For Divorce Amid Reconciliation Rumors", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "It's the end of an era.", "keywords": "Celebrities,divorce,Celebrity Couples,Ben Affleck,jennifer garner", "fb": {"app_id": 46744042133}, "og": {"title": "Bennifer 2.0 Put Us Out Of Our Misery And File For Divorce", "type": "article", "image": {"identifier": "https://img.huffingtonpost.com/asset/58f0c35d2600004500c45b07.jpeg?cache=fnZr7zJFKi&ops=1200_630", "url": "https://img.huffingtonpost.com/asset/58f0c35d2600004500c45b07.jpeg?cache=fnZr7zJFKi&ops=1200_630", "type": "image/jpeg", "width": 1200, "height": 630}, "url": "https://www.huffpost.com/entry/jennifer-garner-and-ben-affleck-file-for-divorce_n_58f0bf56e4b0da2ff85fdbe5", "site_name": "HuffPost", "locale": "en_US", "description": "It's the end of an era."}, "article": {"tag": "Celebrities,divorce,Celebrity Couples,Ben Affleck,jennifer garner", "section": "Entertainment", "published_time": "2017-04-14T13:48:09Z", "modified_time": "2017-04-14T13:48:09Z"}, "twitter": {"card": "summary_large_image", "site": "@HuffPostEnt", "title": "Bennifer 2.0 Put Us Out Of Our Misery And File For Divorce", "image": {"identifier": "https://img.huffingtonpost.com/asset/58f0c35d2600004500c45b07.jpeg?cache=fnZr7zJFKi&ops=1200_630", "width": 1200, "height": 630}, "description": "It's the end of an era."}, "al": {"ios": {"url": "huffpostnews:///?editionID=us&entryID=us_58f0bf56e4b0da2ff85fdbe5", "app_store_id": 306621789, "app_name": "HuffPost"}}, "bingbot": "noarchive", "robots": "max-snippet:-1,max-image-preview:large,max-video-preview:-1", "google-site-verification": "97Mj-wW7u8U1NOnkW1rfH-I1kgO0-a9YsgoesOk41R8"}, "movies": [], "publish_date": 1492177689.0, "source": "http://www.huffingtonpost.com", "summary": ""}