{"url": "https://www.complex.com/pop-culture/2012/02/the-15-worst-reality-stars-turned-singers/", "text": "Image via Complex Original\n\nlead Just when we thought Paris Hilton had retired from being Paris Hilton, the hotel heiress announced that she's recording another album, and that she's collaborating with Afrojack and LMFAO. In other words, she's trying to turn what we thought was a publicity stunt into a full-fledged career path. Fortunately for the famous blond, she's not the most ear-numbing pseudo-singer out of the long roster of reality TV personalities turned recording artists. Check out The 15 Worst Reality Stars Turned Singers and see who's even more embarrassing in the studio.\n\nHeidi Montag 15. HEIDI MONTAG Reality Show: The Hills\n\nFailed Attempt at Music: “Superficial\"\n\nThis would have been more endearing if Heidi marketed it as an SNL digital Short.\n\nMelissa Gorga 14. MELISSA GORGA Reality Show: The Real Housewives of New Jersey\n\nFailed Attempt at Music: “On Display\"\n\nGorga is essentially singing to defend herself against people watching her, but she expects people to listen to this song? That’s some Catch-22.\n\nDavid Broom 13. DAVID BROOM Reality Show: The Real World: New Orleans\n\nFailed Attempt at Music: \"Come On Be My Baby Tonight\"\n\nWhile Chappelle's rendition of this record is funny, the real version is hilarious. Unfortunately, it's nowhere to be found online. Tragic.\n\nParis Hilton 12. PARIS HILTON Reality Show: The Simple Life\n\nFailed Attempt at Music: \"Nothing in this World\"\n\nWe’ll be honest, \"Stars Are Blind\" was kind of catchy. Then she proved it was a fluke with the rest of her terrible music.\n\nDanielle Staub 11. DANIELLE STAUB Reality Show: The Real Housewives of New Jersey\n\nFailed Attempt at Music: “Real Close\"\n\nYo, she performed this on Maury. That's all you need to know.\n\nThe Situation 10. MIKE \"THE SITUATION\" SORRENTINO Reality Show: Jersey Shore\n\nFailed Attempt at Music: “The Situation\"\n\nThe Situation tried to give us the ultimate fist-pumping song when he released his self-titled single, “The Situation.” Emphasis on tried.\n\nKim Kardashian 9. KIM KARDASHIAN Reality Show: Keeping Up with the Kardashians\n\nFailed Attempt at Music: \"Jam\"\n\nHas anyone ever sounded more bored on wax?\n\nMichaele Salahi 8. MICHAELE SALAHI Reality Show: The Real Housewives of D.C.\n\nFailed Attempt at Music: “Bump It\"\n\nMichaele was kicked off Celebrity Rehab because she had “no addiction” and “no reason to be there.” Well, according to her song “Bump It,” she's a dance-a-holic. That’s a very real disease, Dr. Drew.\n\nSimon Von Kempen 7. SIMON VAN KEMPEN Reality Show: The Real Housewives of New York City\n\nFailed Attempt at Music: \"I Am Real\"\n\nThis song would've gone viral had it been about his red leather pants instead of his fame and housewives talking behind his back.\n\n\n\nLuAnn De Lesseps 6. LUANN DE LESSEPS Reality Show: The Real Housewives of New York City\n\nFailed Attempt at Music: “Chic, C’est la Vie\"\n\nShe basically turned Chicken Soup for the Soul into a song. We're not buying self-powerment from a reality star.\n\nMama Jones 5. NANCY JONES Reality Show: Love and Hip Hop\n\nFailed Attempt at Music: “Psychotic Bitch\"\n\nIf you think you have family issues, we invite you to take a listen to “Psychotic Bitch,” where Mama Jones goes off on her son Jim Jones' girlfriend.\n\nKim Zolciak 4. KIM ZOLCIAK Reality Show: The Real Housewives of Atlanta\n\nFailed Attempt at Music: “Tardy for the Party\"\n\nAh, deadpan delivery burglar alarm beats. We're totally okay with never hearing this song again.\n\nKevin Federline 3. KEVIN FEDERLINE Reality Show: Britney & Kevin: Chaotic\n\nFailed Attempt at Music: “Po Po Zao\"\n\nK-Fed is a man of mystery. The only explanation he provides for his single “Po Po Zao” is that it's a “Brazilian ass shaker.” We did our homework, and it’s Portuguese for “big butt.” Now the only mystery that remains is why Britney married him.\n\nAngelina Pivarnick 2. ANGELINA PIVARNICK Reality Show: Jersey Shore\n\nFailed Attempt at Music: “I’M HOT\"\n\nHer music debut sounds like a song that she wrote in middle school. Exhibit A: “I’m hot/Like an ice cream cone with a cherry on top.”", "images": ["https://images.complex.com/complex/image/upload/q_auto,f_auto,c_fill,ar_1.78,w_2048,g_auto/v1723938427/sanity-new/not-available-lead-132318200.jpg", "https://images.complex.com/complex/image/upload/ar_1.91,c_fill,g_auto,q_auto/v1723938433/sanity-new%2Ftmp-name-3-2219-1670693809-60_16x9-6730676"], "top_img": "https://images.complex.com/complex/image/upload/ar_1.91,c_fill,g_auto,q_auto/v1723938433/sanity-new%2Ftmp-name-3-2219-1670693809-60_16x9-6730676", "keywords": [], "authors": [], "canonical_link": "https://www.complex.com/pop-culture/a/complex/the-15-worst-reality-stars-turned-singers", "title": "The 15 Worst Reality Stars Turned Singers", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "All of the celebs who tortured us with their failed attempts at music. | Complex", "og": {"title": "The 15 Worst Reality Stars Turned Singers", "description": "All of the celebs who tortured us with their failed attem...", "url": "https://www.complex.com/pop-culture/a/complex/the-15-worst-reality-stars-turned-singers", "site_name": "Complex", "image": "https://images.complex.com/complex/image/upload/ar_1.91,c_fill,g_auto,q_auto/v1723938433/sanity-new%2Ftmp-name-3-2219-1670693809-60_16x9-6730676", "type": "article"}, "twitter": {"card": "summary_large_image", "site": {"identifier": "@complex", "id": 13049362}, "title": "The 15 Worst Reality Stars Turned Singers", "description": "All of the celebs who tortured us with their failed attempts at music. | Complex", "image": "https://images.complex.com/complex/image/upload/ar_1.91,c_fill,g_auto,q_auto/v1723938433/sanity-new%2Ftmp-name-3-2219-1670693809-60_16x9-6730676"}}, "movies": [], "publish_date": null, "source": "https://www.complex.com", "summary": ""}