{"url": "https://web.archive.org/web/20170131235603/http://time.com/4653873/donald-trump-immigration-ban/", "text": "U.S. President Donald Trump pauses after signing an executive order. (Photographer: Andrew Harrer/Bloomberg via Getty Images)\n\nU.S. President Donald Trump pauses after signing an executive order. (Photographer: Andrew Harrer/Bloomberg via Getty Images) Bloomberg—Bloomberg via Getty Images\n\nPresident Trump's executive order temporarily suspending travel from seven Muslim-majority nations drew swift criticism from musicians, actors and other celebrities.\n\nIt was the latest in the long and sometimes troubled relationship Trump has with other famous people, who have appeared on his reality show The Apprentice and tangled with him on political issues .\n\nStill, he had some support, including actor Scott Baio, rapper Azealia Banks and former Alaska Gov. Sarah Palin.\n\nSee what 50 celebrities had to say about Trump's immigration ban below.\n\nRapper Nicki Minaj referenced her own immigration from Trinidad in a tweet.\n\nThe most harmful thing you could ever take away from another human being is hope. #ProudImmigrant #Grateful #TaxPayerButIcantVote #America - NICKI MINAJ (@NICKIMINAJ) January 30, 2017\n\nBlackish star Yara Shahidi shared that the concern touched her on a personal and global level.\n\nSilicon Valley star and comedian Kumail Nanjiani, who was born in Pakistan, shared his concern that the ban would encourage hateful attitudes.\n\nAs someone who was born in Pakistan I can tell you coming into America is VERY difficult. A #Muslimban accomplishes nothing but hate. - Kumail Nanjiani (@kumailn) January 28, 2017\n\nDirector Ava DuVernay pointed out that Asghar Farhadi, an Iranian director nominated for an Oscar at this year's Academy Awards, would be unable to travel to the ceremony under the immigration ban.\n\nAmplifying words of one of my favorite filmmakers, Asghar Farhadi, who like too many others will be turned away from the Land of the Free. pic.twitter.com/CcskcFueuo - Ava DuVernay (@ava) January 28, 2017\n\nMusician Kirk Franklin emphasized that religious freedom was related to other civil liberties.\n\nI am a Christian who would rather sit at the table with a Muslim brother than ban him from a home that wasn't originally mine... - Kirk Franklin (@kirkfranklin) January 28, 2017\n\nActor Mindy Kaling referenced her book, where she details her parents' experience as immigrants.\n\nA photo posted by Mindy Kaling (@mindykaling) on Jan 28, 2017 at 12:44pm PST\n\nGrey's Anatomy 's Jesse Williams pointed out that many of the country's accomplishments were due to immigrants and refugees.\n\nSteve Jobs was the son of a Syrian refugee. How bout a list of accomplished refugees & their descendants? We shall call it #ThanksRefugees - jesse Williams. (@iJesseWilliams) January 31, 2017\n\nGaycation star Ellen Page attended a protest at John F. Kennedy International Airport .\n\nMusician Sia told her followers that she would match their donations to the ACLU up to $100k.\n\nhelp our queer & immigrant friends. send me your donation receipts for the @aclu & I will match up to $100K https://t.co/P9zVRH0WH0 #RESIST - sia (@Sia) January 28, 2017\n\nActor Rosie O'Donnell pledged to match Sia's donation to the ACLU in turn.\n\nand i will match your 100K donation sia - #resist https://t.co/xkjVGeMWuR - ROSIE (@Rosie) January 29, 2017\n\nEven director Judd Apatow followed suit.\n\nOkay @sia. We are all going to join you. I am in! https://t.co/XN8tqp7sPX - Judd Apatow (@JuddApatow) January 29, 2017\n\nPop star Miley Cyrus pledged her support to immigrants in the country.\n\nScandal star Kerry Washington encouraged her followers to remember American history.\n\nSick to my stomach today about the #MuslimBan\n\nDon't understand why? Go to @Stl_Manifest & learn the awful history of US rejecting refugees - kerry washington (@kerrywashington) January 28, 2017\n\nMusician Bruce Springsteen called America a \"nation of immigrants\" during a concert.\n\n'America is a nation of immigrants and we find this anti-democratic and fundamentally un-American.' pic.twitter.com/DsXSaLeNNN - Bruce Springsteen (@springsteen) January 30, 2017\n\nPop star Rihanna, who was born in Barbados, candidly shared her thoughts on the matter via Twitter.\n\nDisgusted! The news is devastating! America is being ruined right before our eyes! What an immoral pig you have to be to implement such BS!! - Rihanna (@rihanna) January 29, 2017\n\nMoonlight and Hidden Figures star Mahershala Ali used his Screen Actors Guild acceptance speech to speak out against the persecution of communities.\n\nSupermodel sisters Bella and Gigi Hadid protested the executive order in New York City.\n\nA photo posted by Bella Hadid (@bellahadid) on Jan 29, 2017 at 8:56pm PST\n\nMeanwhile, the stars of How to Get Away With Murder took to LAX to protest.\n\nActor Alyssa Milano pointed out that the immigration ban can affect everyone on a very personal level.\n\nMy best friend, Alaa Mohammad Khaled, is Muslim. His parents were Palestinian refugees. His brother is DJ Khaled. #RefugeesWelcome pic.twitter.com/qXOapgvvF7 - Alyssa Milano (@Alyssa_Milano) January 28, 2017\n\nA sentiment that entertainment legend Bette Midler echoed.\n\nThe head of Atlantic Records Ahmet Ertegun, Turkish, and my producer of 30 years, Arif Mardin was too. I would have had no career w/o them. https://t.co/rV4EE1Ss9y - Bette Midler (@BetteMidler) January 29, 2017\n\nTalk show host Ellen DeGeneres riffed on Trump's campaign slogan while critiquing his executive order.\n\nFor me, America is great because of all the people who came here. Not in spite of them. #NoBan - Ellen DeGeneres (@TheEllenShow) January 29, 2017\n\nSinger and actor Barbra Streisand urged her followers to consider the determining factors in the immigration ban.\n\nI absolutely oppose this Muslim ban. But why does it effect only countries with no Trump properties? Follow the $. - Barbra Streisand (@BarbraStreisand) January 29, 2017\n\nStar Trek star George Takei also echoed Streisand's concerns with the countries selected for the immigration ban.\n\nI hope we're all paying attention. https://t.co/vcpcdquogB - George Takei (@GeorgeTakei) January 27, 2017\n\nAuthor J.K. Rowling weighed in with her own thoughts on Trump's meeting with Theresa May.\n\nAmericans telling me how ashamed they are: you've got a lot of company across the Atlantic today. #Chamberlainhttps://t.co/Z5buaq5CZi - J.K. Rowling (@jk_rowling) January 28, 2017\n\nActor Julianne Moore referenced the Constitution following the immigration ban.\n\nThe immigration and nationality act of 1965 bans all discrimination against immigrants on the basis of national origin, @POTUS #Constitution - Julianne Moore (@_juliannemoore) January 29, 2017\n\nActor Jessica Chastain pointed out that the history of the country has hinged on immigration.\n\nI'm a New Yorker. We are a city built by immigrants. Today is a sad day for America. 🗽 https://t.co/UkhfV6M5sv - Jessica Chastain (@jes_chastain) January 28, 2017\n\nWhile actor Nick Offerman didn't mince his words while expressing how he felt about the immigration ban.\n\nDear @realDonaldTrump ,\n\n\n\nShove it up your ass.\n\n\n\nSincerely,\n\n\n\nAmerica - Nick Offerman (@Nick_Offerman) January 29, 2017\n\nActor Mark Hamill used a single hashtag to show his feelings about the matter.\n\nVeep 's Julia Louis-Dreyfus used her acceptance speech at the SAG Awards as a platform for immigrants.\n\nFresh Off the Boat star Constance Wu took to Twitter to voice her opinion on the detainment of green card holders at airports.\n\nThis is an absolute atrocity. Devastating. Disgusting. And just fucking wrong. https://t.co/fZ0k4mnJPN - Constance Wu (@ConstanceWu) January 28, 2017\n\nThe Tipping Point author Malcom Gladwell relayed his own experience as an immigrant, post-immigration ban.\n\nI moved to America 32 years ago. Yesterday was the first day I felt ashamed to be part of this country. - Malcolm Gladwell (@Gladwell) January 28, 2017\n\nModel Chrissy Teigen has long been an outspoken critic of Trump and this occasion was no exception.\n\nDonald Trump is an unwell, evil human being. To the core. - christine teigen (@chrissyteigen) January 28, 2017\n\nSinger Cher showed her support of the protests about the immigration ban.\n\nMaking our Voices heard ALL OVER THE 🌎#RESIST💪🏻 pic.twitter.com/vRTUtzV1Pf - Cher (@cher) January 29, 2017\n\nFun. musician Jack Antonoff made a donation to the ACLU to support those affected by Trump's executive orders.\n\nstand with me for immigrants and the LGBTQ community. i will be matching donations to the @ACLU up to 20k. tweet me your donation receipts - jackantonoff (@jackantonoff) January 29, 2017\n\nThis Is Us ' Mandy Moore thanked the ACLU and protestors for the work that they did.\n\nEndless gratitude to the @ACLU and protestors for fighting the good fight and staying on the right side of history. #NoBanNoWall - Mandy Moore (@TheMandyMoore) January 29, 2017\n\nActor Mark Ruffalo tweeted about the many protests at airports across America.\n\nThe day the music died... ⚡️ “Protestors gather at New York's JFK Airport over refugee detainment”https://t.co/h8eyFmbAOs - Mark Ruffalo (@MarkRuffalo) January 28, 2017\n\nWhile pop star J. Lo wondered how immigrant became a \"bad word.\"\n\nHonestly I feel like we are in a nightmare right now!! In a country founded by immigrants how did immigrant become a bad word!!! #nobannowall #unitedwestand #nomuslimban #sayingnothingissayingsomething #standup #loveistheanswer A photo posted by Jennifer Lopez (@jlo) on Jan 29, 2017 at 12:20pm PST\n\nOne Tree Hill 's Sophia Bush encouraged her followers to continue protesting\n\nKEEP PROTESTING. Keep shouting. Keep defending. Keep resisting! #NoBanNoWall - Sophia Bush (@SophiaBush) January 29, 2017\n\nAnd actor Olivia Wilde showed her support for the protestors.\n\nI feel sick. So ashamed of our maniac-in-chief. And SO PROUD of our protesters. #RESIST - olivia wilde (@oliviawilde) January 29, 2017\n\nDirector Michael Moore offered apologies to those primarily affected by the immigration ban.\n\nTo our Muslim neighbors in the world: I & tens of millions of others are so very sorry. The majority of Americans did not vote 4 this man. - Michael Moore (@MMFlint) January 28, 2017\n\nWhile Designated Survivor 's Kal Penn chose to take the high road towards an Internet hater.\n\nTo the dude who said I don't belong in America, I started a fundraising page for Syrian Refugees in your name. https://t.co/NOR5P48fBi pic.twitter.com/jtJOsK9GrU - Kal Penn (@kalpenn) January 28, 2017\n\nFormer Punk'd host Ashton Kutcher took to his Twitter to speak about the policy.\n\nAs an American I respect my president but I do not respect this policy. #ABetterWay - ashton kutcher (@aplusk) January 30, 2017\n\nHappy Days star Scott Baio had alternative thoughts when it came to the issue.\n\nDear @Starbucks, why not hire unemployed Blacks, Hispanics, & Veterans? I'm genuinely interested in your reply. https://t.co/eL84mcDE4R - Scott Baio (@ScottBaio) January 30, 2017\n\nPolitical personality Sarah Palin also chimed in calling the backlash to the executive order, \"phony.\"\n\nMedia busted. Again.\n\n\n\nPhony baloney uproar over Trump's so-called 'immigration ban' while the silence is... https://t.co/3chceTGxQ9 - Sarah Palin (@SarahPalinUSA) January 29, 2017\n\nIn a now-deleted Instagram post, rapper Azealia Banks appeared to say she wanted Rihanna to \"shut up and sit down\" after the latter appeared to tweet her disapproval about Donald Trump's immigration ban, according to People .\n\nActor Jennifer Lawrence wrote on Facebook that \"someone's race and religion should never keep them in harm's way.\"\n\nActor Seth Rogen shared his family's story immigrating to the U.S. from Russia.\n\nOne of the many reasons I am opposed to the #MuslimBan is because my family immigrated to North America (🇨🇦🇺🇸) after fleeing wars in Russia. - Seth Rogen (@Sethrogen) January 29, 2017\n\nHidden Figures and Moonlight star Janelle Monae put her money where her mouth was.", "images": ["https://web.archive.org/web/20170131235603im_/https://timedotcom.files.wordpress.com/2017/01/celebrities-respond-donald-trump-muslim-ban.jpg?w=1100&quality=85", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://web.archive.org/web/20170131235603im_/https://timedotcom.files.wordpress.com/2017/01/celebrities-respond-donald-trump-muslim-ban.jpg?w=720"], "top_img": "https://web.archive.org/web/20170131235603im_/https://timedotcom.files.wordpress.com/2017/01/celebrities-respond-donald-trump-muslim-ban.jpg?w=720", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20170131235603/http://time.com/4653873/donald-trump-immigration-ban/", "title": "50 Celebrities React to Donald Trump's Immigration Order", "meta_data": {"description": "Celebrities are responding to Donald Trump's executive order preventing entry from seven countries, including Syria and Iraq.", "keywords": "Celebs immigration Ban, Celebrity responses to Donald Trump Immigration Ban, Celebs Twitter Muslims, Celebs Instagram Muslim Ban, Celebs protest muslim ban, Immigration Ban Donald Trump, Celebrities Immigration Ban", "news_keywords": "Celebs immigration Ban, Celebrity responses to Donald Trump Immigration Ban, Celebs Twitter Muslims, Celebs Instagram Muslim Ban, Celebs protest muslim ban, Immigration Ban Donald Trump, Celebrities Immigration Ban", "og": {"site_name": "Time", "type": "article", "locale": "en_US", "url": "https://web.archive.org/web/20170131235603/http://time.com/4653873/donald-trump-immigration-ban/", "title": "50 Celebrities React to Donald Trump's Immigration Order", "description": "From Barbra Streisand to Rihanna.", "image": "https://web.archive.org/web/20170131235603im_/https://timedotcom.files.wordpress.com/2017/01/celebrities-respond-donald-trump-muslim-ban.jpg?w=720"}, "author": "Cady Lang", "fb": {"app_id": 53177223193}, "twitter": {"site": "@TIME", "title": "50 Celebrities React to Donald Trump's Immigration Order", "description": "Here's how 50 celebrities responded to Donald Trump's immigration ban", "card": "summary_large_image"}, "article": {"author": "http://time.com/author/cady-lang/"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}