{"url": "https://en.wikipedia.org/wiki/The_Real_Housewives_of_New_Jersey", "text": "American reality television series\n\nThe Real Housewives of New Jersey, abbreviated RHONJ, is an American reality television series that premiered on May 12, 2009, on Bravo. Developed as the fourth installment of The Real Housewives franchise, it has aired fourteen seasons and focuses on the personal and professional lives of several women residing in the state of New Jersey, primarily in North Jersey.\n\nThe cast of the recent fourteenth season consists of Teresa Giudice, Melissa Gorga, Dolores Catania, Margaret Josephs, Jennifer Aydin, Danielle Cabral and Rachel Fuda, with former housewife Jackie Goldschneider and Jennifer Fessler serving as friends of the housewives. Previously featured cast members include original housewives Dina Cantin, Jacqueline Laurita, Caroline Manzo and Danielle Staub; and subsequent housewives Kathy Wakile, Teresa Aprea, Amber Marchese, Nicole Napolitano and Siggy Flicker.\n\nThe success of the show has resulted in the spin-offs Boys to Manzo, Manzo'd with Children, Teresa Checks In and Next Gen NYC.\n\nProduction\n\nSeasons 1–5\n\nThe Real Housewives of New Jersey was announced by Bravo on April 15, 2008.[1] The first season premiered on May 12, 2009, and starred Caroline Manzo, Jacqueline Laurita, Teresa Giudice, Dina Cantin and Danielle Staub with Dolores Catania as a friend of the housewives. For the first time in The Real Housewives franchise, the series followed cast members who are related to one another: sisters Caroline Manzo and Dina Cantin were at the time married to brothers Albert and Tommy Manzo, and Laurita is married to Caroline and Dina's brother, Chris Laurita.[2] Dina and Tommy Manzo would later end up separated.[3][4] The second season premiered on May 3, 2010, with Dina Manzo departing the series after the seventh episode.[5] Staub left the show after the second season.[6]\n\nThe third season premiered on May 16, 2011, with new housewives Melissa Gorga, Teresa Giudice's sister-in-law, and Kathy Wakile, Teresa's cousin. Kathy's sister, Rosie Pierri, appeared as a guest.[7] It delivered the highest rated season premiere in Bravo's history and the highest-rated season premiere in The Real Housewives franchise at the time.[8]\n\nThe fourth season premiered on April 22, 2012.[9] This season served as Dolores Catania's final season as a friend until Season 7 where she would become a main cast member. Dina Manzo appeared as a guest during the fourth season. The fifth season premiered on June 2, 2013.[10] Caroline Manzo and Laurita left the show after the fifth season.[11]\n\nSeasons 6–8\n\nThe sixth season premiered on July 13, 2014.[12] It featured the return of Dina Manzo as a full-time cast member and new cast members Amber Marchese, Teresa Aprea and Nicole Napolitano.[13] Wakile was demoted to a \"friend of the housewives\" role, while Laurita also appeared as a guest.[14][15][16] Aprea, Cantin and Napolitano left the show, while Marchese was fired after the sixth season.[17][18]\n\nLaurita returned as a full-time cast member in the seventh season, which premiered on July 10, 2016.[19] The season also featured Dolores Catania and Siggy Flicker as new cast members, Dolores Catania was a friend of the show for the first four seasons and was originally cast for the show in Season 1 but backed out for personal reasons. Kathy Wakile and Rosie Pierri appeared as \"friends of the housewives\".[20] Aprea and Napolitano also appeared as guests.[21][22] The season marked the final appearance of Laurita, Wakile and Pierri in the show.[23][24] Staub returned to the show as a \"friend of the housewives\" for the eighth season, which premiered on October 4, 2017. It also featured Margaret Josephs as the new cast member.[25] Flicker left the show afterwards.[26]\n\nSeasons 9–14\n\nThe ninth season premiered on November 7, 2018, with Jennifer Aydin and Jackie Goldschneider joining the cast and Staub returning as a friend.[27] The tenth season premiered on November 6, 2019.[28] The season marked Staub's final appearance, as she announced her resignation from the show for the second time in January 2020.[29]\n\nFilming for the eleventh season was postponed by Bravo in March 2020 due to the COVID-19 pandemic.[30] The eleventh season premiered on February 17, 2021.[31] The twelfth season premiered on February 1, 2022, with Traci Johnson added as a friend of the housewives.[32]\n\nThe thirteenth season premiered on February 7, 2023, with new full-time housewives Danielle Cabral and Rachel Fuda joining the cast, as well as Jennifer Fessler joining as a friend of the housewives, alongside former housewife Jackie Goldschneider.[33]\n\nThe fourteenth season premiered on May 5, 2024, with the entire cast from the thirteenth season returning.[34] In June 2024, it was reported that there would not be a traditional reunion for the fourteenth season, making this for the first time in the show’s history.[35]\n\nCast\n\nMain cast Cast member Seasons 1 2 3 4 5 6 7 8 9 10 11 12 13 14 Teresa Giudice Main Jacqueline Laurita Main Friend Main Caroline Manzo Main Dina Manzo Main Guest Main Danielle Staub Main Friend Melissa Gorga Guest Main Kathy Wakile Guest Main Friend Teresa Aprea Main Guest Amber Marchese Main Nicole Napolitano Main Guest Dolores Catania Guest Guest Main Siggy Flicker Main Margaret Josephs Main Jennifer Aydin Guest Main Jackie Goldschneider Main Friend Danielle Cabral Main Rachel Fuda Main Friends of the housewives Kim Granatell Friend Guest Kim DePaola Guest Friend Guest Jennifer Dalton Friend Rosie Pierri Guest Friend Traci Johnson Friend Guest Jennifer Fessler Guest Friend\n\nEpisodes\n\nThe Real Housewives of New Jersey episodes Season Episodes Originally released Average\n\nViewers\n\n(millions) First released Last released 1 10 May 12, 2009 ( ) July 9, 2009 ( 2009-07-09 ) 2.25 2 18 May 3, 2010 ( ) September 6, 2010 ( 2010-09-06 ) 2.74 3 21 May 16, 2011 ( ) October 23, 2011 ( 2011-10-23 ) 2.66 4 24 April 22, 2012 ( ) October 21, 2012 ( 2012-10-21 ) 2.66 5 22 June 2, 2013 ( ) October 20, 2013 ( 2013-10-20 ) 2.29 6 19 July 13, 2014 ( ) November 20, 2014 ( 2014-11-20 ) 1.86 7 18 July 10, 2016 ( ) November 13, 2016 ( 2016-11-13 ) 1.54 8 16 October 4, 2017 ( ) January 31, 2018 ( 2018-01-31 ) 1.24 9 18 November 7, 2018 ( ) March 6, 2019 ( 2019-03-06 ) 1.22 10 19 November 6, 2019 ( ) March 18, 2020 ( 2020-03-18 ) 1.18 11 15 February 17, 2021 ( ) May 26, 2021 ( 2021-05-26 ) 1.05 12 16 February 1, 2022 ( ) May 17, 2022 ( 2022-05-17 ) 1.04 13 19 February 7, 2023 ( ) June 13, 2023 ( 2023-06-13 ) 0.93 14 14 May 5, 2024 ( ) August 11, 2024 ( 2024-08-11 ) 0.73\n\nBroadcast history\n\nThe Real Housewives of New Jersey airs regularly on Bravo in the United States;[36] most episodes are approximately forty-two minutes in length,[37] and are broadcast in standard definition and high definition.[38] Since its premiere, the series has alternated airing on Monday, Tuesday, Wednesday, Thursday, and Sunday evenings and has been frequently shifted between the 8:00, 9:00, and 10:00 PM timeslots.[36]\n\nSpin-offs\n\nThe series' success has resulted in a development of spin-off series. Caroline Manzo's sons, Albie and Chris, had a web series spin-off alongside their roommate and friend Greg Bennett, Boys to Manzo, which premiered on May 30, 2011.[39][40] Caroline Manzo moved on from the original show to her own spin-off, Manzo'd with Children,[41][42] which premiered on October 5, 2014, on Bravo.[43] It featured her daily life with her husband, sons and daughter[44] and lasted for three seasons.[45]\n\nIn October 2015, a three episode spin-off, Teresa Checks In, premiered. It followed the life of the Giudice family during Teresa's incarceration, including her nearly daily phone calls from prison, and featured Melissa Gorga and her husband, Joe, and Rosie Pierri.[46][47]\n\nIn December 2018, an after-show featuring season 9's cast was released online through Bravo.com and YouTube. It featured their reactions to the most recent episode and thoughts on the season.[48] An after-show for the tenth season started streaming online on December 11, 2019.[49]\n\nGiudice and Melissa Gorga starred in the first season of the Peacock spin-off, The Real Housewives Ultimate Girls Trip. They traveled to Turks and Caicos alongside several other Housewives cast members from other cities.[50][51]\n\nTeresa Gets Married, featuring the August 2022 nuptials of Giudice and Luis \"Louie\" Ruelas, aired on Bravo on May 23, 2023.[52]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Teresa_Giudice_at_New_York_Fashion_Week_2016.jpg/120px-Teresa_Giudice_at_New_York_Fashion_Week_2016.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Gay_Pride_2010_-_62_%284742424568%29.jpg/250px-Gay_Pride_2010_-_62_%284742424568%29.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Danielle_Staub.jpg/250px-Danielle_Staub.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Dolores_Catania.jpg/120px-Dolores_Catania.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a0/THE_REAL_HOUSEWIVES_OF_NEW_JERSEY_UPDATED_LOGO.png/250px-THE_REAL_HOUSEWIVES_OF_NEW_JERSEY_UPDATED_LOGO.png", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/40px-Blank_television_set.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Melissa_Gorga_at_New_York_Fashion_Week_2016.jpg/250px-Melissa_Gorga_at_New_York_Fashion_Week_2016.jpg", "https://upload.wikimedia.org/wikipedia/en/a/a0/THE_REAL_HOUSEWIVES_OF_NEW_JERSEY_UPDATED_LOGO.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Siggy_Flicker.jpg/120px-Siggy_Flicker.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/a/a0/THE_REAL_HOUSEWIVES_OF_NEW_JERSEY_UPDATED_LOGO.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Real_Housewives_of_New_Jersey", "title": "The Real Housewives of New Jersey", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/a/a0/THE_REAL_HOUSEWIVES_OF_NEW_JERSEY_UPDATED_LOGO.png", "width": 1200, "height": 464}, "title": "The Real Housewives of New Jersey - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}