{"url": "https://www.independent.co.uk/life-style/fashion/met-gala-best-worst-outfits-red-carpet-a8340586.html", "text": "Your support helps us to tell the story Read more Support Now From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it's investigating the financials of Elon Musk's pro-Trump PAC or producing our latest documentary, 'The A Word', which shines a light on the American women fighting for reproductive rights, we know how important it is to parse out the facts from the messaging. At such a critical moment in US history, we need reporters on the ground. Your donation allows us to keep sending journalists to speak to both sides of the story. The Independent is trusted by Americans across the entire political spectrum. And unlike many other quality news outlets, we choose not to lock Americans out of our reporting and analysis with paywalls. We believe quality journalism should be available to everyone, paid for by those who can afford it. Your support makes all the difference. Read more\n\nThe annual Met Gala is one of the biggest fashion events of the year, and this year’s outfits did not disappoint.\n\nIncorporating the theme Heavenly Bodies: Fashion and the Catholic Imagination, the event's most controversial theme to date, the A-list used this year’s red carpet to show off their most sacred looks.\n\nWith crowns, crosses, and wings, the 2018 Met Gala red carpet was full of over-the-top ensembles that combined high-fashion and religion.\n\nThese are the best and worst-dressed from the 2018 Met Gala.\n\nThe best:\n\nFor many of the A-listers, a spot on the best-dressed list required some commitment to the theme. These included Jennifer Lopez, who sparkled in Balmain and flirted with boyfriend Alex Rodriguez, Rihanna, who took papal-chic to a whole new level, and Katy Perry, whose extravagant angel wings only added to the appeal of her ensemble.\n\nopen image in gallery Rihanna stunned in her Pope-inspired ensemble (Getty)\n\nSZA stood out in a pale-pink gown with a gold bodice, and a heavenly-inspired gold halo, as did Kim Kardashian West in a Versace gold-sequined gown adorned with crosses and Gigi Hadid in Versace.\n\nAlso on the best-dressed list were Ariana Grande in Vera Wang, Amber Heard, who turned heads in a stunning red gown, and Priyanka Chopra in a Ralph Lauren red velvet dress and gold chain-mail headdress.\n\nopen image in gallery Priyanka Chopra on the red carpet (Getty)\n\nBut, as with any red carpet, there are some ensembles that just don't come together.\n\nAt the Met Gala, the fashion stakes are especially high - and this year, some celebrities fell flat.\n\nThe worst:\n\nThis year's worst-dressed were mostly those who didn't incorporate the heavenly theme into their outfits - or did so to disastrous outcomes.\n\nKylie Jenner left viewers unimpressed with her secular ensemble, opting for a simple black gown and sunglasses indoors. Sister Kendall Jenner made the list as well.\n\nSarah Jessica Parker's Dolce & Gabbana ensemble captured attention, but not necessarily for the right reasons. Featuring an over-the-top gold headpiece and equally busy dress, the usually-fashionable actress's outfit was a lot to take in.\n\nopen image in gallery Sarah Jessica Parker on the red carpet (Getty)\n\nScarlett Johansson looked beautiful, but her outfit was forgettable, as it had nothing to do with the theme. The same was true for Miley Cyrus, whose daring low-cut satin gown would have been better suited for a different red carpet.\n\nAnd Amal Clooney's outfit of flowers paired with pants by Richard Quin was gorgeous - but the co-host of the event didn't bring the dazzle that one expects from outfits at the Met Gala.\n\nOverall, this year's Met Gala, filled with extravagant headpieces and lots of gold, was one to remember.\n\nAs exhibition curator Andrew Bolton said of the theme: \"Dress is central to any discussion about religion.\"", "images": ["https://static.the-independent.com/s3fs-public/thumbnails/image/2018/05/08/01/gettyimages-955753502.jpg", "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/05/08/04/gettyimages-955786986.jpg", "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/05/08/04/gettyimages-955798338.jpg?width=1200&height=800&crop=1200:800", "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/05/08/04/gettyimages-955789388.jpg"], "top_img": "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/05/08/04/gettyimages-955798338.jpg?width=1200&height=800&crop=1200:800", "keywords": [], "authors": [], "canonical_link": "https://www.independent.co.uk/life-style/fashion/met-gala-best-worst-outfits-red-carpet-a8340586.html", "title": "Met Gala 2018: Best-dressed guests on the red carpet, from Rihanna to Katy Perry", "meta_data": {"robots": "max-image-preview:large,max-video-preview:-1", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "Fashion", "sitename": "The Independent", "page path": "/life-style/fashion", "page type": "Article", "adPageType": "Article Page", "description": "Some celebrities stunned while others blended into the background", "og": {"updated_time": "2018-05-08T11:30:16.000Z", "site_name": "The Independent", "title": "The best and worst dressed on the Met Gala red carpet", "url": "https://www.the-independent.com/life-style/fashion/met-gala-best-worst-outfits-red-carpet-a8340586.html", "type": "article", "description": "Some celebrities stunned while others blended into the background", "image": {"identifier": "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/05/08/04/gettyimages-955798338.jpg?width=1200&height=800&crop=1200:800", "secure_url": "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/05/08/04/gettyimages-955798338.jpg?width=1200&height=800&crop=1200:800"}, "locale": "en_US"}, "article": {"published_time": "2018-05-08T11:30:16.000Z", "modified_time": "2018-05-08T11:30:16.000Z", "section": "Lifestyle", "subsection": "Fashion", "author_name": "Chelsea Ritschel, Sarah Jones", "content_type": "story", "word_count": 502, "image_count": 4, "embed_count": 2, "video_count": 1, "internal_link_count": 0, "external_link_count": 0}, "date": "2018-05-08T11:30:16.000Z", "viewport": "width=device-width,initial-scale=1,minimum-scale=1", "theme-color": "#919191", "indy-test-internal-article-helmet": "indy", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "twitter": {"title": "The best and worst dressed on the Met Gala red carpet", "site": "@Independent", "card": "summary_large_image", "description": "Some celebrities stunned while others blended into the background", "image": "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/05/08/04/gettyimages-955798338.jpg?width=1200&height=800&crop=1200:800"}, "keywords": "[\"Met Gala\",\"Red carpet\",\"best-dressed\",\"Internal\"]"}, "movies": [], "publish_date": 1525779016.0, "source": "https://www.independent.co.uk", "summary": ""}