{"url": "https://en.wikipedia.org/wiki/Pippa_Middleton", "text": "British socialite and author (born 1983)\n\nPhilippa Charlotte Matthews[3] (née Middleton; born 6 September 1983) is a British socialite, author and columnist. She is the younger sister of Catherine, Princess of Wales.\n\nBorn in Reading, Berkshire and raised in Bucklebury, Middleton attended Marlborough College before graduating with a degree in English literature from the University of Edinburgh. She subsequently worked in public relations and event management firms, later joining the party supply company owned by her parents, Michael and Carole Middleton. Middleton garnered media attention during her sister's relationship with Prince William, particularly for her appearance at their wedding in 2011. She has written two books, Celebrate: A Year of Festivities for Families and Friends and Heartfelt: Over 100 Quick and Easy Recipes for a Healthy Heart, and contributed columns to both Vanity Fair and The Sunday Telegraph.\n\nIn 2017 Middleton married James Matthews, a hedge fund manager, former racing driver, and heir apparent to the lairdship of Glen Affric. The couple have three children. As the wife of the heir of Glen Affric, Middleton is accorded the title Mrs. Glen Affric the Younger in Scotland.\n\nEarly life and education [ edit ]\n\nPhilippa Charlotte Middleton was born on 6 September 1983 at the Royal Berkshire Hospital in Reading, Berkshire, England.[4] She is the second of three children born to Michael (born 1949), a former British Airways flight dispatcher, and Carole Middleton (née Goldsmith; born 1955), a former flight attendant.[5][6] Her father is a member of a wealthy family from Yorkshire linked to the British aristocracy.[7] Her mother descends from labourers and coal miners from County Durham.[7] She was christened at St Andrew's Bradfield, Berkshire.[8] The family resided in Bradfield Southend.[9] Matthews has an elder sister, Catherine, Princess of Wales, and a younger brother, James.[9]\n\nThe Middletons moved to Amman, Jordan in May 1984, where her father worked for British Airways, before returning to Berkshire in September 1986.[7] In 1987, Middleton's mother founded Party Pieces, a mail-order party supply company.[7][10] In 1995, her family moved to Bucklebury Manor in the village of Bucklebury.[11][12] Middleton was first educated at St Andrew's School, a private boarding school in Pangbourne and then Downe House School, a girls' day and boarding school in Cold Ash. She was a boarder at Marlborough College, where she held a sports/all-rounder scholarship.[13][14] Middleton then graduated from the University of Edinburgh with an undergraduate MA in English literature.[15] She shared a house with Lord Edward Innes-Ker, a son of the Duke of Roxburghe, and with Earl Percy, heir apparent of the Duke of Northumberland.[15]\n\nIn 2022, Middleton earned her postgraduate master's degree in Physical Education, Sport and Physical Literacy from University of Wales Trinity Saint David.[16]\n\nCareer [ edit ]\n\nFollowing her graduation, Middleton briefly worked in 2008 at a public relations firm promoting luxury products. She then had an events management job with Table Talk, a company based in London that organises corporate events and parties.[13][17] In 2008 Tatler magazine named Middleton \"the Number 1 Society Singleton\", ahead of singer-songwriter James Blunt and Princess Eugenie of York,[18] although in the same Tatler article she was described as someone who \"goes to a lot of parties, but mainly as the caterer.\" Since then, she has often been described as a socialite.[19] As part of a duo with her elder sister, Middleton has received wide press coverage, focusing on her social life and her lifestyle. In April 2012, Time magazine listed Middleton as one of the 100 Most Influential People in the World.[20]\n\nMiddleton worked part-time for her parents' company Party Pieces, editing the web magazine Party Times.[13][21] Penguin Books paid Middleton a £400,000 advance for a book on party planning. The book, entitled Celebrate, was published in autumn 2012, and had lower than anticipated sales as many reviewers mocked it for the obviousness of its content.[22][23] In March 2013, Middleton parted from her literary agent.[24]\n\nMiddleton was also a regular columnist for several publications. She has contributed articles to The Spectator magazine since December 2012[25] and began having a food column in the supermarket magazine Waitrose Kitchen beginning in spring 2013.[26] In June 2013 she was named a contributing editor of Vanity Fair. She went on to write a series of columns for the magazine.[27] Beginning in September 2013, Middleton also wrote a fortnightly sports and social column for The Sunday Telegraph.[28] Middleton discontinued writing for The Telegraph in May 2014.[29]\n\nIn May 2013, she became the sole director and shareholder of PXM Enterprises Limited.[30] The company was headquartered at 19 Portland Place in London.[30] Middleton closed the company down in mid-2017.[31]\n\nPhilanthropy [ edit ]\n\nIn April 2013, Middleton became an ambassador to the Mary Hare School for deaf children in Berkshire.[32] In June 2014, Middleton became an ambassador to the British Heart Foundation (BHF).[33] That month, she took part in the Race Across America, a 3,000 mile cycling race across the United States, followed by the Bosphorus Cross-Continental Swimming Race, a 6.5 km swimming competition in Istanbul, as two fundraising opportunities for the BHF.[33] Her bicycle was also auctioned on eBay for the BHF.[33] She then attended the BHF's Roll out the Red Ball at the Park Lane Hotel on 10 February 2015.[34] She auctioned one of her L.K.Bennett dresses at the ball.[35]\n\nIn June 2015, she collaborated with the British brand Tabitha Webb on designing a floral pink dress and a lightweight scarf, with the proceeds from selling the items donated to the BHF.[36] She took part in the London to Brighton Bike Ride for the BHF on 21 June 2015. In September 2015, Middleton participated in a 47-mile swim-run competition in Sweden alongside her brother and her future husband, James Matthews, to raise money for the Michael Matthews Foundation, a charity founded in honour of Matthews' brother who died descending from the peak of Everest.[37] In September 2016, Middleton released her second book, Heartfelt, whose proceeds go to the British Heart Foundation.[38]\n\nPersonal life [ edit ]\n\nMiddleton stands with the royal family as maid of honour at the wedding of her sister to Prince William, with Prince Philip in the background\n\nMiddleton served as the maid of honour at her sister Catherine's wedding in 2011 to Prince William.[39] At the wedding, Middleton's dress, which was created by Sarah Burton of Alexander McQueen, who also created the bride's dress, was highly praised in the media. Made of ivory crêpe fabric, it was styled with a cowl at the front and organza-covered buttons at the back. Copies of the dress were soon available on the High Street[40][41] where there was a great demand for them.[42][43][44] Similar to her sister, Middleton was reported to have had her own effect in sales of particular products and brands, a trend which was referred to as the \"Pippa Middleton effect\".[45][46][47]\n\nIn April 2011, the Middleton family contacted the Press Complaints Commission (PCC) to complain about Pippa and her mother facing \"harassment\" by photographers.[48] The PCC contacted newspaper editors with an advisory notice to remind them of their ethical obligations.[49] In May 2011, the family complained to the PCC after photographs of Pippa Middleton, her sister, and their mother in bikinis while on holiday in 2006 on board a yacht off Ibiza were published in the Mail on Sunday, Daily Mail, News of the World, and Daily Mirror.[50] One of the photographs showed Pippa Middleton topless, which prompted the family to complain about newspapers breaching the editors' code of practice by invading their privacy.[50] In September 2011, Daily Mail, the Mail on Sunday, and Daily Mirror all agreed to have the images removed from their website and never publish them again following a deal negotiated by the Press Complaints Commission.[51] In September 2016, Middleton's iPhone was hacked. The Sun reported it had been approached by a hacker who claimed to have 3,000 images from her iCloud account and demanded £50,000 for them. The hacker was arrested that same month.[52]\n\nIn July 2016, in the Lake District, Middleton became engaged to James Matthews, a hedge fund manager who is a former professional racing driver. The couple married on 20 May 2017 at St Mark's Church, at Englefield Estate, Berkshire, near Bucklebury Manor, the Middleton family home.[53] James Matthews' father is Laird of Glen Affric, a 10,000 acre estate in Scotland. Pippa will acquire the title Lady Glen Affric upon her husband's inheritance of the lairdship. Presently, she can use the courtesy title \"Mrs Matthews of Glen Affric the Younger\".[54][55][56][57]\n\nPippa and James have three children: Arthur Michael William, born on 15 October 2018, Grace Elizabeth Jane, on 15 March 2021, and Rose Louise Victoria, 20 June 2022.[58][59][60][61][62] The family lives on the Barton Court estate on the banks of the River Kennet near the village of Kintbury, West Berkshire.[63]\n\nArms [ edit ]\n\nCoat of arms of Pippa Middleton Notes Matthews bears her father's arms on a lozenge. Escutcheon Per pale Azure and Gules, a chevron Or, cotised Argent, between three acorns slipped and leaved Or (Middleton). Symbolism The dividing line (between two colours) down the centre is a canting of the name 'Middle-ton'. The acorns (from the oak tree) are a traditional symbol of England and a feature of west Berkshire, where the family lived. The three acorns also denote the family's three children. The gold chevron in the centre of the arms is an allusion to Carole Middleton's maiden name of Goldsmith. The two white chevronels (narrow chevrons above and below the gold chevron) symbolise peaks and mountains, and the family's love of the Lake District and skiing. [ 64 ]\n\nBibliography [ edit ]\n\nMiddleton, Pippa; Loftus, David; Heeley, Gill (2012). Celebrate: A Year of Festivities for Families and Friends . Michael Joseph. ISBN 9780718176785 .\n\nMiddleton, Pippa (2016). Heartfelt. British Heart Foundation. ISBN 9781899088874 .", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Pippa_Middleton.jpg/250px-Pippa_Middleton.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Pippa_Middleton.jpg/960px-Pippa_Middleton.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Pippa_Middleton_Prince_Philip.jpg/250px-Pippa_Middleton_Prince_Philip.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Coat_of_Arms_of_Kate_Middleton.svg/250px-Coat_of_Arms_of_Kate_Middleton.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Pippa_Middleton.jpg/960px-Pippa_Middleton.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Pippa_Middleton", "title": "Pippa Middleton", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Pippa_Middleton.jpg/960px-Pippa_Middleton.jpg", "width": 663, "height": 1200}, "title": "Pippa Middleton - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}