{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/peter-facinelli-net-worth/", "text": "What is Peter Facinelli's Net Worth?\n\nPeter Facinelli is an actor and producer who has a net worth of $8 million. Peter Facinelli has appeared in films and television shows such as the \"Twilight\" series, \"Can't Hardly Wait,\" and \"Nurse Jackie,\" among others.\n\nEarly Life\n\nFacinelli was born on November 26, 1973, in Ozone Park, Queens, New York. He is the son of Italian immigrants Bruna and Pierino Facinelli. His mother primarily stayed at home while his father worked as a waiter. His parents were originally from the Val di Non valley in Trentino, Northern Italy, and were devout Catholics who raised their son in the church as well. Facinelli attended St. Francis Preparatory School in Fresh Meadows, New York. He developed an interest in acting during his teen years and decided to study it in college. He attended New York University, where he studied the craft, as well as the Atlantic Theater Company Acting School in New York City. Some of his acting teachers included William H. Macy, Felicity Huffman, Giancarlo Esposito, and Camryn Manheim.\n\nCareer\n\nAfter several years of training and auditioning, Facinelli made his feature film debut in Rebecca Miller's \"Angela\" in 1995. The same year, he received favorable critical reviews for his role in the made-for-television movie, \"The Price of Love.\" In 1996, Facinelli starred opposite who would become his future wife, Jennie Garth, in \"An Unfinished Affair.\" The same year, he appeared in \"After Jimmy\" and \"Calm at Sunset.\" In 1997, he starred in the AIDS-themed drama \"Touch Me\" along with Amanda Peet and Michael Vartan.\n\nIn 1998, he booked two roles that required him to portray that of a high school student. He appeared in \"Dancer, Texas Pop. 81\" and \"Can't Hardly Wait,\" which starred Jennifer Love Hewitt. In 2000, he appeared in the sci-fi film \"Supernova\" opposite James Spader. He also made appearances in \"Riding in Cars with Boys\" in 2001 and \"The Scorpion King\" in 2002. The same year, he booked one of his largest roles to date in the show \"Fastlane.\" As the main star, he appeared in 22 episodes from 2002 until 2003. He then booked a recurring role in \"Six Feet Under\" from 2004 until 2005. He also landed a number of film roles in \"Enfants terrible,\" \"The Lather Effect,\" \"Hollow Man 2,\" and \"Arc.\" In 2006, he was also cast in \"Touch the Top of the World,\" the true story of the first blind person to climb Mount Everest.\n\nIn 2007, Facinelli booked a recurring role in \"Damages.\" He also booked his biggest movie role to date when he was cast as Dr. Carlisle Cullen in \"Twilight\" in 2008. The film was a huge hit, and Facinelli reprised his role in the four subsequent sequels – \"The Twilight Saga: New Moon,\" \"The Twilight Saga: Eclipse,\" \"The Twilight Saga: Breaking Dawn – Part 1,\" and \"The Twilight Saga: Breaking Dawn – Part 2\" from 2009 to 2012. Meanwhile, he also booked one of his biggest television roles to date when he was cast as Dr. Fitch Cooper in \"Nurse Jackie.\" Over the series' seven seasons, he appeared in 73 episodes before the show concluded in 2015.\n\nIn 2015, Facinelli landed a main role in \"American Odyssey.\" He also booked a recurring role in \"Supergirl\" the same year, appearing in 14 episodes from 2015 to 2016. In 2017, he booked a recurring role on \"S.W.A.T.\" In 2019, he portrayed cult leader Keith Raniere in the television film \"Escaping the NXIVM Cult: A Mother's Fight to Save Her Daughter.\"\n\nIn addition to acting, Facinelli also works as a film producer. He founded the production company Facinelli Films, which produced its first feature film, \"Loosies,\" in 2011. The film was written entirely by Facinelli. He also wrote and produced a film for the Hallmark Channel called \"Accidentally in Love.\" The film starred his then-wife, Jennie Garth. In 2020, he starred in, directed, wrote, and produced the film \"The Vanished – Hour of Lead.\" Facinelli has also lent his writing skills to novels and co-wrote \"After the Red Rain\" in 2015 along with Barry Lyga and Robert DeFranco.\n\nPersonal Life\n\nIn 1995, Facinelli met actress Jennie Garth on the set of \"An Unfinished Affair.\" The two began dating and then got married on January 20, 2001, in a traditional Catholic ceremony. Together, they had three daughters together. However, their marriage ultimately did not last, and Facinelli filed for divorce from Garth in March 2012. The divorce was finalized in June of 2013.\n\nAround this time, Facinelli began dating actress Jaimie Alexander. The two had met on the set of \"Loosies.\" After three years of dating, the couple became engaged in March 2015. However, in February 2016, the two announced that they had decided to end their engagement. In 2019, he began dating Lily Anne Harrison, who is 16 years younger than him. The couple got engaged in January of 2020.\n\nFacinelli remains a practicing Catholic. He also was able to acquire his Italian citizenship through the citizenship of his parents. He did so in 2009 in order to participate in a film shoot in Europe, which required all of the actors to be European citizens.", "images": ["https://vz.cnwimg.com/thm/1JoH3482haSLevnlEMdqhrz36y0=/132x132/center/top/filters:format(webp)/2009/11/George-Clooney.jpg", "https://vz.cnwimg.com/thm/tD5RIJ_duSOCVOJjemPa19BXnkM=/132x132/center/top/filters:format(webp)/2020/09/Cameron-Bright.jpg", "https://vz.cnwimg.com/thm/I4dSiTJhq0kprSuO--deoPCEAmQ=/132x132/center/top/filters:format(webp)/2020/06/taylor.png", "https://vz.cnwimg.com/thm/uRsxoLs7Ymmit5ATgRtN2utad40=/221x5:381x236/132x132/filters:format(webp):strip_exif()/2009/09/P-Diddy.jpg", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "https://vz.cnwimg.com/thm/czDgrO8IQZfeOrkmbycOuyDu-SA=/132x132/center/top/filters:format(webp)/2014/08/GettyImages-823359146.jpg", "https://vz.cnwimg.com/thm/mKOvxJYc7yzpc9IhUbX61C1WGQ8=/132x132/center/top/filters:format(webp)/2019/03/mw.jpg", "https://vz.cnwimg.com/thm/0dOqT2nlNQM7u_J-5xWrCsf2nAw=/132x132/center/top/filters:format(webp)/2020/02/Angelina-Jolie.png", "https://vz.cnwimg.com/thm/_hOmdPz8Ht24ZxIeZM7m4mGRouk=/132x132/center/top/filters:format(webp)/2019/11/GettyImages-1094653148.jpg", "https://vz.cnwimg.com/thm/2mMapPHjDHorR212GHmvkBBkKgQ=/132x132/center/top/filters:format(webp)/2010/08/Jennie-Garth-1.jpg", "https://vz.cnwimg.com/thm/Y14fttV9jls9mxFLuNAHJTnNWTE=/132x132/center/top/filters:format(webp)/2019/10/denzel-washington-1.jpg", "https://vz.cnwimg.com/wp-content/uploads/2010/12/Peter-Facinelli.jpg?x46379", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/thm/lt1abKKVHSBtY-US0k9GLU9MTmM=/132x132/center/top/filters:format(webp)/2009/09/Brad-Pitt.jpg", "https://vz.cnwimg.com/thm/vxEpU5XoP45VnSH2CseXR75xxuY=/600x300/center/top/filters:format(webp)/2010/12/Peter-Facinelli.jpg", "https://vz.cnwimg.com/thm/df8BDObX3NHInM-PECrFNTc-J1g=/132x132/center/top/filters:format(webp)/2017/02/Christopher-Heyerdahl.jpg", "https://vz.cnwimg.com/thm/IoWqGPmFDjvC6iTqcDsspXBuxqo=/132x132/center/top/filters:format(webp)/2018/03/GettyImages-821622848.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/thm/UxnQSql1h0QyX1CgkPqKhTxCTHM=/132x132/center/top/filters:format(webp)/2009/09/Jennifer-Aniston.jpg", "https://vz.cnwimg.com/thm/95i5RI1LWkjHyyoolMeto-z_WeU=/132x132/center/top/filters:format(webp)/2020/01/lopez3.jpg", "https://vz.cnwimg.com/thm/KFAqJ9F4o80l6an2fe78-0jw28s=/132x132/center/top/filters:format(webp)/2019/04/rr.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2010/12/Peter-Facinelli.jpg?x46379", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/peter-facinelli-net-worth/", "title": "Peter Facinelli Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Peter Facinelli net worth: Peter Facinelli is an actor and producer who has a net worth of $8 million. Peter Facinelli has appeared in films and television shows such as the “Twilight” series, “Can’t Hardly Wait,” and “Nurse Jackie,” among others.", "slick": {"wpversion": "3.0.1", "wppostid": 12903, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2010/12/Peter-Facinelli.jpg?x46379", "group": "post", "category": "actors:Actors"}, ";": "richest-celebrities:Richest Celebrities", "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "cnw": {"wppostid": 12903}, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Peter Facinelli Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/peter-facinelli-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/12/Peter-Facinelli.jpg?x46379", "site_name": "Celebrity Net Worth", "description": "What is Peter Facinelli's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2024-04-30T15:47:06+00:00", "published_time": "2022-08-27T02:18:59+00:00", "section": "Actors", "tag": "twilight actors salaries"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/12/Peter-Facinelli.jpg?x46379", "title": "Peter Facinelli Net Worth", "description": "Peter Facinelli net worth: Peter Facinelli is an actor and producer who has a net worth of $8 million. Peter Facinelli has appeared in films and television shows such as the \"Twilight\" series, \"Can't"}}, "movies": [], "publish_date": 1661566739.0, "source": "https://www.celebritynetworth.com", "summary": ""}