{"url": "www.manchestereveningnews.co.uk/news/showbiz-news/where-is-taylor-swift-staying-14758248", "text": "Taylor Swift has booked out an entire city centre hotel ahead of her Manchester gigs\n\nPop superstar Taylor Swift has booked out the plush five star hotel for a whole week as she prepares for Manchester Stadium gigs\n\nPop superstar Taylor Swift will have plenty of room to Shake It Off while in Manchester for her huge stadium gigs this weekend - after booking out an ENTIRE city centre hotel for the week.\n\n‌\n\n\n\nTaylor’s team have had the five star Lowry Hotel in Salford booked out since Sunday ahead of her concerts at the Etihad Stadium this weekend.\n\n‌\n\n\n\nIt is understood Taylor will fly into the city today, but many of her crew and entourage have already set up base at the hotel this week ready for her anticipated arrival this afternoon.\n\n‌\n\n\n\nView 6 Images Taylor Swift is on her way to Manchester\n\nIt has been widely known on the city’s hotel circuit that Taylor’s team had booked out the entire 165-room Lowry Hotel this week.\n\nNot least because it has caused something of a headache for other visiting VIPs and superstars jetting in to the city.\n\n‌\n\n\n\nThat includes the host of sporting superstars and celebrities lining up for the big Soccer Aid match taking place at Old Trafford on Sunday, music megastars at Parklife, and the big fight at Manchester Arena as Tyson Fury returns to the ring.\n\nThe Soccer Aid teams have always traditionally stayed at The Lowry Hotel, as it is the preferred venue for Manchester United.\n\nView 6 Images The Lowry Hotel, Salford, a five star hotel loved by A List stars (Image: Matthew Stansfield)\n\n‌\n\n\n\nBut this year the stars taking part in the charity football match, who include sprint legend Usain Bolt and Take That’s Robbie Williams, are all understood to be checking into the Hilton Hotel on Deansgate instead.\n\nThere are also a huge raft of music stars heading to the city to perform at the Parklife Festival at Heaton Park - including N*E*R*D star Pharrell Williams and rock ‘n’ roll star Liam Gallagher - who have been known to stay at The Lowry on previous visits, but will have secured alternative accommodation.\n\nView 6 Images Pharrell Williams' band N.E.R.D and Liam Gallagher are among this year's Parklife headliners\n\n‌\n\n\n\nManchester’s other five star hotels, Hotel Gotham on King Street and the Radisson Blu Edwardian on Peter Street, are expected to be at capacity over the weekend.\n\nIt’s not known how much it costs to book out the entire Lowry Hotel for exclusive use.\n\nBehind closed doors as Manchester Evening News journalists reveal what home means to them READ MORE :\n\nBut rooms start at £169 a night, rising up to £4,000 a night for top room at the hotel - the luxurious Presidential Suite, which comes complete with a baby grand piano.\n\n‌\n\n\n\nView 6 Images Inside a Riverside Suite in The Lowry Hotel, Manchester. (Image: Publicity Picture)\n\nTaylor heads to Manchester to perform on her ongoing Reputation world tour, kicking off at the Etihad Stadium tonight, with a second gig on Saturday night.\n\nKnown for her global hits including Shake It Off, Ready for It, Blank Space and Bad Blood, 100,000 fans are expected to catch the show over the weekend.\n\n‌\n\n\n\nView 6 Images Taylor Swift at the BBC's The Biggest Weekend\n\nShe will have an extensive crew of dancers and musicians for the high-energy show, but the hotel rooms are also thought to have been booked out for use for others associated with the tour including marketing and PR.\n\nThe Lowry hotel’s restaurant and bar remains open to the public.\n\n‌\n\n\n\nMore than 300,000 revellers are expected in the city over the bumper weekend of events taking place across the city.\n\nGet ready for Manchester's EPIC June 2018 READ MORE :\n\nMeanwhile Taylor's fans are getting excited about her arrival in the UK - especially after she posted a sweet Instagram post yesterday.\n\nView 6 Images Taylor Swift's Instagram post about Manchester (Image: Instagram/Taylor Swift)\n\n‌\n\n\n\nPosing with her furry cat, Taylor said: \"Just over here daydreaming about playing Manchester tomorrow....\"\n\nWell, dream no more Taylor, the day has dawned!\n\nGot a story or an issue you want us to investigate? Want to tell us about something going on where you live? Let us know - in complete confidence - by emailing newsdesk@men-news.co.uk, calling us on 0161 211 2323, tweeting us @MENnewsdesk or messaging us on our Facebook page .\n\nArticle continues below\n\nYou can also send us a story tip using the form here . Join the Manchester Evening News breaking news Facebook group for a place to read and talk about breaking news in Greater Manchester.", "images": ["https://i2-prod.manchestereveningnews.co.uk/article14120328.ece/ALTERNATES/s615b/Inside-The-Lowry-Hotel.jpg", "http://www.manchestereveningnews.co.uk/nav-web-static/release-v41-14493b7c888038a7d89b99cb3a7937c2b71eaebe/public/logo-reach.png", "https://i2-prod.manchestereveningnews.co.uk/article14758250.ece/ALTERNATES/s615b/Atay.jpg", "http://www.manchestereveningnews.co.uk/assets/men/logos/masthead-men-default.svg", "https://i2-prod.manchestereveningnews.co.uk/article14758753.ece/ALTERNATES/s615b/TayInstaJPG.jpg", "https://i2-prod.manchestereveningnews.co.uk/article14223681.ece/ALTERNATES/s615b/Untitled-design-1.jpg", "https://i2-prod.manchestereveningnews.co.uk/article14754120.ece/ALTERNATES/s615b/JS153064617.jpg", "https://i2-prod.manchestereveningnews.co.uk/article14120314.ece/ALTERNATES/s615b/0_Riverside-Suite-in-The-Lowry-Hotel-Manchester.jpg", "https://i2-prod.manchestereveningnews.co.uk/article14760088.ece/ALTERNATES/s1200/JS153104665.jpg", "http://www.manchestereveningnews.co.uk/footer/trust-project.svg", "http://www.manchestereveningnews.co.uk/footer/ipso.svg"], "top_img": "https://i2-prod.manchestereveningnews.co.uk/article14760088.ece/ALTERNATES/s1200/JS153104665.jpg", "keywords": [], "authors": ["Dianne Bourne", "Updated"], "canonical_link": "https://www.manchestereveningnews.co.uk/news/showbiz-news/where-is-taylor-swift-staying-14758248", "title": "Taylor Swift has booked out an entire city centre hotel ahead of her Manchester gigs", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"page_id": 107654667059, "app_id": 226899387441465, "pages": 105073559550641}, "description": "Pop superstar Taylor Swift has booked out the plush five star hotel for a whole week as she prepares for Manchester Stadium gigs", "author": "Dianne Bourne", "robots": "noarchive, max-image-preview:large", "Googlebot-News": "noarchive", "referrer": "unsafe-URL", "keywords": "Etihad Stadium, Manchester Arena, Old Trafford, The Lowry Hotel, The Lowry Theatre and Arts Centre, Liam Gallagher, Tyson Fury, Robbie Williams, Usain Bolt, Take That, Deansgate, Heaton Park, Salford", "news_keywords": "Etihad Stadium, Manchester Arena, Old Trafford, The Lowry Hotel, The Lowry Theatre and Arts Centre, Liam Gallagher, Tyson Fury, Robbie Williams, Usain Bolt, Take That, Deansgate, Heaton Park, Salford", "allowTaboolaDeepDive": "true", "vf": {"00000000-0000-4000-8000-14cc93248f99": "men-prod-14758248"}, "og": {"title": "Taylor Swift books out ENTIRE city centre hotel ahead of Manchester Etihad gigs", "description": "Pop superstar Taylor Swift has booked out the plush five star hotel for a whole week as she prepares for Manchester Stadium gigs", "url": "https://www.manchestereveningnews.co.uk/news/showbiz-news/where-is-taylor-swift-staying-14758248", "site_name": "Manchester Evening News", "locale": "en_GB", "image": "https://i2-prod.manchestereveningnews.co.uk/article14760088.ece/ALTERNATES/s1200/JS153104665.jpg", "type": "article"}, "article": {"published_time": "2018-06-08T11:00:19Z", "modified_time": "2018-06-08T11:21:13Z", "author": "https://www.facebook.com/DianneBourneDiary", "section": "Celebs", "tag": "Salford"}, "twitter": {"card": "summary_large_image", "site": "@MENNewsdesk", "creator": "@diannebourne", "title": "Taylor Swift has booked out an entire city centre hotel ahead of her Manchester gigs - Manchester Evening News", "description": "Pop superstar Taylor Swift has booked out the plush five star hotel for a whole week as she prepares for Manchester Stadium gigs", "image": "https://i2-prod.manchestereveningnews.co.uk/article14760088.ece/ALTERNATES/s1200/JS153104665.jpg"}}, "movies": [], "publish_date": 1528455619.0, "source": "http://www.manchestereveningnews.co.uk", "summary": ""}