{"url": "https://www.biography.com/people/hoda-kotb", "text": "We may earn commission from links on this page, but we only recommend products we back.\n\n1964-present\n\nHoda Kotb News: Today Show Host Is Leaving NBC’s Morning Show in 2025\n\nHoda Kotb has been a part of the Today show for 17 years, but now, her days on the NBC morning broadcast are numbered. On September 26, she announced on-air she will step away from her hosting duties early next year.\n\n“I realized that it was time for me to turn the page at 60 and to try something new,” Kotb said, during a birthday party for her on the show in August. Another reason for her departure is her desire to spend more time with her daughters, 7-year-old Haley and 5-year-old Hope. “Obviously, I had my kiddos late in life, and I was thinking that they deserve a bigger piece of my time pie that I have,” she said.\n\nNearly a decade after joining NBC as a correspondent for Dateline in 1998, Kotb became host of Today’s fourth hour at 10 a.m. in 2007. She shared hosting duties with Kathie Lee Gifford for many years and now works alongside Jenna Bush Hager. At the beginning of 2018, Kotb also became co-anchor of Today, opposite Savannah Guthrie, at 7 and 8 a.m.\n\nNo final broadcast for Kotb has been announced, and even after leaving the morning show in early 2025, the TV broadcaster will remain working for NBC. There are no details about her next role with the network.\n\nWho Is Hoda Kotb?\n\nHoda Kotb is the co-anchor of NBC’s Today show and co-host of Hoda & Jenna, the program’s 10 a.m. time slot. Her broadcasting career began in 1986 as she worked for news stations in Egypt, Mississippi, Illinois, Florida, and Louisiana. Upon becoming a correspondent for Dateline NBC in 1998, Kotb carved out a strong reputation for her journalistic work before earning a fan base for her lively personality on Today starting in 2007. The Daytime Emmy winner was named co-anchor of the higher-profile 7 and 8 a.m. hours in January 2018; her appointment alongside Savannah Guthrie marked the first time two female hosts were paired together in Today’s history. Kotb plans to leave her hosting duties on Today in early 2025.\n\nQuick Facts\n\nFULL NAME: Hoda Kotb\n\nBORN: August 9, 1964\n\nBIRTHPLACE: Norman, Oklahoma\n\nSPOUSE: Burzis Kanga (2005-2007)\n\nCHILDREN: Haley and Hope\n\nASTROLOGICAL SIGN: Leo\n\nEgyptian Parents, American Upbringing\n\nHoda Kotb was born on August 9, 1964, in Norman, Oklahoma. Her Egyptian immigrant parents—mother Sami Kotb and father Abdel Kader Kotb—left Cairo to study at the University of Oklahoma. The middle child, Hoda has a brother named Adel and a sister named Hala.\n\nThe future TV news anchor was raised in an English-speaking household, describing her assimilated parents as people who “wanted us to be red, white and blue.” She spent her childhood in Morgantown, West Virginia, and Alexandria, Virginia, save for a year abroad in Nigeria and extended vacations with family in Egypt.\n\nAfter attending Fort Hunt High School in Alexandria, Hoda stayed close to home to attend Virginia Tech. She became involved with the Delta Delta Delta sorority and WUVT, the student radio station.\n\nTragedy struck when her brother, a fellow Virginia Tech student, came to find Hoda during a sorority formal to tell her their dad had died suddenly of a heart attack. “It was the worst thing in the world, but I often look around where I am now and wonder,” Hoda said decades later, musing that perhaps not being able to hear kudos from her dad has led to her career success today. “Throughout my career, I think there were probably a few spots where he probably would have said ‘Well, good for you, you did it,’ and then I would have been done. But instead, when you don’t have that attagirl, you’re like I guess there’s more of this mountain to climb.”\n\nThe loss made it difficult for Hoda to focus on school, but she persevered and graduated her bachelor’s degree in broadcast journalism in 1986.\n\nTV Journalist: Today, Dateline, and More\n\nKotb immediately embarked on her broadcasting career after college, joining CBS in 1986 as a news assistant in her parents’ hometown of Cairo.\n\nLanding her first on-air gig proved to be more challenging. She drove to news stations in Virginia and Tennessee without any luck. “Everyone kept referring me to someone else, and I kept getting rejected,” Kotb later recalled. “All of Alabama rejected me. Everyone was ‘so sorry’ and I ‘just wasn’t ready.’ On the way home, I got lost in Mississippi and stumble upon a sign for Greenville.” Her wrong turn led to the opportunity she had been waiting for. When she met a news director at the local CBS affiliate there, he hired her on the spot.\n\nKotb then moved on to stints for other CBS and ABC affiliates in Illinois and Florida, before settling in as a reporter and anchor for WWL-TV in New Orleans from 1992 to 1998.\n\nDateline\n\nThe TV journalist then moved to NBC, the network that would come to define her career. She began as a correspondent for Dateline NBC in 1998 and went on to cover some of the most important domestic and international events of the time, including the 2004 tsunami in Southeast Asia, the aftermath of Hurricane Katrina in 2005, and the U.S. wars in Iraq and Afghanistan.\n\nIn 2007, Kotb was part of the Dateline team honored with a prestigious Peabody Award for The Education of Ms. Groves, a documentary chronicling the challenges facing a first-year teacher at an urban middle school in Atlanta. Elsewhere, she conducted exclusive interviews with notable figures such as Burmese leader Aung San Suu Kyi and hosted the weekly syndicated series Your Total Health from 2004 to 2008.\n\n\n\nToday Show: From Fourth Hour to Co-Anchor\n\nGetty Images For more than a decade, Hoda Kotb and Kathie Lee Gifford hosted the 10 a.m. hour of Today together.\n\nKotb began hosting the 10 a.m. hour of Today, NBC’s daily morning talk show, in September 2007. The following spring, she was paired with veteran morning talk show host Kathie Lee Gifford in the slot. The two demonstrated an easy rapport as they sipped wine and riffed on issues of the day, sharing Daytime Emmy wins for best morning news program with the rest of the Today team in 2010, 2011, and 2012.\n\nKotb wasn’t restricted to just the fourth hour. She also substituted for Today anchors Savannah Guthrie and Matt Lauer and stepped in for various network-related specials, including coverage of the opening ceremony of the 2016 Summer Olympics in Rio de Janeiro.\n\nGetty Images As co-anchors of the Today show, Savannah Guthrie and Hoda Kotb have interviewed many notable figures such as tennis player Coco Gauff\n\nOn January 2, 2018, the longtime NBC fixture began the New Year with the announcement that she was officially taking over as co-host of the 7 and 8 a.m hours of Today, alongside Guthrie. It marked the first time two female hosts were paired together in Today’s history.\n\nKotb had served as interim host of the opening hours since late November 2017, when Lauer was fired for inappropriate workplace behavior. Her pairing with Guthrie had proved a winning combination, as Today surpassed the ratings of the rival ABC program Good Morning America for four consecutive weeks, prompting Today execs to make the move permanent.\n\nDespite her new responsibilities, Kotb maintained her fourth-hour duties. She and Gifford won the 2019 Daytime Emmy Award for Outstanding Informative Talk Show Host a month after Gifford departed the show in April 2019. Jenna Bush Hager, daughter of former President George W. Bush, was named Kotb’s new co-host at the 10 a.m. hour. Officially dubbed Today with Hoda & Jenna, the program often goes simply by Hoda & Jenna.\n\nAlong with her Emmy wins, Kotb is a recipient of the Edward R. Murrow Award, the Alfred I. duPont-Columbia University Award, and four Gracie Awards.\n\nBreast Cancer Survivor\n\nKotb was diagnosed with breast cancer in early 2007 after her gynecologist discovered lumps during a routine exam. Despite her years as host of Your Total Health, she had never undergone a mammogram.\n\nKotb opted to skip chemotherapy but underwent a mastectomy, a procedure that required an extensive mental and physical recuperation period. While keeping a journal of her recovery, she wrote the word “forward” at the end of each entry as a means of overcoming day-to-day difficulties and keeping faith in her progress.\n\nRelated Story 12 Famous Breast Cancer Survivors\n\nAfter coming across a breast cancer walk in Central Park later that year, Kotb decided to go public with her story. Shortly after joining Today in 2007, she shared her experiences in an October episode as part of Breast Cancer Awareness Month.\n\n\n\nBooks, Radio Show, and Podcast\n\nAlong with her celebrated broadcasting work, Kotb in 2010 published her memoir, . She has since written or co-written six more books, including (2013), (2016), and three titles for children.\n\n\n\nHoda: How I Survived War Zones, Bad Hair, Cancer, and Kathie Lee Now 50% Off $9 at Amazon\n\nThe TV personality also pulled double duty as a radio host for six years. With SiriusXM, she launched The Hoda Show on Today Show Radio in February 2015. The weekly one-hour program adopted a similar format to Today’s fourth hour with the noticeable difference that Kotb took calls from listeners. She ended the radio in February 2022, but Kotb didn’t turn off the microphone for good.\n\nIn September 2021, she began hosting the Making Space with Hoda Kotb podcast. “I like to get life advice from people and people who’ve lived incredible lives who are great life coaches, and that’s what this is,” Kotb said of the podcast. How six seasons in, her guests have included actor Rita Moreno, fellow TV host Steve Harvey, musicians Lainey Wilson and Ziggy Marley, Olympian Simone Biles, as well as author and social psychologist Jonathan Haidt.\n\nChildren and Ex-Husband\n\nMarried once before, Kotb is currently single as she raises her two daughters.\n\nThe TV journalist was unable to have children after her treatments for cancer, so she became a mother through adoption. Kotb adopted her daughter Haley Joy in February 2017 and introduced the 12-week-old to Today fans that Mother’s Day. In April 2019, Kotb adopted another girl, named Hope Catherine. Hope was hospitalized in intensive care in 2023 for an undisclosed health issue but has since recovered.\n\nKotb’s ex-husband is Burzis Kanga. She married the former tennis coach for the University of New Orleans in 2005. They divorced two years later.\n\nSeveral years later, in 2013, Kotb began her highly public relationship with financier Joel Schiffman. In November 2019, Kotb announced their engagement. However, wedding bells ultimately weren’t in their future. In January 2022, Kotb shared they had broken up.\n\nQuotes\n\nMy name Hoda is so weird here, but in Egypt, it’s like Jane. I’ve walked down the streets in Cairo and someone yelled out “Hoda!” and like 10 girls turned around. I’m literally the Jane Smith of the Nile.\n\nIn my 50s, I got my children, I got the job I dreamt of, I found out who I was myself. Finally, I fee like I’m 100 percent me.\n\n\n\nFact Check: We strive for accuracy and fairness. If you see something that doesn’t look right, contact us!", "images": ["https://hips.hearstapps.com/hmg-prod/images/connie-chung-attends-the-50th-daytime-emmy-awards-at-the-news-photo-1726585669.jpg?crop=1.00xw:0.671xh;0,0.0759xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/biography/static/images/logos/logo.5ec9b18.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/ryan-seacrest-attends-the-naeem-khan-fashion-show-during-news-photo-1687969511.jpg?crop=0.739xw:0.493xh;0.123xw,0.0171xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/biography/static/images/logos/network-logo.04aa008.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/hoda-kotb-on-tuesday-september-5-2023-news-photo-1727373366.jpg?crop=0.956xw:0.717xh;0.0439xw,0.102xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/personality-barbara-walters-arrives-as-ralph-lauren-news-photo-1684266491.jpg?crop=1.00xw:0.670xh;0,0.0554xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/megyn-kelly-gettyimages-896321522.jpg?crop=0.9993093922651933xw:1xh;center,top&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/hoda-kotb-kathie-lee-gifford-kathie-lee-gifford-joins-hoda-news-photo-1727364694.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/savannah-guthrie-coco-gauff-and-hoda-kotb-on-monday-news-photo-1727365999.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1136033959.jpg?crop=1.00xw:1.00xh;0,0&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://hips.hearstapps.com/rover/profile_photos/e16c2fd9-2845-4786-ad44-4c0f66c1b12a_1686835835.file?fill=1:1&resize=120:*", "https://hips.hearstapps.com/hmg-prod/images/breast-cancer-survivors-gettyimages-1052076308.jpg?crop=1.00xw:0.892xh;0,0.0826xh&resize=300:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://www.biography.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://hips.hearstapps.com/hmg-prod/images/kathie-lee-gifford-9542089-1-402.jpg?crop=1xw:1.0xh;center,top&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1137046672.jpg?crop=1.00xw:1.00xh;0,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-470502976-copy.jpg?crop=1xw:1.0xh;center,top&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://www.biography.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1208933840.jpg?crop=1xw:1.0xh;center,top&resize=360:*", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1727362429-71DxD2NA5XL.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/elizabeth-vargas-gettyimages-1184097556.jpg?crop=1xw:1.0xh;center,top&resize=360:*", "https://hips.hearstapps.com/vidthumb/images/inkt-ep04-thumbnail-682dd7da2d33d.jpg?crop=1xw:1xh;center,top", "https://hips.hearstapps.com/hmg-prod/images/simpson-attends-his-parole-hearing-at-lovelock-correctional-news-photo-1712855749.jpg?crop=0.680xw:1.00xh;0.161xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-71530189.jpg?crop=1xw:1.0xh;center,top&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://www.biography.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://hips.hearstapps.com/hmg-prod/images/hoda-kotb-on-thursday-february-29-2024-news-photo-1727372951.jpg?crop=0.669xw:1.00xh;0.0563xw,0&resize=640:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/hoda-kotb-on-tuesday-september-5-2023-news-photo-1727373366.jpg?crop=0.956xw:0.717xh;0.0439xw,0.102xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.biography.com/movies-tv/hoda-kotb", "title": "Hoda Kotb: Biography, TV Personality, ‘Today’ Show Co-Host", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Hoda Kotb: Biography, TV Personality, ‘Today’ Show Co-Host", "description": "Broadcast journalist Hoda Kotb has become a beloved TV personality as co-host on NBC’s ‘Today﻿’ show.﻿ Read about her children, ex-husband, podcast, and more.", "keywords": "alert", "theme-color": "#000000", "og": {"site_name": "Biography", "title": "Hoda Kotb Says She’s Leaving the ‘Today’ Show to “Try Something New”", "description": "The 26-year NBC veteran plans to keep working for the network after stepping back from its morning program in early 2025.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/hoda-kotb-on-tuesday-september-5-2023-news-photo-1727373366.jpg?crop=0.956xw:0.717xh;0.0439xw,0.102xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.biography.com/movies-tv/hoda-kotb", "type": "article"}, "article": {"publisher": "https://www.facebook.com/Biography", "opinion": "false", "section": "Movies & TV", "modified_time": "2024-09-26T18:03:00Z", "published_time": "2024-09-26T18:03:00Z"}, "parsely-metadata": "{\"socialHeadline\":\"Hoda Kotb Says She’s Leaving the ‘Today’ Show to “Try Something New”\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/hoda-kotb-on-tuesday-september-5-2023-news-photo-1727373366.jpg?crop=0.618xw:0.924xh;0.233xw,0.0756xh&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/hoda-kotb-on-tuesday-september-5-2023-news-photo-1727373366.jpg?crop=0.956xw:0.717xh;0.0439xw,0.102xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/hoda-kotb-on-tuesday-september-5-2023-news-photo-1727373366.jpg?crop=0.618xw:0.924xh;0.233xw,0.0756xh", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/hoda-kotb-on-tuesday-september-5-2023-news-photo-1727373366.jpg?crop=0.956xw:0.717xh;0.0439xw,0.102xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "timely", "sailthru.excerpt": "1964-presentHoda Kotb News: Today Show Host Is Leaving NBC’s Morning Show in 2025Hoda Kotb has been a part of the Today show for 17 years, but now, her days on the NBC morning broadcast are numbered. On September 26, she announced on-air she will step away from her hosting duties", "sailthru.tags": "movies-tv,Movies & TV,news-anchors,News Anchors,emmy-awards,Emmy Awards,Biography-US", "sailthru.date": "2024-09-26 18:03:00", "sailthru.socialtitle": "Hoda Kotb Says She’s Leaving the ‘Today’ Show to “Try Something New”", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1727373780.0, "source": "https://www.biography.com", "summary": ""}