{"url": "https://www.biography.com/people/george-clooney-9251385", "text": "We may earn commission from links on this page, but we only recommend products we back.\n\n1961-present\n\nGeorge Clooney Now: New Movie Wolfs Arrives in Theaters\n\nGeorge Clooney is back to his roots in the action-comedy Wolfs, starring alongside longtime friend Brad Pitt. The movie, which first premiered at the 2024 Venice Film Festival, arrived in select theaters September 20. The 63-year-old Clooney plays Jack, a professional fixer, who gets hired to cover up a high-profile crime but finds himself forced to work with his rival, despite both men being lone wolves.\n\nWolfs marks the first time Clooney and Pitt have worked together on the big screen in 16 years. The pair last teamed up in Burn After Reading in 2008. “It’s an off the charts great film, and it’s fun to work with Brad again,” Clooney said in a 2023 interview with Deadline. “We had a really good time.”\n\nWhile Wolfs was initially expected to get a wide theatrical release, it will only be in limited theaters for a week before coming to on September 27. “We’re happy it’s getting released at all,” Clooney told The Hollywood Reporter. “Obviously we wish it was having a wider release, and we’re trying to figure these things out as we go. This is a revolutionary time in our industry so it’s taken a moment to get through it, but we’ll get through it.”\n\nWho Is George Clooney?\n\nGeorge Clooney is an Academy Award–winning actor, director, and producer who has become one of Hollywood’s most recognizable stars. After nearly a decade of consistent work, the Kentucky native scored his breakout role in 1994 as Dr. Doug Ross on the hit TV show ER. His Emmy-nominated performance led to major movie roles in Batman & Robin and O Brother, Where Art Thou? Clooney has since starred in Ocean’s Eleven and two of its sequels, Michael Clayton, and The Descendants, among many other titles. He has won two Oscars for 2005’s Syriana and 2012’s Argo. Once dubbed one of Hollywood’s most eligible bachelors, the movie star is now married to international human rights lawyer Amal Clooney, with whom he shares two kids. His newest movie is the 2024 action-comedy Wolfs.\n\nQuick Facts\n\nFULL NAME: George Timothy Clooney\n\nBORN: May 6, 1961\n\nBIRTHPLACE: Lexington, Kentucky\n\nSPOUSES: Talia Balsam (1989-1993) and Amal Clooney (2014-present)\n\nCHILDREN: Alexander and Ella\n\nASTROLOGICAL SIGN: Taurus\n\nEarly Life\n\nGeorge Timothy Clooney was born on May 6, 1961, in Lexington, Kentucky, into a well-known family of media and entertainment personalities. His father, Nick, spent many years as a television personality and news anchor. His mother, Nina, was a former pageant queen and journalist turned city councilwoman. His aunt, Rosemary Clooney, had a long career as a singer and actor.\n\nGetty Images George Clooney is the second child of Nick Clooney, left, and Nina Clooney, right.\n\nDue to the nature of his father’s work, George and his older sister, Ada, moved several times to various locations throughout Kentucky and Ohio with their parents. In 1974, they settled down for good in a rambling, old Victorian home in downtown Augusta, Kentucky, a small town on the Ohio River about an hour south of Cincinnati.\n\nThere, despite some name recognition, the Clooneys led a fairly modest life. They were a close-knit family, with Nick making sure to carve time out of his busy schedule in Cincinnati to be home in the evenings for dinner. At the Clooney supper table, the family often discussed current events. George’s father, a true newsman, had grown up in awe of men like CBS news anchor Edward R. Murrow and, later, Walter Cronkite.\n\nGeorge made his first television appearance at 5 years old by playing sketch characters on the local talk shows his dad hosted. George’s talent for expression began to falter in middle school when he developed Bell’s palsy, which causes partial facial paralysis. He eventually recovered from the illness.\n\nIn school, George was more focused on sports than books but still managed to be a good student. “I pulled out my report cards... I had all As and a B,” the actor told Esquire magazine. A fairly good baseball player, he managed to land a tryout with the Cincinnati Reds at age 16. A baseball contract, however, never materialized.\n\nGeorge later opted for college. Staying close to home, he attended Northern Kentucky University, where he studied broadcast journalism. But the future didn’t last long at college. He didn’t think he had what it took to become a good television journalist, and he hated the constant comparisons to his father. He dropped out of school in 1981, without a thought as to what he would do next.\n\nGeorge stuck around the Cincinnati area for a while and found work as a shoe salesman and, later, as a farmhand picking tobacco. He had been harvesting tobacco when he got a call from his cousin, Miguel Ferrer, the son of his aunt Rosemary and Oscar-winning actor José Ferrer. Miguel and his father were making a movie in Kentucky about horse racing, and they offered young George a little acting work. George hung around the set for a good three months, where he worked as an extra and even landed a few lines. To make extra money, he loaned his old Monte Carlo to his uncle and cousin for $50 a day. The movie never got released, but the experience gave George the acting bug again.\n\nEncouraged by his cousin Miguel, George decided to move to Los Angeles to become an actor when the movie shoot was over. “I had just spent the summer cutting tobacco, which is a miserable job. So that’s what made me move to Hollywood,” George later told Esquire. To make ends meet, he picked up whatever work he could find. He even ran errands for his aunt and chauffeured her around town. Slowly parts came, even if they weren’t the kind of roles he dreamed about.\n\nMovies and TV Shows\n\nGetty Images George Clooney’s first major role was on the TV show The Facts of Life.\n\nClooney landed a recurring role on the popular teen comedy The Facts of Life, from 1985 to 1987. From 1988 to 1991, he made guest appearances on the sitcom Roseanne, starring Roseanne Barr. In 1992, Clooney starred in the short-lived series Bodies of Evidence, playing a detective. On the drama Sisters, he played another detective and the love interest for Sela Ward’s character. There were small movie roles, too, including the part of a lip-synching cross-dresser in a 1993 thriller called The Harvest.\n\nAlthough Clooney worked steadily in Hollywood, he had yet to land a significant career breakthrough. Feeling that he was always on the cusp of something bigger, something greater, Clooney found his situation difficult. “I had a work ethic,” he later told The New Yorker. “I was making a couple of hundred grand a year, which is beating all the odds, so you don’t really think things are going terribly. You actually feel like you’re succeeding. [But] I wished I was doing better projects, and I didn’t think I was going to get that chance.” All that was about to change.\n\nToday, Clooney is a two-time Academy Award winner and three-time Golden Globe winner. At the 2015 Golden Globe Awards, the actor, director, and producer received the Hollywood Foreign Press Association’s Cecil B. DeMille Award for his career accomplishments in Hollywood. Three years later, Clooney was honored with the Life Achievement Award from the American Film Institute.\n\nBig Break in ER\n\nGetty Images George Clooney had his breakout role in the hit show ER.\n\nIn 1994, Clooney was cast in a new medical drama called ER. Clooney played Dr. Doug Ross, a caring pediatrician and a notorious ladies man, in the ensemble TV show, which also featured Anthony Edwards, Julianna Margulies, and Sherry Stringfield. Soon after its September 1994 debut, Clooney was on his way to becoming one of the show’s breakout stars, attracting the attention of film industry movers and shakers. His classic good looks and easygoing charm made him a natural for the big screen.\n\nClooney worked at a hectic pace, managing to appear in several movies during his time on ER. He battled evil vampires with Quentin Tarantino in Robert Rodriguez’s From Dusk to Dawn (1996). In the romantic comedy One Fine Day (1996), Clooney played a divorced father who falls for a single mother (Michelle Pfeiffer).\n\nContinuing to balance his TV role and his film work over the next few years, Clooney earned two Emmy Award nominations and three consecutive Golden Globe nominations for his ER role. In 1999, he turned in his scrubs to pursue his movie career full-time.\n\nBatman & Robin\n\nAssuming the role of the caped crusader, Clooney starred as Batman with Chris O’Donnell as his sidekick in 1997’s Batman & Robin. The summer blockbuster netted more than $238 million at the global box office, but that wasn’t enough to cover production and promotion costs. The movie racked up a slew of negative reviews, and Clooney’s Batsuit is famously mocked for including nipples.\n\nThe star has repeatedly trashed the movie and apologized for his part in the flop. “It was a difficult film to be good in. I don’t know what I could have done differently,” Clooney said in 2011. “But if I am going to be Batman in the film Batman & Robin, I can’t say it didn’t work and then not take some of the blame for that.”\n\nDecades later, Clooney surprised audiences by appearing as Batman once more for a cameo in The Flash (2023), but he has no plans of donning the Batsuit again. “I don’t think there’s enough drugs in the world for me to go back and do it,” Clooney joked to Entertainment Tonight in December 2023.\n\nBatman & Robin marked a low point in Clooney’s movie career, but it was hardly a final blow. In 1998, Clooney starred opposite Jennifer Lopez in Steven Soderbergh’s Out of Sight (1998) and had a role in Terrence Malick’s war drama The Thin Red Line. The following year, as he departed ER, the actor starred in the Persian Gulf War tale Three Kings with Mark Wahlberg and Ice Cube.\n\nO Brother, Where Art Thou?\n\nGetty Images George Clooney starred in the 2000 film O Brother, Where Art Thou?\n\nWorking with the Coen brothers, Clooney starred as a charming conman in O Brother, Where Art Thou? (2000), an imaginative retelling of the epic poem The Odyssey. He won a Golden Globe Award for his work on the film.\n\nOne Half of the Sibling Directors’ Duo Ethan Coen\n\nClooney also reteamed with Mark Wahlberg for the popular disaster-at-sea film The Perfect Storm, based on Sebastian Junger’s best-selling novel. The actor, who for so long had wondered if he’d truly make it big, was now Hollywood royalty.\n\nOcean’s Eleven and Sequels\n\nIn 2001, Clooney starred in the remake of Ocean’s Eleven directed by Steven Soderbergh. He played Danny Ocean, a role originated by famed crooner Frank Sinatra. The comedic heist featured an all-star cast alongside Clooney: Brad Pitt, Julia Roberts, Bernie Mac, Matt Damon, Elliott Gould, Carl Reiner, Andy Garcia, and a young Casey Affleck.\n\nIt proved to be such a successful venture on- and off-screen that it spawned three sequels. Clooney and much of the original cast returned for Ocean’s Twelve (2004) and Ocean’s Thirteen (2007). The 2018 entry, Ocean’s Eight, featured an all-female ensemble with Sandra Bullock starring as Danny Ocean’s sister. Ocean’s Eleven and Ocean’s Twelve were among the top 10 highest-grossing movies worldwide during the year of their releases, and the modern franchise has collected a combined $1.4 billion at the global box office.\n\nOscar for Syriana and Good Night, and Good Luck\n\nThe year after Ocean’s Eleven, Clooney made his directorial debut with Confessions of a Dangerous Mind (2002). The biopic focused on the life of Chuck Barris, host of The Gong Show and reportedly a CIA agent. Despite the movie’s poor box-office performance and weak reviews, Clooney continued to work behind the scenes on a pair of award-worthy movies from 2005.\n\nFor the political drama Syriana, Clooney was a producer and took on a supporting role. The usually fit actor—who is nearly 5 feet, 11 inches tall—gained roughly 30 pounds to play government agent Bob Barnes in the movie, which explored political intrigue and corruption in the Middle East. Badly hurt during the filming of a scene, he damaged the membrane around his spine. The injury caused spinal fluid to leak from his nose and left him with terrible back pain. After completing Syriana, the Hollywood star underwent two surgeries to fix the problem.\n\nClooney returned to the director’s chair for Good Night, and Good Luck, a movie examining the clash between distinguished news anchor Edward R. Murrow and Senator Joseph McCarthy. Clooney also co-wrote the screenplay, which served partly as a tribute to his newsman father, and took on a supporting role in the widely praised black-and-white drama.\n\nAll his hard work didn’t go unnoticed. Clooney earned his first three Academy Award nominations—for Best Supporting Actor in Syriana as well as Best Director and Best Original Screenplay for Good Night, and Good Luck—and was similarly nominated at the Golden Globes. He ultimately won the Oscar and Golden Globe trophy for his turn in Syriana.\n\nIn 2025, Clooney is set to make his broadway debut in the stage adaptation of Good Night, and Good Luck.\n\nUp in the Air and The Descendants\n\nIn 2007, Clooney starred as the title character in the legal thriller Michael Clayton. Portraying a problem fixer for a law firm, he earned an Oscar nomination for his performance for Best Actor.\n\nCan You Guess? The Best Actor Oscar Winner the Year You Were Born\n\nAfter anchoring the sports comedy Leatherheads (2008), also featuring John Krasinski and Renée Zellweger, then taking a turn in the Brad Pitt–led satire Burn After Reading (2008), Clooney’s next starring role was in the 2009 dramatic comedy Up in the Air. His performance as Ryan Bingham, a consultant who specializes in firing employees, earned him rave reviews as well as another Academy Award nomination for Best Actor.\n\nFor The Ides of March in 2011, Clooney proved to be a triple-threat, serving as the project’s director, co-writer, and one of its stars. The political drama, based on a 2008 play titled Farragut North by Beau Willimon, featured Clooney as a presidential candidate and Ryan Gosling as one of his aides. Clooney received an Oscar nod for Best Adapted Screenplay and two Golden Globe nominations for the screenplay and his directing.\n\nAlso in 2011, Clooney gave an impressive performance in the family drama The Descendants, directed by Alexander Payne. He won a Golden Globe and secured an Academy Award nomination for his turn as a husband and father who must cope with new challenges and unpleasant revelations after his wife is severely injured in a boating accident.\n\nGravity and Suburbicon\n\nClooney won his second (and most recent) Oscar for producing Argo with Ben Affleck and Grant Heslov. The 2012 political thriller was named Best Picture at the 85th Academy Awards. The movie, which Affleck starred in and directed, was adapted from by former CIA operative Tony Mendez and “The Great Escape,” a Wired magazine article by Joshuah Bearman.\n\nNext, Clooney teamed up with Sandra Bullock for 2013’s Gravity. The space disaster epic was among the top 10 highest-grossing movies of the year. He followed with The Monuments Men (2014), which Clooney starred in and directed.\n\nClooney was back on the big screen in 2016, with featured roles in Hail, Caesar! and Money Monster, directed by Jodie Foster. The following year, he again stepped behind the camera to direct Suburbicon, starring Matt Damon and Julianne Moore.\n\nShortly after the release of Suburbicon, Clooney revealed in an interview with The Sunday Times that he was stepping back from acting. “I acted for a long time and, you know, I’m 56. I’m not the guy that gets the girl anymore,” he said, adding that his secure financial footing gave him the luxury to pursue the projects of his choosing.\n\nCatch-22\n\nOne such project turned out to be an adaptation of Joseph Heller’s 1961 novel, Catch-22, about American servicemen attempting to maintain their sanity amid the looming threat of death in combat during World War II. Clooney starred in and directed two episodes from the 2019 limited series of the same name. His part as Colonel Cathcart was Clooney’s first regular TV role since his time on ER in the 1990s.\n\nThe Midnight Sky and Ticket to Paradise\n\nIn 2020, Clooney returned to both directing and acting in the science-fiction film The Midnight Sky, based on the book by Lily Brooks-Dalton. He played the leading role of Augustine, a lone scientist in the Arctic trying to contact a crew of astronauts. The movie, which debuted on Netflix, received mixed reviews from critics.\n\nClooney also directed Amazon Prime Video’s 2021 film The Tender Bar, which chronicles an aspiring writer’s coming-of-age as he finds a father figure in his bartender uncle, played by Ben Affleck. The script was adapted from the memoir of Pulitzer Prizer winner J. R. Moehringer.\n\nWith Ticket to Paradise (2022), Clooney returned to movie theaters for the first time in six years. The romantic comedy, co-starring Julia Roberts, saw Clooney play a divorced father who travels to Bali with his ex-wife to stop their daughter from marrying a seaweed farmer. Ticket to Paradise generated lukewarm reviews.\n\nThe Boys in the Boat and Wolfs\n\nClooney then directed the 2023 sports drama The Boys in the Boat, based on the true story of the University of Washington rowing team’s quest to compete for gold in the 1936 Olympics. The film grossed more than $50 million at the box office but received mixed reviews.\n\nNext, Clooney voiced Spaceman in the 2024 kids’ fantasy movie IF. His newest movie, Wolfs, returns the actor to his roots in action-comedy. Released in September 2024, briefly in theaters then streaming on Apple TV+, Wolfs sees Clooney play a professional fixer alongside a rival fixer portrayed by Brad Pitt.\n\nNet Worth\n\nAs of August 2024, Clooney has an estimated total net worth of $500 million, according to Celebrity Net Worth.\n\nIn addition to his screen work, he has earned much of his wealth from his tequila brand, Casamigos, which he founded in 2013. When Casamigos was sold in 2017, Clooney received $233 million in the deal, putting him at the top of Forbes’ annual ranking of highest-paid actors the following year.\n\nThe actor and director also has his own production company, Smokehouse Pictures, which has major deals with Audible and Warner Bros. Pictures Group. He and business partner Grant Heslov founded Smokehouse in 2006. The company has produced Oscar-winning Best Picture Argo (2012), August: Osage County, as well as several of Clooney’s acting and directing projects like Good Night, and Good Luck.\n\nWife Amal Clooney\n\nGetty Images Amal and George Clooney have been married since 2014 and share two kids.\n\nA longtime bachelor, Clooney met Amal Alamuddin, a Lebanese-born British human rights attorney, through a friend in July 2013 when he was 52 years old and she was 35. They started dating a few months later, then in April 2014, he proposed during a date night at home. The couple tied the knot in Venice, Italy, that September, and Amal changed her name to Amal Clooney.\n\nRead Her Biography Amal Clooney\n\nThree years later, 56-year-old George and 39-year-old Amal became first-time parents with the birth of their twins, Ella and Alexander, in June 2017. Today, the actor and his family reside in the small village of Cotignac, France, having previously lived in a villa on Lake Como in Italy.\n\nFirst Wife Talia Balsam and Other Relationships\n\nGetty Images George Clooney and Talia Balsam got divorced after nearly four years of marriage.\n\nDespite his bachelor status, Clooney was married once before. He and actor Talia Balsam wed in December 1989. That union was short-lived, and the two divorced in September 1993.\n\nFollowing the divorce, Clooney vowed that he would never marry again or have children. The pledge managed to catch the attention of actors Nicole Kidman and Michelle Pfeiffer, who both stated that they believed Clooney would be a father before he turned 40 and even placed bets on it. Both actors lost their bets, and both sent Clooney checks to pay up. The actor, who has twice been named People magazine’s “Sexiest Man Alive,” returned the money to his friends.\n\nIn the years following his divorce, Clooney dated a variety of women, including actors Kimberly Russell, Krista Allen, and Stacy Keibler.\n\nKids\n\nGeorge is a father to 7-year-old twins Alexander and Ella, who he shares with his wife, Amal Clooney. Despite his fame, the actor has kept his children out of the public eye while occasionally giving insight into their lives and personalities. He has shared both Alexander and Ella speak French and Italian, have a good sense of humor, and are fans of soft metal music.\n\nIn September 2024, his kids crashed George’s , climbing all over his Wolfs co-star Brad Pitt. Clooney shared he’s trying to maintain a healthy work-life balance for the sake of his family. “I’m going to give myself time with my kids,” he said, adding that he enjoys driving them to school.\n\nClooney said his top priority is to protect them. “I don’t want pictures of my kids. We deal in very serious subject matters, with very serious bad guys, and we don’t want to have photos of our kids out there,” he continued. “So we have to work hard at trying to stay private, and it’s tricky, as you can imagine.”\n\nPolitical Causes and Philanthropy\n\nInvolvement in U.S. Presidential Campaigns\n\nAn outspoken liberal, Clooney has been a frequent target of right-wing politicos and personalities, including Fox News’ Bill O’Reilly. Beyond his disappointment with the election of George W. Bush as U.S. president in 2000, the actor was also an early opponent of the Iraq War and in a 2003 interview called the then-president “dim.”\n\n“America’s policies frustrate me,” Clooney told a German television program. “I think a war against Iraq is as unavoidable as it is senseless. I think it’s coming. But I also think the real danger is going to be what happens after it.”\n\n\n\nClooney supported Barack Obama’s successful 2008 and 2012 presidential campaigns, as well as Hilary Clinton’s unsuccessful 2016 run. In 2020, he endorsed Joe Biden for president and hosted a virtual fundraiser for the eventual winner.\n\nIn July 2024, Clooney wrote an op-ed in calling for President Biden, 81, to end his bid for reelection due to his age. Biden dropped out of the 2024 presidential race less than two weeks later, prompting Clooney to endorse Democratic nominee Vice President Kamala Harris.\n\n\n\nPeace Activism and Darfur\n\nIn 2006, Clooney stepped up his involvement in political and social causes. He teamed up with his father and a few others to travel around the western region of Sudan, known as Darfur. Armed with a few small video cameras, Clooney and his dad set out report on how the area had been ravaged by war and how the international community was struggling to set up refugee camps to help those in need. By leveraging Clooney’s Hollywood status, they believed they could bring greater attention to the Darfur crisis and could help fuel global interest in helping the region. Their edited footage was broadcast on such programs as Oprah.\n\nUpon his return to the United States, Clooney brought his celebrity clout to Washington D.C., where he spoke at a rally against the genocide in Darfur. Later he spoke to a special meeting of the U.N. Security Council. With other celebrities—including Brad Pitt, Don Cheadle, and Matt Damon—he formed a nonprofit organization called Not On Our Watch to help the people in Darfur.\n\nIn 2007, he and Cheadle were recognized for their work for Darfur. The pair shared a Peace Summit Award at the 8th Annual World Summit of Nobel Peace Prize Laureates in Rome. The following year, with his parents standing at his side, Clooney was officially appointed as a U.N. peace envoy.\n\n\n\nRecognizing his philanthropic efforts to date, the Television Academy present Clooney with the Bob Hope Humanitarian Award in 2010.\n\nMeet the Award’s Namesake Bob Hope\n\nPhilanthropic Donations\n\nFollowing the September 11th attacks, Clooney organized a fundraiser that featured dozens of Hollywood stars and assembled more than $129 million for the United Way. Four years later, he donated $1 million to the United Way Hurricane Katrina Response Fund.\n\nFollowing the tragic shooting at Marjory Stoneman Douglas High School in Parkland, Florida, in February 2018, Clooney and his wife, Amal, announced they were donating $500,000 to the March for Our Lives protest planned for the following month. Other entertainment A-listers followed their lead, with Steven Spielberg and Oprah Winfrey also announcing donations.\n\n\n\nQuotes\n\nI’m certainly the last person to give advice on, well, anything.\n\nThe best lesson my mom taught me was how to be scrappy... She taught me how to be realistic and survive in weird situations.\n\nIn debates, the Republican will go, “That guy’s bad, and that guy’s good.” And the Democrat will say, “Well, I understand what you’re saying, because your parents were alcoholics.” And the reality is that you need people who go, “That’s good. That’s bad.”\n\nFact Check: We strive for accuracy and fairness. If you see something that doesn’t look right, contact us!", "images": ["https://www.biography.com/_assets/design-tokens/biography/static/images/logos/logo.5ec9b18.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/actress-jamie-lee-curtis-attends-the-world-premiere-of-news-photo-1754424809.pjpeg?crop=0.643xw:0.964xh;0.272xw,0.0361xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/biography/static/images/logos/network-logo.04aa008.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/actors-paul-newman-and-robert-redford-attend-the-sundance-news-photo-1758031823.pjpeg?crop=0.695xw:1.00xh;0.146xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/george-clooney-and-brad-pitt-are-seen-on-the-set-of-wolves-news-photo-1726669798.jpg?crop=0.832xw:0.624xh;0.101xw,0.215xh&resize=1200:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://hips.hearstapps.com/hmg-prod/images/actor-george-clooney-and-wife-talia-balsam-attend-the-abc-news-photo-1727193371.jpg?crop=1.00xw:0.673xh;0,0.0448xh&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/robert-redford-gettyimages-1186761501.jpg?crop=1.00xw:1.00xh;0,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1191495915.jpg?crop=1xw:0.5xh;center,top&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/judy-garland-9306838-402.jpg?crop=1.00xw:1.00xh;0,0&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-153477096.jpg?crop=1.00xw:0.802xh;0,0.101xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://hips.hearstapps.com/hmg-prod/images/robert-redford-news-photo-1758145731.pjpeg?crop=0.767xw:0.558xh;0.0683xw,0.0579xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2217819.jpg?crop=1xw:0.5xh;center,top&resize=300:*", "https://www.biography.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://hips.hearstapps.com/hmg-prod/images/nicole-kidman-attends-a-red-carpet-for-babygirl-during-the-news-photo-1730234543.jpg?crop=0.641xw:0.956xh;0.250xw,0.0440xh&resize=360:*", "https://hips.hearstapps.com/rover/profile_photos/5fcff581-7d28-4053-b059-6459ddbfb3bf_1723555868.file?fill=1:1&resize=120:*", "https://hips.hearstapps.com/hmg-prod/images/jimmy-kimmel-live-airs-every-weeknight-at-11-35-p-m-et-and-news-photo-1758228400.pjpeg?crop=0.771xw:0.616xh;0.117xw,0.0221xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/kevin-costner-attends-airbnb-2025-summer-release-on-may-13-news-photo-1748528166.pjpeg?crop=0.753xw:0.502xh;0.163xw,0.0466xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/amal-clooney-gettyimages-491415794_1600jpg.jpg?crop=1.00xw:0.504xh;0,0.301xh&resize=300:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/matt-damon-attends-uk-premiere-of-oppenheimer-at-the-odeon-news-photo-1689794931.jpg?crop=1.00xw:0.334xh;0,0.0467xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/the-safe-return-of-the-apollo-13-astronauts-after-their-news-photo-1754686592.pjpeg?crop=0.712xw:1.00xh;0.199xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/american-actor-and-director-george-clooney-at-the-81-venice-news-photo-1726869053.jpg?crop=1.00xw:0.667xh;0,0.0464xh&resize=640:*", "https://hips.hearstapps.com/hmg-prod/images/pictured-nancy-mckeon-as-joanna-jo-marie-polniaczek-bonner-news-photo-1727197454.jpg?crop=0.9795xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/vidthumb/images/inkt-ep04-thumbnail-682dd7da2d33d.jpg?crop=1xw:1xh;center,top", "https://hips.hearstapps.com/hmg-prod/images/cynthia-erivo-at-the-wicked-for-good-new-york-premiere-held-news-photo-1763498079.pjpeg?crop=0.636xw:0.947xh;0.176xw,0.0526xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/amal-clooney-and-george-clooney-attend-the-clooney-news-photo-1726861955.jpg?crop=0.668xw:1.00xh;0.179xw,0&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/nick-clooney-george-clooney-and-nina-clooney-during-the-news-photo-1727197291.jpg?crop=1.00xw:0.860xh;0,0.140xh&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/pictured-george-clooney-as-doctor-doug-ross-news-photo-1726862292.jpg?crop=0.830xw:0.843xh;0.165xw,0.157xh&resize=980:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/ethan-coen-attends-the-red-carpet-during-the-14th-rome-film-news-photo-1727128315.jpg?crop=0.564xw:0.423xh;0.196xw,0.279xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1146827623.jpg?crop=1.00xw:1.00xh;0,0&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://hips.hearstapps.com/hmg-prod/images/in-the-depression-era-deep-south-three-escapees-from-a-news-photo-1726862124.jpg?crop=0.995xw:1.00xh;0,0&resize=980:*", "https://hips.hearstapps.com/rover/profile_photos/b50d4909-0f39-4b73-b482-46d0a9078d40_1682363012.file?fill=1:1&resize=120:*", "https://hips.hearstapps.com/hmg-prod/images/actor-brad-pitt-attends-the-photocall-of-the-movie-wolfs-news-photo-1726680022.jpg?crop=0.724xw:0.543xh;0.0780xw,0.255xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/oscars-64026c91c1b94.png?crop=1.00xw:1.00xh;0,0&resize=300:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/george-clooney-and-brad-pitt-are-seen-on-the-set-of-wolves-news-photo-1726669798.jpg?crop=0.832xw:0.624xh;0.101xw,0.215xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.biography.com/actors/george-clooney", "title": "George Clooney: Biography, Actor, Oscar Winner", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "George Clooney: Biography, Actor, Oscar Winner", "description": "Oscar winner George Clooney is known for ‘Syriana﻿,’ ‘The Descendants,’ and the ‘Ocean’s’ franchise. Read about his movies, TV shows, kids, wife, and more.", "keywords": "alert", "theme-color": "#000000", "og": {"site_name": "Biography", "title": "George Clooney Returns to His Roots—and Brad Pitt—in ‘Wolfs’", "description": "The action-comedy, now in theaters and streaming Friday, pits the regular co-stars as rival fixers.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/george-clooney-and-brad-pitt-are-seen-on-the-set-of-wolves-news-photo-1726669798.jpg?crop=0.832xw:0.624xh;0.101xw,0.215xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.biography.com/actors/george-clooney", "type": "article"}, "article": {"publisher": "https://www.facebook.com/Biography", "opinion": "false", "section": "Famous Actors", "modified_time": "2024-09-24T17:13:00Z", "published_time": "2024-09-24T17:13:00Z"}, "parsely-metadata": "{\"socialHeadline\":\"George Clooney Returns to His Roots—and Brad Pitt—in ‘Wolfs’\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/george-clooney-and-brad-pitt-are-seen-on-the-set-of-wolves-news-photo-1726669798.jpg?crop=0.524xw:0.785xh;0.251xw,0.215xh&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/george-clooney-and-brad-pitt-are-seen-on-the-set-of-wolves-news-photo-1726669798.jpg?crop=0.832xw:0.624xh;0.101xw,0.215xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/george-clooney-and-brad-pitt-are-seen-on-the-set-of-wolves-news-photo-1726669798.jpg?crop=0.524xw:0.785xh;0.251xw,0.215xh", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/george-clooney-and-brad-pitt-are-seen-on-the-set-of-wolves-news-photo-1726669798.jpg?crop=0.832xw:0.624xh;0.101xw,0.215xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "timely", "sailthru.excerpt": "1961-presentGeorge Clooney Now: New Movie Wolfs Arrives in TheatersGeorge Clooney is back to his roots in the action-comedy Wolfs, starring alongside longtime friend Brad Pitt. The movie, which first premiered at the 2024 Venice Film Festival, arrived in select theaters September 20. The 63-year-old Clooney plays Jack, a professional fixer,", "sailthru.tags": "actors,Famous Actors,academy-awards,Academy Awards,emmy-awards,Emmy Awards,filmmakers,Filmmakers,Biography-US", "sailthru.date": "2024-09-24 17:13:00", "sailthru.socialtitle": "George Clooney Returns to His Roots—and Brad Pitt—in ‘Wolfs’", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1727197980.0, "source": "https://www.biography.com", "summary": ""}