{"url": "https://www.news-leader.com/story/sports/college/msu/2018/06/12/bachelorette-becca-kufrin-contestant-clay-harbor-leaves-show-football-injury/693259002/", "text": "Former Missouri State tight end Clay Harbor had a few tough breaks during Monday night's episode of \"The Bachelorette.\"\n\nWhen the contestants took to the football field during a group date to impress Bachelorette Becca Kufrin, one might have thought it was Harbor's time to shine.\n\nBut when it was crunch time on the gridiron, things went from good to bad to worse for our local heartthrob.\n\nWho is Clay Harbor: Former MSU coach weighs in on tight end now on 'The Bachelorette'\n\nWarning! Spoiler alert! If you don't want major 'The Bachelorette' spoilers, don't read past the photo of Becca Kufrin.\n\nNeed a news break? Check out the all new PLAY hub with puzzles, games and more!\n\nHarbor found himself behind center instead of his usual tight end position during the game. It can be assumed he didn't want to run over everyone.\n\nEarly in the game, Harbor showed off his arm strength by throwing a 25-yard touchdown pass to Pro Football Focus blogger Mike Renner in the back of the end zone.\n\nBut with seconds on the clock and his team trailing in the \"Becca Bowl,\" Harbor decided to take matters into his own hands.\n\n\"We've been poking at the bear all day,\" actor Leandro Dottavio said before Harbor went beast mode on the contestants. \"Finally, Clay decided to let loose and really just go insane.\"\n\nHarbor took the snap and looked downfield, but it was all a trick as he went for the ol' quarterback draw — what this sportswriter considers the best play in the playbook.\n\nHe brushed off one tackle and then another before hitting the B button on the XBOX controller for a devastating spin move.\n\nBut when Harbor decided to put the stiff arm on the last two defenders on his way to a touchdown, he immediately grabbed his left wrist and laid on the ground in the back of the end zone.\n\n\"Oh God, is he OK?\" Kufrin said in fear.\n\nHe wasn't OK and later, Kufrin wouldn't be either.\n\nHarbor later took himself out of the rose competition to address his wrist injury.\n\nHe returned and received a rose from Kufrin.\n\nSo all is well in love and football, right? Wrong.\n\nAt the end of the cocktail party, Harbor was told that he needed surgery and was faced with a difficult decision: sacrifice millions of dollars to pursue a girl he met a few weeks before, or pursue love?\n\nSitting by the fire — with a cast on his left wrist — Harbor awaited the Bachelorette.\n\n“Seeing Clay at the afterparty made me smile so much, I didn’t expect him to make it back from the hospital,” Kufrin said. “It melts my heart that he’s showing up for me and that means a lot. I’m finally finding a spark for Clay… and I like it.”\n\nBut then Harbor snuffed out the tender flame.\n\nWhile saying football helps him pay for his family, Harbor said he knew he had to leave the show.\n\n“I’m regretting it already,” Harbor said while failing to look Kufrin in the eyes.\n\n“I definitely think what I had with Becca was special,” Harbor said in one of those reality TV interviews away from the action. “It was tough to walk away from that. I definitely could’ve been the one standing there in the end with her, and that’s something I’m always going to wonder about.”\n\nAs they kissed goodbye, Kufrin told Harbor to go take care of himself.\n\n“I’m really going to miss Clay,” Kufrin said while crying. “I gave him the rose last night for a reason. We were finally getting somewhere. Watching him walk away — it’s just not easy.\n\n“He has such a big, big heart.\"\n\nAfter the show's airing on Monday night, Harbor updated the world on his injury while thanking \"The Bachelorette\" for the opportunity.\n\n\"I want to thank everyone for the love and support!\" Harbor tweeted. \"Definitely the hardest decision I’ve ever made but I believe everything happens for a reason. I am working hard to get back on the field and turn this negative into a positive.\n\n\"I have to thank the whole @BacheloretteABC family for an amazing experience in hindsight I don’t regret my decision to come on and would gladly give my wrist for a chance at love.\n\n\"That being said the show was filmed months ago and after a tough rehab I am finally ready to play some football. I look forward to finding a team and seeing you all on NFL Sunday’s. Thanks for all thoughts and prayers!\"\n\nIt's curious Harber mentioned he would gladly give his wrist for a chance at love, considering he didn't give his wrist for a chance at love with Kufrin.\n\nWyatt D. Wheeler is a reporter and columnist for the Springfield News-Leader. He one time attempted to watch 10 minutes of \"The Bachelorette\" to keep up with Springfield's local athlete but he just couldn't do it. You can reach him at 417-371-6987, by email at wwheeler@news-leader.com or join the conversation on Twitter where his handle is @WyattWheeler_NL.", "images": ["https://www.news-leader.com/gcdn/authoring/authoring-images/2024/09/05/PSPR/75090915007-t-staff-photos-00107.jpg?crop=2482,2482,x418,y298&width=48&height=48&format=pjpg&auto=webp", "https://www.news-leader.com/gcdn/-mm-/8269a3441f8e5a4248f5f16b54d45df9ce5516bf/c=0-153-2996-1846/local/-/media/2018/05/17/USATODAY/USATODAY/636621722810697977-clay2.jpg?width=660&height=373&fit=crop&format=pjpg&auto=webp", "https://www.news-leader.com/gciaf/prod/p?a=pageview&p=PSPR-TEALIUM-TANGENT&m=web&k=f14ebdd6-0569-4c64-af73-99937bc06379&s=noscript", "https://www.news-leader.com/gcdn/-mm-/796caad5dc29235db8b2ff50efd578dec4a8bc8e/c=0-319-1668-1261/local/-/media/2018/05/24/Springfield/Springfield/636627703583279712-snldc5-5qm3e3mjcxx1eu6bf2gz-original.jpg?width=1668&height=942&fit=crop&format=pjpg&auto=webp", "https://www.news-leader.com/gcdn/-mm-/796caad5dc29235db8b2ff50efd578dec4a8bc8e/c=0-319-1668-1261/local/-/media/2018/05/24/Springfield/Springfield/636627703583279712-snldc5-5qm3e3mjcxx1eu6bf2gz-original.jpg?width=660&height=372&fit=crop&format=pjpg&auto=webp"], "top_img": "https://www.news-leader.com/gcdn/-mm-/796caad5dc29235db8b2ff50efd578dec4a8bc8e/c=0-319-1668-1261/local/-/media/2018/05/24/Springfield/Springfield/636627703583279712-snldc5-5qm3e3mjcxx1eu6bf2gz-original.jpg?width=1668&height=942&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.news-leader.com/story/sports/college/msu/2018/06/12/bachelorette-becca-kufrin-contestant-clay-harbor-leaves-show-football-injury/693259002/", "title": "Did former Missouri State star Clay Harbor pick football over love on 'The Bachelorette'?", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "theme-color": "#0098FE", "og": {"title": "Did former Missouri State star Clay Harbor pick football over love on 'The Bachelorette'?", "description": "Becca Kufrin gave him a rose, but Clay Harbor had to give it back.", "url": "https://www.news-leader.com/story/sports/college/msu/2018/06/12/bachelorette-becca-kufrin-contestant-clay-harbor-leaves-show-football-injury/693259002/", "site_name": "Springfield News-Leader", "image": {"identifier": "https://www.news-leader.com/gcdn/-mm-/796caad5dc29235db8b2ff50efd578dec4a8bc8e/c=0-319-1668-1261/local/-/media/2018/05/24/Springfield/Springfield/636627703583279712-snldc5-5qm3e3mjcxx1eu6bf2gz-original.jpg?width=1668&height=942&fit=crop&format=pjpg&auto=webp", "width": 1668, "height": 942}, "type": "article"}, "article": {"author": "Wyatt D. Wheeler", "content_tier": "free", "opinion": "false"}, "description": "Becca Kufrin gave him a rose, but Clay Harbor had to give it back.", "fb": {"pages": 63475094632, "app_id": 164654783578465}, "ROBOTS": "NOODP, NOYDIR, max-image-preview:large", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.news-leader.com/gcdn/-mm-/796caad5dc29235db8b2ff50efd578dec4a8bc8e/c=0-319-1668-1261/local/-/media/2018/05/24/Springfield/Springfield/636627703583279712-snldc5-5qm3e3mjcxx1eu6bf2gz-original.jpg?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@springfieldNL", "creator": "@springfieldNL", "title": "Did former Missouri State star Clay Harbor pick football over love on 'The Bachelorette'?", "description": "Becca Kufrin gave him a rose, but Clay Harbor had to give it back."}}, "movies": [], "publish_date": 1528776000.0, "source": "https://www.news-leader.com", "summary": ""}