{"url": "en.wikipedia.org/wiki/Royal_Christmas_Message", "text": "Broadcast made to the Commonwealth realms\n\nThe King's Christmas message (or The Queen's Christmas message in a queen's reign), formally as His Majesty's Most Gracious Speech,[1][2] and informally as the Royal Christmas message) is a broadcast made by the sovereign of the United Kingdom and the other Commonwealth realms to the Commonwealth of Nations each year at Christmas. The tradition began in 1932 with a radio broadcast by King George V via the British Broadcasting Corporation's Empire Service. The message is broadcast on television, radio, and the Internet via various providers. It is usually broadcast at 15:00 GMT on Christmas Day. Unlike some other speeches, such as the King's Speech at the State Opening of Parliament which is written by the government, the Christmas speech is a personal message written by the monarch with input from spouses and direct advisors.[3]\n\nHistory [ edit ]\n\nThe idea for a Christmas message from the sovereign to the British Empire was first proposed by the founding director-general of the British Broadcasting Corporation (BBC), John Reith, in 1922 when he approached King George V about making a short broadcast on the newly created radio service. The King declined, however, believing that radio was mainly an entertainment.[4] Reith approached the King again ten years later, in 1932,[5] as a way to inaugurate the Empire Service (now the World Service) and the King finally agreed after being encouraged to do so by Queen Mary[4] and Prime Minister Ramsay MacDonald.[6] That year, King George V read the first Royal Christmas message, which was scripted by Rudyard Kipling; the King was originally hesitant about using the relatively untested medium of radio, but was reassured after a summertime visit to the BBC and agreed to carry out the concept and read the speech from a temporary studio set up at Sandringham House.[7] The 1934 Christmas broadcast was introduced from Ilmington Manor by 65-year-old Walton Handy, a local shepherd, with carols from the church choir and the bells ringing from the town church, and reached an estimated 20 million people in Australia, Canada, India, Kenya, South Africa and the United Kingdom.[7]\n\nGeorge V giving the 1934 Royal Christmas message\n\nWhile his brother, King Edward VIII, abdicated just before his first Christmas as king, King George VI continued his father's Christmas broadcasts; it was in his 1939 reading delivered in the opening stages of the Second World War that he uttered the famous lines: \"I said to the man who stood at the Gate of the Year, 'Give me a light that I may tread safely into the unknown.' And he replied, 'Go out into the darkness, and put your hand into the Hand of God. That shall be to you better than light, and safer than a known way.'\"[8]\n\nFor many years, the King's speech came at the end of an hour-long broadcast of greeting from various parts of the British Empire and Commonwealth which typically included interviews with ordinary people of many occupations such as an innkeeper in an English village, a miner in South Africa,a lifeguard in Australia, and a Royal Marine Commando - Sergeant Bulpett serving in Malaya, speaking from Singapore (1950) with the King's speech serving as a bond tying the Commonwealth together.[4]\n\nElizabeth II giving the first televised Christmas message, broadcast in 1957\n\nKing George VI's daughter and successor, Queen Elizabeth II, delivered her first Christmas message from her study at Sandringham House, at 3:07 PM on 25 December 1952, approximately ten months after her father's death. Five years later, the message was broadcast on television for the first time.[9] It has been an annual television broadcast every year since, with the exception of 1959 and 1963 when the Queen was heavily pregnant; and 1969: that year, no message was given because a special documentary film, Royal Family, had been produced during the summer in connection with the investiture of the Prince of Wales. It was therefore decided not to do a broadcast at Christmas, but the Queen issued a written message instead.\n\nUntil 1996, the Christmas broadcast was always produced by the BBC; the monopoly was ended when it was announced that, from 1997, the message would be produced and broadcast alternately by the BBC and its main rival, Independent Television News (ITN), with a biennial rotation.[10] It was reported by The Daily Telegraph that this decision was made after the BBC decided to screen an interview with Diana, Princess of Wales, on its current affairs programme Panorama.[11] This was denied by Buckingham Palace which said the new arrangements \"reflect the composition of the television and radio industries today\".[12] Beginning in 2011, Sky News was added to the rotation.[12]\n\nSky News recorded the Queen's Christmas message for Christmas 2012, the Queen's Diamond Jubilee year, and for the first (and only) time it was recorded in 3D.[13] Buckingham Palace was reported to have stated: \"We wanted to do something a bit different and special in this Jubilee year, so doing it for the first time in 3D seemed a good thing, technology wise, to do.\"[13]\n\nUnder the reign of Queen Elizabeth II, the themes and direction of the speeches were decided by the Queen and the text was largely written by the Queen herself, sometimes with assistance from her husband Prince Philip and her staff. In the later years of her reign, the speeches became more personal and religious in tone.[14] Her son and successor, King Charles III, reportedly writes the script of his Christmas messages himself without input from staff.[3]\n\nTraditionally, the message begins with the British national anthem God Save the King (or Queen), (except for 1968, 1986–2000, 2002, and 2007 in which it ended the message).[citation needed]\n\nBroadcast [ edit ]\n\nA British family watching the Queen's Christmas message during the COVID-19 pandemic in 2020.\n\nThe message typically combines a chronicle of that year's major events, with specific focus on the Commonwealth of Nations, and with the sovereign's own personal milestones and feelings on Christmas. It is one of the few instances when the sovereign speaks publicly without advice from any ministers of the Crown in any of the monarch's realms. Planning for each year's address begins months earlier, when the monarch establishes a theme and appropriate archival footage is collected and assembled; the actual speech is recorded a few days prior to Christmas.[7]\n\nTiming:\n\nMessages [ edit ]\n\nGeorge V [ edit ]\n\nEdward VIII [ edit ]\n\nNo message as he abdicated prior to what would have been his first Christmas on the throne.\n\nGeorge VI [ edit ]\n\n1930s [ edit ]\n\nYear Notes Produced\n\nby 1936 No message was delivered, as King Edward VIII had abdicated the throne two weeks prior. [ 7 ] None 1937 In his first broadcast as king, the King recalled his father's broadcasts to the Empire and the reverence listeners had for him. George VI said he could not aspire to replace his father's broadcasts but that nevertheless, as this was his first Christmas as King, he thanked the Empire for its support and loyalty during his first year on the throne. He expressed his pledge to be worthy of his subjects' support. Looking back on 1937, he noted the \"shadows of enmity and of fear\" hanging over parts of the world but turned to the message of Christmas, of peace and good will, and expressed hope that that spirit would prevail and continue to be the keystone of people's lives. [ 7 ] [ 23 ] [ 24 ] BBC 1938 No message was delivered. [ 7 ] None 1939 Delivering his message on the first Christmas of the Second World War the King spoke live from Sandringham House to offer a message of reassurance. He spoke of Christmas as a festival of peace and lamented that \"it is the tragedy of this time that there are powerful countries whose whole direction and policy are based on aggression and the suppression of all that we hold dear for mankind.\" He continued, saying: \"It is this that has stirred our peoples and given them a unity unknown in any previous war. We feel in our hearts that we are fighting against wickedness, and this conviction will give us strength from day to day to persevere until victory is assured.\" He spoke of his pride in the Royal Navy's courage and devotion in its battles in the first months of the war as well as the courage of the merchant marine. He also expressed thanks to the British Expeditionary Force and other armies of the Empire saying that \"Their task is hard. They are waiting, and waiting is a trial of nerve and discipline. But I know that when the moment comes for action they will prove themselves worthy of the highest traditions of their great Service.\" He referred to the nations and colonies of the Empire as a \"Family of Nations which is prepared to sacrifice everything that freedom of spirit may be saved to the world\" and referred to the assistance Britain has received from the rest of the Empire. George VI referred to \"the cause of Christian civilisation\" as what unites the Empire and its Allies, adding that \"On no other basis can a true civilisation be built.\" He concluded with words of encouragement from the poem God Knows by Minnie Louise Haskins: 'I said to the man who stood at the Gate of the Year, \"Give me a light that I may tread safely into the unknown.\" And he replied, \"Go out into the darkness, and put your hand into the Hand of God. That shall be to you better than light, and safer than a known way.\"' [ 7 ] [ 25 ] [ 26 ] BBC\n\n1940s [ edit ]\n\n1950s [ edit ]\n\nElizabeth II [ edit ]\n\n1950s [ edit ]\n\n1960s [ edit ]\n\n1970s [ edit ]\n\n1980s [ edit ]\n\n1990s [ edit ]\n\n2000s [ edit ]\n\n2010s [ edit ]\n\n2020s [ edit ]\n\nYear Notes Produced\n\nby 2020 At the end of a year shaped by the COVID-19 pandemic, the Queen spoke of her great pride in the \"quiet, indomitable\" spirit of those who have \"risen magnificently\" to the challenges of 2020, adding that \"We need life to go on.\" Speaking of mutual assistance during the crisis, she said that \"Remarkably, a year that has necessarily kept people apart has, in many ways, brought us closer.\" To those who have suffered loss, she said \"You are not alone, and let me assure you of my thoughts and prayers.\" She said what many people want \"for Christmas is a simple hug or a squeeze of the hand\" - but \"even on the darkest nights there is hope in the new dawn\". The Queen singled out young people for their part in helping society during the crisis and noted that 2020 was the bicentennial of the birth of Florence Nightingale when voicing a \"debt of gratitude\" to nurses and frontline workers. She also evoked the Parable of the Good Samaritan in praising countless people who have helped strangers during the pandemic. In addition, she noted the centenary commemorations of the entombment of the Unknown Warrior, who as a symbol of \"selfless duty and ultimate sacrifice\" was, for her, a \"source of enduring hope in difficult and unpredictable times\". This was the first Christmas speech available to listen to on Amazon Alexa devices. [ 147 ] [ 148 ] BBC 2021 In what was to be her final Christmas message, the Queen marked the death of her consort, Duke of Edinburgh earlier in the year, remarking that \"although it's a time of great happiness and good cheer for many, Christmas can be hard for those who have lost loved ones. This year, especially, I understand why,\" also referring to the second year of the COVID-19 pandemic. She thanked her subjects for the \"warmth and affection\" shown in the tributes to the Duke of Edinburgh's life, saying she had drawn \"great comfort\" from them. Of Prince Philip, she said: \"His sense of service, intellectual curiosity and capacity to squeeze fun out of any situation were all irrepressible. That mischievous, enquiring twinkle was as bright at the end as when I first set eyes on him.\" She delivered her message while behind a desk in the White Drawing Room at Windsor Castle, accompanied by a single, framed picture of herself and her late husband. She wore a sapphire chrysanthemum brooch which she had worn in 1947, during her honeymoon, and again for her Diamond Wedding celebrations. [ 149 ] [ 150 ] ITN\n\nCharles III [ edit ]\n\nSee also [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Queen%27s_Christmas_message_2020.png/250px-Queen%27s_Christmas_message_2020.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Maple_Leaf_%28from_roundel%29.svg/40px-Maple_Leaf_%28from_roundel%29.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/b/b9/Flag_of_Australia.svg/40px-Flag_of_Australia.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/79/P_christianity.svg/40px-P_christianity.svg.png", "http://en.wikipedia.org/static/images/footer/wikimedia.svg", "http://en.wikipedia.org/static/images/icons/wikipedia.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/16/Ionicons_duplicate-sharp.svg/40px-Ionicons_duplicate-sharp.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/40px-Flag_of_the_United_Kingdom.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Flag_of_Belize.svg/40px-Flag_of_Belize.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Coat_of_arms_of_the_United_Kingdom_%282022%2C_variant_2%29.svg/120px-Coat_of_arms_of_the_United_Kingdom_%282022%2C_variant_2%29.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Royal_broadcast%2C_Christmas_1934_%28Our_Generation%2C_1938%29.jpg/250px-Royal_broadcast%2C_Christmas_1934_%28Our_Generation%2C_1938%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Wikisource-logo.svg/20px-Wikisource-logo.svg.png", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Flag_of_New_Zealand.svg/40px-Flag_of_New_Zealand.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "http://upload.wikimedia.org/wikipedia/en/thumb/7/77/Christmas_broadcast_1957.png/250px-Christmas_broadcast_1957.png", "http://en.wikipedia.org/static/apple-touch/wikipedia.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Flag_of_Jamaica.svg/40px-Flag_of_Jamaica.svg.png", "http://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/Audio-input-microphone.svg/50px-Audio-input-microphone.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/38/Flag_of_Tuvalu.svg/40px-Flag_of_Tuvalu.svg.png", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg"], "top_img": "http://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Royal_Christmas_message", "title": "Royal Christmas message", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "viewport": "width=1120", "og": {"title": "Royal Christmas message - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}