{"url": "www.yourtango.com/2018315268/is-blake-shelton-alcoholic-details-blake-fall-stage-drinking-problem-addiction", "text": "Is Blake Shelton an alcoholic?\n\nIn 2018, country singer and Voice judge Blake Shelton fell on stage while performing at a music festival in Oregon. The following day, he tweeted out a plea for the footage and admitted he had been drinking.\n\n“Ok Pendleton I know somebody is bound to have video of me falling on stage last night,” the 43-year-old wrote. “Please!! I have to see it! Post that sh-t! And yes I had been drinking. A lot…”\n\nAdvertisement\n\nVideo of the singer falling quickly spread around the internet.\n\nIn the video, Shelton is seen losing his balance while holding a microphone. He quickly gets back up and grabs his guitar. While some people found the fall entertaining, many people were not amused.\n\nAdvertisement\n\n“So, that’s the type of quality show that you put on… for people that spend their hard earned money to come see you, is for you to show up drunk?” one follower said. “That’s some Justin Bieber on Hennessy, throwing up on stage, nonsense right there!”\n\nShelton retweeted that message and said, \"Oh I’m sorry ma’am... This account is meant for people who actually have a sense of humor.. We’re not accepting cry baby tweets today.. Maybe try again tomorrow!\"\n\nThis isn't the first time Shelton's drinking has come into the spotlight.\n\nAdvertisement\n\nAfter his divorce from fellow country superstar Miranda Lambert in 2015, rumors began circling that he was headed down a dangerous, alcohol-filled spiral.\n\nIn Touch published a front-page story alleging that he was \"drinking vodka before noon\" and that his friends were begging him to get help. It also claimed that his alleged alcohol addiction is what destroyed his marriage to Lambert.\n\nIn response to the story, Shelton sued the magazine, and though he admitted to posting about drinking and alcohol on social media, he denied the claims that he was a \"raging alcoholic.\"\n\nAmong the claims he said were false, include ones that he had started drinking when he was 14 as a way to cope with his brother's death. Richie Shelton died in a car accident when he was 24 and Shelton was just 14.\n\nAdvertisement\n\nHe also denied the magazine's claims that he went to rehab, and said the fake story was built on \"friend-of-friend gossip\" and a guy who believes he can \"spot alcoholism.\"\n\n“It’s simply a case of Blake having supersized this persona of him having fun and drinking,” said a source close to Shelton in 2015.\n\n\"My tweets are intended to amuse and get a reaction from my fans,\" he explained. \"They are exaggerated figments of my imagination, and from the reactions I get, I think my fans understand that,\" Shelton said in the lawsuit.\n\nHappy Independence Day everybody!!!!! I’m proud to be an American!!! Aaaannnd I’m drinking to celebrate... — Blake Shelton (@blakeshelton) July 4, 2018\n\nIn 2017, it was reported that Shelton's current girlfriend, Gwen Stefani, told him that she wasn't walking down the aisle until he stopped drinking.\n\nAdvertisement\n\nAccording to an insider, he lost 85 pounds that year, thanks to Stefani putting him on a no-drinking diet. However, during that time, he was also seen leaving a liquor store in L.A. with multiple boxes of tequila.\n\n“When Gwen is away, Blake seems to play! Or, at the very least, take a few cheat days,” a source said at the time.\n\nAnd it seems like Shelton is definitely no longer on that \"no-drinking diet,\" since he recently joked about how much vodka he's been drinking during coronavirus quarantine.\n\nIn April 2020, Shelton posted a photo to Instagram showing a line of vodka bottles with the caption, \"My @smithworksvodka is coming along nicely! I think I’ll wait till these guys are a gallon before I pick them. Happy #EarthDay everybody.\"\n\nAdvertisement\n\nHe also made the joke that he's been \"drinking all day\" during the pandemic.\n\nEmily Blackwood is a freelance writer, editor and journalist who covers small business, pop culture, travel, health and wellness.\n\nAdvertisement\n\nEditor's Note: This article was originally posted on July 16, 2018 and was updated with the latest information.", "images": ["https://www.yourtango.com/themes/custom/yourtango/img/ajax-loader.gif", "https://www.yourtango.com/logo.png", "https://www.yourtango.com/sites/default/files/image_blog/BlakeShelton.jpg"], "top_img": "https://www.yourtango.com/sites/default/files/image_blog/BlakeShelton.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.yourtango.com/2018315268/is-blake-shelton-alcoholic-details-blake-fall-stage-drinking-problem-addiction", "title": "Is Blake Shelton An Alcoholic? Details On Blake's Fall On Stage, Alleged Drinking Problem And Addiction", "meta_data": {"description": "Is Blake Shelton an alcoholic? The country singer once admitted to being drunk on stage, but this isn't the first time his drinking has been a problem. And now, he's been drinking a lot while in quarantine.", "abstract": "Emily Blackwood is an editor at YourTango who covers pop culture, dating, relationships and everything in between. Every Wednesday at 7:20 p.m. you", "keywords": "entertainment and news, Blake Shelton, gwen stefani, Miranda Lambert, drinking, alcoholic, addiction, buzz", "robots": "index, follow, max-image-preview:large", "news_keywords": "blake shelton, blake shelton drinking, is blake shelton an alcoholic, blake shelton addict, blake shelton alcoholic, video blake shelton falling, blake shelton rehab, blake shelton drinking problem", "generator": "Drupal 10 (https://drupal.org)", "og": {"site_name": "YourTango", "type": "article", "url": "https://www.yourtango.com/2018315268/is-blake-shelton-alcoholic-details-blake-fall-stage-drinking-problem-addiction", "title": "Is Blake Shelton An Alcoholic? Details On Blake's Fall On Stage, Alleged Drinking Problem And Addiction", "description": "This isn't the first time Blake's been drinking has been in the spotlight.", "image": {"identifier": "https://www.yourtango.com/sites/default/files/image_blog/BlakeShelton.jpg", "width": 940, "height": 469}, "updated_time": "2020-05-21T13:15:00"}, "article": {"author": "https://www.yourtango.com/users/emily-blackwood", "published_time": "2020-05-21T13:15:00", "modified_time": "2020-05-21T13:15:00"}, "twitter": {"card": "summary_large_image", "title": "Is Blake Shelton An Alcoholic? Details On Blake's Fall On Stage, Alleged Drinking Problem And Addiction", "site": {"identifier": "@yourtango", "id": 17490866}, "description": "This isn't the first time Blake's been drinking has been in the spotlight.", "url": "https://www.yourtango.com/2018315268/is-blake-shelton-alcoholic-details-blake-fall-stage-drinking-problem-addiction", "image": {"identifier": "https://www.yourtango.com/sites/default/files/image_blog/BlakeShelton.jpg", "height": 469}}, "viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 102332647006, "pages": 39475817260}, "parsely-tags": "Blake Shelton,gwen stefani,Miranda Lambert,drinking,alcoholic,addiction,buzz,entertainment and news,Andrea Zimmerman - peditor,Samantha Maffucci - seditor,1 - refurb,new template,blog - node,315268 - nid,0 - expert,1 - approve"}, "movies": [], "publish_date": 1590081300.0, "source": "http://www.yourtango.com", "summary": ""}