{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/laurence-fishburne-net-worth/", "text": "What Is Laurence Fishburne's Net Worth?\n\nLaurence Fishburne is an actor, screenwriter, and producer who has a net worth of $30 million. Among Laurence Fishburne's most famous roles are Morpheus in the \"Matrix\" trilogy, Jason Styles in \"Boyz n the Hood,\" and Ike Turner in \"What's Love Got to Do With It.\" Fishburne's other credits include the movies \"Apocalypse Now,\" \"Mystic River,\" and \"Akeelah and the Bee\" and the television shows \"CSI: Crime Scene Investigation\" and \"Black-ish.\"\n\nSalary Highlights\n\n\"The Matrix\" Salaries: Laurence earned a nominal amount of money for appearing in the first \"Matrix\" movie. He then earned $15 million for the second and third installments PLUS 3.75% of the backend which brought his total earnings for those two films up to the roughly $40 million range.\n\n\"CSI\": At his peak of appearing on \"CSI,\" he earned $350,000 per episode, roughly $8 million per season.\n\n\"Hannibal\": For his work on the show \"Hannibal,\" he earned $175,000 over 36 episodes, which works out to around $6.3 million.\n\n\"Black-Ish\": He earns $200,000 per episode of \"Black-ish\" as both a star and an executive producer.\n\nEarly Life and Career Beginnings\n\nLaurence John Fishburne III was born on July 30, 1961, in Augusta, Georgia. He is the son of Hattie, a junior high school math and science teacher, and Laurence Jr., a juvenile corrections officer. Following his parents' divorce, he moved with his mother to Brooklyn, New York. As a youth, Fishburne went to the former Lincoln Square Academy.\n\nLaurence began his first acting role in 1973, playing Joshua Hall on the ABC soap opera \"One Life to Live.\" A few later, he made his feature film debut in the coming-of-age drama \"Cornbread, Earl and Me,\" in which he played a young boy who witnesses the police shooting of a high school basketball star. Later, in 1979, Fishburne had a supporting role in the Vietnam War film \"Apocalypse Now,\" playing Tyrone Miller. Although he began shooting the film when he was only 14, filming took so long that Laurence was 17 upon its completion.\n\nFilm Career in the '80s\n\nIn the early '80s, Fishburne appeared in the dramedy \"Willie & Phil,\" the action film sequel \"Death Wish II,\" and two dramas directed by Francis Ford Coppola: \"Rumble Fish\" and the historical crime film \"The Cotton Club.\" Following a bit part in Steven Spielberg's \"The Color Purple\" in 1985, Laurence starred in the drama \"Quicksilver\" and the action crime thriller \"Band of the Hand.\" Subsequently, Fishburne was in \"A Nightmare on Elm Street 3: Dream Warriors,\" \"Gardens of Stone,\" and \"Cherry 2000,\" all from 1987. The actor closed out the decade with roles in \"Red Heat,\" starring Arnold Schwarzenegger and Jim Belushi, and Spike Lee's \"School Daze,\" in which he had a starring role opposite Giancarlo Esposito and Tisha Campbell.\n\nFilm Career in the '90s\n\nFishburne kicked off the '90s with Abel Ferrara's controversial crime thriller \"King of New York,\" co-starring Christopher Walken, Wesley Snipes, and David Caruso. He was then in the prison film \"Cadence\" and the legal drama \"Class Action.\" One of Fishburne's most famous roles came in 1991 when he starred as Jason \"Furious\" Styles in John Singleton's coming-of-age drama \"Boyz n the Hood.\" Co-starring Ice Cube, Cuba Gooding Jr., Morris Chestnut, Nia Long, and Regina King, among others, the film was a huge success, grossing nearly $60 million and earning two Academy Award nominations. After starring in \"Deep Cover\" in 1992, Laurence had another critical hit with 1993's \"What's Love Got to Do with It.\" In the film, he portrayed Ike Turner opposite Angela Bassett, who played Tina; both Fishburne and Bassett received Academy Award nominations for their performances. Following this, Laurence was in such films as \"Searching for Bobby Fischer,\" \"Higher Learning,\" \"Bad Company,\" \"Just Cause,\" and \"Othello,\" in which he played the titular role.\n\nAmong Fishburne's credits in the latter half of the '90s are \"Event Horizon,\" \"Hoodlum,\" and \"Welcome to Hollywood.\" The actor closed out the decade with his most famous role, playing the hacker-mentor Morpheus in the science-fiction film \"The Matrix.\"\n\nFilm Career in the 2000s and Beyond\n\nIn the early 2000s, Fishburne lent his voice to the animated children's film \"Osmosis Jones\" and reprised his role as Morpheus in two sequels to \"The Matrix,\" both released in 2003. Other credits around this time included \"Mystic River,\" \"Kiss Kiss Bang Bang,\" \"Assault on Precinct 13,\" \"Akeelah and the Bee,\" \"Bobby,\" and \"Five Fingers.\" Later in the decade, Laurence was in films such as \"21,\" \"Armored,\" and \"Black Water Transit.\"\n\nFishburne's credits in the 2010s include \"Contagion,\" \"Ride Along,\" \"Rudderless,\" \"Passengers,\" \"Last Flag Flying,\" and \"The Mule.\" He also appeared in a few superhero films, including \"Man of Steel,\" \"Batman v Superman: Dawn of Justice,\" and \"Ant-Man and the Wasp.\" Additionally, Laurence played 'The Bowery King' in the action sequels \"John Wick: Chapter 2\" and \"John Wick: Chapter 3 – Parabellum.\"\n\nTelevision Career\n\nFollowing his debut on \"One Life to Live,\" Fishburne appeared on television in episodes of \"Trapper John, M.D.,\" \"M*A*S*H,\" \"Strike Force,\" \"Hill Street Blues,\" and \"Miami Vice.\" He was also in the television films \"A Rumor of War\" and \"For Us the Living: The Medgar Evers Story,\" and he played Cowboy Curtis in 17 episodes of \"Pee-wee's Playhouse.\" In the '90s, Laurence was in more television films, including \"Decoration Day,\" \"The Tuskegee Airmen,\" \"Miss Evers' Boys,\" and \"Always Outnumbered,\" the latter two of which he produced.\n\nIn 2008, Fishburne began his biggest television role yet when he joined the cast of \"CSI: Crime Scene Investigation.\" For 60 episodes, he played Dr. Raymond Langston, a college professor and former pathologist. Laurence had another major role starting in 2013, playing Jack Crawford on NBC's \"Hannibal.\" In 2014, he began playing Earl Johnson on the ABC sitcom \"Black-ish.\"\n\nTheatrical Career\n\nBeyond the screen, Fishburne has had an accomplished career on stage. His early credits include \"Eden,\" \"Short Eyes,\" \"Urban Blight,\" and \"Loose Ends.\" In 1992, he won a Tony Award for his performance in the August Wilson play \"Two Trains Running.\" Later, he was in productions of \"Riff Raff,\" \"The Lion in Winter,\" and another August Wilson play, \"Fences.\" In 2008, Laurence starred in the Broadway production of \"Thurgood\" and received the Drama Desk Award for Outstanding One-Person Show.\n\nPersonal Life\n\nIn 1985, Fishburne married Hajna O. Moss. They divorced sometime in the 1990s. They have two children, a daughter and a son. Their son, Langston, was born in 1987, and their daughter, Montana, was born in 1991.\n\nIn 2002, Laurence married actress Gina Torres. They have a daughter, Delilah, who was born in June 2007. Gina and Laurence divorced in 2018 after separating a year earlier.\n\nAt the Cultural Rhythms annual show, he was awarded the Harvard Foundations Artist of the Year Award. He was also given the key to the city of Cambridge, Massachusetts, by Mayor Kenneth Reeves, honoring his abilities as an actor and an entertainer and for being a great humanitarian. In the city of Cambridge, Massachusetts, February 24th has been declared \"Laurence Fishburne Day.\"\n\nReal Estate\n\nIn October 2001, Laurence paid $2.25 million for a 6,000-square-foot home in Los Angeles. Today this home is worth an estimated $5-6 million.", "images": ["https://vz.cnwimg.com/thm/I4dSiTJhq0kprSuO--deoPCEAmQ=/132x132/center/top/filters:format(webp)/2020/06/taylor.png", "https://vz.cnwimg.com/thm/Y5vNtnzZ-azlfvuchXTfNhQfuak=/132x132/center/top/filters:format(webp)/2023/08/John-Singleton.jpg", "https://vz.cnwimg.com/thm/KNDSqD-9inbRekV6AGgXDEG2Scw=/375x35:810x586/132x132/filters:format(webp):strip_exif()/2015/09/GettyImages-476575299.jpg", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "https://vz.cnwimg.com/thm/EMUA_NCcYz6gRDMAOCQ0tvv9XI8=/132x132/center/top/filters:format(webp)/2012/10/walton-goggins-1.jpg", "https://vz.cnwimg.com/wp-content/uploads/2010/03/lf2.jpg?x46379", "https://vz.cnwimg.com/thm/0dOqT2nlNQM7u_J-5xWrCsf2nAw=/132x132/center/top/filters:format(webp)/2020/02/Angelina-Jolie.png", "https://vz.cnwimg.com/thm/Y14fttV9jls9mxFLuNAHJTnNWTE=/132x132/center/top/filters:format(webp)/2019/10/denzel-washington-1.jpg", "https://vz.cnwimg.com/thm/aIyWm9Edlkczrdf5P1OlaCIkZAg=/132x132/center/top/filters:format(webp)/2024/03/Scoot-McNairy.jpg", "https://vz.cnwimg.com/thm/yboGsO77E1kQwELLmrwRZv_4RmE=/132x132/center/top/filters:format(webp)/2017/02/GettyImages-528215436.jpg", "https://vz.cnwimg.com/thm/SGTvPPK_M9bl3A9pEhxYzbqTw9Q=/132x132/center/top/filters:format(webp)/2013/04/Lou-Gossett.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/thm/5ALLhH7P_KfLY7_s3PKliJxdqwY=/600x300/center/top/filters:format(webp)/2010/03/lf2.jpg", "https://vz.cnwimg.com/thm/IoWqGPmFDjvC6iTqcDsspXBuxqo=/132x132/center/top/filters:format(webp)/2018/03/GettyImages-821622848.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/thm/dXuAPIEBU--L_kRib4u0nSzjUtE=/132x132/center/top/filters:format(webp)/2020/04/Megan-Fox.jpg", "https://vz.cnwimg.com/thm/emGEcLqWJn6GXb4RJzQmyim8QYY=/132x132/center/top/filters:format(webp)/2013/02/Gina-Torres-e1597940384234.jpg", "https://vz.cnwimg.com/thm/lY3-oCS-xIdiqDaOi1qHd6UaTjg=/132x132/center/top/filters:format(webp)/2009/09/Cristiano-Ronaldo.jpg", "https://vz.cnwimg.com/thm/UxnQSql1h0QyX1CgkPqKhTxCTHM=/132x132/center/top/filters:format(webp)/2009/09/Jennifer-Aniston.jpg", "https://vz.cnwimg.com/thm/95i5RI1LWkjHyyoolMeto-z_WeU=/132x132/center/top/filters:format(webp)/2020/01/lopez3.jpg", "https://vz.cnwimg.com/thm/KFAqJ9F4o80l6an2fe78-0jw28s=/132x132/center/top/filters:format(webp)/2019/04/rr.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2010/03/lf2.jpg?x46379", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/laurence-fishburne-net-worth/", "title": "Laurence Fishburne Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Laurence Fishburne net worth: Laurence Fishburne is an actor, producer and playwright who has a net worth of $30 million. Laurence Fishburne", "slick": {"wpversion": "3.0.1", "wppostid": 6133, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2010/03/lf2.jpg?x46379", "group": "post", "category": "actors:Actors"}, ";": "richest-celebrities:Richest Celebrities", "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "cnw": {"wppostid": 6133}, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Laurence Fishburne Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/laurence-fishburne-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/03/lf2.jpg?x46379", "site_name": "Celebrity Net Worth", "description": "What is Laurence Fishburne's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2025-03-22T18:26:07+00:00", "published_time": "2021-09-01T23:17:43+00:00", "section": "Actors", "tag": "the matrix net worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/03/lf2.jpg?x46379", "title": "Laurence Fishburne Net Worth", "description": "Laurence Fishburne net worth: Laurence Fishburne is an American actor, director, producer and playwright who has a net worth of $30 million. Laurence Fishburne"}}, "movies": [], "publish_date": 1630538263.0, "source": "https://www.celebritynetworth.com", "summary": ""}