{"url": "https://www.harpersbazaar.com/celebrity/latest/a25306084/gwyneth-paltrow-chris-martin-dakota-johnson-thanksgiving/", "text": "Every product on this page was chosen by a Harper's BAZAAR editor. We may earn commission on some of the items you choose to buy.\n\nThree years after “consciously uncoupling” from Gwyneth Paltrow, Chris Martin found love again with actor Dakota Johnson in 2017. But unlike his marriage to Paltrow, which was very much in the spotlight, Martin kept the details of his relationship with Johnson private—so much so that the two were engaged for years before the public found out.\n\nJohnson has sported a large emerald engagement ring since December 2020, and it looks like the couple is still going strong. Read on for their entire relationship timeline, from their first sushi date to their secret engagement.\n\nJanuary 2024: Johnson and Martin are spotted together in India.\n\nFollowing breakup rumors, Johnson and Martin pop up together in India, where Coldplay is set to play a number of shows. The frontman and the actor are both spotted participating in a religious ceremony at Babulnath Temple, an ancient Hindu house of prayer in Mumbai, as seen in footage shared on Instagram.\n\nIn one clip, Martin stands beside Johnson and speaks with other people at the temple, before noticing he is being recorded—at which point he smiles directly at the camera. In another video, Johnson takes part in the Hindu tradition of whispering her wish into a Nandi bull statue, alongside another woman. They both wear traditional Indian ensembles.\n\nOn another occasion, the couple is photographed visiting Mumbai’s iconic Hanging Gardens. Johnson wears a boho black floral sundress, brown Nike sneakers, and black oval shades, while Martin sports a navy tee, relaxed black slacks, white sneakers, and a sky-blue baseball cap.\n\nBACKGRID\n\nAugust 2024: The couple’s rep shuts down breakup rumors.\n\nOn August 16, a source tells the Daily Mail that Johnson and Martin have broken up. “Chris and Dakota have tried desperately hard over the past few months to make their relationship work,” the source alleges. “They’ll always have love for each other but they’ve both come to the conclusion the relationship cannot be sustained long-term. They’re both busy people, Chris has been in Europe with Coldplay and they both have personal priorities, passions and work commitments which don’t naturally intertwine with each other. They wanted it to work but it just hasn’t, and they’ve now accepted it is best to move on.”\n\nMere hours later, a rep for the couple denies that is the case. Rumors that they broke up are “not true,” the spokesperson tells E!. “They are happily together.”\n\nJune 2024: The couple is still “going strong,” a source says.\n\nA source tells People that the couple are still “going strong,” dismissing any breakup rumors. “They’ve had ups and downs, but now they’re definitely back on,” they add. A few weeks later, Johnson is spotted watching Martin’s Glastonbury Festival performance alongside his children, Apple and Moses.\n\nMarch 2024: Johnson and Martin are officially engaged.\n\nJohnson shares rare details about her relationship with Martin and his children in an interview with Bustle . She calls his son and daughter with Paltrow her stepchildren. “I love those kids like my life depends on it. With all my heart,” she says.\n\nAs for Martin, she says that she adores his performances: “I love watching him,” she says. “I could watch him every day. I don’t know how to explain it. I feel like, I don’t know ... I’m watching my most favorite being do his most favorite thing.” She adds, “When people are really good at things, it is [sexy.]”\n\nJohnson also touches on how she feels about becoming a mother herself one day. “I’m so open to that,” she said. “I’ve gotten to this place where I really want to experience everything that life has to offer. And especially being a woman, I’m like, what a magical fucking thing to do. What a crazy, magical, wild experience. If that’s meant to happen for me, I’m totally down for it. I’ve been really tripping out recently, like, we’re not here for very long. There’s so much to eat up and learn and grow from and experience and feel. That includes all the pain and the suffering and feeling so helpless about the world. Most days, I feel like the most useless piece of shit. I’m sitting in this dumbass chair, talking about this dumbass movie, and there are people in excruciating catastrophes, and what can I do? I do have that incredible friction in myself. And then I’m like, we’re not here for very long, so if I’m meant to be a mother, bring it on.”\n\nDays after Johnson’s interview, a source tells People that Johnson and Martin are engaged. “[They] got engaged years ago but were in no rush to get married,” an insider close to the couple says. People reveals that Johnson’s large emerald ring is an engagement ring.\n\nFebruary 2024: Johnson and Martin vacation in Mexico.\n\nJohnson and Martin are photographed together for the first time in months, this time on vacation in Puerto Vallarta, Mexico. Johnson is seen in a white one-piece bathing suit and holds hands with Martin in a photo published by TMZ .\n\nDecember 2023: Paltrow shares a photo with Johnson.\n\nEarly in the month, Gwyneth Paltrow responds to an Instagram Story Q&A, with one of her fans requesting a “photo with Dakota.”\n\nPaltrow seems happy to oblige, sharing a picture of her and Johnson holding hands while standing in the streets dressed for cold weather. Both wear jeans in the snap, and Paltrow can be seen wearing an army-green coat with a fur hood, while Johnson wears a black barn jacket and a matching black cap.\n\nIn another Q&A in October, Paltrow says she and Johnson are “very good friends.”\n\n“We’re actually very good friends, I love her so much,” she goes on. “She’s an adorable, wonderful person.”\n\nOctober 2023: Johnson attends a Coldplay concert with her mom.\n\nEver the supportive girlfriend, Johnson attends another Coldplay concert—this time bringing along her mother, actor Melanie Griffith, to a show in Pasadena, California. Photos later surface showing Johnson wearing a long leather jacket atop a black top and light pants.\n\nJune 2023: Martin serenades Johnson at a Coldplay concert.\n\nAt a Coldplay concert in Naples, Italy, Martin makes an onstage tribute to Johnson, who watches from the audience. In a video shared by the Daily Mail , the singer walks across the stage, then stops to serenade her. Johnson smiles and blows him a kiss.\n\nApril 2023: Johnson and Martin walk arm-in-arm in Malibu.\n\nJohnson and Martin are seen in Malibu, California, heading out for a coffee run together. Per the Daily Mail , Johnson wears a Bruce Springsteen shirt and a pair of floral tapestry pants by Bode, accessorizing with large sunglasses and a black hat. Martin wears a gray tee, matching sweatpants, and a gray beanie. The two loop arms as they walk together.\n\nMarch 2023: Martin praises Johnson on Conan O’Brien’s podcast.\n\nOn an episode of the , Martin shares how Johnson introduced him to new tactile audio technology, making Coldplay reconsider accessibility at their shows.\n\n“They are called SubPacs,” he explains. “Dakota, my partner, gave me one as a gift because she saw someone online experiencing whatever they are experiencing with this—it’s kind of like body armor —you put it on and plug it in, and it connects to the base.” According to Martin, Johnson had seen the technology being used online and told him that he “should use this somehow.”\n\n“So, we started using it, and it's been so amazing, and it should get better and better,” Martin continues. “We have 10 or 20 now—every night—of those packs, and so if you're hearing-impaired, we have an area where you sign up and you put on the pack and you can feel the show.”\n\nHe added that the SubPacs are expensive but well worth it because “they are amazing and the things that people do to consider other people are just wonderful.”\n\nNovember 2022: Johnson attends a Coldplay concert in Argentina.\n\nIn a full-circle moment, Johnson attends Martin’s Coldplay concert in Buenos Aires, Argentina. In a video posted to X (formerly Twitter), she can be seen having a dance party during his performance.\n\nOctober 2022: Johnson helps Martin heal from an infection.\n\nColdplay announces it will postpone several shows in Brazil due to Martin coming down with a serious lung infection. Later that month, he and Johnson are spotted on a beachside stroll in their home city of Malibu. Johnson wears a white sweatshirt and gray sweatpants, while Martin pairs a graphic tee with a baseball cap and slouchy pants.\n\nJune 2022: The couple travel even more together.\n\nThe couple is photographed together in New York City, where they wear matching pink-and-black outfits. A few weeks later, they are seen in London , where they grab dinner in Mayfair. For the occasion, Johnson wears a coat over a white button-down shirt and black pants, while Martin opts for a casual black sweater, gray sweatpants, and a knit beanie.\n\nJohnson later tells Vanity Fair that she loves to tour with Martin when she’s not working. Martin returns the favor by visiting her on the Boston set of her superhero movie, Madame Web.\n\nJuly 2021: The couple vacation in Spain together.\n\nJohnson and Martin enjoy a vacation in Palma De Mallorca, Spain, where they take a boat ride and are seen taking a leisurely stroll together. They each wear black baseball caps as they link arms, per photos published by E! .\n\nApril 2021: Johnson and Martin grab lunch.\n\nOn April 24, the couple are seen out in Malibu for a lunch and coffee date. Johnson wears a black tank top, ripped jeans, and a green knit hat. Martin, for his part, goes barefoot in gray sweats and a black shirt.\n\nMarch 2021: Johnson sparks engagement rumors.\n\nThe Daily Mail spots Johnson wearing an emerald ring on her left finger, sparking engagement rumors. Neither Johnson nor Martin addresses the rumor.\n\nFebruary 2021: The couple is “still going strong.”\n\nPeople reports that Johnson and Martin are still going strong and are spending time with Martin’s kids, Paltrow, and her husband, Brad Flachuck. According to the publication, the couple is living in the $12.5 million Malibu mansion Martin bought last October.\n\n“Chris was always a big fan of Malibu,” a source tells People. “He loves the beach and often goes surfing and running.” The insider adds: “She seems to enjoy it as much as Chris does. They both love the outdoors and often take beach strolls. They also support local restaurants.”\n\nMarch 2020: Johnson and Martin quarantine together.\n\nThe couple are spotted on a rare public outing with Martin's two children, visiting Disneyland in celebration of Martin’s 43rd birthday.\n\nA few weeks later, Johnson jokes in an interview with , “The key to a healthy relationship” with Martin is having “double sinks” in the bathroom.\n\nOn March 26, Johnson’s close friend Olivia Wilde shares a clip of the couple on Instagram. In the clip, Johnson stands in front of a kitchen sink as she demonstrates her handwashing technique—while pretending Martin’s hands are her own.\n\nOn March 31, Johnson and Martin are spotted taking a break from quarantine as they walk arm-in-arm through Malibu with Johnson’s dog.\n\nFebruary 2020: Martin helps Johnson make her directorial debut.\n\nMartin helps Johnson with a career milestone: On Valentine’s Day, Coldplay releases its music video for the song “Cry Cry Cry.” Johnson directed the romantic video, marking her directorial debut.\n\nJanuary 2020: Paltrow says she “loves” Johnson in her Bazaar cover story.\n\nIn her cover story for Harper’s Bazaar , Paltrow gives Johnson a glowing review.\n\n“I love her,” Paltrow says. “I can see how it would seem weird because it’s sort of unconventional. But I think, in this case, just having passed through it iteratively, I just adore her. I always start to think of the ampersand sign—what else can you bring in, instead of being resistant to or being made insecure by? There’s so much juice in leaning into something like that.”\n\nShe also speaks to her evolving relationship with Martin. “It’s not like there’s a finish line: ‘Oh, we consciously uncoupled; we’re done,’” she explains. “It’s a lifelong commitment to constantly reinvent your relationship with your ex, which you do presumably because you have children together. I don’t see a reason to do it if you don’t have children together. Some people do. But I think we put all the hard work in at the beginning. I would say very rarely is it difficult now. We’ve learned how to communicate with each other. We love each other. We laugh. We have the best of each other. It’s really nice. It makes you feel like you don’t have to lose.”\n\nDecember 2019: Johnson joins Martin, Paltrow, and their children for a ski trip.\n\nJohnson is spotted on a trip to Aspen with Martin, Paltrow, and the former couple’s two children, Apple and Moses. Per photos published by Page Six , Johnson locks arms with Apple while on a coffee run alongside Martin. On Christmas day, Paltrow shares an Instagram post of herself and husband Falchuk in ski gear, indicating he was also on the family trip.\n\nOctober 2019: Paltrow wishes Johnson a happy birthday.\n\nOn October 4, Johnson receives birthday wishes from someone special—and it isn’t Martin. Rather, it was his ex, Paltrow, who shared a black-and-white photo of Johnson and her pet dog to Instagram. “Happy 30th birthday to this absolute gem 💙,” she captioned the celebratory post.\n\nA few days later, E! reports on Johnson’s 30th birthday bash in Malibu. Johnson and Martin arrive at the event together, per the publication, and spend most of the evening by each other’s side. “Dakota and Chris sat side by side watching different musical acts,” a source tells E!. “Dakota and Chris spent a lot of time together. They walked around holding hands or with his hand on her back. They seemed very happy.”\n\nSeptember 2019: Johnson’s mother calls them “an awesome couple.”\n\nGriffith offers more commentary on her daughter’s relationship with Martin. “I love my daughter’s boyfriend. I think that they're an awesome couple,” she tells People .\n\nA source tells the outlet that privacy is key for the couple. “Dakota has been filming out-of-state, but most weekends she comes back to Malibu to spend time with Chris,” the insider says. “They are very low-key together. They usually have friends over and rarely go out.”\n\nAugust 2019: Johnson and Martin get back together.\n\nA Twitter user spots Johnson and Martin at a wrap party for the actor’s upcoming movie, Covers, sparking reconciliation rumors. Shortly after the sighting, Us Weekly confirms the pair has reunited.\n\nThe day after their initial spotting, Martin attends the Los Angeles premiere of Johnson’s new movie, The Peanut Butter Falcon. E! also shares that the couple are back together and “planning to spend more time together later this summer,” per a source.\n\nUs Weekly reports that the couple’s reconciliation is thanks to Martin’s ex, Paltrow. “Gwyneth is the one who pushed them to do it,” a source says, noting that the two had bonded at an April event.\n\nLater that month, Martin, Paltrow, and their respective partners are all spotted in the Hamptons together in photos published by TMZ . Johnson and Martin are also seen enjoying a date night in New York City days later, at Double Zero in the East Village.\n\nJune 2019: Johnson and Martin split.\n\nThe Sun reports that the couple split the month prior, to the surprise of close friends. “Chris and Dakota were very easygoing and always seemed really happy together,” a source told the outlet.\n\nMeanwhile, Express claims that Johnson and Martin “could not have been further apart” when it came to starting a family. A source says, “Chris made it clear he wants more kids as soon as possible but Dakota’s career has really taken off, and that's the last thing she wanted to think about right away. It got to the point, last month, where a light seemed to flick on in both their heads and they realized they were pulling in completely opposite directions—so they decided to call it a day.”\n\nApril 2019: The couple is spotted on a walk.\n\nJohnson and Martin both go barefoot for a walk in the park with her dog, Zeppelin. The outing marks their last before putting their relationship on a brief hiatus.\n\nNovember 2018: Sources claim the couple will “be engaged soon.”\n\nMartin and Johnson eat dinner at Sushi Park, the restaurant where they first sparked dating rumors, shortly after hitting their one-year relationship milestone.\n\nA source tells Us Weekly that the couple will “be engaged soon. Chris is head over heels.” The insider also claims that Martin is holding off on an engagement until after Paltrow weds Falchuk in September. “He wanted to make sure the kids didn’t have too much change all at once,” the source said. “He’s a great dad.”\n\nMartin then spends Thanksgiving with Paltrow and their two children, Apple, 15, and Moses, 13. A source tells E! , “Gwyneth thinks [Johnson] is lovely. She gets on very well with her and is happy for Chris. They’ve spent a good amount of time together and have a very nice friendship.”\n\nOctober 2018: Johnson shuts down pregnancy rumors.\n\nTMZ falsely reports that Johnson and Martin are expecting, claiming that a gender-reveal party is taking place at Martin’s home, where pink and blue balloons are seen floating overhead. Both of Johnson’s parents, as well as celebrities such as Sean Penn and Julia Roberts, attend the event.\n\nRepresentatives quickly clarify that it was a birthday party, and Johnson jokes about the mix-up during an Ellen appearance the next month. “The only thing I’m pregnant with is a lot of really good ideas,” she quips. “But not any babies.”\n\nSeptember 2018: Johnson and Martin debut matching tattoos.\n\nThe weekend of Paltrow’s wedding to Falchuk, Martin supports Johnson at the Global Citizen Festival in New York City. E! notes Martin’s presence in the audience while Johnson speaks onstage about the power of sharing stories of sexual assault.\n\nMore notably, the pair debut identical infinity-sign tattoos on their forearms. E! spots the matching ink when Johnson is photographed at the Venice Film Festival. On her left elbow, there is an infinity-sign tattoo with two Xs. Days prior, Martin was seen at an event in Los Angeles with the same tattoo in a similar location.\n\nA few weeks later, Johnson finally confirms her romance with Martin in her Tatler cover story interview .\n\nJuly 2018: They attend a Radiohead concert.\n\nA Twitter user catches Johnson and Martin attending a Radiohead concert in Boston, seemingly on a double date with Breaking Bad star Aaron Paul and his wife, Lauren.\n\nJune 2018: Johnson and Martin are spotted holding hands on a walk.\n\nThe couple is spotted walking Zeppelin around Malibu. Johnson wears a blue flannel and jeans, while Martin opts for a gray sweatshirt, black trousers, and a blue baseball cap. In pictures published by People , the two can be seen holding hands as they stroll.\n\n“For the past two weeks, they have spent a lot of time together,” an insider tells the publication. “Chris lives in Malibu, and Dakota seems to love hanging out there. They occasionally go for dinner with friends but mostly have friends over at home. They go to the beach together and walks around the neighborhood. They seem to enjoy sharing a quiet life. It does seem they are getting more serious.”\n\nMay 2018: Johnson’s mother says she “adores” Martin.\n\nGriffith gives a glowing review of Martin to People : “I adore him. But she is very private about her life, and I respect that.”\n\nFebruary 2018: The couple parties with Ellen.\n\nJohnson and Martin attend Ellen DeGeneres’s 60th birthday party, an event also attended by Paltrow and fiancé Falchuk. In photos obtained by people, Johnson and Martin can be seen holding hands outside of the festivities while talking to Drew Barrymore.\n\nJanuary 2018: Johnson and Martin make their first public appearance together.\n\nJohnson and Martin step out for a few more dates, including dinner at Soho House, walks on the beach in Malibu, and their first public appearance, at Stella McCartney’s Fall 2018 runway show.\n\n“They walked in holding hands and Dakota was not letting go—she was super into the PDA,” an onlooker tells People . “When Chris let go of her hand, she slipped her arm through his.”\n\nLater that month, Dakota’s father, Don Johnson, offers his take on the relationship rumors in an interview with Digital Spy. “Yeah, that’s … uh, troubling, isn’t it?” he says. “No, she’s a big girl; she can handle herself!”\n\nDecember 2017: Sources confirm their relationship.\n\nThe following month, multiple sources confirm to Us Weekly that the pair is together. “Dakota and Chris are definitely dating,” one insider said. “They’ve gotten to know each other really well and are very comfortable with one another. Chris sends Dakota his music to get her opinion. It’s more than just a fling.”\n\nLater in the month, the couple is spotted at Nick Cave’s concert in Israel. Afterwards, they have dinner at Yam Sheva restaurant in Herzliya. “They came in and they were really, really nice, like extremely nice. It was a surprise,” an eyewitness tells UW. “They sat with Nick Cave too. I didn't see them kiss or hold hands or anything like that. They ordered some starters and not a lot of food.”\n\nNovember 2017: Johnson attends a Coldplay concert.\n\nA month after their sushi date, Johnson watches Martin perform at a Coldplay concert in Buenos Aires, Argentina, where she sits in a VIP box.\n\nOctober 2017: Johnson and Martin grab dinner, sparking dating rumors.", "images": ["https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/x-regular.e414d97.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/bgus-3129252-017-67912a020d403.jpg?crop=0.558xw:0.247xh;0.184xw,0.0341xh&resize=1200:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/caret-left-regular.5546078.svg", "https://hips.hearstapps.com/hmg-prod/images/meghan-holiday-fits-691e00ef409cb.jpg?crop=0.502xw:1.00xh;0,0&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/harpersbazaar/static/images/logos/logo.823d7af.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/bgus-3421290-002-1-691de8f37aca4.jpg?crop=0.909xw:0.606xh;0.0433xw,0.0299xh&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523ffffff&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/harpersbazaar/static/images/logos/network-logo.6416a85.svg?primary=%2523ffffff", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=currentColor&id=link-out-embed", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/envelope-simple-regular.91a0134.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2161692609-69179a58b359b.jpg?crop=0.942xw:0.628xh;0.0577xw,0.0545xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/kim-kardashian-attends-the-alls-fair-disney-premiere-at-news-photo-1762789213.pjpeg?crop=0.627xw:0.939xh;0.257xw,0.0610xh&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=currentColor&id=link-out-embed", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/elsie-hewitt-and-pete-davidson-attend-the-endometriosis-news-photo-1763564487.pjpeg?crop=0.647xw:0.906xh;0.157xw,0.0942xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-880161240-6914ec47eb9c5.jpg?crop=1.00xw:0.716xh;0,0.0126xh&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg?primary=%2523ffffff", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://hips.hearstapps.com/rover/profile_photos/21445446-1bde-4290-a24e-2bdd274be027_1521573573.jpg?fill=1:1&resize=160:*", "https://hips.hearstapps.com/hmg-prod/images/hbz120125wellcoverstoryalt-001-wm-6914f2834facf.jpg?crop=1.00xw:0.801xh;0,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/catherine-princess-of-wales-attends-the-royal-variety-news-photo-1763579857.pjpeg?crop=1.00xw:0.717xh;0,0.107xh&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg", "https://hips.hearstapps.com/hmg-prod/images/bgus-3129252-017-67912b49df613.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/bgus-3129252-017-67912a020d403.jpg?crop=1xw:0.49840561224489793xh;0.184xw,0.0341xh", "https://hips.hearstapps.com/hmg-prod/images/hbz120125wellcoverstory-005-wm-6913797e60a50.jpg?crop=1.00xw:0.801xh;0,0&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/bookmark-simple-regular.9d9d56b.svg", "https://hips.hearstapps.com/hmg-prod/images/hbz120125insidecover-002-wm-691b7df4b0ea2.jpg?crop=1.00xw:0.801xh;0,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/hbz120125wellcoverstory-001-wm-691b81a311761.jpg?crop=1.00xw:0.803xh;0,0.00256xh&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/globe-simple-regular.e7f303c.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/saved.ad81f1a.svg?primary=%2523000000", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=currentColor&id=link-out-embed", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523ffffff&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/olivia-dean-attends-the-2025-aria-awards-at-hordern-news-photo-1763577351.pjpeg?crop=0.631xw:0.929xh;0,0.0189xh&resize=360:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/bgus-3129252-017-67912a020d403.jpg?crop=0.558xw:0.247xh;0.184xw,0.0341xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.harpersbazaar.com/celebrity/latest/a62927697/dakota-johnson-chris-martins-relationship-timeline/", "title": "Dakota Johnson and Chris Martin’s Full Relationship Timeline", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Dakota Johnson and Chris Martin’s Full Relationship Timeline", "description": "Dakota Johnson and Chris Martin’s love story spans back to 2017. Read the timeline of their relationship here.", "theme-color": "#000000", "og": {"site_name": "Harper's BAZAAR", "title": "Dakota Johnson Slips Into a Boho Sundress for a Day in Mumbai With Chris Martin", "description": "The couple is visiting India as part of the Coldplay rocker’s world tour", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/bgus-3129252-017-67912a020d403.jpg?crop=0.558xw:0.247xh;0.184xw,0.0341xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.harpersbazaar.com/celebrity/latest/a62927697/dakota-johnson-chris-martins-relationship-timeline/", "type": "article"}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "opinion": "false", "section": "Celebrity News", "modified_time": "2025-01-22T17:32:00Z", "published_time": "2025-01-22T17:32:00Z"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "parsely-metadata": "{\"socialHeadline\":\"Dakota Johnson Slips Into a Boho Sundress for a Day in Mumbai With Chris Martin\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/bgus-3129252-017-67912a020d403.jpg?crop=1.00xw:0.888xh;0,0.0213xh&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/bgus-3129252-017-67912a020d403.jpg?crop=0.558xw:0.247xh;0.184xw,0.0341xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/bgus-3129252-017-67912a020d403.jpg?crop=1.00xw:0.888xh;0,0.0213xh", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/bgus-3129252-017-67912a020d403.jpg?crop=0.558xw:0.247xh;0.184xw,0.0341xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "timely", "sailthru.excerpt": "Three years after “consciously uncoupling” from Gwyneth Paltrow, Chris Martin found love again with actor Dakota Johnson in 2017. But unlike his marriage to Paltrow, which was very much in the spotlight, Martin kept the details of his relationship with Johnson private—so much so that the two were engaged for", "sailthru.tags": "celebrity,Celebrity,latest,Celebrity News,Harper's BAZAAR-US", "sailthru.date": "2025-01-22 17:32:00", "sailthru.socialtitle": "Dakota Johnson Slips Into a Boho Sundress for a Day in Mumbai With Chris Martin", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1737567120.0, "source": "https://www.harpersbazaar.com", "summary": ""}