{"url": "https://en.wikipedia.org/wiki/A-Teens", "text": "Swedish pop group\n\nThis article is about a Swedish group and is not to be confused with Ateez , a South Korean boy band, or A-Teen , a South Korean internet drama series.\n\nA-Teens (stylized as A*Teens) is a Swedish pop music group[1] from Stockholm. The group was formed by Niklas Berg in 1998 as an ABBA tribute group called ABBA-Teens, which was later renamed A-Teens. The band members are Marie Serneholt, Amit Paul, Dhani Lennevald, and Sara Lumholdt. The group is best known for the singles \"Mamma Mia\" (1999), \"Upside Down\" (2000) and \"Floorfiller\" (2002), all of which were hits worldwide. The group was particularly successful in their home country where they amassed ten top 10 hit singles on the Swedish charts.\n\nAfter six years together, the group disbanded following the release of their Greatest Hits album in May 2004.[2] They reunited as a group in 2024.\n\nHistory [ edit ]\n\n1998–2000: The ABBA Generation [ edit ]\n\nThe original logo that the band used for their first releases under the original name, ABBA-Teens\n\nIn 1998, Marie, Sara, Dhani, and Amit came together to form the ABBA-Teens and began recording their debut album which would consist entirely of covers of ABBA songs. Their first single, \"Mamma Mia\", was first released in April 1999 in their native Sweden where it stayed at number one for eight consecutive weeks. Following this release, the group's name was changed to the A-Teens to avoid litigation.[3][4] \"Mamma Mia\" was released internationally following their name change and became a top 20 hit in over ten countries.[5]\n\nThe official A-Teens logo\n\nIn August 1999, the group released their debut album The ABBA Generation, consisting entirely of ABBA covers reinterpreted with a modern pop and electronic sound. The album reached number one in Sweden and Argentina. In the United States, the album peaked at seventy-one on the Billboard 200 Albums Chart and was certified Gold.[6] The album sold more than 2 million copies worldwide and was certified Gold or Platinum in over 22 countries.[citation needed] Further singles from the album were hits in Sweden: \"Super Trouper\" peaked at number two and \"Gimme! Gimme! Gimme! (A Man After Midnight) peaked at number ten; both songs charted moderately worldwide. \"Happy New Year\" was released as a standalone single in Sweden at the end of 1999 and peaked at number four.\n\nIn March 2000, the group released the single \"Dancing Queen\". The single reached ninety-five on the Billboard Hot 100. Coinciding with this release, the band embarked on a promotional tour of the United States and was an opening act for the Britney Spears tour later that summer.[7] The group made several appearances on Disney and Nickelodeon. In September 2000, the A-Teens won a Viva Music Award for Best International Newcomer.[8]\n\n2001: Teen Spirit [ edit ]\n\nOn 26 February 2001, the group released their second studio album Teen Spirit, which consists entirely of original tracks. It debuted at number two in the Swedish Charts. The album peaked at number thirteen on the European Albums Chart.[9] In the United States, the album peaked at number fifty and was certified gold.[10][11] The album was preceded by the single \"Upside Down\" in October 2000; this was their first single that was not an ABBA cover song.[12] It peaked at number two in Sweden and was certified 2× Platinum.[13] The song reached the top ten in several countries. In the United States, the song was released with the alternate title \"Bouncing Off the Ceiling (Upside Down)\". The song peaked at 93 on the Billboard Hot 100 and the physical single peaked at number six on the Billboard Dance Single Sales component chart.[14][15] The single peaked at number ten in the United Kingdom, becoming their only top ten hit in the country.[16] Later singles from the album were hits in Sweden: \"Halfway Around the World\" peaked at number 7 and \"Sugar Rush\" peaked at number 15.\n\nThe group promoted the album with a forty-three-date tour with Aaron Carter in the U.S.; the group later toured with No Angels in Germany.[7][17][18] The A-Teens also performed on the Radio Disney Live! 2001 World Tour. The same year, Coca-Cola signed the group to become the face of the brand in Thailand.[19] By the end of 2001, Teen Spirit sold over 1 million copies worldwide. In December 2001, the group released the Cathy Dennis-penned track \"Heartbreak Lullaby\". The song was recorded for the European soundtrack of the movie \"The Princess Diaries\". The single became another top ten hit for the band in their home country.[20]\n\n2002–2003: Pop 'til You Drop! and New Arrival [ edit ]\n\nIn June 2002, the group released their third studio album Pop 'til You Drop!. The album was released exclusively in North America and South America.[21] The album debuted and peaked at number forty-five on the Billboard 200 Albums Chart.[22] The album was preceded by the single \"Can't Help Falling In Love\", a cover of the Elvis Presley song, in May 2002. The song was also featured on the soundtrack of the Disney movie Lilo & Stitch.[23] In July 2002, \"Floorfiller\" was released as the second and final single from the album. In the summer of 2002, the group embarked on the Pop 'til You Drop! Tour, a thirty-date tour of the United States and Canada.[24][25] In November 2002, the group performed at the 2002 Swedish Hit Music Awards.[26]\n\nIn January 2003, the group released a reissue of Pop 'til You Drop! titled New Arrival exclusively in markets outside of North America.[27] The album contains seven tracks from Pop 'til You Drop! alongside six new tracks. The album debuted at number four in Sweden and was certified Gold a few weeks after its release.[28] To promote the release, the band embarked on the New Arrival Tour that March, performing shows in Sweden, Denmark, Russia, and Slovakia.[29][30][31] The album was preceded by the European release of \"Floorfiller\", which served as the album's first single and became a top five hit in their home country.[32] The second single taken from the album was \"A Perfect Match\" which peaked at number two in Sweden.[33] \"Let Your Heart Do All the Talking\" was planned as the third single from New Arrival, but its commercial release was later cancelled.[34] In May 2003, the group partnered with the brand Popdrinks for a promotional-only release of the song \"Bounce With Me\" in Sweden.[35]\n\n2004: Greatest Hits and disbandment [ edit ]\n\nIn May 2004, the group released Greatest Hits, a compilation of three new songs and thirteen singles.[36] The album was preceded by the single \"I Promised Myself\", a cover of the Nick Kamen song.[37] The single became another top two hit for the group in Sweden.[38]\n\nFollowing the release of Greatest Hits, the group disbanded; their disbandment was not publicly announced until April 2006.[39]\n\n2024–present: Reunion [ edit ]\n\nIn February 2024, it was announced the group had reformed, and reunited with a performance at the Swedish music competition Melodifestivalen 2024.[40]\n\nThe group said they will be doing \"more together\" as a group and posted about meeting with major record labels in early 2025. They have since announced a tour and possibly new music.\n\nOn 31 May 2025, they performed at Brockwell Park in London as part of the Mighty Hoopla festival.\n\nOn 21 July 2025, the group announced, via their official X account, they will perform in Mexico City, Mexico on 23 October.[41] Due to tickets selling out, on 2 August, the group, along with the concert promoter StarProMX, announced via Instagram a second date in Mexico City on 26 October.[42]\n\nDiscography [ edit ]\n\nTours [ edit ]\n\nThe ABBA Generation Swedish Tour (1999) [ 43 ]\n\nDate (1999) City Country Venue May 22 Västerås Sweden Fiskartorget May 29 Örebro Stortorget June 5 Östersund Stortorget June 12 Umeå Rådhustorget June 19 Luleå Vattenfallsparkernigen/Uttern August 7 Borlänge Liljekvistskan Parken August 14 Växjö Stortorget August 20 Malmö Malmöfestivalen August 28 Karlstad Stora Torget September 4 Stockholm N/A\n\nPromo World Tour (2000)\n\nDate (2000) City Country Venue February 6 Cologne Germany February 12 Kölnarena (Bravo Super Show 2000) February 16 Viña del Mar Chile Quinta Vergara (Festival de Viña del Mar) February 19 Buenos Aires Argentina Much Music Studios February 20 Mar de Plata Unknown Festival April 6 Böblingen Germany Stars 2000 April 22 Burbank United States Free Concert + Fansign July 7 Esbjerg Denmark Skibhøj (Grøn Koncert Esbjerg 2000) July 8 Odense Dyrskuepladsen (Grøn Koncert Odense 2000) July 9 Aarhus Vestereng (Grøn Koncert Aarhus 2000) July 13 Blokhus Hune (Grøn Koncert Hjallerup 2000) July 14 Hornstrup Koncertpladsen (Grøn Koncert Hornstrup 2000) July 15 Næstved Holsted Nord (Grøn Koncert Næstved 2000) July 16 Copenhagen Valbyparken (Grøn Koncert Copenhagen 2000) August 13 Jacksonville United States Jacksonville Memorial Coliseum (Music Mania 2000) September 28 Hanover Germany Comet Awards 2000 November 16 Orlando United States Snick House Underground [ 44 ]\n\nTeen Spirit World Tour (2001) [ 45 ]\n\nDate (2001) City Country Venue February 21 Madrid Spain Sala Pacha April 8 Santiago Chile Centro de Eventos San Carlos Apoquindo April ? Buenos Aires Argentina Unknown May 21 Kuala Lumpur Malaysia Unknown October 21 Ludwigshafen am Rhein Germany Friedrich-Ebert-Halle October 22 Würzburg Carl-Diem-Halle October 24 Oberhausen Arena Oberhausen October 26 Berlin Arena Berlin October 27 Hanover Eilenriedehalle November 4 Frankfurt Jahrhunderthalle November 11 Nuremberg Frankenhalle\n\nPop ‘Til You Drop! Tour (2002) [ 46 ]\n\n— Cancelled date due to equipment technicalities.\n\nDate (2002) City Country Venue July 14 Doswell, VA USA Kingswood Amphitheater July 17 Upper Darby, PA Tower Theater July 19 Columbia, MD Merriweather Post July 28 Richmond, VA Paramount’s Park July 30 Philadelphia, PA TLA August 2 Clarkston, MI DTE Energy Music Center August 3 South Bend, IN 4-H Fair August 4 Minneapolis, MN Orpheum August 7 Chicago, IL Rosemont Horizon August 8 Cuyahoga Falls, OH Blossom Music Center August 10 Valdosta, GA Wild Adventures August 11 Atlanta, GA Hi-Fi Buys Amphitheater August 13 Dallas, TX Fair Park Amphitheater August 15 Orlando, FL House of Blues August 16 Tampa, FL TPAC August 18 Pittsburgh, PA IC Light Amphitheater August 21 Westbury, NY Westbury Music Fair August 23 Hershey, PA Hershey Park August 24 Boston, MA Avalon August 25 Manchester, NH Meadowbrook Amphitheater August 26 Syracuse, NY New York State Fair August 30 Denver, CO Fiddler’s Green August 31 Salt Lake City, UT Thanksgiving Point September 1 San Diego, CA Unknown September 2 Sacramento, CA California State Fair September 4 Phoenix, AZ Celebrity Theater September 8 Santa Clara, CA Unknown November 8 Mexico City Mexico Auditorio Nacional [ 47 ]\n\nGreatest Hits Tour (2004)\n\nCity (2004) City Country Venue April 28 Stockholm Sweden Forum Nacka May 7 Uppsala Gränby Ishall May 19 Gothenburg Liseberg (OKEJ-Dagen 04) May 20 Uddevalla Torp May 21 Linköping Ikanohuset May 22 Löddeköpinge Center Syd May 23 Sundsvall Unknown June 9 Halmstad June 10 Stockholm Skansen June 11 Lund Unknown July 1 Stockholm Kungsträgården July 2 Visby Sverige Radio Gotland July 7 Båstad Stranden July 8 Kristianstad Stora Torg July 14 Örnsköldsvik Inre Hamnen July 15 Gothenburg Kanaltorget July 18 Visby Gutekällaren July 22 August 19 Stockholm Gröna Lund (OKEJ-Dagen 04)\n\nA*Teens GenerationTour (2025)", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/60px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/A-Teens_-_Melodifestivalen_2024%2C_Malm%C3%B6-2_%28cropped%29.jpg/330px-A-Teens_-_Melodifestivalen_2024%2C_Malm%C3%B6-2_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/A_Teens_logo.svg/250px-A_Teens_logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/A-Teens_-_Melodifestivalen_2024%2C_Malm%C3%B6-2_%28cropped%29.jpg/1200px-A-Teens_-_Melodifestivalen_2024%2C_Malm%C3%B6-2_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Logo_of_ABBA_Teens.jpg/250px-Logo_of_ABBA_Teens.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/A-Teens_-_Melodifestivalen_2024%2C_Malm%C3%B6-2_%28cropped%29.jpg/1200px-A-Teens_-_Melodifestivalen_2024%2C_Malm%C3%B6-2_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/A-Teens", "title": "Wikipedia", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/A-Teens_-_Melodifestivalen_2024%2C_Malm%C3%B6-2_%28cropped%29.jpg/1200px-A-Teens_-_Melodifestivalen_2024%2C_Malm%C3%B6-2_%28cropped%29.jpg", "width": 1200, "height": 710}, "title": "A-Teens - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}