{"url": "https://www.inquisitr.com/4665386/kelly-clarkson-reveals-what-its-like-to-double-date-with-blake-shelton-and-gwen-stefani/", "text": "Kelly Clarkson and her husband, Brandon Blackstock, have found the coolest couple to go on a double date with — Blake Shelton and Gwen Stefani. After knowing Shelton for years (Blackstock is his manager), Clarkson started spending time and talking with Stefani after she began dating the country superstar. Clarkson is a big fan of the No Doubt singer, and she says Stefani is the “most chill girl ever.”\n\nWho Wouldn’t Want To Hang With Blake And Gwen?\n\nClarkson told E! News that at first, she was nervous to hang out with the “Rich Girl” singer, but Stefani is such a cool lady that the two instantly became friends. She added that all it takes is meeting Stefani one time and you feel close to her.\n\nThe former American Idol winner says she and her husband double-dated with Stefani and Shelton at Stefani’s home, which she called “magnificent.” She says the first time she walked in, it was like the scene from Pretty Woman where Julia Roberts didn’t belong in the store.\n\nWhen she was at Stefani’s home, she also got the chance to meet members of her family, who Clarkson says are “super rad” and “down to earth.”\n\nThe Superstar Couples Even Have Group Text Messages\n\nClarkson also revealed what it’s like to be part of group texts with her husband and the superstar couple. She says Stefani always starts out with something sweet and positive to say, then she and Shelton take it somewhere else. Clarkson and Shelton are quite competitive, and since they both have songs and albums coming out, they constantly remind each other where they are on the charts. She says their competitive banter is something they will have to get used to since she will be a coach on The Voice next season.\n\nWhen People Magazine named Shelton the “Sexiest Man Alive,” Clarkson told Entertainment Tonight that she thought it was “hilarious,” but she was surprised by all of the negative reaction. She found many of the comments rude and said that Shelton is funny and sexy, and people need to let him be because sexy is different to everyone.\n\nBlake Shelton And Gwen Stefani Debut “You Make It Feel Like Christmas” On The Voice\n\nMeanwhile, Shelton and Stefani looked as cute and sexy as ever while performing their holiday duet You Make It Feel Like Christmas on the most recent episode of The Voice . Before their performance, the couple walked out on stage holding hands while the audience cheered.\n\nAfter their song, the singers shared a hug and Shelton kissed Stefani on the forehead.\n\nShelton told People Magazine that his girlfriend called him when she was writing the song and shared how excited she was about it, which made him happy. Wanting to help, he took out his guitar and wrote some lyrics and a melody for the chorus. When he sent it to Stefani, she immediately decided that the two should sing their lyrics to each other. She planned out the entire song, and Shelton said he couldn’t be more proud.\n\nKelly Clarkson will go head-to-head with Blake Shelton next season on The Voice .", "images": ["https://www.inquisitr.com/wp-content/uploads/2025/10/2421769f-57a4-4bff-913f-cf316747493e.jpg", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20500%20157'%3E%3C/svg%3E", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20492%20142'%3E%3C/svg%3E", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo-white.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/inquisitr-logo.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent-Dark-Mode.png", "https://secure.gravatar.com/avatar/b22e0f663e4d84f04836297310aadfd9?s=120&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20120%20120'%3E%3C/svg%3E"], "top_img": "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "keywords": [], "authors": ["News Writer"], "canonical_link": "https://www.inquisitr.com/kelly-clarkson-reveals-what-its-like-to-double-date-with-blake-shelton-and-gwen-stefani", "title": "Kelly Clarkson Reveals What It’s Like To Double Date With Blake Shelton And Gwen Stefani", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "https://www.inquisitr.com/wp-content/uploads/2024/12/favicon.png", "description": "Kelly Clarkson and her husband, Brandon Blackstock, have found the coolest couple to go on a double date with — Blake Shelton and Gwen Stefani. After knowing", "robots": "follow, index, max-snippet:-1, max-video-preview:-1, max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Kelly Clarkson Reveals What It’s Like To Double Date With Blake Shelton And Gwen Stefani - Inquisitr News", "description": "Kelly Clarkson and her husband, Brandon Blackstock, have found the coolest couple to go on a double date with — Blake Shelton and Gwen Stefani. After knowing", "url": "https://www.inquisitr.com/kelly-clarkson-reveals-what-its-like-to-double-date-with-blake-shelton-and-gwen-stefani", "site_name": "Inquisitr News"}, "article": {"tag": "The Voice", "section": "Entertainment", "published_time": "2017-12-05T10:13:00-05:00"}, "twitter": {"card": "summary_large_image", "title": "Kelly Clarkson Reveals What It’s Like To Double Date With Blake Shelton And Gwen Stefani - Inquisitr News", "description": "Kelly Clarkson and her husband, Brandon Blackstock, have found the coolest couple to go on a double date with — Blake Shelton and Gwen Stefani. After knowing", "site": "@theinquisitr", "creator": "@theinquisitr"}, "generator": "WP Rocket 3.18.3"}, "movies": [], "publish_date": 1512486780.0, "source": "https://www.inquisitr.com", "summary": ""}