{"url": "www.israelnationalnews.com/News/News.aspx/242575", "text": "The Israeli actress, Gal Gadot, who enjoyed a meteoric rise to stardom this year for her performance in the film, “Wonder Women,” has announced that she will star in Tzvi Fishman’s new musical movie, “Queen Esther,” which tells the miracle-filled Purim story of how a woman’s love for her people and her G-d saved the Jewish Nation in ancient Persia – today’s Iran.\n\n“Esther is the real Wonder Woman,” the bright-eyed actress declared. “I am so thankful to the director, Tzvi Fishman, for offering me this opportunity to play the role of Queen Esther – one of my childhood heroines. I am tired of being a seen as a mere beauty queen. A woman is far more than her looks. It’s time for movies to recognize the depth in women, and not just their physical appearance.”\n\nGadot reports that the film will be shot in Israel, in Hebrew, her native tongue. Film funds in Israel all rejected the project, maintaining it was too religious, and that the script, also written by Fishman, is filled with Rightist ideology.\n\nMr. Fishman, who is also the film’s producer, says that money for the budget was raised through a “half-shekel” fundraising campaign.\n\nStarring alongside Gal Gadot will be Israel’s popular actor Yehuda Barkan in the role of Achashveros. The wicked Haman will be played by former United States President Barack Obama, his debut role on the silver screen. Fishman himself will play the male lead alongside Gadot, as Esther’s uncle, Mordechai the Jew, who refuses to bow down to Haman. New Zealand’s popular pop-singer, Lorde, is scheduled for the part of Haman’s wife, Vashti.\n\nFishman, a religious Jew, was asked how he intends to get around the Torah prohibition of hearing the voice of a singing woman in the upcoming movie musical?\n\n“All of the voices of women will be computer generated and dubbed, as if the actresses were doing the singing,” he explained.\n\n“What about the Torah prohibition of gazing at women?”\n\nFishman has an answer for that as well: “All of the actresses will wear masks, in line with the tradition of wearing costumes on Purim.”\n\n“If the lead actress wears a mask all through the film, why did you choose Gal Gadot for the role?”\n\n“She wears a mask all the time,” the long-bearded writer/director who spent years in Hollywood as a successful screenwriter before becoming religious and making aliya, replied. “Like all the Jews in Hollywood. They are all pretending to be successful, secular, American personalities, just like the Gentiles, when they are really all Israeli Jews in exile. Just like it was with the Jews of Shushan in the Purim story.\"\n\n\"In addition, a Jew can pretend to be secular, but all Jews are believers beneath their costumes and masks. It’s our hope that this film of the Purim story will wake up Jews to recognize their true selves and inspire them to cast off their masquerades and return to Israel and Torah. Happy Purim! Purim Sameach!”\n\n(Note: Tzvi Fishman was awarded the Israel Ministry of Education Prize for Jewish Culture and Creativity. Before making Aliyah to Israel in 1984, he was a successful Hollywood screenwriter. He has co-authored 4 books with Rabbi David Samson, based on the teachings of Rabbis A. Y. Kook and T. Y. Kook. His other books include: \"The Kuzari For Young Readers\" and \"Tuvia in the Promised Land\". His books are available on Amazon. Recently, he directed the movie, \"Stories of Rebbe Nachman.\" )", "images": ["https://2.a7.org/files/pictures/000/773883.jpg", "data:image/svg+xml,%3csvg%20xmlns='http://www.w3.org/2000/svg'%20class='ionicon'%20viewBox='0%200%20512%20512'%3e%3ctitle%3eMail%3c/title%3e%3crect%20x='48'%20y='96'%20width='416'%20height='320'%20rx='40'%20ry='40'%20fill='none'%20stroke='%230069b3'%20stroke-linecap='round'%20stroke-linejoin='round'%20stroke-width='32'/%3e%3cpath%20fill='none'%20stroke='%230069b3'%20stroke-linecap='round'%20stroke-linejoin='round'%20stroke-width='32'%20d='M112%20160l144%20112%20144-112'/%3e%3c/svg%3e", "https://2.a7.org/files/pictures/781x439/773883.jpg"], "top_img": "https://2.a7.org/files/pictures/000/773883.jpg", "keywords": [], "authors": ["Arutz Sheva Staff"], "canonical_link": "https://www.israelnationalnews.com/news/242575", "title": "Purim Spiel: Gal Gadot slated to play Queen Esther", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "robots": "index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1", "fb": {"app_id": 194476697237012}, "twitter": {"card": "summary", "site": "ArutzSheva_En", "title": "Purim Spiel: Gal Gadot slated to play Queen Esther", "description": "Exclusive to Israel National News.", "image": {"identifier": "https://2.a7.org/files/pictures/000/773883.jpg", "alt": "Israel National News"}}, "og": {"url": "https://www.israelnationalnews.com/news/242575", "locale": "en", "site_name": "Israel National News", "type": "website", "title": "Purim Spiel: Gal Gadot slated to play Queen Esther", "description": "Exclusive to Israel National News.", "image": {"identifier": "https://2.a7.org/files/pictures/000/773883.jpg", "alt": "Israel National News"}}, "description": "Exclusive to Israel National News.", "image": {"image": "https://2.a7.org/files/pictures/000/773883.jpg", "alt": "Israel National News"}, "alt": "Gal Gadot", "keywords": "Purim,Gal Gadot,Tzvi Fishman", "time": "2018-03-01T11:26:00", "author": "Arutz Sheva Staff", "section": "Jewish News", "tag": "Purim", "canonical": "https://www.israelnationalnews.com/news/242575", "date": "2018-03-01T11:26:00", "metaCategory": "Jewish News"}, "movies": [], "publish_date": null, "source": "http://www.israelnationalnews.com", "summary": ""}