{"url": "www.vividseats.com/concerts/blake-nation-blake-shelton-tribute-tickets.html", "text": "Blake Nation - Blake Shelton Tribute has become one of the top Country and Folk artists in the 2025 music scene, delighting fans with a unique Country and Folk sound. Blake Nation - Blake Shelton Tribute tickets provide an opportunity to experience the Blake Nation - Blake Shelton Tribute concert live and in person.\n\nWhere can I buy cheap Blake Nation - Blake Shelton Tribute tickets? No matter what you're looking to spend, Vivid Seats has you covered, with options for cheap Blake Nation - Blake Shelton Tribute concert tickets. Currently, the cheapest price for Blake Nation - Blake Shelton Tribute tickets is $101.\n\nWhen is the next Blake Nation - Blake Shelton Tribute concert? Vivid Seats has full Blake Nation - Blake Shelton Tribute tour info for all announced shows. Check above to see the next available Blake Nation - Blake Shelton Tribute concert.\n\nWill Blake Nation - Blake Shelton Tribute Tour in 2025? Blake Nation - Blake Shelton Tribute tour dates for 2025 or 2026 may be available now. For any confirmed future Blake Nation - Blake Shelton Tribute tour dates, Vivid Seats will have tickets. View all top 2025 concerts and tour information for top artists.\n\nBlake Nation - Blake Shelton Tribute Floor Seats Blake Nation - Blake Shelton Tribute floor seats can provide a once-in-a-lifetime experience. Often, floor seats/front row seats can be some of the most expensive tickets at a show. Sometimes Vivid Seats offers VIP Blake Nation - Blake Shelton Tribute meet and greet tickets, which can cost more than front row seats or floor tickets. The highest-priced tickets for Blake Nation - Blake Shelton Tribute are often front row or center stage.\n\nIs Vivid Seats Legit for Blake Nation - Blake Shelton Tribute Tickets? Yes! Vivid Seats is a trusted ticket marketplace used by over 100 million fans. When you buy Blake Nation - Blake Shelton Tribute tickets on Vivid Seats, every order is backed by our 100% Buyer Guarantee. That means your purchase is safe, your tickets will arrive before the event, and they’ll be valid or your money back.\n\nAre Tickets Guaranteed on Vivid Seats? Absolutely. Every Blake Nation - Blake Shelton Tribute ticket sold on Vivid Seats comes with our 100% Buyer Guarantee, which ensures: Your transaction will be secure.\n\nYour tickets will be delivered before your event.\n\nYour tickets will be valid and authentic or your money back. Our mission is to make buying Blake Nation - Blake Shelton Tribute tickets stress-free, so you can focus on enjoying your event.\n\nDoes Vivid Seats Charge Fees? Vivid Seats uses All-In Pricing, so you’ll see the full cost of a Blake Nation - Blake Shelton Tribute ticket—including fees—upfront as you shop. No surprises at checkout. We also work hard to keep prices competitive, making it easier for fans to find affordable seats to see Blake Nation - Blake Shelton Tribute live.\n\nWill Vivid Seats Seat You Together? We guarantee that tickets purchased together will be together, unless otherwise noted in the listing.\n\nWhat Happens if My Event is Canceled or Postponed? If your event is canceled, you’ll receive a full refund. If an event has been postponed or rescheduled, rest assured that your tickets will be valid for the rescheduled date. For some rescheduled events, the primary source of the tickets will reissue all previously purchased tickets with new bar codes. If this occurs, the seller will notify us, and we will deliver new tickets to you and remind you to discard your old tickets.\n\nDoes Vivid Seats Have a Rewards Program? Yes! Vivid Seats offers the industry’s only leading ticket company with a loyalty program: Vivid Seats Rewards. Fans earn credit on every purchase, which can be redeemed for future tickets. The more events you attend, the more perks you unlock: A free 11th ticket after 10 purchases\n\nBirthday rewards\n\nSeat upgrades and VIP parties\n\nExclusive experiences like on-field passes to your favorite team", "images": ["https://a.vsstatic.com/mobile/app/category/country.jpg", "https://media.vsstatic.com/image/upload/if_fc_gte_1/g_auto,q_auto,c_fill,w_680,h_680/if_else/g_center,q_auto,c_fill,w_680,h_680/if_end/dpr_auto,f_auto/hero/category/14-country-folk/country-folk-tickets-1.jpg"], "top_img": "https://a.vsstatic.com/mobile/app/category/country.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.vividseats.com/blake-nation-blake-shelton-tribute-tickets/performer/79522", "title": "Blake Shelton Tribute Tickets & 2025 Tour Dates", "meta_data": {"description": "Get Blake Nation - Blake Shelton Tribute tickets, 2025 - 2026 tour information and the Blake Nation - Blake Shelton Tribute concert schedule from Vivid Seats. 100% Buyer Guarantee!", "keywords": "Blake Nation - Blake Shelton Tribute tickets", "og": {"image": "https://a.vsstatic.com/mobile/app/category/country.jpg", "site_name": "Vivid Seats", "url": "https://www.vividseats.com/blake-nation-blake-shelton-tribute-tickets/performer/79522", "title": "Blake Nation - Blake Shelton Tribute Tickets & 2025 Tour Dates", "description": "Get Blake Nation - Blake Shelton Tribute tickets, 2025 - 2026 tour information and the Blake Nation - Blake Shelton Tribute concert schedule from Vivid Seats. 100% Buyer Guarantee!"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=5", "application-name": "Vivid Seats", "msapplication-TileColor": "#333333", "msapplication-config": "https://a.vsstatic.com/common/favicon/browserconfig.xml", "theme-color": "#ffffff", "google-play-app": "app-id=com.vividseats.android", "itunes": "app-id=963355757", "apple-mobile-web-app-capable": "yes", "format-detection": "telephone=yes", "apple-mobile-web-app-title": "Vivid Seats"}, "movies": [], "publish_date": null, "source": "http://www.vividseats.com", "summary": ""}