{"url": "https://www.inquisitr.com/3918445/lea-michele-remembers-corey-monteith-in-getaway-car-and-a-rare-photo/", "text": "Lea Michele has often shared her grief over the loss of her late boyfriend and Glee co-star, Corey Monteith, and, while time may have dulled that loss, the Glee actress shares that she has never completely moved pass the loss of Monteith. Lea again shared a memory of Corey with her Instagram followers, posting a dated picture of Corey and herself. While that photo was shared without a word to mark the memory, Michele recently took to the stage to share a few songs that seemed to have given even greater tribute to Monteith and Lea’s relationship with the late actor.\n\nGlee Alum Lea Michele Shares Another Photo Of Corey Monteith And Herself\n\nBillboard shares that Corey Monteith was on Lea’s mind even more so than usual this past week, as the Glee and Scream Queens star took an opportunity to share another photo from her collection. This time, the picture looked more candid and spur of the moment, taken long before Instagram. The image of Michele and Monteith was seems to be an older picture, taken in the days of the Polaroid Instant Camera, though, considering Lea posted many similar images, it may be possible that she was making use of a new app or filter.\n\nThe picture of Lea and Corey shows Ms. Michele snuggling close to her Glee co-star, as Monteith wraps his arms around her in a protective embrace. While the Glee actress didn’t caption this image, the photo seems to speak for itself, alluding to their relationship as it was then. It also speaks to Michele’s state of heart now, remembering Corey after his passing.\n\nWhile the Instagram posting’s caption is blank, Ms. Michele’s handwriting on the white portion of the Polaroid picture indicates that the photo was taken on New York City’s Bleeker Street, sometime in 2012.\n\nLea Michele Remembers Corey Monteith In Song With “Getaway Car”\n\nE! News shares that Lea Michele has been keeping her vocal chords in shape by pursuing her singing interests at Los Angeles’ The Hotel Café, where Michele’s song set seemed to have a theme. The intimate venue gave fans a more personal experience with Lea, as she sang songs such as “To Make You Feel My Love” and “My Man.” While the Glee star didn’t mention Corey Monteith by name, it seemed apparent that the romantic theme of the songs was directed at her late lover.\n\nOne song in particular, “Getaway Car,” seemed to be a very specifically honoring of Lea’s relationship with Monteith.\n\n“We used to just get in the car and drive sometimes. Me and the tall guy and it was like our getaway and it was so great,” Ms. Michele said, introducing the song. “You know, and everything was getting big and popular with Glee and it was sort of our escape. So this next song is called ‘Getaway Car’ and its having that moment in the car.”\n\nPreviously, Lea Michele shared a very poignant image of Corey with the late actor walking away from the camera and towards the deep blue ocean. Captioning that image, Ms. Michele remarks on the importance of her memories and recognizes that, even with a fleeting life, the past is a treasure.\n\n“We may not have gotten to share a lifetime together…but the memories…they’re the best of my life,” Lea captioned that picture. “Love you Cory.”\n\nThere are moments shared between Lea Michele and Corey Monteith that will always remain private, locked away as the treasures they are, which only serves to make these rare glimpses into their love that much more precious.\n\nNext up for Lea Michele, she will be starring in Dimension 404 , alongside Robert Buckley and Sarah Hyland.\n\n[Featured Image by Michael Buckner/Getty Images]", "images": ["https://www.inquisitr.com/wp-content/uploads/2025/10/2421769f-57a4-4bff-913f-cf316747493e.jpg", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20500%20157'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20492%20142'%3E%3C/svg%3E", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo-white.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/inquisitr-logo.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent-Dark-Mode.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent.png", "https://secure.gravatar.com/avatar/1f3cc16798fd2e4fe9bd2ae5e739efe6?s=120&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20120%20120'%3E%3C/svg%3E"], "top_img": "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "keywords": [], "authors": ["News Writer"], "canonical_link": "https://www.inquisitr.com/lea-michele-remembers-corey-monteith-in-getaway-car-and-a-rare-photo", "title": "Lea Michele Remembers Corey Monteith In ‘Getaway Car’ And A Rare Photo", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "https://www.inquisitr.com/wp-content/uploads/2024/12/favicon.png", "description": "Lea Michele has often shared her grief over the loss of her late boyfriend and Glee co-star, Corey Monteith, and, while time may have dulled that loss, the", "robots": "follow, index, max-snippet:-1, max-video-preview:-1, max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Lea Michele Remembers Corey Monteith In ‘Getaway Car’ And A Rare Photo - Inquisitr News", "description": "Lea Michele has often shared her grief over the loss of her late boyfriend and Glee co-star, Corey Monteith, and, while time may have dulled that loss, the", "url": "https://www.inquisitr.com/lea-michele-remembers-corey-monteith-in-getaway-car-and-a-rare-photo", "site_name": "Inquisitr News"}, "article": {"tag": "scream queens", "section": "Entertainment", "published_time": "2017-01-25T04:15:00-05:00"}, "twitter": {"card": "summary_large_image", "title": "Lea Michele Remembers Corey Monteith In ‘Getaway Car’ And A Rare Photo - Inquisitr News", "description": "Lea Michele has often shared her grief over the loss of her late boyfriend and Glee co-star, Corey Monteith, and, while time may have dulled that loss, the", "site": "@theinquisitr", "creator": "@theinquisitr"}, "generator": "WP Rocket 3.18.3"}, "movies": [], "publish_date": 1485335700.0, "source": "https://www.inquisitr.com", "summary": ""}