{"url": "https://www.biography.com/people/margot-robbie-112217", "text": "1990-present\n\nLatest News: Barbie Star and Producer Margot Robbie Competes for Best Picture at the 2024 Oscars\n\nActor Margot Robbie made a splash as the star of Barbie, particularly during the press tour ahead of the movie’s July 2023 release when she wore iconic Barbie outfit after iconic Barbie outfit. But Robbie, 33, did more than bring the famous doll to life. She also had a major hand in bringing last year’s biggest blockbuster to life as one of the movie’s producers. Now, she and her coproducers have the chance to bring home Oscar trophies for Best Picture at the 2024 Academy Awards.\n\nSince this year’s Oscar nominations were announced in January, Robbie’s absence from the Best Actress race has been cited as one of the biggest snubs, alongside Barbie director Greta Gerwig’s in the directing category. For her part, Robbie isn’t sweating it.\n\n“There’s no way to feel sad when you know you’re this blessed,” she said at a recent SAG-AFTRA screening of the movie. “Obviously I think Greta should be nominated as a director, because what she did is a once-in-a-career, once-in-a-lifetime thing, what she pulled off, it really is. But it’s been an incredible year for all the films.”\n\nA win on March 10 would mark Robbie’s first Oscar, though she has been nominated twice before for her leading and supporting roles in I, Tonya and Bombshell, respectively.\n\nWho Is Margot Robbie?\n\nMargot Robbie is an Academy Award–nominated actor known for her roles as Harley Quinn in Suicide Squad and controversial figure skater Tonya Harding in the biopic I, Tonya. Following in the footsteps of her Australian countrywomen Nicole Kidman and Cate Blanchett, Robbie first took the film world by storm in Martin Scorsese’s 2013 movie The Wolf of Wall Street. More recently, she portrayed actor Sharon Tate in Quentin Tarantino’s Once Upon a Time... in Hollywood and earned a supporting Oscar nod for her role in Bombshell. In July 2023, Robbie headlined and produced the Greta Gerwig–directed Barbie movie, which became the year’s highest-grossing blockbuster and earned a Best Picture Oscar nomination.\n\nQuick Facts\n\nFULL NAME: Margot Elise Robbie\n\nBORN: July 2, 1990\n\nBIRTHPLACE: Dalby, Queensland, Australia\n\nSPOUSE: Tom Ackerley (2016-present)\n\nASTROLOGICAL SIGN: Cancer\n\nChildhood and Early Career on Neighbours\n\nMargot Elise Robbie was born in Dalby, Queensland, Australia on July 2, 1990, and grew up in Gold Coast, a city 500 miles north of Sydney. Her mother, Sarie Kessler, is a physiotherapist who raised her and her three siblings after her parents divorced. Her father is Doug Robbie.\n\nRobbie told Vanity Fair that she thought she might be a magician, but an interest in drama in high school led her to Melbourne and a kids’ show, The Elephant Princess, co-starring the up-and-coming Liam Hemsworth. She has been professionally acting since her teens.\n\nBefore she left for Hollywood, Australian audiences knew her from the TV soap opera Neighbours, which began airing five years before her birth. Fearing she failed her audition, she decided to vacation in Canada but had to return quickly when she found out she had won the part of the vivacious Donna Freedman in 2008. Donna’s kiss with a female friend stirred controversy, though she remained a viewer favorite and was nominated for several awards. She left Neighbours in 2010 (in a “boring old happy ending”), and her first American TV show, Pan Am (2011), crash-landed after one season.\n\nHollywood Breakthrough: Wolf of Wall Street and Focus\n\nGetty Images Leonardo DiCaprio and Margot Robbie attend a 2014 premiere of The Wolf of Wall Street. Robbie’s role as the wife of DiCaprio’s Jordan Belfort helped launch her mainstream career.\n\nFew remember Robbie’s debut film, the Australian-made I.C.U., a serial killer thriller shot when she was 17 and released in 2009. Her part in Richard Curtis’ time-travel rom-com About Time (2013), with Domhnall Gleeson and Rachel McAdams, made more of a splash. But it was her role as Naomi, Leonardo DiCaprio’s Brooklyn bombshell wife and “the Duchess of Bay Ridge,” in Martin Scorsese’s based-on-a-true-story epic of financial flim-flammery The Wolf of Wall Street (2013) that turned heads.\n\nRobbie also got attention for her small but standout role playing herself in The Big Short in 2015. The comedic scene involved her explaining mortgage-backed securities and subprime loans, all the while floating in a tub of bubbles with champagne in hand.\n\nThat year also saw her first lead roles. Robbie co-starred opposite Will Smith in Focus, playing con artists who steal each other’s hearts. She also starred in the sci-fi drama Z for Zachariah.\n\nHarley Quinn in Suicide Squad\n\nOne of Robbie’s most notable roles is as the punkily attired fan fave Harley Quinn. She first appeared in the role in the comics-based smash Suicide Squad (2016). Harley Quinn is the psycho psychiatrist who is a muse to Jared Leto’s Joker. Robbie told The Washington Post that diving into a vat of “gluggy paint stuff” to bleach Harley’s skin in one scene was “the most unpleasant thing I’ve ever done in my entire life,” and her spiky accoutrement wasn’t exactly comfortable either.\n\nRobbie planned to reprise her popular characterization of Harley Quinn in Gotham City Sirens, though that project was shelved in favor of another spin-off Birds of Prey, which co-starred Ewan McGregor and hit theaters in February 2020. Robbie again portrayed Harley Quinn in 2021’s The Suicide Squad.\n\nMore Movies: The Legend of Tarzan, Once Upon a Time, and Bombshell\n\nAlso in 2016, Robbie starred as Jane in The Legend of Tarzan, with Alexander Skarsgard, and the following year she played the wife of Winnie the Pooh author A.A. Milne in the historical drama Goodbye Christopher Robin.\n\nRobbie then landed in another high-profile project by portraying actor Sharon Tate, a real-life victim of the notorious Charles Manson–orchestrated murders of 1969, alongside Leonardo DiCaprio and Brad Pitt in Quentin Tarantino’s 2019 feature Once Upon a Time... in Hollywood.\n\nLate in 2019, Robbie enjoyed an even more prominent role in Bombshell, a retelling of the sexual harassment allegations that rocked Fox News under the oversight of former CEO Roger Ailes. Although her character of Kayla Pospisil was a fictional composite—unlike the portrayals of Megyn Kelly by Charlize Theron and Gretchen Carlson by Nicole Kidman—Robbie brought her “Christian millennial” character to life with a nuanced performance, impressing enough to earn Golden Globe and Academy Award nominations Best Supporting Actress.\n\nPlaying Tonya Harding in I, Tonya\n\nGetty Images Tonya Harding and Margot Robbie attend the 2018 Golden Globe Awards.\n\nA 3-year-old toddler when the 1994 Winter Olympics were held, Robbie had no idea who figure skater Tonya Harding was or what the infamous “whacking incident” involving competitor Nancy Kerrigan was all about. But Robbie dove headlong into her starring role as Harding for 2017’s darkly comedic biopic I, Tonya, recreating her every gesture as closely as possible. She did meet Harding, though limited their time together to a couple of hours prior to the completion of filming—“otherwise I might have too much empathy for her,” she said after its premiere screening at the Toronto International Film Festival.\n\n\n\nFor the movie, Harding’s famous triple axel was recreated digitally, but Robbie performed some of the skating routines on her own accord and impressed enough with her overall performance to earn Golden Globe and Academy Award nominations for Best Actress.\n\nThe movie was also the first release for Robbie’s Los Angeles–based production company, LuckyChap Entertainment, which she founded with her husband and two friends years earlier. Since its 2014 beginnings, the company’s goal has been to place a focal point on female-led stories in movies and television, which LuckyChap has accomplished with films like I, Tonya, Birds of Prey, Promising Young Woman (2020), and shows like Hulu’s Dollface.\n\nRecent Movies: Amsterdam, Babylon, and Asteroid City\n\nIn recent years, Robbie’s star power has continued to shine. After reprising her role as Harley Quinn in Birds of Prey (2020) and The Suicide Squad (2021), the actor moved on to 2022’s Amsterdam. In the period piece set during World War I, Robbie plays Valerie Voze, a nurse who helps two injured soldiers played by Christian Bale and John David Washington. The film loosely follows a conspiracy plot to remove President Franklin D. Roosevelt from office and replace him with a dictator.\n\nThat same year saw the release of Babylon, in which Robbie’s Nellie LaRoy and other characters try to live out their dreams of achieving Hollywood fame and stardom in the 1920s. In the rapidly evolving film industry, Nellie struggles to adapt and succumbs to vices that include drug use and gambling, which jeopardize her it girl status and career. The role earned Robbie her third Golden Globe nomination and second for Best Actress.\n\nRobbie was also among the star-studded cast in Wes Anderson’s 2023 Asteroid City, which offers a meta-story-within-a-story plot that takes place in a 1950s desert town. Other cast members included Jason Schwartzman, Scarlett Johansson, Tom Hanks, Tilda Swinton, Edward Norton, Adrien Brody, and Maya Hawke.\n\nBarbie\n\nGetty Images Margot Robbie attends the Barbie premiere in a black evening gown inspired by the 1960s “Solo in the Spotlight” Barbie doll.\n\nIn 2019, Warner Bros. and Mattel announced Robbie would take on the role of Barbie in Greta Gerwig’s highly anticipated Barbie live-action movie. Robbie’s LuckyChap Entertainment coproduced the project.\n\nDuring the press tour leading up to the film’s July 2023 release, Robbie wore some of Barbie’s most iconic looks throughout the years, including 1990s “Enchanted Evening” doll, 1960s “Solo in the Spotlight” doll, the 1992 “Totally Hair” doll, and a dress inspired by the 1959 Black and White swimsuit Barbie.\n\nThe internet collectively obsessed over the opening shot in a Barbie trailer that showed a pair of feet—soon revealed to be Robbie’s—sliding out of heeled sandals and not losing the tip-toe arched stance of an actual Barbie doll’s feet. Robbie, who is 5-foot-6, has previously mentioned that having “big feet” can be embarrassing when she can’t find heels in her size but recently said she’s “really flattered that people are excited about my feet.”\n\nIn the movie, Robbie’s Barbie has an existential crisis that takes her away from Barbie Land and brings her to the real world. Ryan Gosling costarred as Ken, while other Hollywood heavyweights, like Simu Liu, play different iterations of the Ken doll. Issa Rae, Will Ferrell, Kate McKinnon, America Ferrera, Emma Mackey, Dua Lipa, and Michael Cera also appear in the film. It debuted the same day as the equally anticipated biopic Oppenheimer, leading moviegoers to dub the joint release “Barbenheimer.”\n\nBarbie became the highest-grossing film of 2023 and set numerous records, including the highest-earning movie directed by a woman. That success translated into a slew of award nominations and the 2024 Golden Globe for Cinematic and Box Office Achievement, which Robbie and Gerwig accepted on behalf of the team. Individually, Robbie received a Golden Globe nomination for Best Actress in a Motion Picture – Musical or Comedy and an Oscar nod for Best Picture as one of the film’s producers. Her absence from the Best Actress race at the 96th Academy Awards was considered one of the year’s biggest snubs.\n\nHusband\n\nGetty Images Margot Robbie and husband Tom Ackerley in June 2023\n\nRobbie met assistant director Tom Ackerley on the World War II drama Suite Francaise (2014). The two began dating and eventually got married in December 2016. They don’t have any children.\n\nNet Worth\n\nRobbie’s net worth shot up significantly in 2023 thanks to the actor’s starring role in Barbie. According to Variety, Robbie’s salary for the role was $12.5 million, boosting her total net worth to an estimated $40 million.\n\n\n\nFact Check: We strive for accuracy and fairness. If you see something that doesn’t look right, contact us!", "images": ["https://www.biography.com/_assets/design-tokens/biography/static/images/logos/logo.5ec9b18.svg?primary=%2523ffffff", "https://www.biography.com/_assets/design-tokens/biography/static/images/logos/network-logo.04aa008.svg?primary=%2523ffffff", "https://hips.hearstapps.com/rover/profile_photos/71bac948-b37f-4445-8996-b256aa56c01f_1734448805.jpg?fill=1:1&resize=120:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-150742993.jpg?crop=1xw:0.8888888888888888xh;center,top&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/actors-paul-newman-and-robert-redford-attend-the-sundance-news-photo-1758031823.pjpeg?crop=0.695xw:1.00xh;0.146xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/margot-robbie-attends-the-new-york-premiere-of-asteroid-news-photo-1689698979.jpg?crop=0.733xw:0.489xh;0.107xw,0.0363xh&resize=640:*", "https://hips.hearstapps.com/hmg-prod/images/charles-manson-is-brought-into-the-los-angeles-city-jail-under-suspicion-of-having-masterminded-the-tate-labianca-murders-of-august-1969.jpg?crop=1.00xw:0.765xh;0,0&resize=300:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://hips.hearstapps.com/hmg-prod/images/robert-redford-gettyimages-1186761501.jpg?crop=1.00xw:1.00xh;0,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/margot-robbie-barbie-64a845ca27d7c.jpg?crop=1.00xw:1.00xh;0,0&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/july-10-beckys-barbie-in-the-spotlight-barbie-in-the-first-news-photo-1689603433.jpg?crop=0.763xw:0.258xh;0.144xw,0.120xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/margot-robbie-and-tom-ackerley-attend-the-press-junket-and-news-photo-1689703684.jpg?crop=0.668xw:1.00xh;0.116xw,0&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/cynthia-erivo-attends-the-77th-annual-tony-awards-at-david-news-photo-1728393569.jpg?crop=1.00xw:0.673xh;0,0.0738xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/margot-robbie-attends-the-world-premiere-of-barbie-at-news-photo-1701808256.jpg?crop=1.00xw:0.425xh;0,0.140xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/sharon-tate-1943-1969-us-actress-wearing-a-light-blue-blouse-circa-1965-photo-by-silver-screen-collection_getty-images.jpg?crop=1xw:0.8888888888888888xh;center,top&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/judy-garland-9306838-402.jpg?crop=1.00xw:1.00xh;0,0&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-153477096.jpg?crop=1.00xw:0.802xh;0,0.101xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/ryan-gosling-attends-the-world-premiere-of-barbie-at-shrine-news-photo-1689099557.jpg?crop=1.00xw:0.752xh;0,0.0986xh&resize=300:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://hips.hearstapps.com/hmg-prod/images/robert-redford-news-photo-1758145731.pjpeg?crop=0.767xw:0.558xh;0.0683xw,0.0579xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://hips.hearstapps.com/hmg-prod/images/margot-robbie-attends-the-world-premiere-of-barbie-at-news-photo-1689703180.jpg?crop=0.935xw:0.936xh;0,0.0636xh&resize=640:*", "https://hips.hearstapps.com/hmg-prod/images/nicole-kidman-attends-a-red-carpet-for-babygirl-during-the-news-photo-1730234543.jpg?crop=0.641xw:0.956xh;0.250xw,0.0440xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/jimmy-kimmel-live-airs-every-weeknight-at-11-35-p-m-et-and-news-photo-1758228400.pjpeg?crop=0.771xw:0.616xh;0.117xw,0.0221xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-535260630.jpg?crop=1.00xw:0.502xh;0,0.212xh&resize=300:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/kevin-costner-attends-airbnb-2025-summer-release-on-may-13-news-photo-1748528166.pjpeg?crop=0.753xw:0.502xh;0.163xw,0.0466xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/ruth-handler-a-co-founder-of-mattel-toys-inc-and-creator-of-news-photo-1688571664.jpg?crop=1.00xw:0.449xh;0,0.152xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/the-safe-return-of-the-apollo-13-astronauts-after-their-news-photo-1754686592.pjpeg?crop=0.712xw:1.00xh;0.199xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/cast-members-of-oppenheimer-including-irish-actor-cillian-news-photo-1710128697.jpg?crop=0.837xw:0.626xh;0.0112xw,0.242xh&resize=300:*", "https://hips.hearstapps.com/vidthumb/images/inkt-ep04-thumbnail-682dd7da2d33d.jpg?crop=1xw:1xh;center,top", "https://hips.hearstapps.com/hmg-prod/images/mh-2-23-best-picture-65d8f0672c449.png?crop=1.00xw:1.00xh;0,0&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/cynthia-erivo-at-the-wicked-for-good-new-york-premiere-held-news-photo-1763498079.pjpeg?crop=0.636xw:0.947xh;0.176xw,0.0526xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/leonardo-dicaprio-margot-robbie-attend-the-uk-premiere-of-news-photo-1689701862.jpg?crop=0.923xw:1.00xh;0.0714xw,0&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1146827623.jpg?crop=1.00xw:1.00xh;0,0&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://hips.hearstapps.com/rover/profile_photos/b50d4909-0f39-4b73-b482-46d0a9078d40_1682363012.file?fill=1:1&resize=120:*", "https://hips.hearstapps.com/hmg-prod/images/75th-annual-golden-globe-awards-pictured-figure-skater-news-photo-1689702482.jpg?crop=0.668xw:1.00xh;0.139xw,0&resize=980:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/margot-robbie-attends-the-world-premiere-of-barbie-at-news-photo-1701808256.jpg?crop=1.00xw:0.425xh;0,0.140xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.biography.com/actors/margot-robbie", "title": "Margot Robbie: Biography, Actor, 2024 Oscar Nominee", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Margot Robbie: Biography, Actor, 2024 Oscar Nominee", "description": "Actor Margot Robbie is best known for roles in ‘The Wolf of Wall Street,’ ‘Suicide Squad,’ ‘I, Tonya,’ and ‘Barbie.’ Read about her movies, husband, and more.", "keywords": "Profile", "theme-color": "#000000", "og": {"site_name": "Biography", "title": "Why Margot Robbie Isn’t Sad about Her Oscar Snub", "description": "The ‘Barbie’ star and coproducer could still take home her first Academy Award on Sunday.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/margot-robbie-attends-the-world-premiere-of-barbie-at-news-photo-1701808256.jpg?crop=1.00xw:0.425xh;0,0.140xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.biography.com/actors/margot-robbie", "type": "article"}, "article": {"publisher": "https://www.facebook.com/Biography", "opinion": "false", "section": "Famous Actors", "modified_time": "2024-03-08T20:58:00Z", "published_time": "2024-03-08T20:58:00Z"}, "parsely-metadata": "{\"socialHeadline\":\"Why Margot Robbie Isn’t Sad about Her Oscar Snub\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/margot-robbie-attends-the-world-premiere-of-barbie-at-news-photo-1701808256.jpg?crop=1.00xw:0.848xh;0,0.119xh&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/margot-robbie-attends-the-world-premiere-of-barbie-at-news-photo-1701808256.jpg?crop=1.00xw:0.425xh;0,0.140xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/margot-robbie-attends-the-world-premiere-of-barbie-at-news-photo-1701808256.jpg?crop=1.00xw:0.848xh;0,0.119xh", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/margot-robbie-attends-the-world-premiere-of-barbie-at-news-photo-1701808256.jpg?crop=1.00xw:0.425xh;0,0.140xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "timely", "sailthru.excerpt": "1990-presentLatest News: Barbie Star and Producer Margot Robbie Competes for Best Picture at the 2024 OscarsActor Margot Robbie made a splash as the star of Barbie, particularly during the press tour ahead of the movie’s July 2023 release when she wore iconic Barbie outfit after iconic Barbie outfit. But Robbie,", "sailthru.tags": "actors,Famous Actors,academy-awards,Academy Awards,Biography-US", "sailthru.date": "2024-03-08 20:58:00", "sailthru.socialtitle": "Why Margot Robbie Isn’t Sad about Her Oscar Snub", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1709931480.0, "source": "https://www.biography.com", "summary": ""}