{"url": "https://en.wikipedia.org/wiki/Lupita_Nyong%27o", "text": "Actress (born 1983)\n\nLupita Amondi Nyong'o ( loo-PEE-tə NYAWNG-oh, Swahili: [luˈpitɑ ˈɲɔŋɔ] ⓘ, Spanish: [luˈpita ˈɲoŋɡo]; born 1 March 1983) is an actress who has received various accolades, including an Academy Award, a Daytime Emmy Award and a Screen Actors Guild Award, as well as nominations for two British Academy Film Awards, a Golden Globe Award and a Tony Award.[1]\n\nThe daughter of Kenyan politician Anyang' Nyong'o, she was born in Mexico City, where her father was teaching, and was raised in Kenya from the age of three.[2] She attended college in the United States, earning a bachelor's degree in film and theatre studies from Hampshire College. She later began her career in Hollywood as a production assistant. In 2008, she made her acting debut with the short film East River and subsequently returned to Kenya to star in the television series Shuga (2009–2012). She then pursued a master's degree in acting from the Yale School of Drama.[3] Soon after her graduation, she had her first feature film role as Patsey in Steve McQueen's biopic 12 Years a Slave (2013), for which she received critical acclaim and won the Academy Award for Best Supporting Actress.\n\nNyong'o made her Broadway debut as a teenage orphan in the play Eclipsed (2015), for which she was nominated for a Tony Award for Best Actress in a Play. She went on to perform a motion capture role as Maz Kanata in the Star Wars sequel trilogy (2015–2019) and a voice role as Raksha in The Jungle Book (2016). Nyong'o's career progressed with her role as Nakia in the Marvel Cinematic Universe superhero films Black Panther (2018) and its sequel (2022) as well as her starring roles in the horror films Us (2019) and A Quiet Place: Day One (2024) and a voice role in the animated film The Wild Robot (2024).\n\nAside from acting, Nyong'o supports historic preservation. She is vocal about preventing sexual harassment, working for women's and animal rights. In 2014, she was named the most beautiful woman by People. In 2019, Nyong'o wrote a children's book named Sulwe, which became a number-one New York Times Best-Seller. She also received nominations for Primetime Emmy Award for Outstanding Narrator for narrating two episodes of the docu-series Serengeti. In 2020, Nyong'o was named one of Africa's 50 Most Powerful Women by Forbes.\n\nEarly life and education\n\nLupita Amondi Nyong'o[4] was born on 1 March 1983[5] in Mexico City[6][7][8] to Kenyan parents, Dorothy Ogada Buyu[9][10] and Anyang' Nyong'o, a college professor. The family had left Kenya in 1980 for a period because of political repression and unrest; Lupita's uncle, Charles Nyong'o, disappeared after he was thrown off a ferry in 1980.[11]\n\nNyong'o holds Kenyan, Mexican, and United States citizenship and identifies as \"Kenyan-Mexican\".[12][13] She is of Luo descent on both sides of her family, and is the second of six children.[14] It is a tradition of the Luo people to name a child after the events of the day, so her parents gave her a Spanish name, Lupita (a diminutive of Guadalupe).[15] Her father, a former Member of the Kenyan Parliament and past Minister for Medical Services, serves as the Governor of Kisumu County, Kenya as of November 2025.[16] At the time of Nyong'o's birth, he was a visiting lecturer in political science at El Colegio de México in Mexico City.[14][17]\n\nThe family returned to Kenya when Nyong'o was under a year old,[15][18] after her father was appointed as a professor at the University of Nairobi.[14] She grew up primarily in Nairobi, in an artistic family, and describes her upbringing as \"middle class, suburban.\"[17] Family get-togethers often included performances by the children, and trips to see plays.[19] She attended Rusinga International School in Kenya and acted in school plays.[9]\n\nAt the age of 14, Nyong'o made her professional acting debut as Juliet in William Shakespeare's Romeo and Juliet,[9] in a production by the Nairobi-based repertory company Phoenix Players.[17][19] While a member of the Phoenix Players, she also performed in the plays On The Razzle and There Goes The Bride.[20] She credits the performances of Whoopi Goldberg and Oprah Winfrey in The Color Purple with inspiring her to pursue a professional acting career.[21][22]\n\nWhen Nyong'o was 16, her parents sent her to Mexico for seven months to learn Spanish.[15][23] During those seven months, she lived in Taxco, Guerrero, and took classes at the Universidad Nacional Autónoma de México's Learning Centre for Foreigners.[23] Nyong'o later attended St. Mary's School in Nairobi, where she received an IB Diploma in 2001 and received the mean grade of 6 out of 7, coming second in her class.[24] She went to the United States for college, graduating from Hampshire College with a degree in film and theatre studies.[25][26]\n\nIn 2013, her father was elected to represent Kisumu County in the Kenyan Senate and by 2017, he became Governor.[15][27] Nyong'o's mother is the managing director of the Africa Cancer Foundation and her own communications company.[19][20] Other family members include Tavia Nyong'o, a scholar and professor at New York University; Omondi Nyong'o, a paediatric ophthalmologist in Palo Alto, California, US; Kwame Nyong'o, one of Kenya's leading animators and leading technology expert; and Isis Nyong'o, a media and technology leader who was named one of Africa's most powerful young women by Forbes magazine.[28][29]\n\nCareer\n\n2005–2015: Early work and breakthrough\n\nNyong'o began her career working as part of the production crew for several films, including Fernando Meirelles's The Constant Gardener (2005), Mira Nair's The Namesake (2006), and Salvatore Stabile's Where God Left His Shoes (2007).[30] She cites Ralph Fiennes, the British star of The Constant Gardener, as someone who inspired her to pursue a professional acting career.[17] In 2008, Nyong'o starred in the short film East River, directed by Marc Grey and shot in Brooklyn.[31] She returned to Kenya that same year and appeared in the Kenyan television series Shuga, an MTV Base Africa/UNICEF drama about HIV/AIDS prevention.[30] In 2009, she wrote, directed, and produced the documentary In My Genes, about the discriminatory treatment of Kenya's albino population.[14] It played at several film festivals and won first prize at the 2008 Five College Film Festival.[30] Nyong'o also directed the music video \"The Little Things You Do\" by Wahu, featuring Bobi Wine,[30] which was nominated for the Best Video Award at the MTV Africa Music Awards 2009.[30]\n\nNyong'o enrolled in a master's degree program in acting at the Yale School of Drama. At Yale, she appeared in many stage productions, including Gertrude Stein's Doctor Faustus Lights the Lights, Chekhov's Uncle Vanya, and William Shakespeare's The Taming of the Shrew and The Winter's Tale. While at Yale, she won the Herschel Williams Prize in the 2011–12 academic year for \"acting students with outstanding ability\" .[4]\n\nImmediately after graduating from Yale, Nyong'o landed her breakthrough role[32] when she was cast in Steve McQueen's historical drama 12 Years a Slave (2013).[17][19] The film, which met with widespread critical acclaim, is based on the life of Solomon Northup (played by Chiwetel Ejiofor), a free-born African-American man of upstate New York who is kidnapped and sold into slavery in Washington, DC, in 1841. Nyong'o portrayed Patsey, a slave who works alongside Northup at a Louisiana cotton plantation; her performance garnered rave reviews.[33] Empire reviewer Ian Freer wrote that she \"gives one of the most committed big-screen debuts imaginable,\" and Peter Travers of Rolling Stone called her \"a spectacular young actress who imbues Patsey with grit and radiant grace\".[34][35] She was nominated for several awards for 12 Years a Slave, including a Golden Globe Award for Best Supporting Actress, a BAFTA Award for Best Actress in a Supporting Role, and two Screen Actors Guild Awards, including Best Supporting Actress, which she won.[36] She also won the Academy Award for Best Supporting Actress, becoming the sixth black actress to win the award.[37] The blue Prada dress she wore to the awards garnered substantial media attention and acclaim, being considered one of the classic red carpet gowns in Hollywood history.[38][39] She is the second African actress to win the award,[37] the first Kenyan actress to win an Oscar, and the first Mexican to win the award.[40][41] She is also the fifteenth actress to win an Oscar for a film debut performance.[42]\n\nFollowing a supporting role in the action-thriller Non-Stop (2014),[43] Nyong'o co-starred in Star Wars: The Force Awakens (2015) as Force-sensitive space pirate Maz Kanata, a CGI character created using motion capture technology.[44][45] She had wanted to play a role where her appearance was not relevant, and the acting provided a different challenge from her role as Patsey.[46] Scott Mendelson of Forbes described Nyong'o's role as \"the center of the film's best sequence,\" and Stephanie Zacharek of Time magazine called her a \"delightful minor character\".[47][48] She was nominated for Best Supporting Actress at the 42nd Saturn Awards and Best Virtual Performance at the 2016 MTV Movie Awards for her role.[49][50]\n\nIn 2015, Nyong'o returned to the stage with a starring role as an unnamed girl in the play Eclipsed, written by Danai Gurira.[51] The play takes place during the chaos of the Second Liberian Civil War, where the captive wives of a rebel officer band together to form a community, until the balance of their lives are upset by the arrival of a new girl (played by Nyong'o).Eclipsed became the Public Theater's fastest-selling new production in recent history[52] and won Nyong'o an Obie Award for Outstanding Performance.[53] The play premiered on Broadway at the John Golden Theatre the following year.[54] It was the first play to premiere on Broadway with an all-black and female creative cast and crew.[55][56] Nyong'o had understudied the play at Yale in 2009 and was terrified to play the character onstage.[57] She turned down film roles in favour of the production.[58] Her performance garnered critical acclaim; Charles Isherwood of The New York Times hailed Nyong'o as \"one of the most radiant young actors to be seen on Broadway in recent seasons,\" and added that she \"shines with a compassion that makes us see beyond the suffering to the indomitable humanity of its characters.\"[59] Her performance in Eclipsed earned her a Theatre World Award for Outstanding Broadway or Off-Broadway Debut Performance and a nomination for the Tony Award for Best Actress in a Play.[60] In addition, she was nominated for Outstanding Actress in a Play at the Outer Critics Circle Award and a Distinguished Performance Award at the Drama League Award.[61][62][63][64]\n\n2016–2019: career progression\n\nNyong'o co-starred in Jon Favreau's The Jungle Book (2016), a live-action/CGI adaptation of its 1967 animated original, voicing Raksha, a mother wolf who adopts Mowgli (played by Neel Sethi).[65] Robbie Collin of The Telegraph wrote in his review that Nyong'o brought a \"gentle dignity\" to her role.[66] She later co-starred in Mira Nair's Queen of Katwe (2016), a biopic based on the true story about the rise of a young Ugandan chess prodigy,[67] Phiona Mutesi (played by Madina Nalwanga), who becomes a Woman Candidate Master after her performances at World Chess Olympiads. Nyong'o played Phiona's protective mother, Nakku Harriet.[68] Brian Tallerico of RogerEbert.com said, \"Nyong'o is phenomenal. She has an incredible ability to convey backstory.\"[69] Geoff Berkshire of Variety wrote, \"Simply radiant in her first live action role since winning an Oscar for 12 Years a Slave [...] [Nyong'o] imbues what could have been a stock mother figure with such inner fire that Harriet feels worthy of a movie all her own.\"[70]\n\nNyong'o reprised her role as Maz Kanata in Rian Johnson's Star Wars: The Last Jedi (2017), as well as in the animated series Star Wars Forces of Destiny.[71] The following year, she starred as spy Nakia, a former member of Dora Milaje, a team of women who serve as special forces of Wakanda and personal bodyguards to T'Challa / Black Panther (Chadwick Boseman), in Ryan Coogler's superhero film Black Panther (2018), which marked the eighteenth film in the Marvel Cinematic Universe.[72] In preparation for the role, Nyong'o learned to speak Xhosa and undertook judo, jujitsu, silat, and Filipino martial arts training.[73][74] David Betancourt of The Washington Post wrote that the film \"takes superhero cinema where it's never gone before by not being afraid to embrace its blackness\" and particularly praised Nyong'o for avoiding stereotypical depictions of a black leading lady, stating that she \"throws punches, shoots guns and steals hearts in a role she seems born for.\"[75] Black Panther grossed over $1.34 billion worldwide to emerge as the eleventh highest-grossing film of all time.[76] Nyong'o received a Saturn Award for Best Actress nomination for the role.[77]\n\nFollowing the success of Black Panther, Nyong'o starred as a kindergarten teacher dealing with a zombie apocalypse in the comedy horror film Little Monsters (2019). Amy Nicholson of Variety wrote that Nyong'o's \"deadpan humor and grace ennoble the slapstick\".[78] The 2019 South by Southwest marked the premiere of her next release, Jordan Peele's psychological horror film Us. It tells the story of a family who are confronted by their doppelgängers.[79][80] Emily Yoshida of Vulture labelled Nyong'o's dual role \"astounding\" and found her performance as the doppelgänger \"an achievement on another level; a physical, vocal, and emotional performance so surgical in its uncanniness that it almost feels like it could not be the work of a flesh-and-blood human.\"[81] Us grossed over $255 million worldwide against its $20 million budget.[82] At Universal Studios Hollywood's Halloween Horror Nights, Nyong'o attended a maze inspired by the film and appeared inside the attraction dressed as her character Red.[83] Nyong'o earned a Screen Actors Guild nomination for Outstanding Performance by a Female Actor in a Leading Role and won an NAACP Image Award for Best Actress.[84]\n\nAlso in 2019, Nyong'o narrated the Discovery Channel documentary series Serengeti, about wildlife in the Serengeti ecosystem.[85][86] Nyong'o spoke on the lack of African women narrating nature documentaries and how the Serengeti team encouraged her to use her native Kenyan accent on the series. She earned her first Emmy Award nomination for her narration as an Outstanding Narrator at the 72nd Primetime Emmy Awards, making her the third black woman to be nominated in the category.[87][88] She was also nominated for an NAACP Image Award for Character Voice-Over Performance.[84] She hosted the Channel 4 documentary Warrior Women with Lupita Nyong'o, in which she undertook a journey across Benin, West Africa, to search for the Dahomey Amazons.[89] She left the production of The Woman King in which she had previously been cast around the time of filming this documentary.[90] Nyong'o reprised her role as Maz Kanata for the third time in Star Wars: The Rise of Skywalker, which marked the final installment of the Star Wars sequel trilogy.[91]\n\n2020–present\n\nDuring the COVID-19 pandemic, Nyong'o appeared on the Global Citizen organised television event, Together at Home, in April 2020, and joined the radio play presentation of Richard II from The Public Theater and WNYC as The Narrator.[92][93] Nyong'o was featured in Beyoncé's musical film Black Is King, which premiered on Disney+ in July 2020.[94]\n\nNyong'o at Berlinale 2024 Ausschnitt\n\nNyong'o partnered with Nairobi-based media and tech startup Kukua in support of YouTube Originals' STEM-themed, Super Sema (2021), which became Africa's first kid superhero animated series. Super Sema follows the adventures of an extraordinary young African girl, Sema, who lives in the neo-African-futuristic community of Dunia. Nyong'o serves as an executive producer and voice actress in the series.[95] Afterwards, she starred alongside Juan Castano in Saheem Ali's bilingual radio play adaptation of Romeo & Juliet, titled Romeo y Julieta (2021).[96] She also provided narration for Apple TV+'s documentary, Who Are You, Charlie Brown? (2021), based on the origins of Peanuts and its creator Charles M. Schulz.[97] Nyong'o won the Outstanding Limited Performance in a Children's Program category at the 48th Daytime Creative Arts Emmy Awards for her involvement in Netflix's television series, Bookmarks: Celebrating Black Voices (2020).[98][99] In 2021, Nyong'o reprised her narration role in Serengeti (2019),[100] where she earned her second Primetime Emmy Award nomination.[101]\n\nThe following year, Nyong'o starred in Simon Kinberg's ensemble spy-thriller The 355 (2022) alongside Jessica Chastain, Penélope Cruz, Fan Bingbing, and Diane Kruger.[102] She also guest-starred in Netflix's adult-animated sitcom, Human Resources (2022) as Asha, a Shame Wizard who became Lionel's interest.[103] Later, Nyong'o reprised the role of Nakia in Black Panther: Wakanda Forever, the sequel to the original Black Panther film, released in November 2022.[104]\n\nIn 2024, Nyong'o played the lead role in the horror prequel film A Quiet Place: Day One.[105] She also took on a voice role in the animated film The Wild Robot, in which she voiced the lead role of an abandoned robot named Roz.[106] Also in 2024, Nyong'o began hosting the podcast Mind Your Own, in which she tells stories from the African diaspora and talks about experiences relating to her own life and Kenyan heritage.[107]\n\nIn 2024, she was cast in Christopher Nolan's upcoming epic film The Odyssey, set for release in 2026.[108]\n\nOther activities\n\nIn February 2014, at the Essence Black Women in Hollywood luncheon in Beverly Hills, she delivered a speech on the beauty of Black women, and told the audience about the insecurities she had as a teenager. She said her views changed when she saw South Sudanese model Alek Wek become successful.[109]\n\nIn October 2014, the National Trust for Historic Preservation recruited Nyong'o in an effort to oppose development, including a new minor league baseball stadium, in the Shockoe Bottom area of Richmond, Virginia.[110] The historic neighbourhood, one of Richmond's oldest, was the site of major slave-trading before the American Civil War. On 19 October 2014, Nyong'o sent a letter to Richmond Mayor Dwight C. Jones, which she posted on social media, asking him to withdraw support for the development proposal.[111] She later lent her voice in Conservation International's Nature Is Speaking campaign as the flower.[112]\n\nIn June 2015, Nyong'o returned to Kenya and announced that she would advocate globally for elephants with the international conservation organisation WildAid, as well as promote women's issues, acting and the arts in Kenya. WildAid announced Nyong'o as their Global Elephant Ambassador.[113]\n\nAs of 2016, Nyong'o was involved with the organisation Mother Health International, which aims to provide relief to women and children in Uganda by creating locally engaged birthing centres. She said she had never thought much about birthing practices until her sister introduced her to MHI executive director Rachel Zaslow. Nyong'o felt that bringing attention to such issues is a mandate for her as an artist. Variety honoured her for her work in April 2016.[114]\n\nIn April 2016, Nyong'o launched an anti-poaching \"hearts-and-minds\" campaign with her organisation Wildaid in advance of the Kenya Wildlife Service ivory burn that occurred on 30 April, during which the Kenyan government burned one hundred five tonnes of ivory and 1.35 tonnes of rhino horn in a demonstration of their zero-tolerance approach to poachers and smugglers who were threatening the survival of elephants and rhinoceros in the wild.[115][116]\n\nIn September 2019, Nyong'o became an ambassador for Michael Kors' \"Watch Hunger Stop\" campaign.[117] In October, Nyong'o and her mother were honoured at The Harlem School of the Arts' Mask Ball with a \"Visionary Lineage Award\". Then, she was honoured at WildAid to receive the \"Champion of the Year\" award in November.[118][119]\n\nIn 2020, The Africa Center announced Nyong'o as a member of its board of trustees.[120]\n\nWriting\n\nNyong'o made her writing debut with a book titled Sulwe (2019), published by Simon & Schuster Books for Young Readers. Sulwe (Luo for \"star\") is the story of a five-year-old Kenyan girl who has the darkest complexion in her family, for which Nyong'o drew on her own childhood experiences.[121] The book became a number-one New York Times Best-Seller.[122] Sulwe was selected for the 2020 Illustrator Honor at the Coretta Scott King Awards and won for Outstanding Literary Work – Children at the 2020 NAACP Image Awards.[123][84]\n\nIn the media\n\nNyong'o was mentioned in Christian rapper Lecrae's song \"Nuthin'\" from his 2014 album Anomaly and was referenced by Jay-Z in his verse from Jay Electronica's song \"We Made It\". She was also mentioned in the parody song \"American Apparel Ad Girls\" by the drag queens Willam Belli, Courtney Act and Alaska Thunderfuck.[124] Nyong'o was mentioned in the 2015 song \"Nerea\" by Kenyan afro-pop band Sauti Sol.[125] Rapper Nicki Minaj mentioned Lupita in her verse on A$AP Ferg's remix of \"Plain Jane\" and was referenced by rapper Wale in his song \"Black Is Gold\".[126][127] Singer Beyoncé mentioned Nyong'o in the single \"Brown Skin Girl\" from The Lion King: The Gift (2019).[128]\n\nNyong'o on the cover of Ms.\n\nNyong'o was included in Derek Blasberg's 2013 best-dressed list in Harper's Bazaar.[19] In 2014, she was chosen as one of the faces for Miu Miu's spring campaign, with Elizabeth Olsen, Elle Fanning and Bella Heathcote. She has also appeared on the covers of several magazines, including New York's spring fashion issue[129] and the UK magazine Dazed & Confused.[130] In April of that year, she was named \"The Most Beautiful Woman\" by People.[131] and was named the new face of Lancôme, making her the first black woman to appear on the brand.[132] Later that November, she was named \"Woman of the Year\" by Glamour.[133]\n\nNyong'o was on the July 2014 cover of Vogue, making her the second African woman[134] and ninth black woman[135] to cover the magazine. That same month she also appeared on the cover of July's issue of Elle (France). She appeared on the October 2015 issue of Vogue, making it her second cover in a row.[136] That month, Congressman Charles Rangel and Voza Rivers, the head of the New Heritage Theatre Group, announced the day is officially \"Lupita Nyong'o Day\" in Harlem, New York. The honour was announced as a surprise during an open discussion between Nyong'o and image activist Michaela Angela Davis at Mist Harlem.[137]\n\nNyong'o was included in Annie Leibovitz's 2016 Vanity Fair's Hollywood Issue.[138] Nyong'o was honoured with a caricature portrait in May 2016 at Sardi's restaurant in New York City for her debut on Broadway.[139] That July, she was chosen as one of the first celebrities, along with Elle Fanning, Christy Turlington Burns, and Natalie Westling, to star in Tiffany & Co.'s Fall 2016 campaign styled by Grace Coddington.[140] Nyong'o appeared on Vogue′s October 2016 cover, making it her third issue. That month, she was an honouree at the 2016 Elle Women in Hollywood Awards.[141]\n\nIn January 2017, she appeared on the cover of Vanity Fair's Hollywood Issue.[142] She later appeared on the cover of UK's The Sunday Times Magazine for their October 2017 issue.[143] In November 2017, she appeared on the cover of Grazia UK magazine. She later expressed her disappointment with the cover on social media for altering her hair to fit European standards of what hair should look like. Photographer An Le later apologised in a statement, saying it was \"an incredibly monumental mistake\".[144] Nyong'o often speaks out about embracing her \"African kinky hair\" and collaborates with hairdresser Vernon François to show how versatile her hair texture is.[145]\n\nIn December 2017, Nyong'o landed her fourth Vogue cover in a row for the January 2018 issue, making her the first black actress to do so.[146] She was also included in Tim Walker's 2018 Alice's Adventures in Wonderland – themed Pirelli Calendar as character The Dormouse.[147]\n\nIn June 2018, the Hollywood Chamber of Commerce announced that Nyong'o would be among the honourees to receive a star on the Hollywood Walk of Fame in the film category.[148] The following month, Nyong'o starred with fellow actress Saoirse Ronan for a Calvin Klein campaign for their new fragrance entitled \"Calvin Klein Women\". The campaign features both striking, minimalist portraits of the award-winning actresses alongside women they have personally been inspired by, where Nyong'o named Eartha Kitt and Katharine Hepburn as her inspirations.[149] In October 2018, Nyong'o became a two-time honouree, alongside her Black Panther co-stars Danai Gurira and Angela Bassett for Elle magazine's \"Women in Hollywood\" issue.[150] Nyong'o appeared on the cover of Vogue España's November 2018 edition.[151] Nyong'o is a 2019 Hollywood Walk of Fame honouree.[152]\n\nNyong'o appeared on the cover of Vanity Fair's October 2019 issue.[153] In November, she made her music debut with her single \"Sulwe's Song\", which she wrote for her book Sulwe. She was also featured on singer Ciara's song \"Melanin\" under the moniker, \"Troublemaker\" along with La La Anthony, City Girls, and Ester Dean.[154] \"Melanin\" was nominated for the Her Award at the 2020 BET Awards.[155] Nyong'o was cited as one of 2019's Top 100 most influential Africans by New African magazine.[156]\n\nNyong'o made her first appearance on British Vogue's February 2020 cover.[157] In March 2020, she appeared on Africa's \"50 Most Powerful Women\" list by Forbes.[158]\n\nPersonal life\n\nAs of June 2024 Nyong'o lives in Los Angeles, having moved there from Brooklyn in June 2023 after the COVID-19 pandemic.[159][160] She is a fluent speaker of English, Spanish, Luo, and Swahili.[18][23]\n\nIn October 2017—in the wake of the Harvey Weinstein sexual abuse scandal and the MeToo movement—Nyong'o wrote an op-ed for The New York Times divulging that Weinstein had sexually harassed her on two separate occasions in 2011, when she was a student at Yale. She had vowed never to work with him thereafter, hence turning down an offer to star in Southpaw (2015), a Weinstein-distributed film. She further wrote about her commitment to work with female directors, as well as male feminist directors who have not abused their power.[161] Nyong'o's op-ed was part of a collection of stories by The New York Times and The New Yorker that won the 2018 Pulitzer Prize for Public Service.[162] At the Tribeca Film Festival in New York City in April 2018, she joined Julianne Moore and other actress in participating in a Time's Up event.[163]\n\nNyong'o had a lifelong fear of cats, but underwent exposure therapy for the 2024 film A Quiet Place: Day One in order to work with her cat co-stars. By the end of the film's development she had come to enjoy cats so much that she adopted her own pet cat, named Yoyo.[164]\n\nShe expressed solidarity with the people of the Gaza Strip during the Gaza war. Nyong'o, as part of a group called Artists4Ceasefire, signed a letter urging United States President Joe Biden and Congress to call for an immediate ceasefire in Gaza.[165] In August 2024, Lupita announced via the press that she had recently become a U.S. citizen and planned on voting for Kamala Harris in her first U.S. presidential election.[166]\n\nFilmography\n\nFilm\n\nTelevision\n\nVideo games\n\nCrew member\n\nTheatre\n\nAccolades\n\nBibliography\n\nSee also", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Lupita_Nyong%27o_by_Gage_Skidmore_4.jpg/250px-Lupita_Nyong%27o_by_Gage_Skidmore_4.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Lupita_Nyong%27o_by_Gage_Skidmore.jpg/250px-Lupita_Nyong%27o_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/40px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Lupita_Nyongo_%28cropped%29.jpg/250px-Lupita_Nyongo_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Lupita_Nyong%27o_%2882038%29_%28cropped%29.jpg/250px-Lupita_Nyong%27o_%2882038%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Lupita_Nyong%27o_by_Gage_Skidmore_4.jpg/960px-Lupita_Nyong%27o_by_Gage_Skidmore_4.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Lupita_Nyong%E2%80%99o_at_Berlinale_2024_Ausschnitt.jpg/250px-Lupita_Nyong%E2%80%99o_at_Berlinale_2024_Ausschnitt.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Ms._magazine_Cover_-_Spring_2016.jpg/250px-Ms._magazine_Cover_-_Spring_2016.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Lupita_Nyong%27o_by_Gage_Skidmore_4.jpg/960px-Lupita_Nyong%27o_by_Gage_Skidmore_4.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Lupita_Nyong%27o", "title": "Lupita Nyong'o", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Lupita_Nyong%27o_by_Gage_Skidmore_4.jpg/960px-Lupita_Nyong%27o_by_Gage_Skidmore_4.jpg", "width": 931, "height": 1200}, "title": "Lupita Nyong'o - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}