{"url": "https://people.com/movies/brad-pitt-angelina-jolie-divorce-relationship-timeline/", "text": "It was an announcement that rocked the entertainment world when Angelina Jolie Pitt filed for divorce from husband of two years Brad Pitt in 2016.\n\n“I am very saddened by this, but what matters most now is the well-being of our kids,” Pitt said in a statement to PEOPLE. “I kindly ask the press to give them the space they deserve during this challenging time.”\n\nNow as the couple engages in a custody battle, let’s take a look back at how Pitt and Jolie Pitt went from onscreen love interests to one of the biggest couples in Hollywood.\n\nAn Onscreen to Off-Set Romance\n\nThe couple met on the set of their now-iconic spy thriller Mr. & Mrs. Smith in 2003, and though sparks flew between the pair, Jolie Pitt said that she never had any intention of breaking up Pitt’s marriage.. “I didn’t know much about exactly where Brad was in his personal life,” Jolie Pitt told Vogue in 2006. “But it was clear he was with his best friend, someone he loves and respects. And so we were both living, I suppose, very full lives … I think we were the last two people who were looking for a relationship. I certainly wasn’t. I was quite content to be a single mom.”\n\n20th Century Fox\n\nJolie maintained that they remained “very, very good friends” after the movie wrapped, although they realized at the end of the shoot in 2004 that “it might mean something more than we’d earlier allowed ourselves to believe.”\n\nDomestic Bliss\n\nThough reps for the couple continued to publicly deny a romance between them, the stars were spotted on vacation together in April 2005, and photographs featuring Pitt helping Maddox build sandcastles sent the press into a frenzy.\n\nLater, Jolie Pitt would reveal that it was Pitt’s relationship with Maddox that helped encourage them to take the leap and become a couple. According to the 2006 Vogue story, Maddox “just out of the blue called him Dad. It was amazing. We were playing with cars on the floor of a hotel room, and we both heard it and didn’t say anything and just looked at each other. So that was probably the most defining moment, when he decided that we would all be a family.”\n\nFrazer Harrison/Getty\n\nThat June, the couple appeared in an extensive photo spread for W magazine entitled “Domestic Bliss,” which featured the stars posing as husband and wife – which caused even more controversy for the pair, since they were taken just a few months after Pitt’s first marriage ended. Still, Jolie Pitt took the negative attention in stride.\n\n“People will say what they want to say, and it’s okay,” she said to Today in 2005. “And my life will go on, and I need to focus on my life. So, do I need to defend that I’m a decent woman? I sure hope I don’t. I know I am.”\n\nAnd Babies Make Eight\n\nIn July 2005, Jolie Pitt finalized the adoption of her second child, Zahara, from Ethiopia – as a single parent, it was revealed to PEOPLE. However, Jolie Pitt and her children were often photographed out with Pitt.\n\nIn January 2006, Jolie Pitt revealed that she was expecting her first child with Pitt, and that the actor had recently taken steps to adopt Maddox and Zahara, and change their last names to Jolie-Pitt. Shiloh Jolie-Pitt joined the ever-expanding brood in May of 2006, after Jolie-Pitt gave birth in Namibia.\n\nJennifer Mitchell/Splash News Online\n\nLess than one year later, the couple announced yet another bundle of joy: Jolie Pitt adopted son Pax, then 3, from Vietnam in March 2007. A source told PEOPLE that the Jolie-Pitt family began the adoption process just a few months after Shiloh was born.\n\nIn February 2008, the couple confirmed that they were expecting once again, and during an interview at the Cannes Film Festival in May of that year, Jolie Pitt shared that she was pregnant with twins. The family welcomed Knox and Vivienne in August 2008 in Nice, France. In an interview with W in October of that year, Jolie Pitt credited Pitt with changing her mind about having children of her own, in addition to adopting. “I suppose I just looked at him and loved him and just felt open to [getting pregnant],” she said. “I suddenly wanted to. It’s one of those things you can’t explain … It taught me a lot about life, just the process of it, and now we have three other beautiful children that wouldn’t otherwise be here.”\n\nKevin Winter/Getty\n\nIn 2008, Pitt told Parade that they had no plans to get married until all couples could: “When someone asked me why Angie and I don’t get married, I replied, ‘Maybe we’ll get married when it’s legal for everyone else.’ I stand by that, although I took a lot of flak for saying it,” he said. However, in 2011, he revealed that the couple’s six children were pressuring them to make things official. “The kids are putting on the heat. They really are,” he revealed on Ellen in September. “How do you I get out of this one? Somebody help me. I don’t know what the future holds.”\n\nStill, Jolie Pitt revealed that the pair weren’t in a rush to tie the knot. “We will get married, and we’re not really in a rush, so we’re just waiting for it to be the right time with the kids, with work, when it feels right,” she told PEOPLE in May 2014. “We talk about it occasionally, and the kids talk about it with us … Which is verging on hysterical, how kids envision a wedding. They will in a way be the wedding planners. It’s going to be Disney or paintball – one or the other! We’ve got a lot of different personalities in the house. They’ve got some strong opinions. It will be fun. That’s the important thing. When we do it, it will feel like a great day for our family.”\n\nRELATED VIDEO: Angelina Jolie Files for Divorce From Brad Pitt\n\nA Difficult Choice\n\nIn May 2013, Jolie Pitt revealed that she had a preventative double mastectomy after genetic tests showed that she had a high risk of developing breast cancer. (Her mother, Marcheline Bertrand, died in 2007 after a long battle with cancer.) In a column for the New York Times, Jolie Pitt detailed the choice to have the procedure – which she explained “was not easy, but it is one I am very happy that I made” – and credited Pitt for backing her through everything.\n\n“I am fortunate to have a partner, Brad Pitt, who is so loving and supportive,” she wrote. “So to anyone who has a wife or girlfriend going through this, know that you are a very important part of the transition.” She revealed that Pitt was with her “for every minute of the surgeries,” and even during the difficult times, “We managed to find moments to laugh together.”\n\nIn November 2013, he was by her side once again, as she was honored with the Jean Hersholt Humanitarian Award at the Governors Awards.\n\nHere Comes the Bride\n\nOn Aug. 23, 2014, the stars quietly tied the knot in an intimate ceremony at Château Miraval, the family’s estate in Correns, France. “It was important to us that the day was relaxed and full of laughter,” the couple told PEOPLE. “It was such a special day to share with our children and a very happy time for our family.” Jolie Pitt wore an Atelier Versace gown and veil that featured dozens of designs from her children’s drawings embroidered onto the fabric.\n\nJames Warren/UPPA/ZUMA\n\n“The children wrote vows and asked us to make promises to each other,” she said of the family-oriented ceremony. “It was very sweet what they came up with.”\n\nIn November 2014, the couple made their debut as Mr. and Mrs. Pitt at the world premiere of her film, Unbroken, in Sydney, Australia. They spent their “honeymoon” vacationing off the coast of Malta with their family, and filming By the Sea, which would mark their first on-screen collaboration since Mr. & Mrs. Smith.\n\nFamily Life\n\nIn the months after their wedding, the couple appeared to be happier than ever, even after another heath scare that resulted in Jolie Pitt opting to have her fallopian tubes and ovaries removed in March 2015 after tests indicated markers that could be a sign of early cancer. Again, Pitt was by her side throughout the ordeal.\n\n\n\nIn November of 2015, Pitt opened up about what life with Jolie Pitt and their six children was like in an interview with The Telegraph. “[There’s] a lot of love, a lot of fighting, a lot of refereeing; a lot of teeth-brushing and spilling,” he said. “Chaos, total chaos. But so much fun.” He also revealed that the pair had intended to have even more children: “Listen, Angie and I were aiming for a dozen, but we crapped out after six.”\n\nIn December, the couple released By the Sea, their first film together in 10 years. Though the movie followed the disintegration of a marriage, Jolie Pitt revealed that they were stronger than ever. “Brad and I have our issues, but if the characters were even remotely close to our problems we couldn’t have made the film,” she told The Telegraph in November 2015.”To be clear: we have fights and problems like any other couple. We have days when we drive each other absolutely mad and want space, but the problems in the movie aren’t our specific problems.”\n\nClaudio Onorati/EPA\n\nOver the past year, the stars were kept busy with various projects: Pitt was filming Allied and War Machine, while Jolie Pitt finished filming First They Killed My Father and kept up with her humanitarian efforts, speaking at a House of Lords committee in London, leading an honorary committee for this year’s Cambodian International Film Festival and advocating for victims of sexual assault in war zones.\n\nRELATED VIDEO: Angelina Jolie and Brad Pitt Were Last Seen Publicly Together in July\n\nThe Pitts were last seen together in public in July, when they stopped into a Jamba Juice store in L.A. with Shiloh.\n\nIn September 2016, multiple sources confirmed to PEOPLE that Jolie Pitt had filed for divorce. According to TMZ, she cited irreconcilable differences as the reason for the split, and legal documents reveal that she is asking for physical custody of the couple’s six children.\n\nCustody Battle\n\nIn the months following their split, the exes returned to their lives as normal. Jolie continued her advocacy work, directed an Oscar-nominated animated movie and resumed acting with Maleficent 2. Pitt starred in and produced numerous film projects and even started reportedly dating, being seen with MIT professor Neri Oxman in April.\n\nThe divorce seemed to be proceeding as normal until June, when a judge presiding over the case ruled that Jolie could lose primary custody of their six children if she doesn’t allow them each to form a “healthy and strong relationship” with her father. Pitt was given a detailed visitation schedule of when he could spend time with each child in London, where Jolie was filming for the summer.\n\nA spokesperson for the actress responded to the papers, which also granted Pitt unsupervised cell phone contact with the kids, by calling the public’s awareness of the documents “deplorable.”\n\n“From the start, Angelina has been focused only on their health and needs,” the statement to PEOPLE continued, “which is why it was so important that this last court hearing be conducted privately.”", "images": ["https://people.com/thmb/6YMkmjVi3TmowFGegJCAptVBPY4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Amy-Schumer-Chris-Fischer-111325-68d54c198ba54698b5d309804bf32f3e.jpg", "https://people.com/thmb/ooyQcRI8F_MddgAQSERkoFbMOc8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Miguel-and-Nazanin-Mandi-111325-1-4b5ea922b29641b9a151734194f508f1.jpg", "https://people.com/thmb/Bh3W1CuXrVrTbcUrLIErX-fSdE4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Dwayne-Johnson-and-wife-Dany-Johnson-during-Be-Cool-Los-Angeles-Premiere-110725-3df6d0982ff94ecba1e9aee4cf287f3b.jpg", "https://people.com/thmb/LztNjwaQ-ix4eK4edUooLhNiWi4=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/anna-kepner-3-111025-c6a90b2f57474459a89ae04e296ec343.jpg", "https://people.com/thmb/p59pCo344i0_rNdqBqhEEvBxyQM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(319x0:321x2)/people_social_image-60e0c8af9eb14624a5b55f2c29dbe25b.png", "https://people.com/thmb/OzIgU23Tff6Yql_NR-DDeIOqTxk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/angelina-jolie-435-139-eb3b89dd16b64a63b6c64d92c747e4bf.jpg", "https://people.com/thmb/6BVgFQ30gWgD9XmkUm2j5s90DZk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/alex-rodriguez-Cynthia-Scurtis-Madonna-111325-33c2de3e05914ed987d94df4aced2d95.jpg", "https://people.com/thmb/i3yO7KWh5oL6W3qHNuf41NtTgH0=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/brittany-cartwright-jax-taylor-042424-2-44111ab94387465fb3c3f9b56068c753.jpg", "https://people.com/thmb/xfLBrCi2PRPz-cyeb3JDwZAIOxM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/dylan-dreyer-today-show-family-110525-d470847cd4784b658ac9641d2b2b1125.jpg", "https://people.com/thmb/vyJHKEJ82ooUSWt2SR-CETECkIs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/mcdermott-spelling-1-866b59b7eff1446b8e34775aa6c0ce74.jpg", "https://people.com/thmb/bPRr49iSek02jBass9S4e-yomVI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Drake-and-Serena-Williams-111925-1730587f36384e638ef89c0c54671fc3.jpg", "https://people.com/thmb/EGxuYXQxCHrcy7Wwn6LkSNWLUDc=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/mcdermott-spelling-1-866b59b7eff1446b8e34775aa6c0ce74.jpg", "https://people.com/thmb/LfJI1CVbvmN_4_sHLXXUgiLofQA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/ba-2-435-2-1-3e44efa58df54fdab5d9814fd03f7f66.jpg", "https://people.com/thmb/fWbhJyqTqMGboydsYd59wjfv1uU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/angelina-jolie-1-435-4-b82a9432423748f6a0a7df2b9d4b83f5.jpg", "https://people.com/thmb/8OOKQ49LNRRy0c0vRwsTBQO8jEw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Paul-Costabile-Christina-Perri-110325-462d8ffcbb564b3eacf30639765d08f8.jpg", "https://people.com/thmb/BB7vYW82d0oBPiFINmr76DIy2dY=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/ben-dreyfuss-richard-dreyfuss-111925-b670f8ab6f994d1d9dfce1fa0726d205.jpg", "https://people.com/thmb/FKZuH_lCPcKpDNcsn8pN-nq46Ew=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/Angelina-Jolie-Billy-Bob-Thornton-111825-86b23fdf767748bf816a9e1be59a0075.jpg", "https://people.com/thmb/x93e4sU0UMSPvxAOcealWNkrH_U=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Eric-Mccormack-janet-holden-divorce-112223-1-c3b53e640c9247cbb8fcdb016e571f35.jpg", "https://people.com/thmb/i9NYJV9tkCUpnPizHun-1ddb-rc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/angelina-jolie-billy-bob-thornton-2000-111725-98924d6126ac4478ad4b96dffa9d2376.jpg", "https://people.com/thmb/AWIgLw6oCjvuGnuN6Z3n2PeyuEk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/brittany-cartwright-jax-taylor-042424-2-44111ab94387465fb3c3f9b56068c753.jpg", "https://people.com/thmb/vdNV08gkekkFyz5B9yRk8jzH3o8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/angelina-6-435-40b3bf47c59947c88b884b601de7ac3b.jpg", "https://people.com/thmb/F1k9wdDbErMAPQuS4Q-rm3g7MBo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/smith-660-1-fd5c8229b451495ea68a52bd04ab309f.jpg", "https://people.com/thmb/Zb8TdlLsOwMIJ3YLlVbZWDfjBHk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Brittany-Snow-Tyler-Stanaland-110625-f03720b38192437e8cd120652959240f.jpg", "https://people.com/thmb/iPL6ygoplJm3OyBoODdKzwlPcI8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/khloe-kardashian-lamar-odom-111925-cd0c726941d7492f9b707b58943304a1.jpg", "https://people.com/thmb/GwFXLRu6Xcrg6J_kcVOsm190DD0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/billy-bob-thornton-angelina-jolie-connie-angland-split-111925-73d94569a50e4ea2a0963c4f658f9471.jpg", "https://people.com/thmb/_hLdNGZuHYWKD4t_TtyTn1YI3fQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(679x0:681x2)/brangelina-a412970b524a4ac4a3ca359c6d40e22b.jpg", "https://people.com/thmb/VM5gV5u7r4D-53x4Pqvu9t1WkHU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Nina-Dobrev-not-pretending-Tiktok-111425-tout-9bb898904aa846d98702bf022f30d105.jpg", "https://people.com/thmb/0jKnK8bSyr7Fb41sXsNwd1jtAFM=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/jenna-bush-hager-minka-kelly-today-with-jenna-and-friends-111925-7e3c2b8605fe4a96a1b712c168083adb.jpg", "https://people.com/thmb/zdFS1n2y9dNM-ndOtRjWY9G0kI4=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/Daniella-Karagach-111925-ls-1ffa54ba0f1749e380cfe98771660e16.jpg", "https://people.com/thmb/Pd2mGwyfhDikJkJtGi2uJhE1Nts=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Angelina-Jolie-Billy-Bob-Thornton-111825-86b23fdf767748bf816a9e1be59a0075.jpg"], "top_img": "https://people.com/thmb/p59pCo344i0_rNdqBqhEEvBxyQM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(319x0:321x2)/people_social_image-60e0c8af9eb14624a5b55f2c29dbe25b.png", "keywords": [], "authors": ["Julia Emmanuele", "Julia Emmanuele Is A Former Writer Reporter At People. She Left People In", "People Editorial Guidelines", "Benjamin Vanhoose", "Diana Pearl", "Julia Moore", "Brianne Tracy", "Lynsey Eidell", "Natasha Dye", "Jp Mangalindan"], "canonical_link": "https://people.com/movies/brad-pitt-angelina-jolie-divorce-relationship-timeline/", "title": "From Work Romance to Custody Battle: Inside Brad Pitt and Angelina Jolie's Relationship", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "As Brad Pitt and Angelina Jolie engage in a custody battle, here's a look at how they went from onscreen love interests to divorced couple", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "PEOPLE", "sailthru.author": "Julia Emmanuele", "parsely-section": "Celebrity", "parsely-tags": "Celebrity Relationships,People.com,Person,Celebrity Breakups,Celebrity", "article": {"section": "People", "author": "https://www.facebook.com/peoplemag"}, "og": {"type": "article", "site_name": "People.com", "url": "https://people.com/movies/brad-pitt-angelina-jolie-divorce-relationship-timeline/", "title": "From Work Romance to Custody Battle: Inside Brad Pitt and Angelina Jolie's Relationship", "description": "As Brad Pitt and Angelina Jolie engage in a custody battle, here's a look at how they went from onscreen love interests to divorced couple", "image": "https://people.com/thmb/p59pCo344i0_rNdqBqhEEvBxyQM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(319x0:321x2)/people_social_image-60e0c8af9eb14624a5b55f2c29dbe25b.png"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "From Work Romance to Custody Battle: Inside Brad Pitt and Angelina Jolie's Relationship", "description": "As Brad Pitt and Angelina Jolie engage in a custody battle, here's a look at how they went from onscreen love interests to divorced couple", "image": "https://people.com/thmb/p59pCo344i0_rNdqBqhEEvBxyQM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(319x0:321x2)/people_social_image-60e0c8af9eb14624a5b55f2c29dbe25b.png"}, "vf": {"url": "https://people.com/movies/brad-pitt-angelina-jolie-divorce-relationship-timeline/"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.146.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.146.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.146.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.146.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.146.0/icons/favicons/mstile-310x150.png", "fb": {"pages": 95926963131}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}