{"url": "https://en.wikipedia.org/wiki/Ron_Goldman", "text": "American murder victim (1968–1994)\n\nRonald Lyle Goldman (July 2, 1968 – June 12, 1994) was an American restaurant waiter and aspiring actor. A volunteer working with children suffering from cerebral palsy, Goldman appeared as a contestant on the short-lived game show Studs in early 1992.[2] Goldman lived independently from his family and supported himself as an employment headhunter, tennis instructor, and waiter, and worked occasionally as a model. Goldman earned an emergency medical technician license, but he decided not to pursue that as a career. In 1994, Goldman befriended Nicole Brown Simpson, the ex-wife of American football player O. J. Simpson. On 12 June 1994, Goldman was murdered, along with Brown, outside her home in Brentwood, Los Angeles.\n\nFollowing a controversial and highly publicized criminal trial, Simpson was acquitted of both charges of murders, though he was later found liable for their deaths in a 1997 civil lawsuit filed by Goldman's father Fred, which rendered a $33.5 million judgment for damages.[3] At the time of Simpson's death in 2024, the money had still yet to be paid in full, which prompted Fred Goldman to file a $117 million creditor claim against Simpson's estate in July 2024. On November 17, 2025, it was announced that Simpson's estate agreed to pay $58 million to Goldman's father to settle the claim.[4]\n\nEarly life [ edit ]\n\nGoldman as a junior at Adlai E. Stevenson High School in the 1985 yearbook\n\nRonald Lyle Goldman was born on July 2, 1968, in Chicago, Illinois, and he grew up in the community of Buffalo Grove. After his parents divorced in 1974 and after spending a brief time in the custody of his mother, Sharon Rufo (née Fohrman), he was raised by his father, Frederic Goldman (born December 6, 1940). Goldman lived with his father and his younger sister, Kimberly. Goldman was raised Jewish.\n\nGoldman attended high school at Adlai E. Stevenson High School in Lincolnshire, Illinois. He was a student at Illinois State University for one semester, where he planned to major in psychology, and he also had an interest in becoming a pledge in Sigma Nu fraternity. After his family relocated to Southern California when he was 18 years old, however, Goldman discontinued his studies and followed his family.\n\nPrior to relocating with his family, Goldman worked as a camp counselor and had experience volunteering with children who suffered from cerebral palsy.[5][6]\n\nIn California [ edit ]\n\nWhile living in Los Angeles, Goldman took some classes at Pierce College.[5] He learned to surf and enjoyed playing beach volleyball, rollerblading, and nightclubbing.[7]\n\nUpon arriving in California, Goldman lived independently from his family and supported himself as an employment headhunter, tennis instructor, and waiter.[5] He worked occasionally as a model for Barry Zeldes, owner of the Z90049 store in Brentwood Gardens.[8]\n\nInstead, Goldman told friends that he wanted to open a bar or restaurant in the Brentwood area.[5] He planned for the venue to be known not by a name but by the ankh, an Egyptian religious symbol of life that he had tattooed on his shoulder.[8] According to his friend Jeff Keller, he wanted to learn all facets of the restaurant-bar business and occasionally worked as a promoter[8] at a Century City dance club called Tripps.[5] He had also tended a bar called Dragonfly, which co-incidentally was owned by Brett Cantor. For Memorial Day, he participated with a group of event promoters in organizing a party at Renaissance, a club and restaurant on the Third Street Promenade in Santa Monica.[8]\n\nGoldman also expressed aspirations to act; he appeared on an episode of the dating game show Studs (hosted by Mark DeCarlo) in early 1992.[9]\n\nDeath [ edit ]\n\nFinal days [ edit ]\n\nAccording to a June 15, 1994, Los Angeles Times article published three days after his death, Goldman met Brown only six weeks prior to the date they were murdered, when he borrowed her Ferrari. The two were seen together in clubs, occasionally meeting for coffee and dinner in the weeks before their deaths. According to police and friends, however, the relationship between the two was platonic. One article noted that he had borrowed her car when he met his friend, Craig Clark, for lunch. According to Clark, Goldman told him it was Brown's car, but he did not say she was his girlfriend. Instead, Goldman said they were friends.[10]\n\nHe dated Jacqui Bell for nearly two years before she broke off their relationship three months before his death.[11][12] Not long before his death, Goldman earned an emergency medical technician license, but he decided not to pursue that as a career.[5]\n\nJune 12, 1994 [ edit ]\n\nPolice officers searching Brown's condo for evidence in June 1994\n\nOn the evening of Sunday, June 12, 1994, Goldman worked a server shift at Mezzaluna Trattoria in Brentwood. Brown called to report that her mother had inadvertently dropped her reading glasses outside by the gutter when they dined there earlier in the evening. Goldman had not been their server, but after a search at the restaurant turned up the glasses, Goldman agreed, at Brown’s request, to drop them off at her home after work. \"Ron interjected he’d be happy to return them,\" said Tia Gavin, who waited on the Brown party.[13]\n\nThe Los Angeles Times reported that Goldman \"punched out at 9:33 pm and stayed another 15 minutes to have bottled water at the bar.\"[8] He made plans to go out with Mezzaluna's bartender Stewart Tanner later that evening. Before returning the glasses, Goldman stopped by his Brentwood apartment at 11663 Gorham Avenue, presumably to shower and change clothes; his autopsy indicated he ate a salad less than 40 minutes before he was killed.[14] He then drove to Brown’s condominium, using his friend Andrea Scott's car.[15]\n\nGoldman[16] and Brown were stabbed to death on the walkway leading to the condominium at 875 South Bundy Drive; their bodies were discovered shortly after midnight. Goldman's knuckles were bruised; The prosecutors argued that this indicated he had fought strongly, while Simpson’s defense team argued it was probably from a fall.[17][18] Goldman had several small wounds to his face.[19][20] During a reconstruction of events, the police theorized that Brown and Goldman were talking on the front patio of Brown's condominium when they were attacked or that Goldman arrived while Brown was being attacked; in any case, the police believe that Brown was the intended target and that Goldman was killed in order to silence him.[21] Witness Robert Heidstra testified that while walking near Brown's condominium that night, he heard a man yelling, \"Hey! Hey! Hey!\" who was then shouted at by a second man. He also heard a gate slam.[22] Goldman's family came to believe that Goldman was the man shouting \"Hey!\" and that he may have attempted to save Brown by intervening in the attack.[23][24]\n\nIn the 1996 book Killing Time: The First Full Investigation into the Unsolved Murders of Nicole Brown Simpson and Ronald Goldman, authors Donald Freed and Raymond P. Briggs wrote that lipstick was found on Goldman's cheek after his death, and suggested that Brown kissed Goldman when he arrived and that they were together on the front porch when they were attacked.[25]\n\nGoldman was 20 days shy of his 26th birthday when he died. He is buried at Pierce Brothers Valley Oaks Memorial Park in Westlake Village, California.[8][26]\n\nTrials [ edit ]\n\nCriminal trial [ edit ]\n\nAfter leading police on a low-speed chase in a now infamous white Ford Bronco, Simpson was tried for the killings of both Brown and Goldman. The trial spanned eight months, from January 24 to October 3, 1995. During the trial, there was some speculation as to whether Goldman and Brown were secretly dating, compounded by three facts, that Brown was wearing a slinky, revealing cocktail dress when she was found dead, candles were lit in the master bedroom and bathroom, and the master bathroom’s tub was full of water.[27]\n\nThough prosecutors argued that Simpson was implicated by a significant amount of forensic evidence, he was acquitted of both murders on October 3.[28][29][30][31] Commentators agree that to convince the jury to acquit Simpson, the defense capitalized on anger among the city's African-American community toward the Los Angeles Police Department (LAPD), which had a history of purported racial bias and had allegedly inflamed racial tensions in the beating of Rodney King and subsequent riots two years prior.[32][33][34] The trial is often characterized as the trial of the century because of its international publicity and has been described as the \"most publicized\" criminal trial in history.[35] Simpson was formally charged with the murders on June 17; when he did not turn himself in at the agreed time, he became the subject of a police pursuit.[36] TV stations interrupted coverage of the 1994 NBA Finals to broadcast live coverage of the pursuit, which was watched by around 95 million people.[37] The pursuit and Simpson's arrest were among the most widely publicized events in history.\n\nSimpson was represented by a high-profile defense team, referred to as the \"Dream Team\", initially led by Robert Shapiro[38][39] and subsequently directed by Johnnie Cochran. The team included F. Lee Bailey, Alan Dershowitz, Robert Kardashian, Shawn Holley, Carl E. Douglas, and Gerald Uelmen. Simpson was also instrumental in his own defense. While Deputy District Attorneys Marcia Clark, William Hodgman, and Christopher Darden believed they had a strong case, the defense team persuaded the jury there was reasonable doubt concerning the DNA evidence.[28] They contended the blood sample had been mishandled by lab scientists[40] and that the case had been tainted by LAPD misconduct related to racism and incompetence. The use of DNA evidence in trials was relatively new, and many laypersons did not understand how to evaluate it.\n\nThe trial was considered significant for the wide division in reaction to the verdict.[41] Observers' opinions of the verdict were largely related to their ethnicity; the media dubbed this the \"racial gap\".[42] A poll of Los Angeles County residents showed most African Americans thought the \"not guilty\" verdict was justified while most whites thought it was a racially motivated jury nullification[43][44] by the mostly African-American jury.[45] Polling in later years showed the gap had narrowed since the trial; more than half of polled Black respondents expressed the belief that Simpson was guilty.[46] In 2017, three jurors who acquitted Simpson said they would still vote to acquit, while one said he would convict.[47]\n\nComparisons were made years later between the Trayvon Martin case and the O.J. Simpson case, and how race impacted both. During an interview with Piers Morgan, when asked if there was a similarity in the racial aspects of the cases, Kim Goldman said all of the evidence pointed towards guilt in Simpson’s case, while she believed George Zimmerman’s not guilty verdict was correct because it was a self defense case and that the killing of Trayvon Martin was not racially charged.[48] Fred Goldman also denied racism played a factor in the killing of Trayvon or the outcome of the Simpson trial in an interview.[49]\n\nCivil trial [ edit ]\n\nIn 1996, Fred Goldman and Sharon Rufo, the parents of Ron Goldman, and Lou Brown, father of Nicole Brown filed a civil suit against Simpson for wrongful death.[50] Presiding Judge Hiroshi Fujisaki did not allow the trial to be televised, did not sequester the jury, and prohibited the defense from alleging racism by the LAPD and from condemning the crime lab.[51] The physical evidence did not change but additional evidence of domestic violence was presented as well as 31 pre-1994 photos of Simpson wearing Bruno Magli shoes,[52] including one that was published 6 months before the murders, proving it could not be a forgery.[53] Results from a polygraph test that Simpson denied taking showed \"extreme deception\" when he denied committing the murders.\n\nOne significant difference between the two trials was the admission of Nicole Brown's diary entries in the civil case.[54] The civil judge found the diary entries were admissible because they were pertinent to Nicole's state of mind, which in turn was relevant to Simpson's motive[55]—reversing a crucial ruling from the criminal case that excluded the diary as \"inadmissible hearsay\".[56] The civil court's ruling was upheld on appeal.[57] Also, unlike in the criminal trial, the plaintiffs were able to make Simpson take the stand to question him. The jury found Simpson liable for the murders and awarded the victims' families $33.5 million in compensatory and punitive damages.[58] Simpson filed for bankruptcy afterwards and relocated to Florida to protect his pension from seizure. His remaining assets were seized and auctioned off with most being purchased by critics of the verdict of the criminal trial to help the plaintiffs recoup the costs of litigation. Simpson's Heisman Trophy was sold for $255,500 to an undisclosed buyer. All the proceeds went to the Goldman family, who said they have received only one percent of the money that Simpson owes from the wrongful death suit.[59][60]\n\nDuring the civil trial, Kim Goldman said that she and Michael Nigg were set-up on a blind date. After a good first date, the two went on 5 or more dates. At the time they were going out together Michael Nigg worked at a restaurant in Santa Barbara and at some point after 1992 Michael moved to Los Angeles. Kim Goldman testified that she never introduced her brother to Michael Nigg and she did not see Michael after he moved to Los Angeles. She stated she was unaware how her brother, Ron, and Michael met; she testified that the two met by happenstance. The two men apparently became good friends because, according to Ms. Goldman, Michael Nigg got her brother the job at Mezzaluna. While Kim Goldman does not have knowledge of Michael having worked at Mezzaluna, according to the Los Angeles Times Michael Nigg had been employed at Mezzaluna in Brentwood at some point. At the time of his death Michael Nigg was working at a restaurant called Sanctuary that was located in Beverly Hills. Some news reports claim that Michael Nigg “befriended Ronald Goldman when both worked at the Mezzaluna restaurant” however Ms. Goldman’s testimony establishes that the two men were friends prior to Ron being hired at Mezzaluna. It is unknown if Michael Nigg and Ron Goldman’s tenures at Mezzaluna overlapped.[61] In an interview with 20/20, Kim Goldman said that one day some time after Simpson's acquittal, she was driving in her car when she saw him in a parking lot in Los Angeles. She considered running him over to get vengeance, but decided otherwise.[62]\n\nSimpson was subsequently jailed for an unrelated armed robbery at a Las Vegas hotel in 2008.[63][64] Both Fred and Kim Goldman were present at the robbery trial, and after Simpson's conviction, Fred Goldman expressed his satisfaction and referred to it as a \"bittersweet\" moment.[65]\n\nIn July 2017 after Simpson was granted parole, Fred Goldman inquired about the real estate purchases made by Sydney and Justin Simpson, Brown’s children with Simpson. David Cook, a lawyer for Fred Goldman, said he would seek bank records and depositions to follow the kids’ money trail and see if any of the homes were bought with their dad’s cash, which could make them eligible for a clawback. “The kids’ loss is no greater than Fred’s, but Fred’s loss should be no greater than theirs,” Cook said.[66] In June 2022 Fred alleged in court papers (intended to keep the wrongful death and battery judgment viable) that Simpson owed $96 million due to significant interest generated on the initial order to pay damages.[67]\n\nWhen Simpson died in 2024, Fred Goldman initially called Simpson’s death \"no great loss to the world\" but also said that it was \"just a further reminder of how long my son has been gone...how many years, and how much he’s been missed. And the only thing that is important today are (Ron and Nicole). Nothing else is important.\"[68] Kim and Fred later issued a statement that read, \"The hope for true accountability has ended... Thank you for keeping our family, and most importantly Ron, in your hearts\".[69][70] Fred Goldman said that he will still pursue \"justice\" for his son after Simpson's attorney said that the Goldman family will get \"nothing\" from the estate. A few days later, Simpson's attorney backtracked and confirmed that Simpson's estate will settle the legal verdict with the Brown and Goldman families, and said that his statements were made out of a moment of frustration over what he felt were \"insensitive\" remarks about Simpson's death.[71][72]\n\nOn November 17, 2025, it was reported that the Simpson Estate agreed for pay nearly $58 million to Goldman's father to settle the civil claim, but it rejected the $117 million claim that was originally sought.[73]\n\nAlternate theories and suspects [ edit ]\n\nWhile several members of Simpson's family still advocated for Simpson's innocence,[74][75] such theories have been rejected by prosecutors, witnesses and the families of Brown and Goldman, who have expressed the belief that Simpson committed the murders and was the sole perpetrator,[76][77][78] with Hunt opining that these claims were attempts to tap into the public interest in the case and were never meant to be taken seriously.[79]\n\nThe 2000 BBC TV documentary O.J.: The True Untold Story,[80] primarily rehashes the contamination and blood planting claims from the trial and asserted that Simpson's elder son Jason is a possible suspect, due to - among other reasons - Simpson hiring defense attorneys for his children first before himself, pictures of Jason's descriptive wool cap, and an alleged prior arrangement to meet with Nicole that evening.[81][82][83] William Dear published his findings in the book O.J. Is Innocent and I Can Prove It.[84]\n\nA 2012 documentary entitled My Brother the Serial Killer examined the crimes of convicted murderer Glen Edward Rogers and included claims that Rogers had killed Brown and Goldman in California in 1994.[85][86][87][88] According to Rogers' brother Clay, Rogers claimed that, before the murders, he had met Brown and was \"going to take her down.\"[88] During a lengthy correspondence that began in 2009 between Rogers and criminal profiler Anthony Meoli, Rogers wrote and created paintings about his involvement with the murders. During a prison meeting between the two, Rogers claimed Simpson hired him to break into Brown' house and steal some expensive jewellery. He said that Simpson had told him, \"You may have to kill the bitch\". In a filmed interview, Rogers' brother Clay asserts that his brother confessed his involvement.[88] Rogers' family stated that he had informed them that he had been working for Brown in 1994 and that he had made verbal threats about her to them. Rogers later spoke to a criminal profiler about the murders, providing details about the crime and remarking that he had been hired by Simpson to steal a pair of earrings and potentially murder Brown.[citation needed] LAPD responded to the documentary as follows: “We know who killed Nicole Brown Simpson and Ron Goldman. We have no reason to believe that Mr. Rogers was involved.” Fred Goldman, father of Ron Goldman stated: “The overwhelming evidence at the criminal trial proved that one, and only one, person murdered Nicole Brown Simpson and Ronald Goldman. That person is O.J. Simpson and not Glen Rogers.”[89]\n\nLegacy [ edit ]\n\nWhen filmmaker Ezra Edelman, director of the documentary O.J.: Made in America, won the Academy Award for Best Documentary Feature, he dedicated the award to both Goldman and Brown in his acceptance speech. Fred Goldman was among those whom Edelman interviewed in the documentary.\n\nFoundation [ edit ]\n\nThe Goldman family contributed a portion of proceeds from the If I Did It book sales to the newly founded Ron Goldman Foundation for Justice.[90] It provides grants for multiple organizations and programs that provide resources to victims and survivors of violent crimes.[91] One of the largest donors to the foundation is Las Vegas executive Mark Goldman, Fred Goldman's first cousin.\n\nMedia [ edit ]\n\n\"Nicole. Jesus. I looked down and saw her on the ground in front of me, curled up in a fetal position at the base of the stairs, not moving. Goldman was only a few feet away, slumped against the bars of the fence. He wasn't moving either. Both he and Nicole were lying in giant pools of blood. I had never seen so much blood in my life. It didn't seem real, and none of it computed.\" If I Did It: Confessions of the Killer, Simpson (2006), p. 81.\n\nSimpson wrote a book, If I Did It, a first-person account of how he would have committed the murders if he had committed them. In Simpson's hypothetical scenario, he has an unwilling accomplice named \"Charlie\" who urges him to not engage with Brown, whom Simpson plans to \"scare the shit out of\".[92] Simpson ignores Charlie's advice and continues to Brown's condo, where he finds and confronts Ron Goldman. According to the book, Brown falls and hits her head on the concrete, and Goldman crouches in a karate pose. As the confrontation escalates, Simpson writes, \"Then something went horribly wrong, and I know what happened, but I can't tell you how.\"[93] He writes that he regained consciousness later with no memory of the actual act of murder.[92]\n\nSimpson's eldest daughter, Arnelle Simpson, testified in a deposition that she and Van Exel, president of Raffles Entertainment and Music Production, came up with the idea for the book and pitched it to her father in an attempt to make money.[94] She testified that her father thought about it and eventually agreed to the book deal.[94] Simpson stated, \"I have nothing to confess. This was an opportunity for my kids to get their financial legacy. My kids understand. I made it clear that it's blood money, but it's no different than any of the other writers who did books on this case.\"[94]\n\nAccording to court documents, in August 2007, as part of the multi-million dollar civil jury award against Simpson to ensure he would not be able to profit from the book, the Goldman family were granted the proceeds from the book. The Goldman family still own the copyright, media rights, and movie rights[95] and have acquired Simpson's name, likeness, life story, and right of publicity in connection with the book. After renaming the book If I Did It: Confessions of the Killer, the Goldman family published it in September 2007 through Beaufort Books.[96] Denise Brown, Nicole Brown's sister, criticized the Goldmans for publishing the book and accused them of profiting from Brown and Goldman's deaths.[97]\n\nPortrayals [ edit ]\n\nGoldman is portrayed by:\n\nSee also [ edit ]\n\nNotes [ edit ]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Clarashortridgefoltzcriminaljusticecenter.JPG/250px-Clarashortridgefoltzcriminaljusticecenter.JPG", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/0d/Ronald_goldman.jpg/250px-Ronald_goldman.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Mug_shot_of_O.J._Simpson.jpg/250px-Mug_shot_of_O.J._Simpson.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Ron_Goldman_1985.jpg/250px-Ron_Goldman_1985.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/en/0/0d/Ronald_goldman.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f1/Officers_at_OJ_crime_scene_2.jpg/250px-Officers_at_OJ_crime_scene_2.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/0/0d/Ronald_goldman.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Ron_Goldman", "title": "Ron Goldman", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/0/0d/Ronald_goldman.jpg", "width": 897, "height": 1200}, "title": "Ron Goldman - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}