{"url": "https://ew.com/oscars/2019-oscar-contenders/", "text": "01 of 33 Oscars 2019: Meet the contenders Clay Enos/Warner Bros.; Universal Pictures; Carlos Somonte/NETFLIX The fall festivals, Golden Globes, and industry guilds have positioned the major pieces of the awards puzzle, placing a fine assortment of goodies into the Oscar oven. From tremendous performances in prestige pictures — like Lady Gaga (A Star Is Born) and Yalitza Aparicio (Roma) — to Ryan Coogler's monolithic achievement in the blockbuster arena (Black Panther), here are the contenders on the Oscars radar that are sweeping the Oscar conversation.\n\n02 of 33 A Star Is Born - Best Picture, Best Director (Bradley Cooper), Best Actress (Lady Gaga), Best Actor (Cooper), Best Supporting Actor (Sam Elliott), Best Film Editing, Best Cinematography, Best Original Song Neal Preston/Warner Bros. A Star Is Born has lived up to its title as the industry darling of awards season thus far. The Lady Gaga/Bradley Cooper romance — the fourth retelling of the classic Hollywood tale about a budding ingenue who falls for a tragic, fading entertainer — is currently the only film to score a nomination from all 11 significant industry guilds. Most importantly, it has notched nods from the Producers Guild of America, the Directors Guild of America, and the Screen Actors Guild. Not to mention the film has also landed significant attention from non-industry precursors like the Golden Globes and multiple critics groups around the country. A Star is Born's problem, however, is that — outside of Gaga's surefire Best Original Song champion \"Shallow\" — it hasn't won much of anything just yet. Given the Academy's preferential ballot system, A Star is Born could pick up significant steam in the wide-open Best Picture race, as Oscar's ranking system tips in the favor of passion votes. A Star is Born captures the heart as easily as its breathtaking aesthetics capture the eye, so expect it to snatch a wealth of nominations across the board on Tuesday morning. —Joey Nolfi EW Review: B+\n\n03 of 33 Roma - Best Picture, Best Director, Best Original Screenplay (Alfonso Cuarón), Best Actress (Yalitza Aparicio) Netflix Roma might seem like a world away from Gravity, the space thriller that won Alfonso Cuarón the best directing Oscar - the first Mexican and Hispanic filmmaker to win the award - in 2014. And yet, Cuarón once again delivers a quiet and nuanced examination of humanity, this time through the story of an indigenous Mexican housekeeper, Cleo (Yalitza Aparicio). Roma is a deeply personal tale for Cuarón, who penned the script based on his own memories of his childhood nanny, whom helped raise him. Alongside producing and directing the film, Cuarón took on cinematographer duties as well, capturing sweeping, expansive shots in black and white, following the daily lives of Cleo and the middle class family she works for in Mexico City in 1970. With Netflix distributing the film across theaters and its streaming platform and critics heaping warm praise on Cuarón's vision as well as newcomer Aparicio's performance, Roma has fast become an Oscar front-runner. If it wins the coveted Best Picture Oscar, it'll not only be Netflix's first win in the category, it'll also become the first foreign-language film to win the award. — Piya Sinha-Roy EW Review: A\n\n04 of 33 Green Book - Best Picture, Best Director (Peter Farrelly), Best Actor (Viggo Mortensen), Best Supporting Actor (Mahershala Ali), Best Original Screenplay Patti Perret/Universal Aside from the film's (multiple) publicity controversies, industry affection for the Peter Farrelly-directed Don Shirley biographical drama — which follows the jazz pianist (Mahershala Ali) and his racially insensitive bodyguard (Viggo Mortensen) as they tour the Deep South in the 1960s — has yet to cool in their wake. In fact, Ali's bid for the Best Supporting Actor trophy has solidified with significant strides on the visibility front, including huge victories at both the Golden Globes and the Critics' Choice Awards — two awards bodies that, while they don't share crossover membership with the Academy, provided a vital stage for the actor to make an acceptance speech in front of voters amid the Oscar voting window. The Globes also set the stage for the film's Best Picture nomination, too, by anointing it the top Musical or Comedy of 2018 just one day before Academy voting began. Expect the easily digestible, crowd-pleasing film to carry that momentum with a significant above-the-line haul after Oscar nods are announced. — Joey Nolfi EW review: B+\n\n05 of 33 Black Panther - Best Picture, Best Supporting Actor (Michael B. Jordan), Best Director (Ryan Coogler), Best Adapted Screenplay (Ryan Coogler, Joe Robert Cole) ©Marvel Studios 2018 Filmmaker Ryan Coogler not only delivered Marvel's first black superhero standalone film to critical praise and stellar box office success, but demonstrated how to ground a fantastical world with timely social messages. Amid the lavish world of Wakanda and a spotlight on black excellence, Coogler explores what it means to be black today through Chadwick Boseman's King T'Challa and Michael B. Jordan's powerful performance as empathetic villain Erik Killmonger. Given Black Panther's groundbreaking role in cinematic history, it's likely to earn a place in the best picture race, as well as garnering nods in the technical categories. Coogler's refreshing perspective may also see him recognized in the screenplay category - bolstered by the film's Writers Guild nomination for Coogler and Joe Robert Cole - and the directing, although Coogler's omission from the Directors Guild list makes it harder for him to crack into the Oscars best director race. — Piya Sinha-Roy EW Review: A-\n\n06 of 33 Can You Ever Forgive Me? - Best Picture, Best Actress (Melissa McCarthy), Best Supporting Actor (Richard E. Grant), Best Adapted Screenplay Mary Cybulski/Fox Searchlight Amid the industry's collective call for more women in front of and behind the camera, Marielle Heller's masterful Lee Israel biopic was poised to front the charge for female representation among the directing set this year. The industry guilds, however, didn't latch on to Heller's direction as much as they did Richard E. Grant's supporting turn and Melissa McCarthy's leading performance — the latter of which has ticked every box (including nods from the Screen Actors Guild, the Golden Globes, the Critics' Choice Awards, and the BAFTAs) necessary to score her well-deserved Oscar nomination alongside fellow Fox Searchlight contender Olivia Colman (The Favourite). Nicole Holofcener and Jeff Whitty's brilliant adapted screenplay should also find its place among the Oscar nominees, given their ballooning awards take throughout the season (including recognition from the Writers Guild of America and the BAFTAs). The film's chances at landing a Best Picture nomination, however, remain slim, as it hasn't racked up the necessary precursor honors (it has only registered on the National Board of Review's top 10 list thus far). — Joey Nolfi EW Review: B+\n\n07 of 33 The Favourite - Best Picture, Best Actress (Olivia Colman), Best Supporting Actress (Emma Stone, Rachel Weisz), Best Original Screenplay, Best Film Editing, Best Costume Design, Best Makeup & Hairstyling Yorgos Lanthimos/FOX Searchlight While films directed by women failed to make a splash across the board during the current awards race, films about them have had no trouble splashing into the conversation. In particular, The Favourite's trio of leading ladies — Emma Stone, Rachel Weisz, and Olivia Colman — have brought an undeniable jolt of performative electricity to Yorgos Lanthimos' peculiar period drama about two women dueling for Queen Anne's affections, enough so that the film evolved from potential spoiler at the top of the race to surefire Best Picture bet as we approach Oscar nominations morning. With multiple category appearances at the BAFTAs, Golden Globes, and Screen Actors Guild, The Favourite is bound to win the Academy's heart, too. — Joey Nolfi EW Review: A\n\n08 of 33 First Man - Best Picture, Best Actor (Ryan Gosling), Best Supporting Actress (Claire Foy). Best Director (Damien Chazelle), Best Visual Effects Universal Pictures Fresh off his La La Land Oscar win, Damien Chazelle dives into the story of Neil Armstrong and the high-stakes 1960s space race, reteaming with Ryan Gosling as Armstrong and The Crown star Claire Foy as his wife Janet. In a story that's both introspective and expansive in scope, Chazelle said he wanted to \"demythologize\" Armstrong as an American hero, and instead paint a portrait of a father grieving the loss of his young daughter and shouldering the hopes of a nation. Gosling's quiet, intimate performance and Foy's role have earned strong praise, while Chazelle's meticulous attention to detail could secure him another nomination in the directing race. The sets, production design and use of sound could also see First Man racking up numerous nods in the technical awards categories. But the film has been left out of the awards for the directors, writers, producers and screen actors guilds, all critical pitstops and indicators for Oscars. First Man's shot at the Oscar is a long one, but its masterful filmmaking efforts may find some recognition. —Piya Sinha-Roy EW Review: A-\n\n09 of 33 Beautiful Boy - Best Supporting Actor (Timothée Chalamet) Amazon Studios At April's CinemaCon in Las Vegas, an early look at a scene from Beautiful Boy between Steve Carell and Timothée Chalamet left many audience members teary-eyed. Based on the memoir of the same name by David Sheff about his son Nic's struggle with addiction, Beautiful Boy pairs two well-loved actors to play out the heart-wrenching journey of the Sheff family. Carell has been left off the best actor races so far, but Chalamet has been racking up the best supporting actor nominations across Golden Globes, BAFTA and Screen Actors Guild, and the film's heart-wrenching father-son tale could just be the right formula for awards voters who gravitate towards an emotional real-life drama. —Piya Sinha-Roy EW Review: B\n\n10 of 33 The Wife - Best Actress (Glenn Close) Sony Pictures Classic While critics and audiences alike have seemingly agreed that The Wife is a far from perfect film, praise for Glenn Close's leading performance has been unanimous. The six-time nominee will fulfill a long-gestating desire when she finally wins her overdue Oscar at the upcoming ceremony. She's already triumphed at every (important) precursor so far, and nothing seems capable of slowing her roll anytime soon. When the consensus forms around an overdue performer (Kate Winslet, Julianne Moore, etc.), the momentum becomes unstoppable, and that's (rightfully) what's happening to Close right now. — Joey Nolfi EW Review: B+\n\n11 of 33 BlacKkKlansman - Best Picture, Best Director (Spike Lee), Best Actor (John David Washington), Best Supporting Actor (Adam Driver), Best Adapted Screenplay David Lee/Focus Features If the story of a black police officer infiltrating the Ku Klux Klan isn't surreal enough, the fact that Spike Lee's BlacKkKlansman is based on a true story is what enables it to pack a punch as a timely reminder of fractured race relations in America back in the 1970s and now. Grounded by strong performances from an ensemble cast led by John David Washington (son of Oscar-winning Denzel Washington) as police officer Ron Stallworth, BlacKkKlansman earned rave reviews at its Cannes debut this year, winning the coveted Grand Prix and cementing it as an early awards contender. With nominations from the directors, writers, producers and screen actors guilds, BlacKkKlansman looks like a sure bet for Oscar nods. — Piya Sinha-Roy EW Review: B+\n\n12 of 33 If Beale Street Could Talk - Best Picture, Best Director (Barry Jenkins), Best Supporting Actress (Regina King) Tatum Mangus/Annapurna Pictures Adapted from the 1974 novel by beloved writer James Baldwin, Barry Jenkins' directorial follow-up to Moonlight struck a chord with critics on the early festival circuit, even landing nominations from the Golden Globes and the Critics Choice Awards. Key snubs from the BAFTAs, the Screen Actors Guild, and the Producers Guild of America could spell disaster for the project on Oscar nominations morning, however, as those groups typically indicate Academy tastes thanks to a high number of crossover membership. Given Supporting Actress Regina King's domination of the category at nearly every precursor on the trail, though, the film is on their radar in a big way, and the film could end up as the surprise honoree of the season. —Joey Nolfi EW Review: B+\n\n13 of 33 Won't You Be My Neighbor? - Best Documentary Feature The Fred Rogers Company Amid the recent wave of unsettling news from politics to Hollywood, Morgan Neville's earnest, refreshing biographical documentary about the good-natured TV legend Fred Rogers is a meaningful reminder of the simple ties of kindness that bind humanity. Sweet but never twee, Neville's essential meditation on the Pittsburgh-based host of Mister Rogers' Neighborhood (and the generations he influenced) taps into a nostalgic emotional vein. At the same time, he finds new context for Rogers' enduring message of compassion and understanding to flourish in the age of contemporary chaos. The industry (and audiences) ate it up, and Oscar will, too. — Joey Nolfi EW Review: A\n\n14 of 33 Destroyer - Best Actress (Nicole Kidman) Annapurna Another brilliant entry from a female director in 2018, Destroyer was heavily touted to make waves on the awards trail late last year. But its rise was too slow (it didn't release until Christmas Day) and critical reactions too polarized for its brilliant leading actress Nicole Kidman to become a major contender above the other buzzier performances in films with sturdier foundations in the Best Picture race. Still, Kidman's portrayal of a grizzled detective attempting to solve a murder case on the grim streets of Los Angeles' criminal underbelly did receive a visibility boost from the Golden Globes, but the publicity surge of other heavy-hitters like Lady Gaga (A Star is Born), Glenn Close (The Wife), Olivia Colman (The Favourite), and Melissa McCarthy (Can You Ever Forgive Me?) was too strong and ultimately pushed the Australian actress to the back of the pack. There's a slight chance that her good standing in the industry and her recent box office successes (The Upside and Aquaman occupied the top two spots on the domestic chart last week) could work in her favor for some last-minute-rally votes, so we can't discount her chances entirely. —Joey Nolfi EW Review: B-\n\n15 of 33 Incredibles 2 - Best Animated Feature Disney/Pixar Yes, the film box office hasn't been exactly lacking in superheroes, but it has been missing Pixar's first superhero family for the past 14 years. The return of the super-powered Parr family — Mr. Incredible, Elastigirl, and their three children Violet, Dash and scene-stealing Jack-Jack — has been welcomed warmly by critics and audiences, with Incredibles 2 smashing opening weekend box office records and serving up a reminder of the importance of inclusion in society. Given the love usually bestowed on Pixar films, this is the title to beat in the animated race. — Piya Sinha-Roy EW Review: B+\n\n16 of 33 Boy Erased - Best Supporting Actress (Nicole Kidman), Focus Features Joel Edgerton recruited his close friends Nicole Kidman and Russell Crowe to add star power to this heart-wrenching true story of a young man sent to gay conversion therapy by his religious parents, based on Garrard Conley's memoir of the same name. After star supporting turns in Oscar movies Manchester By the Sea, Lady Bird, and Three Billboards Outside Ebbing, Missouri, Lucas Hedges finally takes center stage, while Kidman and Crowe portray his parents in a film where Edgerton tackles a timely topic with a close-knit family that have to rethink their beliefs. Watch out for Hedges' other starring role this Oscars season, playing a troubled young man in Ben Is Back, alongside Julia Roberts. —Piya Sinha-Roy\n\n17 of 33 Widows - Best Actress (Viola Davis) 20th Century FOX A contemporary Oscar staple, Viola Davis has scored three nominations (and one victory) since 2009. But her might couldn't sway industry hands in favor of her Steve McQueen crime drama Widows, which featured a stellar ensemble of women (Michelle Rodriguez, Elizabeth Debicki, Cynthia Erivo) all worthy of awards recognition in their own right. But Widows was a minor disappointment at the box office, and outside of a surprise BAFTA nod for Davis, it hasn't placed among the top contenders of the season in any precursor race. Hope is still alive, though, given Davis' good standing with her acting peers that make up the Academy's largest and most influential branch. —Joey Nolfi EW review: C+\n\n18 of 33 First Reformed - Best Actor (Ethan Hawke), Best Original Screenplay A24 A critical favorite, First Reformed had no trouble grabbing attention from the year-end critics groups, but struggled when it came time to translate that love into industry weight. Perhaps a tad too complex and challenging to capture consensus appeal, Paul Schrader's masterfully wrought drama about a priest (Ethan Hawke) balancing his faith in God with earthly desires still stands a chance at earning a Best Original Screenplay nomination, though statistics (no love from the Directors Guild, Screen Actors Guild, BAFTAs, or Producers Guild of America) suggest other categories are nothing more than a distant hope at this point. — Joey Nolfi EW Review: B\n\n19 of 33 RBG - Best Documentary Feature Magnolia Pictures The $10 million domestic box office success of documentary RBG, about Supreme Court Justice Ruth Bader Ginsburg, may reflect audiences' desire to see real-life superheroes. Or it may just reflect the power that Ginsburg holds as a beacon of justice in a fractured political sphere. Directors Julie Cohen and Betsy West trace the life and legacy of Ginsburg in their documentary, and offer a snapshot into the fiercely sharp mind of a trailblazing legal warrior. In the Time's Up era in Hollywood, RBG has garnered praise from critics for spotlighting how one woman broke the rules and helped pave the way for a new generation of female empowerment. — Piya Sinha-Roy EW Review: A-\n\n20 of 33 Isle of Dogs - Best Animated Feature FOX Searchlight The whimsical world of Wes Anderson often strikes a chord with awards voters — for instance, The Grand Budapest Hotel won four of its eight Oscar nominations in 2014. Isle of Dogs sees the idiosyncratic filmmaker return to the world of stop-motion animation to tell a tale of an alternate reality near-future Japan where dogs are banished to an island. The film faces challenges after some critics panned the film for not hiring a more diverse voice cast and kicking off a larger conversation around cultural appropriation. Billed as an homage to his Japanese cinematic heroes, Anderson and his scrappy pups may be the underdogs in the animated feature race. — Piya Sinha-Roy EW Review: A-\n\n21 of 33 Eighth Grade - Best Original Screenplay A24 Bo Burnham's unique take on the coming-of-age genre notched the highest per-screen average of the summer back in July, and has since become one of the season's top buzz-builders with near universal critical acclaim. Success like that will be difficult for awards voters — particularly bodies like the Independent Spirit Awards — to ignore, especially with A24 backing the bid. Young star Elsie Fisher even scored a Golden Globe nod for her performance as a young, awkward pre-teen finding her voice amid the perils of adolescence. Still, a majority of the film's awards traction has only registered in screenplay categories, meaning Burnham's passion project will probably land only one nomination on Tuesday. — Joey Nolfi EW review: A\n\n22 of 33 Three Identical Strangers - Best Documentary Feature Courtesy of Sundance Institute Separated at birth and reunited as adults, the subjects of Tim Wardle's buzzy documentary took the world by storm with their unbelievable story of connection. The film built around them, however, examines the dark side to their public reunion, including a shocking revelation that was the talk of Sundance earlier this year. Hype-heavy documentaries are hit-or-miss with the Academy (Blackfish is an example of a notable snub in recent years), but Three Identical Strangers has the hook and the quality to back up a bid for a best documentary feature nod. — Joey Nolfi EW review: A\n\n23 of 33 Ben Is Back - Best Actress (Julia Roberts) Mark Schafer/LD Ent./Roadside Attractions Cue the Juliassance, as the actress with the mega-watt smile re-enters the conversation with a buzzy new TV show, Homecoming, on Amazon and stars alongside Lucas Hedges in Peter Hedges' Ben Is Back. While it's very early to determine IF this film will get an awards season release given that it does not yet have a distributor and little is known about the plot, Roberts' involvement and Lucas Hedges' second lead role of this awards season (he's also starring in Boy Erased) could push Ben Is Back into the early awards conversation. —Piya Sinha-Roy\n\n24 of 33 Wildlife - Best Actress (Carey Mulligan) IFC Films Carey Mulligan carries the majority of Wildlife, actor Paul Dano's directorial debut, which by the end of the 2018 traveled the festival trail from Sundance and Cannes to Toronto and New York. While actors didn't turn out to support their own at the Screen Actors Guild Awards — despite Mulligan delivering a knockout turn as one half of a disintegrating couple in 1960s Montana — Academy support is still in the cards, as the actress has a prior nomination and widespread critical support anchoring her bid. — Joey Nolfi EW Review: B+\n\n25 of 33 The Ballad of Buster Scruggs - Best Original Screenplay NETFLIX As last year's Mudbound and this year's Roma have demonstrated, Netflix might finally be finding its groove in above-the-line Oscar categories as the industry warms up to its graoundbreaking distribution model, which still favors streaming over theatrical bows. And, surprisingly, the Coen brothers have hitched a ride with the company for their upcoming Western The Ballad of Buster Scruggs. A drama-comedy anthology, the film stars an impressive cast (Tim Blake Nelson, Liam Neeson, Zoe Kazan) whose members could deliver some of the signature offbeat performances the Coens are known for coaching out of their actors. But festival reviews indicated the film is likely more of an enjoyable detour like Burn After Reading versus a bona fide awards power player like Fargo. But there's never a scenario in which it's wise to count a Coen brothers screenplay out of the race entirely. — Joey Nolfi EW review: B\n\n26 of 33 A Quiet Place - Best Actress (Emily Blunt), Best Director (John Krasinski) Paramount Pictures The long-anticipated on-screen pairing of Hollywood darlings Emily Blunt and John Krasinski did not fail to deliver at the box office and otherwise in this tense thriller about a family living in silence as they hide from monsters that are summoned by noise. Blunt's powerful performance as a pregnant matriarch and co-lead Krasinski's skillful directing and innovative take on the horror genre has put the couple together into the awards race, Blunt earning a SAG best supporting actress nomination while Krasinski and his creative team have been picking up nods at BAFTA, producers and writers guild awards. While it's not considered a frontrunner, A Quiet Place could earn Oscar love for its innovative take on the horror genre and the powerful performances that ground it. — Piya Sinha-Roy EW Review: B+\n\n27 of 33 Spider-Man: Into the Spider-Verse – Best Animated Feature, Best Picture Miles Morales (Shameik Moore), Peter Parker (Jake Johnson), and Gwen Stacy (Hailee Steinfeld) are all Spider-Man in 'Spider-Man: Into the Spider-Verse.'. Sony Pictures Animation Sony's dimension-hopping superhero flick may be late swinging into the animated race, but it's already racked up a 100 percent rating on Rotten Tomatoes and a win from the New York Film Critics Circle. Directors Bob Persichetti, Peter Ramsey, and Rodney Rothman put a fresh spin on the Spidey franchise by introducing Brooklyn teenager Miles Morales (Shameik Moore), and the film's experimental visuals and playful deconstruction of superhero tropes have already earned critical raves. —Devan Coggan EW Review: B-\n\n28 of 33 Mary Poppins Returns - Best Picture, Best Actress (Emily Blunt) Jay Maidment/Disney It has been 55 years since Mary Poppins sang and danced her way to five Oscars, including best actress for Julie Andrews, and this year might just see the magical British nanny return to the Oscar race. Mary Poppins Returns, with Emily Blunt embodying a new iteration of the titular character, comes with a solid dose of nostalgia as it sweeps viewers into a pure, fantastical tale set in 1940s London. The Banks children are now grown up and face their own problems, especially Michael Banks, now widowed and trying to take care of his three children and keep their house, when in flies Mary Poppins, to bring some order and hope when it's most needed. Anchored by Blunt's sharp, witty and heart-warming performance and bolstered by an all-star cast including Lin-Manuel Miranda's lamplighter Jack and Meryl Streep singing newly crafted songs, the film stands out as a bright, happy and hopeful tale that has won over critics and could earn its place in the best picture and best actress Oscar races. — Piya Sinha-Roy EW Review: B\n\n29 of 33 Vice - Best Picture, Best Director, Best Original Screenplay (Adam McKay), Best Actor (Christian Bale), Best Supporting Actress (Amy Adams), Best Supporting Actor (Sam Rockwell) Matt Kennedy/Annapurna Pictures How do you tell the life story of one of the most elusive and deliberately secretive figures in U.S. politics? That was the biggest challenge that faced Adam McKay in the crafting of his sharp satire Vice, as he attempted to dissect the life, character and motives for former Vice President Dick Cheney. Christian Bale once again disappears into the role of Cheney - which earned him a Golden Globe for best actor in a comedy - while Amy Adams plays his wife Lynne, as McKay charts the couple's ambition through the years. With an ensemble cast that includes Sam Rockwell as George W. Bush, Vice has split critics and audiences, but has earned nominations for Britain's BAFTA awards as well as the screen actors, directors, producers and writers guilds, making it a strong contender in the Oscar race. — Piya Sinha-Roy EW Review: B+\n\n30 of 33 Crazy Rich Asians - Best Picture, Best Supporting Actress (Michelle Yeoh), Best Adapted Screenplay (Adele Lim, Peter Chiarelli) Warner Bros. Pictures\n\n31 of 33 Bohemian Rhapsody - Best Picture, Best Actor (Rami Malek) Twentieth Century Fox\n\n32 of 33 Ralph Breaks The Internet - Best Animated Feature Disney Ralph Breaks The Internet takes us back into the world of Walt Disney Animation's 2012 hit Wreck-It Ralph, but this time places the beloved retro arcade game villain-turned-hero into the world of the internet. The film follows Ralph (voiced by John C. Reilly) and Vanellope (Sarah Silverman) as they go into a fast-paced tech metropolis to find a missing part for one of their arcade games, but the journey forces them to examine their co-dependent friendship and particularly Vanellope's desire for independence. With gorgeous visuals and a heart-warming tale of two friends, the film is a strong contender for the Best Animated Feature Oscar. — Piya Sinha-Roy EW Review: B+", "images": ["https://ew.com/thmb/RI-4a76K_3v7dIIQU5voLEkxqt0=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/boy_erased_20180503_05_r1526599040-2000-5f115279969a462c908bca002bbbea9b.jpg", "https://ew.com/thmb/qTJYGA54FYjX5mwvrarBAe3cfsM=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/the-ballad-of-buster-scruggs-image-credit_-netflix-2000-819a58744eab4166bd1f9603797d2ae8.jpg", "https://ew.com/thmb/qgehumoivoMN9f20USSyFOOM2oQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/SCAD-Film-Fest-12-103125-8c15ae90578d422cbc95604b3c412ab2.jpg", "https://ew.com/thmb/sJZgKzYw8canbrJDQy4134TXiLQ=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/8u02_d009_01503r-2000-1c6455f5beac4b7fae08d0b808af0fcc.jpg", "https://ew.com/thmb/LV3OneZ0Hgvhhi09wTBfMj7N40U=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/awardist-podcast-america-ferrera-oct9-32c9a4842c7c47c7bbdf79dff44fdf67.jpg", "https://ew.com/thmb/qR2npQN0YypsJxfCswMvnilekUE=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/war7025_v009_009205-1012_r2-2000-bd283da698184d60bc5fbb13ba060826.jpg", "https://ew.com/thmb/Vd06WLn8rMPOSXpvKGv8PdclSCE=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/bohemian-rhapsody-bohemianrhapsody_trailer_thumb_textless4_rgb-2000-7d1ec5c33b374c55ac38597b7db7a591.jpg", "https://ew.com/thmb/sk3tFA_scL51ODmogSfK48hDzkE=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/asib-03547rv3-2000-fd395a441333458aaebfad4860321de1.jpg", "https://ew.com/thmb/laY79k0ew9xVMX4ZxeU0UwCMPhM=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/incredibles25a5e49448bf762-2000-12d413606bb24195bb73b3cb465320d0.jpg", "https://ew.com/thmb/YvDbdSxjrzQo-TQ-FBQHwl9q-rE=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/0l1020078cc_r-2000-4cf69fc6a5904c70abf7e0042a04c6b3.jpg", "https://ew.com/thmb/ybXnnYFcniJPtenaBEgjbHYR2xE=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/018_bs_16983_r1544213367-2000-8f3645f9f48346b2bb4f21b3d640a14b.jpg", "https://ew.com/thmb/G4Y6wQCLAvzVWBOPGJQC1mnO4Pg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Cynthia-Enrivo-Ariana-Grande-356-110625-b1eff79dcf8a4645a80774fe72a6917d.jpg", "https://ew.com/thmb/e2dFUsH7XKP_O_2CRZRLa6pdjgk=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/eighth-grade-still-1_24855647888_o-2000-7a6830015841447296cd328bfee4c1a7.jpg", "https://ew.com/thmb/O1_cNM5zeplW8XuDOMksxken9Y4=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/beautiful-boy-2000-3cadaa487ac5477689a279869755f728.jpg", "https://ew.com/thmb/Bi6-m-1W9CO0SBvR1z18cIYcL-o=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/The-Awardist---Oct-22nd-5c73fac29fcc45c2b8b4028c57ac9559.jpg", "https://ew.com/thmb/2KTbGSonB_Bc5EOaAARb4BQoEHY=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/wildlife-image-2-2000-6e773f5b16c74430b1997016f3fdbd64.jpg", "https://ew.com/thmb/oXG9NGSL49VXjnaXzeDKygZnZfc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/oscar-gallery-2000-2acf6e9e7ca440d0b0d09c0f33d33f2a.jpg", "https://ew.com/thmb/8QQHr6UXgRVMrIkKIknOioKdCQk=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/ralphbreakstheinternet5bde877d35563-2000-87fcb8866aeb435b99d7ae8a10d0b4ca.jpg", "https://ew.com/thmb/2krhvHAoN4GLrtMMZU4VjoWZUpM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Ariana-Grande-Cynthia-Erivo-Wicked-For-Good-Oscar-Jennifer-Lopez-Kiss-of-the_Spider-Woman-062225-4dedd9b62db444dabcb9e700f8a325ee.jpg", "https://ew.com/thmb/v_MxzTvpMYEklXDjhXAaiD-Kb_0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Kelly-Ripa-Mark-Consuelos-Live-With-Kelly-and-Mark-01-102025-32e50f89fda34e7fb51b85e689c2ec31.jpg", "https://ew.com/thmb/gi59S4kPk4RGgpF1PfRcO3l0vHc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/JacobElordi-TheAwardistDigitalCoverFINAL-c489820abd2c4c1a934cdd08e0bf201c.jpg", "https://ew.com/thmb/K6p2dNS3uub7y4IwZNqsJkKPKKA=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/widows-2000-3bff56d85756489fa0648c09a628a70c.jpg", "https://ew.com/thmb/7fOr7kpS9UdMcgJOT1Ak1yNwT1A=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/awardist-podcast-OCT1-0e643c4de8a842b698a7bb612f94fec1.jpg", "https://ew.com/thmb/Lvi_BS1HzQz5B3bZUJgvnrhi7Qk=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/roma-2000-b36b34a391d94e0481eeeddaafd95554.jpg", "https://ew.com/thmb/Aex8sEu08w5sLx5kAZUxzLa2UbI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/The-Awardist---Oct-16th-795d841d869049c0bd89f885cb668ada.jpg", "https://ew.com/thmb/sTER7-Jd_RfkiFubACoskqlNX1A=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/aquiietplace-2000-84fed5b8c01b409cb634dd9d2c769e44.jpg", "https://ew.com/thmb/jiX3ma2gwax3XOA3ea5j84_thxA=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/three-identical-strangers-still-1_39727702581_o-2000-bc4457e94d6647b9ae452097f10fcce6.jpg", "https://ew.com/thmb/yvYCyktihsCjnI0DsW5wTGXQsAY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/The-Awardist---Sept-10th-4009c2539cc1454884d6642df6f771a2.jpg", "https://ew.com/thmb/0415ORY0YWPOysJoTPlSk6LUUJQ=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/fr_ethan-hawke-2000-cb3fd573d1b440b794c6551897fcc4ef.jpg", "https://ew.com/thmb/HDO28MpfY1UZZxTQbVD8wKCvJIk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/debbie-allen-tom-cruise-dancing-16th-governors-awards-111725-4a-a749d58fe7f24086a9db26ee5fa33db6.jpg", "https://ew.com/thmb/IBJmxdWqd5R0lykWHyWFSuyvi5Y=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/wanda-sykes-will-smith-102725-5f8cadcaf4024277b26e2b3f2068984d.jpg", "https://ew.com/thmb/0wB2DfljwY6utfzqjHo35N567JU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/golden-globes-statue-oscars-statue-grammy-award-103025-46e24b26be8d4ce8ba87ac7e00f45c49.jpg", "https://ew.com/thmb/N5vbHnY41XANQ3AmqFXx6NcwsYI=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/4117_d025_13343_r_crop-2000-02c6e8d095ee49dbbe46f86a6a742a1d.jpg", "https://ew.com/thmb/y2G2HGHDkiyNYBYSPG2rktGDna0=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/002_cyefm_03105_r-2000-e841b6d6094948259437dc0268c74587.jpg", "https://ew.com/thmb/IYtpmEZ4TZ-RTdMR3Aml_7S8tpY=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/isle-of-dogs-2000-f22c9db8d4b946408622257747f4e0db.jpg", "https://ew.com/thmb/yBA3LfdVpHwM_v7N_ed2VNFWt5s=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/bib_11355-mark-schafer-5000x3333-2000-383b13a2729a4136bfa42efbf9bbad01.jpg", "https://ew.com/thmb/rFiV3eZyry8wHJTY2pLUWQkQ4y0=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/wybmn_rgb_layered-files-2000-99990bd0a0564929bc1a7155d3c6bb49.jpg", "https://ew.com/thmb/nW0Z6IjwnkqYYAhJxnA0nb5DGeg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/billy-rae-cyrus-elizabeth-hurley--59th-Annual-CMA-Awards-111925-e97c7b4bc9844e7e8f954726b70785e6.jpg", "https://ew.com/thmb/Mx1UaAhT2ym2PCRXJTdJlYkMDrA=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/destroyer-firstlookimage1-2000-1ea419583c6f429782e55f22206c96ef.jpg", "https://ew.com/thmb/yHEpniAbu4QjdOky_h2K_8XmqPA=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/oscar-gallery-2000-2acf6e9e7ca440d0b0d09c0f33d33f2a.jpg", "https://ew.com/thmb/sf5Z-KZBykgpq_dE3cScgqhWdU4=/200x200/filters:no_upscale():max_bytes(150000):strip_icc()/Joey-Nolfi-author-photo-ba4923fec03a4027868306485696ef41.jpg", "https://ew.com/thmb/lbZHB9BHxFt9WOiR60zZU3GEwoc=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/rbg-2000-da346eeb74cc4fa396ed1a12f9b86637.jpg", "https://ew.com/thmb/6g2YNsVZv3wl8RCtoJHa37UNZIM=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/MaryPoppinsReturns5c12d39d20748-2000-9af5cfaeff6846859252eb17a7f3786e.jpg", "https://ew.com/thmb/s0cDcH54n0mkiYKKwhwHuJQCFcY=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/cra-fptb-0239-2000-8ce33e20ad914b6b8151b8e9f9a114cd.jpg", "https://ew.com/thmb/KdgbggsiEcWCdOeihirNOxIrdPQ=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/coldwar-2000-8cbdca821fae41088d1fe2da77bf15eb.jpg", "https://ew.com/thmb/bIO9z7E0-Lo1l5vB1AcH0VnUl3M=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/the-grinch-carrey-momsen-11925-e40dd1bcc58b45d19cb147c57be3ec51.jpg", "https://ew.com/thmb/m2gNtYWNJ5yL8naEnjJ5sMXQRyo=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/the-wife-2000-68000fc9cb2f4970964f327a7e738b9c.jpg", "https://ew.com/thmb/JPZrESqNGbI8sSXyX-3XNu3RilI=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/first-man-2000-52530530736d40b1a969a1596d6d88c0.jpg", "https://ew.com/thmb/4Xshhj5MKtc-ajddYsPthMbYruY=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/if-beale-street-could-talk-3-2000-937f30c4378143f4b9c22e839a0c9c09.jpg", "https://ew.com/thmb/eyrRvH_5stthtpEfKsTPWd5XwUk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/The-Awardist---Rose-Byrne-d07d1e062e0c4a2cbabf961d0ab20183.jpg", "https://ew.com/thmb/TC_pSF7cCu99VgJTjfS76PcixJc=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/SpiderVerse_bac348.1059_lm_v1-2000-ade1491f0cf84b379c66a521624c02c1.jpg"], "top_img": "https://ew.com/thmb/oXG9NGSL49VXjnaXzeDKygZnZfc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/oscar-gallery-2000-2acf6e9e7ca440d0b0d09c0f33d33f2a.jpg", "keywords": [], "authors": ["Joey Nolfi Is A Senior Writer At", "Ew'S Editorial Guidelines", "Piya Sinha-Roy Is A Former Senior Writer At", "Gerrad Hall", "Joey Nolfi", "Ew Staff", "Mekishana Pierre", "Staff Author", "Lauren Huff", "Patrick Gomez"], "canonical_link": "https://ew.com/oscars/2019-oscar-contenders/", "title": "Oscars 2019 contenders: movies on Academy radar so far", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "It's never too early for Oscar predictions, and 2018 has already spawned a slate of contenders. If the Oscars were tomorrow, here's who'd be nominated.", "parsely-section": "Awards Shows & Events", "parsely-tags": "Topher Grace,Jason Reitman,Emily Blunt,FYC,The Awardist,Ryan Coogler,Spike Lee,Movies,Glenn Close,Mister Rogers", "article": {"section": "EW", "author": "https://www.facebook.com/entertainmentweekly"}, "og": {"type": "article", "site_name": "EW.com", "url": "https://ew.com/oscars/2019-oscar-contenders/", "title": "Oscars 2019: From 'A Star Is Born' to 'Black Panther,' here are the top contenders so far", "description": "It's never too early for Oscar predictions, and 2018 has already spawned a slate of contenders. If the Oscars were tomorrow, here's who'd be nominated.", "image": "https://ew.com/thmb/oXG9NGSL49VXjnaXzeDKygZnZfc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/oscar-gallery-2000-2acf6e9e7ca440d0b0d09c0f33d33f2a.jpg"}, "twitter": {"card": "summary_large_image", "site": "@EW", "title": "Oscars 2019: From 'A Star Is Born' to 'Black Panther,' here are the top contenders so far", "description": "It's never too early for Oscar predictions, and 2018 has already spawned a slate of contenders. If the Oscars were tomorrow, here's who'd be nominated.", "image": "https://ew.com/thmb/oXG9NGSL49VXjnaXzeDKygZnZfc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/oscar-gallery-2000-2acf6e9e7ca440d0b0d09c0f33d33f2a.jpg"}, "vf": {"url": "https://ew.com/oscars/2019-oscar-contenders/"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.104.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.104.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.104.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.104.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.104.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://ew.com", "summary": ""}