{"url": "https://www.independent.co.uk/arts-entertainment/tv/news/thandie-newton-emmys-speech-full-dress-award-westworld-supporting-actress-a8542481.html", "text": "Your support helps us to tell the story Read more Support Now From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it's investigating the financials of Elon Musk's pro-Trump PAC or producing our latest documentary, 'The A Word', which shines a light on the American women fighting for reproductive rights, we know how important it is to parse out the facts from the messaging. At such a critical moment in US history, we need reporters on the ground. Your donation allows us to keep sending journalists to speak to both sides of the story. The Independent is trusted by Americans across the entire political spectrum. And unlike many other quality news outlets, we choose not to lock Americans out of our reporting and analysis with paywalls. We believe quality journalism should be available to everyone, paid for by those who can afford it. Your support makes all the difference. Read more\n\nThandie Newton gave a moving acceptance speech after being announced as the winner for Outstanding Supporting Actress at this year's Emmy Awards.\n\nThe Westworld star prompted laughter from the audience at the Hollywood ceremony when she began with \"I don't even believe in God but I'm going to thank her tonight\".\n\nShe told the aurdience: \"I am so blessed. I am so f***ing blessed...\" At this point the actress clapped her hand over her mouth as she realised she'd dropped the expletive – to more cheers from the audience.\n\n\"To work with the people that I have gotten to work with,\" she said. \"The cast and crew of – I can't believe I'm here – the cast and crew of Westworld, I love you all so much.\"\n\nNewton beat The Handmaid's Tale stars Ann Dowd, Yvonne Strahovski and Alexis Blediel, Game of Thrones' Lena Headey, Millie Bobby Brown from Stranger Things, and Vanessa Kirby from The Crown to win the award. She revealed that the day was all the more special because it was her daughter's 18th birthday.\n\n\"My family, my daughter Ripley turns 18 today and I get to guide you and love you and protect you, which is my north star, I love you so much baby,\" she said. \"Thank you, thank you for this,\" she concluded, before walking offstage with The Handmaid's Tale stars Elisabeth Moss and Samira Wiley, who had presented her with the award.\n\nIt was Newton's second nomination and her first win at the Emmys. She was previously nominated for the same role in Westworld last year.\n\nThis year's Emmy Awards were relatively uneventful, with highlights being off-script moments such as director Glenn Weiss proposing to his partner Jan Svendsen onstage.\n\nCo-hosted by Saturday Night Live's Colin Josh and MIchael Che, the ceremony saw Game of Thrones emerge as the biggest winner on the night, while Atlanta fans were left disappointed as the acclaimed FX comedy left empty handed.\n\nGame of Thrones' win for Outstanding Drama Series raised a few eyebrows. As Ed Powers noted for The Independent, even the show's biggest fans would admit that the seventh series was littered with flaws and lacked the gravitas of previous seasons.\n\nWhat this year's Emmys did prove is how TV is rapidly changing, with its more \"obscure gems\" recognised among the traditional blockbuster winners.\n\nSee more of The Independent's Emmys coverage here.", "images": ["https://static.the-independent.com/s3fs-public/thumbnails/image/2018/09/18/08/Thandie-Newton.jpg?width=1200&height=800&crop=1200:800"], "top_img": "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/09/18/08/Thandie-Newton.jpg?width=1200&height=800&crop=1200:800", "keywords": [], "authors": [], "canonical_link": "https://www.independent.co.uk/arts-entertainment/tv/news/thandie-newton-emmys-speech-full-dress-award-westworld-supporting-actress-a8542481.html", "title": "Emmy Awards: Thandie Newton gives emotional speech for Westworld win", "meta_data": {"robots": "max-image-preview:large,max-video-preview:-1", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "News", "sitename": "The Independent", "page path": "/arts-entertainment/tv/news", "page type": "Article", "adPageType": "Article Page", "description": "Actress said the evening was particularly special because it was her daughter's 18th birthday", "og": {"updated_time": "2018-09-18T08:38:10.000Z", "site_name": "The Independent", "title": "Thandie Newton gives emotional speech for Emmy Awards win", "url": "https://www.the-independent.com/arts-entertainment/tv/news/thandie-newton-emmys-speech-full-dress-award-westworld-supporting-actress-a8542481.html", "type": "article", "description": "Actress said the evening was particularly special because it was her daughter's 18th birthday", "image": {"identifier": "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/09/18/08/Thandie-Newton.jpg?width=1200&height=800&crop=1200:800", "secure_url": "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/09/18/08/Thandie-Newton.jpg?width=1200&height=800&crop=1200:800"}, "locale": "en_GB"}, "article": {"published_time": "2018-09-18T08:38:10.000Z", "modified_time": "2018-09-18T08:38:10.000Z", "section": "Culture", "subsection": "TV & Radio", "author_name": "Roisin O'Connor", "content_type": "story", "word_count": 647, "image_count": 1, "embed_count": 3, "video_count": 1, "internal_link_count": 6, "external_link_count": 3}, "date": "2018-09-18T08:38:10.000Z", "viewport": "width=device-width,initial-scale=1,minimum-scale=1", "theme-color": "#919191", "indy-test-internal-article-helmet": "indy", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "twitter": {"title": "Thandie Newton gives emotional speech for Emmy Awards win", "site": "@Independent", "card": "summary_large_image", "description": "Actress said the evening was particularly special because it was her daughter's 18th birthday", "image": "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/09/18/08/Thandie-Newton.jpg?width=1200&height=800&crop=1200:800"}, "keywords": "[\"Emmys 2018\",\"Emmy Awards\",\"Thandie Newton\",\"Hollywood\",\"Game of Thrones\",\"Atlanta\",\"Internal\"]"}, "movies": [], "publish_date": 1537259890.0, "source": "https://www.independent.co.uk", "summary": ""}