{"url": "https://en.wikipedia.org/wiki/Comme_des_Gar%C3%A7ons", "text": "Japanese fashion brand\n\nComme des Garçons garments on display at the Metropolitan Museum of Art\n\nComme des Garçons (CDG, pronounced [kɔm de ɡaʁsɔ̃]) is a Japanese fashion label, founded by Rei Kawakubo in 1969. It is based in Paris, where its main office is located. Other than fashion, the label has expanded to include jewelry and perfume (under the brand Comme des Garçons Parfums).\n\nThe company shows its collections during Paris Fashion Week and Paris Men's Fashion Week. In 2017, it was reported that the company and its affiliates generated a revenue \"of over $280 million a year\".[1]\n\nHistory [ edit ]\n\nComme des Garçons for H&M tuxedo jacket, 2009\n\nThe label was started in Tokyo by Rei Kawakubo in 1969 and established as a company in 1973. The brand's name was inspired by Françoise Hardy's 1962 song \"Tous les garçons et les filles\", particularly from the line \"Comme les garçons et les filles de mon âge\" (\"like the boys and girls my age\").[2] The brand became successful in Japan in the 1970s and a menswear line was added in 1978. In 1981, the company had a debut show in Paris. Kawakubo's heavy use of black distressed fabrics, and unfinished seams were viewed negatively by French critics.[3]\n\nThroughout the 1980s, its clothes were often associated with a distressed and punk-oriented style. In 1982, Kawakubo's collection \"Destroy\" was heavily criticised. Women's Wear Daily called it the \"Hiroshima bag lady look\", and the Associated Press proclaimed Kawakubo the \"high priestess of the Jap wrap\". Unusual styles continued through the 1990s, many of which were disliked by experts.[4]\n\nIn 1993, the company created its perfume line, Comme des Garçons Parfums.\n\nIn 2004, the company split its business into handmade garments produced in France, and non-handmade garments in Japan, Spain, and Turkey. The product line Play, the most recognizable and mainstream Comme des Garçons casual luxury line, is produced mainly in Japan, Spain, and Turkey, while some of its products are also made in France.[5]\n\nPerfume [ edit ]\n\nThe company also produces a line of agendered fragrances, most of which are unconventional in the world of perfume and aligned with the styles of its garments.[6]\n\nThe company released its first fragrance, Comme des Garçons, in 1994[7] and its first anti-perfume Odeur 53 in 1998.[8] The anti-perfume features a blend of 53 non-traditional scents, which is rarely heard of in many other fragrance brands.[9]\n\nThe company also released the Luxe series Champaca, for which artist Katerina Jebb produced the visuals.[citation needed]\n\nAdrian Joffe, the founder's husband and CEO of the company, established two companies. Comme des Garçons Parfums is for licensing some of the perfumes to Puig from 2002[10][11] and Comme des Garçons Parfums for selling the rest by its own.[12]\n\nThe company developed a unisex fragrance, G I R L, and released it on August 28, 2014.[13] Artist KAWS designed the bottle.[14]\n\nIn 2017, the company launched a new fragrance, Concrete, and marked its launch in the US with a dinner curated by the artist and chef, Laila Gohar.\n\nFashion [ edit ]\n\nIts collections are designed in the studio in Aoyama, Tokyo, and manufactured in Japan, France, Spain, and Turkey. Over the years, the company has repeatedly associated itself with international arts and cultural projects. The 1997 spring-summer collection, often referred to as the lumps and bumps collection, which contained fabric in bulk and balls on the garments, led to a collaboration, also in 1997, between Rei Kawakubo and New York-based choreographer Merce Cunningham called Scenario. The 2006 autumn/winter collection dealt with the concept of the persona,[15] the different ways to present one's self to the world. Fusing tailored menswear with feminine elements such as corsets and flower printed dress fabrics, Persona was another collection that combined the feminine with the masculine.\n\nJunya Watanabe[16][17] and, as of recently, Tao Kurihara[18][19] have started their own sub-labels under the label. Both were also involved in designing for the casual women's knitwear line Tricot.\n\nComme des Garçons dress\n\nThe company have collaborated with various other labels over the years such as Hammerthor,[20] H&M,[21][22] and Stüssy.[23]\n\nIn other media, Björk wore the label in the music video for Isobel.[citation needed] Frank Ocean named a song after the company.[24] John Waters devoted a chapter of his 2010 book Role Models to the label and founder.[25][26] Swedish musician Jonna Lee collaborated with the company in the creation of her audiovisual album Everyone Afraid to Be Forgotten, where the fashion house designed the costumes for the film.[27][28][29]\n\nControversies [ edit ]\n\n1995: 'Auschwitz' fashions [ edit ]\n\nThe 1995 \"Sleep\" collection consisted of striped pajamas \"bearing prints of identification numbers and marks of military boot prints\".[30] Contemporaneous media coverage juxtaposed images of the collection with images taken at Auschwitz concentration camp, and the controversy received international coverage.[31][32] The World Jewish Congress condemned the collection,[30] and fashion critic Suzy Menkes called the collection \"'Auschwitz' fashions\".[30][31] Kawakubo responded that the collection had been \"completely misunderstood\" and the controversy made her \"very sad\".[30]\n\n2015: Guarachero boots [ edit ]\n\nThe Spring/Summer 2015 menswear collection included \"guarachero\" boots based on the Mexican pointy boots of Matehuala, Mexico, raising concerns of cultural appropriation.[33][34]\n\n2020: Black hairstyles [ edit ]\n\nIn January 2020, a predominantly White group of models wore cornrowed lace-front wigs in the fall 2020 menswear show.[35] This was seen as the appropriation of Black culture, particularly with the use of traditionally Black hairstyles on non-Black models. Stylist Julien d'Ys responded on Instagram, \"Dear all, my inspiration for the Comme Des Garçons show was Egyptian prince, A Look I found truly beautiful and inspirational. A look that was an hommage. Never was it my intention to hurt or offend anyone, ever. If I did I deeply apologize.\"[36]\n\nExhibitions [ edit ]\n\nAfter the Paris début, the company exhibited photographs by Peter Lindbergh at the Centre Georges Pompidou in Paris in 1986.[37] In 1990, it held an exhibition of sculpture. And again in 2005, it held an exhibition in Shinjuku, Tokyo of advertising and graphic designs.\n\nIn August 2010, the company opened a 19,000 square feet (1,800 m2) six-level flagship store in Seoul, South Korea, featuring a branded art-exhibition space, its first outside Japan.[38]\n\nIn May 2017, Metropolitan Museum of Art of New York held a fashion exhibition with the theme Rei Kawakubo/Comme des Garçons Art of the In-Between. This exhibition ran until September of the same year.[39][40]\n\nStores [ edit ]\n\nAoyama Store\n\nSignature boutiques are located in London (as Dover Street Market), Paris, New York City,[41] Beijing,[42] Hong Kong,[43] Seoul, Manila, Saint Petersburg, Tokyo, Kyoto, Osaka, Fukuoka. The company also maintains concessions at select department stores, such as Isetan.\n\nThe company opened the first Guerrilla stores in 2004 in Berlin.[44] The Guerrilla stores aim to be open for only one year[45] and to spend a minimal amount of money on the interiors.[46] The stores are also purposefully located away from fashionable hubs and districts of a city. Guerrilla stores have been opened, and subsequently closed, in Reykjavík, Warsaw, Helsinki, Singapore, Stockholm, Athens, and others. In July 2007, a Guerrilla Store opened in Beirut, Lebanon, and in February 2008, a Guerrilla Store opened in downtown Los Angeles, the first in the United States.[47] In November 2008, it opened another Guerilla store in the west end of Glasgow. In 2004 its opened another in London of Dover Street Market.[48][49]\n\nIn December 2009, the company opened a 4,400 square feet (410 m2) store in Hong Kong called Under The Ground. Hong Kong also had a guerrilla store that opened and closed in previous years, run by Silly Thing Hong Kong.[50] In March 2012, it opened a store in Manila. Also, the first Dover Street Market in Japan opened in Ginza.[51] In December 2013, Dover Street Market in New York City opened.[52] In 2021, the company reintroduced its \"Guerilla\" stores, pioneering temporary boutiques that predated the pop-up shop movement by a good decade or so.", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Comme_des_Garcons_at_the_Met_%2862473%29.jpg/250px-Comme_des_Garcons_at_the_Met_%2862473%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Comme_des_Garcons_at_the_Met_%2862473%29.jpg/1200px-Comme_des_Garcons_at_the_Met_%2862473%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Comme_des_Garcons_logo.svg/250px-Comme_des_Garcons_logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Comme_des_Garcons_men_for_H%26M_09.jpg/250px-Comme_des_Garcons_men_for_H%26M_09.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/CdG.JPG/250px-CdG.JPG", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/78/Comme_des_Gar%C3%A7ons_dress_in_red%2C_white_and_blue.jpg/250px-Comme_des_Gar%C3%A7ons_dress_in_red%2C_white_and_blue.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Comme_des_Garcons_at_the_Met_%2862473%29.jpg/1200px-Comme_des_Garcons_at_the_Met_%2862473%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Comme_des_Gar%C3%A7ons", "title": "Comme des Garçons", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Comme_des_Garcons_at_the_Met_%2862473%29.jpg/1200px-Comme_des_Garcons_at_the_Met_%2862473%29.jpg", "width": 1200, "height": 872}, "title": "Comme des Garçons - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}