{"url": "https://www.cosmopolitan.com/entertainment/tv/a59354/spencer-and-heidi-discuss-hills-moments/", "text": "13 min read\n\nSo, listen. I could start by telling you how I grew up with Lindsay Lohan. How I can chart my entire childhood by which of her classic movies was playing in the background ( as I processed my own parents’ divorce; , their second marriages; while I figured out what the actual hell high school was).\n\nBut I won’t, because every girl born within a decade of the now-36-year-old actor has some version of the same story—at least one film from LiLo’s decades-deep career that’s sat with them in a personality-forming way. And, of course, some narrative they’ve crafted in their mind about the nature of her celebrity and what she’s like as a person all this time later.\n\nI’m going to focus instead on the right now, because Lindsay is right here in front of me in the iconically freckled flesh. She’s come all the way from her home in Dubai to shoot a cover story that’s a very big deal for obvious reasons. Getting the famously private star—so private that she moved to Dubai because paparazzi are illegal there—to sit down for a candid interview has been a feat nearly a year in the making. And we have a lot of new ground to cover.\n\nFor one, she’s getting ready for the November 10 premiere of her Netflix movie Falling for Christmas, to be followed by two more films in a multi-picture deal that promises the return of the rom-com queen we all love. Also on the long list of roles she’s currently juggling: executive producer of those Netflix movies, podcast host ( ), narrator of the Amazon Prime reality dating show , Super Bowl commercial star (for Planet Fitness), newlywed…you get the idea. The internet is cheering for a “Lohan-aissance” for a reason.\n\nAnd in the surprisingly intimate, barefaced moments before she steps in front of the camera, Lindsay seems pretty happy about it too. She’s perched on a glam chair at the Roxy Hotel in New York, sipping an iced matcha, surrounded by her team. There’s publicist Leslie Sloane (they’ve been together since The Parent Trap), hairstylist DJ Quintero, makeup artist Kristofer Buckle, manicurist Elle Gerstein, and Netflix rep Shannon Skoczylas. As they flutter around fielding calls, working out logistics, and wielding brushes of all kinds, Lindsay speaks to me with the unhurried thoughtfulness of someone who knows how easily her words could be twisted and misconstrued into inaccurate clickbait—how easily, how often they have been. She’s guarded but still quick to share a laugh. (I’m never quite sure whether I’m in on the joke or just, ever so frustratingly, outside of it.) It’s a striking combination of the weariness that comes from a lifetime of sharing herself with the world and a deep-in-her-bones excitement for what’s to come. Her favorite year of her life, she writes in her Cosmo Quiz? This one.\n\n\n\nI don’t want to get in the way—please keep doing whatever you need to while we talk. Kris, you two have worked together for a long time, right?\n\nKristofer Buckle1: What was the first time, when you were 16?\n\n1. For the uninitiated: On a scale of pretty cool to genuinely major, Kristofer Buckle is somewhere off the charts. Other people who trust him with their faces: Mariah Carey, Blake Lively, and Jessica Chastain.\n\n\n\nLindsay Lohan: 16. I think it might have been for . Mean Girls was after, then we did and all that.\n\nKB: I remember on SNL, she was going through a real self-tanner phase. The old-school lighting guy was like, “She’s too tan! She’s too tan!”\n\n\n\nWe did a million things together. She was a new starlet and at that age where makeup was becoming more important. And she was always having fun with it and always had an opinion.\n\nLL: Always more contour.\n\nKB: She knew what she wanted to look like. She had a very strong vision for herself. And she was always a bit ahead of the curve with glam. Even before the whole glowy skin thing, she was like, “I want it to be shinier.”\n\nWhat’s your skincare like now?\n\nLL: I’m big on nonintrusive facial experiences, anything I can do. I love lasers. I just started Morpheus8, which I’m obsessed with.\n\nOh, god. I just did that and it was the most painful thing, like rubber bands snapping actual fire into my face. I was sitting there the whole time like, Is this really what I’m willing to do for beauty?\n\nKB: It’s always worth it.\n\nLL: Here’s the trick: You have to ask them to give you the numbing cream ahead of time and put it on yourself at home an hour before you go.\n\n\n\nIt’s always nice in the age of filtered selfies to dig into what really goes into getting camera-ready.\n\nLL: Right, because we only ever know what we see on the screen. We don’t know what’s happening behind it.\n\nWhat are your feelings about social media?\n\nLL: I don’t even know. There’s too much of it. No, it is nice. Because now I feel like…when I first started out in the business, none of us had a say in how to control our own narrative. There were paparazzi pictures, and then people ran with it. So I think it’s really good that in this day and age, people can say who they are and who they want to be. And I admire and appreciate that. I’m a little jealous because I didn’t have that. But I think it moves really fast and I just try to keep up as best I can. And I check everything before I post it. I’ll send it to people. Because you have to.\n\n\n\nThere’s that positive element of having more control over the narrative but also the difficulties of trolls or having the pressure of potentially messing up on such a massive scale.\n\nLL: You have to take everything people say with a grain of salt and just be you. And slow down, because everyone’s so quick right now. People just don’t stop. You’ve got to chill.\n\nIf people were to see the real Lindsay on a random night at home in Dubai, what would that look like?\n\nLL: I cook a lot. I follow this @EatingHealthyToday Instagram and they do these really great healthy meals. I cook a lot of Italian. I do a lot of pastas. I do a lot of an Arabic dish called machboos. It’s chicken with rice and vegetables. I do a really good borscht soup. I also go to bed really early. 9:30.\n\nDo you sleep well?\n\nLL: Yes, except when I got here to New York. I think it was because of anxiousness about getting up on time. But I need my seven to eight hours of sleep. When I’m filming, I can get away with six sometimes if we have really early calls, but I like my sleep and feel better when I get it.\n\n\n\nSo your days are really packed right now with work. How are you feeling through it all?\n\n\n\nLL: Really good. I’m really excited. It’s fun to be back in New York and doing shoots. And I love this part of the process. After you’ve filmed, this is the fun part. So I feel really great and just really excited and happy.\n\n\n\nIs it hard to balance your time when you’re back here?\n\nLL: Well, the first thing I like to do is see my niece, because she’s the cutest thing ever. I always spend time with family. I go to a few specific restaurants, like Carbone, Blue Ribbon Sushi. Visit Central Park. And always work.\n\n\n\nAlways work—that’s New York. And this deal you have with Netflix has been getting so much great buzz. Was the opportunity an easy yes for you?\n\nLL: It was really comforting to me, when I got the script, to see a movie that was a rom-com2 because it’s always fun to work on something lighthearted and family-oriented that makes people happy and provides a bit of an escape. And I was excited to kind of come back, to do something with Netflix, who is a big family in a way. It was the right fit for me, especially to be able to executive produce it.\n\n2. The plot? Lindsay plays a newly engaged heiress who has amnesia after a skiing accident. A handsome local man takes her into his care and…well, it’s a rom-com—you can imagine the rest.\n\nYou know, I think people always wonder: What exactly does “executive producing” really mean?\n\nLL: It’s a really different role that I get to play aside from just starring in the movie. It’s being involved in the projects at every step: the whole casting process, the editing and production process. And even parts of the script.\n\nSo as you’re shooting, if something’s not working, you’re helping to rewrite it?\n\nLL: Yeah, and working on the costumes and the wardrobe and the character development.\n\n\n\nInteresting. I’m curious about how you approach your acting at this point in your career, when you’ve been doing it since you were 5 years old.\n\nLL: It’s always evolving. It comes very naturally to me to play a role, especially in a romantic comedy, so it doesn’t always feel like work. But when you really look at the character and how much more you can give people onscreen through the character’s eyes, there’s so much to play with and change. With this movie, I specifically wanted to do more physical comedy because I missed doing that. And I was like, “We’re here, why not? I’m willing to do it.” I think the bigger you go in those situations, the better it is. You can’t be afraid of it. And then for the next one,3 I wanted to play a different kind of character, more nerdy.\n\n3. Irish Wish, which she’s filming this fall.\n\n\n\n\n\n\n\nIf you were to think of the movie version of your own life so far, what would be the big, pivotal moments that punctuate it? What memories come to mind as particularly meaningful?\n\n\n\nLL: The first time I hosted Saturday Night Live. That was a big moment for me. And then when I hosted the MTV Movie Awards, those were both really big moments for me. But I think when you’re in it, it doesn’t hit you. And I never thought I would say this, but as you get older in life,4 you look back on those things and you’re like, Did I really do that? Oh my gosh, I really did all that stuff, which is a really cool feeling in the end. And I’m the kind of person that now wants to do it again but ten times better.\n\n4. At this moment, she raises an eyebrow, pauses for laughs, and looks around the room. Like she said, she’s good at comedy.\n\nWhat does ten times better look like?\n\nLL: Different awards. SNL again, obviously. And roles that I haven’t been able to play. I haven’t done an action film. I really want to do something like that.5 There are other things I can’t say. They’re on my vision board.\n\n5. Lindsay superfans might remember that she has, sort of, done an action film—or at least a trailer for a fake one. Remember how Cameron Diaz’s overachieving movie-trailer editor character in The Holiday splices together footage of Lindsay and James Franco’s upcoming “hit”? “We always said we should make that movie one day,” Lindsay says. “I’m still waiting for Nancy Meyers to write it.”\n\n\n\nIt’s really striking when studying your body of work to realize that you must have been working constantly for a large chunk of your childhood. Did you ever find yourself thinking, I need a break?6\n\nLL: Yeah, and you can take breaks, but you just have to know when the time is right. Because it’s also good to keep the pace going. You become a family when you’re on a set, and then when the project wraps, it just stops. So it’s like culture shock—you don’t know what to do with yourself. It’s good to have things to keep your mind active. And it also helps to keep in touch with all those people, which I do. Like Nancy Meyers and her daughters, we’re all really close.\n\n6. Lindsay’s publicist Leslie chimes in: “We had to throw her a Sweet 17 party because she never had a Sweet 16. She was on-set.”\n\n\n\nYou’ve worked with so many of the absolute biggest names in the industry—is there anyone you interact with professionally or otherwise who you get nervous around?\n\nLL: Al Pacino.7 I actually have asked him for a lot of advice for a lot of things, especially work-wise and just life-wise, just because he’s a great person to talk to. Recently, I was at a restaurant in San Francisco with my husband and his family, and all of a sudden, this waiter was bringing our food to a different table, or I thought he was.…I was like, “Oh no, he’s taking that to the other table,” and then I realized he was blocking a paparazzi flash. And so when he came by, I go, “Oh, thank you so much for doing that.” And he goes, “Oh. No, I wasn’t blocking it for you. Al Pacino’s here.”\n\nI went to say hi. I don’t get nervous talking to him on the phone, but I was nervous this time. And I was like, “Is it okay if we take a picture? We need to photograph this moment.”\n\n7. Yes, Lindsay and Al freaking Pacino are friends. They connected in London in 2014 when she acted in the play Speed-the-Plow, written by his friend David Mamet, and he offered her advice for her pre- and post-show rituals.\n\nWhat’s the best advice he gave you?\n\nLL: He always says, “Focus on your craft when it comes to your work.” And I think that’s really important. Don’t let other outside things blur your vision.\n\nIt seems like you’re trying a lot of new skills these days—like with your podcast, where you bring on guests who are experts in all sorts of different fields, from Gigi Gorgeous to Salt-N-Pepa. You’re quite a good interviewer.\n\nLL: Thank you, because I still get nervous. I’m so used to being asked the questions, so it’s very different for me to have to ask the questions. Usually, I know the person. I like to just keep it very lighthearted and very friendly because that’s more interesting to me—the getting to know who someone really is. It’s not about all the gossipy stuff.\n\nThere are definitely some good learnings and hacks from your guests too, about success and self-care. What are your own nonnegotiables when it comes to taking care of yourself?\n\n\n\nLL: Exercise. I love running on treadmills; it’s my favorite way to just release. And I meditate in the mornings. I meditate in the shower, actually.\n\n\n\nWhat about your support system? Are there certain people you always turn to?\n\nLL: Well, I have an amazing husband, who’s a very calm person.8 Just the best. And my family. And I feel like I have a small group of good friends who are just really good people. That’s the only support that I really need: friends, family, and loved ones.\n\n\n\n8. Can confirm, Lindsay’s husband, Bader Shammas, has exceptionally chill energy. He quietly stopped by set midday with her brother Cody. Lindsay is resolute in keeping the details of their relationship private but occasionally\n\nslips in compliments about him on her podcast, where she’s said, “He is one of the wisest people I know and gives the most sound advice.”\n\nAre those mostly industry friends or other people?\n\nLL: No, not industry friends. Totally separate.\n\nWhat about other hobbies outside of work? Do you collect anything?\n\nLL: Purses. Vintage clothing. And vintage jewelry too, actually. If I see something, I’ll wait on it, and if I keep thinking about it a week, two weeks, three weeks later, then I will go get it. So I’m actually really good. I used to be like, get it right away. I used to be impulsive. I’m not anymore.9\n\n9. The waiting rule doesn’t seem to apply when the piece is just That Good—as was the case with an Alaïa bodysuit she bought right off the rack on-set to wear straight to dinner after the shoot.\n\n\n\nWe get a two-minute warning: Lindsay is needed downstairs and Kris can’t apply her liquid liner until she can hold still. I have to hurry.\n\nOkay, just a couple more questions. What are you most proud of in this moment?\n\nLL: The future, I think. I’m excited for the future and I’m just proud of how everything’s coming together.\n\nDo you feel like people are rooting for your success?\n\nLL: I feel everything’s very positive, and I like that. I want to keep that momentum.\n\nYou’re about to be taking pictures all day today, with everyone’s eyes on you. What’s going through your head right before you step into that moment? Is it nerve-racking?\n\nLL: I kind of just immerse myself in it right away. It’s just like, something happens. And it’s always been like that with me. I just change. I get comfortable right away. The second I’m in front of the camera, everything else stops.\n\nCover image: Alexandre Vauthier tuxedo jacket, waistcoat, and trousers. Nicole Rose necklace. Chopard rings. Lindsay’s own ring.\n\nStylist: Cassie Anderson. Hair: DJ Quintero for at The Wall Group. Makeup: Kristofer Buckle at Crosby Carter Management. Manicure: Elle Gerstein at Crosby Carter Management using Emilie Heathe in Perfect Red. Props: Chelsea Maruskin at Art Department. Location: Roxy Cinema New York.\n\nExecutive producer: Abbey Adkison. Senior producer: Liesl Lar. Director of photography: Janet Upadhye. Second camera: Kevin Kim. Audio: Chris Bianrosa. Editors: Sarah Ng and Janet Upadhye.\n\n", "images": ["https://hips.hearstapps.com/hmg-prod/images/cos070122feacoverstory-002-1666282885.jpg?crop=1xw:1xh;center,top&resize=640:*", "https://media.hearstapps.com/loop/lindsay-1666640777.mp4/poster.jpg", "https://media.hearstapps.com/loop/2022-cosmopolitan-covershoots-ep15-lindsaylohan-sn-loops-v02-1666646120.mp4/poster.jpg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2025-11-13-at-8-26-25-am-6915dccd7e9c7.png?crop=0.563xw:1.00xh;0.219xw,0&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523ffffff&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://hips.hearstapps.com/hmg-prod/images/cos070122feacoverstory-006-1666283227.jpg?resize=2048:*", "https://hips.hearstapps.com/hmg-prod/images/beastinme-102-240924-cs-00259-r-6917adfc5ec1f.jpg?crop=0.668xw:1.00xh;0.154xw,0&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523000000&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/cosmopolitan/static/images/logos/network-logo.722abed.svg?primary=%2523ffffff", "https://media.hearstapps.com/loop/2022-cosmopolitan-covershoots-ep15-lindsaylohan-sn-loops-v01-1666646008.mp4/poster.jpg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/globe-simple-regular.e7f303c.svg", "https://hips.hearstapps.com/hmg-prod/images/cos070122feacoverstory-008-1666282910.png?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/selling-the-oc-cast-leave-6915b3b002820.jpg?crop=0.505xw:1.00xh;0.274xw,0&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523ffffff&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/cosmopolitan/static/images/logos/logo.eca17dd.svg?primary=%2523000000", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/cos070122feacoverstory-009-1666282940.png?crop=1xw:1xh;center,top&resize=640:*", "https://hips.hearstapps.com/hmg-prod/images/cos070122feacoverstory-004-1666283252.jpg?crop=1xw:1xh;center,top&resize=640:*", "https://hips.hearstapps.com/hmg-prod/images/prince-andrew-duke-of-york-and-king-charles-iii-attend-news-photo-1763066178.pjpeg?crop=0.758xw:1.00xh;0.122xw,0&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/bookmark-simple-regular.9d9d56b.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523000000&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/clock-regular.b2f2888.svg", "https://media.hearstapps.com/loop/2022-cosmopolitan-covershoots-ep15-lindsaylohan-sn-loops-v04-1666814377.mp4/poster.jpg", "https://hips.hearstapps.com/hmg-prod/images/cos070122feacoverstory-003-1666282967.jpg?crop=1xw:1xh;center,top&resize=640:*", "https://hips.hearstapps.com/hmg-prod/images/m-the-puppet-master-jeff-probst-addresses-the-remaining-news-photo-1585256153.jpg?crop=0.676xw:1.00xh;0.0401xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/wicked-brand-collabs-2025-69028628d3416.png?crop=0.502xw:1.00xh;0.498xw,0&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/cos070122feacoverstory-001-1666282851.png?crop=0.566xw:1.00xh;0.0561xw,0&resize=2048:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://hips.hearstapps.com/hmg-prod/images/cos070122cover-digital-1666986136.jpg?resize=480:*", "https://hips.hearstapps.com/vidthumb/images/2022-cosmopolitan-covershoots-ep15-lindsaylohan-sn-thumbnail-01-1666708137.jpg?crop=1.00xw:1.00xh;0,0", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/envelope-simple-regular.91a0134.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/untitled-design-2024-09-18t103848-899-66eae66b47c2d.png?crop=0.330xw:0.660xh;0.335xw,0.0929xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/sarah-ferguson-duchess-of-york-attends-the-traditional-news-photo-1763131536.pjpeg?crop=0.883xw:1.00xh;0.0595xw,0&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/lindspqneew-1666888437.png?crop=1.00xw:0.489xh;0,0&resize=640:*", "https://www.cosmopolitan.com/_assets/design-tokens/cosmopolitan/static/images/logos/logo.eca17dd.svg?primary=%2523ffffff", "https://media.hearstapps.com/loop/2022-cosmopolitan-covershoots-ep15-lindsaylohan-sn-loops-v05-1666645905.mp4/poster.jpg", "https://hips.hearstapps.com/hmg-prod/images/cos070122feacoverstory-005-1666283399.jpg?crop=1.00xw:0.855xh;0,0.145xh&resize=2048:*", "https://hips.hearstapps.com/hmg-prod/images/568669905-1390146615809557-6973902315575227966-n-68fa6145198d0.jpg?crop=1xw:0.6417100694444444xh;center,top&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://hips.hearstapps.com/hmg-prod/images/171339-0701-v1-691b41c82c55d.jpg?crop=0.803xw:1.00xh;0.0913xw,0&resize=360:*", "https://media.hearstapps.com/loop/2022-cosmopolitan-covershoots-ep15-lindsaylohan-sn-loops-v03-1666645837.mp4/poster.jpg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/disney-night-its-the-most-enchanting-night-of-the-season-as-news-photo-1759888936.pjpeg?crop=0.732xw:0.916xh;0.146xw,0.0581xh&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/season-3-momtok-is-back-but-damaging-revelations-and-news-photo-1763047973.pjpeg?crop=0.668xw:1.00xh;0.167xw,0&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/caret-left-regular.5546078.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523000000&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/x-regular.e414d97.svg", "https://hips.hearstapps.com/hmg-prod/images/cos070122feacoverstory-007-1666283427.jpg?resize=2048:*", "https://hips.hearstapps.com/hmg-prod/images/cos070122feacoverstory-005-1666283399.jpg?crop=1.00xw:0.334xh;0,0.323xh&resize=1200:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/saved.ad81f1a.svg?primary=%2523ffffff"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/cos070122feacoverstory-005-1666283399.jpg?crop=1.00xw:0.334xh;0,0.323xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.cosmopolitan.com/entertainment/celebs/a41646042/lindsay-lohan-return-to-acting/", "title": "Eight Hours With Lindsay Lohan", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Lindsay Lohan on Returning to Acting, Her Husband Bader Shammas, and Finding Balance", "description": "Lindsay Lohan on her acting career, her new Netflix comedy, \"Falling for Christmas,\" her return as rom-com queen, and what's next.", "theme-color": "#000000", "og": {"site_name": "Cosmopolitan", "title": "Eight Hours With Lindsay Lohan", "description": "In which the icon—and new Cosmo cover star—digs into her first Netflix project, surviving early-2000s paparazzi, her friendship with Al Pacino, married life in Dubai, and what comes next.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/cos070122feacoverstory-005-1666283399.jpg?crop=1.00xw:0.334xh;0,0.323xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.cosmopolitan.com/entertainment/celebs/a41646042/lindsay-lohan-return-to-acting/", "type": "article"}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "opinion": "false", "section": "Celebs", "modified_time": "2022-10-31T12:00:00Z", "published_time": "2022-10-31T12:00:00Z"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "parsely-metadata": "{\"socialHeadline\":\"Eight Hours With Lindsay Lohan\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/cos070122feacoverstory-005-1666283399.jpg?crop=1.00xw:0.668xh;0,0.213xh&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/cos070122feacoverstory-005-1666283399.jpg?crop=1.00xw:0.334xh;0,0.323xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/cos070122feacoverstory-005-1666283399.jpg?crop=1.00xw:0.668xh;0,0.213xh", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/cos070122feacoverstory-005-1666283399.jpg?crop=1.00xw:0.334xh;0,0.323xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "never", "sailthru.excerpt": "So, listen. I could start by telling you how I grew up with Lindsay Lohan. How I can chart my entire childhood by which of her classic movies was playing in the background (The Parent Trap as I processed my own parents’ divorce; Freaky Friday, their second marriages; Mean Girls", "sailthru.tags": "entertainment,Pop Culture,celebs,Celebs,print-magazine,From the Magazine,cosmopolitan-cover-stories,Cover Stories,Cosmopolitan-US", "sailthru.date": "2022-10-31 12:00:00", "sailthru.socialtitle": "Eight Hours With Lindsay Lohan", "sailthru.contenttype": "longform-article"}, "movies": [], "publish_date": 1667217600.0, "source": "https://www.cosmopolitan.com", "summary": ""}