{"url": "https://tvline.com/2018/08/16/the-royals-cancelled-season-5-e/", "text": "After four dramatic seasons, the Henstridge family's rule over England is coming to an end: The Royals will not return for a fifth season, TVLine has confirmed.\n\n\"E! will not be moving forward with another season of The Royals, which launched in 2015 as the network's first original scripted series,\" a spokesperson for the network said in a statement. \"Over four seasons, The Royals took viewers behind the palace gates on a scandalous journey filled with twists and turns. We are grateful to the cast and our producing partners at Lionsgate and Universal Cable Productions.\"\n\nAccording to our sister site Deadline, Lionsgate is currently shopping the series to other networks, with the possibility of Pop picking up the show for Season 5.\n\nThe Royals starred Elizabeth Hurley as Queen Helena, left a widow following the tragic murder of King Simon in the show's first season. The Royals also starred William Moseley as Prince Liam, Alexandra Park as Princess Eleanor, Max as Prince King Robert, Tom Austen as Jasper and Jake Maskall as Cyrus.\n\nThe Royals' fourth (and final) season ended with Robert marrying Willow, Eleanor and Jasper getting pre-engaged, Liam and Kathryn discussing the future of (gasp!) their baby, and Cyrus at last reuniting with Violet. Helena also kicked her latest boy toy out of her bed... but that's nothing to celebrate.\n\nMany fans suspected that The Royals wasn't long for this world when creator/showrunner Mark Schwahn was investigated — and eventually fired — over allegations of sexual harassment. More than 20 members of the show's cast and crew, including Park, released a statement in November accusing Schwahn of misconduct.\n\nCoupled with The Arrangement's cancellation in May, The Royals' axing leaves E! with no scripted programming currently on the air, though the cable net did hand a pilot order to the dramedy Juicy Stories in March.\n\nOur Cable TV Renewal Scorecard has been updated with The Royals' cancellation. Are you disappointed by the show's untimely demise, or were you prepared for the worst?", "images": ["https://www.tvline.com/img/TVLine-Icon-RGB-Default-Color.svg", "https://www.tvline.com/img/TVLine-Logo-RGB-Default-Color.svg", "https://www.tvline.com/tvline/news/the-royals-cancelled-season-5-e-900039/the-royals-cancelled-season-5.jpg"], "top_img": "https://www.tvline.com/tvline/news/the-royals-cancelled-season-5-e-900039/the-royals-cancelled-season-5.jpg", "keywords": [], "authors": ["Andy Swift"], "canonical_link": "https://www.tvline.com/news/the-royals-cancelled-season-5-e-900039/", "title": "'The Royals' Cancelled — No Season 5 For E! Drama Series", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "max-image-preview:large", "thumbnail": "https://www.tvline.com/tvline/news/the-royals-cancelled-season-5-e-900039/the-royals-cancelled-season-5.jpg", "description": "'The Royals' will not continue beyond Season 4 at E!", "mrf": {"tags": "Content Type:Legacy Article;Primary Category:News;Category:News;Headline Approver:Unknown;Trello Board:Legacy"}, "og": {"site_name": "TVLine", "title": "The Royals Cancelled After 4 Seasons - TVLine", "image": "https://www.tvline.com/tvline/news/the-royals-cancelled-season-5-e-900039/the-royals-cancelled-season-5.jpg", "description": "'The Royals' will not continue beyond Season 4 at E!", "type": "article", "url": "https://www.tvline.com/news/the-royals-cancelled-season-5-e-900039/"}, "twitter": {"title": "The Royals Cancelled After 4 Seasons - TVLine", "description": "'The Royals' will not continue beyond Season 4 at E!", "site": "@TVLine", "card": "summary_large_image", "image": "https://www.tvline.com/tvline/news/the-royals-cancelled-season-5-e-900039/the-royals-cancelled-season-5.jpg"}, "article": {"published_time": "2018-08-16T21:13:02+00:00", "modified_time": "2024-04-25T20:52:28+00:00", "author": "Andy Swift"}}, "movies": [], "publish_date": 1534392000.0, "source": "https://tvline.com", "summary": ""}