{"url": "https://en.wikipedia.org/wiki/Hayden_Christensen", "text": "Canadian actor (born 1981)\n\nHayden Christensen (born April 19, 1981)[1] is a Canadian actor. He gained recognition for his portrayal of Anakin Skywalker / Darth Vader in the Star Wars media franchise. He first appeared in the prequel trilogy films, Star Wars: Episode II – Attack of the Clones (2002) and Star Wars: Episode III – Revenge of the Sith (2005), and later reprised his role in the Disney+ series Obi-Wan Kenobi (2022) and Ahsoka (2023).\n\nChristensen began his career on Canadian television at the age of 13, then diversified into American television in the late 1990s. His early work includes The Virgin Suicides (1999), Life as a House (2001), and Shattered Glass (2003). He earned praise for his performances as Sam in Life as a House and as Stephen Glass in Shattered Glass. Christensen's honours include the nominations for a Golden Globe Award and a Screen Actors Guild Award, as well as the Cannes Film Festival's Trophée Chopard. His other notable works include Awake (2007), Jumper (2008), Takers (2010), and Little Italy (2018).\n\nEarly life\n\nChristensen was born in Vancouver, British Columbia to Alie, an American speechwriter, and David Christensen, a Canadian computer programmer and communications executive.[1][2] His father is of Danish descent, and his mother has Swedish and Italian ancestry.[2] Christensen is one of four children, with three actor siblings: older brother Tove, older sister Hejsa, and younger sister Kaylen.[1][3] He spent summers on Long Island with his maternal grandmother, Rose Schwartz.[4]\n\nChristensen attended Unionville High School in Markham, Ontario.[5] He was an athlete in high school, playing hockey competitively and tennis on a provincial level.[4] He attended the Actors Studio in New York City; he studied as well at the Arts York drama program in high school.[6] After accompanying his older sister to her agent's office after she landed a role in a Pringles commercial, he began being cast in commercials as well, including for Triaminic cough syrup in 1988.[6]\n\nCareer\n\n1993–2005: Early work\n\nChristensen made his acting debut in September 1993, when, at the age of 12, he played a supporting role on the German-Canadian television series Macht Der Leidenschaft/Family Passions.[7] The following year, he had a minor role in John Carpenter's In the Mouth of Madness.[7] From 1995 through 1999, he appeared in several films and television series, including Harrison Bergeron, Forever Knight, Goosebumps, The Virgin Suicides, and Are You Afraid of the Dark?[7]\n\nHe acquired wider notice while starring in Fox Family Channel's television series Higher Ground in 2000, portraying a teen who was sexually molested by his stepmother, and then turned to drugs in his despair.[7][8]\n\nChristensen's critically acclaimed portrayal of a misunderstood teenager in Life as a House (2001) earned him Golden Globe and SAG Award nominations, as well as the National Board of Review's award for Breakthrough Performance of the Year.[9][10][11] However, the performance did not receive widespread public notice.[8] In 2002, Christensen made his London theatre debut with Jake Gyllenhaal and Anna Paquin in This Is Our Youth.[12]\n\nHe went on to receive positive reviews for 2003's Shattered Glass, which tells the true story of journalist Stephen Glass, who was discovered to be fabricating stories as a writer for The New Republic and other publications.[13][14] Peter Travers of Rolling Stone wrote, \"Hayden Christensen is sensational as Glass, finding the wonder boy and the weasel in a disturbed kid flying high on a fame he hasn't earned.\"[15] In 2005, Christensen made his Broadway debut when he appeared briefly in a 10-minute play.\n\nIn 2005, he took part in the fifth annual \"24 Hour Plays\" benefit, which raises cash for nonprofit groups in the Big Apple.[16]\n\n2000-2005: Star Wars prequel trilogy\n\nOn May 12, 2000, Christensen announced that he would be starring as an adult Anakin Skywalker in Star Wars: Episode II – Attack of the Clones (2002) and Star Wars: Episode III – Revenge of the Sith (2005); Skywalker was previously portrayed by Jake Lloyd as a child in Star Wars: Episode I – The Phantom Menace (1999). The casting director reviewed about 1,500 other candidates before director George Lucas selected Christensen.[17] Lucas is quoted as saying that he chose Christensen because he \"needed an actor who has that presence of the Dark Side\". This was essential to solidify the story that Lucas was trying to tell: Anakin Skywalker's fall from grace and transformation into Darth Vader.\n\nChristensen admitted to Star Wars Insider in 2005, that he found it difficult bridging the gap between Jake Lloyd's Anakin as an innocent boy and the villain, Vader was introduced as in the original trilogy. While his co-star, Ewan McGregor had Alec Guinness to emulate, Christensen had no one to emulate. He said, \"Ultimately, I had to be the linear connection between the Anakin that Jake Lloyd played, and capture Darth Vader as portrayed by Sebastian Shaw when he was demasked in Return of the Jedi.\"\n\nDuring the production of Revenge of the Sith, Christensen asked Lucas if a special Vader suit could be constructed to fit his own body, rather than have a different actor don one of the original sets of Vader armour worn by David Prowse.[19] Lucas agreed, and a suit was engineered to fit Christensen's frame, even including extensions to allow for the actor to attain Vader's 6 ft 6 in (1.98 m) height. His voice as the \"robotic\" Vader, however, was dubbed over by James Earl Jones, who first made the voice famous in the original trilogy.[20]\n\nIn one of the most controversial changes made to the Star Wars original trilogy,[21] Christensen was inserted into the 2004 DVD release of Return of the Jedi, where he replaced Sebastian Shaw as the force ghost of the redeemed Anakin Skywalker.[22][23] Lucas wanted Anakin's inner person to return to who he was before he turned to the dark side.[24] Christensen insisted this was done without his knowledge, an act that was confirmed by Lucasfilm itself in the featurette \"Return of the Jedi: What has changed?\" as seen on the official website to commemorate the 2006 DVDs.[25]\n\nChristensen's performance in both Episode II and III received generally mixed reviews from critics,[26][27][28][29] although contemporary reviews note that his performance was mostly affected by Lucas' directing and the dialogue, and has since seen positive reappraisal in retrospect.[30] In his 2019 memoirs, C-3PO actor Anthony Daniels praised Christensen and McGregor for their lightsaber duel in Revenge of Sith describing them as \"marvellous.\" In 2022, when reflecting on the prequel trilogy and the reappraisal, Christensen said, “It’s like those films had a gestation period, where they needed a little time to ferment in the public psyche. The reception that the films have now, it’s very heartwarming.”[32]\n\nChristensen was named in both People magazine's 50 Most Beautiful People and Teen People's 25 Hottest Stars under 25.[33] For his performance in Episode III, he won the MTV Movie Award for Best Villain.[34]\n\n2006–2018: Further work, films and television\n\nHayden Christensen in 2010\n\nBetween 2006 and 2007, he starred in Awake, with Jessica Alba, which tells the story of a man who remains awake but paralyzed during heart surgery,[7][35] and co-starred in Factory Girl, opposite Sienna Miller and Guy Pearce.[7][36] Christensen next co-starred with Samuel L. Jackson, Jamie Bell, and Rachel Bilson in the film Jumper, the story of a young man who discovers he has the ability to teleport; the film was released on February 14, 2008.[37][38] Bilson and Christensen co-starred again in the same segment of the film New York, I Love You.[39] Christensen appeared opposite Mischa Barton in Virgin Territory, which was released directly-to-DVD in North America on August 26, 2008.[40] The film, based on The Decameron, is about a group of people who escape the Black Plague epidemic by hiding out in a Tuscan villa in Italy.[41]\n\nIn October 2009, Christensen started shooting the horror film Vanishing on 7th Street, directed by Brad Anderson, with Thandiwe Newton and John Leguizamo.[42][43] Christensen appeared in the crime drama Takers with Idris Elba and Paul Walker, released in the United States on August 27, 2010.[44] Quantum Quest: A Cassini Space Odyssey is the fourth film in which Christensen stars with Samuel L. Jackson.\n\nIn the early 2000s Christensen formed a production company Forest Park Pictures alongside his brother Tove. The company produced two films that Christensen appeared in Shattered Glass and Vanishing on 7th Street.[45] In 2010, Christensen sued USA Network over allegations that they stole his idea for the TV show Royal Pains. The suit alleges that Christensen met with USA to pitch a similar series entitled Housecalls. During the meeting, Christensen alleges, he was never informed that a similar program was in development.[46][47] Although a federal judge at first dismissed Christensen's lawsuit in 2011, in June 2012, the 2nd Circuit Court of Appeals reversed this decision and remanded the case back to the district court for further proceedings, in what was considered a legal victory for Christensen.[48][49]\n\nOn May 20, 2013, during the Cannes Film Festival, the Russian company Enjoy Movies announced the creation of Glacier Films, an alliance company with Christensen and his brother Tove. Over a three-year period, Glacier Films intended to make 11 \"micro-budget\" movies costing $1.5M each. The first project, American Heist, starring Christensen, Adrien Brody and Jordana Brewster, started filming in June 2013. It is a remake of Steve McQueen's The Great St. Louis Bank Robbery.[50] In 2014, he starred in the American-Chinese-Canadian film Outcast, an action drama, alongside Nicolas Cage.[51]\n\nIn 2015, Christensen starred in the film 90 Minutes in Heaven co-starring Kate Bosworth and directed by Michael Polish based on the best-selling novel by the same name. In 2015, filming began of an unreleased World War II Nazi zombies horror movie titled Untöt, set to star Christensen.[52] In 2017, he was in the film First Kill alongside Bruce Willis. In 2018 he appeared in the Canadian-American romantic comedy Little Italy with Emma Roberts and in the same year was in The Last Man.[53][54]\n\n2019-present: Return to the Star Wars franchise\n\nIn 2019, a few years after the Walt Disney Company acquired Lucasfilm, Christensen returned to the role of Anakin Skywalker, providing a voice cameo of the character's voice in Star Wars: The Rise of Skywalker.[55] Although Christensen was not involved in Rogue One: A Star Wars Story, he praised the film saying, \"I loved what they did with it. The character predates me, and it's always been a collective effort in a lot of ways. I thought it was brilliant.\"[56]\n\nChristensen also received a voice credit as Anakin Skywalker jointly alongside Matt Lanter for the penultimate episode of the final season of the animated television series Star Wars: The Clone Wars entitled \"Shattered\" despite the fact the dialogue used for the episode spoken by Christensen was reused archival audio from Revenge of the Sith.[57] On October 22, 2021, it was reported that Christensen would also reprise the role for the Disney+ series Ahsoka.[58]\n\nIn May 2022, Christensen reprised his role of Anakin Skywalker / Darth Vader for the Obi-Wan Kenobi limited series on Disney+.[59][60] His portrayal earned positive reviews from critics, noting a huge improvement from his performance in the prequel trilogy.[61] He appeared in the documentary special Obi-Wan Kenobi: A Jedi's Return which premiered on September 8, 2022, Disney+ Day.[62] In 2023, Christensen appeared in four episodes of Ahsoka and was digitally de-aged.[63] He was first seen wearing his outfit from Revenge of the Sith and later another outfit similar to the one Anakin wore in the early series of The Clone Wars. His portrayal earned more positive reviews.\n\nOn 19 April 2025, during one of the panels at Star Wars Celebration Japan, Christensen said that he would reprise his role in the second season of Ahsoka.[64] On 25 April 2025, Christensen and Samuel L. Jackson surprised the audience at a screening of the Revenge of the Sith 20th anniversary re-release in Los Angeles. Christensen told the audience that he had \"so many amazing memories of making\" Revenge of the Sith.[65]\n\nHe has been attending several conventions as part of Star Wars Celebration as a guest since 2017.[66][67][68] In April 2019, Christensen met Matt Lanter at Star Wars Celebration Chicago and said to him, \"I love what you guys are doing. Thanks for keeping Star Wars alive.\"[69]\n\nPersonal life\n\nChristensen with then-girlfriend Rachel Bilson filming Jumper in Rome in 2006\n\nIn 2007, Christensen began dating actress Rachel Bilson, with whom he starred in the movie Jumper. They became engaged on December 25, 2008.[70][71] In mid-2010, they broke up, but began dating again a few months later.[72][73][74][75] On October 29, 2014, Bilson gave birth to their daughter.[76] Christensen and Bilson separated in September 2017.[77]\n\nIn 2007, Christensen bought a farm near Uxbridge, Ontario.[78][79] He noted in 2008 that he had been renovating the property himself and devoting time to learning about \"livestock, crops, and agricultural machinery\".[78] His farm also features a vegetable garden and an apple orchard.[78] In November 2013, Christensen collaborated with Canadian fashion chain RW&Co to release a men's clothing line inspired by his farm.[80] In 2015, Christensen explained to The Los Angeles Times another reason he bought the farm was because “he didn’t want to grow too entitled as an actor” after starring in Star Wars. Stating “I guess I felt like I had this great thing in Star Wars that provided all these opportunities and gave me a career, but it all kind of felt a little too handed to me. I didn’t want to go through life feeling like I was just riding a wave,” he said. He acknowledged that the break would impact his work, but wasn’t bothered by it.[81] Christensen continues to be hands on with his farm, in 2023 he revealed at a convention that he had hand built multiple fishing ponds on his farm, that contain water features, complete with plumbing that Christensen did himself.[82]\n\nChristensen is an avid Toronto Maple Leafs fan.[83] He also enjoys playing the piano.[84] In 2008, Christensen performed a public service announcement for Do Something's Teens for Jeans Campaign.[85] He modelled in Louis Vuitton's advertising,[86] and was also named as the face of Lacoste's newest fragrance, Lacoste Challenge.[87] He was featured in RED's Lazarus Effect Campaign, which is intended to increase awareness for its efforts to fight AIDS in Africa.[88][89]\n\nIn 2018 Christensen played in the annual Soccer Aid charity match playing for the World XI team to raise funds for UNICEF.[90]\n\nOn August 15, 2025, Christensen threw out the ceremonial first pitch at a Chicago Cubs game. He walked to the mound wearing a Cubs jersey with the number 66, a nod to “Order 66” from Star Wars.[91]\n\nFilmography\n\nFilm\n\nTelevision\n\nAwards and nominations\n\nReferences\n\nCitations\n\nPrint sources", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Maple_Leaf_%28from_roundel%29.svg/40px-Maple_Leaf_%28from_roundel%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/BilsonChristensenNov06.jpg/250px-BilsonChristensenNov06.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Hayden_Christensen_-_GalaxyCon_Columbus_2024_%28A20929%29.jpg/863px-Hayden_Christensen_-_GalaxyCon_Columbus_2024_%28A20929%29.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Hayden-cfda2010-0004%281%29_%28cropped%29.jpg/250px-Hayden-cfda2010-0004%281%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Dragon-149393.svg/40px-Dragon-149393.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/40px-Video-x-generic.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Hayden_Christensen_-_GalaxyCon_Columbus_2024_%28A20929%29.jpg/250px-Hayden_Christensen_-_GalaxyCon_Columbus_2024_%28A20929%29.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/Hayden_Christensen_05-2005.jpg/250px-Hayden_Christensen_05-2005.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Hayden_Christensen_-_GalaxyCon_Columbus_2024_%28A20929%29.jpg/863px-Hayden_Christensen_-_GalaxyCon_Columbus_2024_%28A20929%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Hayden_Christensen", "title": "Hayden Christensen", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Hayden_Christensen_-_GalaxyCon_Columbus_2024_%28A20929%29.jpg/863px-Hayden_Christensen_-_GalaxyCon_Columbus_2024_%28A20929%29.jpg", "width": 863, "height": 1200}, "title": "Hayden Christensen - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}