{"url": "https://www.nydailynews.com/sports/more-sports/tiger-woods-professional-wake-dui-article-1.3260743", "text": "Tiger Woods announced Monday via Twitter that he’s getting professional help in the wake of his DUI arrest in May.\n\nThe golf great was found asleep at the wheel of his vehicle in Jupiter, Fla., on May 29. He was incoherent, but no alcohol was found in his system.\n\nWoods, who has undergone four back surgeries since 2014, told the arresting officers he had an adverse reaction to a mix of prescription drugs, which included Vicodin and Xanax.\n\nThe 14-time major champion tweeted that he’s dealing with a problem with prescription drugs.\n\n“I’m currently receiving professional help to manage my medications and the ways that I deal with back pain and a sleep disorder,” Woods said on social media. “I want to thank everyone for the amazing outpouring of support and understanding especially the fans and players on tour.”\n\nWoods, 41, is scheduled to be arraigned on the DUI charge on Aug. 9. He could qualify for a diversion program in which the DUI charge is downgraded to reckless driving, which results in probation, fine and other conditions such as taking a DUI course.\n\nAfter spending the night in jail, Woods quickly announced alcohol was not an issue, but rather a misuse of medications.\n\n“I want the public to know that alcohol was not involved,” Woods wrote. “What happened was an unexpected reaction to prescribed medications. I didn’t realize the mix of medications affected me so strongly.”\n\nAfter missing 15 months, including the entire 2016 season, Woods attempted to return to professional golf last December.\n\nHis comeback lasted three tournaments before he was sidelined again with back problems, prompting the fourth surgery.\n\nJust days before the arrest, Woods wrote on his website that he was feeling much better and pain free.\n\n“It has been just over a month since I underwent fusion surgery on my back, and it is hard to express how much better I feel,” he wrote. “It was instant nerve relief. I haven’t felt this good in years.”\n\nHe vowed he would return to the PGA Tour.\n\nThis isn’t the first time Woods has sought professional help.\n\nHe was treated for sex addiction in 2009 after his wife, Elin Nordegren, and the entire world discovered he had been carrying on several extramarital affairs.\n\nWoods following his DUI arrest in May.\n\nWoods and Nordegren divorced in 2010, and his career hasn’t been the same since.\n\nWoods once seemed like a lock to surpass Jack Nicklaus’ record of 18 major championships. He raced to 14 major wins, but has been stuck there since he won the 2008 U.S. Open.\n\nBack problems have limited Woods to just 19 tournaments since 2014.\n\nWoods’ most recent surgery was in April, and he seemed upbeat about his recovery.\n\n“The surgery went well, and I’m optimistic this will relieve my back spasms and pain” Woods said. “When healed, I look forward to getting back to a normal life, playing with my kids, competing in professional golf and living without the pain I have been battling so long.”\n\nThe recovery period was supposed to be six months.\n\nIt’s unknown how long Woods will undergo treatment, and when he might return to golf.\n\n– With The Associated Press", "images": ["data:image/webp;base64,UklGRiQAAABXRUJQVlA4IBgAAAAwAQCdASoBAAEAAwA0JaQAA3AA/v3AgAA=", "https://www.nydailynews.com/wp-content/uploads/migration/2017/06/20/REVS6OQDEZVPBV76FKVFUVCJFQ.jpg?w=1024&h=670", "https://secure.gravatar.com/avatar/?s=85&d=mm&r=g", "https://www.nydailynews.com/wp-content/uploads/2023/08/New_York_Daily_News_nydredblack-1.svg"], "top_img": "https://www.nydailynews.com/wp-content/uploads/migration/2017/06/20/REVS6OQDEZVPBV76FKVFUVCJFQ.jpg?w=1024&h=670", "keywords": [], "authors": ["Tom Biersdorfer"], "canonical_link": "https://www.nydailynews.com/2017/06/19/tiger-woods-says-he-is-getting-professional-help-in-wake-of-dui-arrest/", "title": "Tiger Woods says he is getting ‘professional help’ in wake of DUI arrest", "meta_data": {"application-name": "newyorkdailynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "robots": "max-image-preview:large", "tdm-reservation": 1, "mrf": {"authors": "Tom Biersdorfer", "canonical": "https://www.nydailynews.com/2017/06/19/tiger-woods-says-he-is-getting-professional-help-in-wake-of-dui-arrest/"}, "description": "Tiger Woods announced Monday via Twitter that he’s getting professional help in the wake of his DUI arrest in May.", "generator": "WordPress 6.8.3", "og": {"type": "article", "title": "Tiger Woods says he is getting ‘professional help’ in wake of DUI arrest", "url": "https://www.nydailynews.com/2017/06/19/tiger-woods-says-he-is-getting-professional-help-in-wake-of-dui-arrest/", "description": "Tiger Woods announced Monday via Twitter that he’s getting professional help in the wake of his DUI arrest in May. The golf great was found asleep at the wheel of his vehicle in Jupiter, Fla.…", "site_name": "New York Daily News", "image": {"identifier": "https://www.nydailynews.com/wp-content/uploads/migration/2017/06/20/REVS6OQDEZVPBV76FKVFUVCJFQ.jpg?w=1024&h=670", "width": 1024, "height": 670}, "locale": "en_US"}, "article": {"published_time": "2017-06-19T20:18:21+00:00", "modified_time": "2018-04-08T00:27:52+00:00"}, "twitter": {"text": {"title": "Tiger Woods says he is getting ‘professional help’ in wake of DUI arrest"}, "image": "https://www.nydailynews.com/wp-content/uploads/migration/2017/06/20/REVS6OQDEZVPBV76FKVFUVCJFQ.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.nydailynews.com/wp-content/uploads/2023/09/cropped-DailyNewsCamera-7.webp?w=270"}, "movies": [], "publish_date": 1497903501.0, "source": "https://www.nydailynews.com", "summary": ""}