{"url": "https://www.elle.com/culture/movies-tv/news/a47020/princess-diaries-3-release-date-casting-news/", "text": "Every item on this page was chosen by an ELLE editor. We may earn commission on some of the items you choose to buy.\n\n7 min read\n\nIt’s hard to believe that arrived way back in August 2004. While the past 20 years have just flown by, fans of the real-life fairytale franchise have never given up hope for a third Princess Diaries movie. In 2025, The Hollywood Reporter revealed in October 2024, the project will finally be filming.\n\n\n\nIn recent years, traction on a trilogy-making sequel has stalled—but has not stopped completely. Anne Hathaway, who played plucked-from-obscurity princess Mia Thermopolis, previously confirmed a script exists, and while she claimed to be on board for the film alongside co-star Julie Andrews as Queen Clarisse, there hadn’t been many updates since. Then Disney officially greenlit a new installment in November 2022.\n\nAs The Princess Diaries taught us, miracles happen once in a while if you believe. Ahead, everything we know about the status of Princess Diaries 3, including Chris Pine’s involvement, Mandy Moore’s surprising character theories, and the latest update Hathaway offered in April 2024.\n\nDisney signed on for a Princess Diaries 3 in 2022.\n\nDisney has signed on for a third installment, The Hollywood Reporter announced on Nov. 15, 2022. TV writer Aadrita Mukerji (Reacher, Supergirl) is penning the script. The film will be a continuation of the Princess Diaries story rather than a reboot.\n\nAnne Hathaway’s involvement is not yet confirmed, but “the hope is she would return should the potential new film move forward beyond the script stage,” per THR. She has vocally supported the idea of a third Princess Diaries film, telling Entertainment Tonight in October, “I would more than entertain it, I’m pulling for it. If there’s any way to get Julie Andrews involved, I think we would make it work. We would go to where she was and put a green screen behind her and just make it happen.”\n\nDebra Martin Chase, who produced the first two films, will produce the new installment and Melissa Stack (The Other Woman) will executive produce.\n\nJoy Ride’s Adele Lim is now set to direct the film.\n\nThe Princess Diaries 3 finally has a director. The Hollywood Reporter shared on October 4 that Lim has been hired to helm the project. Hathaway is expected to return, the outlet added, and Disney hopes to film the movie in 2025.\n\nLim shared a statement to the outlet about her appointment: “As a diehard fan of the original Princess Diaries, I’m beyond excited to be a part of bringing the third iteration of this beloved franchise to life. We look forward to celebrating its core tenants of female power, joy and mentorship with audiences worldwide.”\n\nThe film’s status has been up in the air.\n\nOn March 14, 2024, Julie Andrews admitted that she believes plans for the third film have been scrapped.\n\n“Ah, I have been asked that so many times,” she told Today after being asked if there will be a Princess Diaries 3.\n\n“There was dialogue about it,” she continued, adding that “nothing had been realized. And I think I may be wrong, but I think it’s been shelved now. I can’t be sure.”\n\nThat said, Andrews also stated that she’s “sure there will be another version on another day.”\n\nAfter pausing for a moment, she said, “It’s quite a long time now since the two Diaries were done, and I’m not sure, but sometimes it’s best to leave a good thing alone. I don’t like it when people milk and milk and milk the subject, you know, ’til it’s dead.”\n\nShe is still interested in reprising her role as Queen Clarisse though. “I’d be very happy if we did do another one, but I don’t expect to,” Andrews finished.\n\nHathaway offered encouraging news about the project in April 2024.\n\nHathaway told V magazine in late April that The Princess Diaries 3 remains in the works. “We’re in a good place. That’s all I can say,” she teased. “There’s nothing to announce yet. But we’re in a good place.”\n\nShe confirmed her participation in October 2024.\n\nOn Oct. 4, Hathaway shared a screenshot of the film announcement then some clips of herself from the film with Julie Andrews, before blowing a kiss at the camera and saying, “Shut up!”\n\n“Miracles happen,”she captioned the video. “Back to Genovia with @adeleblim @disney @somewherepictures. The fairy tale continues.”\n\nThe film has been discussed for years.\n\nQueen Andrews herself gave an update in 2020. During a virtual interview with The Talk in April, the Oscar winner managed to both inspire optimism and cast doubt when it comes to PD3. “I heard that there might be one,” she revealed. “It’s long been talked about but nothing sort of been on my desk or anything like that. I think I would [do it]. I’m getting awfully old and crotchety. I’m not sure if it’s the right timing, but I think to work with Annie [Anne Hathaway, who played Princess Mia] would be lovely again, and sure I’d be up for it. I think we should wait for—if a script comes in, let’s wait for that. Of course, we wouldn’t have the wonderful Gary Marshall who was the director. He’s passed. And he was really the nuts and bolts of it all.”\n\nHathaway was asked about the status of the project during her January 2019 appearance on Watch What Happens Live. She wants it to happen. Julie Andrews wants it to happen. They’re working on it, she confirmed. “There is a script for the third movie.... There is a script,” she said. “I want to do it. Julie [Andrews] wants to do it. Debra Martin Chase, our producer, wants to do it. We all really want it to happen. It’s just we don’t want to unless it’s perfect, because we love it just as much as you guys love it. It’s as important to us as it is to you, and we don’t want to deliver anything until it’s ready, but we’re working on it, so...”\n\nPrior to Hathaway confirming there was a script, the author of The Princess Diaries book series, Meg Cabot, told Entertainment Weekly in 2017 that a script exists. She also said that if the movie gets made, it’ll happen “kind of as a tribute” to director Garry Marshall, who passed away in 2016. But Cabot refused to reveal any further details, apart from saying that the movies would likely deviate from the book series. She said, “I think of them as two different universes.”\n\nA potential plot was pointed to in August 2025.\n\nOn August 21, Adele Lim posted an open casting call for the role of Olivia, seeming to confirm that the newest installation will follow the events of Cabot’s 2015 book, The Princess Diaries, Volume XI: Royal Wedding.\n\nDisney looking for a 15-year-old girl to play Olivia Robinson: “Smart, sarcastic, armored, and observant, Olivia Robinson wants to be left alone. After her mother passed away, she withdrew into herself, masking her sadness with caustic wit. But under her prickly exterior, Olivia’s natural warmth, compassion and courage to stand up to power is exactly what makes her a natural born leader The only thing standing in the way is herself.”\n\nIn the book, Olivia is the half-sister of Mia Thermopolis from a secret relationship of her dad, Phillipe. Mia finds Olivia after her mother has passed away and fights for custody after discovering she is being mistreated by extended family members. There might be deviations from the book’s plot, but it’s clear they intend for Olivia to be a central character in the story.\n\nGarry Marshall was reportedly planning the third installment before he died.\n\nSpeaking of Marshall, the filmmaker was also passionate about a third movie about Princess Mia. In an interview with People in March 2016, Marshall said, “I was with Anne Hathaway a couple weeks ago. It looks like we want to do The Princess Diaries 3 in Manhattan.” Sadly, Marshall’s plan never came to fruition, but it’s possible that the sequel will still be set in New York to honor his idea.\n\nChris Pine is open to a third movie.\n\nThe actor seemed enthusiastic when asked about reprising his role as the dashing Nicholas Devereaux in 2016. After quite literally sweeping Mia off her feet at the end of the 2004 sequel, questions remain about the status of Nicholas and Mia’s romance. During a fan Q&A for Entertainment Weekly in 2016, Pine was asked, “Don’t you pray every night for a Princess Diaries 3?” To which he replied, “Have you been reading my diary?”\n\nGiulio Marcocchi // Getty Images Pine and Hathaway in 2004.\n\nMandy Moore would consider a cameo.\n\nIn July 2017, Moore, who played mean-girl cheerleader Lana, told ELLE.com, “If I’m going to be involved, I would be down for a cameo—maybe she could make amends with Mia and apologize for being a bully when she was younger. She was insecure, going through a difficult time in her life and [has now] reflected on why that wasn’t okay.”\n\nMoore also appeared on People Now in February 2019 and was asked what she would like to see for her character Lana. The actress had a pretty fleshed out answer: “I would like to see if life kicked down a few pegs because she was the bully in school [if she comes back]. I’d like to see her is life has come full circle and maybe she’s a little more well humble. I would be down!”\n\n©Walt Disney Co./Courtesy Everett Collection // Everett\n\nPrincess Mia’s best friend Lilly Moscovitz would come back.\n\nIn July 2016, Heather Matarazzo, who played Princess Mia’s best friend Lilly Moscovitz, told Cosmopolitan that she would definitely return for another sequel. She said, “If Annie and Julie are down, of course.”\n\nThe fans are ready for a royal return.\n\nIf you had concerns about the fanbase returning for a third movie, allow X, formerly known as Twitter’s, evergreen excitement to ease your mind.\n\nAs we await the official release, there’s plenty of time to rewatch the first two movies, and reflect on Sandra Oh’s Oscar-worthy turn as Vice Principal Gupta.\n\nAdditional reporting by Savannah Walsh and Alyssa Bailey", "images": ["https://www.elle.com/_assets/design-tokens/fre/static/icons/envelope-simple-regular.91a0134.svg", "https://hips.hearstapps.com/hmg-prod/images/model-poses-backstage-at-the-luisa-spagnoli-fashion-show-news-photo-1761754991.pjpeg?crop=1.00xw:0.671xh;0,0.0246xh&resize=360:*", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1595443580-9780061479939.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/bookmark-simple-regular.9d9d56b.svg", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523000000&id=social-button-icon", "https://www.elle.com/_assets/design-tokens/fre/static/icons/saved.ad81f1a.svg?primary=%2523000000", "https://hips.hearstapps.com/hmg-prod/images/elm120125wljenniferaniston-002-6908dced2d1a7.jpg?crop=1.00xw:0.752xh;0,0.0517xh&resize=360:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://www.elle.com/_assets/design-tokens/fre/static/icons/clock-regular.b2f2888.svg", "https://hips.hearstapps.com/hmg-prod/images/the-devil-wears-prada-2-teaser-6914bef47c823.jpg?crop=0.417xw:1.00xh;0.474xw,0&resize=360:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523000000&id=social-button-icon", "https://www.elle.com/_assets/design-tokens/elle/static/images/logos/logo.2856426.svg?primary=%2523ffffff", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/taylor-travis-gettyimages-2187494391-691a4ee226049.jpg?crop=0.978xw:1.00xh;0.0128xw,0&resize=360:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/mcdprdi-ec057-1548424577.jpg?crop=0.753xw:0.526xh;0.247xw,0.330xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/mcdprdi-ec056-1548424541.jpg?resize=640:*", "https://www.elle.com/_assets/design-tokens/elle/static/images/logos/logo.2856426.svg?primary=navLogoColor", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/vivian-benitez-and-rufus-sewell-attend-the-awards-ceremony-news-photo-1760123174.pjpeg?crop=1.00xw:0.668xh;0,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/chad-michael-murray-sophia-bush-bethany-joy-lenz-hilarie-news-photo-1725205449.jpg?crop=0.636xw:1.00xh;0.144xw,0&resize=360:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://hips.hearstapps.com/hmg-prod/images/elle-best-books-fall-lead-6914f3eaaaf18.jpg?crop=0.5xw:1xh;center,top&resize=360:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/caret-left-regular.5546078.svg", "https://hips.hearstapps.com/hmg-prod/images/stanley-tucci-and-meryl-streep-are-seen-on-the-set-of-the-news-photo-1754143674.pjpeg?crop=0.652xw:1.00xh;0.165xw,0&resize=360:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg", "https://hips.hearstapps.com/hmg-prod/images/outlander-blood-of-my-blood-episode-4-68a5f0f4c8755.png?crop=0.668xw:1.00xh;0.107xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/msdprdi-ec005-1548424679.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523ffffff&id=social-button-icon", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523000000&id=social-button-icon", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://www.elle.com/_assets/design-tokens/elle/static/images/logos/network-logo.242fea1.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/actor-timothee-chalamet-and-kylie-jenner-sit-court-side-news-photo-1762895644.pjpeg?crop=0.615xw:0.923xh;0.138xw,0.0625xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2073973305-6893bbd312d3a.jpg?crop=1.00xw:0.668xh;0,0.0844xh&resize=360:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/actors-anne-hathaway-and-chris-pine-arrive-at-the-54th-news-photo-1595430212.jpg?crop=1.00xw:0.491xh;0,0.0100xh&resize=980:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523ffffff&id=social-button-icon", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523000000&id=social-button-icon", "https://www.elle.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://www.elle.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://www.elle.com/_assets/design-tokens/fre/static/icons/x-regular.e414d97.svg", "https://www.elle.com/_assets/design-tokens/fre/static/icons/globe-simple-regular.e7f303c.svg", "https://hips.hearstapps.com/vidthumb/manual_upload/59808680e694aa1f65938d5b/thumb_1501595268.png?crop=1xw:1xh;center,top", "https://hips.hearstapps.com/hmg-prod/images/elm120125cover-rr-1-6908d94d83dab.jpg?crop=1.00xw:0.746xh;0,0.0226xh&resize=360:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=currentColor&id=link-out-embed", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523000000&id=social-button-icon", "https://www.elle.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/mcdprdi-ec057-1548424577.jpg?crop=0.753xw:0.526xh;0.247xw,0.330xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.elle.com/culture/movies-tv/news/a47020/princess-diaries-3-release-date-casting-news/", "title": "The Princess Diaries 3 News, Cast, Release Date, and Rumors", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "The Princess Diaries 3 News, Cast, Release Date, and Rumors", "description": "If new reports are to be believed, The Princess Diaries 3 is finally on the way, but will Anne Hathaway and Chris Pine return? Here's what we know so far.", "keywords": "Anne Hathaway, chris pine, mandy moore, meg cabot, julie andrews, princess diaries 3, princess diaries, princess diaries 3 cast, princess diaries 3 date, princess diaries 3 news, princess diaries 3 rumors", "theme-color": "#000000", "og": {"site_name": "ELLE", "title": "What the New ‘Princess Diaries 3’ Cast Listing Reveals About the Plot", "description": "A key character hints at what story the film will tell.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/mcdprdi-ec057-1548424577.jpg?crop=0.753xw:0.526xh;0.247xw,0.330xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.elle.com/culture/movies-tv/news/a47020/princess-diaries-3-release-date-casting-news/", "type": "article"}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "opinion": "false", "section": "Movies & TV", "modified_time": "2025-08-23T16:45:00Z", "published_time": "2025-08-23T16:45:00Z"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "parsely-metadata": "{\"socialHeadline\":\"What the New ‘Princess Diaries 3’ Cast Listing Reveals About the Plot\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/mcdprdi-ec057-1548424577.jpg?crop=0.455xw:0.633xh;0.362xw,0.276xh&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/mcdprdi-ec057-1548424577.jpg?crop=0.753xw:0.526xh;0.247xw,0.330xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/mcdprdi-ec057-1548424577.jpg?crop=0.455xw:0.633xh;0.362xw,0.276xh", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/mcdprdi-ec057-1548424577.jpg?crop=0.753xw:0.526xh;0.247xw,0.330xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "timely", "sailthru.excerpt": "It’s hard to believe that The Princess Diaries 2: Royal Engagement arrived way back in August 2004. While the past 20 years have just flown by, fans of the real-life fairytale franchise have never given up hope for a third Princess Diaries movie. In 2025, The Hollywood Reporter revealed in", "sailthru.tags": "culture,Culture,movies-tv,Movies & TV,ELLE-US", "sailthru.date": "2025-08-23 16:45:00", "sailthru.socialtitle": "What the New ‘Princess Diaries 3’ Cast Listing Reveals About the Plot", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1755967500.0, "source": "https://www.elle.com", "summary": ""}