{"url": "https://www.inquisitr.com/4484553/kylie-jenner-turns-into-monster-on-life-of-kylie-tv-show-cancellation-rumors-soar-as-ratings-fall/", "text": "Based on the latest survey, perhaps the incoming Trump Administration can make these cities pest-free again.\n\nEvery year, lists of the top cities with the most rats and roaches infestation are compiled. While it’s good to be in the top 10 of lists for tourism and industry, city officials try to avoid having this particular distinction by any means necessary.\n\nBased on current data, New Orleans, Louisiana tops the lists of cities with the most critters reported in households: Roaches, rats and mice.\n\nBloomberg compiled data from American households to get a reflection of what cities are plagued with infestations. Because the critters can’t talk — or won’t — government statisticians asked renters and homeowners for the data.\n\nThe science is not exact but is the best tool available to compile a list of cities with pest problems. The numbers and percentages are based on a person’s observation but don’t rule out or confirm exact numbers; some critters are very good at staying hidden.\n\nHey guys, look, New Orleans is #1 at something! #NOLAPRIDE https://t.co/ZK5aeHtxOg — Make Nola Better (@MakeNolaBetter) January 19, 2017\n\nThe reports typically come out every two years and are conducted by the American Housing Survey (or AHS). It targets the 25 largest metropolitan areas around the country (15 largest cities and 10 other towns). Officials ask probing questions about the means of financing the home and neighborhood safety, among other things, and if there is any evidence of cockroaches, mice, rats and other pests.\n\nNew Orleans, a port city with high humidity, is still recovering from the catastrophic damage brought on by Hurricane Katrina in 2005. Not surprisingly, the Big Easy is finding it difficult to control its rampant pest problem.\n\nWhat city is most infested with rats and roaches? https://t.co/48dCk0c28O pic.twitter.com/43ygN6CbmF — Top Health News (@healthnews2017) January 18, 2017\n\nAccording to respondents, in 2015, New Orleans led the nation with the most roaches reported in households. Philadelphia, the City of Brotherly Love, reported the most mice and rats. Sixteen percent of New York households polled reported roach infestation and 15 percent reported having rodents.\n\nThe Big Apple was the only city to be in the double digits among respondents. To illustrate NYC’s problem, the raw numbers break down to 1.1 million homes with roaches and about the same figure for rodents.\n\nHouston and Boston are also high the list of repeat infestations among American cities , according to the Patch with the latter two reporting higher densities of mice and rats. The good news is the two metropolitan areas are on the decline from previous years.\n\nNot only are roaches and rats creepy — and embarrassing, if you have guests over — but also household insects and rodents can be hazardous to your health. Orkin describes the dangers of the American cockroach .\n\n“Cockroaches are filthy pests. They can spread disease, contaminate our food and cause allergies and even asthma. Cockroaches can pick up germs on their legs and bodies as they crawl through decaying matter or sewage and then transfer these germs to food or onto food surfaces. According to the World Health Organization (WHO), they are proven or suspected carriers of the organisms causing diarrhea, dysentery, cholera, leprosy, plague, typhoid fever and viral diseases such as poliomyelitis.”\n\nFor pest control companies, the recent results are a boon to the industry and their bottom lines. If all the rodents and pesky insects vanish, so do jobs.\n\nOfficials say it’s always wise to call a professional if there is evidence of a roach and rat infestation. Some chemicals designed to kill pests are also dangerous to humans. It’s important for consumers to conduct their research to find “kid-friendly” or non-toxic substances that won’t harm your health and the environment.\n\nIs your city among the top 25 for rats and roaches?\n\n[Featured image by Andrey_Popov/shutterstock]", "images": ["https://www.inquisitr.com/wp-content/uploads/2025/10/2421769f-57a4-4bff-913f-cf316747493e.jpg", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20500%20157'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20492%20142'%3E%3C/svg%3E", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo-white.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/inquisitr-logo.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent-Dark-Mode.png", "https://secure.gravatar.com/avatar/589daae80912f15c28e0b5b099133d08?s=120&d=mm&r=g", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20120%20120'%3E%3C/svg%3E"], "top_img": "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "keywords": [], "authors": ["News Writer"], "canonical_link": "https://www.inquisitr.com/news-america-roach-rats-infected-cities", "title": "Is Your Town On The Rats And Roaches Infested And Infected Cities List Of America?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "https://www.inquisitr.com/wp-content/uploads/2024/12/favicon.png", "description": "Based on the latest survey, perhaps the incoming Trump Administration can make these cities pest-free again.", "robots": "follow, index, max-snippet:-1, max-video-preview:-1, max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Is Your Town On The Rats And Roaches Infested And Infected Cities List Of America? - Inquisitr News", "description": "Based on the latest survey, perhaps the incoming Trump Administration can make these cities pest-free again.", "url": "https://www.inquisitr.com/news-america-roach-rats-infected-cities", "site_name": "Inquisitr News"}, "article": {"section": "News", "published_time": "2017-01-20T10:24:00-05:00"}, "twitter": {"card": "summary_large_image", "title": "Is Your Town On The Rats And Roaches Infested And Infected Cities List Of America? - Inquisitr News", "description": "Based on the latest survey, perhaps the incoming Trump Administration can make these cities pest-free again.", "site": "@theinquisitr", "creator": "@theinquisitr"}, "generator": "WP Rocket 3.18.3"}, "movies": [], "publish_date": 1484925840.0, "source": "https://www.inquisitr.com", "summary": ""}