{"url": "en.wikipedia.org/wiki/Julia_Roberts", "text": "American actress (born 1967)\n\nJulia Fiona Roberts (born October 28, 1967)[1] is an American actress. Known for her leading roles across various genres, she has received multiple accolades, including an Academy Award, a British Academy Film Award, and three Golden Globe Awards. She became known for portraying charming and relatable characters in romantic comedies and blockbusters, before expanding into dramas, thrillers, and independent films. The films in which she has starred have collectively grossed over $3.9 billion worldwide, making her one of Hollywood's most bankable stars,[2] while the media nicknamed her \"America's Sweetheart\" in recognition of her widespread popularity and on- and off-screen charisma.\n\nAfter early breakthroughs in Mystic Pizza (1988) and Steel Magnolias (1989), Roberts solidified her status as a leading lady with the romantic comedies Pretty Woman (1990), My Best Friend's Wedding (1997), Notting Hill (1999), and Runaway Bride (1999). Roberts won the Academy Award for Best Actress for her portrayal of the title role in the biographical drama Erin Brockovich (2000). She then starred in films such as Ocean's Eleven (2001), Ocean's Twelve (2004), Charlie Wilson's War (2007), Valentine's Day (2010), Eat Pray Love (2010), August: Osage County (2013), Wonder (2017), Ticket to Paradise (2022), Leave the World Behind (2023), and After the Hunt (2025). On television, she starred as a physician during the AIDS crisis in the HBO film The Normal Heart (2014) for which she earned a Primetime Emmy Award nomination, a social worker in the first season of the streaming series Homecoming (2018), and portrayed Martha Mitchell in the Starz political limited series Gaslit (2022).\n\nRoberts runs the production company Red Om Films, through which she has served as an executive producer for various projects she has starred in, as well as for the first four films of the American Girl franchise (2004–2008). She has acted as the global ambassador for Lancôme since 2009. She was the world's highest-paid actress throughout the majority of the 1990s and the first half of the 2000s.[3][4][5] She received then-unprecedented fees of $20 million and $25 million for her roles in Erin Brockovich (2000) and Mona Lisa Smile (2003), respectively. As of 2020 , Roberts's net worth was estimated to be $250 million.[6] People magazine has named her the most beautiful woman in the world a record five times.[7]\n\nEarly life and family\n\nJulia Fiona Roberts was born on October 28, 1967, at Crawford Long Hospital in Atlanta, Georgia,[8][9][10] to Betty Lou Bredemus and Walter Grady Roberts.[11][12] She is of English, Scottish, Irish, Welsh, German, and Swedish descent.[13][14] Her father was a Baptist, her mother Catholic.[15] Roberts was raised Catholic.[16][17] Her older brother Eric Roberts (b. 1956), from whom she was estranged for several years until 2004, older sister Lisa Roberts Gillan (b. 1965), and niece Emma Roberts, are also actors. She also had a younger half-sister named Nancy Motes.[18]\n\nRoberts's parents, one-time actors and playwrights, met while performing in theatrical productions for the United States Armed Forces. They later co-founded the Atlanta Actors and Writers Workshop[19] off Juniper Street in Midtown Atlanta. They ran a children's acting school in Decatur, Georgia, while they were expecting Julia. The children of Coretta and Martin Luther King Jr. attended the school; Walter Roberts served as acting coach for their daughter, Yolanda.[20] In gratitude for his service running the only racially integrated theater troupe in the region and due to the Roberts's financial difficulties,[21] Coretta King paid the Roberts's hospital bill when Julia was born.[22][23][24]\n\nRoberts's parents married in 1955. Her mother filed for divorce in 1971; the divorce was finalized in early 1972.[25] From 1972, Roberts lived in Smyrna, Georgia, where she attended Fitzhugh Lee Elementary School, Griffin Middle School, and Campbell High School.[9] In 1972, her mother married Michael Motes, who was abusive and often unemployed; Roberts despised him.[26] The couple had a daughter, Nancy, who died at 37 on February 9, 2014, of an apparent drug overdose.[27] The marriage ended in 1983, with Betty Lou divorcing Motes on cruelty grounds; she had stated that marrying him was the biggest mistake of her life.[26] Roberts's own father died of cancer when she was ten.[28]\n\nRoberts wanted to be a veterinarian as a child.[29] She played the clarinet in her school band.[30][31] After graduating from high school, she headed to New York City to pursue a career in acting. Once there, she signed with the Click Modeling Agency and enrolled in acting classes.[32]\n\nCareer\n\nRoberts at the 2025 New York Film Festival for After the Hunt\n\n1987–1999: Acting debut and film stardom\n\nFollowing her first television appearance as a juvenile rape victim in the first season of the series Crime Story, with Dennis Farina, in the episode \"The Survivor\", broadcast on February 13, 1987, Roberts made her big screen debut in the dramedy Satisfaction (1988), alongside Liam Neeson and Justine Bateman, as a band member looking for a summer gig. (She had filmed a small role in 1987 opposite her brother Eric, in Blood Red, though she only had two words of dialogue, and it was not released until 1989.) In 1988, Roberts had a role in the fourth-season finale of Miami Vice and her first critical success with moviegoers came with the independent romantic comedy Mystic Pizza,[33] in which she played a Portuguese-American teenage girl working as a waitress at a pizza parlor. Roger Ebert found Roberts to be a \"major beauty with a fierce energy\" and observed that the film \"may someday become known for the movie stars it showcased back before they became stars. All of the young actors in this movie have genuine gifts\".[34]\n\nIn Steel Magnolias (1989), a film adaptation of Robert Harling's 1987 play of the same name, Roberts starred as a young bride with diabetes, alongside Sally Field, Dolly Parton, Shirley MacLaine and Daryl Hannah. The filmmakers were looking at both Laura Dern and Winona Ryder when the casting director insisted they see Roberts, who was then filming Mystic Pizza.[35] Harling stated: \"She walked into the room and that smile lit everything up and I said 'that's my sister', so she joined the party and she was magnificent\".[35] Director Herbert Ross was notoriously tough on newcomer Roberts, with Sally Field admitting that he \"went after Julia with a vengeance. This was pretty much her first big film\".[35] Nevertheless, the film was a critical and commercial darling when it was released,[36] and Roberts received both her first Academy Award nomination (as Best Supporting Actress) and first Golden Globe Award win (Best Supporting Actress) Motion Picture for her performance.[33]\n\nCatapulting on her 1989 Academy Award nomination, Roberts gained further notice from worldwide audiences when she starred with Richard Gere in the Cinderella–Pygmalionesque story, Pretty Woman, in 1990, playing an assertive freelance hooker with a heart of gold.[33] Roberts won the role after Michelle Pfeiffer, Molly Ringwald, Meg Ryan, Jennifer Jason Leigh, Karen Allen, and Daryl Hannah (her co-star in Steel Magnolias) turned it down.[37] The role also earned her a second Oscar nomination, this time as Best Actress, and second Golden Globe Award win, as Best Actress – Motion Picture (Musical or Comedy).[33] She was paid $300,000 for the part.[38] Pretty Woman saw the highest number of ticket sales in the U.S. ever for a romantic comedy,[39] and made $463.4 million worldwide.[40] The red dress Roberts wore in the film has been considered one of the most famous gowns in cinema.[41][42][43]\n\nHer next film release following Pretty Woman was Joel Schumacher's supernatural thriller Flatliners (also 1990), in which Roberts starred as one of five students conducting clandestine experiments that produce near-death experiences. The production was met with a polarized critical reception, but made a profit at the box office and has since been considered a cult film.[44] In 1991, Roberts played a battered wife attempting to begin a new life in Iowa in the thriller Sleeping with the Enemy, a winged, six-inch-tall tomboyish Tinkerbell in Steven Spielberg's fantasy film Hook and an outgoing yet cautious nurse in her second collaboration with director Joel Schumacher, the romance drama Dying Young. Although negative reviews greeted her 1991 outings, Sleeping with the Enemy grossed $175 million,[45] Hook $300.9 million[46] and Dying Young $82.3 million[47] globally.\n\nRoberts took a two-year hiatus from the screen, during which her only appearance in a film was a cameo in Robert Altman's The Player (1992). In early 1993, she was the subject of a People magazine cover story asking, \"What Happened to Julia Roberts?\".[48] Roberts starred with Denzel Washington in the thriller The Pelican Brief (1993), based on John Grisham's 1992 novel of the same name.[33] In it, she played a young law student who uncovers a conspiracy, putting herself and others in danger. The film was a commercial success, grossing $195.2 million worldwide.[49][50] None of her next film releases —I Love Trouble (1994), Prêt-à-Porter (1994) and Something to Talk About (1995)— were particularly well received by critics nor big box office draws.[51][52][53] In 1996, she guest-starred in the second season of Friends (episode 13, \"The One After the Superbowl\"),[54] and appeared with Liam Neeson in the historical drama Michael Collins,[33] portraying Kitty Kiernan, the fiancée of the assassinated Irish revolutionary leader. Stephen Frears' Mary Reilly, her other 1996 film, was a critical and commercial failure.[55][56]\n\nBy the late 1990s, Roberts enjoyed renewed success in the romantic comedy genre. In P. J. Hogan's My Best Friend's Wedding (1997), she starred opposite Dermot Mulroney, Cameron Diaz and Rupert Everett, as a food critic who realizes she's in love with her best friend and tries to win him back after he decides to marry someone else. Roberts' performance was highly praised.[57] Considered to be one of the best romantic comedies of all time, Rotten Tomatoes gave the film an approval rating of 73% based on 59 reviews, with the critical consensus reading, \"Thanks to a charming performance from Julia Roberts and a subversive spin on the genre, My Best Friend's Wedding is a refreshingly entertaining romantic comedy.\"[58][59][60] The film was a global box-office hit, earning $299.3 million.[61] In her next film, Richard Donner's political thriller Conspiracy Theory (1997), Roberts starred with Mel Gibson as a Justice Department attorney. Mick LaSalle of San Francisco Chronicle stated: \"When all else fails, there are still the stars to look at—Roberts, who actually manages to do some fine acting, and Gibson, whose likability must be a sturdy thing indeed.\"[62] The film, nevertheless, grossed a respectable $137 million.[63] In 1998, Roberts appeared on the television series Sesame Street opposite the character Elmo, and starred in the drama Stepmom, alongside Susan Sarandon,[64] revolving around the complicated relationship between a terminally-ill mother and the future stepmother of her children. While reviews were mixed-to-positive,[64] the film made $159.7 million worldwide.[65]\n\nRoberts paired with Hugh Grant for Notting Hill (1999), portraying a famous actress who falls in love with a struggling book store owner. The film displaced Four Weddings and a Funeral as the biggest British hit in the history of cinema, with earnings equalling $363 million worldwide.[66] An exemplar of modern romantic comedies in mainstream culture, the film was also received well by critics. CNN reviewer Paul Clinton called Roberts \"the queen of the romantic comedy [whose] reign continues\", and remarked: \"Notting Hill stands alone as another funny and heartwarming story about love against all odds.\"[67] In 1999, she also reunited with Richard Gere and Garry Marshall for Runaway Bride, in which she played a woman who has left a string of fiancés at the altar. Despite mixed reviews,[68][69][70][71] Runaway Bride was another financial success, grossing $309.4 million around the globe.[72] Roberts was a guest star in \"Empire\", a Season 9 episode of the television series Law & Order, with regular cast member Benjamin Bratt, who at the time, was her boyfriend. Her performance earned her a nomination for Primetime Emmy Award for Outstanding Guest Actress in a Drama Series.[73]\n\n2000–2013: Critical acclaim and leading roles\n\nRoberts became the first actress to be paid $20 million for a film,[74] when she took on the role of real-life environmental activist Erin Brockovich in her fight against the Pacific Gas and Electric Company (PG&E) of California, in Erin Brockovich (2000). Peter Travers of Rolling Stone wrote, \"Roberts shows the emotional toll on Erin as she tries to stay responsible to her children and to a job that has provided her with a first taste of self-esteem\",[75] while Entertainment Weekly critic Owen Gleiberman felt that it was a \"delight to watch Roberts, with her flirtatious sparkle and undertow of melancholy\".[76] Erin Brockovich made $256.3 million worldwide,[77] and earned Roberts the Academy Award for Best Actress, among numerous other accolades. In 2000, she also became the first actress to make The Hollywood Reporter's list of the 50 most influential women in show business since the list had begun in 1992,[3] and her Shoelace Productions company received a deal with Joe Roth.[78]\n\nHer first film following Erin Brockovich was the road gangster comedy The Mexican (2001), giving her a chance to work with long-time friend Brad Pitt. The film's script was originally intended to be filmed as an independent production without major motion picture stars, but Roberts and Pitt, who had for some time been looking for a project they could do together, learned about it and decided to sign on. Though advertised as a typical romantic comedy star vehicle, the film does not focus solely on the actors' relationship and the two shared relatively little screen time together. The Mexican earned $66.8 million in North America. In Joe Roth's romantic comedy America's Sweethearts (2001), Roberts starred as the once-overweight sister and assistant of a Hollywood actress, along with Billy Crystal, John Cusack, and Catherine Zeta-Jones. Critics felt that despite its famous cast, the production lacked \"sympathetic characters\" and was \"only funny in spurts.\"[79] A commercial success, it grossed over $138 million worldwide, however.[80] In her last film released in 2001, Roberts teamed with Erin Brockovich director Steven Soderbergh for Ocean's Eleven, a remake of the 1960 film of the same name, featuring an ensemble cast including George Clooney, Brad Pitt, and Matt Damon. Roberts played Tess Ocean, the ex-wife of leader Danny Ocean (Clooney), originally played by Angie Dickinson. A success with critics and at the box office alike, Ocean's Eleven became the fifth highest-grossing film of the year with a total of $450 million worldwide.[81]\n\nRoberts in 2002\n\nRoberts received a record $25 million, the highest ever earned by an actress at that time, to portray a forward-thinking art history professor at Wellesley College in 1953, in Mike Newell's drama Mona Lisa Smile.[82] The film garnered largely lukewarm reviews by critics, who found it \"predictable and safe\", but made over $141 million in theaters.[83] In 2004, Roberts replaced Cate Blanchett in the role of an American photographer for Mike Nichols's film Closer, a romantic drama written by Patrick Marber, based on his 1997 play of the same name,[84] co-starring Jude Law, Natalie Portman and Clive Owen.[84] She next reprised the role of Tess Ocean in Ocean's Twelve, which was deliberately much more unconventional than the first film, epitomized by a sequence in which Roberts's character impersonates the real-life Julia Roberts, due to what the film's characters believe is their strong resemblance.[85] Though less well reviewed than Eleven, the film became another major success at the box office, with a gross of $363 million worldwide.[86][87] In 2005, she was featured in the music video for the single \"Dreamgirl\" by the Dave Matthews Band. It was her first music video appearance.[88] Roberts appeared in The Hollywood Reporter's list of the 10 highest-paid actresses every year from 2002 (when the magazine began compiling its list) to 2005.[5]\n\nIn 2006, Roberts voiced a nurse ant in The Ant Bully and a barn spider in Charlotte's Web.[89][90] She made her Broadway debut on April 19, 2006, as Nan in a revival of Richard Greenberg's 1997 play Three Days of Rain opposite Bradley Cooper and Paul Rudd. Although the play grossed nearly $1 million in ticket sales during its first week[91] and was a commercial success throughout its limited run, her performance drew criticism. Ben Brantley of The New York Times described Roberts as being fraught with \"self-consciousness (especially in the first act) [and] only glancingly acquainted with the two characters she plays.\"[92] Brantley also criticized the overall production, writing that \"it's almost impossible to discern its artistic virtues from this wooden and splintered interpretation, directed by Joe Mantello.\"[92] Writing in the New York Post, Clive Barnes declared, \"Hated the play. To be sadly honest, even hated her. At least I liked the rain—even if three days of it can seem an eternity.\"[93] In Mike Nichols' biographical drama Charlie Wilson's War (2007), Roberts starred as socialite Joanne Herring, the love interest of Democratic Texas Congressman Charles Wilson, opposite Tom Hanks and Philip Seymour Hoffman. The film received considerable acclaim,[94] made $119.5 million worldwide,[95] and earned Roberts her sixth Golden Globe nomination.[96]\n\nThe independent drama Fireflies in the Garden, in which Roberts played a mother whose death sets the story in motion, was screened at the 2008 Berlin International Film Festival before being shown in European cinemas—it did not get a North American release until 2011. Roberts played a CIA agent collaborating with another spy to carry out a complicated con, opposite Clive Owen, in the comic thriller Duplicity (2009).[97] Despite mixed reviews and moderate box office returns,[98] critic A. O. Scott praised her performance: \"Ms. Roberts has almost entirely left behind the coltish, America's-sweetheart mannerisms, except when she uses them strategically, to disarm or confuse. [...] She is, at 41, unmistakably in her prime\".[99] She received her seventh Golden Globe nomination for her role.\n\nRoberts at the French premiere of Eat Pray Love in 2010\n\nIn 2010, Roberts played a U.S. Army captain on a one-day leave, as part of a large ensemble cast, in the romantic comedy Valentine's Day, and starred as an author finding herself following a divorce in the film adaptation of Eat Pray Love. While she received $3 million up front against 3 percent of the gross for her six-minute role in Valentine's Day,[100] Eat Pray Love had the highest debut at the box office for Roberts in a top-billed role since America's Sweethearts.[101][102] She appeared as the teacher of a middle-aged man returning to education in the romantic comedy Larry Crowne, opposite Tom Hanks, who also served as the director.[103] The film was poorly received by critics and audiences,[104] although Roberts's comedic performance was praised.[105] In Mirror Mirror (2012), the Tarsem Singh adaptation of Snow White, Roberts portrayed Queen Clementianna, Snow White's evil stepmother, opposite Lily Collins.[106] Peter Travers of Rolling Stone felt that she tried \"way too hard\" in her role,[107] while Katey Rich of Cinema Blend observed that she \"takes relish in her wicked [portrayal] but could have gone even further with it\".[108] Mirror Mirror made $183 million globally.\n\nIn 2013, Roberts starred alongside Meryl Streep and Ewan McGregor in the black comedy drama August: Osage County, about a dysfunctional family that re-unites into the familial house when their patriarch suddenly disappears.[109] Her performance earned her nominations for the Golden Globe Award, Screen Actors Guild Award, Critics' Choice Award, and Academy Award for Best Supporting Actress, amongst other accolades.[110][111][112][113] It was her fourth Academy Award nomination.[114]\n\n2014–present: Television roles and film resurgence\n\nIn 2014, Roberts starred as Dr. Emma Brookner, a character based on Dr. Linda Laubenstein,[115][116] in the television adaptation of Larry Kramer's AIDS-era play, The Normal Heart, which aired on HBO; the film was critically acclaimed and Vanity Fair, in its review, wrote: \"Roberts, meanwhile, hums with righteous, Erin Brokovich-ian anger. Between this and August: Osage County, she's carving out a nice new niche for herself, playing brittle women who show their love and concern through explosive temper\".[117] Her role garnered her a nomination for the Primetime Emmy Award for Outstanding Supporting Actress in a Miniseries or a Movie.[118]\n\nRoberts narrated \"Women in Hollywood\", an episode of the second season of Makers: Women Who Make America, in 2014,[119] and appeared in Givenchy's spring–summer campaign in 2015.[120][121] She starred as a grieving mother opposite Nicole Kidman and Chiwetel Ejiofor in Secret in Their Eyes (2015), a remake of the 2009 Argentine film of the same name, both based on the novel La pregunta de sus ojos by author Eduardo Sacheri.[122] Unlike the original film, the American version received negative reviews and failed to find an audience.[123] Donald Clarke of Irish Times concluded that a \"sound job\" by the cast \"can't quite shake the whiff of compromise that hangs around the project\".[124] In 2016, Roberts reunited with Garry Marshall and reportedly received a $3 million fee for a four-day shoot, playing an accomplished author who gave her child for adoption, in the romantic comedy Mother's Day, which had a lackluster critical and commercial response.[125] Her next film release was Jodie Foster's thriller Money Monster, in which she starred as a television director, alongside George Clooney and Jack O'Connell.[126] Sandra Hall of The Sydney Morning Herald stated: \"It may be Hollywood melodrama but it's top of the range, giving Clooney and Roberts every opportunity to demonstrate the value of star power.\"[127] The film made a respectable $93.3 million worldwide.[128][129]\n\nIn Wonder (2017), the film adaptation of the 2012 novel of the same name by R. J. Palacio, Roberts played the mother of a boy with Treacher Collins syndrome.[130] The Times felt that she \"lifts every one of her scenes in Wonder to near-sublime places\".[131][132] With a worldwide gross of $305.9 million, Wonder emerged as one of Roberts's most widely seen films.[133] In 2017, she also voiced a motherly Smurf leader in the animated film Smurfs: The Lost Village.[134]\n\nRoberts portrayed the mother of a troubled young man in Peter Hedges's drama Ben Is Back (2018). Shaun Kitchener of Daily Express remarked: \"Roberts is often the best, or one of the best, things about any film she's in —and Ben Is Back is no different\".[135] The role of a caseworker at a secret government facility, in the first season of the psychological thriller series Homecoming, was Roberts's first regular television project.[136] The series, which premiered on Amazon Video in November 2018, garnered acclaim from critics, who concluded it was an \"impressive small-screen debut\" for Roberts that \"balances its haunting mystery with a frenetic sensibility that grips and doesn't let go.\"[137][138] She received a Golden Globe nomination for Best Actress in a Television Series – Drama.[139]\n\nRoberts reunited with George Clooney for the romantic comedy Ticket to Paradise, which was released by Universal Pictures on October 21, 2022.[140] She also played Martha Mitchell, a controversial figure throughout the Watergate scandal, in the political thriller television series Gaslit, based on the first season of the podcast Slow Burn by Leon Neyfakh. Roberts also starred as Amanda Sandford in the 2023 film Leave the World Behind, appearing alongside Ethan Hawke and Mahershala Ali. The movie is an adaptation of the novel of the same name by Rumaan Alam. The film is produced by Barack and Michelle Obama's company, Higher Ground Productions.[141] In 2024, Roberts and Riley Keough would narrate the audiobook version of Lisa Marie Presley's memoir From Here to the Great Unknown.[142][143][144]\n\nOther ventures\n\nPhilanthropy\n\nRoberts has contributed to UNICEF as well as other charitable organizations. Her six-day visit to Port-au-Prince, Haiti in 1995, as she said, \"to educate myself\",[145][146] was expected to trigger an outburst of donations —$10 million in aid was sought at the time— by UNICEF officials.[145][146] In 2006, she became a spokeswoman for Earth Biofuels as well as chair of the company's newly formed advisory board promoting the use of renewable fuels.[147] In 2013, she was part of a Gucci campaign, \"Chime for Change\", that aims to spread female empowerment.[148]\n\nIn 2000, Roberts narrated a documentary about Rett syndrome, a neurodevelopmental disorder,[149] designed to help raise public awareness about the disease, and in 2014, she was the voice of Mother Nature in a short film for the Conservation International campaign Nature Is Speaking, intended to raise awareness about climate change.[150]\n\nProduction company\n\nRoberts runs the production company Red Om Films (Red Om is \"Moder\" spelled backwards, after her husband's last name[151]) with her sister, Lisa Roberts Gillan, and Marisa Yeres Gill.[152] Through Red Om, Roberts has served as an executive producer for various projects she has starred in such as Eat Pray Love and Homecoming, as well as for the first four films of the American Girl film series (based on the American Girl line of dolls), released between 2004 and 2008.\n\nEndorsements\n\nIn 2006, Roberts signed an endorsement deal with fashion label Gianfranco Ferre, valued at $6 million. She was photographed by Mario Testino in Los Angeles for the brand's advertising campaign, which was distributed in Europe, Asia and Australia.[153] Since 2009, Roberts has acted as Lancôme's global ambassador, a role in which she has been involved in the development and promotion of the brand's range of cosmetics and beauty products.[154] She initially signed a five-year extension with the company for $50 million in 2010.[155] Roberts starred as the global face of Chopard's Happy Sport and Happy Diamonds collections campaigns since 2021 and then Chopard had announced her as its Global Brand Ambassador in 2023.[156]\n\nRoberts endorsed President Joe Biden for re-election in 2024 and has been involved in related fundraising, even though Biden ended his re-election campaign on July 21, 2024.[157][158]\n\nArtistry\n\nActing style and reception\n\nThroughout her career, Roberts has frequently been referred to as \"America's sweetheart\" by the media,[159][160][161] a label that Vogue writer Noor Brara linked to her portrayals of characters that embody elements of the trope.[162] BBC News Online attributed her early popularity to her roles as relatable, girl-next-door characters,[159] often portraying vulnerable working-class women.[163] Geoffrey Macnab of The Independent noted that during her peak, Roberts' appeal stemmed from her ability to blend the glamour of classic Hollywood stars with an approachable, down-to-earth quality.[164] While romantic comedies cemented her status as an international star, Erin Brockovich is often cited as the film that earned her broader critical recognition as an actress.[159][165][166] Film critic David Edelstein observed that while Roberts is widely acknowledged as a movie star, critics and cinephiles have debated the extent of her acting abilities, sometimes discussing her work with a degree of skepticism.[163][166] In 2012, HuffPost writer Mike Ryan suggested that her career has relied more on her star power than on widespread acclaim for her acting, noting that she is not often included in discussions of the industry's most celebrated actresses.[167]\n\nSome critics have pointed out that Roberts has frequently played characters with traits similar to her own,[166][168] contributing to a screen presence that journalist and filmmaker Bilge Ebiri described as difficult to separate from her public persona.[169] John Anderson of The Seattle Times described her as \"an actress who has never really been required to act\".[168] Matt Singer of The Dissolve said \"Roberts has rarely strayed far from the onscreen persona that made her one of the biggest movie stars in history—that of a simple girl of limited means and unlimited heart, pulling herself up by her bootstraps\".[166] Attempts to divert from this image in the 1990s met with mixed responses,[169] though Macnab noted her versatility in transitioning between romantic comedies, thrillers, period dramas, and independent films.[164] Jihane Bousfiha of Time said that while her grace, warmth, and charisma \"permeates all of her roles\", no genre has highlighted these qualities as effectively as romantic comedies, describing her its \"undisputed queen\".[170] Film critic and historian David Thomson wrote in Salon that he once received letters from upset fans over suggesting that Roberts' talent was being misused in some of her then-recent film roles.[171] Director Mike Nichols, who worked with her on Charlie Wilson's War, argued that her beauty sometimes overshadowed her acting skills, praising her intelligence, preparation, and ability to fully embody her characters.[172] The actress said she does not have any acting techniques, commenting, \"there's nothing more boring than actors sitting around talking about acting\".[173]\n\nSince Eat Pray Love, Roberts has largely moved away from the romantic comedy roles that defined much of her early career, instead gravitating toward more dramatic, character-driven projects, including supporting roles in ensemble films.[174][175] She has attributed this shift to evolving opportunities, personal growth, and the increasing complexity of roles available to her with age.[175] Roberts has cited Frances McDormand, Annette Bening, and Meryl Streep as actresses she admires for balancing successful careers with family life.[172]\n\nPublic image\n\nRoberts has been recognized as one of the defining actors of her generation,[57][176] and among the most influential actresses of the 1990s and early 2000s.[177] During her peak, several publications described her as the world's biggest movie star.[175][178][179][180][181] Ebiri called her \"more than a movie star ... she was an existential fact\" and \"a dominant cultural force\".[169] Reporting on her star power in 1995, The New York Times’ Josh Young described her as a \"rainmaker for women's films\", with the ability to guarantee a film's opening weekend audience and even greenlight a project simply by agreeing to star in it.[182] He also noted that her peers had benefited by accepting roles she had turned down.[182] Roberts’ agent at the time, Elaine Goldsmith, credited her as one of the actresses in the 1990s who helped convince studios that women could lead films as successfully as men.[182] According to Leah Rozen of The New York Times, she remained \"the biggest female box office draw for 20 years\".[172] Roberts has also been recognized as a pioneer in pushing for gender pay equity in Hollywood, negotiating salaries on par with her male counterparts.[162][183] The then-unprecedented $20 million salary she commanded set a new standard for actresses' compensation, according to BBC News Online.[159] She was the highest-paid actress in Hollywood for much of the 1990s and early 2000s.[176] In 2000, Roberts became the first actress to be included on The Hollywood Reporter's list of the 50 most influential women in show business, on which she was ranked the third most powerful woman in entertainment.[3][184] In 2002, she became the first woman to be ranked the most bankable star in Hollywood based on an industry poll by the same publication, tying her with male actors Tom Cruise and Tom Hanks.[185] As her career progressed, journalists began speculating whether her name alone could still guarantee box office success, particularly as some of her later films saw mixed commercial results.[186][164][174][187] By 2017, Roberts stated that she no longer actively pursued roles but instead waited to see what opportunities arose.[175] She has maintained that she is selective about her projects and that her agents never try to persuade her to take on a role.[174][175]\n\nRoberts has stated that she has successfully maintained a clear separation between her personal life and her acting career.[188] Kaufman likened her public image to that of leading a double life, balancing her role as both a mother and one of the most recognizable faces globally.[174] In 2009, a critic for The New Yorker suggested that while Roberts is a skilled actress, her technical abilities might not always match the emotional depth required for audiences to fully connect with her performances, partly due to the distance she maintains in her public persona.[189] For Vulture, The Fug Girls described Roberts' public persona, which they dubbed \"Julianess\", as an overwhelming display of confidence and charm that at times borders on arrogance.[190] Natalie Finn of E! observed that the media constantly compares younger, up-and-coming actresses to Roberts in an attempt to crown a spiritual successor, which Finn declared an unfair comparison.[191] Some journalists have noted reports of Roberts being challenging to work with, citing alleged conflicts with certain directors and co-stars.[192][193] In a 2024 interview with filmmaker Richard Curtis, she finally addressed these rumors, which she attributed to conscious efforts she has made not appear overly friendly on film sets to avoid being taken advantage of and forthright personality, but maintains that she never intends to hurt others.[194] Edelstein observed that early in her career, Roberts was known for being edgy, hypersensitive, and difficult on set, though later profiles have emphasized her efforts to be seen as more down-to-earth.[163]\n\nJournalists and critics have frequently commented on Roberts' physical appearance and sex appeal.[195] However, film critic Patrick Goldstein and celebrity stylist Philip Bloch stated that Roberts never fully embodied the sex symbol role, despite her attractiveness.[195][196] Singer observed that \"For a woman who became famous playing a prostitute, Roberts has maintained a surprisingly asexual onscreen persona\", rarely performing sex scenes.[166] People magazine has named Roberts the \"World's Most Beautiful Woman\" a record-breaking five times, most recently in 2017.[197]\n\nPersonal life\n\nAncestry\n\nOn a 2023 episode of Finding Your Roots, Roberts learned that the surname of her biological paternal great-great-grandfather was actually Mitchell, not Roberts.[198]\n\nRoberts also learned her ancestors owned slaves: \"You have to figure, if you are from the South, you're on one side of it or the other. It just seems very typical of that time, unfortunately. ... You can't turn your back on history, even when you become a part of it in a way that doesn't align with your personal compass.\"[199]\n\nRoberts is a distant cousin of fellow actor Edward Norton.[200]\n\nRelationships and family\n\nRoberts had romantic relationships with actors Jason Patric,[201] Liam Neeson, Kiefer Sutherland, Dylan McDermott and Matthew Perry.[202] She was briefly engaged to Sutherland; they broke up shortly before their scheduled wedding on June 14, 1991.[202] According to Roberts, it had been cancelled long before, not \"days before the wedding\" as the press claimed at the time,[203] and that it was a mutual decision.[201] On June 25, 1993, she married country singer Lyle Lovett; the wedding took place at St. James Lutheran Church in Marion, Indiana.[204] They separated in March 1995 and subsequently divorced.[205] From 1998 to 2001, Roberts dated actor Benjamin Bratt.[206]\n\nRoberts and her husband, cameraman Daniel Moder, met on the set of her film The Mexican in 2000 while she was still dating Bratt. At the time, Moder was married to Vera Steimberg. He filed for divorce a little over a year later, and after it was finalized, he and Roberts wed on July 4, 2002,[207] at her ranch in Taos, New Mexico.[208] Together, they have three children: twins, a daughter and a son, born in November 2004,[209] and another son born in June 2007.[210]\n\nReligious beliefs\n\nIn 2010, Roberts said she was Hindu, having converted for \"spiritual satisfaction\".[211][212] Roberts is a devotee of the guru Neem Karoli Baba (Maharaj-ji), a picture of whom drew Roberts to Hinduism.[213]\n\nIn September 2009, Swami Daram Dev of Ashram Hari Mandir in Pataudi, where Roberts was shooting Eat Pray Love, gave her children new names after Hindu gods: Lakshmi for Hazel, Ganesh for Phinnaeus and Krishna Balram for Henry.[214]\n\nPolitical views\n\nRoberts supported Kamala Harris during the 2024 United States presidential election. She appeared with Harris in a campaign rally in the swing state of Georgia, and also voiced a political advertisement for Harris.[215][216] Donald Trump, who ran against Harris in the election, criticized Roberts for her role in the advertisement.[216]\n\nPersonal habits\n\nRoberts has a preference for going barefoot, including at public events like film festivals, talk shows, and her wedding to Lyle Lovett. Her barefoot habit was incorporated into a number of her movie roles, including Tinker Bell in Hook.[217][218]\n\nActing credits and accolades\n\nRoberts's films that have earned the most at the box office, as of 2021 , include:[219]\n\nRoberts has received four Academy Award nominations, winning for Best Actress at the 73rd Academy Awards, for her titular portrayal in Erin Brockovich, which additionally earned her a Golden Globe, a BAFTA Award and a Screen Actors Guild Award. She won Golden Globe Awards for her performances in Steel Magnolias and Pretty Woman,[220] and as of 2019, has garnered eight nominations. Roberts received two Primetime Emmy Awards nominations, one for Outstanding Guest Actress in a Drama Series, for her guest-role on Law & Order, and the other for Outstanding Supporting Actress in a Limited Series or Television Movie, for her performance in The Normal Heart.[221] On February 28, 2025, Roberts was honored by French Minister of Culture Rachida Dati as a Knight of the Order of Arts and Letters (Chevalier de l'Ordre des Arts et des Lettres) for her significant contribution to world cinema.[222][223]\n\nReferences", "images": ["http://en.wikipedia.org/static/images/icons/wikipedia.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/40px-Wikiquote-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/80/JuliaRoberts90.jpg/250px-JuliaRoberts90.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Julia_Roberts_After_The_Hunt-27.jpg/250px-Julia_Roberts_After_The_Hunt-27.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Julia_Roberts_%2843838880775%29.jpg/250px-Julia_Roberts_%2843838880775%29.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Julia_Roberts_in_May_2002.jpg/190px-Julia_Roberts_in_May_2002.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "http://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Julia_Roberts_2025.jpg/960px-Julia_Roberts_2025.jpg", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Julia_Roberts_2025.jpg/250px-Julia_Roberts_2025.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/d1/Julia_Roberts_2010.jpg/250px-Julia_Roberts_2010.jpg", "http://en.wikipedia.org/static/images/footer/wikimedia.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Julia_Roberts_2025.jpg/960px-Julia_Roberts_2025.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Julia_Roberts", "title": "Julia Roberts", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Julia_Roberts_2025.jpg/960px-Julia_Roberts_2025.jpg", "width": 800, "height": 1200}, "title": "Julia Roberts - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}