{"url": "https://web.archive.org/web/20160206081844/http://www.billboard.com/articles/news/super-bowl/6867098/super-bowl-national-anthem-performances-whitney-beyonce", "text": "Whitney Houston sings the National Anthem during the pregame show at Super Bowl XXV while tens of thousands of football fans wave tiny American flags in an incredible outburst of patriotism during the Persian Gulf War on Jan. 27, 1991.\n\nSince the Super Bowl stands at the pinnacle of American sports, it's no surprise that the nation’s most-high profile competition also boasts an iconic annual music tradition -- the singing of “The Star-Spangled Banner” for an audience in the hundreds of millions.\n\nSince its first inception in 1967, the Super Bowl has offered a spotlight to the national anthem, and in recent decades, the visibility has only increased as, year after year, music superstars take to the mic to deliver America’s sacred song.\n\nWhile over 30 performers have undertaken the roughly two-minute challenge, here are Billboard’s top 10 picks for the best Super Bowl performances of “The Star-Spangled Banner” through 2015:\n\n10. Carrie Underwood - 2010\n\nThere’s certainly enough pressure performing solo at the Super Bowl, but Carrie Underwood upped the ante by electing to sing a cappella in Miami in 2010. The former American Idol champ fills the arena with her booming voice, but sensibly resists the temptation to over sing. Though she falters at the end, major props to the country star for her sound handling of a daunting task.\n\n9. Dixie Chicks – 2003\n\nThe reigning country queens with big personalities turned in a surprisingly modest but remarkable “Star-Spangled Banner” in San Diego, opting for a straightforward approach strengthened with alluring harmonies. The Chicks’ patriotic ode ironically preceded a major political backlash: mere weeks later, lead singer Natalie Maines’ comments about President George W. Bush led to a politically-charged controversy that the Chicks’ career has yet to fully recover from.\n\n8. Faith Hill – 2000\n\nThe country diva seized the mic at the turn of the millennium, and offered one of the cleanest vocal renditions to date. The relatively simple backing band -- compared with some of the massive orchestras in other years -- lets Faith’s voice take center stage, which doesn’t shrink from the challenge. Perhaps the best part, though, is the final flourish: a clenched fist, candid grin and a mouthed “whoo.\" She’s nailed it, and she knows it.\n\n7. Jordin Sparks – 2008\n\nEight months after claiming the sixth American Idol crown, Jordin Sparks performed the anthem in her native Phoenix. Her commanding rendition shows why she won the competition, and is made all the more impressive by the fact that Sparks was only 18 (!) at the time.\n\n6. Luther Vandross - 1997\n\nEverything Luther sang was smooth, and his “Star-Spangled Banner” is no exception. With a velvety, R&B-laced arrangement backing him, Luther cuts out the most suave rendition since Marvin Gaye’s legendary NBA All-Star interpretation in 1983. For those who prefer a little more gusto with their national anthems, Luther raises the stakes at the end, showing his mastery of both vocal purring and power.\n\n5. Kelly Clarkson – 2012\n\nThe pop superstar offered a soul-tinged interpretation on the country’s standard song in Indianapolis, complete with an angelic backing choir. A decade removed since her American Idol coronation, the original Idol proved she still owned the requisite chops to deliver a stirring rendition of the classic.\n\n4. Beyoncé – 2004\n\nIn 2004, NFL organizers offered Beyoncé this choice for a Super Bowl performance in her native Houston: halftime show or national anthem. She elected to fulfill a childhood dream, and chose the anthem - a smart move. Some six months after her debut solo album Dangerously In Love dropped, the soon-to-be Queen Bey proclaimed herself a bonafide solo star. And, to be fair, Beyonce got both eventually: eight years after performing the national anthem, Bey hit the stage for a high-octane halftime show.\n\n3. Choirs of the Armed Forces – 2005\n\nIn a break from the star-studded roster that had honored America for decades, organizers aimed the spotlight on the nation’s military during the 2005 Super Bowl. With choirs from all five branches of the armed forces accompanied by the U.S. Army Herald Trumpets, this poignant version resonates, particularly in the shadow of the escalating conflicts in Afghanistan and Iraq at the time.\n\n2. Jennifer Hudson – 2009\n\nJennifer Hudson sighed heavily as the first notes filled the stadium, and proceeded to blow the crowd away. The Oscar winner’s take -- backed by a lush orchestra -- continually improves on itself, growing from its opening faintness to the final knockout notes courtesy of Hudson’s trademark powerhouse vocals. For viewers at the time, pairing Hudson with the anthem’s lyrics, which champion endurance and resolve, added further significance to the moment: Hudson’s appearance marked her first public engagement since the murders of her mother, brother and 7-year-old nephew the previous October.\n\n1. Whitney Houston – 1991\n\nWho else? Whitney, at the peak of her vocal powers, roared through a rousing rendition in 1991, that has widely been used as the gold standard ever since. Houston’s stentorian take suited the prevalent patriotism of the United States at the height of the Persian Gulf War, so much so that demand led Arista Records to release the recording as a commercial single, and it subsequently burst onto the Billboard Hot 100, ultimately peaking at No. 20. In fact, the performance remained such a pop culture staple that Houston’s interpretation later climbed into the top 10 -- peaking at No. 6 -- following the Sept. 11, 2001 attacks.", "images": ["https://web.archive.org/web/20160206081844im_/http://www.billboard.com/files/media/BB-recirc-620x90-super-bowl-2016.jpg", "https://web.archive.org/web/20160206081844im_/http://www.billboard.com/files/styles/magazine_cover/public/media/kendrick-lamar-cover-bb4-2016-billboard-225.jpg", "https://web.archive.org/web/20160206081844im_/http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://web.archive.org/web/20160206081844im_/http://www.billboard.com/files/styles/top_cover/public/media/kendrick-lamar-cover-bb4-2016-billboard-225.jpg", "https://web.archive.org/web/20160206081844im_/http://www.billboard.com/files/styles/article_main_image/public/media/Whitney-Houston-superbowl-1991-billboard-650.jpg", "https://web.archive.org/web/20160206081844im_/http://www.billboard.com/static/frontend/2016_02_04_1902/assets/images/favicon.ico"], "top_img": "https://web.archive.org/web/20160206081844im_/http://www.billboard.com/static/frontend/2016_02_04_1902/assets/images/favicon.ico", "keywords": [], "authors": ["Trevor Anderson"], "canonical_link": "https://web.archive.org/web/20160206081844/http://www.billboard.com/articles/news/super-bowl/6867098/super-bowl-national-anthem-performances-whitney-beyonce", "title": "Top 10 Super Bowl National Anthem Performances", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "Ahead of Super Bowl 50, Billboard counts down the 10 best Super Bowl national anthem renditions to date.", "twitter": {"card": "summary", "site": "@billboard", "title": "Top 10 Super Bowl National Anthem Performances | Billboard", "description": "Ahead of Super Bowl 50, Billboard counts down the 10 best Super Bowl national anthem renditions to date.", "creator": "@Billboard"}, "og": {"title": "Top 10 Super Bowl National Anthem Performances | Billboard", "type": "article", "url": "https://web.archive.org/web/20160206081844/http://www.billboard.com/articles/news/super-bowl/6867098/super-bowl-national-anthem-performances-whitney-beyonce", "description": "Ahead of Super Bowl 50, Billboard counts down the 10 best Super Bowl national anthem renditions to date.", "site_name": "Billboard"}}, "movies": ["https://web.archive.org/web/20160206081844if_/https://www.youtube.com/embed/mm-8a6YrCSo", "https://web.archive.org/web/20160206081844if_/https://www.youtube.com/embed/TJ2dcVYdpm0", "https://web.archive.org/web/20160206081844if_/https://www.youtube.com/embed/8iNM9WNQLb4", "https://web.archive.org/web/20160206081844if_/https://www.youtube.com/embed/6Cf7HIaWyFQ", "https://web.archive.org/web/20160206081844if_/https://www.youtube.com/embed/DkT_mNgfT9g", "https://web.archive.org/web/20160206081844if_/https://www.youtube.com/embed/5T4kOQ0wG7o", "https://web.archive.org/web/20160206081844if_/https://www.youtube.com/embed/OhrrGu2rcZ4", "https://web.archive.org/web/20160206081844if_/https://www.youtube.com/embed/9ETrr-XHBjE", "https://web.archive.org/web/20160206081844if_/https://www.youtube.com/embed/M851_qHQ03A", "https://web.archive.org/web/20160206081844if_/https://www.youtube.com/embed/N_lCmBvYMRs"], "publish_date": null, "source": "https://web.archive.org", "summary": ""}