{"url": "https://www.wmagazine.com/gallery/reese-witherspoon-style-evolution/all", "text": "Following her role as the unstoppable and irresistible Elle Woods in the Legally Blonde films, Reese Witherspoon, who had previously starred as slightly more sinister characters in Election and Pleasantville, was quickly appointed as America’s newest sweetheart. Since then, Witherspoon has come even more into her own, showing unprecedented ambition through a diversity of roles, which includes her pinnacle, Oscar-winning work as June Carter in Walk the Line, the self-destructive Cheryl Strayed in Wild, and the stubborn, but hardworking, reporter on The Morning Show.\n\nOff-screen, Witherspoon has garnered even more attention for her powerhouse-producing streak and recent venture, Hello Sunshine, which aims to project female-driven stories across multiple digital platforms. That’s all to say she’s a multi-faceted woman, and of course, she has the wardrobe to match. For over three decades, Witherspoon has taken on the red carpet, and honestly, her aesthetic hasn’t altered too much in that time. Sparkly, form-fitting, and feminine is Witherspoon’s MO, and brands like Celine, Versace, Elie Saab, and Michael Kors Collection have helped her achieve the desired effect at some of the biggest events. Here, look back at Witherspoon’s long history of looks, from her days promoting Cruel Intentions and Legally Blonde to now.\n\n2025: The Morning Show Season 4 Premiere Jamie McCarthy/Getty Images Entertainment/Getty Images Witherspoon and her The Morning Show co-star, Jennifer Aniston, both wore LBDs to the show’s season four premiere.\n\n2025: You’re Cordially Invited Premiere Taylor Hill/FilmMagic/Getty Images Witherspoon brought back the peplum skirt for a 2025 premiere. She paired her version, from Louis Vuitton, with a matching jacket.\n\n2024: SAG Awards Axelle/Bauer-Griffin/FilmMagic/Getty Images Witherspoon wore a red hot Elie Saab spring 2024 couture dress with a structured bodice and slit to the SAG awards in 2024.\n\n2024: Critics’ Choice Awards Axelle/Bauer-Griffin/FilmMagic/Getty Images The addition of the voluminous bow on the hip of Witherspoon’s Celine dress added a bit of whimsy to an otherwise classic look.\n\n2024: Golden Globe Awards Axelle/Bauer-Griffin/FilmMagic/Getty Images Witherspoon loves a classic, form-fitting dress, and this Monique Lhuillier, mid-length number with a light pink, off-the-shoulder detail, fit into her aesthetic perfectly.\n\n2023: Your Place Or Mine Premiere Albert L. Ortega/Getty Images Entertainment/Getty Images The actor made the case for the return of the peplum with the help of this turquoise dress from Valentino fall 2022 couture.\n\n2022: Emmy Awards ROBYN BECK/AFP/Getty Images Witherspoon embraced the mermaid-core aesthetic in a sequin-covered Armani Privé fall 2022 dress at the 2022 Emmys.\n\n2022: Surface Premiere KENA BETANCUR/AFP/Getty Images Considering Witherspoon was a producer of Surface, as opposed to a star of the Apple TV+ show, she likely didn’t want to illicit too much attention at the premiere. Still, the actor look great in an ivory, knee-length Schiaparelli dress with gold embroidery.\n\n2022: SAG Awards Axelle/Bauer-Griffin/FilmMagic/Getty Images The horn-like neckline of this Schiaparelli dress added some edge to an otherwise classic look.\n\n2021: Academy Awards Handout/Getty Images Entertainment/Getty Images The belt on Witherspoon’s Dior fall 2021 dress added a bit of casual flair to the overall look.\n\n2020: Golden Globe Awards Steve Granitz/WireImage/Getty Images For the 2020 Golden Globes, Witherspoon toned things down a bit, attending the awards ceremony in a white Roland Mouret gown with a gathered bodice and large ruffle detail.\n\n2019: The Morning Show Premiere Roy Rochlin/WireImage/Getty Images The actor turned to her go-to designer, Celine, to dress her for the premiere of the first season of The Morning Show.\n\n2019: Big Little Lies Season 2 Premiere Nicholas Hunt/WireImage/Getty Images Witherspoon wore a strapless Elie Saab pre-fall 2019 dress with an abstract pattern to the season two premiere of Big Little Lies.\n\n2018: Golden Globe Awards Steve Granitz/WireImage/Getty Images The 2019 Golden Globes featured Witherspoon in another gorgeous Zac Posen dress.\n\n2017: Emmy Awards Dan MacMedan/Getty Images Entertainment/Getty Images Witherspoon isn’t afraid to show some leg on the red carpet, and in 2017, she did just that, wearing a teal Stella McCartney satin suit dress to the Emmys.\n\n2017: Met Gala Jackson Lee/FilmMagic/Getty Images The actor mixed things up designer-wise for the 2017 Met Gala and opted to wear Mugler to fashion’s biggest night.\n\n2017: Big Little Lies Premiere Kevork Djansezian/Getty Images Entertainment/Getty Images Once again, Witherspoon gravitated toward an embellished mini dress for a red carpet appearance. This one was courtesy of Elie Saab pre-fall 2017.\n\n2017: Golden Globe Awards George Pimentel/WireImage/Getty Images While this Versace dress is fairly simple, it’s all about the gorgeous, buttercup yellow color.\n\n2016: Sing Premiere VALERIE MACON/AFP/Getty Images Witherspoon’s propensity for embellished mini dresses works perfectly when she has to attend the premiere of an animated film. This a-line Elie Saab number was a great choice for the Sing premiere in 2016.\n\n2016: Academy Awards C Flanigan/FilmMagic/Getty Images The purple Nina Ricci dress Witherspoon wore to the 2016 Oscars is another example of a great color taking a simple silhouette to the next level.\n\n2015: Met Gala TIMOTHY A. CLARY/AFP/Getty Images Witherspoon kept her look simple for the 2015 Met Gala, attending in a bright red Jason Wu gown.\n\n2015: Academy Awards Fairchild Archive/Penske Media/Getty Images One of Witherspoon’s best looks to date has to be the black and white, off-the shoulder Tom Ford dress she wore to the Oscars in 2015.\n\n2015: BAFTA Awards Rune Hellestad - Corbis/Corbis Entertainment/Getty Images Clearly, Witherspoon was having a lot of fun with color in the mid-2010s. This purple Stella McCartney gown is another example of a great hue elevating a look.\n\n2015: SAG Awards Jon Kopaloff/FilmMagic/Getty Images But a gorgeous white gown is always a good idea, as made evident by this Giorgio Armani dress.\n\n2015: Golden Globe Awards Jason Merritt/Getty Images Entertainment/Getty Images Witherspoon channeled old-Hollywood glamour in a strapless, sparkling Calvin Klein gown.\n\n2014: Wild Premiere Jon Kopaloff/FilmMagic/Getty Images The cut-out overlay on this classic white Zac Posen spring 2015 added a perfect note of romanticism.\n\n2014: Met Gala Rabbani and Solimene Photography/Getty Images Entertainment/Getty Images Thirteen years after the release of Legally Blonde, Witherspoon embraced the Elle Woods look on the Met Gala red carpet in a dress by Stella McCartney.\n\n2014: Vanity Fair Oscar Party Jon Kopaloff/FilmMagic/Getty Images Witherspoon mixed things up a bit for the 2014 Oscar after party and wore a plunging Hugo Boss fall 2014 dress with a paillette-embroidered skirt.\n\n2014: Golden Globe Awards Jason Merritt/Getty Images Entertainment/Getty Images The actor kept the styling of her teal Calvin Klein Collection simple, pairing it with a blunt, shoulder-length cut and Harry Winston jewels.\n\n2013: Toronto International Film Festival George Pimentel/WireImage/Getty Images The actor added some color to her patterned Jason Wu resort 2014 dress with a pair of green, suede pumps.\n\n2013: Academy Awards Gregg DeGuire/WireImage/Getty Images Witherspoon wore a blue and black color-blocked Louis Vuitton dress to the Oscars in 2013.\n\n2012: Cannes Film Festival ANNE-CHRISTINE POUJOULAT/AFP/Getty Images The actor’s silk chiffon Versace gown swathed her growing baby bump in Swarovski crystals.\n\n2012: Golden Globe Awards Frank Trapper/Corbis Entertainment/Getty Images The actor wowed viewers in Zac Posen’s pre-fall 2012 peony taffeta bustier gown at the 69th annual Golden Globe Awards in 2012.\n\n2011: LACMA Art & Film Gala Jason LaVeris/FilmMagic/Getty Images Witherspoon attended the first-ever LACMA gala in a Cushnie et Ochs black knee-length dress with a keyhole cutout on the bodice.\n\n2011: MTV Movie Awards Anthony Harvey/Getty Images Entertainment/Getty Images The cheetah print mini dress Witherspoon wore to the MTV Movie Awards in 2011 was a far cry from the other Zac Posen dresses she has worn on the red carpet.\n\n2011: Academy Awards WWD/Penske Media/Getty Images Witherspoon has mastered the art of simple elegance, and this Armani Privé dress from the 2011 Oscars is a perfect example.\n\n2009: Monster vs. Aliens Premiere Steve Granitz/WireImage/Getty Images This futuristic silver and green Rodarte mini was the perfect choice for the premiere of Witherspoon’s animated film, Monsters vs. Aliens.\n\n2009: Vanity Fair Oscar Party Jon Kopaloff/FilmMagic/Getty Images The actor wore a blue and black, draped Rodarte dress with an embellished bodice to the Vanity Fair Oscar party in 2009.\n\n2008: Four Christmases Premiere Jon Kopaloff/FilmMagic/Getty Images The actor paired her form-fitting Nina Ricci dress with some old Hollywood-inspired curls at the premiere of her comedy, Four Christmases.\n\n2007: Academy Awards John Shearer/WireImage/Getty Images Witherspoon took the stage at the 2007 Oscars in an eggplant Nina Ricci dress with ombré layers that got lighter as the skirt hit the floor.\n\n2007: SAG Awards Patrick McMullan/Patrick McMullan/Getty Images Clearly, Witherspoon was on a Nina Ricci kick around 2007, because she wore another dress by the designer to the SAG Awards that year.\n\n2007: Golden Globe Awards Frazer Harrison/Getty Images Entertainment/Getty Images She also donned the designer at the Golden Globes, opting for a yellow, knee-length number, which she paired with contrasting red heels.\n\n2006: Academy Awards Bloomberg/Bloomberg/Getty Images The actor looked like a winner in her gorgeous, embellished Christian Dior gown at the 2006 Oscars, which is fitting considering she took home the trophy that night for her performance in Walk the Line.\n\n2006: Golden Globe Awards SUSAN GOLDMAN/AFP/Getty Images If Witherspoon’s Chanel dress looks familiar, it’s because Kirsten Dunst actually wore it back in 2003.\n\n2005: Just Like Heaven Premiere Jon Kopaloff/FilmMagic/Getty Images In 2005, Witherspoon wore a tea-length Monique Lhuillier dress for the Just Like Heaven premiere in Los Angeles.\n\n2004: Venice Film Festival J. Vespa/WireImage/Getty Images A brunette Witherspoon opted for a pale blue Carolina Herrera number for the Venice Film Festival’s Vanity Fair premiere in 2004.\n\n2003: Legally Blonde 2 Premiere Dave Benett/Getty Images Entertainment/Getty Images Witherspoon wore a simple white dress to the premiere of Legally Blonde 2 in 2003. The piece featured a red velvet ribbon wrapped around the empire waist, which showed off her growing baby bump.\n\n2002: Academy Awards Steve Granitz/WireImage/Getty Images The actor transported us back to the ’20s in this gorgeous, black embellished Valentino gown at the 2002 Oscars.\n\n2002: Golden Globe Awards Gregg DeGuire/WireImage/Getty Images Clearly, the actor was going through a roarin’ ’20s phase in 2003, because her purple lace slip dress from the Golden Globes that year also fits into the early-20th century aesthetic.\n\n2001: Teen Choice Awards Gregg DeGuire/WireImage/Getty Images Witherspoon was in Elle Woods mode in 2001 when she wore this hot pink dress to the TCAs.\n\n2001: Legally Blonde Premiere Jeff Kravitz/FilmMagic, Inc/Getty Images Over two decades before the “theme dressing” trend took over the red carpet, Witherspoon was wearing this Elle Woods-approved dress to the premiere of Legally Blonde.\n\n2001: Golden Globe Awards Getty Images/Hulton Archive/Getty Images The black dress Witherspoon wore to the Golden Globes in 2001 was all about the accessories.\n\n2000: Golden Globe Awards Ron Galella, Ltd./Ron Galella Collection/Getty Images Witherspoon wore a simple, strapless black dress to the Golden Globes in 2000, which she attended with her then-husband, Ryan Phillippe.\n\n1999: Election Premiere Barry King/WireImage/Getty Images The actor went simple at the premiere of Election, opting to wear a black, cap sleeve dress to the event.\n\n1999: Vanity Fair Oscar Party Ron Galella, Ltd./Ron Galella Collection/Getty Images Witherspoon likes to wear empire waist dresses when pregnant to show off her baby bump, just as she did at the Vanity Fair party in 1999.\n\n1999: Cruel Intentions Premiere Steve.Granitz/WireImage/Getty Images Witherspoon tied together a pink maxi skirt and white top with a gold belt for a Renaissance fair-inspired look at the premiere of her cult classic film.\n\n1998: Pleasantville Premiere Ron Galella, Ltd./Ron Galella Collection/Getty Images The actor looked gorgeous in a simple black strapless dress with gathered details.\n\n1998: Twilight Premiere Ron Galella, Ltd./Ron Galella Collection/Getty Images Witherspoon opted for a sheer, silver ensemble for her 1998 film premiere with a complimenting bag and peep-toe pumps.\n\n1997: Vanity Fair Oscar Party Jim Smeal/Ron Galella Collection/Getty Images The actor paired a sheer top with a velvet maxi skirt and black cardigan for the Oscar after party in 1997.\n\n1996: Freeway Premiere Steve Eichner/Archive Photos/Getty Images Witherspoon celebrated her movie premiere in an all-black look featuring leather boots and a sleeveless turtleneck top.\n\n1996: Fear Premiere Patrick Riviere/Hulton Archive/Getty Images The actor wore a red dress, embellished cardigan, and boots to the premiere of her film, Fear, in 1996.\n\n1991: The Man in the Moon Premiere Ron Galella/Ron Galella Collection/Getty Images Witherspoon attended the 1991 premiere of her debut movie, The Man In The Moon, in an adorable daisy top, black skirt, and cowboy boots.", "images": ["https://imgix.bustle.com/uploads/getty/2024/3/22/a3f456be-fba5-4531-88d3-dc01d418f20a-getty-81968428.jpg?w=390&h=700&fit=crop&crop=faces&dpr=2", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2024/3/21/a97e0315-f798-437a-bb1a-bcd09ad7d4dd-getty-162766463.jpg?w=390&h=578&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/22/24324f9f-b1ee-4d32-a2f4-8de3945098f4-getty-156196118.jpg?w=390&h=551&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/ac78680e-ff6d-49d0-a08b-ace9aa8229d1-getty-476673619.jpg?w=390&h=604&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/6b040661-868b-4eea-8cc9-035479fc5915-getty-849115118.jpg?w=390&h=634&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/c6dfd2e8-c624-45b8-89f3-c55ed742954f-getty-1462613935.jpg?w=390&h=542&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/22/9ef46007-289e-43bd-90a1-2a3084cccdaf-getty-627452678.jpg?w=390&h=551&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/3036b4c5-737d-4081-a570-f4e55c244f24-getty-519907819.jpg?w=390&h=572&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/f2c97d2e-7a96-475d-9e92-3b139b2f173d-getty-463596474.jpg?w=390&h=648&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/282f71e7-a893-422f-9a44-6408e5cb3d56-getty-80991335.jpg?w=390&h=623&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/22/6975e9d2-2c50-4d3b-8744-c5c2ea742a6a-getty-109576829.jpg?w=390&h=601&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/22/c51a5960-78d9-4b32-97a7-b02586ae55ef-getty-529823488.jpg?w=390&h=586&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/ef9b881c-4807-4819-894a-85a70196adbc-getty-1197822739.jpg?w=390&h=503&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/22c8009f-0cc2-4503-b361-0aa4a6264a07-getty-609353616.jpg?w=390&h=585&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/37f53a2d-f054-41b5-b5e3-def4fccfb174-getty-156196481.jpg?w=390&h=580&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/1e1542a7-3634-40c6-b847-6f6e874efb0f-getty-2037711481.jpg?w=390&h=550&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/22/6d2c182f-a31b-4092-bb05-1a4d47e02182-getty-73005362.jpg?w=390&h=597&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2025/3/21/4a998a2f/new-york-new-york.jpg?w=390&h=585&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/e51c359f-3ee3-4ee5-bfc6-99264d879aab-getty-631272890.jpg?w=390&h=585&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/966247e9-51d6-4df3-8c71-0c9394ae9a49-getty-184582043.jpg?w=390&h=513&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/413805d9-eb3f-482f-b63b-972f9b5a0b86-getty-130066966.jpg?w=390&h=663&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/27cbd81c-310c-4d10-9e8f-950055face3d-getty-110718953.jpg?w=390&h=638&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/a99aca0f-b403-46c2-9ade-2002de76a645-getty-676156412.jpg?w=390&h=587&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/d3b4d6d7-d370-45c6-8f42-ca26ba3b4a97-getty-131622348.jpg?w=390&h=558&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/9700da7f-a384-43f7-8fe9-7e20b45ffe8d-getty-108747112.jpg?w=390&h=674&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/12e1c393-f80b-474e-a740-f328c7ea391d-getty-51084464.jpg?w=390&h=591&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/9de126ab-835d-4e2f-be15-f936162e5a36-getty-1184094868.jpg?w=390&h=585&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/54e6009b-fbd9-4076-8a43-81597e141213-getty-1314440614.jpg?w=390&h=601&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/20d2f552-8b08-45fa-bb4a-b5ec642186c9-getty-1243179406.jpg?w=390&h=585&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/22/18c4dece-565e-48c8-8194-1a3c028ec14b-getty-472193686.jpg?w=390&h=559&fit=crop&crop=faces&dpr=2", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2024/3/21/c0b65a7e-8f83-4541-a2f6-82a4b95cfd0b-getty-156196115.jpg?w=390&h=579&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/d3e73b59-c353-48b9-8380-e6d02d86c5c7-getty-1917154326.jpg?w=390&h=544&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/fffcbb0f-3e3f-4247-ad10-e75469b6a377-getty-902724438.jpg?w=390&h=483&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/22/1a11605b-d70e-44fd-a98a-b0051a63c5db-getty-488430933.jpg?w=390&h=709&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/bde3db31-a1fa-4781-a0c7-8526ee529715-getty-179839768.jpg?w=390&h=594&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/22/20d3f546-8c70-4988-82e1-961ff92b909f-getty-634198752.jpg?w=390&h=586&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/22/6be2d520-10a3-4e79-ba16-f62c9c5f87c5-getty-1931503050.jpg?w=390&h=579&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/22/742cf553-7e79-44a2-96fe-ce859a0bd9ee-getty-57005353.jpg?w=414&h=623&fit=crop&crop=focalpoint&dpr=2&fp-x=0.4924&fp-y=0.1862", "https://imgix.bustle.com/uploads/getty/2024/3/22/fba5ebb0-cfb5-4002-8e32-da2ba6477a01-getty-184468786.jpg?w=390&h=605&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/f36ac055-fa8a-46ee-a590-b1fa50d499a9-getty-460445410.jpg?w=390&h=623&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/888d947a-aadb-48e7-9f99-b6e93651c746-getty-526590056.jpg?w=390&h=621&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/c179df9d-c39c-40d3-a222-0b68883a8a3c-getty-1934494708.jpg?w=390&h=568&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/2103ab61-e6d6-46dd-8db5-59d5b014560e-getty-645138211.jpg?w=390&h=584&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/1d68a5f9-8b47-4840-8a2a-fafa674d0e03-getty-98695361.jpg?w=390&h=561&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/b028ed5f-ee5e-4ba1-9826-982a8a2e1bcb-getty-1373258949.jpg?w=390&h=516&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/22/43e9971f-12ac-4119-8a9d-67d97f7d71bb-getty-461468286.jpg?w=390&h=570&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/03d4914a-cedc-4a73-b386-53ec9517ab2a-getty-106145300.jpg?w=390&h=605&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/67939cde-ee51-4888-9dad-010b34c27aa9-getty-96996634.jpg?w=390&h=663&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/22/7a3b5226-1586-4826-8aa3-4f7cc461fc7c-getty-57005353.jpg?w=1200&h=630&fit=crop&crop=focalpoint&fm=jpg&fp-x=0.4852&fp-y=0.1876", "https://imgix.bustle.com/uploads/getty/2024/3/22/a03edb06-98b0-44b6-9409-79f51df1e9cf-getty-86006752.jpg?w=390&h=560&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/91041563-2ea2-42f6-a0dc-f878dd24f840-getty-180092488.jpg?w=390&h=587&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/8a36f32d-398e-4ee3-80a2-794d7960089e-getty-1146927773.jpg?w=390&h=585&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/79547d5e-8d2a-4161-a7f1-5d133650f396-getty-145396270.jpg?w=390&h=585&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/c951ddef-4901-45ca-a7a1-6074c03e0384-getty-1242114874.jpg?w=390&h=528&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/cdaacece-4a73-4bdc-a726-ff9a10cf3272-getty-1434328588.jpg?w=390&h=585&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/22/be40ae10-43d6-41fa-b483-b48f520e504a-getty-74697307.jpg?w=390&h=639&fit=crop&crop=faces&dpr=2", "https://sb.scorecardresearch.comp?c1=2&c2=17519299&v=3.9.1&cj=1", "https://imgix.bustle.com/uploads/getty/2024/3/21/b0621536-46fc-41b1-a43c-b6caea55648f-getty-84995987.jpg?w=390&h=535&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2025/9/19/04e5b8e2/new-york-new-york.jpg?w=390&h=606&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/22/ab7497ee-9a5f-4c1c-bfe0-5378a8572047-getty-1458525840.jpg?w=390&h=586&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/5c791cb7-72de-4463-b37b-a848b6db1511-getty-3185745.jpg?w=390&h=599&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/597a274e-b37c-456b-a9e0-716284903484-getty-462124341.jpg?w=390&h=616&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/22/e4272f27-4c16-403f-b321-61e5d40c1ec4-getty-94827792.jpg?w=390&h=672&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/8663a552-c9ab-41e0-8011-4356a897ffde-getty-1316357.jpg?w=390&h=745&fit=crop&crop=faces&dpr=2", "https://imgix.bustle.com/uploads/getty/2024/3/21/779dc7a8-592b-49f1-9455-053a84bde16b-getty-513096594.jpg?w=390&h=860&fit=crop&crop=faces&dpr=2"], "top_img": "https://imgix.bustle.com/uploads/getty/2024/3/22/7a3b5226-1586-4826-8aa3-4f7cc461fc7c-getty-57005353.jpg?w=1200&h=630&fit=crop&crop=focalpoint&fm=jpg&fp-x=0.4852&fp-y=0.1876", "keywords": [], "authors": [], "canonical_link": "https://www.wmagazine.com/fashion/reese-witherspoon-style-evolution", "title": "Reese Witherspoon Has Always Been the Girl Next Door on the Red Carpet", "meta_data": {"viewport": "width=device-width,initial-scale=1", "og": {"type": "article", "url": "https://www.wmagazine.com/fashion/reese-witherspoon-style-evolution", "title": "Reese Witherspoon Has Always Been the Girl Next Door on the Red Carpet", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2024/3/22/7a3b5226-1586-4826-8aa3-4f7cc461fc7c-getty-57005353.jpg?w=1200&h=630&fit=crop&crop=focalpoint&fm=jpg&fp-x=0.4852&fp-y=0.1876", "width": 1200, "height": 630}, "description": "To celebrate the star's birthday, we're looking back at her best looks over the past three decades.", "site_name": "W Magazine"}, "twitter": {"card": "summary_large_image", "site": "@wmag"}, "description": "To celebrate the star's birthday, we're looking back at her best looks over the past three decades.", "article": {"published_time": "2025-09-19T20:14:48.911Z", "publisher": "https://www.facebook.com/wmagazine"}, "referrer": "unsafe-url", "robots": "max-image-preview:large"}, "movies": [], "publish_date": 1758312888.911, "source": "https://www.wmagazine.com", "summary": ""}