{"url": "https://en.wikipedia.org/wiki/Jeopardy!", "text": "American television quiz show\n\nJeopardy! is an American television game show created by Merv Griffin. The show is a quiz competition that reverses the traditional question-and-answer format of many quiz shows. Rather than being given questions, contestants are instead given general knowledge clues in the form of answers and they must identify the person, place, thing, or idea that the clue describes, phrasing each response in the form of a question.[1]\n\nThe original daytime version debuted on NBC on March 30, 1964, and aired until January 3, 1975. A nighttime syndicated edition aired weekly from September 1974 to September 1975, and a revival, The All-New Jeopardy!, ran on NBC from October 1978 to March 1979 on weekdays. The syndicated show familiar to modern viewers and aired daily (currently by Sony Pictures Television[c]) premiered on September 10, 1984.\n\nArt Fleming served as host for all versions of the show between 1964 and 1979. Don Pardo served as announcer until 1975, and John Harlan announced for the 1978–1979 season. The daily syndicated version premiered in 1984 with Alex Trebek as host and Johnny Gilbert as announcer. Trebek hosted until his death in November 2020, with his last episode airing January 8, 2021, after over 36 years in the role. Following his death, a variety of guest hosts completed the season[2] beginning with record-holding former contestant Ken Jennings, each hosting for a few weeks before passing the role on to someone else. Then-executive producer Mike Richards initially assumed the position of permanent host in September 2021, but relinquished the role within a week.[3] Mayim Bialik and Jennings served as permanent rotating hosts of the syndicated series until December 2023, when Jennings became the sole syndicated host.[4] While Bialik was originally arranged to host additional primetime specials on ABC, and spin-offs, the announcement of Jeopardy! Masters in 2023 meant these duties were shared as well. Following Bialik's withdrawal in part of supporting writers and actors due to the 2023 Hollywood labor disputes, Jennings assumed hosting duties for all forms of media.\n\nCurrently in its 42nd season, Jeopardy! is one of the longest-running game shows of all time. The show has consistently enjoyed a wide viewership and received many accolades from professional television critics. With over 9,000 episodes aired,[5] the daily syndicated version of Jeopardy! has won a record 45 Emmy Awards as well as a Peabody Award. In 2013, the program was ranked No. 45 on TV Guide's list of the 60 greatest shows in American television history. Jeopardy! has also gained a worldwide following with regional adaptations in many other countries.\n\nGameplay [ edit ]\n\nEach game of Jeopardy! features three contestants competing in three rounds: Jeopardy!, Double Jeopardy!, and Final Jeopardy! In each round, contestants are presented trivia clues phrased as answers, to which they must respond in the form of a question that correctly identifies whatever the clue is describing. For example, instead of asking, \"Who is the only U.S. President to marry in the White House?\" and the answer being \"Grover Cleveland\", the clue is \"He is the only U.S. president to marry in the White House\" and the contestant would respond by asking \"Who is Grover Cleveland?\"\n\nThe layout of the Jeopardy! game board since November 26, 2001, showing the dollar values used in the first round (in the second round, the values are doubled). Categories at the top of the board vary between each round and episode.\n\nThe Jeopardy! and Double Jeopardy! rounds each feature game boards consisting of six categories with five clues each. The clues are valued by dollar amounts from lowest to highest, ostensibly by difficulty. The values of the clues increased over time, with those in the Double Jeopardy! round always being double the range of the Jeopardy! round. On the original Jeopardy! series, clue values in the first round ranged from $10 to $50 in the Jeopardy! round and $20 to $100 in Double Jeopardy! On The All-New Jeopardy!, they ranged from $25 to $125 and $50 to $250. The 1984 series' clue values originally ranged from $100 to $500 in Jeopardy! and $200 to $1,000 in Double Jeopardy! These ranges were increased to $200–$1,000 and $400–$2,000, respectively, on November 26, 2001.[9]\n\nGameplay begins when the returning champion selects a clue by indicating its category and dollar value. The two (or if there is no returning champion, three) challengers participate in a random draw prior to taping to determine contestant order, and if there is no returning champion, the contestant who drew the first lectern starts. The underlying clue is revealed and read aloud by the host, after which any contestant may ring in using a lock-out device. The first contestant to successfully ring in is prompted to respond to the clue by stating a question containing the correct answer to the clue. Any grammatically coherent question with the correct answer within it counts as a correct response.[10] If the contestant responds correctly, its dollar value is added to the contestant's score, and they may select a new clue from the board. An incorrect response or failure to respond within five seconds deducts the clue's value from the contestant's score and allows the other contestants the opportunity to ring in and respond. If the response is not technically incorrect but otherwise judged too vague, the contestant is given additional time to provide a more specific response. Whenever none of the contestants ring in and respond correctly, the host gives the correct response, and the player who selected the previous clue chooses the next clue.[11] Gameplay continues until the board is cleared or the round's time length expires, which is typically indicated by a beeping sound.\n\nThe contestant who has the lowest score selects the first clue to start the Double Jeopardy! round.[11] Since 2021, if there is a tie for the contestant with the lowest score, the contestant with the last correct question among the tied players selects first.[12]\n\nA \"Daily Double\" clue is hidden behind one clue in the Jeopardy! round, and two in Double Jeopardy! The name and inspiration were taken from a horse-racing term. Daily Double clues with a sound or video component are known as \"Audio Daily Doubles\" or \"Video Daily Doubles\", respectively. Before the clue is revealed, the contestant who has selected the Daily Double must declare a wager, from a minimum of $5 to a maximum of their entire score (known as a \"true Daily Double\") or the highest clue value available in the round, whichever is greater.[11][14] Only the contestant who chooses the Daily Double is allowed to answer. A correct response adds the value of the wager to the contestant's score while an incorrect response or failure to provide a response deducts the same value. Whether the contestant responds correctly or not, they choose the next clue.[11]\n\nDuring the Jeopardy! round, contestants are not penalized for forgetting to phrase their response in the form of a question, although the host will remind them to watch their phrasing in future responses. In the Double Jeopardy! round and in the Daily Double in the Jeopardy! round, the phrasing rule is followed more strictly, with a response only able to be ruled as correct if it is phrased properly in question form. A contestant who initially does not phrase a response in the form of a question must re-phrase it before the host rules against them.[14]\n\nContestants are encouraged to select the clues in order from lowest to highest value, as the clues are sometimes written in each category to flow from one to the next. Deviating from this is known as the \"Forrest Bounce\", a strategy in which contestants randomly pick clues to confuse opponents that was first used in 1985 by Chuck Forrest, who won over $70,000 in his initial run as champion. Trebek expressed that this strategy not only annoyed him but also the staff, since it disrupts the rhythm that develops when revealing the clues and increases the potential for error.[16] Another strategy used by some contestants is to play all of the higher-valued clues first and build up a substantial lead, starting at the bottom of the board. This strategy was regularly used by James Holzhauer during his winning streak between April and June 2019.[17]\n\nFrom the premiere of the original Jeopardy! until the end of the 1984–85 syndicated season, contestants were allowed to ring in as soon as the clue was revealed. Since September 1985, contestants are required to wait until the clue is read before ringing in. To accommodate the rule change, lights were added to the game board (unseen by home viewers) to signify when it is permissible for contestants to signal. Attempting to signal before the light goes on locks the contestant out for half of a second. The change was made to allow the home audience to play along more easily and to keep an extremely fast contestant from potentially dominating the game. In pre-1985 episodes, a sound accompanied a contestant ringing in. According to Trebek, the sound was eliminated because it was \"distracting to the viewers\" and presented a problem when contestants rang in while Trebek was still reading the clue. Contestants who are visually impaired or blind are given a card with the category names printed in Braille before each round begins.[21][22]\n\nTo ensure fairness in competition and accuracy in scores, the judges double-check their own rulings throughout each episode. If it is determined at any point that a previous response was wrongly ruled correct or incorrect during the taping of an episode, the scores are adjusted at the first available opportunity, typically either at the start of the next round/segment or immediately after a Daily Double is found, with the host providing any necessary explanation regarding the changes. If an error that may have affected the result is not discovered until after taping of an episode is completed, the affected contestants are invited back to compete on a future show, complying with federal quiz show regulations.\n\nContestants who finish Double Jeopardy! with zero dollars or a negative score are automatically eliminated from the game at that point and awarded a consolation prize. On at least one episode hosted by Art Fleming, all three contestants finished Double Jeopardy! with zero dollars or less, and as a result, no Final Jeopardy! round was played. This rule is still in place for the syndicated version, although staff has suggested that it is not set in stone and they may decide to display the clue for home viewers' play if such a situation were ever to occur.[26]\n\nFinal Jeopardy! [ edit ]\n\nThe Final Jeopardy! round features a single clue that, according to Answers in the Form of Questions, typically requires a two-step thought process to answer. At the end of the Double Jeopardy! round, the host announces the Final Jeopardy! category and a commercial break follows. Contestants who finish Double Jeopardy! with less than $1 do not participate in this round. During the break, partitions are placed between the contestant lecterns, and each contestant makes a final wager; they may wager any amount of their earnings, but may not wager certain numbers with connotations that are deemed inappropriate.[27] Contestants write their wagers using a light pen on an electronic display on their lectern within a time limit of five minutes, during which they also phrase the question, which is pre-written during the wager. After the break, the Final Jeopardy! clue is revealed and read by the host. The contestants have 30 seconds to write their responses on the electronic display, while the show's \"Think!\" music plays. If either the display or the pen malfunctions, contestants can manually write their responses and wagers using an index card and marker, although the index card has the required phrasing pre-printed on each side (\"Who/What\"). Visually impaired or blind contestants typically type their responses and wagers with a computer keyboard.[21][22]\n\nContestants' responses are revealed in order of their pre-Final Jeopardy! scores from lowest to highest. Once a correct response is revealed the host confirms it. Otherwise, the host reveals the correct response if all contestants responded incorrectly. A correct response adds the amount of the contestant's wager to their score. A miss, failure to respond, insufficiently specific response, misspelling that affects the pronunciation of the answer, or failure to phrase the response as a question (even if correct) deducts it.[11]\n\nThe contestant with the highest score at the end of the round is that day's winner. If there is a tie for second place, consolation prizes are awarded based on the scores going into the Final Jeopardy! round. If all three contestants finish with zero dollars, no one returns as champion for the next show, and based on scores going into the Final Jeopardy! round, the two contestants who were first and second receive the second-place prize, and the contestant in third receives the third-place prize. In tournament play, if the game requires a winner, the standard tiebreaker will be used.\n\nVarious researchers have studied Final Jeopardy! wagering strategies. If the leader's score is more than twice the second place contestant's score (a situation known as a \"runaway game\"), the leader can guarantee victory by making a sufficiently small wager.[29]: 269 Otherwise, according to Jeopardy! College Champion Keith Williams, the leader usually wagers an amount that would be a dollar greater than twice the second place contestant's score, guaranteeing a win with a correct response.[30] Writing about Jeopardy! wagering in the 1990s, mathematicians George Gilbert and Rhonda Hatcher said that \"most players wager aggressively\".[29]: 269\n\nWinnings [ edit ]\n\nThe top scorer in each game is paid their winnings in cash and returns to play in the next match. Non-winners receive consolation prizes instead of their winnings in the game. Since May 16, 2002, consolation prizes have been awarded in cash— originally $2,000 for second-place contestants and $1,000 for third-place contestants.[31] Since travel and lodging are generally not provided for contestants, cash consolation prizes offset these costs. Production covers the cost of travel for returning champions and players invited back because of errors who must make multiple trips to Los Angeles. Production also covers the cost of travel if a tournament travels (does not stay in Los Angeles) on the second week. Starting in Season 40, according to the official podcast in August 2023,[citation needed] as a result of inflation, consolation prizes were raised $1,000 each to $3,000 for second and $2,000 for third.\n\nDuring Art Fleming's hosting run, all three contestants received their winnings in cash where applicable. This was changed at the start of Trebek's hosting run to avoid the problem of contestants who stopped participating in the game, or avoided wagering in Final Jeopardy!, rather than risk losing the money they had already won. This also allowed the increase to clue values since only one contestant's score is paid instead of three. From 1984 to 2002, non-winning contestants on the Trebek version received vacation packages and merchandise, which were donated by manufacturers as promotional consideration. Since 2004, a presenting sponsor has provided cash prizes to the losing contestants.\n\nReturning champions [ edit ]\n\nThe winner of each episode returns to compete against two new contestants on the next episode. Originally, a contestant who won five consecutive days retired undefeated and was guaranteed a spot in the Tournament of Champions. The five-day limit was eliminated on September 8, 2003.[35] The record for most days with a new returning champion is 13, set in 2002 and tied in 2025.[36]\n\nIn rare instances, contestants tie for first place. The rules related to ties have changed over time. Since November 24, 2014,[37] ties for first place following Final Jeopardy! are broken with a tie-breaker clue, resulting in only one champion being named, keeping their winnings, and returning to compete in the next show. The tied contestants are given the category and read the single clue, and the first contestant to buzz-in must give the correct question. A contestant cannot win by default if the opponent gives an incorrect question or forgets to phrase the response as a question (even if correct). The contestant must give a correct question to win the game. If neither player gives the correct question, another clue is given.[26] Previously, if two or all three contestants tied for first place, they were declared \"co-champions\", and each retained his or her winnings and (unless one was a five-time champion who retired prior to 2003) returned on the following episode. A tie occurred on the January 29, 2014, episode when Arthur Chu, leading at the end of Double Jeopardy!, wagered to tie challenger Carolyn Collins rather than winning. Chu followed Jeopardy! College Champion Keith Williams's advice to wager for the tie to increase the leader's chances of winning.[38][39] A three-way (non-zero) tie for first place has only occurred once on the syndicated version hosted by Trebek, on March 16, 2007, when Scott Weiss, Jamey Kirby, and Anders Martinson all ended the game with $16,000.[40] Until March 1, 2018,[37][42] no regular game had ended in a tie-breaker.\n\nIf no contestant finishes Final Jeopardy! with a positive total, there is no winner and three new contestants compete on the next episode. This has happened on several episodes, including the second episode hosted by Trebek.[44][45][46] A winner unable to return as champion because of a change in personal circumstances – for example, illness or a job offer – may be allowed to appear as a co-champion (now a rare occurrence since the co-champion rule was disestablished in early Season 31) in a later episode.[47][48][49] If a light pen failure occurs during the Final Jeopardy! round, extra time is given, and the round could have an outcome on the game; officials have the right to declare co-champions with both affected players being paid their scores. No tiebreaker will be played, and the game will ruled a technical tie game.[50]\n\nVariations for tournament play [ edit ]\n\nThroughout each season, Jeopardy! features various special tournaments for particular groups (as named in \"Tournaments and other events\" below). Each year at the Tournament of Champions, the players who had won the most games and money in the previous season come back to compete against each other for a large cash prize. Tournaments generally feature 15 contestants and run for 10 consecutive episodes. They generally take place across three rounds: the quarterfinal round (five games), the semifinal round (three games), and the final round (two games).\n\nThe first five episodes, the quarterfinals, feature three new contestants each day. Other than in the Tournament of Champions, the quarterfinals are unseeded and contestants participate in a random draw to determine playing order and lectern positions over the course of the five games. The Tournament of Champions is seeded based on total winnings in regular games to determine playing order and lectern positions, with the top five players occupying the champion's lectern for the quarterfinal games. Since the removal of the five-game limit in 2003, in the unlikely case of a tie in total winnings between two Tournament of Champions players, the player who won the most games receives the higher seed. If still tied, seeding is determined by comparing the tied players' previous aggregate scores.\n\nThe winners of the five quarterfinal games and the four highest-scoring non-winners (\"wild cards\") advance to the semifinals, which run for three days. The semifinals are seeded with the quarterfinal winners being seeded 1–5 based on their quarterfinal scores, and the wild cards being seeded 6–9. The winners of the quarterfinal games with the three highest scores occupy the champion's lectern for the semifinals. The winners of the three semifinal games advance to play in a two-game final match, in which the scores from both games are combined to determine the overall standings. This format has been used since the first Tournament of Champions in 1985 and was devised by Trebek himself.\n\nTo prevent later contestants from playing to beat the earlier wild card scores instead of playing to win, contestants are \"completely isolated from the studio until it is their time to compete\".\n\nIf none of the contestants in a standard 15-player tournament format quarterfinal end with a positive score, no contestant automatically qualifies from that game, and an additional wild card contestant advances instead.[53] This occurred in the quarterfinals of the 1991 Seniors Tournament and the semifinals of the 2013 Teen Tournament, where the rule was in effect during the semifinals, but after that tournament the rule has changed for semifinals and finals.[53]\n\nAs the players are not isolated during the semifinals the way they are during the quarterfinals, show officials discovered a flaw after the 2013 Teen Tournament, because the triple zero loss happened in the second semifinal that allowed the third semifinal of the 2013 Teen Tournament to be played differently from the first (which was played before the triple zero loss). Starting with the 2013 Tournament of Champions, semifinal games, like the two-game finals, must have a winner. Players who participate in Final Jeopardy! will participate in the standard tie-breaker, regardless of the score being zero or a positive score. Similarly, if all three players have a zero score at the end of a two-game match, a normal tournament finals format will proceed to a tie-breaker. In a tournament format where a player must win multiple games to win the tournament, such as the 2020 Greatest of All Time or 2022 Tournament of Champions, or in the quarterfinals of tournaments without wild cards where a player must win the game to advance (21 or 27 players), the tie-breaker will be used regardless of the score being zero or positive for players to win the game and either advance to the next round or receive the point towards winning the tournament. This was confirmed by Ken Jennings in a post-match interview posted on the show's website during the Season 40 Champions Wildcard Tournament.[54]\n\nIn the standard tournament finals format, contestants who finish Double Jeopardy! with a zero dollars or negative score on either day do not play Final Jeopardy! that day. Their score for that leg is recorded as zero dollars.\n\nConception and development [ edit ]\n\nLogo for the original \"Jeopardy!\" (1964–1975)\n\nIn a 1963 Associated Press profile released shortly before the original Jeopardy! series premiered, Merv Griffin offered the following account of how he created the quiz show:\n\nMy wife Julann just came up with the idea one day when we were in a plane bringing us back to New York City from Duluth. I was mulling over game show ideas, when she noted that there had not been a successful \"question and answer\" game on the air since the quiz show scandals. Why not do a switch, and give the answers to the contestant and let them come up with the question? She fired a couple of answers to me: \"5,280\"—and the question of course was \"How many feet in a mile?\" Another was \"79 Wistful Vista\"; that was Fibber and Mollie McGee's address. I loved the idea, went straight to NBC with the idea, and they bought it without even looking at a pilot show.[55][56]\n\nGriffin's first conception of the game used a board comprising ten categories with ten clues each, but after finding that this board could not easily be shown on camera, he reduced it to two rounds of thirty clues each, with five clues in each of six categories. He originally intended requiring grammatically correct phrasing (e.g., only accepting \"Who is...\" for a person), but after finding that grammatical correction slowed the game down, he decided to accept any correct response that was in question form. Griffin discarded his initial title of What's the Question? when skeptical network executive Ed Vane rejected his original concept of the game, claiming, \"It doesn't have enough jeopardies.\"\n\nThe format of giving contestants the answers and requiring the questions had previously been used by the Gil Fates-hosted program CBS Television Quiz, which aired from July 1941 until May 1942.\n\nPersonnel [ edit ]\n\nHosts [ edit ]\n\nArt Fleming was the original host of the show throughout both NBC runs and its brief weekly syndicated run, between 1964 and 1979. Alex Trebek served as host of the daily syndicated version from its premiere in 1984 until his death in 2020, except when he switched places with Wheel of Fortune host Pat Sajak as an April Fool's joke on April 1, 1997.[62]\n\nTrebek was still serving as host, having taped his last episode on October 29, 2020, for an intended Christmas Day broadcast, when contingency plans were made for him to miss the next taping, scheduled for November 9–10, 2020. In a New York magazine interview from 2022, then-consulting producer and former contestant Ken Jennings noted supervising producers Lisa Broffman and Rocky Schmidt had named him interim host for that taping and remembered his last conversation with Trebek days before rehearsal was to commence.[63] In Sony Pictures Television's official Jeopardy! podcast in 2023, Broffman noted the rehearsal for Jennings was scheduled November 8, 2020, but canceled when Schmidt gave staff the news that Trebek had died that day.[64]\n\nAt the time of Trebek's death, producers publicly declined to discuss any plans to introduce his successor while stating that they had enough new episodes with Trebek as host to run through Christmas Day.[65] On November 9, 2020, the first episode to air after Trebek's death, executive producer Mike Richards paid tribute to Trebek, after a few seconds of silence where the lights on the Jeopardy! set (which had been set up for Jennings to host before Trebek's death) slowly dimmed.[66] That episode, as well as subsequent episodes that aired after Trebek's death, included a dedication screen at the end of the credits through the remainder of the season.[67] To compensate for concerns over pre-emptions caused by holiday week specials and sports, SPT postponed the air dates of Trebek's final week; the episodes scheduled for the week of December 21–25 were moved to January 4–8, 2021. Before Trebek's final episodes, reruns of episodes in which he recorded clues on location were shown from December 21, 2020, to January 1, 2021.[68]\n\nJennings took over hosting when production resumed on November 30, 2020; his six weeks of episodes aired between January 11 and February 19, 2021.[69][2] The season went on to be completed by additional guest hosts, namely the aforementioned Richards; news personalities Katie Couric, Bill Whitaker, Savannah Guthrie, Sanjay Gupta, Anderson Cooper,[70][71] George Stephanopoulos, and Robin Roberts;[72] athlete Aaron Rodgers; talk show host Mehmet Oz; actress Mayim Bialik;[70][71] former children's show host LeVar Burton; business journalist David Faber; and sportscaster Joe Buck.[72] In addition, the 2021 Tournament of Champions was hosted by Buzzy Cohen, winner of the 2017 tournament.[73]\n\nOn August 11, 2021, it was announced that Richards would succeed Trebek as host of the daily show and Bialik would host Jeopardy! primetime specials and spin-offs.[74][75] On August 20, following a report from The Ringer exposing controversial remarks made on his podcast in the past, resurfaced controversies from Richards's time on The Price Is Right, and accusations of self-dealing regarding his executive producer position, Richards stepped down as host after taping only one week of episodes. Richards's five episodes as host aired in September 2021.[76][77] Bialik and Jennings then alternated hosting the show through the 2021–2022 season. Bialik also hosted the season's various tournaments and primetime specials.[78]\n\nIn July 2022, it was announced that Bialik and Jennings would return as co-hosts of the syndicated version. Jennings would host the Tournament of Champions and the new Second Chance Tournament, while Bialik would again host the primetime specials and spinoffs, including a new celebrity edition of Jeopardy!, which premiered in September 2022.[79][80] However, in January 2023, ABC announced Jennings would host a Jeopardy! Masters spinoff, indicating a change of arrangement.[81] In May 2023, Bialik opted not to host the final episodes of the season in support of writers during the 2023 Writers Guild of America strike, with Jennings stepping in to host the remaining episodes.[82] Bialik formally went on strike with her union, SAG-AFTRA, shortly thereafter.[83] It was later announced that Jennings would host the second season of the new celebrity edition.[84] In December 2023, after the strike was resolved, Sony announced that Jennings would remain the sole host of the syndicated series permanently, noting that it was still open to having Bialik host the prime time specials.[85][86] According to reporter Claire McNear of The Ringer, \"Many Jeopardy! staff members came to believe that Jennings had become the technically superior host, according to a source close to production, who says that Jennings's improvement was the key factor that spelled the end for Bialik.\"[87] Executive producer Michael Davies told Rolling Stone in January 2025 that \"Mayim, which was absolutely her right, elected not to cross the picket line during the [SAG-AFTRA] strike. And as Ken got more reps, I think he got better and he earned the job.\"[88][89] Bialik would later tease a potential return to the series in September 2024.[90]\n\nAnnouncers [ edit ]\n\nJohn Harlan served as the announcer for The All-New Jeopardy! from 1978 to 1979.\n\nJohnny Gilbert has been the announcer of Jeopardy! since 1984.\n\nDon Pardo held the role of announcer on the NBC version and weekly syndicated version, while John Harlan replaced him for The All-New Jeopardy! In the daily syndicated version's first pilot, from 1983, Jay Stewart served as the announcer, but Johnny Gilbert took over the role at Trebek's recommendation when that version was picked up as a series.[92]\n\nClue Crew [ edit ]\n\nThe Jeopardy! Clue Crew, introduced on September 24, 2001, was a team of roving correspondents who appeared in videos, recorded around the world, to narrate some clues.[93] Explaining why the Clue Crew was added, executive producer Harry Friedman said, \"TV is a visual medium, and the more visual we can make our clues, the more we think it will enhance the experience for the viewer.\"[94]\n\nKelly Miyahara, a member of the Jeopardy! Clue Crew, on set in 2009\n\nFollowing the initial announcement of auditions for the team, over 5,000 people applied for Clue Crew posts.[94] The original Clue Crew members were Cheryl Farrell, Jimmy McGuire, Sofia Lidskog, and Sarah Whitcomb Foss.[93] Lidskog left the Clue Crew in 2004, and Jon Cannon and Kelly Miyahara took over her position in 2005.[95] Farrell recorded clues until October 2008,[96] and Cannon until July 2009.[97] Miyahara, who also served as announcer for the Sports Jeopardy! spin-off series, left in 2019.[98][99]\n\nThe Clue Crew was eliminated beginning with the 39th season in September 2022; Foss became a producer for the show and McGuire a stage manager.[98] Foss also serves as in-studio announcer when Johnny Gilbert is unable to attend a taping. In such cases, her voice is replaced with Gilbert's in post-production.[100]\n\nThe Clue Crew traveled to over 300 cities worldwide, spanning all 50 of the United States and 46 other countries. Occasionally, they visited schools to showcase the educational game Classroom Jeopardy![101]\n\nProduction staff [ edit ]\n\nRobert Rubin served as the producer of the original Jeopardy! series for most of its run and later became its executive producer.[102] Following Rubin's promotion, the line producer was Lynette Williams.[102]\n\nGriffin was the daily syndicated version's executive producer until his retirement in 2000. Trebek served as producer as well as host until 1987, when he began hosting NBC's Classic Concentration for the next four years. At that time, he handed producer duties to George Vosburgh, who had formerly produced The All-New Jeopardy! In 1997, Harry Friedman, Lisa Finneran (now known as Lisa Broffman), and Rocky Schmidt succeeded Vosburgh as producers of the show. Beginning in 1999, Friedman became executive producer,[104] and Gary Johnson became the third producer. In 2006, Deb Dittmann and Brett Schneider became producers, while Finneran, Schmidt, and Johnson were promoted to supervising producers. Johnson left the show in 2011, while the other producers remained until Sarah Whitcomb Foss took over all producer duties following the Clue Crew's 2022 disbanding.[102]\n\nThe original Jeopardy! series was directed at different times by Bob Hultgren, Eleanor Tarshis, and Jeff Goldstein.[102] Dick Schneider, who directed episodes of The All-New Jeopardy!, returned as director from 1984 to 1992. He was then succeeded by his associate director, Kevin McCarthy, who served until his retirement in 2018. After McCarthy's departure, he was succeeded by Clay Jacobsen,[105] who served through 2022. Jacobsen was then succeeded by Russell Norman near the end of Season 38, though some episodes beginning in Season 39 are directed by Lucinda Owens Margolis instead.[106]\n\nAs of 2022, Jeopardy! employs seven full-time writers and seven researchers to create and assemble the categories and clues.[d] Billy Wisse is the editorial producer and Michele Loud is the editorial supervisor.[106] Previous writing and editorial supervisors have included Jules Minton, Terrence McDonnell, Harry Eisenberg, and Gary Johnson.[102] Trebek himself also contributed to writing clues and categories.[108]\n\nNaomi Slodki is the production designer for the program.[106] Previous art directors have included Henry Lickel, Dennis Roof, Bob Rang,[102] and Ed Flesh (who also designed sets for other game shows such as The $25,000 Pyramid, Name That Tune, and Wheel of Fortune).[110]\n\nOn August 1, 2019, SPT announced that Friedman would retire as executive producer of both Jeopardy! and Wheel of Fortune at the end of the 2019–20 season;[111] Mike Richards replaced Friedman in 2020.[112] On August 31, 2021, after Richards had resigned as host earlier in the month, SPT fired him from his executive producer position at both Jeopardy! and Wheel, citing continued internal turmoil that Richards's resignation as host had failed to quell as they had hoped. Michael Davies from Embassy Row, which produces the 2021 revival of the American version of another Sony game show, Who Wants to Be a Millionaire,[e] became interim executive producer[113] through the 2021–22 season,[78] then permanent executive producer on April 14, 2022.[114]\n\nProduction [ edit ]\n\nThe daily syndicated version of Jeopardy! is produced by Sony Pictures Television[c] (previously known as Columbia TriStar Television, the successor company to original producer Merv Griffin Enterprises).[115] The copyright holder is Jeopardy Productions, which, like SPT, operates as a subsidiary of Sony Pictures Entertainment.[116] The rights to distribute the program worldwide are owned by CBS Media Ventures,[f] which absorbed original distributor King World Productions in 2007.[117] However, in November 2024, CBS was sued by Sony, alleging that the company was engaging in preferential treatment of CBS-owned programming that prevented it from meeting its obligations to maximize the value of Wheel and Jeopardy! on the syndication market. The company cited the bundling of lower-rated CBS shows with Wheel and Jeopardy! (such as The Drew Barrymore Show and Hot Bench), prioritizing the clearance of its wholly owned shows (such as Entertainment Tonight) on the highest-rated stations in markets at the expense of the game shows, and laying off their dedicated marketing teams during layoffs associated with the CBS/Viacom merger. Furthermore, a secondary charge was that CBS had given preferential treatment to their Australian network in offering a new Australian revival of Wheel to their own network. Sony argued that the cutbacks had \"kneecapped its ability to meet its contractual obligations\".[118] A California judge initially ruled in favor of Sony, allowing the studio to assume distribution rights. However, that ruling was temporarily paused on appeal, leaving Wheel and Jeopardy! with CBS in the interim.[119]\n\nThe original Jeopardy! series was taped in Studio 6A at NBC Studios at 30 Rockefeller Plaza in New York City,[120] and The All-New Jeopardy! was taped in Studio 3 at NBC's Burbank Studios at 3000 West Alameda Avenue in Burbank, California. The Trebek version was initially taped at Metromedia Stage 7, KTTV, on Sunset Boulevard in Hollywood, but moved its production facilities to Hollywood Center Studios' Stage 1 in 1985. In 1994 the Jeopardy! production facilities moved to Sony Pictures Studios' Stage 10 on Washington Boulevard in Culver City, California, where production has remained since. Stage 10 was dedicated in Trebek's honor when episodes for the 38th season began taping in August 2021, with the stage being renamed to \"The Alex Trebek Stage\", with help from the Trebek family (Alex's wife, Jean, son, Matthew, and daughters, Emily and Nicky).[122]\n\nOn January 13, 2025, it was announced that Jeopardy! would suspend production due to the January 2025 Southern California wildfires in the Southern California region, where the show is filmed. Taping resumed shortly thereafter once the fires were extinguished.[123]\n\nFive episodes are taped each day, with two days of taping every other week.[124] However, taping slowed after Alex Trebek's health issues began in March 2019; during that time, some weeks had three episodes taped within a single day, while some had two episodes taped within a single day. This altered schedule lasted until Trebek's last taping day on October 29, 2020 (he died ten days later on November 8, 2020, prior to the next scheduled taping).[125]\n\nSet [ edit ]\n\nVarious sets used by the syndicated version over the years. From top to bottom: 1984–85, 1985–91, 1991–96, 1996–2002, 2002–09, and 2009–13.\n\nVarious technological and aesthetic changes have been made to the Jeopardy! set over the years. The original game board was exposed from behind a curtain and featured clues printed on cardboard pull cards which were revealed as contestants selected them. The All-New Jeopardy!'s game board was exposed from behind double-slide panels and featured pull cards with the dollar amount in front and the clue behind it. When the Trebek version premiered in 1984, the game board used individual television monitors for each clue within categories. The original monitors were replaced with larger and sleeker ones in 1991. In 2006, these monitors were discarded in favor of a nearly seamless projection video wall,[127] which was replaced in 2009 with 36 high-definition flat-panel monitors manufactured by Sony Electronics.[128] The game board was finally refurbished for season 41 in 2024, replacing the individual monitors board with a singular electronic screen, similar to the upgraded Wheel of Fortune puzzle board introduced in 2022.[129]\n\nFrom 1985 to 1997, the sets were designed to have a background color of blue for the Jeopardy! round and red for the Double Jeopardy! and Final Jeopardy! rounds. In 1991, the show introduced a brand new set that resembled a grid. On the episode aired November 11, 1996, Jeopardy! introduced the first of several sets designed by Naomi Slodki, who intended the set to resemble \"the foyer of a very contemporary library, with wood and sandblasted glass and blue granite\".\n\nIn 2002, another new set was introduced, which was given slight modifications when Jeopardy! and sister show Wheel of Fortune transitioned to high-definition broadcasts in 2006.[127] During this time, virtual tours of the set began to be featured on the official web site.[132] The various HD improvements for Jeopardy! and Wheel represented a combined investment of approximately $4 million, 5,000 hours of labor, and 6 miles (9.7 km) of cable.[127] Both programs had been shot using HD cameras for several years before beginning to broadcast in HD. On standard-definition television broadcasts, episodes continue displaying with an aspect ratio of 4:3.\n\nIn 2009, Jeopardy! updated its set once again. The new set debuted with special episodes taped at the 42nd annual International CES technology trade show, hosted at the Las Vegas Convention Center in Winchester (Las Vegas Valley), Nevada, and became the primary set for Jeopardy! when the 2009–2010 season began.[128]\n\nIn 2013, Jeopardy! introduced another new set.[133] This set underwent several modifications in 2020, with a wider studio without any studio audience (the last episodes of the 2019–2020 season were also taped without an audience), and new lecterns for contestants and the host. The lecterns are spaced considerably apart to comply with California state regulations imposed when filming resumed after the COVID-19 pandemic ended the 2020 season early.[134] Although the modified COVID-era set from the previous two seasons was kept, the live studio audience fully returned for season 39, which began airing on September 12, 2022.[135]\n\nTheme music [ edit ]\n\nSince the debut of Jeopardy! in 1964, several songs and arrangements have been used as the theme music, most of which were composed by Griffin. The main theme for the original Jeopardy! series was \"Take Ten\",[136] composed by Griffin's wife Julann.[137] The All-New Jeopardy! opened with \"January, February, March\" and closed with \"Frisco Disco\", both of which were composed by Griffin himself.[138]\n\nThe best-known theme song on Jeopardy! is \"Think!\", originally composed by Griffin under the title \"A Time for Tony\", as a lullaby for his son.[139] \"Think!\" has always been used for the 30-second period in Final Jeopardy! when the contestants write down their responses, and since the syndicated version debuted in 1984, a rendition of that tune has been used as the main theme song. \"Think!\" has become so popular that it has been used in many different contexts, from sporting events to weddings; \"its 30-second countdown has become synonymous with any deadline pressure\".[142] Griffin estimated that the use of \"Think!\" had earned him royalties of over $70 million throughout his lifetime.[143] \"Think!\" led Griffin to win the Broadcast Music, Inc. (BMI) President's Award in 2003,[144] and during GSN's 2009 Game Show Awards special, it was named \"Best Game Show Theme Song\".[145] In 1997, the main theme (later rearranged in 2001) and Final Jeopardy! \"Think!\" cue were rearranged by Steve Kaplan, who served as music director until his December 2003 death.[146] Then in 2008, the Jeopardy! music package was rearranged again, this time by Chris Bell Music & Sound Design.[147] A fully synthesized version of the main theme, which is based on the 2008 arrangement, was composed by Bleeding Fingers Music and has been used since 2021.[148]\n\nAudition process [ edit ]\n\nFor the original Jeopardy! series, prospective contestants contacted the production office in New York to arrange an appointment and to preliminarily determine eligibility. They were briefed and auditioned together in groups of ten to thirty individuals, participating in both a written test and mock games. Individuals who were successful at the audition were invited to appear on the program within approximately six weeks.\n\nSince 1984, prospective contestants begin with a written exam comprising 50 questions.[150] This exam is administered online periodically, as well as being offered at regional contestant search events. Since 1998, a Winnebago recreational vehicle dubbed the \"Jeopardy! Brain Bus\" travels to conduct regional events throughout the United States and Canada. Participants who correctly answer at least 35 out of 50 questions advance in the audition process and are invited to attend in-person group auditions throughout the country. At these auditions, a second written exam is administered, followed by a mock game and interviews. Those who are approved are notified at a later time and invited to appear as contestants.[152]\n\nContestants are required to travel to the production location (Culver City, California, since 1994), making travel and lodging arrangements at their own expense when doing so. According to Andy Saunders, creator of The Jeopardy! Fan website, \"This has been a longstanding Jeopardy! policy and has generally been presented as an issue of fairness by the show. A 1994 Oakland Tribune article quotes then–contestant coordinator Kelley Carpenter as saying, 'Because we have both out-of-towners and locals appearing on the show, if we were to pay for an airfare and a hotel, we would have technically given away money to some contestants coming from the East Coast, which wouldn't be fair to someone who only lives 20 minutes away.'\"[153] Contestants are remunerated, however, if they are returning champions, invited back because of a production infraction, or taping of tournaments for returning players. These situations apply when there is a break between taping sessions, Tournament of Champions, and related special tournaments. Eligibility is limited to people who have not previously appeared as contestants, and have not been to an in-person audition for at least 18 months.[152]\n\nMany of the contestants who appear on the series, including many Teen Tournament and College Championship contestants, participated in quiz bowl competitions during their time in high school. The National Academic Quiz Tournaments has been described by Ken Jennings as a de facto \"minor league\" for game shows such as Jeopardy![154]\n\nBroadcast history [ edit ]\n\nThe original Jeopardy! series premiered on NBC on March 30, 1964, and by the end of the 1960s was the second-highest-rated daytime game show, behind only The Hollywood Squares. The program was successful until 1974, when Lin Bolen, then NBC's Vice President of Daytime Programming, moved the show out of the noontime slot where it had been located for most of its run, as part of her effort to boost ratings among the 18–34 female demographic. After 2,753 episodes, the original Jeopardy! series ended on January 3, 1975. To compensate Griffin for its cancellation, NBC purchased Wheel of Fortune, another show that he had created, and premiered it the following Monday. A syndicated edition of Jeopardy!, distributed by Metromedia and featuring many contestants who were previously champions on the original series, aired in primetime from 1974 to 1975. The NBC daytime series was later revived as The All-New Jeopardy!, which premiered on October 2, 1978,[159] and aired 108 episodes, ending on March 2, 1979.[160] This revival featured significant rule changes, including progressive elimination of contestants over the course of the main game, and a Super Jeopardy! bonus round (based loosely on bingo) instead of Final Jeopardy!\n\nThe daily syndicated version debuted on September 10, 1984, and was launched in response to the success of the syndicated version of Wheel and the installation of electronic trivia games in pubs and bars. This version of the program has outlived 300 other game shows and has become the second most popular game show in syndication (behind Wheel), averaging 25 million viewers per week. The most recent renewal, in January 2023, extends it through the 2027–28 season.[164]\n\nCountries with versions of Jeopardy! listed in yellow (and the common Arabic-language version in bright yellow)\n\nJeopardy! has spawned versions in many foreign countries throughout the world, including the United Kingdom, Germany, Sweden, Russia, Denmark, Israel, and Australia. The American syndicated version of Jeopardy! is also broadcast throughout the world, with international distribution rights handled by CBS Studios International.[166]\n\nFour spin-off versions of Jeopardy! have been created. Rock & Roll Jeopardy! debuted on VH1 in 1998 and ran until 2001. The format centered around post-1950s popular music trivia and was hosted by Jeff Probst. Jep!, which aired on GSN during the 1998–1999 season, was a special children's version hosted by Bob Bergen and featured various rule changes from the original version.[168] Sports Jeopardy!, a sports-themed version hosted by Dan Patrick, premiered in 2014 on the Crackle digital service and eventually moved to the cable sports network NBCSN in 2016.[169] In 2024, Pop Culture Jeopardy! premiered as an exclusive show on Amazon Prime Video. Hosted by Colin Jost, it featured three teams of three participating in a single-elimination tournament where the winning team earned a $300,000 grand prize ($100,000 per player) and three spots in the Tournament of Champions. Categories were geared more toward \"pub trivia\"-style knowledge.\n\nIn March 2020, taping halted as a result of the COVID-19 pandemic. Originally, the production team taped episodes without an audience, until production was shut down altogether. In May 2020, Sony announced new episodes would air until June 12, 2020, including the Teachers Tournament.[170][171] In July 2020, Jeopardy! began rerunning a package of 20 classic episodes, including the first two from the syndicated run.[172]\n\nProduction resumed in August 2020 with new safety measures in place following government guidelines to protect contestants, staff, crew and talent. New expanded lecterns, designed to allow social distancing during gameplay, are spaced apart from one another.[173] In seasons 37–38, only essential staff and crew were allowed on stage. Personal protective equipment is provided for everyone behind the scenes and all staff and crew are tested regularly, while contestants are also tested before they step onto the set. Social distancing measures are also enforced off-stage.[174] Ken Jennings joined production in an on-air role in 2020.[175]\n\nFollowing Trebek's death, an announcement noted that the pre-taped episodes were to air posthumously until December 25, 2020.[176][177] Owing to concerns after a late start to tapings caused by the pandemic and the cancellation of November tapings, officials added a two-week lineup of classic episodes to avoid NFL, NBA, or local Christmas programming preemptions that moved Trebek's final episode to January 8, 2021. The first episode with an interim host aired January 11, 2021.\n\nArchived episodes [ edit ]\n\nOnly a small number of episodes survive from Fleming's run as host of Jeopardy!. From the original NBC daytime version, archived episodes mostly consist of black-and-white kinescopes of the original color videotapes. Various episodes from 1967, 1971, 1973, and 1974 are listed among the holdings of the UCLA Film and Television Archive.[179] The 1964 \"test episode\", Episode No. 2,000 (from February 21, 1972, in color), and a June 1975 episode of the weekly syndicated edition exist at the Paley Center for Media.[180] The test episode, of which only a few limited clips had been released, was released to the public in full on the Jeopardy! YouTube account March 30, 2022, and an audiotape containing approximately five minutes (including introductions and Final Jeopardy!) from the first aired episode was also released to the public; both episodes were released to celebrate the 58th anniversary of the show's debut.[181][182] The 1975 series finale, also in color and containing two short clips from the 1967 \"College Scholarship Tournament\" and Gene Shalit's appearance on an early version of Celebrity Jeopardy! also exists in its entirety. Incomplete paper records of the NBC-era games exist on microfilm at the Library of Congress. GSN holds The All-New Jeopardy!'s premiere and finale in broadcast quality, and aired the latter on December 31, 1999, as part of its \"Y2Play\" marathon.[160] The UCLA Archive holds a copy of a pilot taped for CBS in 1977,[179] and the premiere exists among the Paley Center's holdings.[180]\n\nGSN, which, like Jeopardy!, is an affiliate of Sony Pictures Television, has rerun episodes since the channel's launch in 1994. Copies of 43 Trebek-hosted syndicated Jeopardy! episodes aired between 1989 and 2004 have been collected by the UCLA Archive,[179] and the premiere and various other episodes are included in the Paley Center's collection.[180] In July 2022, Vulture reported that vintage episodes of the daily syndicated version would air on a dedicated channel on Pluto TV (owned by distributor Paramount Global) beginning in August.[183] The channel, named Jeopardy! Hosted by Alex Trebek, launched on August 1[184] and ended on July 31, 2024 after a two-year run.[185]\n\nReception and legacy [ edit ]\n\nAlex Trebek with the Peabody Award, 2012\n\nBy 1994, the press called Jeopardy! \"an American icon\".[186] It has won a record 45 Daytime Emmy Awards.[187] The program holds the record for the Daytime Emmy Award for Outstanding Game/Audience Participation Show, with nineteen awards won in that category.[188] Trebek won eight awards for Outstanding Game Show Host.[188] Twelve other awards were won by the show's directors and writers in the categories of Outstanding Direction for a Game/Audience Participation Show and Outstanding Special Class Writing before these categories were removed in 2006. On June 17, 2011, Trebek shared the Lifetime Achievement Award with Sajak at the 38th Annual Daytime Emmy Awards ceremony.[189] The following year, the program was honored with a Peabody Award for its role in encouraging, celebrating, and rewarding knowledge.[190]\n\nIn its April 17–23, 1993, issue, TV Guide named Jeopardy! the best game show of the 1970s as part of a celebration of the magazine's 40th anniversary.[191] In January 2001, the magazine ranked the program number 2 on its \"50 Greatest Game Shows\" list—second only to The Price Is Right.[192] It later ranked Jeopardy! number 45 on its list of the 60 Best TV Series of All Time, calling it \"habit-forming\" and saying that the program \"always makes [its viewers] feel smarter\".[193] Also in 2013, the program ranked number 1 on TV Guide's list of the 60 Greatest Game Shows.[194] In the summer of 2006, the program was ranked number 2 on GSN's list of the 50 Greatest Game Shows of All Time, second only to Match Game.[195]\n\nA hall of fame honoring Jeopardy! was added to the Sony Pictures Studios tour on September 20, 2011. It features the show's Emmy Awards as well as retired set pieces, classic merchandise, video clips, photographs, and other memorabilia related to Jeopardy!'s history.[196]\n\nIn 1989, original host Art Fleming expressed dissatisfaction with the daily syndicated Jeopardy! series in an essay published in Sports Illustrated. He confessed that he only watched the Trebek version infrequently—only for a handful of questions—and criticized this iteration mainly for its Hollywood setting. Fleming believed that in contrast to New Yorkers who Fleming considered being more intelligent and authentic, moving the show to Hollywood brought both an unrealistic glamour and a dumbing-down of the program that he disdained. He also disliked the decision to not award losing contestants their cash earnings (believing the parting gifts offered instead were cheap) and expressed surprise that what he considered a parlor game had transformed into such a national phenomenon under Trebek.[197] In television interviews, Fleming expressed similar sentiments while also noting that he approved of Trebek's approach to hosting, that Fleming and Trebek were personal friends and that, despite the modern show's flaws, it was still one of the best television shows.[198]\n\nJeopardy!'s answer-and-question format has become widely entrenched: Fleming observed that other game shows had contestants phrasing their answers in question form, leading hosts to remind them that they are not competing on Jeopardy!\n\nTournaments and other events [ edit ]\n\nRegular events [ edit ]\n\nThroughout all forms of the show, it has held an annual Tournament of Champions featuring the top champions who have appeared on the show since the last tournament. During Fleming's hosting run, tournament prizes were awarded in the same manner as regular play, with the only bonuses being a trophy or a non-cash prize;[200][201] when the series returned in 1984, the top prize awarded to the winner was originally valued at $100,000, and increased to $250,000 in 2003.[202] Other regular tournaments include the Teen Tournament, with a $100,000 top prize;[166] the College Championship, in which undergraduate students from American colleges and universities compete for a $100,000 top prize; and the Teachers Tournament, where educators compete for a $100,000 top prize.[203] Each tournament runs for ten consecutive episodes in a format devised by Trebek himself, consisting of five quarter-final games, three semi-finals, and a final consisting of two games with the scores totaled. Winners of the College Championship and Teachers Tournament are invited to participate in the Tournament of Champions.\n\nNon-tournament events held regularly on the show include Celebrity Jeopardy!, in which celebrities and other notable individuals compete for charitable organizations of their choice, and Kids Week, a special competition for school-age children aged 10 through 12.[205]\n\nSpecial events [ edit ]\n\nThree International Tournaments, held in 1996, 1997, and 2001, featured one-week competitions among champions from each of the international versions of Jeopardy! Each of the countries that aired their own version of the show in those years could nominate a contestant. The format was identical to the semi-finals and finals of other Jeopardy! tournaments. The top prize was $25,000 in 1996 and 1997, and $50,000 in 2001. The 1997 tournament was recorded in Stockholm on the set of the Swedish version of Jeopardy!―the first time a week of Jeopardy! episodes was taped in a foreign country― and its first episode was introduced by that version's then-host, Magnus Härenstam.\n\nThere have been several special tournaments featuring the greatest contestants in Jeopardy! history. The first was Super Jeopardy!, aired in 1990 on ABC, where 35 top contestants from the previous seasons of the Trebek version and one champion from the original Jeopardy! series competed for a top prize of $250,000. This was followed in later years by the Tenth Anniversary Tournament in 1993; the Million Dollar Masters tournament (taking place at Radio City Music Hall) in 2002; the 15-week Ultimate Tournament of Champions (featuring 145 former champions competing against one another, followed by a three-game final between two winners and Ken Jennings for $2,000,000) in 2005; and the 30th-anniversary Battle of the Decades tournament in 2014.[208] In 2020, Jeopardy! returned to ABC primetime for the Greatest of All Time tournament where Jennings, Brad Rutter, and James Holzhauer competed in four two-game matches for a $1,000,000 prize,[209] with Jennings as the victor.[210]\n\nThe IBM Challenge aired in February 2011 and featured IBM's Watson computer facing off against Ken Jennings and Brad Rutter in a two-game match played over three shows.[211] This was the first man-vs.-machine competition in Jeopardy!'s history.[212] Watson won both the first game and the overall match to win the grand prize of $1 million, which IBM divided between two charities (World Vision International and World Community Grid).[213] Jennings, who won $300,000 for second place, and Rutter, who won the $200,000 third-place prize, both pledged to donate half of their winnings to charity.[214] The competition brought the show its highest ratings since the Ultimate Tournament of Champions.[215]\n\nIn 2019, The All-Star Games had six teams with three former champions each. Each team member played one of the three rounds in each game played; Rutter, David Madden and Larissa Kelly won the tournament.[216]\n\nRecord holders [ edit ]\n\nJeopardy!'s record for the longest winning streak is held by Ken Jennings, who competed on the show from June 2 through November 30, 2004, winning 74 matches before being defeated by Nancy Zerg in his 75th appearance. He amassed $2,522,700 over his 75 episodes, for an average of $33,636 per episode. At the time, he held the record as the highest money-winner ever on American game shows. His winning streak increased the show's ratings and popularity to the point where it became TV's highest-rated syndicated program[218] and second highest-rated overall program, behind only CSI. In addition to these winnings on the daily Jeopardy! series, Jennings returned for a number of special tournaments, taking home the following: the second-place prize of $500,000 in the 2005 Ultimate Tournament of Champions, the $300,000-second-place prize in the 2011 IBM Challenge, the $123,600-second-place prize in the 2014 Battle of the Decades, a $100,000 prize (one-third of the $300,000-second-place prize to his three-player team) in the 2019 All-Star Games,[219] and the $1,000,000 first-place prize in the 2020 Greatest of All Time tournament.\n\nThe record holder for lifetime Jeopardy!-related winnings is Brad Rutter, who has won nearly $5.2 million in cash and prizes across his original five episodes of the regular series and seven subsequent tournaments and events (five of which he won).[220] Counting all prizes that Rutter has won, he has achieved a cumulative total of $5,129,036 in winnings, which included: the $55,102 prize over five regular episodes in 2000 (also including the value of two cars won, worth $45,000), the $100,000 first-place prize in the 2001 Tournament of Champions,[221] the $1 million first-place prize in 2002's Million Dollar Masters Tournament, the $2 million first-place prize (plus $115,000 in preliminary rounds) in the Ultimate Tournament of Champions,[222] the $200,000 third-place prize in the IBM Challenge, the $1,030,600 first-place prize in the Battle of the Decades, $333,334 (one-third of the $1,000,000 first-place prize, shared with his three-player team) in the All-Star Games, and a $250,000 prize in the Greatest of All Time tournament.\n\nThe holder of the all-time record for single-day winnings on Jeopardy! is James Holzhauer. Holzhauer first surpassed the record of $77,000, held since 2010[223] by Roger Craig, when he earned $110,914 on the episode that aired on April 9, 2019.[224] Holzhauer pushed his own single-day record to $131,127 on the episode that aired April 17, 2019,[225] by amassing $71,114 over the episode's first two rounds, then successfully wagering an additional $60,013 in Final Jeopardy! Holzhauer's total of 32 consecutive games won was second place of all time in regular game play at the time and remains fourth overall after Matt Amodio and Amy Schneider surpassed Holzhauer in 2021 and 2022, respectively.[226] When he departed the show, he held the top 16 spots for highest single-day regular-game winnings and is the only player to win more than $100,000 in a single episode in regular play (achieved six times).[227] On April 15, 2019, Holzhauer moved into second place for regular play winnings (behind Jennings) and third place for all Jeopardy!-related winnings (behind Rutter and Jennings). On April 23, 2019, Holzhauer joined Rutter and Jennings as the third Jeopardy!-made millionaire (Amodio eventually became the fourth). The next day, Holzhauer moved onto the top ten list for all-time American game show winnings at No. 10, joining Rutter (#1) and Jennings (#2) on that list. Holzhauer was defeated on the June 3, 2019, episode, finishing in second place.[228] His winnings on Jeopardy! totaled $2,464,216,[229] $58,484 behind Jennings' record.[228] Including over $58,000 from a 2014 appearance on The Chase,[230] with Holzhauer's $2.96 million from Jeopardy! (including his Tournament of Champions and The Greatest of All Time prizes), he is #3 on the list of all-time American game show winnings.\n\nThe record-holder among women on Jeopardy! for regular series winnings is Amy Schneider,[231] with a total of $1,382,800 earned in 40 episodes between 2021 and 2022.[232][233][226] Schneider is currently ranked second all-time in consecutive games won, behind only Jennings (74).[234][235][226] Mattea Roach, whose winning streak earned $560,983 over 23 games in April and May 2022, has been the most successful Canadian contestant to have competed on the program, ranking fifth for consecutive games won and sixth for regular play Jeopardy! winnings.[236][226]\n\nThe highest single-day winnings in a Celebrity Jeopardy! tournament was achieved by comedian Andy Richter during a first-round game of the 2009–10 \"Million Dollar Celebrity Invitational\", in which he finished with $68,000 for his selected charity, the St. Jude Children's Research Hospital.[237]\n\nFour contestants on the Trebek version share the record for winning a game with the lowest amount possible, at $1. The first was U.S. Air Force Lieutenant Colonel Darryl Scott, on the episode that aired January 19, 1993.[238][239] The second was Benjamin Salisbury, on a Celebrity Jeopardy! episode that aired April 30, 1997.[241] The third was Brandi Chastain, on the Celebrity Jeopardy! episode that aired February 9, 2001.[242] The fourth was U.S. Navy Lieutenant Manny Abell, on the episode that aired October 17, 2017.[239]\n\nThe record lowest Jeopardy! score was set in 1985 by Joan Kantor, a contestant from 1985, with a score of -$5,100 (net -$10,200 after the Season 18 rule change regarding clue values on November 26, 2001) during Season 1.[243] During the interregnum, in a July 28, 2021 episode hosted by LeVar Burton, Patrick Pierce finished with a total of -$7,400.[243] The lowest score in the Jennings era is -$7,200, set by Erin Buker in 2024,[245] and the fourth lowest was -$6,800, set by Stephanie Hull in 2015.[246] Hull's episode was also notable for featuring a rare Final Jeopardy with one contestant.[247]Jeopardy! writer Harry Eisenberg recalled an early season contestant who had persuaded the contestant coordinators to let him on the show despite their misgivings; he won -$3,400, the equivalent of -$6,800 today.[248]\n\nRecord tables [ edit ]\n\nJeopardy! keeps track of four records: most consecutive games won, highest regular-season winnings, highest single-game winnings, and highest all-time winnings (including tournaments). The below tables are accurate as of July 25, 2025.[249]\n\nOther media [ edit ]\n\nPortrayals and parodies [ edit ]\n\nJeopardy! has been featured in numerous films, television shows, and books over the years, mostly with one or more characters participating as contestants, or viewing and interacting with the game show from their own homes. During Trebek's lifetime, several television series featured primary characters participating in fictionalized versions of the show, including Cheers (in the episode \"What Is... Cliff Clavin?\"), The Golden Girls,[251] Mama's Family,[252] Family Guy,[253] and The Simpsons,[254] among others. Wherever Trebek appeared on those fictionalized versions, he would always play himself or provide his own voice.\n\nFrom 1996 to 2002, then on special occasions until 2015, Saturday Night Live featured a recurring Celebrity Jeopardy! sketch in which Trebek, portrayed by Will Ferrell, has to deal with the exasperating ineptitude of the show's celebrity guests and the constant taunts of antagonists Sean Connery (played by Darrell Hammond) and Burt Reynolds (Norm Macdonald).[256] Beginning in 2014, SNL parodied Jeopardy! by way of another recurring sketch, Black Jeopardy!, in which the host and two of the three contestants are stereotypical black Americans, with the third contestant providing a contrast to the others, and the categories and clues likewise reflect black American culture.[258]\n\nThe 1992 film White Men Can't Jump features a subplot in which the character Gloria Clemente (Rosie Perez) passes the auditions and competes on the program. In the David Foster Wallace short story \"Little Expressionless Animals\", first published in The Paris Review and later reprinted in Wallace's collection Girl with Curious Hair, a character competes and wins on 700 consecutive Jeopardy! programs in three years, and then uses her winnings to pay for the care of her brother, who has autism.[261] American musician \"Weird Al\" Yankovic satirized the 1960s incarnation of the show with his 1984 single \"I Lost on Jeopardy\", a parody of Greg Kihn's 1983 hit song \"Jeopardy\". Released months before the Trebek version premiered, the song's accompanying music video featured a re-creation of the set of the era, along with cameos from Fleming, Pardo and, at the end of the video, Kihn himself.[263]\n\nAt the DEF CON hacker conference in Las Vegas, a variant called 'Hacker Jeopardy' has been organized.[264] In 2004, it was won by Kevin Mitnick.[265]\n\nMerchandise [ edit ]\n\nOver the years, the Jeopardy! brand has been licensed for various products. From 1964 through 1976, with one release in 1982, Milton Bradley issued annual board games based on the original Fleming version. The Trebek version has been adapted into board games released by Pressman Toy Corporation, Tyco Toys, and Parker Brothers.[266] In addition, Jeopardy! has been adapted into a number of video games released on various consoles and handhelds spanning multiple hardware generations, starting with a Nintendo Entertainment System game released in 1987.[267] The show has also been adapted for personal computers (starting in 1987 with Apple II, Commodore 64, and MS-DOS versions[268]), Facebook,[269] Twitter, Android, and the Roku Channel Store.[270]\n\nA DVD titled Jeopardy!: An Inside Look at America's Favorite Quiz Show, released by Sony Pictures Home Entertainment on November 8, 2005, features five curated episodes of the Trebek version (the 1984 premiere, Jennings' final game, and the three-game finals of the Ultimate Tournament of Champions)[271] and three featurettes discussing the show's history and question selection process.[272] Other products featuring the Jeopardy! brand include a collectible watch, a series of daily desktop calendars, and various slot machine games for casinos and the Internet.\n\nOn July 22, 2024, Jean Trebek and Ken Jennings officially unveiled an Alex Trebek stamp based on the show, officially licensed by the program.[273][274]\n\nInternet [ edit ]\n\nJeopardy!'s official website, active as early as 1998,[275] receives over 400,000 monthly visitors. The website features videos, photographs, and other information related to each week's contestants, as well as mini-sites promoting remote tapings and special tournaments. The Jeopardy! website is regularly updated to align with producers' priorities for the show.[277] In its 2012 \"Readers Choice Awards\", About.com praised the official Jeopardy! website for featuring \"everything [visitors] need to know about the show, as well as some fun interactive elements\", and for having a humorous error page.[278]\n\nIn November 2009, Jeopardy! launched a viewer loyalty program called the \"Jeopardy! Premier Club\", which allowed home viewers to identify Final Jeopardy! categories from episodes for a chance to earn points, and play a weekly Jeopardy! game featuring categories and clues from the previous week's episodes. Every three months, contestants were selected randomly to advance to one of three quarterly online tournaments; after these tournaments were played, the three highest-scoring contestants would play one final online tournament for the chance to win $5,000 and a trip to Los Angeles to attend a taping of Jeopardy![279] The Premier Club was discontinued by July 2011.[280]\n\nSee also [ edit ]\n\nNotes [ edit ]\n\n^ As Merv Griffin Productions from 1964 to 1979. ^ As Columbia TriStar Domestic Television from 2001 to 2002. a b c As Sony Pictures Television Studios from 2020 to 2023. ^ [ 102 ] This number has varied over the years, with writers ranging in number from five to ten and researchers from four to seven. ^ Millionaire owner Sony acquiredowner 2waytraffic in 2008. However, at the time of the purchase, the American version was distributed by distributor Paramount's rival Disney–ABC Domestic Television ^ As CBS Television Distribution from 2007 to 2021.\n\nReferences [ edit ]\n\nCitations\n\nBibliography", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/20px-Symbol_support_vote.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Jeopardy_%28Sony_Pictures_Television%29_logo.webp/250px-Jeopardy_%28Sony_Pictures_Television%29_logo.webp.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Merv_Griffin.jpg/250px-Merv_Griffin.jpg", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Mike_Richards_%28Television_Personality%29%2C_Valder_Beebe_Show_%28January_2017%29.jpg/120px-Mike_Richards_%28Television_Personality%29%2C_Valder_Beebe_Show_%28January_2017%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Harry_Friedman_holding_Peabody_Award_2012.jpg/120px-Harry_Friedman_holding_Peabody_Award_2012.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Alex_Trebek_at_the_71st_Annual_Peabody_Awards_%28cropped%29.jpg/120px-Alex_Trebek_at_the_71st_Annual_Peabody_Awards_%28cropped%29.jpg", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Kelly_Miyahara.jpg/250px-Kelly_Miyahara.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Ken_Jennings_cropped_retouched.jpg/120px-Ken_Jennings_cropped_retouched.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Art_Fleming_in_1970.png/120px-Art_Fleming_in_1970.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Jgilbert_2008_cropped.png/120px-Jgilbert_2008_cropped.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Alex_Trebek_%287269139314%29.jpg/250px-Alex_Trebek_%287269139314%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/40px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Jeopardy_World_Locations.svg/250px-Jeopardy_World_Locations.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/John_Harlan_%28announcer%29.png/120px-John_Harlan_%28announcer%29.png", "https://upload.wikimedia.org/wikipedia/en/thumb/3/38/Jeopardy%21_set_evolution_%28daily_syndication%29.jpg/250px-Jeopardy%21_set_evolution_%28daily_syndication%29.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Gnome-mime-sound-openclipart.svg/60px-Gnome-mime-sound-openclipart.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Jeopardy%21_game_board_US.svg/330px-Jeopardy%21_game_board_US.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Gnome-mime-sound-openclipart.svg/20px-Gnome-mime-sound-openclipart.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Wiktionary-logo-en-v2.svg/40px-Wiktionary-logo-en-v2.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Mayim_Bialik%2C_March_2018_%284116%29_%28cropped%29.jpg/120px-Mayim_Bialik%2C_March_2018_%284116%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/2/28/Original_Jeopardy%21_Logo.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/20px-Symbol_category_class.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jeopardy!", "title": "Jeopardy!", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "viewport": "width=1120", "og": {"title": "Jeopardy! - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}