{"url": "www.mirror.co.uk/3am/celebrity-news/look-love-katie-holmes-jamie-11927604", "text": "The look of love: Katie Holmes and Jamie Foxx pack on the PDA in rare public appearance at pre-Grammys gala\n\nThe couple only had eyes for each other as they stepped out together four months after finally going public\n\nKatie Holmes and Jamie Foxx looked like they wanted to eat each other for desert when they made a rare public appearance at a pre-Grammys bash on Saturday.\n\n‌\n\n\n\nThe couple - who finally went public with their secret four year romance in September - could barely take their eyes off each other at the star-studded party in NYC.\n\n‌\n\n\n\nKatie - who styled her recently shorn hair in a sleek bob - giggled like a schoolgirl as Jamie threw a protective arm around the back of her chair.\n\n‌\n\n\n\nAnd when they weren't staring at each other, they whispered sweet nothings behind their hands.\n\nAfter years of rumours, the duo confirmed their relationship four months ago, holding hands on a romantic Malibu beach stroll just months after her ‘dating ban’ from ex-husband Tom Cruise expired.\n\nKatie Holmes slips into tight black dress to support Jamie Foxx at New York launch event READ MORE :\n\nView 10 Images Look at them! (Image: Getty Images North America)\n\n‌\n\n\n\nView 10 Images Like two teenagers tittering behind the bike sheds (Image: Getty Images North America)\n\nView 10 Images Katie and Jamie only went public in September (Image: Getty Images North America)\n\n‌\n\n\n\nView 10 Images They are believed to have been dating for almost five years (Image: Getty Images North America)\n\nThese sneaky lovebirds had reportedly been ducking and diving since August 2013, when they apparently caught feelings at a charity bash in the Hamptons.\n\nThe pair was actually first introduced by Tom at a Washington Redskins game against the Minnesota Vikings in Landover, Maryland in 2006, after the blokes bonded on the set of 2004 movie, Collateral.\n\n‌\n\n\n\nView 10 Images The pair were introduced by Tom at a sports game in 2006 (Image: Getty Images North America)\n\nView 10 Images Katie held hands with Tom throughout the meeting (Image: Reuters)\n\nView 10 Images Tom and Jamie had bonded on the set of 2004 movie, Collateral (Image: Getty Images North America)\n\n‌\n\n\n\nBut it wasn’t until August 2013, 14 months after the collapse of her six-year marriage to Tom, that their friendship became something way more flirty, with the pair spotted enjoying an intimate dance at a charity benefit in The Hamptons.\n\nKatie let her hair down and rocked out to Jamie’s 2009 hit, Blame It (On the Alcohol), witnesses told People magazine, and they were later pictured looking seriously sweaty, with Katie’s arm draped around Jamie’s shoulders.\n\n‌\n\n\n\nBut with the Dawson’s Creek actress apparently subject to a five year public dating ban, these two needed to work out a way to throw everyone off the scent.\n\nStep one was for Jamie to go on the defensive, branding the gossip 'fake news' and labelling the dating reports 'hilarious'.\n\n‌\n\n\n\nView 10 Images After divorcing Tom, Katie was reportedly subjected to a five-year public dating ban (Image: Getty)\n\nStep two involved wigs, and plenty of them.\n\nUnable to dine at fancy restaurants like normal A-list folk, the pair reportedly resigned themselves to meeting up in the privacy of each others' homes, with Katie going incognito in a variety of disguises.\n\n‌\n\n\n\nIn September 2014 she moved back to Los Angeles from New York, presumably to be nearer to the actor and to make their romantic dinners and sleepovers a whole lot easier.\n\nBut the cat was out of the bag in March 2015 when a picture surfaced online of them holding hands in a recording studio.\n\nJamie immediately tried to dismiss it as just a friendly hangout, telling TMZ, \"Oh come on you guys have been trying to make that stick for three years, we're just friends.\n\n‌\n\n\n\n\"As a matter of fact Anthony Zuiker, creator of CSI, he offered us an animation project and we're working on that.”\n\n\"They have been trying to do that for three years - just stories I guess. You just have to respect - that's just part of our lives,” he also said.\n\nBut in May 2015, Katie got sloppy and was busted making a seriously soppy phone call to Jamie as she stepped off a flight from New York to LA.\n\n‌\n\n\n\n\"She called him the minute she got off her plane and said she loved him,\" an eyewitness told Us Weekly. \"She always gushes about how amazing he is. She says he brings joy into the world.”\n\nView 10 Images Was Tom the reason Jamie kept denying it? (Image: Getty)\n\nHowever, another unidentified pal conveniently surfaced, and tried to stem the tide by insisting there was nothing going on but the rent.\n\n‌\n\n\n\n\"This is not some intense romance. Jamie and Katie are friends and have been for a long time. They are two adults who are attractive and single, and so apparently conclusions will be drawn,\" the insider said.\n\nSadly, those declarations were trumped when yet another pal revealed that former ladies man Jamie “cut his roster” for Katie, and another confirmed things were even more serious, telling OK! magazine, \"They are using the L word.”\n\nPerhaps getting braver, December 2015 saw Katie attend Jamie’s surprise birthday party in NYC.\n\n‌\n\n\n\nView 10 Images Former ladies man Jamie reportedly 'cut his roster' for Katie (Image: Splash News and Pictures)\n\nBut the biggest slip-up came in June 2016, when Jamie’s friend, Real Housewives of Atlanta star, Claudia Jordan, blabbed, \"He is very happy with her. I like that he seems very happy.”\n\nShe quickly back-tracked though, telling Entertainment Tonight she had \"no knowledge of Jamie with Katie at all.”\n\nArticle continues below\n\n\"I've never seen them together. He's never told me he's dating her,” she said.\n\nIn April last year Katie and Jamie were pictured having dinner together in NYC, and they were spotted leaving a hotel in Paris and boarding the same private jet in May.", "images": ["http://www.mirror.co.uk/footer/trust-project.svg", "http://www.mirror.co.uk/footer/ipso.svg", "https://i2-prod.mirror.co.uk/article11927712.ece/ALTERNATES/s615b/Clive-Davis-and-Recording-Academy-Pre-GRAMMY-Gala-Inside.jpg", "https://i2-prod.mirror.co.uk/article11927709.ece/ALTERNATES/s1200/BESTPIX-Clive-Davis-and-Recording-Academy-Pre-GRAMMY-Gala-Inside.jpg", "https://i2-prod.mirror.co.uk/article11121613.ece/ALTERNATES/s615b/Minnesota-Vikings-v-Washington-Redskins.jpg", "https://i2-prod.mirror.co.uk/article3546919.ece/ALTERNATES/s615b/Katie-Holmes-and-Tom-Cruise.jpg", "https://i2-prod.mirror.co.uk/article11927710.ece/ALTERNATES/s615b/Clive-Davis-and-Recording-Academy-Pre-GRAMMY-Gala-Inside.jpg", "http://www.mirror.co.uk/nav-web-static/release-v41-14493b7c888038a7d89b99cb3a7937c2b71eaebe/public/logo-reach.png", "https://i2-prod.mirror.co.uk/article11927711.ece/ALTERNATES/s615b/1_Clive-Davis-and-Recording-Academy-Pre-GRAMMY-Gala-Inside.jpg", "https://i2-prod.mirror.co.uk/article11121639.ece/ALTERNATES/s615b/Tom-Cruise-Katie-Holmes-and-Jamie-Foxx-at-the-Minnesota-Vikings-vs-Washington-Redskins-September.jpg", "https://i2-prod.mirror.co.uk/article11927709.ece/ALTERNATES/s615b/BESTPIX-Clive-Davis-and-Recording-Academy-Pre-GRAMMY-Gala-Inside.jpg", "https://i2-prod.mirror.co.uk/article2683578.ece/ALTERNATES/s615b/Tom-Cruise-Katie-Holmes.jpg", "https://i2-prod.mirror.co.uk/article7386271.ece/ALTERNATES/s615b/Ashley-Cole-and-Jamie-Foxx-have-dinner-together-in-Beverly-Hills.jpg", "https://i2-prod.mirror.co.uk/article11121308.ece/ALTERNATES/s615b/Actors-Cruise-Holmes-and-Foxx-watch-before-the-Redskins-and-Minnesota-game-in-Landover.jpg", "http://www.mirror.co.uk/assets/mirror/logos/masthead-mirror-default.svg"], "top_img": "https://i2-prod.mirror.co.uk/article11927709.ece/ALTERNATES/s1200/BESTPIX-Clive-Davis-and-Recording-Academy-Pre-GRAMMY-Gala-Inside.jpg", "keywords": [], "authors": ["Frances Kindon"], "canonical_link": "https://www.mirror.co.uk/3am/celebrity-news/look-love-katie-holmes-jamie-11927604", "title": "The look of love: Katie Holmes and Jamie Foxx pack on the PDA in rare public appearance at pre-Grammys gala", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"page_id": 6149699161, "app_id": 123792601022133, "pages": 1814357575554395}, "description": "The couple only had eyes for each other as they stepped out together four months after finally going public", "author": "Frances Kindon", "robots": "noarchive, max-image-preview:large", "Googlebot-News": "noarchive", "referrer": "unsafe-URL", "keywords": "Claudia Jordan, Katie Holmes, Jamie Foxx, Tom Cruise, Washington Redskins, Minnesota Vikings, CSI, Birthday party, Private jets, Films", "news_keywords": "Claudia Jordan, Katie Holmes, Jamie Foxx, Tom Cruise, Washington Redskins, Minnesota Vikings, CSI, Birthday party, Private jets, Films", "allowTaboolaDeepDive": "true", "vf": {"00000000-0000-4000-8000-67e599051dc3": "mirror-prod-11927604"}, "og": {"title": "An adorable Katie Holmes and Jamie Foxx pack on PDA in rare public appearance", "description": "The couple only had eyes for each other as they stepped out together four months after finally going public", "url": "https://www.mirror.co.uk/3am/celebrity-news/look-love-katie-holmes-jamie-11927604", "site_name": "Daily Mirror", "locale": "en_GB", "image": "https://i2-prod.mirror.co.uk/article11927709.ece/ALTERNATES/s1200/BESTPIX-Clive-Davis-and-Recording-Academy-Pre-GRAMMY-Gala-Inside.jpg", "type": "article"}, "article": {"published_time": "2018-01-28T12:19:08Z", "modified_time": "2018-01-28T12:19:08Z", "author": "https://www.mirror.co.uk/authors/frances-kindon/", "section": "Celebrity News", "tag": "Films"}, "twitter": {"card": "summary_large_image", "site": "@DailyMirror", "creator": "@DailyMirror", "title": "The look of love: Katie Holmes and Jamie Foxx pack on the PDA in rare public appearance at pre-Grammys gala - The Mirror", "description": "The couple only had eyes for each other as they stepped out together four months after finally going public", "image": "https://i2-prod.mirror.co.uk/article11927709.ece/ALTERNATES/s1200/BESTPIX-Clive-Davis-and-Recording-Academy-Pre-GRAMMY-Gala-Inside.jpg"}}, "movies": [], "publish_date": 1517141948.0, "source": "http://www.mirror.co.uk", "summary": ""}