{"url": "https://tvline.com/2018/07/19/doctor-who-comic-con-season-11-jodie-whittaker/", "text": "Doctor Who will introduce its first-ever female Time Lord Doctor, played by Jodie Whittaker, this fall — but the character won't change too much.\n\n\"It's the Doctor you've known and loved, with just a fresh take,\" new showrunner Chris Chibnall said at the show's San Diego Comic-Con panel on Thursday. \"The Doctor is still very much The Doctor. But we need a pillar of hope, and that pillar of hope is Jodie Whittaker.\"\n\nThe actress won over the producers from the instant she walked into the audition room. \"It's one of those things [where] you don't know what you're looking for until you see it,\" Chibnall described, hailing Whittaker's performance as \"fresh, funny and very emotional.\"\n\nAs for how Whittaker's Broadchurch co-star and former Doctor David Tennant reacted to her casting, the actress said the message conveyed to her was, \"This is the most amazing thing that can happen to you, and there are only a few people who know how it feels.\"\n\nWhile Season 11 won't debut until this fall, fans were already introduced to the 13th Doctor in last year's Christmas special. Shooting the brief scene was \"incredibly nerve-wrecking, because the reveal had [already] happened [in the media],\" Whittaker described. \"You have no idea what you're taking on... I was nervous to touch anything. I felt as if I was in someone else's shoes, which is a wonderful way to start this journey. It was amazing.\"\n\nThe cast and creative team were tight-lipped on specifics about the new Time Lord, but executive producer Matt Strevens did share that \"this Doctor is in love with life\" and \"treats everything with respect and wonder.\"\n\nWhittaker will be joined by three new companions, who are all very different, said Mandip Gill (Hollyoaks), who plays one of the pals. Her character, Yasmin, is a 19-year-old who is \"whisked away on this amazing adventure with these people, who become her family, and she's in awe of the Doctor... The dynamic between the three friends is beautiful.\"\n\nWhen it came time to cast the companions, \"we were looking for people who have incredible range, because the tone of the show demands everything,\" Chibnall described. \"And just truth — bringing emotional truth. It's really important for us this season, especially. There are big emotional journeys for everyone to go on. All of them aced it, and the chemistry was really apparent.\"\n\nIn addition to its new ensemble, Season 11 will also feature a fresh take on the sonic screwdriver. Chibnall would only hint that \"there is a story [about] how the Doctor comes by\" this incarnation of the device.", "images": ["https://www.tvline.com/img/TVLine-Icon-RGB-Default-Color.svg", "https://www.tvline.com/img/TVLine-Logo-RGB-Default-Color.svg", "https://tvline.com/wp-content/uploads/2018/07/doctor-who-trailer-season-11-jodie-whittaker.png?w=300", "https://tvline.com/wp-content/uploads/2018/07/doctor-who-season-11-trailer-companions.png?w=300", "https://www.tvline.com/tvline/news/doctor-who-comic-con-season-11-jodie-whittaker-963740/doctor-who-season-11.jpg"], "top_img": "https://www.tvline.com/tvline/news/doctor-who-comic-con-season-11-jodie-whittaker-963740/doctor-who-season-11.jpg", "keywords": [], "authors": ["Vlada Gelman"], "canonical_link": "https://www.tvline.com/news/doctor-who-comic-con-season-11-jodie-whittaker-963740/", "title": "'Doctor Who' Season 11: New Female Doctor Jodie Whittaker — Comic-Con", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "max-image-preview:large", "thumbnail": "https://www.tvline.com/tvline/news/doctor-who-comic-con-season-11-jodie-whittaker-963740/doctor-who-season-11.jpg", "description": "New star Jodie Whittaker and the \"Doctor Who\" team teased a \"fresh take\" on the Time Lord in Season 11 at San Diego Comic-Con.", "mrf": {"tags": "Content Type:Legacy Article;Primary Category:Television;Category:Television;Headline Approver:Unknown;Trello Board:Legacy"}, "og": {"site_name": "TVLine", "title": "Doctor Who @ Comic-Con: New Star Jodie Whittaker And The Team Preview A 'Fresh Take' On The Classic Time Lord - TVLine", "image": "https://www.tvline.com/tvline/news/doctor-who-comic-con-season-11-jodie-whittaker-963740/doctor-who-season-11.jpg", "description": "New star Jodie Whittaker and the \"Doctor Who\" team teased a \"fresh take\" on the Time Lord in Season 11 at San Diego Comic-Con.", "type": "article", "url": "https://www.tvline.com/news/doctor-who-comic-con-season-11-jodie-whittaker-963740/"}, "twitter": {"title": "Doctor Who @ Comic-Con: New Star Jodie Whittaker And The Team Preview A 'Fresh Take' On The Classic Time Lord - TVLine", "description": "New star Jodie Whittaker and the \"Doctor Who\" team teased a \"fresh take\" on the Time Lord in Season 11 at San Diego Comic-Con.", "site": "@TVLine", "card": "summary_large_image", "image": "https://www.tvline.com/tvline/news/doctor-who-comic-con-season-11-jodie-whittaker-963740/doctor-who-season-11.jpg"}, "article": {"published_time": "2018-07-19T20:06:19+00:00", "modified_time": "2018-07-20T14:46:42+00:00", "author": "Vlada Gelman"}}, "movies": ["https://www.youtube.com/embed/YunJ3g99GIk?v=YunJ3g99GIk"], "publish_date": 1531972800.0, "source": "https://tvline.com", "summary": ""}