{"url": "https://www.thewrap.com/walking-dead-twd-is-maggie-lauren-cohan-coming-back-season-nine/", "text": "(Spoilers ahead for “The Walking Dead” on AMC)\n\nMaggie (Lauren Cohan) has been gone, but she’s not dead. The fifth episode of season 9 of “The Walking Dead” revealed that she left the Hilltop with the mysterious Georgie during the big time jump that came at the end of Rick Grimes’ (Andrew Lincoln) final episode. But she will be back.\n\nCohan, meanwhile, left “The Walking Dead” during season 9 after an ABC pilot she filmed, “Whiskey Cavalier,” was picked up by the network, and also after a contentious contract dispute in which she demanded equal pay with her male co-stars who had been on the show as long as as she had. Presumably, that’s why Maggie just kinda disappeared instead of getting any kind of sendoff.\n\nSo Cohan left “The Walking Dead” to try new things. Lauren Cohan later addressed the situation again in similarly ambiguous terms, saying that “there may have been some conversations” about her return to “The Walking Dead” but that we’ll have have to wait and “see what happens.”\n\nThat all probably felt like it was coming totally out of left field, considering how casually Maggie left the show last season. Her final episode also being Rick’s last didn’t help, since the episode basically functioned as Rick’s death episode. Maggie, on the other hand, just kinda wasn’t around anymore after that one, with only a couple mentions of where she went in subsequent episodes.\n\nBut Maggie is coming back. “Whiskey Cavalier” was canceled, and I guess Cohan and the powers that be at AMC have settled their dispute some way or another. At New York Comic-Con last year, AMC announced both that “The Walking Dead” was renewed for season 11 and that Cohan would return for that season.\n\nBut now, it turns out that Maggie will make her return in the current season, season 10. “We may see her at some other point this season,” Kang told Entertainment Weekly, “But I don’t want to say too much about anything.”\n\nWell, after the most recent episode of “The Walking Dead,” we got a tease for the season 10 finale which showed, as we all would have expected by now, that Maggie will finally make her return in the next episode. You can watch that tease here.\n\nBut the coronavirus pandemic might have thrown a wrench into this whole situation. AMC said last week that Angela Kang and co. are not able to finish the season 10 finale of “The Waking Dead” at the moment, so the current run of episodes will end at the 15th episode of the season. The finale will air eventually — we just don’t know when. So her return will happen in the next episode, whenever it ends up airing.\n\nMeanwhile, it’s long been theorized that the helicopter that carted Rick away belongs to the same group that we believe Georgie hails from — the Commonwealth, an actual large city of people in Ohio. If that theory pans out, and Georgie’s people are also the helicopter’s people, then there’s also plenty of reason for Rick and Maggie to cross paths in this new corner of the “Walking Dead” universe — perhaps during the big six-year time skip that we got in season 9.\n\nBut everything remains shrouded in mystery. If Georgie actually is with the Commonwealth, then Maggie’s return will be conveniently timed because the beginning of the Commonwealth story in the comics was intertwined with the end of the Whisperer plot, and at this point there’s no reason to think the Whisperers stuff will continue after the season 10 finale.\n\nSo, at least this won’t be a Heath (Corey Hawkins) situation — remember how he went out scavenging with Tara and then just never came back, his fate still undetermined? Maggie will be back. It’s just a matter of time now until it happens.", "images": ["https://i0.wp.com/www.thewrap.com/wp-content/uploads/2025/11/111325_COVER-_IR_5x4.png?fit=240%2C300&quality=80&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2018/11/the-walking-dead-twd-lauren-cohan-are-we-ever-gonna-see-maggie-again.jpg?fit=618%2C412&quality=89&ssl=1"], "top_img": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2018/11/the-walking-dead-twd-lauren-cohan-are-we-ever-gonna-see-maggie-again.jpg?fit=618%2C412&quality=89&ssl=1", "keywords": [], "authors": ["Phil Owen", "Phil.Owen Thewrap.Com", "Twitter", ".Wp-Block-Post-Author Box-Sizing Border-Box Display Flex Flex-Wrap Wrap .Wp-Block-Post-Author__Byline Font-Size Margin-Bottom Margin-Top Width", ".Wp-Block-Post-Author__Avatar Margin-Right .Wp-Block-Post-Author__Bio Font-Size Margin-Bottom .Wp-Block-Post-Author__Content Flex-Basis Flex-Grow .Wp-Block-Post-Author__Name Margin", ".Wp-Block-The-Wrap-Author-Bios__Entry Align-Items Center Display Flex Flex-Wrap Wrap Gap .Wp-Block-The-Wrap-Author-Bios__Entry .Wp-Block-The-Wrap-Author-Bios__Entry Margin-Top .Wp-Block-The-Wrap-Author-Bios__Entry-Excerpt Flex-Basis", ".Wp-Block-The-Wrap-Author-Bios Border-Top Solid", "Margin-Block Padding-Top .Wp-Block-The-Wrap-Author-Bios__Entry-Avatar Display Var --Display-No-Mobile", "Block", "Margin-Bottom .Wp-Block-The-Wrap-Author-Bios__Entry-Avatar Img Border Solid"], "canonical_link": "https://www.thewrap.com/walking-dead-twd-is-lauren-cohan-maggie-coming-back-season-10-finale-teaser-georgie-whisperers-coronavirus/", "title": "‘Walking Dead’: Are We Finally Going to See Maggie Again This Season?", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "'Walking Dead': Are We Finally Going to See Maggie Again This Season?", "description": "The future of one of the show's longest-running characters is not so uncertain anymore", "url": "https://www.thewrap.com/walking-dead-twd-is-lauren-cohan-maggie-coming-back-season-10-finale-teaser-georgie-whisperers-coronavirus/", "site_name": "TheWrap", "image": {"identifier": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2018/11/the-walking-dead-twd-lauren-cohan-are-we-ever-gonna-see-maggie-again.jpg?fit=618%2C412&quality=89&ssl=1", "width": 618, "height": 412, "type": "image/jpeg"}}, "article": {"author": "https://www.facebook.com/thewrap/", "published_time": "2020-04-07T21:12:53+00:00", "modified_time": "2020-04-07T21:13:52+00:00"}, "author": "Phil Owen", "twitter": {"card": "summary_large_image", "creator": "@thewrap", "label1": "Written by", "data1": "Phil Owen", "label2": "Est. reading time", "data2": "4 minutes"}, "generator": "WordPress 6.8", "article-tags": "amc, andrew_lincoln, corey-hawkins, lauren-cohan, maggie-rhee, norman_reedus, the_walking_dead, twd", "article-section": "tv", "article-categories": "news, tv", "msapplication-TileImage": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2024/05/the_wrap_symbol_black_bkg.png?fit=270%2C270&quality=80&ssl=1"}, "movies": ["https://www.youtube.com/embed/pkdKewMqQNc?feature=oembed"], "publish_date": 1586293973.0, "source": "https://www.thewrap.com", "summary": ""}