{"url": "https://en.wikipedia.org/wiki/American_Music_Awards", "text": "Annual awards show\n\nThe American Music Awards (AMAs) is an annual American music awards show produced by Dick Clark Productions since 1974.[1] Nominees are selected on commercial performance such as sales and airplay. Winners are determined by a poll of the public and fans who vote through the AMAs website.[2]\n\nThe event originally aired on ABC after the network's contract to air the Grammy Awards expired. After the 2022 ceremony, when ABC's rights to broadcast the ceremony expired, the American Music Awards were put on hiatus. In March 2024, it was announced that the AMAs would move to CBS as part of a deal with its rights to broadcast the now DCP-owned Golden Globe Awards. The event remained on hiatus for 2024, with CBS airing a 50th anniversary special in October 6, ahead of a 2025 return, which was held on May 26, and hosted by Jennifer Lopez.\n\nConception [ edit ]\n\nThe AMAs was created by Dick Clark in 1973 to compete with the Grammy Awards after the move of that year's show to Nashville, Tennessee led to CBS (which has broadcast all Grammy Award shows since then) picking up the Grammy telecasts after its first two in 1971 and 1972 were broadcast on ABC. In 2014, American network Telemundo acquired the rights to produce a Spanish-language version of the American Music Awards and launched the Latin American Music Awards in 2015.[3]\n\nNominations are selected based on commercial performance, such as sales and airplay. Winners have been determined by a poll of the public and fans, who can vote through the AMAs website, while nominations have remained based on sales, airplay, now including activity on social networks, and video viewing. Before 2010, nominations were based only on sales and airplay and nominated every work, even if old. The Grammys have nominations based on vote of the Academy and only nominate a work from their eligibility period that changes often.[4]\n\nThe award statuette is manufactured by New York firm Society Awards.[5]\n\nHistory [ edit ]\n\nThe hosts for the first AMAs were Helen Reddy, Roger Miller, and Smokey Robinson. Reddy not only hosted the show but also became the first artist to win an AMA for Favorite Pop/Rock Female Artist.[6] For the first two decades, the AMAs had multiple hosts, each representing a genre of music. For instance, Glen Campbell, who co-hosted the AMAs five times, would host the country portion, while other artists would co-host to represent their genre. In recent years, however, there has been a single host.\n\nIn 1991, Keenen Ivory Wayans became the first Hollywood actor to host the AMAs.\n\nThe first two AMAs in 1974 and 1975 and the 1994 ceremony were held in February, but from 1976 to 1993 and 1995 through early 2003, the AMAs were held in mid- to late-January, but were moved to November (usually the Sunday before Thanksgiving) beginning in late 2003 so it would prevent the ceremony to further compete with other major awards shows (such as the Golden Globe Awards and the Academy Awards) and allows for ABC to have a well-rated awards show during November sweeps.\n\nFor the 2008 awards, Jimmy Kimmel hosted for his fifth year, tying with Glen Campbell for the most AMAs hosted or co-hosted. From 2009–2012, there was no host. Instead, the AMAs followed the Grammys' lead in having various celebrities give introductions. However, rapper Pitbull hosted the ceremony in 2013 and 2014. Jennifer Lopez hosted in 2015.[7] Gigi Hadid and Jay Pharoah hosted in 2016. Tracee Ellis Ross hosted in 2017 and 2018. Ciara hosted in 2019.[8]\n\nBetween 2012 and 2014, the American Music Awards used the lock screen wallpaper of Samsung Galaxy smartphones rather than envelopes to reveal winners, as part of a sponsorship by Samsung Electronics. A magnetic screen cover on each phone kept the wallpaper image with the winner's name secret until opened.[9]\n\nIn August 2018, Dick Clark Productions announced a two-year sponsorship and content partnership with YouTube Music. However, this partnership seemingly lasted only for the 2018 ceremony, as there was no mention of it during the 2019 show.[10]\n\nIn March 2023, it was announced that the Billboard Music Awards, which are also produced by DCP via co-owned Billboard, had been moved from May to the November scheduling that was typically occupied by the American Music Awards, leading to speculation that the AMAs would be discontinued in order to focus on the Billboard Music Awards, or at the very least cancelled for 2023, so it could move to May in its place. It was reported that the broadcast rights for both events (which had been held by NBC and ABC respectively) would also be shopped; the Billboard Music Awards moved to an online-only format in November 2023.[11]\n\nIn March 2024, it was announced that CBS had acquired the rights to broadcast the AMAs under a deal of unspecified length. The rights were bundled with CBS's five-year agreement to televise the Golden Globe Awards, whose telecast has historically been produced by DCP, and whose assets had been acquired by DCP in 2023.[12][13]\n\nIn August 2024, it was announced that the AMAs would return in May 2025. In lieu of a 2024 ceremony, DCP also announced that CBS would broadcast an American Music Awards 50th anniversary special on October 6, 2024, featuring performances and retrospectives paying tribute to its history and memorable moments.[14][15] Ratings for the special were up from the last ceremony aired on ABC, with an average of 6.1 million viewers.[16] In February 2025, it was announced that the 51st American Music Awards would be held on May 26, 2025.[16] In August 2025, CBS renewed its rights to broadcast the AMAs under a five-year agreement similar to that of the Golden Globe Awards; the ceremony will supplant the Grammy Awards on CBS's lineup after they move to ABC in 2027.[17]\n\nCeremonies [ edit ]\n\nCategories [ edit ]\n\nCurrent award categories [ edit ]\n\nDiscontinued awards [ edit ]\n\nMost wins [ edit ]\n\nThe record for most American Music Awards won is held by Taylor Swift with 40 awards.[18] The record for most American Music Awards won by a male artist belongs to Michael Jackson, who has collected 26 awards.[19] The record for most American Music Awards won by a group belongs to Alabama, who have collected 18 awards.[20]\n\nMost wins in a single ceremony [ edit ]\n\nThe record for the most American Music Awards won in a single year is held by Michael Jackson (in 1984) and Whitney Houston (in 1994), each with 8 awards to their credit (including the Award of Merit, with which both artists were honored in the respective years).\n\nMost wins by category [ edit ]\n\nThe following list shows the artists with most wins in each category, adapted from the AMAs official website.[21]\n\nSpecial awards [ edit ]\n\nAward of Merit [ edit ]\n\nThe American Music Award of Merit has been awarded to 32 artists, the latest being Sting (2016).[22]\n\nInternational Artist Award of Excellence [ edit ]\n\nThe International Artist Award of Excellence is described as \"an award which recognizes artists whose popularity and impact cross national boundaries and is only given when there is a deserving recipient who is worthy of recognition for their accomplishments\" and has been awarded to seven artists:[23]\n\nIcon Award [ edit ]\n\nThe Icon Award was introduced in the 2013 ceremony, producer Larry Klein stated that the award was created \"to honor an artist whose body of work has made a profound influence over pop music on a global level.\"[24]\n\nDick Clark Award for Excellence [ edit ]\n\nAt the 2014 award ceremony, the Dick Clark Award for Excellence was given.[26] It was created to recognize \"an artist who achieves a groundbreaking feat or creates a landmark work.\"[27]\n\nAward of Achievement [ edit ]\n\nLifetime Achievement Award [ edit ]\n\nArtist of the Decade [ edit ]\n\nIn 2000, the AMAs held a poll to elect the Artist of the Decade for each previous decade of the Rock and Roll era. According to some sources, the result of this poll is not counted in the total of AMAs won by these artists.[31][32][33] The results were:\n\nArtist of the Century [ edit ]\n\nIn 2002, Michael Jackson received the Artist of the Century award due to his “unparalleled influence and impact on the music industry”.[34]\n\nVeterans Voice Award [ edit ]\n\nAt the 2025 ceremony (which was held on Memorial Day), The Veterans Voice Award was given. It recognizes Artist who have impacted veterans and their families through their music and platform.\n\nRatings [ edit ]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/BrunoMars24KMagicWorldTourLive_%28cropped%29.jpg/120px-BrunoMars24KMagicWorldTourLive_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/45_record.png/20px-45_record.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/BillieEilishO2160622_%2819_of_45%29_%2852153214339%29_%28cropped_3%29.jpg/120px-BillieEilishO2160622_%2819_of_45%29_%2852153214339%29_%28cropped_3%29.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Penske_Media_Corporation_2014_logo.svg/120px-Penske_Media_Corporation_2014_logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/20px-Symbol_category_class.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Gracie_Abrams_%40_El_Rey_Theatre_03_05_2022_%2852297976064%29_%28cropped%29_%282%29.jpg/120px-Gracie_Abrams_%40_El_Rey_Theatre_03_05_2022_%2852297976064%29_%28cropped%29_%282%29.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Lady_Gaga_at_the_White_House_in_2023_%281%29.jpg/120px-Lady_Gaga_at_the_White_House_in_2023_%281%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/American_Music_Awards_logo.svg/1200px-American_Music_Awards_logo.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/American_Music_Awards_logo.svg/250px-American_Music_Awards_logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/American_Music_Awards_logo.svg/1200px-American_Music_Awards_logo.svg.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/American_Music_Awards", "title": "American Music Awards", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.3", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/American_Music_Awards_logo.svg/1200px-American_Music_Awards_logo.svg.png", "width": 1200, "height": 1198}, "title": "American Music Awards - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}