{"url": "https://www.vox.com/culture/2018/9/12/17850994/american-horror-story-seasons-ranked-apocalypse", "text": "was a senior correspondent for Vox, covering American identities. Before she joined Vox in 2014, she was the first TV editor of the A.V. Club.\n\nEvery season of American Horror Story is both the best season of American Horror Story and the worst season of American Horror Story.\n\nThat’s sort of how the show rolls. Helmed by series maestro Ryan Murphy, it has a tone that veers wildly, and it gives off a madcap air of not caring whether it makes sense or hews to any of the conventions of narrative television. Sometimes it channels profound terror and sadness, something essentially American that drives the series’ core ideas and beliefs. Sometimes it presents something so ridiculous that you have to turn off the television and think about what you’ve been doing with your life while staring out the window at the world passing you by. Sometimes it does both of those things in the same scene.\n\nBut the genuinely groundbreaking structure of American Horror Story — it pioneered the “anthological miniseries,” where each new season tells a brand new story, though often with some of the same cast members — means that it’s almost always worth keeping an eye on, even if you’re not actively watching it.\n\nAnd the debut of the show’s eighth season, Apocalypse, which is bringing back characters from the first and third seasons, is guaranteed to bring with it the annual phenomenon of people tuning in for the debut episode, remembering that the show is maybe not to their taste, and then tuning out for future installments.\n\nDespite all this, I enjoy American Horror Story, and I think at least one of its seasons is a genuine TV masterpiece. Others boast enough good elements that I’m willing to recommend them. But there are also some seasons that are just terrible. So let’s rank the seven complete seasons of American Horror Story, from worst to best.\n\n7) Hotel (season 5, aired in 2015-’16)\n\nLet me tell you about the curse of American Horror Story, which is that literally every time I’ve said anything about the show getting back on track, it has immediately proceeded to trash my goodwill with a string of episodes that just don’t work.\n\nSo it went with Hotel, which in the early going seemed to be using vampire-like beings living in a grimy LA hotel and played by the likes of Lady Gaga (the star who is born herself) to examine humanity’s inability to cope with grief. It was a poignant, interesting idea! I said so! On Twitter even!\n\nThen in the second half of the season, the most ridiculous twist in a series full of ridiculous twists completely undercut the emotional resonance of everything that happened in the first half, and the season mostly petered out. I kinda liked Gaga, though!\n\n6) Cult (season 7, aired in 2017)\n\nOf all of the seasons on this list, Cult is the one I had the hardest time ranking. I thought about placing it as high as second, but my opinion on it changes every time I consider just how Murphy wants us to think about the politics of America in the 2010s.\n\nCult is the infamous “post-Trump” season, which involves a killer clown cult slowly indoctrinating the residents of a Michigan town into its murderous ways, all against the backdrop of the 2016 election. The highs — like a late-season scene between a brother and sister that clarifies many of the season’s themes — are really high, but the lows often feature astonishingly superficial readings of that specific political moment for a show that has had some success dissecting America’s worst impulses in the past.\n\nAnd yet ... I always say that to understand how American Horror Story wants us to think about whatever it’s discussing in a given season, you have look to the character Sarah Paulson is playing, who often seems like a Murphy avatar navigating the series’ chaotic world. And the fact that Cult casts her as a terrified woman who lets her fear turn her into a complicit part of multiple horrible systems suggests to me there’s more to Cult than I’m giving it credit for. Maybe I should watch it again.\n\n5) Coven (season 3, aired in 2013-’14)\n\nThis season about a school of witches in New Orleans seems to be the favorite of lots of people (no less a TV authority than Entertainment Weekly named Coven the best TV show of 2013!), but I’ve always found it to be hogwash saved by a lot of great performances from some of the world’s finest actresses.\n\nAmerican Horror Story has always been a death-soaked series, but Coven is the one season where death becomes a liability, because the show keeps killing off characters and then immediately resurrecting them, occasionally as literal talking heads or the like. It kneecaps whatever stakes the show is trying to build and, thus, its metaphorical representation of how infighting among the disenfranchised can only lead to further hegemony by the straight white men who run the world.\n\nIf you watch this show for its campy deconstruction of horror tropes, I can see where you’d love Coven. But I think American Horror Story has done campy deconstruction far better in several other seasons.\n\n4) Roanoke (season 6, aired in 2016)\n\nIt’s fitting that Roanoke lands exactly in the middle of this ranking, because it’s the one I have the most conflicted feelings about. On the one hand, the first half of the season is a bit trite, a winking mockery of cable reality shows about “real life” hauntings and the like. But the second half of the season is a brutal satire of the entertainment industry, and its finale feels like Murphy and everyone else involved in the show burying the hand that feeds in an unmarked grave.\n\nFilmed as a mockumentary and featuring an in-show reality TV program that aims to document a “real” couple’s experiences moving into a haunted mansion (thus pulling in some DNA from American Horror Story’s first season, Murder House), Roanoke keeps peeling back layers, first revealing the actors behind the “reality show,” then heading all the way to the seats of the entertainment industry’s power in Los Angeles. The ghosts are a little underbaked, but maybe that’s the point. The real horrors are always out here in the real world, after all.\n\nRoanoke is an ungainly season of television, but in its dissection of the ways that we keep filming everything, even when our lives are in danger, and the ways that tendency often leads to a world where we become desensitized to horrible behavior, it gets at something profound, if unintentionally.\n\n3) Murder House (season 1, aired in 2011)\n\nIt took most of American Horror Story’s first season to convince me it was doing something of note. After nearly every episode (I recapped them all for another site), I found myself wondering why the show didn’t seem to play by the narrative conventions of horror, or television, or storytelling, really. But at some point, I realized that its melange of tropes and ideas was the point. Murphy might have famously said that Murder House was about “a marriage,” but it was really about the idea of marriage and heterosexuality that pop culture feeds to us, filtered first through horror films and then through Murphy’s unique sensibility.\n\nThe plot of Murder House is probably the most coherent of any American Horror Story season — a couple moves into a house with a dark history, and then the house starts tearing their marriage (and their teenage daughter) apart at the seams. It lacks some of the grandly operatic quality that drives most of the later seasons, and there are whole episodes that essentially amount to, “Wouldn’t it be fun if we riffed on this horror trope?”\n\nBut the acting is good (particularly from Jessica Lange, the star of the show’s first four seasons), and the sheer daring of just killing off everybody in the cast speaks to how the show immediately set about rewriting the rules of TV, right under our noses.\n\n2) Freak Show (season 4, aired in 2014-’15)\n\nMy most controversial opinion about American Horror Story is that Freak Show is a misunderstood near-masterpiece. It gets a bit lost in the middle — what season of American Horror Story doesn’t? — but it ends up being the mirror image of Coven: a story about what it would mean to create a place where the powerless and disenfranchised could work together to build a better world.\n\nYeah, there are way too many characters, and it’s probably telling that the best way I can think of to summarize the plot is, “There’s a freak show, I guess?” But both its period trappings (Freak Show is set in 1950s America) and its depiction of a world ruled by the casually cruel whims of white guys who don’t notice anybody who’s not a white guy combine to form what might be the most emotionally affecting season.\n\nIt’s also the season where Jessica Lange randomly performs “Life on Mars,” and, like, I can’t just write that off, you know?\n\n1) Asylum (season 2, aired in 2012-’13)\n\nAsylum is the single best season of American Horror Story — and one of the best TV seasons of the decade. It’s the one season of the show where everything Murphy attempts actually works. The acting is phenomenal (it features Paulson’s best performance on the American Horror Story to date, for one), the storytelling is surprisingly tight (even with aliens), and the themes of othered and ostracized people coming together to build something new are potent throughout.\n\nAmerican Horror Story has always been rooted in camp, which has often been understood as a way that queer creators subvert and twist mainstream culture to better question its assumptions about life. But Asylum is the show’s most forthright depiction of the ways that American society once tried to literally wipe LGBTQ people from the face of the planet for not strictly conforming to that norm.\n\nIn Paulson’s character — a lesbian journalist who visits an asylum as part of an undercover reporting project, and then is trapped there as her sexuality comes to light — the series found its most potent protagonist and a sneaky mission statement. Most of the attention paid to American Horror Story focuses on the second word of its title, but maybe it should be focused on the first. This is a series that aims to scare, sure, but it’s most interested in the ways its “horror stories” are, first and foremost, American stories. Asylum is still its best examination of that idea and a season the show is unlikely to top, though I’ll surely enjoy watching it try.", "images": ["https://platform.vox.com/wp-content/uploads/sites/2/chorus/author_profile_images/195899/emilyheadshotredhair.0.jpg?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=96", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-468814460.jpg?quality=90&strip=all&crop=0%2C2.3825770499261%2C100%2C95.234845900148&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-590696434.jpg?quality=90&strip=all&crop=16.666666666667%2C0%2C66.666666666667%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-468814460.jpg?quality=90&strip=all&crop=14.998805827561%2C0%2C70.002388344877%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/13049465/headshots_1536783809005.jpg?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/the-true-meaning-of-friendsgiving.jpg?quality=90&strip=all&crop=7.8125%2C0%2C84.375%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-2155209999.jpg?quality=90&strip=all&crop=0.0041883062489489%2C0%2C99.991623387502%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-2155209999.jpg?quality=90&strip=all&crop=16.669458870833%2C0%2C66.661082258335%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/gettyimages-2217689678.jpg?quality=90&strip=all&crop=0%2C0.024402147388969%2C100%2C99.951195705222&w=2400", "https://www.google-analytics.com/g/collect?v=2&tid=G-C3QZPB4GVE&cid=555&en=noscript_page_view", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-590696434.jpg?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/3_Vox_FuturePerfect25_LandingPage.gif?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/gettyimages-2217689678.jpg?quality=90&strip=all&crop=16.650390625%2C0%2C66.69921875%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/the-true-meaning-of-friendsgiving.jpg?quality=90&strip=all&crop=21.875%2C0%2C56.25%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/13049465/headshots_1536783809005.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/3_Vox_FuturePerfect25_LandingPage.gif?quality=90&strip=all&crop=16.666666666667%2C0%2C66.666666666667%2C100&w=2400"], "top_img": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/13049465/headshots_1536783809005.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200", "keywords": [], "authors": ["Emily St. James"], "canonical_link": "https://www.vox.com/culture/2018/9/12/17850994/american-horror-story-seasons-ranked-apocalypse", "title": "Every season of American Horror Story so far, ranked", "meta_data": {"bingbot": "nocache", "twitter": {"card": "summary_large_image", "site": "@voxdotcom", "url": "https://www.vox.com/culture/2018/9/12/17850994/american-horror-story-seasons-ranked-apocalypse", "title": "Every season of American Horror Story so far, ranked", "description": "Hint: Every season of this show is both its best and worst season. (Except for Asylum. That one rules. Unquestionably.)", "image": {"identifier": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/13049465/headshots_1536783809005.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200", "alt": "American Horror Story"}}, "fb": {"app_id": 549923288395304}, "og": {"site_name": "Vox", "title": "Every season of American Horror Story so far, ranked", "description": "Hint: Every season of this show is both its best and worst season. (Except for Asylum. That one rules. Unquestionably.)", "url": "https://www.vox.com/culture/2018/9/12/17850994/american-horror-story-seasons-ranked-apocalypse", "type": "article", "image": {"identifier": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/13049465/headshots_1536783809005.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200", "alt": "American Horror Story", "type": "image/jpeg", "width": 1200, "height": 628}}, "viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Vox", "robots": "index,follow,max-image-preview:large", "description": "Hint: Every season of this show is both its best and worst season. (Except for Asylum. That one rules. Unquestionably.)", "article": {"published_time": "2018-09-12T21:00:02+00:00", "modified_time": "2018-09-12T21:00:02+00:00"}, "author": "Emily St. James", "amazonbot": "noarchive", "parsely-type": "post", "parsely-title": "Every season of American Horror Story so far, ranked", "parsely-link": "https://www.vox.com/culture/2018/9/12/17850994/american-horror-story-seasons-ranked-apocalypse", "parsely-image-url": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/13049465/headshots_1536783809005.jpg?quality=90&strip=all&crop=0,10.732984293194,100,78.534031413613", "parsely-pub-date": "2018-09-12T21:00:02+00:00", "parsely-section": "culture", "parsely-tags": "vox,pagetype:story,latest-news,culture,tv", "parsely-author": "Emily St. James", "cse-category": "Culture", "cse-authors": "Emily St. James", "next-head-count": 51}, "movies": [], "publish_date": 1536724800.0, "source": "https://www.vox.com", "summary": ""}