{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/antonio-sabato-jr-net-worth/", "text": "What is Antonio Sabàto Jr.'s Net Worth?\n\nAntonio Sabàto Jr. is an actor and former model who has a net worth of $1 million. Antonio Sabato Jr. rose to fame in the 1990s as an underwear model for Calvin Klein, and for playing the character Jagger Cates on the television soap opera \"General Hospital.\" Later on, in 2018, he ran unsuccessfully as a Republican for US Congress for California's 26th district. In recent years Antonio has garnered some controversy for his political views. In 2019 he moved his family to Florida and reportedly took a job at a construction company after he claimed to be blacklisted by Hollywood.\n\nEarly Life and Education\n\nAntonio Sabàto Jr. was born on February 29, 1972 in Rome, Italy to Yvonne and actor Antonio Sabàto Sr. He is of Czech and Jewish descent on his mother's side, and has a sister named Simonne. In 1985, the family immigrated to the United States. Sabàto was educated at Palisades Charter High School in Los Angeles, California.\n\nModeling Career\n\nAs a model, Sabàto first gained attention in the early 1990s when he was featured on the cover of Playgirl. Later, in 1996, he became famous as an underwear model for Calvin Klein. Sabàto was represented by fashion agent Omar Albertto at that time.\n\nActing Career\n\nAfter acting in some Italian films, Sabàto achieved fame in the United States for his role as Jagger Cates on the television soap opera \"General Hospital.\" He played that character from 1992 to 1995. During that time, Sabàto starred in the television films \"Moment of Truth: Why My Daughter?\" and \"Jailbreakers.\" He also had a main role in the short-lived NBC science-fiction series \"Earth 2,\" and a recurring role on the primetime soap opera \"Melrose Place.\" Sabàto appeared in a string of television films in the latter half of the 90s, including \"Her Hidden Truth,\" \"If Looks Could Kill,\" \"Thrill,\" and \"Fatal Error.\" He also made some appearances on the big screen, notably in the action comedy \"The Big Hit.\" Additionally, Sabàto starred in the direct-to-video action film \"High Voltage\" alongside Shannon Lee and Amy Smart.\n\nKicking off the 21st century, Sabàto appeared in episodes of \"The Outer Limits\" and \"Charmed\" and in the television films \"Guilty as Charged\" and \"Final Ascent.\" In 2003, he starred as the lover of David Sutcliffe's protagonist in the drama film \"Testosterone,\" and in 2004 had a main role on the short-lived television sitcom \"The Help.\" Sabàto soon returned to soap opera acting, playing Dante Damiano on \"The Bold and the Beautiful\" from 2005 to 2006. After following that with some television films, including \"Destination: Infestation\" and \"Ghost Voyage,\" he reprised his role as Jagger Cates on \"General Hospital: Night Shift.\" Sabàto subsequently starred as John Carter in the direct-to-video science-fiction film \"Princess of Mars.\" Throughout the early 2010s, he appeared in episodes of such shows as \"CSI: NY,\" \"Rizzoli & Isles,\" and \"Bones.\" Sabàto's other notable credits have included the television miniseries \"Antonio: Down Under\" and the film \"Trail Blazers,\" which he also wrote and directed.\n\nReality Television\n\nIn addition to his acting roles, Sabàto has frequently appeared on reality television. In 2005, he competed on the VH1 competition show \"But Can They Sing?,\" coming in fifth place. Three years later, he won the NBC competition show \"Celebrity Circus.\" Following that, Sabàto starred on his own VH1 reality show, \"My Antonio,\" featuring female contestants competing to win his heart. The winner of the show was Brooke Barlow. Sabàto went on to appear on \"Celebrity Wife Swap\" alongside his family in early 2012. On the show, his then-fiancé Cheryl Nunes swapped places with Colette Foley, the wife of WWE wrestler Mick Foley. In 2014, Sabàto competed in season 19 of \"Dancing with the Stars,\" and with his professional partner Cheryl Burke, came in eighth place. The same year, he began hosting the syndicated home remodeling program \"Fix It & Finish It.\"\n\nPolitical Career\n\nIn 2018, Sabàto entered the political arena when he ran as a Republican for California's 26th district congressional seat, held by incumbent Democrat Julia Brownley. Ultimately, Brownley trounced him in the general election.\n\nSabàto has been controversial for his political remarks. Most infamously, he made racist statements about Barack Obama, perpetuating the falsehood that the former US president is Muslim.\n\nSabàto endorsed Donald Trump in 2016. He garnered more pushback when he compared his struggle of finding work in show business to being Jewish during the Holocaust.\n\nPersonal Life\n\nIn 1992, Sabàto married model and actress Alicia Tully Jensen. The pair divorced the following year, when Sabàto began dating actress Virginia Madsen. That relationship lasted until 1998, and produced a son. From 2000 to 2007, Sabàto dated Kristin Rossetti, with whom he had a daughter. He went on to marry television host and beauty queen Cheryl Nunes in 2012. They had a son together before splitting in late 2016 and divorcing in 2018. In the aftermath of the divorce, Nunes claimed that Sabàto was abusing prescription drugs and failing to attend his drug rehab program. Sabàto confirmed he was addicted to sleep aids.\n\nIn 2020, Sabàto moved with his family from California to Florida to be somewhere more in line with his views and after claiming he had been blacklisted by Hollywood. In the Sunshine State, he works for a construction company.\n\nReal Estate\n\nIn April 2005 Antonio paid $1.453 million for a home in Thousand Oaks, California. He sold this home in August 2019 for $1.535 million. That same month he paid $825,000 for a home in New Port Richey, Florida.", "images": ["https://vz.cnwimg.com/thm/1JoH3482haSLevnlEMdqhrz36y0=/132x132/center/top/filters:format(webp)/2009/11/George-Clooney.jpg", "https://vz.cnwimg.com/thm/8fIllE0SS1_LX9aJ7mqjHfDUfzA=/400x400/center/top/filters:format(webp)/2012/01/Antonio-Sabato-Jr-e1529342617493.jpg", "https://vz.cnwimg.com/thm/KNDSqD-9inbRekV6AGgXDEG2Scw=/375x35:810x586/132x132/filters:format(webp):strip_exif()/2015/09/GettyImages-476575299.jpg", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "https://vz.cnwimg.com/thm/dIpBNDJA1jiJD4BuxWFL_TPuScU=/132x132/center/top/filters:format(webp)/2014/08/Krista-Allen.jpg", "https://vz.cnwimg.com/thm/0dOqT2nlNQM7u_J-5xWrCsf2nAw=/132x132/center/top/filters:format(webp)/2020/02/Angelina-Jolie.png", "https://vz.cnwimg.com/thm/_hOmdPz8Ht24ZxIeZM7m4mGRouk=/132x132/center/top/filters:format(webp)/2019/11/GettyImages-1094653148.jpg", "https://vz.cnwimg.com/thm/yboGsO77E1kQwELLmrwRZv_4RmE=/132x132/center/top/filters:format(webp)/2017/02/GettyImages-528215436.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/thm/lt1abKKVHSBtY-US0k9GLU9MTmM=/132x132/center/top/filters:format(webp)/2009/09/Brad-Pitt.jpg", "https://vz.cnwimg.com/thm/IoWqGPmFDjvC6iTqcDsspXBuxqo=/132x132/center/top/filters:format(webp)/2018/03/GettyImages-821622848.jpg", "https://vz.cnwimg.com/thm/ZjN094FNGixINmcHu9UxJKGHh4U=/132x132/center/top/filters:format(webp)/2013/06/lindsay.jpg", "https://vz.cnwimg.com/thm/1qr9TrgaPZEwVseXgEyCn4W2cHE=/132x132/center/top/filters:format(webp)/2010/11/casper.png", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/thm/dXuAPIEBU--L_kRib4u0nSzjUtE=/132x132/center/top/filters:format(webp)/2020/04/Megan-Fox.jpg", "https://vz.cnwimg.com/thm/aB0s1Bwitb76dZkj80xEaNpZSO4=/132x132/center/top/filters:format(webp)/2010/12/virginia-madsen.jpg", "https://vz.cnwimg.com/thm/M6AVYSb3zWO3w9UU8WibMvDaG4A=/132x132/center/top/filters:format(webp)/2011/11/Kelly-Monaco.jpg", "https://vz.cnwimg.com/thm/UxnQSql1h0QyX1CgkPqKhTxCTHM=/132x132/center/top/filters:format(webp)/2009/09/Jennifer-Aniston.jpg", "https://vz.cnwimg.com/wp-content/uploads/2012/01/Antonio-Sabato-Jr-e1529342617493.jpg?x46379", "https://vz.cnwimg.com/thm/95i5RI1LWkjHyyoolMeto-z_WeU=/132x132/center/top/filters:format(webp)/2020/01/lopez3.jpg", "https://vz.cnwimg.com/thm/KFAqJ9F4o80l6an2fe78-0jw28s=/132x132/center/top/filters:format(webp)/2019/04/rr.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2012/01/Antonio-Sabato-Jr-e1529342617493.jpg?x46379", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/antonio-sabato-jr-net-worth/", "title": "Antonio Sabato Jr Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Antonio Sabato, Jr net worth and salary: Antonio Sabàto Jr. is an actor and former model who has a net worth of $1 million. Antonio Sabato Jr. rose to fame in the 1990s as an underwear model for Calvin Klein", "slick": {"wpversion": "3.0.1", "wppostid": 26482, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2012/01/Antonio-Sabato-Jr-e1529342617493.jpg?x46379", "group": "post", "category": "actors:Actors"}, ";": "richest-celebrities:Richest Celebrities", "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "cnw": {"wppostid": 26482}, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Antonio Sabato Jr Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/antonio-sabato-jr-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2012/01/Antonio-Sabato-Jr-e1529342617493.jpg?x46379", "site_name": "Celebrity Net Worth", "description": "What is Antonio Sabato Jr's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2023-06-14T00:09:29+00:00", "published_time": "2023-06-12T20:20:04+00:00", "section": "Actors", "tag": "Antonio Sabato Jr wife"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2012/01/Antonio-Sabato-Jr-e1529342617493.jpg?x46379", "title": "Antonio Sabato Jr Net Worth", "description": "Antonio Sabato, Jr net worth and salary: Antonio Sabàto Jr. is an actor and former model who has a net worth of $1 million. Antonio Sabato Jr. rose to fame in the 1990s as an underwear model for Calv"}}, "movies": [], "publish_date": 1686601204.0, "source": "https://www.celebritynetworth.com", "summary": ""}