{"url": "https://www.thedailybeast.com/how-madonna-lost-the-bitter-custody-battle-over-son-rocco", "text": "You can’t really blame Rocco for wanting to live in London with his dad, film director Guy Ritchie, rather than in New York with his mum, Madonna.\n\nIf most kids find their parents embarrassing at some stage of their adolescence, one can only imagine how Rocco might have felt when his mum posted a series of not-very cryptic Instagrams on Thursday, just hours after the long-running custody battle with Ritchie finally came to an end with the news that Rocco would be staying with his father in London, the option the 16-year-old has always apparently preferred.\n\nCourt spokesman Lucian Chalfen confirmed in New York on Wednesday that the divorced singer and film-maker had reached a settlement, and although the details were not released, Ritchie’s lawyer later said that Rocco will continue to live with his father in London.\n\nMadonna reacted to the settlement by posting a series of bizarre pictures—including one of herself with the word “Bitch” scrawled across it and a caption suggesting that, at times, this was what a “soccer mom” needed to be.\n\nThis week’s Instagram meltdown is hardly an isolated incident—it came hard on the heels of a year of weird and wacky behavior on tour by Madonna as the custody battle, following her 2008 divorce from Guy, raged.\n\nBecause sometimes soccer Mom's need to be a .......,.,,........@mertalas A photo posted by Madonna (@madonna) on Sep 7, 2016 at 11:24am PDT\n\nAt a performance in Nashville in January she allegedly referred to her ex-husband as a “cunt”; when an audience member shouted out that they wanted to marry her, Madge replied, “I’m looking for a husband, not a cunt. I already married a cunt.”\n\nIn Mexico City she told the audience from the stage: “I, too, go through challenging times in my life and right now is one of them.”\n\nIn Australia, where the Rebel Heart tour drew to a close, Madonna, dressed as a clown, dedicated her song “Intervention” to Rocco saying: “There’s no end to the mistakes I’ve made. Anyway everybody knows the saga of me and my son Rocco. It’s not a fun story to tell or think about. I probably could have enjoyed myself a little bit more on this tour if he hadn’t disappeared so suddenly and also if I knew when I would see him again.”\n\nAs she sang, images of Rocco appeared on a screen behind her.\n\nThe “saga,” as Madonna refers to it, began late last year when Rocco refused to come back to New York after a trip to visit his dad, according to multiple reports. Rocco had had enough of Madonna’s “soccer mom” parenting style, and the final straw came when she confiscated his phone when he didn’t do his homework, according to a report in The Sun.\n\nThe row continued to simmer until Christmas 2015, when Madonna obtained a court order from a New York court telling Rocco to return to the city in time to start the new term at his New York high school, the Lycée Français, where he was enrolled.\n\nHowever, Rocco ignored the ruling and stayed in London, telling a friend on Instagram, “I’m staying here, bro.”\n\nMadonna has long been known as a strict parent. Speaking more than a decade ago about Lourdes getting in trouble for her sloppiness, Madonna told Newsweek: “She has to earn all of her clothes back by being tidy, picking up things in her room, making her bed in the morning... She wears the same outfit every day to school until she learns her lesson.”\n\nAccording to The Sun, Madonna accused Ritchie of not doing enough to make Rocco obey the court ruling but Ritchie—who is married with three small children—declined to force his son onto a plane, apparently sharing Rocco’s view that Madonna’s parenting style is excessively controlling for a 16-year-old.\n\nRocco himself struck back at his mother through Instagram, by blocking her and posting a picture that described himself as a “son of a bitch.”\n\nIn February, The Sun reported that Madonna was “shocked by evidence that her son is in danger of being drawn into a seedy and dangerous world of soft drugs,” and was running wild in London after they published pictures of the teen smoking what appeared to be a joint at a London skate park.\n\nMadonna was said to be “disturbed” by the pictures in the piece, but Ritchie (who comes from a fairly bohemian upper class London family himself) regards Rocco’s antics such as drinking a can of lager on the tube with his mates as very little to worry about. It may not be ideal, but nor is it outrageously off-the-rails behavior for a regular London teenager.\n\nAnd while the British tabloids have picked up on the hoodie-wearing mates Rocco was hanging out with at the skate park on the South Bank, he is actually now attending a London day school near his dad’s home in Belsize Park.\n\nAlong with his school mates there are a smattering of celeb kids in Rocco’s circle who can relate to his unique circumstances; Brooklyn Beckham and Gordon Ramsay’s son Jack are close.\n\nAnd on weekends, Rocco voluntarily decamps to his dad’s country manor in Wiltshire with his step-mom, Jacqui Ainsley, and their three small kids.\n\nIn May, during school holidays, Rocco spent time in New York with Madonna, but he was soon back in London with his dad again.\n\nRocco will be relieved that the custody battle, which lawyers had said was putting him under severe stress, is over.", "images": ["https://www.thedailybeast.com/pf/resources/svgs/social-logos/fb.svg?d=342", "https://www.thedailybeast.com/pf/resources/svgs/social-logos/email-icon.svg?d=342", "https://static.themebuilder.aws.arc.pub/thedailybeast/1741381130319.png", "https://www.thedailybeast.com/pf/resources/images/obsessed-header-logo-h-2.png?d=342", "https://www.thedailybeast.com/resizer/v2/AU37OZYATNECPJJOTM65FJT3LQ.png?smart=true&auth=c921d820cc8119838347e4bb81883b36692ed42e6469e37bdb9bdae8df9f629f&width=1440&height=1080", "https://www.thedailybeast.com/resizer/v2/NHKXP4MZAVE23CPMPZRGAKWUS4.jpg?smart=true&auth=197ab6390b5883b95c9ebad436bcf0add7ea8c8d89109c63bc6c120ce7e5fc67&width=1440&height=1080", "https://www.thedailybeast.com/resizer/v2/A63MWLYCCFHBPHOWMDSMB2AC34.jpg?smart=true&auth=e6e0d7b78502b822266b1e2ab946831e823f84ee61b3369b9a9446f43ee046eb&width=1440&height=1080", "https://www.thedailybeast.com/resizer/v2/FFIVNTGEFJMLRKUQVLUWUO72VA.jpg?smart=true&auth=7faaa533c4358f4f252b1fe0111faf1a437d96cf616f4e8e65a275101b93f241&width=1200&height=630", "https://www.thedailybeast.com/pf/resources/svgs/badges/google_play.svg?d=342", "https://www.thedailybeast.com/pf/resources/svgs/social-logos/twitter-icon.svg?d=342", "https://www.thedailybeast.com/resizer/v2/FFIVNTGEFJMLRKUQVLUWUO72VA.jpg?smart=true&auth=7faaa533c4358f4f252b1fe0111faf1a437d96cf616f4e8e65a275101b93f241&width=1600&height=900", "https://www.thedailybeast.com/pf/resources/svgs/social-logos/reddit.svg?d=342", "https://www.thedailybeast.com/resizer/v2/O6EN7N6VTVPH7LY4BPFLYENKXM.jpg?auth=f78162c47e1470eb7d12e3eb5c9376ba99ab80adbccc0fd3a9da05c4e0f85922&width=800&height=1171", "https://www.thedailybeast.com/resizer/v2/DPXPPUYZ6JHF7DSLHPW34F25PI.jpg?smart=true&auth=5b1083923ea9a1017cc738ca599056b16bb8f485435e3b7ae3fbbc7936ba2181&width=1440&height=1080", "https://www.thedailybeast.com/resizer/v2/TVEQLZCSIJHF5MHTBSX5743D5I.png?smart=true&auth=8ec6be7b16209630ff84f12fdb29fa234015ab297bbce0cad3678062d1edd565&width=1440&height=1080", "https://www.thedailybeast.com/pf/resources/svgs/badges/app_store.svg?d=342", "https://author-service-images-prod-us-east-1.publishing.aws.arc.pub/thedailybeast/6c959014-b2c7-4428-a5ce-8039ab8b6701.jpg"], "top_img": "https://www.thedailybeast.com/resizer/v2/FFIVNTGEFJMLRKUQVLUWUO72VA.jpg?smart=true&auth=7faaa533c4358f4f252b1fe0111faf1a437d96cf616f4e8e65a275101b93f241&width=1200&height=630", "keywords": [], "authors": ["Tom Sykes", "European Editor At Large", "Tom.Sykes Thedailybeast.Com", "Got A Tip", "Send It To The Daily Beast", "Catherine Bouris", "Leigh Kimmins", "Harry Thompson", "Sarah Ewall-Wice", "Laura Esposito"], "canonical_link": "https://www.thedailybeast.com/how-madonna-lost-the-bitter-custody-battle-over-son-rocco/", "title": "How Madonna Lost the Bitter Custody Battle Over Son Rocco", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "Madonna has been forced to accede to her son Rocco’s wish to remain in London with his father, Guy Ritchie. What next for mother and son?", "twitter": {"description": "Madonna has been forced to accede to her son Rocco’s wish to remain in London with his father, Guy Ritchie. What next for mother and son?", "title": "How Madonna Lost Her Custody Battle", "image": {"identifier": "https://www.thedailybeast.com/resizer/v2/FFIVNTGEFJMLRKUQVLUWUO72VA.jpg?smart=true&auth=7faaa533c4358f4f252b1fe0111faf1a437d96cf616f4e8e65a275101b93f241&width=1200&height=630", "alt": "articles/2016/09/10/how-madonna-lost-the-bitter-custody-battle-over-son-rocco/160909-sykes-madonna-custody-tease_prlja3"}, "site": "@https://twitter.com/thedailybeast", "card": "summary_large_image"}, "og": {"description": "Madonna has been forced to accede to her son Rocco’s wish to remain in London with his father, Guy Ritchie. What next for mother and son?", "title": "How Madonna Lost Her Custody Battle", "image": {"identifier": "https://www.thedailybeast.com/resizer/v2/FFIVNTGEFJMLRKUQVLUWUO72VA.jpg?smart=true&auth=7faaa533c4358f4f252b1fe0111faf1a437d96cf616f4e8e65a275101b93f241&width=1200&height=630", "alt": "articles/2016/09/10/how-madonna-lost-the-bitter-custody-battle-over-son-rocco/160909-sykes-madonna-custody-tease_prlja3"}, "type": "article", "site_name": "The Daily Beast", "url": "https://www.thedailybeast.com/how-madonna-lost-the-bitter-custody-battle-over-son-rocco/"}, "keywords": "guy-ritchie,celebrity-scandal", "robots": "max-image-preview:large", "loadforge-site-verification": "3ac1d76b00b152231dc1bef253b8d571e663ffa9b4826b38646ee6d4a23225d2a762aac1254120868ebecd9c4666ad563ef03b99a25d3966cba08ee2380aa43b"}, "movies": [], "publish_date": null, "source": "https://www.thedailybeast.com", "summary": ""}