{"url": "https://en.wikipedia.org/wiki/Havana_(Camila_Cabello_song)", "text": "2017 single by Camila Cabello featuring Young Thug\n\n\"Havana\" is a song by American singer Camila Cabello featuring American rapper Young Thug, from her debut studio album Camila (2018).[1] It was released on August 3, 2017, alongside \"OMG\" initially as a promotional single; it was later serviced to radio on September 8, 2017, as a single.[2] Due to its rising success, \"Havana\" later became the official lead single of Camila, replacing \"Crying in the Club\".[3]\n\nIn November 2017, a remix version of the song with Puerto Rican rapper Daddy Yankee was released.[4] The first verse and pre-chorus of the remix is sung in Spanish while Daddy Yankee replaces Young Thug's verse.[5]\n\n\"Havana\" received critical acclaim with music critics calling the song \"sultry\" and \"bouncy.\" \"Havana\" peaked at the top of the Billboard Hot 100, becoming the first number one song for both Cabello and Thug. Outside of the United States, \"Havana\" topped the charts in 23 countries worldwide, including Australia, Canada, Chile, France, and the United Kingdom. It is certified Diamond in eight countries. Its music video, directed by Dave Meyers, shows Cabello playing herself as Karla, as well as a telenovela actress and a film protagonist. It won the Video of the Year award at the 2018 MTV Video Music Awards, receiving three other nominations. A vertical video, directed by Sam Lecca, was released on November 10, 2017, on Cabello's official Vevo account.[6] The clip shows the singer and several dancers in the New York City Subway.[7] The clip was previously a Spotify exclusive.[8]\n\nCabello performed \"Havana\" at several award shows, including the 2017 MTV Europe Music Awards, the 2018 iHeartRadio Music Awards, and the 2018 Billboard Music Awards. In September 2018, Cabello released a live version of the song featuring her solo performance.[9][10][11] The live version of the song would later be nominated for a Grammy Award for Best Pop Solo Performance at the 61st Annual Grammy Awards.[12] It was the best-selling digital single of 2018 according to the International Federation of the Phonographic Industry (IFPI), with equivalent sales of 19 million units worldwide.[13][14]\n\n\"Havana\" was certified Diamond by the Recording Industry Association of America in October 2021 for selling 10,000,000 units,[15] making Cabello the first Hispanic singer to achieve this milestone.[16]\n\nComposition [ edit ]\n\nView of Havana, Cabello's inspiration for the song.\n\n\"Havana\" is a salsa-inspired[17] mid-tempo pop[18][19] and Latin[20] song with R&B-pop beats, on which Cabello embraces her Cuban heritage.[21][22] Cabello sings the chorus over Latin-influenced piano riffs and rhythm, with the melody's chord progression constantly switching between Gm–E♭–D 7 and Gm–E♭maj 7 –D 7 . It is performed in the key of G minor, with Cabello's vocals ranging from G 3 to D 5 .[23][24] It has the same slinky, snap-accented intro as \"Same Old Love\" by Selena Gomez, released two years before.[25] Sadie Bell of Billboard interpreted the line \"Half of my heart is in Havana\" as the song chronicling \"a romance that found Cabello's heart left down south\",[26] while for Rolling Stone's Brittany Spanos said that in the \"clubby, smooth\" track, Cabello falls in love with \"a mysterious suitor from East Atlanta\", though she has left her heart in her hometown.[27] Young Thug performs a sing-song verse over the \"bouncy\" piano.[26][19] Rap-Up described the song as a \"Latin fusion\",[20] and XXL called it a \"straightforward pop track\".[19] The second verse featuring Young Thug is replaced with the original lyrics sung by Cabello.[28][failed verification]\n\nCritical reception [ edit ]\n\n\"Havana\" received universal acclaim. Jamieson Cox of Pitchfork regarded the \"sultry, salsa-inflected\" song as a \"keystone for a superstar origin story.\"[17] Writing for Billboard, Sadie Bell said that the \"sexy\" track radiates a \"Latin flare\".[26] Similarly, Much's Allison Bowsher opined the track \"arrives just in time to keep the summer heat going on the radio.\"[29] Raise Bruner of Time wrote that \"Havana\" \"hits a freshly sultry note that we hope to see more of in her debut album.\"[30] Peter Berry of XXL felt that Young Thug's verse \"blends with the bouncy piano perfectly.\"[19] Billboard considered it the 19th best song released in 2017, with Lyndsey Havens writing that the song \"didn't arrive like a breakthrough hit, but it ended up changing the entire course\" of Cabello's solo career, as she \"sheds the weight that came with trying to prove herself outside of her former girl group and clears a path to finally be herself.\"[31] Popjustice ranked it 19th,[32] while The Fader ranked it 48th.[33] Stephen Kearse of Complex, which ranked the song 28th, wrote: \"Warm, bouncy, nostalgic, and sweaty, 'Havana' builds a one-night stand into a pulsating fever dream that blurs reality and fantasy\", praising Cabello's \"layered vocals\" and Young Thug's presence.[34]\n\nAccolades [ edit ]\n\nChart performance [ edit ]\n\nIn the United Kingdom, \"Havana\" entered the UK Singles Chart at number 53 on the chart dated August 11, 2017.[41] It rose to number two in its ninth week, behind only Post Malone's \"Rockstar\" featuring 21 Savage.[42] On November 3, it reached number one, giving Cabello and Young Thug their first UK number-one single.[43] It then held the top position for five weeks before falling behind Ed Sheeran's \"Perfect\".[44]\n\nIn October 2017, the single reached number seven on the US Billboard Hot 100 in its twelfth week, becoming Cabello's second top 10 entry as a solo artist and Young Thug's first.[45] In January 2018, \"Havana\" reached number one on the Hot 100 for one week after spending seven non-consecutive weeks occupying the number two spot behind both Post Malone and 21 Savage's \"Rockstar\" for five weeks and Ed Sheeran and Beyoncé's \"Perfect Duet\" for an additional two weeks, becoming both Cabello and Young Thug's first song to top the chart. The song took 23 weeks to reach the top spot, equaling the longest climb for a female artist with Sia's \"Cheap Thrills\" (2016) and Patti Austin's \"Baby, Come to Me\" (1982–1983). Cabello became the third artist in chart history to top both the Hot 100 and Billboard 200 for their first time in the same week, after Britney Spears and Beyoncé did so in 1999 and 2003, respectively.[46] The song has also been certified Diamond by the Recording Industry Association of America (RIAA).[47] \"Havana\" became the ninth song to top the Mainstream Top 40, Rhythmic and Adult Top 40 airplay charts–over the 22 years that all three charts have coexisted.[48]\n\n\"Havana\" reached number one on the Australian ARIA Singles Chart in its twelfth week on the chart, becoming Cabello's first number-one song, including during her time as part of Fifth Harmony.[49] It held the summit for three weeks before also being displaced by \"Perfect\".[50]\n\nThe song became Spotify's most-streamed song ever by a solo female artist in June 2018, with more than one billion streams at the time.[51]\n\nMusic video [ edit ]\n\nCabello shared a 26-second preview of the short film for \"Havana\" on October 22, 2017, through her YouTube channel. The video filmed in Los Angeles, California. The video featured appearances by Lele Pons as Bella, LeJuan James as Abuelita, Noah Centineo as Cabello's love interest, Marco DelVecchio as the twins Juan and Rodrigo and Mikey Pesante as the dancer. It was directed by Dave Meyers and was released on October 24, 2017. Young Thug also appears in the video.[52]\n\nThe film scene gave the video a \"classic\" 1960s appeal, as described by a Fuse writer. [ 53 ]\n\nThe main song starts late but the music video starts with Karla, played by Cabello, watching a telenovela, before being interrupted by her grandmother, who turns off the TV and advises her to live her life instead of spending her days indoors. Karla then leaves the house to go see a movie. The film she is watching, called Camila in Havana, takes the form of a music video, starring a version of herself wearing a fringe-covered red dress and performing at a club.[54] Aside from appearing as Karla, Cabello also plays the telenovela actress and the movie protagonist.[55][56] After the film ends, she leaves the cinema and stumbles across a cyclist, also the male protagonist of the film, and begins dancing with him.\n\nTom Breihan of Stereogum, which ranked the song 28th of 50 best music videos of 2017, reviewed on December 18, 2017: \"Camila Cabello is going to be a movie star one day, and she might still never deliver a better performance than the one she gives in this multiple-role video.\"[37]\n\nIt received four nominations at the 2018 MTV Video Music Awards, for Video of the Year, Song of the Year, Best Pop Video, and Best Choreography, winning the first.[57] As of January 2025, the video has received more than 1.11 billion views on YouTube,[58] while the audio track has over 2 billion views,[59] a total of over 3.11 billion.\n\nLive performances and remixes [ edit ]\n\nCabello performed the song for the first time on television on The Tonight Show Starring Jimmy Fallon on September 25, 2017.[60] The same week she performed on The Today Show, where she delivered a message to \"all the dreamers\" in support of the Deferred Action for Childhood Arrivals.[61] On October 27, Cabello performed a Spanglish version of the song at the Latin American Music Awards.[62] She also performed the song at the BBC Radio 1's Teen Awards,[63] LOS40 Music Awards[64] iHeartRadio Fiesta Latina,[65] and the MTV Europe Music Awards.[66] Her performance at the MTV EMAs was ranked as the best of the night by Billboard writer Joe Lynch.[67] Her performance at Billboard Women in Music was the stripped-down version of the song, backed only by a guitar, keyboard and light drumming.[68] It was also performed at Dick Clark's New Year's Rockin' Eve in 2017,[69] and later she gave a cabaret-style performance on The Ellen DeGeneres Show during the album release week.[70][71] She gave a performance inspired by Marilyn Monroe's Gentlemen Prefer Blondes role and Madonna's \"Material Girl\" music video at the 2018 iHeartRadio Music Awards with Young Thug.[72] Cabello performed the song with Ricky Martin, J Balvin, Young Thug and Arturo Sandoval as the opening act at the 61st Annual Grammy Awards in February 2019.[73] On May 28, 2022, Cabello performed the song in the 2022 UEFA Champions League Final.[74][75]\n\nSeveral remixes of the song have been made. On November 11, 2017, a remix made by Puerto Rican rapper Daddy Yankee was published on Cabello's official YouTube channel. The first verse of the remix is sung in Spanish while Daddy Yankee replaces Young Thug's verse. The video has 142 million views as of January 18, 2023.[5] Additionally, a popular remix made by YouTuber Maestro Ziikos was uploaded to YouTube on November 24 which was a remix that featured then U.S. President Donald Trump \"singing\" (the remix was made via taking excerpts from various Trump speeches and adjusting their tone to the song). Though the song was generally praised for the effort that went into it, Cabello herself, as a critic of Trump due to his plans to rescind DACA, was displeased with the remix, and after fans repeatedly asked her about it, she took to Twitter to apologize to the city of Havana for the remix.[76][77] The Trump remix has 132 million views as of January 18, 2023.[78]\n\nAwards and nominations [ edit ]\n\nTrack listing [ edit ]\n\nCredits and personnel [ edit ]\n\nCredits from the liner notes of Camila and adapted from Jaxsta.[92][93]\n\nStudio recording [ edit ]\n\nPersonnel [ edit ]\n\nTechnical Martin Gray – recording\n\nMike Gaydusek – recording\n\nRobbie Soukiasyan – recording\n\nKyle Mann – recording\n\nMarco Falcone – assistant recording\n\nSean Madden – assistant recording\n\nHenry Guevara – assistant recording\n\nJaycen Joshua – mixing\n\nDavid Nakaji – assistant mixing\n\nIvan Jimenez – assistant mixing\n\nDave Kutch – mastering\n\nLive version [ edit ]\n\nCredits adapted from Tidal.[94]\n\nCamila Cabello – vocals\n\nRyan Cecil – recording\n\nEmerson Mancini – mastering\n\nSerban Ghenea – mixing\n\nCharts [ edit ]\n\nCertifications [ edit ]\n\nRelease history [ edit ]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/98/Havana_%28featuring_Young_Thug%29_%28Official_Single_Cover%29_by_Camila_Cabello.png/250px-Havana_%28featuring_Young_Thug%29_%28Official_Single_Cover%29_by_Camila_Cabello.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/9/98/Havana_%28featuring_Young_Thug%29_%28Official_Single_Cover%29_by_Camila_Cabello.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/EL_MORRO_HABANA_EMILITO_-_panoramio.jpg/250px-EL_MORRO_HABANA_EMILITO_-_panoramio.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b0/Camila_Cabello_-_Havana_ss.png/250px-Camila_Cabello_-_Havana_ss.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/20px-Symbol_category_class.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/9/98/Havana_%28featuring_Young_Thug%29_%28Official_Single_Cover%29_by_Camila_Cabello.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Havana_(Camila_Cabello_song)", "title": "Havana (Camila Cabello song)", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/9/98/Havana_%28featuring_Young_Thug%29_%28Official_Single_Cover%29_by_Camila_Cabello.png", "width": 1200, "height": 1200}, "title": "Havana (Camila Cabello song) - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}