{"url": "en.wikipedia.org/wiki/Troian_Bellisario", "text": "American actress (born 1985)\n\nTroian Avery Bellisario (born October 28, 1985) is an American actress and filmmaker. The daughter of producer Donald P. Bellisario and actress Deborah Pratt, she gained international attention for her portrayal of Spencer Hastings in the Freeform drama series Pretty Little Liars (2010–2017), for which she received various accolades.\n\nIn film, Bellisario has received recognition for her performances in C.O.G. (2013), Feed (2017)—which she also wrote and produced—Clara (2018), and Where'd You Go, Bernadette (2019). On television, Bellisario appeared in the television drama film Sister Cities (2016), the web series Lauren (2012–2013), and the police procedural series On Call (2025). Since 2016, she has been married to actor Patrick J. Adams, with whom she has two daughters. The couple appear together in Pretty Little Liars, Suits and Clara.\n\nEarly life [ edit ]\n\nTroian Avery Bellisario was born and raised in Los Angeles. Her parents are producers Deborah Pratt and Donald P. Bellisario;[1] her father created Magnum, P.I., Quantum Leap, and NCIS, among other TV series. She has a younger brother,[4] three half-sisters, two half-brothers, and two stepbrothers, actor Sean Murray and producer Chad W. Murray. Her father is of Italian and Serbian descent,[5] and her mother is of African American descent.[6]\n\nAttending Campbell Hall School in Studio City, California, from kindergarten through twelfth grade,[7] Bellisario was top of her class.[8] After high school, she attended Vassar College for several months before taking a break for the sake of her mental health, feeling that the institution aggravated her perfectionist tendencies.[9] She graduated with a Bachelor of Fine Arts degree from the University of Southern California in 2009.[10]\n\nCareer [ edit ]\n\nEarly work [ edit ]\n\nBellisario made her acting debut in the 1988 film Last Rites at the age of three,[11] which was directed, written and produced by her father, Donald P. Bellisario. In 1990, she guest-starred in an episode of her father's series Quantum Leap. In 1998, she co-starred with Mary-Kate and Ashley Olsen in the film Billboard Dad. Beginning in 2006, Bellisario began appearing in a number of independent short films namely, Unspoken, Archer House and Intersect.\n\n2010s [ edit ]\n\nIn November 2009, Bellisario was cast as Spencer Hastings in the TV series Pretty Little Liars based on the book series of the same name by Sara Shepard.[12] In October 2011, Bellisario announced she was in the process of writing and creating her own film, which was successfully funded through Kickstarter on November 16, 2011. Filming ended in December 2011 and the film was officially completed by August 2012.[13]\n\nBellisario (far left) with the cast of Pretty Little Liars in 2014\n\nIn 2014, she starred in the music video for The Head and the Heart's song \"Another Story\".[14] Bellisario also starred in Immediately Afterlife, a short film about two cult members who are the only survivors of their group's mass suicide, playing Bennett, alongside her Pretty Little Liars co-stars Shay Mitchell (Emily), Ian Harding (Ezra Fitz) and Nolan North (Peter Hastings).[15] In 2015, she was cast in a leading role in the American remake of the French-Canadian film Martyrs.[16][17] In 2015, Bellisario and fiancée Patrick J. Adams filmed the short film We Are Here in Haida Gwaii, which Bellisario wrote and starred in.[18] In 2017, Bellisario starred in her feature film, Feed, which she also wrote and produced. The film was written based on Bellisario's own experiences with an eating disorder.[19]\n\nOn April 7, 2016, it was announced that Bellisario would be directing season 7, episode 15 of Pretty Little Liars.[20] This made her one of the first in the cast, alongside Chad Lowe, to direct an episode on the series. In 2020, Bellisario appeared as the bride character Jenna Marshall from the episode \"Til Dex Do Us Part\" in Stumptown.[21]\n\nFurther in television, she costarred with Australian actress Jacki Weaver in the television drama film Sister Cities (2016), and opposite Bradley Whitford in the Me Too drama Lauren (2012–2013). In film, Bellisario has received recognition for her performances in C.O.G. (2013), Feed (2017), Clara (2018) and Where'd You Go, Bernadette (2019).\n\n2020s [ edit ]\n\nIn March 2020, Bellisario played the lead role of Claire in the CBS political drama pilot Ways & Means, written by Mike Murphy and Ed Redlich.[22] The pilot, which also starred Patrick Dempsey, focused on a secret alliance between a disillusioned career politician and an idealist up-and-comer in the gridlocked American system. The show was not picked up.[23]\n\nIn 2022, she appeared in the comedy Doula alongside Arron Shiver (who also wrote the film) and Will Greenberg.[24] The film, produced by Chris Pine and directed by Cheryl Nichols, deals with Bellisario's character hiring her midwife's son as the latter's replacement when she passes away.\n\nPersonal life [ edit ]\n\nBellisario began dating Suits star Patrick J. Adams after they met on the set of the play Equivocation in 2009.[25] The couple briefly separated before Adams' guest appearance as Hardy in Pretty Little Liars but reunited in 2010.[26] Since working on Equivocation and Pretty Little Liars, the couple also worked together on the 2012 short film The Come Up, Suits, and the short film We Are Here. Bellisario and Adams were married on December 10, 2016, in Santa Barbara, California.[27][28] They have two daughters, Aurora[29] and Elliot.[30] On November 4, 2025, Adams announced the third pregnancy of Bellisario on his Instagram page.[31]\n\nIn an episode of actress Katie Lowes' podcast, Katie's Crib, Bellisario and Adams said their second child was born in the backseat of their car at the hospital parking lot due to an accelerated labour, with Adams delivering the baby. Hospital staff assisted within minutes of the delivery, and Bellisario and the baby were found healthy.[32][33]\n\nBellisario said in January 2014 that she endured personal problems during high school, resulting in self-harm and an eating disorder. \"I was the youngest daughter, the perfect little girl. My school was a very intense college prep school. So it was about wanting to please my father and mother and wanting to be perfect to everybody.\"[34]\n\nIn 2014, Bellisario returned to her alma mater, USC School of Dramatic Arts, delivering the commencement speech.[35]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nYear Title Role Notes 1988 Last Rites Nuzo's daughter 1998 Billboard Dad Kristen Bulut 2006 Unspoken Jani Short film 2007 Archer House Tatum Short film 2009 Intersect Victoria Short film Before the Cabin Burned Down Meg Short film 2010 Consent Amanda Peep World Film set P.A. 2011 A November Girlfriend Short film Pleased to Meet You Carson 2012 Jessica Short film Joyful Girl Belle Short film 2013 C.O.G. Jennifer Exiles Juliet Short film; also writer and executive producer 2014 Immediately Afterlife Bennett Short film 2015 Surf Noir Lacey Short film Martyrs Lucie Jurin Still a Rose Juliet Short film Amy Amy Short film 2016 In the Shadows of the Rainbow Short film 2017 Chuck Hank and the San Diego Twins Claire Feed Olivia Grey Also writer and producer 2018 We Are Here Woman Short film; also producer and writer Clara Clara 2019 Where'd You Go Bernadette Becky Like Turtles Molly Short film; also producer 2020 Life on Mars Stella Short film; also writer 2021 Poppet Maeve Short film; also producer and writer 2022 Doula Deb\n\nTelevision [ edit ]\n\nRadio [ edit ]\n\nWeb [ edit ]\n\nMusic videos [ edit ]\n\nDirector [ edit ]\n\nYear Title Episode(s) Notes 2017 Pretty Little Liars \"In the Eye Abides the Heart\" Directorial debut 2018 Famous in Love \"Guess Who's (Not) Coming to Sundance?\" 2019–2023 Good Trouble 6 episodes 2020 Life on Mars — Short film\n\nAwards and nominations [ edit ]", "images": ["http://en.wikipedia.org/static/images/icons/wikipedia.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/Cast_of_Pretty_Little_Liars_at_Paley_Fest2014.jpg/500px-Cast_of_Pretty_Little_Liars_at_Paley_Fest2014.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Troian_Bellisario_in_Manila.jpg/960px-Troian_Bellisario_in_Manila.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Ashley_Benson_and_Troian_Bellisario.jpg/250px-Ashley_Benson_and_Troian_Bellisario.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Troian_Bellisario_in_Manila.jpg/250px-Troian_Bellisario_in_Manila.jpg", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "http://en.wikipedia.org/static/images/footer/wikimedia.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Troian_Bellisario_in_Manila.jpg/960px-Troian_Bellisario_in_Manila.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Troian_Bellisario", "title": "Troian Bellisario", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Troian_Bellisario_in_Manila.jpg/960px-Troian_Bellisario_in_Manila.jpg", "width": 940, "height": 1200}, "title": "Troian Bellisario - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}