{"url": "www.thisisinsider.com/kylie-jenner-travis-scott-relationship-timeline-2018-7", "text": "lighning bolt icon An icon in the shape of a lightning bolt.\n\nlighning bolt icon An icon in the shape of a lightning bolt. Impact Link\n\nNeither Jenner nor Scott can remember when or where they actually met.\n\nAccording to the couple's cover story for GQ, neither Jenner nor Scott \"can remember where, exactly, they first met.\" Both did admit, however, that Jenner was convinced Scott didn't like her at first.\n\n\"We always knew each other, like we were hanging around each other — I mean, we just had mutual friends,\" she said in a video for GQ. \"But we never really had a conversation because I thought that he didn't like me.\"\n\nMarch 2017: Jenner ended her long-term relationship with Tyga\n\nJenner confirmed her relationship with Tyga in August 2015. Dimitrios Kambouris/Getty Images\n\nRumors began to swirl when fans realized Tyga had not made an appearance on Jenner's social media since Valentine's Day of that year.\n\nLater in the month, Tyga's ex-fianceé Blac Chyna heavily suggested in a Snapchat rant that he had been cheating on Jenner, as reported by Cosmopolitan.\n\n\"Multiple sources\" confirmed the split to People in early April. At the time, these sources framed the break-up as a brief separation — which seemed consistent with the couple's on-and-off relationship.\n\n\"They tend to take little breaks all the time and then get back together,\" says one insider. \"It's definitely possible they'll work things out again.\"\n\nJenner later opened up about the split on an episode of \"Life of Kylie,\" stating that the two will \"always have a bond.\"\n\n\"There was absolutely nothing wrong with me and T,\" she revealed. \"There was no crazy fight. We decided — well, I decided — that I'm really young. I don't want to look back in five years from now and feel like he took something from me, when he's really not that type of person.\"\n\nApril 16, 2017: Jenner and Scott were spotted holding hands at Coachella\n\nJenner and Scott both attended the \"PrettyLittleThing\" campaign launch on April 11, 2017. Paul Archuleta/JB Lacroix/WireImage\n\nCoachella wasn't exactly the couple's first date — but rather \"a hang that went well,\" according to the couple's cover story for GQ. Fan photos revealed that Jenner and Scott were holding hands as they roamed the grounds of the famous music festival.\n\nA source told People at the time that the two had been \"a thing\" before and \"friends for a while\" — but also implied that their flirtation was designed to make Tyga jealous. In reality, the two just \"hit it off\" and had immediate chemistry, according to Jenner's former best friend Jordyn Woods.\n\nJenner opened up about the beginning of their relationship to GQ and revealed that, after Coachella, she spontaneously decided to join Scott on his tour.\n\n\"He said, 'I'm going back on tour — what do we want to do about this?' Because we obviously liked each other,\" she said. \"And I was like, 'I guess I'm going with you' ... And then we rode off into the sunset.\"\n\nApril 25, 2017: Jenner and Scott sat courtside at an NBA playoff game\n\nScott and Jenner sat courtside on on April 25, 2017. Bob Levey/Getty Images\n\nAn eyewitness told People that the two were holding hands and cuddling. The onlooker also added that Jenner was kissing Scott's neck and seemed like \"she wanted people to see them together.\"\n\n\"During his performance, Kylie was hiding in the Rockets' courtside club anxiously waiting for him to come back to her. Once he got back, they definitely looked like a couple, cuddled up next to each other among her friends,\" the source told People. \"They haven't let go of each other since he got off the court.\"\n\nIn late April or early May, Jenner became pregnant.\n\nStormi Webster was born on February 1, 2018. This would put her conception date nine months prior, on or around May 1, 2017.\n\nMay 1, 2017: Jenner and Scott hung out at the Met Gala.\n\nJenner at the 2017 Met Gala. Noam Galai/FilmMagic\n\nJenner posted a group photo from the Met Gala on Instagram, in which Scott is posing front and center.\n\nJust before attending the event — and after jetting to Boston to watch Scott perform — Jenner reflected on their relationship during a confessional for \"Life of Kylie.\"\n\n\"I didn't realize I would go through a breakup and then like, you know, start dating again,\" she said.\n\nMay 2017: Fans noticed that the pair had become inseparable.\n\nScott was performing concerts for his Bird's Eye View tour from March until June. Kylie Jenner/YouTube\n\nAfter deciding to \"ride off into the sunset\" and join Scott on his tour, Jenner and her new beau had \"a lot of downtime\" to get to know each other.\n\n\"It was organic. And we would just go to these random cities. We got to not be who we really were,\" she told GQ. \"Everything happened for a reason. We weren't going out as 'Kylie and Trav.' We would just be in Cleveland, walking the street for hours. We would go on walks, and no one would bother us.\"\n\nOn May 3, Us Weekly reported that the couple was getting serious.\n\n\"Travis is telling friends that he and Kylie are the real deal,\" a source told the magazine.\n\nThe reality star had been spotted celebrating Scott's birthday in New York City with her sister Kendall Jenner and other friends. A week later, they spent a cozy night together on a yacht in Miami.\n\n\"Sources close to the couple tell us they've been inseparable since Coachella and have decided to do the committed relationship thing,\" TMZ reported on May 14. The website also revealed that Jenner had already met Scott's family.\n\nMay 15, 2017: Scott released the song 'Butterfly Effect'\n\nScott in the music video for \"Butterfly Effect.\" Travis Scott/YouTube\n\nThe \"butterfly effect\" is the concept that small decisions or events can cause large, lasting ripples. While the song never explicitly mentions Jenner, he does rap about a girl who \"caught the waves.\"\n\n\"Need ya love, not a need it is a must / Feelin' stuck, you know how to keep me up / Icy love, icy like a hockey puck,\" he raps.\n\nThe day after the song was released, Scott posted a photo of Jenner on his Instagram with the caption, \"BUTTERFLY EFFECT 🦋🦋🦋🦋🦋.\"\n\nButterflies would later become an important motif for the couple.\n\nJune 12, 2017: Jenner filmed herself listening to Scott's verse on SZA's 'Love Galore'\n\nSZA and Scott in the \"Love Galore\" music video. SZA/YouTube\n\nJenner posted a Snapchat selfie video of herself mouthing the lyrics while driving, as she is wont to do. In the song, Scott raps about \"planting a seed\" and getting a girl pregnant.\n\nJune 12, 2017: Jenner and Scott debuted matching butterfly tattoos\n\nThe tiny tattoos are barely noticeable. Kylie Jenner/Travis Scott/Snapchat\n\nEach of them shared caption-free Snapchat photos of their minimal butterfly tattoos. Jenner got hers on her right ankle, whereas Scott's is inked on his left ankle.\n\nJuly 5, 2017: Jenner covered her Tyga tattoo\n\nJenner got a lowercase letter \"T\" tattooed on her ankle while she was dating her ex-boyfriend Tyga. In early July, she cleverly transformed the \"T\" into the letters \"LA,\" in honor of her Californian roots.\n\nSeptember 22, 2017: News broke that Jenner was pregnant\n\nJenner at the 2017 iHeartRadio Music Festival. David Becker/Getty Images\n\nTMZ broke the news that the then-20-year-old was expecting a baby with Scott. The couple apparently began telling friends earlier that month, around the time Jenner completed her first trimester.\n\nThe website also reported that Scott had told friends they were having a girl.\n\nSoon after, Kris Jenner addressed the reports in an interview with The Cut on Saturday.\n\n\"She's not confirmed anything. I think it's kind of wild that everyone is just assuming that that's just happening,\" she told the site. \"Something happens every single day. You never know what is going to break at any moment.\"\n\nFans noticed that the makeup mogul had begun to only post throwback photos, outfits with baggy clothes, or portraits on Instagram — and quickly became obsessed with spotting Jenner's baby bump.\n\nNovember 11, 2017: Jenner sparked engagement rumors\n\nJenner took to Snapchat to show off a massive sparkler on her left ring finger. Many fans assumed that Scott had popped the question.\n\nJanuary 5, 2018: Scott evaded pregnancy rumors\n\nScott hugs Jenner at a doctor appointment. Kylie Jenner/YouTube\n\nIn an interview with Billboard, Scott said he didn't want to talk about the pregnancy rumors.\n\n\"They're just guesses. Let them keep fishing,\" he said.\n\nFebruary 1, 2018: Jenner gave birth to the couple's first child\n\nJenner is shown with her newborn daughter in Scott's Netflix documentary. Netflix\n\nScott was present in the delivery room when Jenner gave birth to their first child just after 4 p.m., according to the couple's interview with GQ.\n\nJenner announced her daughter's arrival three days later on February 4 by posting emotional messages on social media.\n\n\"I'm sorry for keeping you in the dark through all the assumptions,\" she wrote. \"I knew for myself I needed to prepare for this role of a lifetime in the most positive, stress free, and healthy way I knew how.\"\n\nShe followed the birth announcement with a touching video documenting her secretive pregnancy, titled \"To Our Daughter.\" It also gave fans their first real, intimate glimpse into Jenner's relationship with Scott, who appears in the video multiple times.\n\nFebruary 7, 2018: Jenner revealed that baby Stormi is taking Scott's real last name\n\nAfter posting the first photo that showed a glimpse of her newborn, Jenner updated the caption on Instagram — which originally said \"Stormi\" — to include her daughter's full name: Stormi Webster.\n\nWebster is the real last name of her father, who was born with the name Jacques Webster, Jr. and uses Travis Scott as a stage name.\n\nFebruary 26, 2018: Scott gave Jenner a rare $1.4 million Ferrari as a 'push present'\n\nJenner took to her Instagram story to show off the extravagant gift, calling it a \"push present\" — otherwise known as a gift given to a mother from the father of her newborn child.\n\nThe rare $1.4 million USD Ferrari LaFerrari is one of just 500 units ever made, and sold out almost instantly \"before the world knew it existed,\" according to HypeBeast.\n\nApril 13, 2018: Jenner and Scott went to Coachella together (again)\n\nOne year after they began dating at the very same festival, the new parents returned to their original stomping grounds and attended Coachella together. She rocked bright pink hair for the occasion.\n\nApril 28, 2018: Jenner rented out Six Flags to celebrate her boyfriend's birthday\n\nApparently, Scott — whose 2018 album is named \"Astroworld\" after a theme park in Texas — had never actually been to Six Flags. So Jenner rented out an entire Six Flags for a birthday celebration. Their friend group shared numerous photos of the outing on Instagram.\n\nThe couple also celebrated with a cake in the shape of a roller coaster, featuring little figurines of the two with their daughter.\n\nMay 1, 2018: The Jenner-Webster family took their first vacation all together\n\nJenner and Scott took their 3-month-old daughter to Turks and Caicos, sharing several family photos and romantic beach shots.\n\nMay 3, 2018: Scott released a song that seems to feature Jenner's vocals\n\nScott is one of rap's best-selling stars. Dia Dipasupil/ Ari Perilstein/ Getty\n\nScott released a new song called \"Watch,\" which features contributions from rapper Lil Uzi Vert, Scott's pseudo brother-in-law Kanye West, and possibly Jenner herself.\n\nIn the last 30 seconds of Scott's song, a feminine voice can be heard speaking (or, one could argue, rapping) a couple of lines. Many fans are convinced that the voice belongs to Jenner — and that she references the couple's daughter in the lyrics.\n\nBecause the actual words are muffled and difficult to hear clearly, fans have been speculating that Jenner was saying, \"We got bust down Rollies, bust down Pateks / And I told him I wanted to have a bust down baby.\" \"Bust down\" is a colloquial term for \"expensive,\" particularly when it comes to jewelry or watches, like a Rolex.\n\nThe outro lyrics have since been edited twice on the popular lyrics website Genius, and now read, \"And I told him I needed him to bust down our new baby.\"\n\nMay 7, 2018: Jenner and Scott made their red carpet debut at the Met Gala\n\nScott and Jenner at the 2018 Met Gala. Theo Wargo/Getty Images\n\nScott and Jenner dressed in coordinating black looks for the opulent event, whose theme was \"Heavenly Bodies: Fashion and the Catholic Imagination.\"\n\nIt marked the first time that the couple walked a red carpet together.\n\nMay 15, 2018: Jenner expertly shut down rumors that her bodyguard is Stormi's real father\n\nComparisons between Stormi, Scott, and Jenner's bodyguard Tim Chung popped up in every corner of the internet that attempts to keep up with the Kardashians. In fact, the rumors had become so rampant that Chung took it upon himself to release a statement.\n\nJenner soon followed suit and addressed the rumors — though in a far more subtle way.\n\nThe Kylie Cosmetics creator posted a photo of herself with Scott from the Met Gala. The caption reads simply, \"Stormi's Parents.\"\n\nMay 28, 2018: Jenner and Scott sat courtside (again)\n\nScott and Jenner sitting courtside 2018. Ronald Martinez/Getty Images\n\nThe two attended a playoff game between the Rockets and the Warriors in Houston, Scott's hometown.\n\nMany fans were quick to draw parallels between this date and their first sighting as a couple.\n\nJune 20, 2018: Jenner and Scott went to France together\n\nThe Kardashians attended the Louis Vuitton Menswear Spring/Summer 2019 show. Stephane Cardinale - Corbis/Corbis via Getty Images\n\nThe couple vacationed in Nice, France with Stormi — and were spotted with Kanye West, Jenner's sister Kim Kardashian West, and Jordyn Woods at an event for Paris Fashion Week.\n\n\"[Jenner and Scott] are obviously still together and genuinely so happy. They're doing really well as a couple,\" a source told Us Weekly. \"It's amazing how much Stormi has brought them together, and brought the entire family together with Kylie and Travis.\"\n\nThe source also added that Jenner is \"loving\" motherhood and Scott is a \"great dad.\"\n\n\"He's been really supportive, wants to be there for all the milestones,\" the source said. \"He's been moving work commitments to spend a much time as he can around Stormi.\"\n\nJuly 17, 2018: Jenner and Scott were featured on the cover of GQ for their first joint photo shoot\n\nJenner said that Scott doesn't like taking photos. @GQ/Instagram\n\nBoth Jenner and Scott opened up about their relationship for the rare interview.\n\n\"Kylie actually likes me for me ... I'm not into all the other shit. I don't get involved. I'm over here. Kylie is different,\" Scott told the magazine when asked if he was worried about the \"Kardashian Curse.\"\n\nJenner admitted that the two go \"the extra mile\" to keep their relationship private and oftentimes just \"do [their] own thing.\"\n\nShe also revealed \"the most romantic thing\" that Scott has ever done for her.\n\n\"On my birthday, he woke me up out of bed at like six in the morning. He was like, 'We gotta go,' and I'm just like half asleep, like, 'What do you mean? What do you mean?' And he just starts pulling me, and the sun was just coming up, and he had flowers all the way down his house and violin players everywhere,\" she said.\n\nThe couple posed for sweet photos together for the GQ cover story — one of which Jenner posted on her own Instagram with the caption \"home.\" The magazine also made a video where Jenner asks Scott 23 questions about herself, and tests how many he gets right (he doesn't know her dogs' names, for example, but he can identify her exact pizza order).\n\nAugust 3, 2018: Scott released his third studio album 'Astroworld,' which features lyrics about Jenner\n\n\"Astroworld\" debuted at No. 1 on the Billboard 200. Thaddaeus McAdams/WireImage\n\n\"Passes to my daughter, I'ma show her what it took / Baby mama cover Forbes, got these other bitches shook,\" Scott raps on \"Sicko Mode.\"\n\n\"But she know my baby mama is a trophy / She be throwing up them B's feel like we both bleed,\" he raps on \"Stargazing.\" \"I was always high up on the lean / Then this girl came here to save my life.\"\n\nAugust 20, 2018: They attended the 2018 MTV Video Music Awards together\n\nJenner and Scott at the 2018 MTV Video Music Awards. Jeff Kravitz/FilmMagic\n\nJenner was in the front row to support Scott, who performed a medley of songs from \"Astroworld.\"\n\nNovember 2018: Jenner (and Stormi) joined Scott on tour\n\nKylie Jenner and Stormi Webster backstage at Madison Square Garden. Kylie Jenner/YouTube\n\nThe family of three toured the country as Scott performed on The Wish You Were Here Tour.\n\nJenner often took to her YouTube channel to give fans a behind-the-scenes look at hers and Stormi's life on the road. Jenner even revealed that their daughter gets her own personalized VIP room at every stop on Scott's tour.\n\nDecember 2018: Scott said he'd soon propose to Jenner\n\nTravis Scott and Kylie Jenner at the 2019 Pre-Grammy Gala. Kevin Mazur/Getty Images for The Recording Academy\n\nScott discussed his relationship with Jenner with Rolling Stone for the magazine's January cover story — and even revealed they'd tie the knot soon.\n\n\"We'll get married soon. I've just got to sturdy up — I've got to propose in a fire way,\" he said.\n\nHe added: \"It got to a point where I was like, 'I need her with me to operate. She's that one.'\"\n\nFebruary 10, 2019: Scott brought Jenner as his date to the Grammys\n\nThey cuddled on the red carpet. Jordan Strauss/Invision/AP\n\nScott was nominated for three Grammys in 2019: best rap song, best rap performance, and best rap album.\n\nMay 6, 2019: They attended the Met Gala together (again)\n\nThe 2019 Met Gala theme was \"Camp: Notes on Fashion.\" Elaine Wells/STAR MAX/IPx\n\nScott wore a monochromatic ensemble, while Jenner turned heads in an all-purple look.\n\nApril 30, 2019: They got matching tattoos of their daughter's name at Scott's birthday party\n\nJenner went all out for Scott's 28th birthday party, which featured \"Astroworld\" merchandise in wall-to-wall fridges, Scott-branded cleaning supplies and snacks, Cactus Jack sneakers (Scott's own collaboration with Air Jordan) as decorations, and a Hennessy slurpee machine.\n\nThere was even a pop-up tattoo parlor, where both Jenner and Scott got seemingly spontaneous new ink.\n\nThe matching tattoos of Stormi's name were later revealed by the artist, Jon Boy, on his Instagram.\n\nRead more: Kylie Jenner has gotten 9 tattoos (and counting). Here's where they are and what they all mean.\n\nAugust 28, 2019: Netflix released a documentary about Scott, which featured multiple scenes with Jenner\n\nThe couple at the premiere of \"Travis Scott: Look Mom I Can Fly.\" Rich Fury/Getty Images\n\n\"Travis Scott: Look Mom I Can Fly\" follows the creation of Scott's No. 1 album \"Astroworld\" and his rise to prominence as a rapper — but some of its best and most intimate moments are between Scott and his long-term girlfriend.\n\nThe footage even includes some early moments in their private relationship and Scott's reaction to the birth of their daughter.\n\nSeptember 2019: They posed together for Playboy's 'Pleasure Issue'\n\nPlayboy's Twitter posted this photo with the caption, \"Wild in Love.\" Playboy/Twitter\n\nJenner teased their steamy photoshoot on Instagram, posting a photo of herself — apparently naked, save for a cowboy hat — embracing Scott.\n\n\"When Houston meets LA,\" she wrote in the caption, tagging Playboy.\n\nJenner is featured on the cover of the magazine's \"Pleasure Issue,\" photographed by Sasha Samsanova and creative directed by Scott. He also interviewed her for the cover story.\n\nAfter Jenner noted that she and Scott \"have the same goals and passions in life,\" Scott added: \"A lot of people claim that having a baby can hurt your sex life, but I feel like that's the opposite of our experience.\"\n\nJenner agreed: \"Yeah, I feel like we've definitely proven that rumor to be wrong.\"\n\nOctober 1, 2019: News broke that Jenner and Scott were 'taking some time but not done'\n\nAfter Jenner went stag to Justin Bieber and Hailey Baldwin's wedding on September 30, 2019, bringing her 1-year-old daughter but not Scott, TMZ reported that \"things have cooled\" in their relationship.\n\nA source close to Jenner told People magazine that the couple \"are taking some time but not done.\"\n\n\"They still have some trust issues but their problems have stemmed more from the stress of their lifestyles,\" the source told People.\n\nA source echoed a similar sentiment to E! News, saying that Jenner and Scott \"aren't officially calling it quits on their relationship, but are taking space apart,\" adding that career pressures were impacting their relationship.\n\nOctober 3, 2019: Jenner confirmed the split\n\nThe two stars went their separate ways. Kevin Mazur/Getty Images; Rachel Luna/WireImage\n\n\"Travis and i are on great terms and our main focus right now is Stormi,\" Jenner wrote on Twitter, confirming the breakup reports. \"our friendship and our daughter is priority.\"\n\nMarch 8, 2020: TMZ claimed that Jenner and Scott had gotten back together\n\nJenner posted these photos on Instagram, stoking rumors of a reconciliation. @kyliejenner/Instagram\n\nTMZ and Entertainment Tonight cited anonymous sources, both claiming that Jenner and Scott officially reunited sometime in February.\n\n\"The couple has always had love and respect for one another but took a break last year because they both had so much going on. They couldn't fully focus on what it took to make the relationship work,\" a source told Entertainment Tonight.\n\n\"Although things haven't slowed down much for the duo, they're better able to handle it,\" the source continued. \"At the end of the day, the couple is happy to have their family back together.\"\n\nThe news came about one week after Jenner posted old photos of herself and Scott on her Instagram story.\n\nThe set of three photos, which were taken during Jenner and Scott's first public outing as a couple back in April 2017, feature the two sitting courtside at a basketball game, looking very flirty. She captioned them, \"It's a mood.\"\n\nHowever, neither star publicly addressed the reports or confirmed their relationship status.\n\nMay 2021: More reports claimed they were 'exploring their relationship romantically again'\n\nKylie Jenner and Travis Scott photographed in May and June 2021. MEGA/GC Images; Prince Williams/Wireimage\n\nAfter a year of conflicting reports and zero confirmations, the pair sparked reconciliation rumors yet again when Jenner flew to Miami for Scott's birthday.\n\nJenner shared a video with Scott in the club, who was dancing and flirtatiously tapping her foot. A fellow club goer also filmed the two talking closely on the dance floor.\n\n\"Kylie and Travis are messing around and having fun together,\" an anonymous source told Entertainment Tonight. \"They've always had a strong connection and chemistry and they're exploring their relationship romantically again.\"\n\nShortly after, Jenner shut down a report from the Daily Mail that claimed she and Scott were in an open relationship, calling the rumor \"disrespectful\" and \"careless.\"\n\n\"You guys really just make up anything,\" she wrote on Twitter, stopping short of clarifying where she and Scott stood.\n\nJune 15, 2021: Jenner and Scott attended an event together and acted like a couple\n\nTravis Scott and Kylie Jenner attend the 72nd annual Parsons Benefit on June 15, 2021. Craig Barritt/Getty Images for The New School\n\nScott was honored at the 72nd annual Parsons Benefit as a \"visionary\" in \"fashion, technology and the arts.\"\n\nHe and Jenner walked the red carpet with their daughter, and the rapper gave his family a sweet shout-out onstage.\n\n\"Stormi, I love you and wifey, I love you,\" he said during his speech, according to E! News.\n\n\"Travis and Kylie were being very sweet and cute together,\" an attendee told People. \"They were holding hands and seemed fully back on.\"\n\nFor her part, Jenner shared a photo on Instagram with Scott's arms wrapped around her, captioned \"24 hours in NYC.\"\n\nSeptember 7, 2021: Jenner confirmed she was pregnant with the couple's second child\n\nJenner in her pregnancy announcement video. @kyliejenner/Instagram\n\nAfter weeks of speculation, Jenner shared a video on Instagram to announce her second pregnancy.\n\nThe video begins with Jenner showing Scott a positive pregnancy test, and he reacts by wrapping his arms around her belly.\n\nBoth Scott and Stormi appear throughout the montage, supporting Jenner at ultrasound appointments and sitting together at her 24th birthday dinner in August.\n\nFebruary 2, 2022: Jenner gave birth to the couple's second child, a son\n\nScott and Jenner with Stormi in \"To Our Son.\" Kylie Jenner/YouTube\n\nJenner announced the birth of their second child on February 6, 2022. She shared a black and white photo of the newborn's hand with the caption: \"💙 2/2/22.\"\n\nShortly after, she announced their son's name as Wolf Webster on Instagram.\n\nHowever, after sharing a touching video tribute to their son the following month, she revealed the couple had since changed their minds, though she did not clarify what his new name would be.\n\n\"FYI our son's name isn't Wolf anymore,\" Jenner wrote on her Instagram story. \"We just really didn't feel like it was him.\"\n\nMay 15, 2022: They returned to the red carpet as a family at the Billboard Music Awards\n\nThe Jenner-Scott family at the 2022 Billboard Music Awards. Matt Winkelmeyer/Getty Images\n\nJenner and Scott made their 2022 Billboard Music Awards appearance a family affair by bringing along their daughter.\n\nIt was the couple's first public appearance since the birth of their son and first red carpet together since the 2021 Parsons Benefit.\n\nOctober 22, 2022: Scott denied cheating on Jenner with a woman claiming to be his ex\n\nScott took to his Instagram story to address the claim that he cheated on Jenner with Instagram model Rojean Kar, who was previously linked to Scott in 2019.\n\nKar had recently shared a video on her private Instagram story that showed Scott working on a music video set.\n\n\"It's a lot of weird shit going on,\" Scott wrote. \"An uninvited person was sneaking photos on, what was supposed to be, a closed set while I was directing a video. I'm saying this for the last time. I don't know this person. I've never been with this person. So please stop with the continuous cyber games and the fictional storytelling.\"\n\nDecember 2, 2022: The couple packed on the PDA during an event at Art Basel Miami\n\nScott and Jenner cuddled at a party in Miami. Alexander Tamargo/Getty Images\n\nJenner attended Wayne and Cynthia Boich's Art Basel party, where Scott and 50 Cent both performed.\n\nThe couple was photographed cuddling and sharing a glass of wine.\n\nJanuary 7, 2023: News broke that Jenner and Scott had split again\n\nAccording to Us Weekly, the couple broke up after spending the holiday season apart.\n\n\"This has happened so many times before, they're known to be on again off again, but always remain friends and great coparents,\" an anonymous source told the outlet.\n\nPeople later corroborated the report, claiming Jenner is \"focused on her kids and business,\" not her relationship with Scott. Their source added, \"This is probably not the end of their relationship.\"\n\nJanuary 21, 2023: Jenner announced the couple had renamed their son Aire\n\nJenner shared a series of photos on Instagram, showing her son's face for the first time since she announced his birth.\n\nThe caption simply reads \"Aire\" with a white heart.\n\nNearly two months later, she filed to legally change his name, per TMZ.\n\nFebruary 14, 2023: Jenner shared photos with her best friend instead of Scott for Valentine's Day\n\nJenner appeared to confirm breakup reports by dedicating her Valentine's Day to Anastasia Karanikolaou (aka Stassie) on Instagram.\n\nThe reality star shared a series of photos with Karanikolaou, including a shot of the two women kissing. She captioned the post, \"forever valentine.\"\n\nLater, during an episode of Hulu's \"The Kardashians,\" Jenner denied that she and Karanikolaou are romantically involved, calling the rumors \"funny.\"\n\n\"When we get a little alcohol in our system, we just like to kiss each other and stuff,\" she said.\n\nSeptember 4, 2023: Jenner and Timothée Chalamet were filmed kissing\n\nTimothée Chalamet and Kylie Jenner at the Met Gala in 2021 and 2023. Sean Zanni/Patrick McMullan/Theo Wargo via Getty Images\n\nAfter months of rumors about Jenner dating the Oscar-nominated actor, they went public at a Beyoncé concert in Los Angeles.\n\nJenner and Chalamet were spotted cuddling and smooching in the VIP section at the Renaissance Tour, apparently confirming reports of their romance.\n\nShortly after the photos and videos were published, an anonymous source told People their relationship is \"fun and uncomplicated.\"\n\n\"They have been seeing each other for six months now. He makes Kylie happy,\" the source said. \"He has his own life and understands that Kylie needs to prioritize her kids.\"", "images": ["http://www.thisisinsider.com/public/assets/logos/stacked-black.svg", "http://www.thisisinsider.com/public/assets/INSIDER/US/logos/Insider-logo-dark-opt.svg", "http://www.thisisinsider.com/public/assets/INSIDER/US/logos/silicon-alley-insider.svg", "https://i.insider.com/651f2ddf6561dd877e7242d0?width=168&format=jpeg&auto=webp&crop=1:1,smart", "https://sb.scorecardresearch.com/p?c1=2&c2=9900186&cv=3.6.0&;cj=1&comscorekw=", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "http://www.thisisinsider.com/public/assets/badges/google-play-badge.svg", "https://i.insider.com/6418b47850c7b20018f1519e?width=1200&format=jpeg", "http://www.thisisinsider.com/public/assets/INSIDER/US/logos/news-insider.svg", "http://www.thisisinsider.com/public/assets/INSIDER/US/logos/insider-media.svg", "http://www.thisisinsider.com/public/assets/MI/logos/markets-insider-stacked.svg", "http://www.thisisinsider.com/public/assets/BI/DE/logos/BI-DE-Black-on-Light-final-footer-logo-opt.svg", "http://www.thisisinsider.com/public/assets/BI/US/logos/Tech-Insider-opt.svg", "http://www.thisisinsider.com/public/assets/logos/placeholder.png", "http://www.thisisinsider.com/public/assets/badges/app-store-badge.svg", "http://www.thisisinsider.com/public/assets/INSIDER/US/logos/insider-com-trademark-opt.svg", "data:image/svg+xml,%3C%3Fxml version='1.0' encoding='UTF-8'%3F%3E%3Csvg xmlns='http://www.w3.org/2000/svg' width='1' height='1'/%3E", "https://i.insider.com/6418b53050c7b20018f151ef?width=700", "http://www.thisisinsider.com/public/assets/INSIDER/US/logos/insider-inc.svg"], "top_img": "https://i.insider.com/6418b47850c7b20018f1519e?width=1200&format=jpeg", "keywords": [], "authors": ["Callie Ahlgrim", "Enter Your Email", "Follow Authors", "Never Miss A Story"], "canonical_link": "https://www.businessinsider.com/kylie-jenner-travis-scott-relationship-timeline-2018-7", "title": "A complete timeline of Kylie Jenner and Travis Scott's on-and-off relationship", "meta_data": {"version": "251119.1208", "viewport": "width=device-width, initial-scale=1", "title": "A complete timeline of Kylie Jenner and Travis Scott's on-and-off relationship", "datePublished": "2023-09-06T20:46:19.792Z", "dateModified": "2023-09-06T20:46:19.792Z", "news_keywords": "Entertainment, Kylie Jenner, Celebrities, Celebrity Couples", "description": "Jenner and Scott began dating in 2017 after hitting it off at Coachella. They share two children, but reportedly split after welcoming their son Aire.", "author": "Callie Ahlgrim", "article": {"publisher": "businessinsider"}, "tbi-vertical": "Entertainment", "og": {"title": "A complete timeline of Kylie Jenner and Travis Scott's on-and-off relationship", "description": "Jenner and Scott began dating in 2017 after hitting it off at Coachella. They share two children, but reportedly split after welcoming their son Aire.", "type": "article", "url": "https://www.businessinsider.com/kylie-jenner-travis-scott-relationship-timeline-2018-7", "image": {"identifier": "https://i.insider.com/6418b47850c7b20018f1519e?width=1200&format=jpeg", "type": "image/jpeg", "width": 1200, "height": 600}, "site_name": "Business Insider"}, "twitter": {"card": "summary_large_image"}, "robots": "max-image-preview:large", "fb": {"pages": 20446254070}, "apple-itunes-app": "app-id=554260576", "linkedin": {"owner": "mid:1d5f7b"}, "ii-ab-test": {"psvp": "c"}, "user-status": "anonymous", "viking-id": "5b5203ec51dfbe1d008b45ab", "env": "prod", "mrf": {"sections": "Entertainment", "tags": "Page Type:story"}, "msapplication-config": "/public/assets/BI/US/favicons/browserconfig.xml?v=2025-05", "theme-color": "#fff", "apple-mobile-web-app-title": "Business Insider"}, "movies": [], "publish_date": null, "source": "http://www.thisisinsider.com", "summary": ""}