{"url": "https://en.wikipedia.org/wiki/Holly_Madison", "text": "American television personality\n\nHolly Madison (born Hollin Sue Cullen;[1] December 23, 1979[2]) is an American television personality, best known as a former girlfriend of Hugh Hefner and for her appearance in the reality television show The Girls Next Door. She also starred in her own reality series, Holly's World, which ran from 2009 to 2011. She has released two books, Down the Rabbit Hole in 2015, about her life in the Playboy Mansion and her relationship with Hefner, and The Vegas Diaries: Romance, Rolling the Dice, and the Road to Reinvention in 2016.[3]\n\nEarly life [ edit ]\n\nMadison was born Hollin Sue Cullen[1] in Astoria, Oregon.[4][1] At age two, she moved with her family to Craig, Alaska, on Prince of Wales Island.[5] When she was in middle school, her family returned to St. Helens, Oregon. She later attended Portland State University for two years, majoring in theater and psychology.[5] Afterward, Madison moved to Los Angeles and attended Loyola Marymount University.[4]\n\nTo afford her college tuition, Madison competed to become a Hawaiian Tropic model and worked as a waitress at Hooters.[6] Her appearance at those venues led to invitations to the Playboy Mansion and, at the age of 21, after more than a year of such visits, Madison asked permission from Hugh Hefner and was eventually allowed to move in at the mansion.[7]\n\nCareer [ edit ]\n\nRelationship with Hugh Hefner and Playboy [ edit ]\n\nFacing credit card debt and potential homelessness, in August 2001, Madison moved into the Playboy Mansion and officially became one of Hugh Hefner's girlfriends. Hefner controlled her finances, enforced a strict schedule and curfew, and denied her opportunities to earn income outside the mansion.[8] In February 2002, after all but two of his girlfriends left, Madison became his \"#1 Girl\".[4] During her time with Hefner, Madison stated that she wanted to marry him and have his children. However, in an interview at the Playmate of the Year luncheon in May 2008, Hefner said, \"I love Holly very much and I think we're going to be together the rest of my life, but marriage isn't part of my puzzle. It's not a personal thing; I just haven't had much luck with marriages.\"[9] Reflecting on her time at the mansion, Madison claimed that her feelings for Hefner were attributable to Stockholm syndrome.[8]\n\nOn October 7, 2008, Madison announced that her relationship with Hefner had ended, but that she, Bridget Marquardt and Kendra Wilkinson were \"still filming stuff together\".[10] Hefner confirmed the breakup, saying, \"If Holly says it's over, I guess it's over\".[11] Madison was later among the former Playmates who spoke out in the docuseries Secrets of Playboy.[12][13]\n\n2005–2009: The Girls Next Door [ edit ]\n\nMadison with then-boyfriend Hugh Hefner in 2008\n\nThe Girls Next Door was an E! Network show following life of Madison and others at the Playboy Mansion. Although Madison was never a Playboy Playmate, Playboy published a nude pictorial of Madison with her The Girls Next Door costars in the November 2005 issue. The women were featured again on the covers of the September 2006, March 2008, and February 2009 issues. During seasons three and four, Madison was shown working at the Playboy studios as an intern and later a junior photo editor. She also helped design and put together The Girls Next Door calendars. In February 2009, with the ending of the sixth season she quit working for the company altogether due to her split from Hefner making her position \"awkward\".[14]\n\nAfter The Girls Next Door [ edit ]\n\nMadison was chosen to replace Jewel on season 8 of Dancing with the Stars and was partnered with Dmitry Chaplin.[15][16] She and Chaplin were voted off in a double elimination, ultimately placing 11th.[17]\n\nIn May 2009, Madison and Las Vegas Mayor Oscar Goodman led a Guinness World Record-breaking \"largest bikini parade ever\".[18] According to the Las Vegas Sun, \"The politician and the former Playboy house bunny joined forces to usher in the city's summer swimsuit season...\" in an event timed to coincide with the 50th anniversary of the Welcome to Fabulous Las Vegas sign.[18] The 281 parade participants broke the prior record of 250.[18] The mark has subsequently been eclipsed by events in the Cayman Islands (331),[19] and Brisbane, Australia (357).[19]\n\n2009–2012: Peepshow [ edit ]\n\nMadison starred in the burlesque show Peepshow at Planet Hollywood in Las Vegas. She was brought in to replace Kelly Monaco after Monaco's three-month contract was up.[20] Madison was likewise initially signed to a three-month contract, but due to the show's success, it was eventually extended to a full year.[21]\n\n2009–2011: Holly's World [ edit ]\n\nMadison starred in her own reality show, Holly's World,[22] which revolved around her life at Planet Hollywood in Las Vegas. \"It's all good-natured and not mean like other reality shows\", Madison said of her show. \"I'm really excited about the new series because I am also getting a legitimate co-producer credit for all the work I do behind the camera. It's not a vanity credit. I'm super excited to learn from the best and take on new responsibilities.\"[23] The show premiered on December 6, 2009, and ran for two seasons.[24]\n\n2022: Secrets of Playboy [ edit ]\n\nIn 2021, Madison shared in an interview some of the dark sides of the Playboy lifestyle, as further revealed in 2022 in the A&E documentary series Secrets of Playboy.[25] Madison was the subject of the show's second episode which aired in January 2022.[12] She described, among other things, the Playboy Mansion as \"dangerous\" and \"very cult-like\" and accused Hefner of manipulating her in order to advance her career and even attempting to offer her quaaludes during their first sexual encounter in the summer of 2001.[12] She also said that she was often addicted to alcohol during their relationship and that Hefner would often have photographs taken of her and his other girlfriends when they were naked after getting drunk.[12] Madison alleged this enabled him to use blackmail in order to maintain their relationship.[12] She also maintained her previous allegation that she had Stockholm syndrome during her relationship with Hefner as well, stating \"I definitely thought I was in love with Hef but it was very Stockholm syndrome, very Stockholm syndrome.\"[12]\n\nPublications [ edit ]\n\nIn 2015, Madison released her memoir Down the Rabbit Hole: Curious Adventures and Cautionary Tales of a Former Playboy Bunny.[26] The book details her life in the Playboy Mansion and the beginning of her recovery afterward.[27] She alleged, among other things, that the environment she experienced while at the mansion was a \"twisted world\" that led to her being tempted to commit suicide.[28][29]\n\nIn May 2016, Madison released her second memoir, The Vegas Diaries: Romance, Rolling the Dice and the Road to Reinvention,[30] which also debuted on the New York Times Best Seller list.[31] The book chronicles her journey toward reinvention and self-acceptance in glamorous Las Vegas.[32]\n\nPersonal life [ edit ]\n\nMadison in 2012\n\nIn 2009, Madison said, \"I'm never dating anybody again. I don't need a man. I'm really happy with myself and being with my friends... I'm focused on forwarding my career. I'm working on producing my own shows. Girls Next Door was a great place to start but it was somebody else's show. I'm just ready to move on.\"[33]\n\nMadison has spoken openly about her cosmetic surgeries, having had both rhinoplasty and breast augmentation. After the latter procedure, her bust measurements went from an A-cup to a D.[34] In 2011, Madison announced that she had insured her breasts for $1 million.[35]\n\nIn August 2012, Madison announced that she and Pasquale Rotella, whom she began dating in 2011, were expecting their first child.[36] Madison gave birth to their daughter in March 2013, in Las Vegas.[37] Madison and Rotella were married at Disneyland on September 10, 2013, with Bridget Marquardt as a bridesmaid, and resided in Las Vegas.[38] Madison gave birth to her second child, a son, in August 2016.[39][40] Rotella and Madison were separated as of September 25, 2018.[41] In February 2019, the divorce was finalized.[42]\n\nIn 2021, Madison revealed that she believed herself to be on the autism spectrum,[43] something her parents had long suspected. She was later formally diagnosed, a fact she confirmed when appearing as a featured guest on the podcast \"Something Was Wrong\".[44] The diagnosis led Madison to consider how her struggles with forming social connections may have contributed to her relationship with Hefner. \"I thought to myself I've never really connected with a guy my own age, and I have a [hard] time connecting with anybody my own age, maybe I'm just like this old soul, and I'm meant to be with older people.\"\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Holly_Madison_by_Gage_Skidmore.jpg/250px-Holly_Madison_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Holly_Madison_11.jpg/250px-Holly_Madison_11.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Holly_Madison_by_Gage_Skidmore.jpg/960px-Holly_Madison_by_Gage_Skidmore.jpg", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/Holly_Madison_%288049659654%29_%28cropped%29.jpg/250px-Holly_Madison_%288049659654%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/40px-Wikiquote-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Holly_Madison_by_Gage_Skidmore.jpg/960px-Holly_Madison_by_Gage_Skidmore.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Holly_Madison", "title": "Holly Madison", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Holly_Madison_by_Gage_Skidmore.jpg/960px-Holly_Madison_by_Gage_Skidmore.jpg", "width": 861, "height": 1200}, "title": "Holly Madison - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}