{"url": "https://www.biography.com/people/pete-davidson", "text": "1993-present\n\nWho Is Pete Davidson?\n\nComedian and actor Pete Davidson has found a sympathetic fan base by transforming his own personal issues and tragedies into wince-worthy, hilarious confessions on stage. After starting his stand-up comedy career and appearing on a handful of television shows, 20-year-old Davidson became one of the youngest cast members of the sketch comedy series Saturday Night Live in 2014 and remained there for seven seasons. He has hosted several comedy specials and appeared in several films, including The King of Staten Island, which is loosely based on his life. He has also made headlines for his love life, particularly for his brief engagement to pop singer Ariana Grande, and his relationship with Kim Kardashian, which drew the ire of her ex-husband Kanye West.\n\nQuick Facts\n\nFULL NAME: Peter Michael Davidson\n\nBORN: November 16, 1993\n\nBIRTH CITY: Staten Island, New York\n\nASTROLOGICAL SIGN: Scorpio\n\nEarly Life and Career\n\nGetty Images Pete Davidson with his mother, Amy, in May 2021\n\nPete Davidson was born Peter Michael Davidson on November 16, 1993, in Staten Island, New York, to parents Amy and Scott Davidson. His father was a firefighter with Ladder 118 in Brooklyn who died while responding to the terrorist attacks on September 11, 2001. Scott’s death deeply traumatized Pete, who had problems in school and at one point ripped out all his hair until he was bald.\n\nA group of psychologists monitored Davidson for several years to study the psychological effects in the aftermath of the 9/11 attacks; Davidson described himself as a “lab rat” in these experiments. He had suicidal thoughts as a child and attempted suicide at age 9. Davidson credits the rapper Kid Cudi—who’s used his music to share his own battle with suicide—for having saved his life. “I would’ve killed myself if I didn’t have Kid Cudi,” he told the morning radio show The Breakfast Club. “I truly believe if Man on the Moon didn’t come out, I wouldn’t be here.”\n\nDavidson performed his first stand-up performance at a Staten Island bowling alley at age 16, after a group of friends who knew about his comedy aspirations dared him to do it. After graduating from Xaverian High School in 2011, he briefly attended Brooklyn Heights’ St. Francis College before deciding to drop out.\n\nBeginning in 2013, Davidson began appearing on a variety of MTV series, such as Failosophy, Guy Code, and a guest role in Nick Cannon Presents: Wild ’N Out. In 2014, after making his televised stand-up debut on Comedy Central’s Gotham Comedy Live, he continued doing more stand-up gigs, appearing on Jimmy Kimmel Live! and Comedy Underground with Dave Attell. Also that year, he was cast in the pilot episode for a Fox comedy called Sober Companion, but it was not picked up by the network.\n\n\"Saturday Night Live\"\n\nAfter nabbing a guest-starring role on Brooklyn Nine-Nine, Davidson earned a small part on the Amy Schumer–Bill Hader film comedy Trainwreck (2015). Hader was impressed with Davidson and recommended him to Saturday Night Live producer Lorne Michaels. That earned Davidson an audition and, ultimately, a role as a cast member on the long-running sketch comedy series, which was starting its 40th season in 2014. At age 20, Davidson became one of the show’s youngest cast members.\n\n\n\nGetty Images Pete Davidson appears in a Weekend Update SNL sketch alongside Colin Jost in May 2022.\n\nDavidson earned wide acclaim during his time on Saturday Night Live. He portrayed memorable characters during his tenure on SNL, like the easily distracted youth Chad, and performed in several popular pretaped segments, like a rap video with Gunna, Chris Redd, and Simon Rex. He also came particularly known for his appearances on the show’s regular Weekend Update segment, in which he appears as himself delivering commentary about his personal life or current events.\n\nIn 2016, he was included on the Forbes 30 Under 30 list, which described him as “having polished his chops in both sketch and stand-up.” Davidson also collaborated and performed regularly with his close friend and fellow comedian John Mulaney, a writer on SNL. Davidson occasionally went overboard with his humor. After drawing criticism in November 2018 for mocking Texas congressional candidate Dan Crenshaw, who lost an eye while serving in Afghanistan, he was forced to apologize to Crenshaw on the show the following week. Davidson later said he received death threats due to his jokes about Crenshaw.\n\n\n\nAfter seven seasons, Davidson departed from Saturday Night Live in 2022. He said starring on the show “really changed my life,” and he wrote on Instagram about his departure:\n\n“When I got the show I was 20 years old and I had no idea what I was doing. I still don’t but especially back then. I wasn’t really a sketch performer I was just a stand up. I knew I could never keep up or go toe to toe with a Kenan Thompson or a Kate McKinnon so I was super scared at figuring out what I could possibly bring to or do for such a historic, respected show and platform.”\n\nMovies and Comedy Specials\n\nGetty Images Pete Davidson (right) speaks during a comedy roast of Justin Bieber in March 2015.\n\nDavidson’s fame and success on Saturday Night Live led to several movie, television, and stand-up comedy specials. He drew attention for his barbed jokes during a comedy roast of pop superstar Justin Bieber, during which Davidson shocked the audience with jokes about his own father’s death during 9/11. His first stand-up special, Pete Davidson: SMD, was released on Comedy Central in 2016.\n\nAfter appearing in a supporting role in the 2018 romantic comedy Set It Up, Davidson appeared in five films released in 2019 alone, including What Men Want, The Dirt, and The Jesus Rolls. Elsewhere, he voiced Jerry the Eagle in the animated film The Angry Birds 2 and both starred in and executive produced Big Time Adolescence, a coming-of-age film in which he plays a college dropout who befriends a young teenager. The following year, in his Netflix special Pete Davidson: Alive in New York, he discussed his past Saturday Night Live controversy with Dan Crenshaw, as well as his experiences with comedian Louis C.K., who Davidson said tried to get him fired from SNL for smoking marijuana.\n\nAlso in 2020, Davidson starred in, co-wrote, and executive produced The King of Staten Island, a comedy loosely based on his real life. In the film, he portrays a high school dropout living with his mother and sister in Staten Island, with dreams of being a tattoo artist who practices regularly on his friends. Davidson’s character struggles with memories of the death of his firefighter father, which was inspired by the comedian’s childhood. Filmmaker Judd Apatow, who co-wrote and produced the film, said he and fellow writer Dave Sirius spent a lot of time talking to Davidson and his friends about “all the history and the emotions” from the comedian’s actual experiences.\n\nDavidson has continued to appear in films throughout the 2020s. He has a brief but important role in the DC Comics film The Suicide Squad (2021), portraying a mercenary named Blackguard. In 2022, he appeared in the horror comedy film Bodies Bodies Bodies, starred alongside Kaley Cuoco in the romantic comedy Meet Cute, and provided the voice of the title dog in the animated comedy film Marmaduke. Davidson co-wrote and starred in the television series Bupkis, which debuted on the Peacock streaming service in May 2023. Like The King of Staten Island, the series is partially autobiographical, with Davidson playing a fictional version of himself, attempting to navigate his comedy career and the challenges that come with fame. Edie Falco and Joe Pesci co-star as his mother and grandfather.\n\nHealth Condition and Mental Illness\n\nDavidson has been forthcoming about his health conditions and mental health issues. He was diagnosed with Crohn’s disease in his late teens and had been taking marijuana to ease the symptoms. Davidson’s character in the semi-autobiographical The King of Staten Island also has Crohn’s disease. The comedian has also been diagnosed with borderline personality disorder, which he said explained why he was “depressed all the time.” After his diagnosis, he began therapy and medication to treat the disorder.\n\nIn 2016, he took a break from SNL to get sober, believing his overindulgence in marijuana and his drinking were prompting him to have mental breakdowns. However, when he quit, he experienced that his negativity took a turn for the worse. “I got sober for three months, and I was just, like, never sadder, and everything was just way worse,” he told Peter Rosenberg on Complex’s video series Open Late. After learning his depression was caused by borderline personality disorder, he resumed drinking and recreational marijuana smoking.\n\nGirlfriends\n\nGetty Images Pete Davidson and Ariana Grande attend the 2018 MTV Video Music Awards in New York City. Soon after, they announced their short-lived engagement.\n\nDavidson has been in several relationships with well-known celebrities, and his romantic life is regularly highlighted by entertainment journalists and gossip publications. His ex-girlfriends include comedian Carly Aquilino, scriptwriter Cazzie David, actor Margaret Qualley, model Kaia Gerber, actor Phoebe Dynevor, and writer Emily Ratajkowski.\n\nDavidson and pop sensation Ariana Grande first drew attention to their relationship after her performance at the Billboard Music Awards in May 2018. Within a month, they surprised fans with the announcement that they were engaged. Davidson told Grande he wanted to “marry you tomorrow” the day they met. The relationship brought Davidson a great deal of unwanted attention, prompting him to delete his Instagram feed to tune out the “negative energy.” The romance ended almost as quickly as it began, with the pair announcing their breakup in October 2018. Grande’s song “Thank U, Next” was inspired by her breakup with Davidson, and it debuted at No. 1 on the Billboard Hot 100.\n\nGetty Images Kim Kardashian and Pete Davidson attend the 2022 Met Gala in New York City together.\n\nDavidson started dating actor Kate Beckinsale in March 2019, and they were spotted at a Golden Globes after-party and a New York Rangers hockey game that month. However, the pair called it quits the next month, with Davidson saying it “wasn’t the right time” for them.\n\nOne of Davidson’s most high-profile relationships was with reality show star Kim Kardashian, whom he started dating in November 2021, when she was still finalizing her divorce with Kanye West. The rapper insulted Davidson on multiple occasions after the relationship began and wrote in his song “Eazy” that he would “beat Pete Davidson’s ass.” The music video for the song featured a claymation figure of Davidson being kidnapped and murdered. Davidson and Kardashian broke up in August 2022 due to busy work schedules and frequent long distances from each other.\n\n\n\nTattoos\n\nAmong Davidson’s many tattoos, one of the more famous ones is a drawing of Hillary Clinton on his leg (he calls Clinton his “hero”).\n\nAfter beginning his relationship with pop singer Ariana Grande, Davidson had an image of a black bunny mask tattooed behind his ear, an apparent homage to the cover of her Dangerous Woman album. After the couple split, the bunny mask was replaced with a black heart tattoo.\n\nDavidson and singer Miley Cyrus also have matching tattoos that say “WE BABIES,” a reference to a Saturday Night Live skit in which both appeared.\n\n\n\nFact Check: We strive for accuracy and fairness. If you see something that doesn’t look right, contact us!\n\n..", "images": ["https://www.biography.com/_assets/design-tokens/biography/static/images/logos/logo.5ec9b18.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/elon-musk-episode-1803-pictured-pete-davidson-and-his-news-photo-1685648772.jpg?crop=1xw:0.999xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/episode-1842-pictured-actor-comedian-pete-davidson-during-news-photo-1685725407.jpg?crop=0.757xw:0.505xh;0,0.0999xh&resize=640:*", "https://www.biography.com/_assets/design-tokens/biography/static/images/logos/network-logo.04aa008.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/honoree-justin-bieber-and-comedian-pete-davidson-speak-news-photo-1685648559.jpg?crop=0.99838xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/pictured-malcolm-jamal-warner-as-theo-huxtable-news-photo-1753196351.pjpeg?crop=0.827xw:1.00xh;0.105xw,0&resize=360:*", "https://hips.hearstapps.com/rover/profile_photos/7b0fd6ec-180e-4db7-98aa-b972ecefdf97_1675802159.file?fill=1:1&resize=120:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://hips.hearstapps.com/hmg-prod/images/stephen-colbert-attends-the-2023-spirit-of-ireland-gala-at-news-photo-1701187639.jpg?crop=0.969xw:0.669xh;0.0277xw,0.0630xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/pictured-eddie-murphy-on-february-15-2015-news-photo-1762808496.pjpeg?crop=0.631xw:0.942xh;0.111xw,0.0577xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/jimmy-kimmel-live-airs-every-weeknight-at-11-35-p-m-et-and-news-photo-1758574739.pjpeg?crop=0.715xw:0.892xh;0.151xw,0.0200xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://www.biography.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://hips.hearstapps.com/hmg-prod/images/nate-bargatze-attends-the-los-angeles-premiere-of-netflixs-news-photo-1753714173.pjpeg?crop=0.704xw:0.469xh;0.137xw,0.0966xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1205150941-crop-676628b3974bc.jpg?crop=1.00xw:1.00xh;0,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/martin-short-and-steve-martin-attend-the-season-4-premiere-news-photo-1757363780.pjpeg?crop=0.668xw:1.00xh;0.167xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/jimmy-kimmel-live-airs-every-weeknight-at-11-35-p-m-et-and-news-photo-1758228400.pjpeg?crop=0.771xw:0.616xh;0.117xw,0.0221xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/season-6-november-15-1980-april-11-1981-pictured-eddie-news-photo-1762800394.pjpeg?crop=0.652xw:1.00xh;0.175xw,0&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://www.biography.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/pete-davidson-and-ariana-grande-attends-the-2018-mtv-video-news-photo-1685648975.jpg?crop=1.00xw:0.929xh;0,0.0307xh&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/episode-1842-pictured-actor-comedian-pete-davidson-during-news-photo-1685725407.jpg?crop=0.845xw:0.282xh;0,0.118xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/episode-107-pictured-pete-davidson-as-pete-davidson-news-photo-1682443072.jpg?crop=1.00xw:0.752xh;0,0.0385xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/actor-john-candy-poses-for-a-photo-session-on-april-12-1993-news-photo-1760022606.pjpeg?crop=1.00xw:0.804xh;0,0.0536xh&resize=360:*", "https://hips.hearstapps.com/vidthumb/images/inkt-ep04-thumbnail-682dd7da2d33d.jpg?crop=1xw:1xh;center,top", "https://hips.hearstapps.com/hmg-prod/images/natasha-lyonne-japanese-breakfast-episode-1826-pictured-news-photo-1685648391.jpg?crop=0.891xw:0.831xh;0.0221xw,0.140xh&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/socialite-kim-kardashian-and-comedian-pete-davidson-arrive-news-photo-1685649042.jpg?crop=0.556xw:1.00xh;0.245xw,0&resize=640:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/eddie-murphy-attends-the-80th-annual-golden-globe-awards-at-news-photo-1762788000.pjpeg?crop=1.00xw:0.669xh;0,0.0791xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://hips.hearstapps.com/hmg-prod/images/creator-executive-producer-director-writer-seth-rogen-news-photo-1757013196.pjpeg?crop=0.663xw:0.442xh;0.177xw,0.0704xh&resize=360:*", "https://hips.hearstapps.com/rover/profile_photos/b50d4909-0f39-4b73-b482-46d0a9078d40_1682363012.file?fill=1:1&resize=120:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/episode-1842-pictured-actor-comedian-pete-davidson-during-news-photo-1685725407.jpg?crop=0.845xw:0.282xh;0,0.118xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.biography.com/actors/pete-davidson", "title": "Pete Davidson: Biography, Comedian, Actor", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Pete Davidson: Biography, Comedian, Actor", "description": "Pete Davidson is best known for his work on “Saturday Night Live” and his stand-up comedy specials. Read about his movies, dad, girlfriends, tattoos, and more.", "keywords": "profile", "theme-color": "#000000", "og": {"site_name": "Biography", "title": "Pete Davidson: “SNL” Alum and Actor", "description": "Stand-up comedian Pete Davidson is best known for his work on “Saturday Night Live,” as well as his appearances in films like “The King of Staten Island.”", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/episode-1842-pictured-actor-comedian-pete-davidson-during-news-photo-1685725407.jpg?crop=0.845xw:0.282xh;0,0.118xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.biography.com/actors/pete-davidson", "type": "article"}, "article": {"publisher": "https://www.facebook.com/Biography", "opinion": "false", "section": "Famous Actors", "modified_time": "2023-06-02T21:26:00Z", "published_time": "2023-06-02T21:26:00Z"}, "parsely-metadata": "{\"socialHeadline\":\"Pete Davidson: “SNL” Alum and Actor\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/episode-1842-pictured-actor-comedian-pete-davidson-during-news-photo-1685725407.jpg?crop=0.734xw:0.489xh;0,0.119xh&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/episode-1842-pictured-actor-comedian-pete-davidson-during-news-photo-1685725407.jpg?crop=0.845xw:0.282xh;0,0.118xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/episode-1842-pictured-actor-comedian-pete-davidson-during-news-photo-1685725407.jpg?crop=0.734xw:0.489xh;0,0.119xh", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/episode-1842-pictured-actor-comedian-pete-davidson-during-news-photo-1685725407.jpg?crop=0.845xw:0.282xh;0,0.118xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "never", "sailthru.excerpt": "1993-presentWho Is Pete Davidson?Comedian and actor Pete Davidson has found a sympathetic fan base by transforming his own personal issues and tragedies into wince-worthy, hilarious confessions on stage. After starting his stand-up comedy career and appearing on a handful of television shows, 20-year-old Davidson became one of the youngest cast", "sailthru.tags": "actors,Famous Actors,comedians,Comedians,Biography-US", "sailthru.date": "2023-06-02 21:26:00", "sailthru.socialtitle": "Pete Davidson: “SNL” Alum and Actor", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1685741160.0, "source": "https://www.biography.com", "summary": ""}