{"url": "https://www.dailymail.co.uk/femail/article-2357494/What-really-Kate-Middleton-Prince-William-rekindle-love--secrets-romantic-reunion-.html", "text": "Secrets of the Royal romantic reunion that changed the course of history: What really made Kate and Wills rekindle their love - and transform the monarchy forever\n\nA new book reveals what really happened during their months apart\n\nPrince William and Kate Middleton broke up in March 2007\n\nIt was a spring of parties, incriminating photos and heartbreak\n\nThe royal couple got back together in June and married four years later\n\nIt was at the Cheltenham Festival, the great Spring celebration of National Hunt racing, that it first became clear. Dressed in matching, decades-older tweed outfits, William and Kate looked unhappy and out of sorts, in comparison to an event one year earlier when they had been spotted kissing in public for the first time. It was March 2007 and a rot had set into their relationship.\n\nAny lingering doubts were finally dispelled a few days later when William went out to Elements nightclub close to his barracks in Bournemouth.\n\n\n\nNormally so cautious in public, the Prince was now drunk, surrounded by glamorous half-naked girls – and enjoying himself.\n\n\n\nScroll down for video\n\n\n\nBreaking up: William speeds ahead of Kate at the 2007 Cheltenham festival in March\n\nIn one picture published in the following day’s newspapers he appeared to be holding the breast of a fellow clubber, Brazilian Ana Ferreira. Another female party-goer said William had made suggestive comments. There was no longer any disguising the fact that William was unsure of his future with Kate.\n\nWhen his father Charles was wooing Diana and the relationship reached a crossroads, Prince Philip told him that he needed to take action one way or another. And Charles proposed.\n\nWhen William was faced with a similar dilemma he went the other way . . .\n\nThe last time Kate and William went out together before they split was with their friends Hugh and Rose van Cutsem, whose wedding they had attended two years earlier. At the end of March, the four had a quiet night out in the Van Cutsems’ local, the King’s Head pub at Bledington in the Cotswolds. By the time Kate flew to Ireland with her mother on April 3, their four-year relationship was over.\n\nKate was devastated, but instead of weeping at home, she kept herself busy. Kate and Carole had gone to Dublin to support one of Carole’s friends, an artist who was showing a private exhibition. Mother and daughter saw the paintings, attended the champagne reception and then completed a cultural day with a tour of the National Gallery of Ireland.\n\nWilliam decided to celebrate the end of his relationship rather differently – with a trip to the Mahiki club in Central London. The news of their split was not yet public, but those around him had more than a clue of what was going on when he leaped on to a table, shouting ‘I’m free!’.\n\nHe then slipped into his version of the robot dance – made famous by England footballer Peter Crouch – and suggested to his friends that they drink the menu.\n\nNews of their split broke in public the following day.\n\nPartying apart: When Prince William went clubbing at Elements in Bournemouth, and was caught with his hand apparently on Brazilian Ana Ferreira's breast, it was clear that him and Kate were no longer together\n\nYet it wasn’t long before William was having second thoughts. Mindful, perhaps, of the decision his father had made when he was in his 20s and failed to marry his early love Camilla, William did not want to make the same mistake. Kate, however, needed some convincing. He had broken her heart and she wanted to make sure that if they did get back together it would be for the right reasons, and that things would change.\n\nShe signed up for a charity challenge with an all-female dragon boat racing crew called the Sisterhood, who billed themselves, A-Team style as: ‘An elite group of female athletes, talented in many ways, toned to perfection with killer looks, on a mission to keep boldly going where no girl has gone before.’\n\nWilliam spent the summer at his barracks, fulfilling Royal duties, playing polo and enjoying a few nights out with friends. Kate, meanwhile, said ‘yes’ to a slew of invitations and, in public at least, appeared more vibrant and sociable than she had been for some time.\n\nShe was soon joined in London by her sister Pippa, who had just finished university and moved into Kate’s Chelsea flat. Spray-tanned and blow-dried, the two appeared together at a series of upmarket social events.\n\nKate was still only 25, a single girl with the world at her feet – and a taxi waiting outside. Although she was heartbroken, she wasn’t going to show it.\n\nHer dresses grew shorter, her tops lower. April and May saw numerous nights out to hot-spots where she had been a regular with William, and she was frequently photographed – her swirl of brunette hair, bronzed limbs carefully folded – getting out of taxis in the West End.\n\nShe attended diverse events, including a reception at luxury jeweller Asprey for the launch of Young Stalin by Simon Sebag Montefiore and, on another night, attended a party to promote the film Rabbit Fever, which was about women obsessed with a brand of sex toy.\n\nGone were the frumpy tweeds of two months earlier; now Kate wore a slinky off-the-shoulder top and silky skirt with a bare midriff and caramel tan. Once inside the party she put on a pair of pink silk bunny ears and proceeded, as one party- goer put it, to ‘tease all the boys’.\n\nFunny bunny: Kate put on a pair of bunny ears during a party for a DVD launch celebrating a 'mocumentary' about the Rampant Rabbit vibrator in June 2007\n\nBut, for some time, Kate had wanted to edge towards a more stable lifestyle – preferring relaxed nights at home and family events – and, despite all appearances, she remained deeply hurt. Training with the Sisterhood helped distract her.\n\nThe 21 girls taking part in the venture were aiming to row across the Channel to raise money for children’s hospices. It was an ambitious scheme: the team trained on the Thames from 6.30 in the morning and Kate, who had become involved through her old school friend Alicia Fox-Pitt, threw herself into it.\n\nFellow rower Emma Sayle recalls her state of mind: ‘Kate was very down and I think the training became her therapy. Kate had always put William first and she said this was a chance to do something for herself.’\n\nShe very quickly proved herself.\n\n‘It wasn’t a question of, “Oh, she’s Kate Middleton so she makes the team,”’ said Emma. ‘She has had to prove herself. We launched the challenge in November and Kate joined in April. Our coach said she could only join if she was up to it.’\n\nThanks to years of sport and a regime of tennis and swimming, Kate was more than up to the task.\n\nLater, she would see this time apart from William as valuable in its own right. ‘I think at the time I wasn’t very happy about it, but actually it made me a stronger person, you find out things about yourself that maybe you hadn’t realised,’ she said. ‘I think you can get quite consumed by a relationship when you’re younger. I really valued that time for me as well, although I didn’t think it at the time!’\n\nShe was still licking her wounds when she headed to Ibiza for some sun and headspace with her brother James and friends, including Marlborough classmate Emilia d’Erlanger. They stayed at Kate’s Uncle Gary’s villa, where Gary’s wife noticed that Kate spent a lot of time on the phone. William meanwhile was discovering that in Kate he’d had what he wanted all along.\n\nThey secretly got back together on June 9, when she attended a party at his barracks to celebrate the end of training. The theme was ‘Freakin’ Naughty’ and William wore hot pants, vest and a policeman’s helmet, while Kate was dressed as a naughty nurse.\n\nBack together again: Prince William and Kate are snapped leaving Bouji's nightclub in October, appearing more in love than ever\n\nThere were blow-up dolls hanging from the ceiling and sexy waitresses handing out lethal cocktails. Outside was a bouncy castle and plunge pool, but William and Kate stuck to the dance floor. That night, she stayed at his barracks.\n\n\n\nWilliam later said, ‘We were both very young . . . we were both finding ourselves and being different characters. It was very much trying to find our own way and we were growing up so it was just a bit of space and it worked out for the better.’\n\nThey tried not to make it too obvious, but they were together one month later, on July 7, when Princes William and Harry stood on stage at Wembley in front of 63,000 people.\n\nThe two princes had decided to honour the ten-year anniversary of their mother’s death with a tribute concert on what would have been her 46th birthday. Slipping into their seats in the Royal box, Harry sat next to his girlfriend Chelsy Davy, while William sat next to his best friend Thomas van Straubenzee.\n\nHowever, two rows back was Kate, accompanied by her brother James. The concert rocked to the sounds of Take That, Duran Duran and P. Diddy, while cousins Princesses Beatrice and Eugenie, Peter and Zara Phillips, and Earl Spencer’s daughters Kitty, Eliza and Katya all sang and danced. The evening was a huge success.\n\nThat night both princes had the women they loved by their sides. Harry and Chelsy had been together for three years and had also had their ups and downs. But for William and Kate, they were done with break-ups and make-ups, this time they wanted to be together forever.\n\nWilliam and Harry had wanted to thank everyone involved with the concert and did so with an extravagant party.\n\n\n\nThere were tropical fish swimming below a Perspex dance floor, oysters and raspberry vodka jellies being passed around, and dancers in cages.\n\nKate had worn a respectable white Issa mac to the concert, but for the party she slipped it off to reveal a thigh-skimming white-lace slip dress, and she danced with William to one of their favourite tracks, Bodyrockers’ I Like The Way (You Move) before finding a discreet corner – lit by candles and scattered with rose petals – to sip mojitos, kiss and whisper in each other’s ears.\n\nHappy ending: Prince William and Kate Middleton married on 29th April 2011, just over four years after their break-up - and two years before the impending arrival of Baby Cambridge\n\nA few weeks later, they were together again for Camilla’s 60th birthday party at Highgrove. It was a black-tie event, and Kate wore a long cream dress and sipped champagne as William mouthed the words of It Had To Be You to her.\n\nShe had been smuggled in to avoid publicity, but once inside the pair were happily ensconced, enjoying the glow of this new honeymoon period.\n\nOne downside to her reunion with William was that, unfortunately, she needed to pull out of the race with the Sisterhood. She had wanted to complete the challenge, and William was behind her.\n\n\n\nBut it would have been hard to request privacy for her relationship while at the same time appearing to court publicity with the Sisterhood.\n\nKate and William had a lot to discuss, and some lost time to make up for. In September, they flew to the Seychelles in the Indian Ocean. They stayed at the Desroches Island Resort, checking in under the names ‘Martin and Rosemary Middleton’, and went kayaking and snorkelling in the shallow coral reef.\n\nAt night they relaxed over a candlelit supper on the beach. It was during this break that they made an agreement with each other.\n\nFor the next few years, they would work and enjoy their lives, knowing that at some point when the time was right, they would be husband and wife – and perhaps parents too.\n\nKate is published by Michael O’Mara, priced £20. To order your copy at the special price of £15, with free p&p, call the Mail Book Shop on 0844 472 4157 – or visit mailbookshop.co.uk.", "images": ["https://i.dailymail.co.uk/1s/2025/11/19/12/104005979-0-image-m-6_1763553771266.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/07/104035469-0-image-a-6_1763624905623.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/01/103994775-0-image-a-16_1763517243647.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/07/104000761-0-image-a-18_1763538815139.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/13/104008755-0-image-a-1_1763558268166.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/16/104015289-0-image-a-6_1763568971204.jpg", "https://i.dailymail.co.uk/i/furniture/articles/InstaFollowFFF308.png", "https://i.dailymail.co.uk/1s/2025/11/20/12/104043257-0-image-a-9_1763642903294.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/18/104019097-0-image-a-169_1763575890890.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/15/104013145-0-image-a-1_1763565367541.jpg", "https://scripts.dailymail.co.uk/static/mol-fe/static/mol-fe-xpmodule-footer/1.8.3/chevronUp-f8884f3eb2d9dbbd.svg", "https://i.dailymail.co.uk/1s/2025/11/20/07/104035475-0-image-a-28_1763624993262.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/05/104034361-0-image-a-216_1763617950707.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/23/104027391-0-image-a-41_1763594632685.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/00/104029907-0-image-a-9_1763600174417.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/16/104012089-0-image-m-7_1763570877196.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/18/104020007-0-image-a-42_1763577588733.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/06/103999327-0-image-a-102_1763532203604.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/10/104004409-0-image-a-9_1763548462834.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/02/104031909-0-image-a-83_1763607397736.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/10/104003873-0-image-a-21_1763548163208.jpg", "https://i.dailymail.co.uk/1/2025/11/19/16/104016201-0-image-a-14_1763571266024.jpg", "https://i.dailymail.co.uk/i/pix/2013/07/06/article-2357494-1AB1492F000005DC-609_634x501.jpg", "https://i.dailymail.co.uk/1s/2025/10/17/14/103050159-0-Waterloo_Sparkling_Water_is_a_uniquely_authentic_refreshing_and_-a-22_1760706258877.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/19/104021581-0-image-a-15_1763581378878.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/01/104030185-0-image-a-10_1763603294569.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/11/104041843-0-image-m-10_1763639180075.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/13/104008787-0-image-a-4_1763558330462.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/21/104024237-0-image-a-190_1763586946773.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/11/104041367-0-image-a-16_1763638376171.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/20/104022945-0-image-a-11_1763584369383.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/10/104039133-0-image-a-19_1763634130051.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/09/104037059-0-image-a-28_1763629599000.jpg", "https://scripts.dailymail.co.uk/static/mol-fe/static/mol-fe-xpmodule-footer/1.8.3/tiktok-29bd5b4b02c99c38.svg", "https://i.dailymail.co.uk/1s/2025/11/20/11/104041321-0-image-m-23_1763638247007.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/01/104031155-0-image-a-30_1763603939753.jpg", "https://i.dailymail.co.uk/i/pix/2013/07/05/article-2357086-1AAEBC86000005DC-378_87x84.jpg", "https://i.dailymail.co.uk/1/2025/11/19/18/104017547-0-image-m-42_1763577220627.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/08/104035825-0-image-a-11_1763626276940.jpg", "https://i.dailymail.co.uk/i/pix/2013/07/06/article-2357494-1AB14927000005DC-163_634x800.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/17/104017391-0-image-a-19_1763572393984.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/12/104042753-0-image-a-13_1763641431246.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/13/104042661-0-image-m-14_1763646393189.jpg", "https://i.dailymail.co.uk/i/pix/2013/07/05/article-2356766-1AAD825D000005DC-661_87x84.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/18/104017621-0-image-a-80_1763576309917.jpg", "https://i.dailymail.co.uk/1s/2025/11/12/23/103834951-0-image-m-20_1762989194223.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/13/104008709-0-image-m-26_1763560681011.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/17/82468893-0-image-m-8_1763573513867.jpg", "https://i.dailymail.co.uk/1s/2025/11/18/17/103982381-0-image-a-21_1763485830223.jpg", "https://scripts.dailymail.co.uk/static/mol-fe/static/mol-fe-xpmodule-footer/1.8.3/arrowUp-379d250818519a9f.svg", "https://i.dailymail.co.uk/1s/2025/11/20/04/104033047-0-image-a-18_1763611764584.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/14/104045521-0-image-m-32_1763647598604.jpg", "https://scripts.dailymail.co.uk/static/mol-fe/static/mol-fe-xpmodule-footer/1.8.3/linkedIn-d7468b4203b1151b.svg", "https://i.dailymail.co.uk/1s/2025/11/20/05/104034249-0-image-a-6_1763617408878.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/02/104032025-0-image-a-13_1763607544795.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/10/104039215-0-image-a-15_1763634295296.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/18/104018949-0-image-m-4_1763575593174.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/16/104015803-0-image-a-9_1763569687229.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/22/104025901-0-image-a-55_1763590777334.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/08/104001557-0-image-a-9_1763541907791.jpg", "https://i.dailymail.co.uk/i/sitelogos/DailyMail_Main.png", "https://i.dailymail.co.uk/1s/2025/11/20/11/104041313-0-image-m-12_1763638779002.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/23/104027019-0-image-m-43_1763593650686.jpg", "https://i.dailymail.co.uk/i/pix/2013/07/06/article-2357494-1AB1491F000005DC-649_634x438.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/00/103992223-0-image-a-5_1763512075829.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/23/104027065-0-image-a-20_1763593874477.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/10/104039357-0-image-a-1_1763634759932.jpg", "https://i.dailymail.co.uk/1s/2025/11/18/22/103989829-0-image-a-4_1763505550155.jpg", "https://i.dailymail.co.uk/i/pix/2013/07/05/article-0-1AADB709000005DC-232_87x84.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/01/104029995-0-image-a-16_1763600772933.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/01/104031085-0-image-a-7_1763603574854.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/03/1763524400090_232420368528553.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/22/104025751-0-image-a-40_1763590226858.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/09/104037391-0-image-a-22_1763630383307.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/01/104030039-0-image-a-12_1763602089242.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/19/104020897-0-image-a-201_1763579603470.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/10/104003515-0-image-a-5_1763547170882.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/01/104030397-0-image-a-16_1763601495228.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/15/104047361-0-image-a-5_1763651137067.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/14/104046121-0-image-a-5_1763648105232.jpg", "https://i.dailymail.co.uk/1s/2025/10/22/18/103225389-0-image-m-9_1761154387691.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/15/104013789-0-image-a-6_1763565954913.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/09/104002055-0-image-a-25_1763544947124.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/20/104022883-0-image-a-84_1763583853772.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/06/104034475-0-image-a-9_1763618812251.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/16/104016521-0-image-a-29_1763570903273.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/21/104024725-0-image-m-21_1763588580252.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/18/104018995-0-image-a-27_1763575646636.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/06/103998933-0-image-a-14_1763534082896.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/12/104007147-0-image-a-16_1763554534773.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/23/104027657-0-image-a-9_1763595234381.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/13/104045715-0-image-a-4_1763647012552.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/12/104042815-0-image-a-16_1763641625031.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/21/104024325-0-image-a-42_1763588228527.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/15/104047533-0-image-a-32_1763651226926.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/00/103991717-0-image-a-1_1763512747702.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/15/104048295-0-image-a-20_1763652404385.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/05/103998349-0-image-a-18_1763528459901.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/06/104034721-0-image-a-13_1763619951639.jpg", "https://i.dailymail.co.uk/1s/2025/11/18/23/103991913-0-image-a-4_1763509588959.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/21/104024141-0-image-m-8_1763587459351.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/07/104000181-0-image-a-96_1763536457224.jpg", "https://i.dailymail.co.uk/1s/2025/11/17/12/103942575-0-image-a-37_1763381356166.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/12/104042669-0-image-a-35_1763642071066.jpg", "https://scripts.dailymail.co.uk/static/mol-fe/static/mol-fe-xpmodule-footer/1.8.3/x-6c827fbedaa856b8.svg", "https://i.dailymail.co.uk/i/furniture/facebook/DailyMail/DailyMail.png", "https://i.dailymail.co.uk/1s/2025/11/19/12/104007791-0-image-a-7_1763555735010.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/00/103992893-0-image-a-11_1763511485838.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/11/104005179-0-image-a-24_1763551934046.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/23/104028297-0-image-a-12_1763596404062.jpg", "https://scripts.dailymail.co.uk/static/mol-fe/static/mol-fe-xpmodule-footer/1.8.3/instagram-05f71a3b8eccf853.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.dailymail.co.uk/1s/2025/11/20/03/104032093-0-image-a-49_1763608377778.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/16/104015875-0-image-a-44_1763569909513.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/15/104014339-0-image-a-26_1763567388202.jpg", "https://i.dailymail.co.uk/1s/2025/11/13/19/103862683-0-image-a-21_1763063178269.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/14/104046147-0-image-a-11_1763649686771.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/09/104038273-0-image-a-1_1763632209932.jpg", "https://i.dailymail.co.uk/1s/2025/11/18/20/103987633-0-image-a-12_1763498489556.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/10/104038747-0-image-m-7_1763636210735.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/03/104032211-0-image-a-1_1763608564131.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/19/104000107-0-image-m-56_1763580079735.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/01/104030995-0-image-a-153_1763602962620.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/12/104043185-0-image-m-254_1763642657940.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/12/104043421-0-image-a-4_1763642555190.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/20/104022867-0-image-a-6_1763583834652.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/10/104039629-0-image-a-4_1763635571463.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/11/104025239-0-image-m-8_1763638058093.jpg", "https://i.dailymail.co.uk/i/pix/2013/07/06/article-0-00D5CED500000514-581_87x84.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/01/104031159-0-image-m-57_1763603657033.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/22/104026411-0-image-a-28_1763592136481.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/16/104015095-0-image-a-23_1763568656703.jpg", "https://i.dailymail.co.uk/i/pix/2013/07/06/article-2357494-1AB14933000005DC-510_306x438.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/15/104013713-0-image-a-19_1763565866946.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/14/104012295-0-image-a-6_1763564128419.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/06/103999887-0-image-a-4_1763535496585.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/11/104006351-0-image-a-4_1763551875744.jpg", "https://i.dailymail.co.uk/1s/2025/11/18/23/103992355-0-image-a-48_1763510392385.jpg", "https://i.dailymail.co.uk/i/pix/2013/07/06/article-2357494-1AB0DF3E000005DC-458_1024x615_large.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/12/104044097-0-image-a-7_1763643101470.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/10/104036909-0-image-m-2_1763633858801.jpg", "https://i.dailymail.co.uk/i/pix/2013/07/08/article-2357494-1AB1494D000005DC-531_634x469.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/03/1763607847724_6253662564800091.jpg", "https://i.dailymail.co.uk/i/pix/channelheaders/US.png", "https://i.dailymail.co.uk/1s/2025/11/19/22/104026549-0-image-a-23_1763592769517.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/23/104027153-0-image-a-127_1763593953076.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/16/104014855-0-image-m-18_1763568364989.jpg", "https://i.dailymail.co.uk/i/pix/2013/07/06/article-2357494-1A8ECC58000005DC-288_634x420.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/13/104009493-0-image-a-5_1763560180718.jpg", "https://i.dailymail.co.uk/1s/2025/11/09/20/103731343-0-image-m-98_1762721856675.jpg", "https://scripts.dailymail.co.uk/static/mol-fe/static/mol-fe-xpmodule-footer/1.8.3/youtube-dee624d0424d2ea3.svg", "https://i.dailymail.co.uk/1s/2025/11/19/07/104000491-0-image-a-126_1763537474050.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/13/104044375-0-image-a-38_1763644768223.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/11/104006225-0-image-a-1_1763552274757.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/09/104002857-0-image-a-1_1763545780198.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/15/104047545-0-image-a-11_1763652236866.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/23/104026955-0-image-a-16_1763593525957.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/11/104040313-0-image-m-17_1763636800144.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/04/103997609-0-image-a-30_1763525789436.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/06/104034409-0-image-m-220_1763619609368.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/14/104009917-0-image-a-8_1763561445367.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/10/103587343-0-image-m-12_1763548406316.jpg", "https://scripts.dailymail.co.uk/static/mol-fe/static/mol-fe-xpmodule-footer/1.8.3/facebook-3ddd38fb8ad4e85a.svg", "https://i.dailymail.co.uk/1s/2025/11/19/19/104021579-0-image-m-5_1763581367645.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/22/104018391-0-image-m-41_1763592589463.jpg", "https://i.dailymail.co.uk/1/2025/11/19/17/104017355-0-image-a-137_1763572307928.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/11/104006251-0-image-a-12_1763551437761.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/03/103996365-0-image-a-33_1763521788246.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/01/1763515248239_159890686836861.jpg", "https://i.dailymail.co.uk/1s/2025/11/18/20/103987595-0-image-m-10_1763498302905.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/03/103996213-0-image-a-47_1763521624241.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/17/104017643-0-image-a-19_1763572863343.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/09/104037789-0-image-m-26_1763632164419.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/12/104042739-0-image-m-10_1763643113473.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/09/104037227-0-image-a-4_1763631004568.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/03/103996949-0-image-m-81_1763523774169.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/20/104022959-0-image-a-114_1763584395101.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/06/103999685-0-image-a-35_1763533966394.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/22/104026109-0-image-a-240_1763591556250.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/14/104046389-0-image-a-16_1763648858969.jpg", "https://i.dailymail.co.uk/1s/2025/11/08/16/103630987-0-image-a-11_1762619254173.jpg", "https://i.dailymail.co.uk/1s/2025/11/20/08/104035895-0-image-m-18_1763629121247.jpg", "https://i.dailymail.co.uk/1s/2025/11/19/20/104022641-0-image-a-39_1763583324637.jpg", "https://scripts.dailymail.co.uk/static/mol-fe/static/mol-fe-xpmodule-footer/1.8.3/dailyMailLogo-aa1bfc83f1a87175.svg"], "top_img": "https://i.dailymail.co.uk/i/pix/2013/07/06/article-2357494-1AB0DF3E000005DC-458_1024x615_large.jpg", "keywords": [], "authors": ["Marcia Moody"], "canonical_link": "https://www.dailymail.co.uk/lifestyle/article-2357494/What-really-Kate-Middleton-Prince-William-rekindle-love--secrets-romantic-reunion-.html", "title": "Secrets of the Royal romantic reunion that changed the course of history: What really made Kate and Wills rekindle their love - and transform the monarchy forever", "meta_data": {"keywords": "dailymail,lifestyle,Prince William,Lifestyle,Amazon,Kate Middleton", "news_keywords": "dailymail,lifestyle,Prince William,Lifestyle,Amazon,Kate Middleton", "original-source": "https://www.dailymail.co.uk/lifestyle/article-2357494/What-really-Kate-Middleton-Prince-William-rekindle-love--secrets-romantic-reunion-.html", "description": "A trained outing in public. A dramatic split. And a very racy kiss-and-make-up. A brilliant new book reveals all about the 'break up' of Prince William and Catherine.", "doc-class": "Living Document", "verify-v1": "DXwlrsxbqxSv+FTFkWUfgflBvFJfx2YbNf/HmABrVyY=", "msvalidate.01": "12E6B4B813EB44C9BFC8F6A21F1D01F5", "y_key": "1a7e912afbfcab2f", "MSSmartTagsPreventParsing": "true", "twitter": {"account_id": 15438913, "card": "summary_large_image", "title": "Secrets of the Royal romantic reunion that changed the course of history: What really made Kate and Wills rekindle their love - and transform the monarchy forever", "description": "A trained outing in public. A dramatic split. And a very racy kiss-and-make-up. A brilliant new book reveals all about the 'break up' of Prince William and Catherine.", "url": "https://www.dailymail.co.uk/lifestyle/article-2357494/What-really-Kate-Middleton-Prince-William-rekindle-love--secrets-romantic-reunion-.html", "image": "https://i.dailymail.co.uk/i/pix/2013/07/06/article-2357494-1AB0DF3E000005DC-458_1024x615_large.jpg", "app": {"id": {"iphone": 384101264, "ipad": 400442503}}}, "articleid": 2357494, "author": "Marcia Moody", "divclasspage": "articlePage", "robots": "max-image-preview:large", "googlebot": "noindex, nofollow", "mol": {"headline": "Secrets of the Royal romantic reunion that changed the course of history: What really made Kate and Wills rekindle their love - and transform the monarchy forever"}, "article": {"publisher": "https://www.facebook.com/DailyMail", "published_time": "2013-07-06T22:00:00+0100", "modified_time": "2013-07-08T09:28:05+0100", "cc_modified_time": "2013-07-08T09:28:05+0100", "section": "Lifestyle", "tag": "What really Kate Middleton Prince William rekindle love  secrets romantic reunion", "author": "https://www.facebook.com/DailyMail", "location": "region:", "opinion": "false", "content_tier": "free"}, "mobile-web-app-capable": "yes", "fb": {"app_id": 146202712090395, "pages": 164305410295882}, "og": {"site_name": "Mail Online", "title": "Secrets of the Royal romantic reunion that changed the course of history: What really made Kate and Wills rekindle their love - and transform the monarchy forever", "type": "article", "description": "A trained outing in public. A dramatic split. And a very racy kiss-and-make-up. A brilliant new book reveals all about the 'break up' of Prince William and Catherine.", "url": "https://www.dailymail.co.uk/lifestyle/article-2357494/What-really-Kate-Middleton-Prince-William-rekindle-love--secrets-romantic-reunion-.html", "image": {"identifier": "https://i.dailymail.co.uk/i/pix/2013/07/06/article-2357494-1AB0DF3E000005DC-458_1024x615_large.jpg", "width": 308, "height": 185}, "video": {"identifier": "https://videos.dailymail.co.uk/video/1418450360/2012/11/1418450360_1958638468001_William-and-Kate.mp4", "type": "video/mp4", "width": 636, "height": 358}}}, "movies": [], "publish_date": 1373144400.0, "source": "https://www.dailymail.co.uk", "summary": ""}