{"url": "https://en.wikipedia.org/wiki/Harry_Hamlin", "text": "American actor (born 1951)\n\nHarry Robinson Hamlin (born October 30, 1951) is an American actor, author, and entrepreneur. He is best known for his roles as Perseus in the 1981 fantasy film Clash of the Titans, a role he reprised in 2007's Santa Monica Studio video game God of War II, and as Michael Kuzak in the legal drama series L.A. Law, for which he received three Golden Globe nominations.[1][2] For his recurring role as Jim Cutler on the AMC drama series Mad Men, Hamlin received a Primetime Emmy nomination for Outstanding Guest Actor in a Drama Series.[3]\n\nEarly life [ edit ]\n\nHamlin was born October 30, 1951, in Pasadena, California, the son of Bernice (née Robinson), a socialite, and Chauncey Jerome Hamlin, Jr., an aeronautical engineer.[4][5] As a teenager, he attended Flintridge Preparatory School, near Pasadena, and The Hill School, a private boarding school in Pottstown, Pennsylvania, where he played soccer and lacrosse and acted in the school's musicals and plays. He also attended classes at the Pacific Conservatory of the Performing Arts. Hamlin attended University of California, Berkeley, and is an alumnus of the Theta Zeta chapter of the national fraternity Delta Kappa Epsilon, of which he was president in 1972.\n\nHamlin graduated from Yale University in 1974 with dual Bachelor of Arts degrees in drama and psychology. He then attended the American Conservatory Theater's advanced actor training program, from which he was awarded a Master of Fine Arts degree in acting in 1976.[5] There, Hamlin starred in a production of Equus, attracting the attention of director Stanley Donen.[6]\n\nCareer [ edit ]\n\nFilm and television [ edit ]\n\nHamlin appeared in the 1976 television production of Taming of the Shrew and also had the title role in the 1979 television miniseries Studs Lonigan. He starred in Movie Movie with George C. Scott in 1978, for which he received his first Golden Globe Award nomination.[7] His big-screen break was a starring role in the 1981 Greek mythology fantasy epic Clash of the Titans.[6] Afterwards, his career faltered somewhat[8] with such controversial films as Making Love in 1982 (the first gay themed love story to be produced by a major studio, Twentieth Century Fox)[9] and Blue Skies Again (1983).[10] He returned to television appearing in the miniseries Master of the Game (based on the novel by Sidney Sheldon) in 1984 and Space (based on the novel by James A. Michener) in 1985.\n\nHamlin appeared on the NBC legal drama series L.A. Law, playing attorney Michael Kuzak. He remained on the series from 1986 to 1991 during which time he was voted People magazine's \"Sexiest Man Alive\" in 1987.[10] Hamlin left the series at the end of the fifth season having been nominated three times for Best Actor in a Television Series - Drama by the Hollywood Foreign Press Association.[11]\n\nIn early 1991 Hamlin appeared in the music video and sang in the choir on the song \"Voices That Care\" which was made in support of U.S. troops who were stationed in the Middle East and involved in Operation Desert Storm.[12] In 1992, Hamlin guest starred in two episodes of Batman: The Animated Series as Cameron Kaiser and Anthony Romulus. In 1995, he participated in the documentary film, The Celluloid Closet where he discussed his role in the film Making Love.[13]\n\nIn 2001, he starred in the television comedy Bratty Babies, and in 2002 he reprised the role of Michael Kuzak in an L.A. Law reunion television film.\n\nIn 2004, Hamlin began a recurring role on the television series Veronica Mars.[14] He played fading action hero Aaron Echolls, father to central show character Logan Echolls who had a turbulent relationship with him. Hamlin's character states that he (like the real-life Hamlin) was People magazine's 'Sexiest Man Alive' in 1987.[15][16] Aaron's wife, Lynn, was played by Hamlin's real-life wife, Lisa Rinna. Hamlin appeared beginning in the sixth episode of the first season, \"Return of the Kane\", and made his last appearance in the second season finale, \"Not Pictured\". In 2006, Hamlin took part in the third season of Dancing with the Stars with Ashly DelGrosso, but was voted off the show in the third week.[17]\n\nIn 2009, Hamlin starred in the series Harper's Island as Uncle Marty. He was killed abruptly in the first episode by being cut in half while he dangled from a broken wooden bridge.\n\nIn June 2010, Hamlin guest-starred in an episode of Army Wives and then became a recurring cast member.[18]\n\nIn June 2010, Hamlin starred in the Hallmark Channel film You Lucky Dog.\n\nOn December 4, 2008, TV Guide reported that Hamlin and Rinna signed a deal to create a reality television series[19] called Harry Loves Lisa that is based around their family life. The series was developed by TV Land and premiered on October 6, 2010.\n\nIn 2012, Hamlin began playing Lloyd Lishman, an older lover to Ian Gallagher (Cameron Monaghan) on the US version of Shameless (7 episodes before the end of Season 3).\n\nHamlin appeared in an adult diaper commercial with his wife during a primetime television program.[20]\n\nBeginning on April 28, 2013, Hamlin appeared in several episodes of season six (1968) of Mad Men as ad executive Jim Cutler after the merger of Sterling Cooper Draper Pryce and Cutler Gleason and Chaough. Hamlin was nominated for a 2013 Primetime Emmy Award for Outstanding Guest Actor in a Drama Series for his appearance in \"A Tale of Two Cities\".\n\nIn 2016, Hamlin was cast in the Epix comedy Graves[21] starring Nick Nolte, and in 2017, Hamlin was cast as Addison Hayes, a mysterious and powerful mastermind whose agenda collides with Swagger, in the USA Network show Shooter.[22]\n\nIn 2022, Hamlin was cast as Cortland Mayfair in AMC's Mayfair Witches, based on the gothic supernatural trilogy Lives of the Mayfair Witches by author Anne Rice.[23]\n\nStage [ edit ]\n\nHamlin made his Broadway debut in 1982 playing Moe Axelrod opposite Frances McDormand in the Broadway revival of Clifford Odets' Awake and Sing![24]\n\nAn avid Shakespearean actor, Hamlin played the title role in Hamlet at the McCarter Theatre in Princeton, New Jersey, where he played Faust in Doctor Faustus the following year.[25]\n\nIn 1994, Hamlin received a Helen Hayes Award nomination for his portrayal of the title role in Henry V at the Shakespeare Theater Company in Washington, D.C.[26]\n\nIn 1996, Hamlin returned to Broadway as Michael Buchanan in Tennessee Williams' Summer and Smoke at the Roundabout Theater.[27]\n\nOther work [ edit ]\n\nIn 2010, Hamlin authored Full Frontal Nudity: The Making of an Accidental Actor, published by Scribner, wherein he shares stories of his early life before becoming a film actor. (ISBN 1-4391-6999-3 )[28][29]\n\nEntrepreneurship [ edit ]\n\nHamlin is an advocate for fusion power[30] and was an angel investor[31] and co-founder of TAE Technologies,[32][33] formerly known as Tri Alpha Energy. TAE Technologies states that it is in the final stages of the research and development of a clean, non-radioactive fusion power generator.[34]\n\nHamlin delivered a talk on fusion at the TEDX LA conference in 2016 entitled, \"You Don't Have To Be a Rocket Scientist To Be a Futurist!\"[35] Hamlin was also a board member of Advanced Physics Corporation.[36][37]\n\nHamlin was president and CEO of the Belle Gray women's clothing boutiques in Los Angeles.[38] Hamlin launched The Lisa Rinna Collection with Lisa Rinna for QVC in 2012.[39]\n\nHamlin is also on the board of governors of the National Space Society.[40]\n\nPersonal life [ edit ]\n\nHamlin with then-wife Laura Johnson at the 1987 Emmy Awards\n\nHamlin was in a relationship with actress Ursula Andress after meeting on the set of Clash of the Titans in 1979.[41] They had a son, Dimitri Hamlin, in 1980.[42] Although an engagement was announced,[43] the couple never married.[42] In 1983, Hamlin ended their relationship.[44]\n\nFrom 1985 to 1989, he was married to actress Laura Johnson and, between 1991 and 1992, to actress Nicollette Sheridan.[45][46]\n\nSince 1997, Hamlin has been married to actress Lisa Rinna, whom he met in 1992. They have two daughters, Delilah (born 1998)[47] and Amelia (born 2001),[48] who both appeared in the reality shows Harry Loves Lisa and The Real Housewives of Beverly Hills with their parents. Hamlin and Rinna starred as married couples in the first season of Veronica Mars and in the 2001 Lifetime film Sex, Lies & Obsession.\n\nHamlin's wives have all been prime time soap-opera actresses: Rinna starred on Melrose Place,[49] Sheridan was a regular on Knots Landing, Desperate Housewives, and the Dynasty reboot, and Johnson was a regular on Falcon Crest (on which Andress later made guest appearances).\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision films [ edit ]\n\nTelevision series [ edit ]\n\nVideo games [ edit ]\n\nAwards and nominations [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Wikinews-logo.svg/40px-Wikinews-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/4/47/Harry_Hamlin_Photo_Op_GalaxyCon_Raleigh_2023.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikibooks-logo.svg/40px-Wikibooks-logo.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Harry_Hamlin_Photo_Op_GalaxyCon_Raleigh_2023.jpg/250px-Harry_Hamlin_Photo_Op_GalaxyCon_Raleigh_2023.jpg", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/0/06/Wiktionary-logo-v2.svg/40px-Wiktionary-logo-v2.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Wikisource-logo.svg/40px-Wikisource-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Wikiversity_logo_2017.svg/40px-Wikiversity_logo_2017.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Harry_Hamlin%2C_Laura_Johnson_%282091210429%29.jpg/250px-Harry_Hamlin%2C_Laura_Johnson_%282091210429%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/40px-Wikiquote-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/4/47/Harry_Hamlin_Photo_Op_GalaxyCon_Raleigh_2023.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Harry_Hamlin", "title": "Harry Hamlin", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/4/47/Harry_Hamlin_Photo_Op_GalaxyCon_Raleigh_2023.jpg", "width": 900, "height": 1200}, "title": "Harry Hamlin - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}