{"url": "www.inquisitr.com/4757224/caitlyn-jenner-kim-kourtney-kardashian-setting-poor-example-children/", "text": "Caitlyn Jenner allegedly isn’t too fond of the risqué photos her former stepdaughters Kim Kardashian and Kourtney Kardashian have been sharing across their social media pages in recent days. According to a new report, after the sisters bared their bodies in various nearly nude and bikini photos on Instagram, Jenner believes the twosome are “setting a poor example for their young children.”\n\nAt least that’s according to Hollywood Life , as the outlet alleged this week that an insider recently revealed that Caitlyn thinks the twosome’s photos are “in poor taste” and are “poorly timed” amid the important message being spread by the #MeToo movement right now.\n\nA source alleged to the site that “Caitlyn feels Kim and Kourtney are sending the wrong message to their millions of followers” with their skin-baring pictures, as she’s supposedly been trying for years to get the twosome to cover up a little more while she was married to former wife Kris Jenner before their divorce in 2015.\n\n“Caitlyn worries that the sisters’ inappropriate posts are setting a poor example for their young children,” said the source of the star, who reports are claiming could potentially join the cast of Dancing with the Stars Season 26 later this year.\n\nNotably, both stars are moms to three young children. Kim and husband Kanye West are parents to 4-year-old North, 2-year-old Saint, and almost 2-week-old Chicago, while Kourtney is mom to 8-year-old Mason, 5-year-old Penelope, and 3-year-old Reign.\n\nJenner hasn’t yet confirmed the claims made by the outlet this week and hasn’t spoken publicly regarding her former stepdaughter’s risque snaps, though the site’s insider then added that Caitlyn allegedly “wishes both Kim and Kourtney would behave with more style and grace” after posting the provocative photos to their Instagram accounts, which have racked up millions of likes.\n\n“They are mothers and Caitlyn feels they should behave more responsibly and conservatively,” added Hollywood Life’s insider.\n\nThe report comes after both Kim and Kourtney hit the headlines for showing off a whole lot of skin on their respective Instagram pages over the past few weeks.\n\nKim’s been posting a number of risqué snaps both before and after the birth of her third child, daughter Chicago, who she and Kanye welcomed via a surrogate on January 15.\n\nMost recently, Kardashian posted a bathroom mirror selfie to the social media site which showed her topless and wearing only sparkly underwear.\n\nKim’s big sister Kourtney Kardashian hasn’t been doing much covering up on Instagram either, as she’s been sharing a number of bikini photos with her followers from her vacation in Mexico, including a NSFW photo of herself laying on a sun lounger in a tiny bikini.\n\nBut while Caitlyn hasn’t confirmed reports claiming she thinks Kim and Kourtney aren’t setting the best example for their followers or their children, the claims come shortly after the star slammed the Kardashian clan in an interview with former America’s Got Talent judge Piers Morgan.\n\nSpeaking out about her former family members on the British series Piers Morgan’s Life Stories earlier this month, Jenner admitted that she no longer speaks to the Keeping Up With the Kardashians stars and said that she couldn’t trust them with the news of her transition because she believed they’d leak the news to the press .\n\n“Of course I didn’t trust them,” Caitlyn said of Kim, Kourtney, and Khloe Kardashian and mom Kris Jenner after admitting that she knew they wouldn’t be able to keep her secret before she was ready to reveal the news herself.\n\nSpeaking of her tell-all book The Secrets of My Life , Jenner then added, “I hate to inform the Kardashians that the book was not about them.”", "images": ["https://www.inquisitr.com/wp-content/uploads/2025/10/2421769f-57a4-4bff-913f-cf316747493e.jpg", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20500%20157'%3E%3C/svg%3E", "https://secure.gravatar.com/avatar/673ddaf526e964d15376329334d8a5b2?s=120&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20492%20142'%3E%3C/svg%3E", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo-white.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/inquisitr-logo.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent-Dark-Mode.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20120%20120'%3E%3C/svg%3E"], "top_img": "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "keywords": [], "authors": ["News Writer"], "canonical_link": "https://www.inquisitr.com/caitlyn-jenner-kim-kourtney-kardashian-setting-poor-example-children", "title": "Caitlyn Jenner Reportedly Thinks Kim & Kourtney Kardashian Are ‘Setting A Poor Example For Their Children’", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "https://www.inquisitr.com/wp-content/uploads/2024/12/favicon.png", "description": "Caitlyn Jenner allegedly isn’t too fond of the risqué photos her former stepdaughters Kim Kardashian and Kourtney Kardashian have been sharing across their", "robots": "follow, index, max-snippet:-1, max-video-preview:-1, max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Caitlyn Jenner Reportedly Thinks Kim & Kourtney Kardashian Are ‘Setting A Poor Example For Their Children’ - Inquisitr News", "description": "Caitlyn Jenner allegedly isn’t too fond of the risqué photos her former stepdaughters Kim Kardashian and Kourtney Kardashian have been sharing across their", "url": "https://www.inquisitr.com/caitlyn-jenner-kim-kourtney-kardashian-setting-poor-example-children", "site_name": "Inquisitr News"}, "article": {"tag": "Kourtney Kardashian", "section": "Entertainment", "published_time": "2018-01-27T07:03:00-05:00"}, "twitter": {"card": "summary_large_image", "title": "Caitlyn Jenner Reportedly Thinks Kim & Kourtney Kardashian Are ‘Setting A Poor Example For Their Children’ - Inquisitr News", "description": "Caitlyn Jenner allegedly isn’t too fond of the risqué photos her former stepdaughters Kim Kardashian and Kourtney Kardashian have been sharing across their", "site": "@theinquisitr", "creator": "@theinquisitr"}, "generator": "WP Rocket 3.18.3"}, "movies": [], "publish_date": 1517054580.0, "source": "http://www.inquisitr.com", "summary": ""}