{"url": "http://abcnews.go.com/ThisWeek/week-transcript-geithner/story?id=11245464&page=2", "text": "July 25, 2010 — -- TAPPER: Secretary Geithner thanks for joining us. Good to see you.\n\nSo, the administration has had a number of successes after big battles, stimulus, health care legislation, new rules for Wall Street, but you have a big battle coming when it comes to the Bush tax cuts.\n\nIf they remain in place, as Republicans want, it will cost three trillion dollars every ten years. The administration has said it wants to keep the ones for people who make under $200,000 a year, individuals and $250,000 for couples.\n\nThat will cost $2.5 trillion over 10 years.\n\nBen Bernanke the chairman of the Federal Reserve said that with the economic outlook unusually uncertain, extending the Bush tax cuts would have a stimulative effect on the economy. Is he right?\n\nGEITHNER: I don't think it should be a battle, Jake. You know, what the President's proposing to do is to leave in place, to extend tax cuts that go to more than 95 percent of working Americans and to leave in place tax cuts that are very important to incent businesses to hire new pe -- new employees and to invest in expanding output.\n\nWe think that's a -- the -- it's a very strong package. We think it's the right package. We think it's fair. We think it's responsible.\n\nNow, we also think it's responsible to let the tax cuts expire that just go to 2 percent to 3 percent of Americans, the highest earning Americans. We think that's the responsible thing to do because we need to make sure we can show the world that they're willing as a country now to start to make some progress bringing down our long -- our long-term deficits.\n\nTAPPER: Don't you think it will slow economic growth?\n\nGEITHNER: No. Just letting those tax cuts that only go to 2 percent to 3 percent of Americans, the highest earning Americans in the country expire. I do not believe it will have a negative effect on growth.\n\nTAPPER: This package that you're talking about pushing in Congress to -- to save the Bush tax cuts for people under $200,000 individuals and 250 for couples --\n\nGEITHNER: And in fact, we go beyond that. Because you know, we're proposing to extend the make or pay tax cut which also goes to 95 percent of working Americans. And a set of very important business tax cuts targeted for small businesses themselves, expensing, zero capital gains rate for investment in small businesses. These things, we think, are very helpful, very powerful.\n\nTAPPER: And when are you talking about pushing that into Congress?\n\nGEITHNER: Congress is on the verge of what we hope will be enactment of a very strong package of tax measures for small businesses and ways to help them get credit so they can expand.\n\nTAPPER: So, before the election?\n\nGEITHNER: Oh, absolutely.\n\nTAPPER: A number of Senate democrats, moderate Senate democrats have said that they oppose repealing or allowing to expire the Bush tax cuts on the wealthiest Americans that they think that would be harmful to growth.\n\nAre you guys going to have the votes to get through the package you want which is focused more on middle and lower income America?\n\nGEITHNER: Oh absolutely. I believe we will.\n\nTAPPER: Some in the administration and internal discussions are talking about maybe just keeping all the Bush tax cuts for a year or two. Those aren't -- that's not going to happen?\n\nGEITHNER: I don't believe it should and I don't believe it will. Again, because what the president's proposed is to make sure we're leaving them in place for the people that need the most and can make the most difference in helping make sure this economy comes back. That we heal the damage caused by this crisis.\n\nTAPPER: Job creation has not gone as well as you hoped. What more can you do? I know there's this small business lending initiative. What more can you do given the lack of appetite on Capitol Hill for any spending programs? Any more stimulus?\n\nGEITHNER: Well you know, the President's proposed a very strong package of help for small businesses which you just referred to. He'd support giving more support to states so they can keep teachers in the classroom.\n\nTAPPER: Fifty billion dollars in emergency spending but the Congress has not acted on that.\n\nGEITHNER: They haven't yet, but we can (inaudible) case for doing it. They're going to, we're going to keep at that. But right now, the best thing the government can do in addition to those things, is help create the conditions for the private sector to start to invest in hiring again.\n\nNow, we've seen six months of positive job growth by the private sector. That's pretty good.\n\nTAPPER: By the private sector.\n\nGEITHNER: Pretty good this early in a recession.\n\nTAPPER: Although you count in the public sector with the layoffs and the census jobs.\n\nGEITHNER: But only because of census. But you know, what matters is -- is the private sector starting to hire people, add back hours and that's what's critical.\n\nAnd you're seeing that happen now. Now we want it -- we want to see it happen at a faster pace. But I think most people understand that you know, this was a deep crisis. The scars ran very deep. Devastating damage. It's going to take time to repair that damage, take time to grow out of this. But we're making progress.\n\nTAPPER: In 2009 when President Obama talked about unemployment insurance extensions he talked about how it was paid for. This time, it was not paid for, the $34 billion in unemployment insurance extensions became added to the national debt.\n\nRepublicans on Capitol Hill argued that they wanted to pay for it and they supported it but they just wanted it offset by spending cuts.\n\nGiven the fact that we're going to be -- we're going to have unemployment for the foreseeable future, high unemployment. Isn't it the fiscally responsible thing to do to not treat this as emergency spending but treat this as something we know is coming down the pike so we're not just laying this burden on our future generations?\n\nGEITHNER: I don't think so. In a crisis that was this bad and a recession that was that deep. With this amount of lasting damage, scars from recovery, it's appropriate to treat these things as emergencies.", "images": ["https://i.abcnewsfe.com/a/bf2f8ed5-a320-4d7e-b583-179abe072d92/trump-signs-shutdown-bill-20251112-ap-jh_1763006747268_hpMain_square.jpg?w=208", "https://i.abcnewsfe.com/a/009e3420-a5ae-477a-aeb3-edfa85648814/johnson-2-gty-jef-251118_1763480583977_hpMain_square.jpg?w=208", "https://i.abcnewsfe.com/a/a904a3c1-1e2d-4174-9130-e846e8059dee/carnivaldeath_1762746067738_hpMain_square.jpg?w=208", "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://i.abcnewsfe.com/a/7669390d-d027-4ec7-9673-1d2eccafbbec/comey-gty-er-251117_1763404424377_hpMain_square.jpg?w=208", "https://assets-cdn.abcotvs.net/static/images/DisneyPlus.svg"], "top_img": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "keywords": [], "authors": ["Abc News"], "canonical_link": "https://abcnews.go.com/ThisWeek/week-transcript-geithner/story?id=11245464", "title": "'This Week' Transcript: Geithner", "meta_data": {"viewport": "initial-scale=1.0, user-scalable=yes", "og": {"locale": "en_US", "site_name": "ABC News", "url": "https://abcnews.go.com/ThisWeek/week-transcript-geithner/story?id=11245464", "title": "'This Week' Transcript: Geithner", "description": "Transcript of 'This Week' interview with Treasury Secretary Timothy Geithner", "image": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "type": "article"}, "description": "Transcript of 'This Week' interview with Treasury Secretary Timothy Geithner", "keywords": "this week, jake tapper, timothy geithner, chris christie, new jersey, treasury, Article, 11245464", "theme-color": "#fff", "copyright": "2025 ABC News", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "'This Week' Transcript: Geithner", "lastPublishedDate": "2010-07-26T09:32:17Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/prism-story,11245464", "ipad": "abcnewsipad://link/prism-story,11245464", "googleplay": "https://abcnews.go.com/ThisWeek/week-transcript-geithner/story?id=11245464"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "'This Week' Transcript: Geithner", "description": "Transcript of 'This Week' interview with Treasury Secretary Timothy Geithner", "url": "https://abcnews.go.com/ThisWeek/week-transcript-geithner/story?id=11245464", "image": {"identifier": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/prism-story,11245464", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/prism-story,11245464", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/ThisWeek/week-transcript-geithner/story?id=11245464", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/ThisWeek/week-transcript-geithner/story?id=11245464"}}}, "movies": [], "publish_date": null, "source": "http://abcnews.go.com", "summary": ""}