{"url": "https://www.complex.com/music/2018/04/the-weeknd-and-bella-hadid-spotted-kissing-all-night-at-coachella", "text": "The Weeknd appeared to have a pretty busy, uhh, weekend performing and enjoying the scene at the first round of the Coachella Valley Arts & Music Festival. After giving a tearful performance of songs from his latest EP My Dear Melancholy, the 28-year-old artist was seen at an afterparty kissing up on his ex, Bella Hadid.\n\nOne source revealed to E! News that the old flames were attending Poppy nightclub's Coachella pop-up on Friday night where they were spotted \"kissing all night.\" The pair apparently weren't concerned about privacy, as the source said the singer and supermodel spent the whole night together at the party.\n\n\"They spent the whole night together and left together. Bella looked really happy. They were definitely super affectionate, cuddling each other while hanging out with their friends.\"\n\nSome think that Abel and Hadid's afterparty PDA debunks the theory that his sorrowful performance earlier that night was due to his breakup with Selena Gomez, but we can't say for sure.\n\nWhat's even more confusing is that on day two of the festival, Abel was spotted strolling side-by-side with yet another girl. This time, he was seen with his arm around Justin Bieber's ex Chantel Jeffries, reports TMZ. Onlookers watched as the two wandered through the VIP area, and at one point the pair were seen hugging, with Jeffries resting her head on his shoulder.\n\nAt this point, who knows what direction the Weeknd's heart is pointed towards, but if his latest music is any indication, he's still in a pretty raw emotional state. Let's just hope he doesn't break any more hearts in the process of healing his own this time.", "images": ["https://images.complex.com/complex/image/upload/ar_1.91,c_fill,g_auto,q_auto/v1723864724/sanity-new%2Ftmp-name-3-1161-1670465859-78_16x9-6352036"], "top_img": "https://images.complex.com/complex/image/upload/ar_1.91,c_fill,g_auto,q_auto/v1723864724/sanity-new%2Ftmp-name-3-1161-1670465859-78_16x9-6352036", "keywords": [], "authors": [], "canonical_link": "https://www.complex.com/music/a/nora-grayce-orosz/the-weeknd-and-bella-hadid-spotted-kissing-all-night-at-coachella", "title": "The Weeknd and Bella Hadid Reportedly Spotted 'Kissing Al...", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "The Weeknd showcased an emotional performance at Coachella, then was seen cozying up with Bella at an afterparty.", "og": {"title": "The Weeknd and Bella Hadid Reportedly Spotted 'Kissing Al...", "description": "The Weeknd showcased an emotional performance at Coachell...", "url": "https://www.complex.com/music/a/nora-grayce-orosz/the-weeknd-and-bella-hadid-spotted-kissing-all-night-at-coachella", "site_name": "Complex", "image": "https://images.complex.com/complex/image/upload/ar_1.91,c_fill,g_auto,q_auto/v1723864724/sanity-new%2Ftmp-name-3-1161-1670465859-78_16x9-6352036", "type": "article"}, "twitter": {"card": "summary_large_image", "site": {"identifier": "@complex", "id": 13049362}, "title": "The Weeknd and Bella Hadid Reportedly Spotted 'Kissi...", "description": "The Weeknd showcased an emotional performance at Coachella, then was seen cozying up with Bella at an afterparty.", "image": "https://images.complex.com/complex/image/upload/ar_1.91,c_fill,g_auto,q_auto/v1723864724/sanity-new%2Ftmp-name-3-1161-1670465859-78_16x9-6352036"}}, "movies": [], "publish_date": null, "source": "https://www.complex.com", "summary": ""}