{"url": "https://people.com/politics/donald-trump-jr-relationship-father/", "text": "In the months since President Donald Trump took office, his eldest son, Donald Trump Jr., has become one of his father’s most vocal supporters — and Twitter defenders.\n\nThe president returned the favor on Tuesday and Wednesday, coming to his son’s defense after his namesake seemingly embroiled himself more deeply in the ongoing Russian collusion investigation by releasing emails detailing how he eagerly set up a meeting with a Kremlin-linked lawyer who allegedly promised damaging information on his father’s presidential rival, Hillary Clinton.\n\n“My son is a high-quality person and I applaud his transparency,” the president said in a statement delivered by his principal deputy press secretary, Sarah Huckabee Sanders, at an off-camera press briefing Tuesday afternoon.\n\nTrump followed up on Twitter early Wednesday, praising his son’s interview with Fox News’ Sean Hannity overnight. Trump Jr. admitted during the show that “in retrospect, I probably would have done things a little differently.”\n\n“My son Donald did a good job last night. He was open, transparent and innocent This is the greatest Witch Hunt in political history. Sad!” Trump tweeted.\n\nTrump Jr., 39, first emerged as one of father’s fiercest defenders during the presidential campaign — and before that worked side-by-side with his dad while running the family business — but the pair haven’t always been as close are they are today.\n\nRon Galella, Ltd./WireImage\n\nAs a preteen, Trump Jr.’s relationship with his father was fraught following Trump’s separation from his first wife, Ivana Trump, the mother of eldest children Donald Jr., Ivanka and Eric.\n\nTrump Jr. was 12 at the time and didn’t speak to his father for a year after the highly publicized split, New York magazine reported in a 2004 article about the Trump children.\n\nTrump Jr. told the magazine that at the time he blamed the divorce on his father, who had been having an affair with model Marla Maples. But he added that in retrospect he may have been “manipulated” into that belief by his mother.\n\n“Listen, it’s tough to be a 12-year-old. You’re not quite a man, but you think you are. You think you know everything. Being driven into school every day and you see the front page and it’s divorce! THE BEST SEX I EVER HAD! And you don’t even know what that means,” he said, referencing the heavy gossip-column coverage of his parents’ split, some of which was encouraged by his father.\n\nRon Galella/WireImage\n\nAfter his parents’ divorce, Trump Jr. and his brother Eric were shipped off to boarding school, the Hill School in Pottstown, Pennsylvania, to remove them from the New York society scene, according to Vanity Fair.\n\nAt school, Trump Jr. practiced skeet shooting, and — unlike his father — seemed to enjoy life outside the spotlight.\n\n“When I went to boarding school, it all kind of went away — all those inconveniences that I found intrusive,” he told New York in 2004.\n\nAndrew Savulich/NY Daily News Archive/Getty\n\nTrump Jr. also told The New York Times in March that he decided early on not to measure himself against his father.\n\n”I think people are often surprised, but I never defined myself as, ‘I’m the business guy who has to supersede what my father has done,’ ” he said. ”He’s a totally unique individual. Somehow having to top his accomplishments is never the way I perceived things.”\n\nAs a child, Trump Jr. found a role model not in his father but in his maternal grandfather, Milos Zelnicek, an electrician and avid outdoorsman. In the summers, Trump Jr. stayed at his grandparents’ home outside Prague for six to eight weeks at a time, where his grandfather taught him how to camp, fish, hunt and speak Czech, the Times reported.\n\n”He needed a father figure,” Ivana told the newspaper in a telephone interview. ”Donald was not around that much. They would have to go to his office to say hello to him before going to school.” (Ivana also once hinted at her ex-husband’s alleged barely-there parenting by saying: “When [my children] turned 21, I handed them over to him and said, ‘Here’s the finished product.’ “)\n\nRELATED VIDEO: Donald Trump Jr. Changes Account of Russian Lawyer Meeting\n\nTrump Jr. went on to attend father’s alma mater, the Wharton School at the University of Pennsylvania, where he was by all accounts (including his own) a big partier who “had a reputation” for getting into “drunken, ‘do-you-have-any-idea-who-I-am?’ fights,” according to New York.\n\nVanity Fair reported that Scott Melker, a Penn classmate, wrote on Facebook, “Donald Jr. was a drunk in college. Every memory I have of him is of him stumbling around on campus falling over or passing out in public, with his arm in a sling from injuring himself while drinking. He absolutely despised his father, and hated the attention that his last name afforded him.”\n\nMelker also described an alleged incident in which Trump showed up to his son’s dorm room to take him to a Yankees game. Trump Jr. was dressed in a Yankees jersey and when he opened the door to his father, “without saying a word, his father slapped him across the face, knocking him to the floor in front of all of his classmates. He simply said, ‘Put on a suit and meet me outside,’ and closed the door.” A spokesperson for the Trump family told Vanity Fair this story is “completely false.”\n\nAfter graduating, Trump Jr. initially declined to join the family business, instead moving to Aspen, Colorado, where he hunted, fished, camped, lived out of the back of a truck, and bartended, according to Vanity Fair — which also reported that Trump Jr. stopped talking to his father during this time.\n\nRELATED VIDEO: Exclusive: Natasha Stoynoff Speaks Out: ‘I Don’t Want Women to Feel Afraid’\n\nSeveral months later, on Feb. 25, 2001, Trump Jr. was arrested for public drunkenness during a Mardi Gras celebration in New Orleans. He spent 11 hours in jail.\n\nLike his teetotaler father, Trump Jr. no longer drinks. But he attributes this not to inspiration from his father but rather to the discipline of the sporting life. ”I know that the benefits I got from being in the woods, from being in a duck blind, from being in a tree stand at 5 o’clock in the morning, kept me out of so much other trouble I would have gotten into in my life,” Trump Jr. said in a speech at a 2016 fundraiser.\n\nAfter returning from Aspen in 2001, Trump Jr. went to work at the Trump Organization, where he climbed the ranks to executive vice president. During his first big project, the Trump Park Avenue, he clashed with his father on the decor (the elder Trump insisted on gold doorknobs), The Washington Post reported. After the project was completed, Trump Jr. jokingly asked his father to put “Trump Junior” on the facade, but his father refused.\n\nIn 2003, Trump introduced his son to his future wife, former model Vanessa Haydon, at a fashion show. Trump proposed with a ring from the Bailey, Banks & Biddle jewelry store in Short Hills, New Jersey, in exchange for publicity, and was later mocked in the New York Post, which ran the story with the headline: ”Trump Jr. Is the Cheapest Gazillionaire: Heirhead Proposes With Free 100G Ring.” (The couple went on to have five children, now between the ages of 10 and 3.)\n\nAccording to Vanity Fair, Trump also publicly criticized his son at the time, saying on CNN’s Larry King Live: ”You have a name that is hot as a pistol, you have to be very careful with things like this.”\n\nDonald Trump Jr. looks on as his father, Donald Trump, gives a political speech in 2016. Ethan Miller/Getty\n\nDespite their sometimes-rocky relationship, Trump Jr. has been nothing but supportive since his father launched his presidential bid, joining him on the campaign trail and using Twitter to lash out at his father’s many critics.\n\nTrump Jr.’s interest in hunting and close friendships with gun enthusiasts and people who enjoy the outdoors — so foreign from the New York elite world his father long operated in — have endeared him to some conservatives and to his father’s Middle America supporters while also riling animal rights activists who criticized his big game hunting trips in Africa.\n\nAfter delivering a rousing speech at the Republican National Convention in July 2016, he was embraced as a rising Republican political star and applauded for his poise and focus — qualities not usually attributed to his father.\n\nThough it may not seem like it based on his politics-focused Twitter activity, Trump Jr. maintains that his focus these days is on running the Trump Organization. He has claimed several times that he has barely spoken to his father since he took office in January.\n\nIn March, amid criticism that his father had not sufficiently removed himself from his businesses, Trump Jr. said at a GOP fundraiser that he’d had virtually ”zero contact” with the president since the election. He insisted to The New York Times later that month, ”I haven’t spoken to him. Maybe just to say hello. It feels trite. I feel ridiculous bothering him.”\n\nCritics were quick to point out that Trump Jr. had recently joined his father for his announcement of Supreme Court nominee Judge Neil M. Gorsuch in late January.\n\n“Where is the break point?” Trump Jr. said when asked about this by the Times. ”If I see him once a month, is that too much? Once a year? My point is, it’s a no-win scenario. But, in the end, we both fully recognize that what he is doing now is far more important than absolutely anything going on in the business. And we will conduct ourselves accordingly.”\n\nNow, Trump Jr. has a much bigger issue to worry about as he faces widespread criticism, allegations of treason and potential legal troubles over his June 2016 meeting with Russian lawyer Natalia Veselnitskaya. There’s a growing call for Trump Jr. to testify before the Senate Intelligence Committee about his email exchange on the meeting, which he said he’d be “happy” to do.\n\nThe fallout from the revelation that Trump Jr. met with the Russian lawyer (who has since denied any alleged ties to the Russian government) has prompted critics to say that the businessman has never seemed more like his father’s son.\n\nA Vox article on Trump Jr.’s Russia email controversy proclaims: “Donald Trump Jr. is the embodiment of all of his father’s weaknesses — and now he may well bring down his father’s administration.”", "images": ["https://people.com/thmb/zX1LnHsXtJDKcBI2nzT5rKhxj8c=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Cheryl-Hines-RFK-Jr-092224-02-39e6e57fc3234d39bfd0641f46cae356.jpg", "https://people.com/thmb/OtiRA4smSjpKJSUNWJdX3g1LcCc=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/donald-trump-jr-4-1-1196ad970a5c49e0acf6168256c5d2c8.jpg", "https://people.com/thmb/7SEadthVkhhEebCd986F7tF2zCM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Jack-Schlossberg-RFK-Jr-103025-164d26f2a1884c1890e60b92b2fe09f6.jpg", "https://people.com/thmb/moFlRJFDAoMqmc7Jq_KclBZG0bQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/jfk-jack-schlossberg-1-b6ed347c8ba04dbeb878e7c74018fbb6.jpg", "https://people.com/thmb/VksHOhpfMtdSAmCxRPcN4iLHvUQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/donald-trump-jr-1-1-af325cab0aa24a7980abc7d638db9eef.jpg", "https://people.com/thmb/0uuPpcjt34Euvi_WPkpfOgq-rEA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/cheryl-hines-donald-trump-111225-7501d9db7bd0481783f9dd9b9776588b.jpg", "https://people.com/thmb/yRHHVSDe1ntjMGb3wl8-sykrH0k=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(750x0:752x2)/donald-trump-jr-2-1-66061d4f0cf340219af7f8651b3d9b08.jpg", "https://people.com/thmb/Z271x289wUgRhXNoV5iXot8jNHs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/ryan-murphy-jack-schlossberg-1-111225-2ca8fd6fe46c4ac0ab45ea151f65829b.jpg", "https://people.com/thmb/072FcFgYt4njzPY-4dIJ_sIs4NA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/donald-trump-jr-kids-1-8326165e04ac49df8523ff5b570a62ba.jpg", "https://people.com/thmb/V2FiBbng_4hsFJmQh9Owz4UsICM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/melania-trump-1-110725-5bf5786ccbdf4bf8ab29721c4078f812.jpg", "https://people.com/thmb/P1GC4I6fWr1lX5w4qpa5nN7iiaw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/press-secretary-karoline-leavitt-051225-a27ed9ca6a0248beb4fc804e3958a453.jpg", "https://people.com/thmb/XCTxCpSYBKF70dWA0YQS3UW-2zg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/jenna-bush-hager-george-w-bush-today-show-111925-778ae12d03dd43acb804e28cf7ad253e.jpg", "https://people.com/thmb/CkQ1vztWEC2d2UePpuNEhTV9rdw=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/President-Donald-Trump-Barron-Trump-111325-tout-73707358577244dab63be9bbe104bd38.jpg", "https://people.com/thmb/ucS2pYysmUKJESkSluKR1gRq-zQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/donald-trump-melania-trump-111125-203c9062291842de9d38dc0424b42459.jpg", "https://people.com/thmb/Vx3LB5v51xGgZrvFxTNyNgh2Dok=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/donald-trump-jr-3-5e91a71b6f744dfaa8465f1639aa4b1d.jpg", "https://people.com/thmb/WbesqHQiWyJQdC1_FxWR-JjmPsU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/President-Donald-Trump-Barron-Trump-111325-tout-73707358577244dab63be9bbe104bd38.jpg", "https://people.com/thmb/LcK_jd1RhefU9zxYl74ScMw9ZMA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Jack-Schlossberg-3-061824-f88d499cc270403d973bb26da6ab768d.jpg", "https://people.com/thmb/l1heBQe1jhrtwJjca13fVum5wTk=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/ekaterina-gordeeva-sergei-grinkov-ice-skating-111925-43f6a37ba62840c685a1b57f3a2569ac.jpg", "https://people.com/thmb/13l3dtw2LAAo6AC2Kozs6Q_VZRE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/donald-trump-jr-f820ece441d643ecb226cae9f46f61b7.jpg", "https://people.com/thmb/W7pR5Ab5uQ2xdjO8WSlfEinulo0=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/Vencent-Hickerson-111925-6-f70136ab95854fed905274e761d98e0f.jpg", "https://people.com/thmb/iz1n3BpfONiCKLtVXh7zJvjlzqI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/donald-trump-barron-trump-1-082525-af2270260ee74e969c9caae1b0cf913a.jpg", "https://people.com/thmb/v5h7Y87YLqY_AU1MdVoBzYcnhv0=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/Jack-Schlossberg-Donald-Trump-Robert-F-Kennedy-Jr-111525-bb59d470f3ff490a86e096966fe6b6bf.jpg", "https://people.com/thmb/6IyhFgQT3wu0NWP0Aphz5wDFs4s=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/Kelsey-Zach-Top-Riley-Green-111925-f36976ca5eb14ae792f092060f209f93.jpg", "https://people.com/thmb/SLX76p4w-rfRc_Kk1N7oqdNk8qw=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/meghan-king-5th-Annual-Vanderpump-Dog-Foundation-Gala-2023-jim-edmonds-Busch-Stadium-2024-092425-66f95d42ed374e038155e8e43fc99358.jpg", "https://people.com/thmb/w9ypTW0On9zps_-PXgrV4gGqD5s=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/donald-trump-barron-trump-1-082525-af2270260ee74e969c9caae1b0cf913a.jpg", "https://people.com/thmb/aZxV3caC_y2nqo8y5uGVj4OiObc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Jack-Schlossberg-Donald-Trump-Robert-F-Kennedy-Jr-111525-bb59d470f3ff490a86e096966fe6b6bf.jpg", "https://people.com/thmb/0hD316u-6cSDLNtFaGGdaOOFYrY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Laura-Ingraham-Donald-Trump-Jr-102025-479aa425d1cb4df299620e98e99c47d5.jpg", "https://people.com/thmb/RxUdamkOcZF-SdAhxfMpjKjvOWc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Melania-Trump-White-House-Halloween-Decorations-102825-c9a5a99b530146e1b87ea743237686c3.jpg"], "top_img": "https://people.com/thmb/13l3dtw2LAAo6AC2Kozs6Q_VZRE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/donald-trump-jr-f820ece441d643ecb226cae9f46f61b7.jpg", "keywords": [], "authors": ["Tierney Mcafee", "Tierney Mcafee Is A Former Staff Editor At People. She Left People In", "People Editorial Guidelines", "Greta Bjornson", "Bailey Richards", "Meredith Kile", "Rebecca Aizin", "Kimberlee Speakman", "Stephanie Kaloi", "Janelle Griffith"], "canonical_link": "https://people.com/politics/donald-trump-jr-relationship-father/", "title": "Donald Trump Jr.'s Relationship with His Father Through the Years", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Donald Trump Jr. emerged as one of father's fiercest defenders during the presidential campaign -- but the pair haven't always been as close are they are today", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "PEOPLE", "sailthru.author": "Tierney McAfee", "sailthru.tags": "politician-families", "parsely-section": "Politics", "parsely-tags": "Celebrity,Person,People.com,Politician Families,Politics,Donald Trump Jr.,The Scoop", "article": {"section": "People", "author": "https://www.facebook.com/peoplemag"}, "og": {"type": "article", "site_name": "People.com", "url": "https://people.com/politics/donald-trump-jr-relationship-father/", "title": "Donald Trump Jr.'s Relationship with His Father Through the Years", "description": "Donald Trump Jr. emerged as one of father's fiercest defenders during the presidential campaign -- but the pair haven't always been as close are they are today", "image": "https://people.com/thmb/13l3dtw2LAAo6AC2Kozs6Q_VZRE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/donald-trump-jr-f820ece441d643ecb226cae9f46f61b7.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Donald Trump Jr.'s Relationship with His Father Through the Years", "description": "Donald Trump Jr. emerged as one of father's fiercest defenders during the presidential campaign -- but the pair haven't always been as close are they are today", "image": "https://people.com/thmb/13l3dtw2LAAo6AC2Kozs6Q_VZRE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/donald-trump-jr-f820ece441d643ecb226cae9f46f61b7.jpg"}, "vf": {"url": "https://people.com/politics/donald-trump-jr-relationship-father/"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.147.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.147.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.147.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.147.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.147.0/icons/favicons/mstile-310x150.png", "fb": {"pages": 95926963131}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}