{"url": "https://en.wikipedia.org/wiki/Bella_Hadid", "text": "American fashion model (born 1996)\n\nNot to be confused with Béla Hadik\n\nIsabella Khair Hadid ( hə-DEED; born October 9, 1996) is an American model.[3] Hadid has made 35 appearances on international Vogue covers.[4] In 2022, she was named Model of the Year by the British Fashion Council.[5] Time magazine named her one of the 100 most influential people in the world on its annual list in 2023.[6]\n\nBorn in Washington, D.C., and raised in Santa Barbara, California, Hadid began her modeling career aged 16. She was signed to IMG Models in August 2014, and made her New York Fashion Week debut the following month.[7] In 2016, she was voted \"Model of the Year\" by industry professionals for Models.com.[8] In 2017, Hadid broke Doutzen Kroes's record for the most Vogue September covers in one year by appearing in five international editions.[9] As of 2023 , Hadid was one of the world's highest paid models, earning $19 million.[10]\n\nEarly life [ edit ]\n\nHadid was born on October 9, 1996, in Washington, D.C.[11][12][3] Her father, Mohamed Hadid, is a Palestinian-American real estate developer, while her mother, Yolanda Hadid (née van den Herik), is a Dutch former model.[13][14][15] Through her father, Hadid claims descent from Zahir al-Umar, ruler of northern Palestine in the mid-18th century.[16][17] She has an older sister, Gigi Hadid, and a younger brother, both of whom are also models.[18] She also has two older paternal half-sisters.[19] In May 2025, Hadid and her sister Gigi announced in a statement that they have a younger half sister through their father named Aydan Nix. They shared that they connected with Nix in late 2023. Nix was welcomed by her mother, Terri Hatfield Dull, after a brief relationship with Mohamed that came after his divorce from Yolanda.[20] Hadid and her siblings were raised on a ranch in Santa Barbara, California.[21] The family moved to Beverly Hills after ten years.[22] Hadid's childhood home was destroyed in January 2025 due to the series of wildfires in Southern California.[23]\n\nAs a teenager, Hadid was an equestrian and dreamed of competing at the 2016 Summer Olympics,[24] although she competed in equitation,[25][26] which is not an Olympic discipline. She was diagnosed, along with her mother and brother, with chronic Lyme disease in 2012.[27] During her high school years, Hadid experienced difficulties with inattention and was diagnosed with attention deficit hyperactivity disorder. She was prescribed Adderall, but subsequently developed anorexia as a result of the appetite suppressant.[4]\n\nAfter graduating from Malibu High School in 2014, Hadid moved to New York City to study photography at the Parsons School of Design. She suspended her studies to focus on her modeling career, but has expressed an interest in returning to school once she was done modeling to branch out into fashion photography.[28]\n\nCareer [ edit ]\n\n2012–2014: Early work [ edit ]\n\nHadid's modeling career began when she was sixteen years old with a commercial project for Flynn Skye. She also appeared in modeling projects such as Lesa Amoore's \"The Swan Settings\", alongside actor Ben Barnes, and Holly Copeland's \"Smoking Hot\". Hadid also modeled for Hanna Hayes' Fall/Winter 2013 Collection, and did campaign work for Chrome Hearts, the family brand[clarification needed] of her best friend, Jesse Jo Stark.[29][30]\n\n2014–2015: Rise to prominence [ edit ]\n\nHadid signed to IMG Models on August 21, 2014.[31][1][32] She made her New York Fashion Week debut in September, walking for Desigual.[33] In December, Hadid made her first cover appearance on Jalouse,[34] and was featured on day 27 of Love magazine's Love Advent Calendar.[35][36]\n\nIn February 2015, Hadid made her runway debut, walking for Tom Ford's Fall/Winter 2015 collection.[37] In April, she was featured in two editions of Carine Roitfeld's CR Fashion Book – \"Body By Bella\" and \"Fantasy Campaigns\".[38][39] In May, she walked for amfAR's 22nd Cinema Against AIDS Gala.[40]\n\nIn the spring, she was featured in a campaign for Botkier Bags. In August, she starred in Victoria's Secret Pink Holiday campaign, alongside models Rachel Hilbert and Devon Windsor.[41] In the fall, she was featured in a campaign for Boghossian Jewelry. In late 2015, at New York Fashion Week, Hadid walked for Diane von Fürstenberg, Tommy Hilfiger, Marc Jacobs, and closed for Jeremy Scott. At London Fashion Week, she walked for Topshop Unique and Giles. At Milan Fashion Week, she walked for Philipp Plein, Moschino, Missoni, and Bottega Veneta. At Paris Fashion Week, she walked for Balmain. In December 2015, she made her Chanel debut, walking for the first time for Métiers d'Art in Rome.[42]\n\nShe appeared on the November 2015 cover of Seventeen.[43] She also starred in Topshop's Holiday campaign, along with eight models, and was featured again on days 14 and 15 of Love's Love Advent Calendar.[44][45] She and her sister Gigi Hadid, appeared in Balmain's Fall 2015 campaign.[46] and the Fall 2015 ad campaign for Ralph Lauren Denim & Supply. She co-starred in Samsung's Fall/Winter Look Book with Xiao Wen Ju, which incorporated both technology and fashion.[47]\n\nDuring 2015, Hadid shot editorials for several magazines, including Vogue Australia, Vogue Girl Japan, Harper's Bazaar, GQ, W, Town & Country, Pop Magazine, Glamour, and Elle.[48] She also appeared on the covers of Unconditional, Grey, V (with sister, Gigi), Editorialist, Wonderland's 10th Birthday Issue, S Moda, Evening Standard, Teen Vogue, and Twin's Fall/Winter Issue.[49][50][51]\n\n2016–2017: Breakthrough [ edit ]\n\nIn January 2016, Hadid made her Chanel Couture debut during Paris Haute Couture Spring/Summer Fashion Week.[52] She also starred in Marc Jacobs' campaign, \"My America\".[53] In February, she walked for Fenty x Puma at New York Fashion Week.[54] She walked exclusively for Givenchy, Chanel, and Miu Miu at their shows at Paris Fashion Week in March. She also starred in Joe's Jeans Spring 2016 campaign.[55] In May, she made her Australian Fashion Debut at Mercedes-Benz Fashion Week, exclusively opening and closing the Misha Collection Resort 17 show.[56][57] She also walked for amfAR's 23rd Cinema Against AIDS Gala and Dior Cruise 2017 in London.[58][59]\n\nOn May 31, 2016, Hadid became an ambassador for Dior Makeup. She starred in a web series from the fashion house called Dior Makeup with Bella Hadid, and did a tutorial using their makeup for American Vogue's YouTube channel.[59] In June, she walked Givenchy's Menswear Fall 2016 campaign in haute couture during Paris Fashion Week.[60] In July, she walked for Versace, Dior, and closed the show for Alexandre Vauthier. She then closed the show for Fendi's Haute Couture campaign in Rome.[61]\n\nHadid started off the Spring/Summer 2017 season during New York Fashion Week, opening for DKNY and walking for Michael Kors, Anna Sui, Ralph Lauren, and Marc Jacobs.[62][63]\n\nDuring London Fashion Week, she exclusively opened for Versus (Versace). During Milan Fashion Week, she opened shows for Alberta Ferretti and Fendi, walked for Max Mara, Moschino, Versace and Bottega Veneta, and closed for Philosophy di Lorenzo Serafini.[64][65] She also starred in Topshop's Denim campaign.[66] In June, she was featured in Givenchy's Fall/Winter campaign.[67] In July, alongside Frank Ocean, Kate Moss, and others, she was featured in the Calvin Klein Fall/Winter campaign.[68] In August, she starred in J.W. Anderson's Fall/Winter campaign.[69] She also photographed her close friends, the Stark family, for W.[70] In October, she starred in Misha Collection's campaign, \"Gold by Misha\".[71] On November 30, she made her Victoria's Secret Fashion Show debut.[72] On December 13, she announced her first clothing line with longtime friend and partner, Chrome Hearts.[73]\n\nDuring 2016, she appeared on the covers of Seventeen Mexico, Self Service, CR Fashion Book's \"#CRGirls\", V , Harper's Bazaar (Spain, Japan, Australia and Russia), Elle (Brazil, United States, United Kingdom, Thailand, Indonesia and Malaysia), Allure, Double Magazine, Glamour (Germany, United States, Russia, Hungary, Romania, Bulgaria, Turkey and Iceland), Exit, W Korea, L'Officiel Russia, Sunday Times Style, British GQ, Flare, and Paper.[74][75][76][77][78] In May, Hadid scored her first Vogue cover for Vogue Turkey, and made her short film debut in Tyler Ford's film, Private.[79] In August, she appeared on the cover of Vogue Me with Korean rapper G-Dragon. In September, she appeared in three more Vogue covers for Japan, Italia, and Paris, alongside model Taylor Hill.[80][81] She was also the star of Love's 2016 Advent Calendar.[82]\n\nHadid at the Met Gala in 2017\n\nIn January 2017, Hadid walked in Givenchy's Fall/Winter Menswear campaign in Paris.[83] She also walked for Chanel and opened the show for Alexandre Vauthier. In February, she became an ambassador for Bulgari's accessory line and TAG Heuer.[84][85] She walked in her sister Gigi's Tommy Hilfiger collaboration show, Tommy x Gigi, in Los Angeles, and closed the H&M Studio show in Paris. Both appearances were last minute additions to the season.[86] During New York Fashion Week, she opened shows for Prabal Gurung and Zadig & Voltaire, walked for Alexander Wang, Sies Marjan, Carolina Herrera, Brandon Maxwell, Michael Kors, Anna Sue and Ralph Lauren, and closed for Oscar de la Renta.[87][88] During London Fashion Week, she was the exclusive opener of the show for Versace Versus.[89]\n\nIn Milan, she walked for Alberta Ferretti, Fendi, Moschino, and Versace. To close out the season, in Paris, she walked for Lanvin, Chanel, Alexandre Vauthier, and opened the show for Off-White. While appearing at the Cannes Film Festival, she walked for Naomi Campbell's Fashion for Relief show and for amfAR's Cinema Against AIDS Gala.[90][91] For Haute Couture week, she opened for Alexandre Vauthier, and walked for Miu Miu Resort, Maison Margiela and Fendi.[92]\n\nHadid and her sister, Gigi, started off the Spring/Summer season together by starring in Fendi and Moschino campaigns.[93] She also shot a campaign for Zadig & Voltaire with her younger brother, Anwar. She appeared solo for DKNY, TAG Heuer, and Boghossian campaigns.[94][95][96] She also starred in Ochirly's Spring and Summer campaign and in Zayn x Versus' collection campaign. She starred in her first beauty campaign for Dior Makeup's \"Pump N' Volume\" mascara.[97] She shot her first campaign with Nike for the Nike Cortez.[98] She starred as the face of Bulgari's Goldea Roman Night fragrance and the Serpiniti collection.[99][100] She shot a second accessories campaign for Max Mara, and starred in Penshoppe's \"Generation\" campaign.[101] During the season, she starred alongside Miles McMillan in Giuseppe Zanotti, Justin Grossman in NARS Cosmetics, and Kendall Jenner in Ochirly's Fall campaign.[102]\n\nHadid's first cover of 2017 was a reprint of her editorial from W United States. It was reprinted for the January issue of W' Korea.[103] Her first new cover of the year was for Teen Vogue, appearing with her best friend, Jesse Jo Stark. In April, she appeared on the cover of Vogue China. In June, she starred on the cover of Vogue Italia.[104][105][106][107] In September, Hadid topped her numbers from the year prior with Elle Russia and Harper's Bazaar China. She also broke the record for most Vogue September covers in one year (formerly kept by Doutzen Kroes in 2013 and Linda Evangelista in 1993),[108][109][110] by appearing in five international editions: China, Spain, Brazil, Australia, and Arabia. She also appeared on the cover of CR Fashion Book, Grazia, Sunday Times Style, Porter, Elle (United States, China, Russia and France), InStyle, and 032c.[111]\n\nShe also shot editorials for Vogue Paris, Love, V , and Dazed.[112]\n\n2018–2023: Further recognition [ edit ]\n\nIn January 2018, Hadid appeared on the cover of Vogue Korea.[113] In March, she starred on the cover of British Vogue with her sister, Gigi.[114] In May, she appeared on the cover of Vogue Japan. In July, she starred on the covers of Cosmopolitan Germany, Harper's Bazaar and Vogue México.[115][116][117] In September, she starred on the covers of Allure and Pop.[118][119] In October, she appeared on the cover of Harper's Bazaar Arabia.[120] For the Fall 2018 season, Hadid opened for Off-White at Paris Fashion Week.[121] In Milan, she walked for Tommy Hilfiger, Missoni, Roberto Cavalli, Tod's, Fendi, Moschino, Alberta Ferretti and Max Mara. In New York, she walked for Michael Kors, Anna Sui, Ralph Lauren, Prabal Gurung, Brandon Maxwell and Jason Wu.[122][123] On November 8, she walked the Victoria's Secret Fashion Show for a third time.[124]\n\nIn February 2019, at Paris Fashion Week, Hadid walked for Redemption, Haider Ackerman and Off-White.[125] In Milan, she walked for Versace, Missoni, Philosophy Di Lorenzo Serafini, Max Mara, Fendi, Versace, Alberta Ferretti, Moschino and Roberto Cavalli. She then walked for CR Runway's 90th Anniversary show alongside models Irina Shayk and Joan Smalls. In New York, she walked for Oscar de la Renta, Michael Kors, Brandon Maxwell and Savage x Fenty.[126] In March, she starred on the cover of Vogue Russia.[127] In April, she starred on the cover of Vogue Greece.[128] In June, she appeared on the covers of Vogue Japan and Vogue España.[129][130] She made a second appearance on Vogue Japan's cover in July.[131] In June, she appeared on the cover of Elle France.[132]\n\nIn February 2020, at New York Fashion Week, Hadid walked for Tom Ford, Brandon Maxwell, Oscar de la Renta, Rodarte, Khaite and Michael Kors.[133] She also walked for Marc Jacobs' Fall campaign.[134] In Paris, she walked for Thierry Mugler and Lanvin. In Milan, she walked for Boss, Missoni, Versace, Tod's, Moschino, Fendi, Max Mara and Alberta Ferretti.[135] She also appeared on the cover of Vogue Hong Kong.[136] In April, she appeared on the covers of Vogue Korea and Vogue Greece.[137][138] In June, she appeared on the cover of Vogue Paris, with her sister, Gigi.[139] In August, she starred on the cover of Elle. Her editorial was shot by her older sister.[140] In September, she appeared on the cover of Vogue Italia.[141] In December, she starred for the cover of Vogue Japan.[142]\n\nIn February 2021, Hadid walked for Givenchy's Fall campaign.[143] In March, she walked for Mugler's Spring/Summer virtual campaign and appeared in Boss x Russell Athletics' campaign.[144][145] She also appeared on the cover of Vogue España.[146] In May, she walked for Versace's AW21 show.[147] In June, during Paris Fashion Week, she walked for Jacquemus' show, \"La Montagne\".[148] In July at the Cannes Film Festival, her Maison Schiaparelli haute couture gown cut low and wide to expose her bare chest attracted considerable coverage.[149][150] At Paris Fashion Week 2022, Hadid closed Coperni's Spring 2023 show by having a slip dress spray-painted directly onto her body using Fabrican technology.[151][152]\n\nThom Browne described Hadid as a talent born once in a generation and has also been named as a bankable muse for fashion.[153] Hadid's ability to raise a fashion brand's profit has been dubbed as the ''Bella Effect''.[153] In 2022, the monetary value for the brand she walked increased up to 29% and rose to 90% for Jil Sander (brand).[153]\n\n2023–present: Career break and return to modeling [ edit ]\n\nIn early 2023 at the peak of her career,[154] Hadid took a break from modeling. Then in 2024 she moved to Fort Worth with her boyfriend.[155][156]\n\nIn July 2024, Adidas pulled the portions of a controversial advertising campaign that featured Hadid, in part due to her Palestinian heritage. The campaign promoted the rerelease of a sneaker that debuted for use in the Munich 1972 Olympics, where Palestinian terrorists killed Israeli athletes in the Munich massacre. Hadid apologized for participating in the ad campaign, noting that she was unaware of the connection between the shoe and '72 Olympics. Adidas apologized to Hadid.[157][158]\n\nShe briefly returned to the runway in Fall 2024 for Saint Laurent and Victoria's Secret.[159][160] Along with limited appearances in advertising and magazines in mid-late 2024.[161] However, in 2025 she made an official return to the runway closing the Saint Laurent A/W show in February.[162] Then after an appearance at the 78th Cannes Film Festival, was featured on the June cover of British Vogue.[163] At Cannes she defied the new dress code which introduced a \"no naked dress\" rule wearing a Saint Laurent dress with a high leg slit and exposed sides.[164][165]\n\nOther ventures [ edit ]\n\nOn September 1, 2021, Hadid became the co-founder and business partner of Kin Euphorics, a nonalcoholic adaptogenic beverage brand.[166] She oversees the company alongside its CEO and founder Jen Batchelor.[167][168] Hadid made her acting debut as a guest role in the third season of Ramy.[169][170][171] In 2024, she founded and launched Orebella, a beauty company that creates fragrances.[172][173]\n\nPersonal life [ edit ]\n\nRelationships [ edit ]\n\nFrom April 2015 to August 2019, Hadid was in an on-again, off-again relationship with singer-songwriter the Weeknd.[174][175] She starred in the music video for his single \"In the Night\" in December 2015.[176] Their relationship received widespread media attention, and was the topic of tabloid speculation.[177][178]\n\nIn July 2020, Hadid began dating art director Marc Kalman.[179][180] Their relationship was made public on July 8, 2021, during her time at Paris Fashion Week and the Cannes Film Festival.[181][182] The couple separated in the spring of 2023, after almost three years of dating.[183] As of October 2023, Hadid is in a relationship with equestrian Adan Banuelos.[184]\n\nReligion [ edit ]\n\nWhen discussing her opposition to President Trump's immigration policies in 2017, Hadid shared during an interview with Porter that she is \"proud to be a Muslim\" while reflecting on her father's history as a Palestinian refugee.[185][186] In March 2022, during a cover story with American Vogue, Hadid revealed that she lives a spiritual lifestyle, and although her family was not religious, her friends and godparents were Jewish and she is interested in Islam. \"I'm very spiritual, and I find that I connect with every religion,\" she explained. \"There's that my-way-is-the-right-way thing in human nature, but for me it's not about my god or your god. I kind of just call on whoever is willing to be there for me.\"[3]\n\nActivism [ edit ]\n\nHadid is a long-time supporter of Palestine.[187][188][189] In January 2017, Hadid attended the \"No Ban, No Wall\" march in New York City, saying in an interview it was her own family history that drove her to participate in the march.[190] In December 2017, Hadid joined protests in London against Trump's decision to move the U.S. embassy in Israel and recognize Jerusalem as the capital of Israel.[191] In October 2023, she condemned the October 7 attacks.[192] Hadid and her sister Gigi donated $1 million to Palestinian aid agencies during the Gaza war.[193]\n\nShe participated in the Gaza war protests and called Israel's actions in the Gaza genocide.[194] Hadid stated that she and her family have received death threats for their pro-Palestinian stance, saying: \"I've been sent hundreds of death threats daily, my phone number has been leaked, and my family has felt to be in danger. But I can not be silenced any longer. Fear is not an option.\"[195] In November 2023, Israeli music duo Ness & Stilla released the single \"Harbu Darbu\",[196] called for her death.[197][198]\n\nAwards and nominations [ edit ]\n\nIn March 2016, Hadid won \"Model of the Year\" at the Daily Front Row's Fashion Los Angeles Awards.[199] In June 2016, Hadid ranked among Models.com's Top 50 Models. In September, she won \"Model of the Year\" at the GQ Men of the Year Awards in London.[200] In December, Models.com nominated Hadid for their Reader's Choice awards for \"Model of the Year\" and \"Social Media Star of the Year\". She was voted \"Model of the Year\" by industry professionals.[201]\n\nFilmography [ edit ]\n\nTelevision [ edit ]\n\nShort films [ edit ]\n\nYear Film title Production Role 2015 Bella Hadid's Guide to LA i-D Herself 2016 Private Tyler Ford Unnamed/Herself 2017 Going Home with Bella Hadid W Magazine Herself\n\nDior Beauty with Bella Hadid [ edit ]\n\nMusic videos [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/9/92/Bella_Hadid_Cannes_2018_%28cropped%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/40px-Wikidata-logo.svg.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Bella_Hadid_Met_Gala_2017.jpg/250px-Bella_Hadid_Met_Gala_2017.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Text_document_with_red_question_mark.svg/40px-Text_document_with_red_question_mark.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Bella_Hadid_Cannes_2018_%28cropped%29_%28cropped%29.jpg/250px-Bella_Hadid_Cannes_2018_%28cropped%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/40px-Wikiquote-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/9/92/Bella_Hadid_Cannes_2018_%28cropped%29_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Bella_Hadid", "title": "Bella Hadid", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/9/92/Bella_Hadid_Cannes_2018_%28cropped%29_%28cropped%29.jpg", "width": 697, "height": 1200}, "title": "Bella Hadid - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}