{"url": "www.cosmopolitan.com/entertainment/music/a22072700/taylor-swift-fourth-july-turks-and-caicos-with-boyfriend-joe-alwyn/", "text": "We may earn commission from links on this page, but we only recommend products we love. Promise.\n\n18 min read\n\nPsst: This timeline is in reverse chronological order. To go back, back to the beginning, scroll alllll the way down.\n\n\n\nTaylor Swift must have learned a lot from the super-public mess that was her relationship with Tom “Questionable Taste in Tank Tops” Hiddleston, because her ’ship with British actor Joe Alwyn has been absurdly private. Like, these two never even officially walked a red carpet together in the almost six years they dated.\n\n\n\nThat’s the bad news (at least for those of us who are incredibly nosy, aka me). The good news is if you’re willing to sleuth around the thirstiest corners of the fandom, there’s actually a lot to discover about Taylor and Joe’s pre-breakup relationship. On that note….\n\nMay 23, 2023\n\nJoe makes his first post-breakup appearance at a Celine dinner in Cannes.\n\nInstagram\n\nMay 18, 2023\n\nSeems like Joe isn’t thrilled about Taylor dating Matty Healy! A source tells the Daily Mail that “Joe feels slighted and is distraught after seeing her budding relationship with Matt but is doing his best to keep busy and focus on himself.”\n\nApparently, “Joe was aware that Taylor and Matt were making music together and collaborating” and “she told him that they had become friends and he trusted her.” But before you jump to any conclusions, the insider denies “overlap” between Joe and Matty.\n\nMay 1, 2023\n\nFans notice that Taylor has seemingly deleted an Instagram reel on which she chats about her relationship with Joe and says, “Like, my relationship for six years, we’ve had to dodge weird rumors, tabloid stuff, and we just ignore it. This song is sort of about the act of ignoring that stuff to protect the real stuff.”\n\nApril 20, 2023\n\nFans notice that a bunch of Taylor’s friends have seemingly unfollowed Joe on Instagram!\n\nApril 13, 2023\n\nOctavio Jones/TAS23 // Getty Images\n\nTaylor vaguely alludes to her and Joe’s breakup while resuming her Eras Tour in Tampa, asking the crowd, “Is it just me, or do we have a lot of things to catch up on?” and then adding, “It’s been a really long time since I’ve been on tour. And to say that a lot has happened is an understatement.”\n\nApril 10, 2023\n\nA People insider drops more info about what caused Taylor and Joe’s breakup. The short answer? “Differences in their personalities.” The long answer?\n\n“They had plenty in common and fell in love in a safe bubble while she was retreating from the world during Reputation. Then the pandemic hit, and they were locked down together and able to continue growing their relationship in this insulated way. But he didn’t really ‘know’ her yet outside of that bubble.”\n\nOh, and “Joe has struggled with Taylor’s level of fame and the attention from the public,” says the source. “The differences in their personalities have also become harder to ignore after years together. They’ve grown apart.”\n\nMeanwhile, Swifties dust off footage of Tay holding back tears while performing “Champagne Problems” back in March—around the time she and Joe were going through their breakup:\n\nApril 8, 2023\n\nEntertainment Tonight reports that Taylor and Joe have broken up after six years together, sending shock waves through the Swiftie community. According to Entertainment Tonight’s report, Taylor and Joe actually split amicably “a few weeks ago.” The outlet describes the breakup as “not dramatic” and is told by a source that “the relationship had just run its course. It’s why [Joe] hasn’t been spotted at any shows.”\n\nMarch 17, 2023\n\nTaylor drops an unreleased tracked from Lover called “All of the Girls You Loved Before,” which fans are fully convinced is about Joe. More specifically, his exes. Listen here!\n\nJanuary 27, 2023\n\nMs. Taylor appears to give a subtle nod to Joe in her new music video for “Lavender Haze.”\n\nEagle-eyed fans are quick to point out that a shot of a vinyl cover for another one of her songs, “Mastermind,” displays two constellations on the cover: Sagittarius, aka Tay’s astrological sign, and Pisces, which is Joe’s.\n\nAugust 28, 2022\n\nTaylor is spotted dashing through the snow NYC streets hand in hand with Joe after a VMAs after-party at Fleur Room. Luckily, Twitter user @TheSwiftSociety posts a clip of the duo making a run for it and heading straight into a ~getaway car~ for the world to see. Talk about staying true to the brand!!\n\n\n\nAugust 24, 2022\n\nTay and Joe are photographed grabbing dinner with the singer’s longtime friend Lena Dunham at private members club Casa Cipriani.\n\nJuly 14, 2022\n\nTaylor and Joe are spotted walking around London in photos exclusively published by the Daily Mail, and everyone immediately zooms in on Tay’s hand only to discover that she is not wearing a ring on her finger. Which is noteworthy because The Sun dropped a report claiming they were engaged, noting that Taylor has been wearing the ring “behind closed doors.”\n\n“Taylor and Joe are incredibly happy and very, very in love,” the source claimed. “They’ve actually been engaged for a few months but have only told their inner-inner circle—basically immediate family and trusted, very old friends. Everyone has been sworn to secrecy too.”\n\nJune 22, 2022\n\nTay and Joe are spotted making out in the Bahamas. No bigs! Nothing to see here! JK, there’s a lot to see, so head below:\n\nRelated Story Here’s Taylor and Joe Kissing in the Bahamas\n\nMay 10, 2022\n\nJoe is asked how Taylor feels about his sex scenes in Conversations With Friends and has this to say:\n\n“I mean, she’s read the book and she loves the book, so she knows it. And she just, like, couldn’t be a bigger fan of the project.”\n\nNoted!\n\nApril 30, 2022\n\nJoe talks about winning his first Grammy in an interview with The Guardian and gives some insight into the dynamic between him and Taylor when it comes to writing songs. “It wasn’t like, ‘It’s 5 o’clock, it’s time to try and write a song together.’ It came about from messing around on a piano and singing badly, then being overheard and being like, ‘Let’s see what happens if we get to the end of it together.’”\n\nHe adds that their collaboration was just something fun the two did during quarantine, “like baking sourdough in lockdown,” although winning the Grammy with his girlfriend was a “ridiculous bonus.” #relatable\n\nApril 20, 2022\n\nThe actor takes a sec to finally (!!) address all the engagement rumors in an interview with WSJ magazine and, always true to his brand, he keeps things coy: “If I had a pound for every time I think I’ve been told I’ve been engaged, then I’d have a lot of pound coins. I mean, the truth is, if the answer was yes, I wouldn’t say, and if the answer was no, I wouldn’t say.” So it’s not no….\n\nApril 13, 2022\n\nJoe dishes to Elle UK on the reason he doesn’t discuss his relationship in interviews: “It’s not really [because I] want to be guarded and private—it’s more a response to something else. We live in a culture that is so increasingly intrusive.…The more you give—and frankly, even if you don’t give it—something will be taken.”\n\nMarch 26, 2022\n\nThe couple attends CAA’s pre-Oscars party at the San Vicente Bungalows, and two sources speak to E! afterward about it. “Taylor was introducing Joe to many people around her,” the first source says. “She looked smitten and proud to be there with him.”\n\nThe second source reveals the two “were very couple-y and cute and seemed happy to be there together. Taylor and Joe were together all night. He was leading her around introducing her to people, and Taylor [was] also introducing people to Joe. When Joe was leading Taylor around, he held his arm around her back.” Hmm…I’m suspecting physical touch might be Joe’s love language?\n\nFebruary 18, 2022\n\nLife & Style reports the duo is engaged, although neither of their reps comment on the rumor. Around this time, a source speaks to Entertainment Tonight and although they don’t outright mention the engagement, they do say Taylor and Joe prefer to keep their relationship private. (Which, duh!) “They’ve been enjoying their time as a couple. They have spoken about their future together and feel very secure about their relationship.”\n\nThe source adds that the two have mastered juggling their careers and relationship, saying, “They’re supportive of each other’s careers and of each other in general. Both of them have been busy with work and they completely understand how to balance hectic schedules and still make time for each other. It’s part of why their relationship really works.” S’cute!\n\nFebruary 9, 2022\n\nWhile discussing his upcoming Hulu show Conversations With Friends, Joe says: “I think people can do what they want and makes them happy. I’m obviously happy in a monogamous relationship.”\n\nJanuary 2022\n\nThe couple is given a “thank you” credit for the film Sharp Stick, which was directed and written by Lena Dunham. Lena explains that Taylor and Joe got to critique the film early on, noting, “They are just really great friends of mine who watched a really early cut of the film and gave me notes. They’re both just really interesting, perceptive people. Taylor’s been one of my close friends for a really long time and Joe is an actor who I actually ended up working with on a project that I shot just a few months after this.” @ Lena, we’re always free to critique too. Just saying!\n\nDecember 19, 2021\n\nJoe posts a series of photos probs from the set of The Stars at Noon with director Claire Denis, and Taylor Likes it within minutes. Goals, if you ask us.\n\nJoe Alwyn // Instagram\n\nOctober 11, 2021\n\n“Betty,” which the pair cowrote, wins an award for Most Performed Song of the Year at the BMI London Awards. Okay, is there anything these two can’t do?!\n\nSeptember 9, 2021\n\nWhile Joe is away filming Hulu’s upcoming adaptation of Sally Rooney’s novel Conversations With Friends, Taylor pays him a visit in Ireland. It’s there that the singer dines at Shu Restaurant and takes photos with the staff. Needless to say, the pics are cute.\n\n“On Thursday evening, we had the pleasure of serving Taylor Swift!” the restaurant shares on Instagram. “Taylor was so lovely and really is a beautiful person inside and out and she kindly agreed to get photos with all our staff!”\n\nMay 20, 2021\n\nEntertainment Tonight releases a story confirming rumors swirling about the couple’s engagement are still alive and well.\n\n“They grew closer than ever during the quarantine and she really trusts him. They’ve been continuing to be pretty low-key about their relationship to the outside world to continue to protect it.…They’ve discussed future plans and Taylor can see herself marrying Joe one day,” a source reveals. *cue suspenseful music*\n\nMay 11, 2021\n\nAfter ~casually~ becoming the first woman and youngest person ever to win the BRIT Awards’ Global Icon award, Taylor mentions Joe in her acceptance speech and it’s truly 🥺. In the clip below, you can watch her smile when she says her BF’s name around the 2:20 mark (ur welcome).\n\nMarch 14, 2021\n\n\n\nAfter Folklore wins Album of the Year at the 2021 Grammy Awards, the singer thanks her boyfriend onstage. “Joe, who is the first person that I play every single song that I write, and I had the best time writing songs with you in quarantine,” she says. We’re not crying, you are!\n\nCBS Photo Archive // Getty Images\n\nFebruary 17, 2021\n\nTaylor opens up to Vanity Fair around the release of her documentary Miss Americana and talks about how Joe encouraged her to use her voice during the 2018 midterm elections.\n\nShe says, “As a country musician, I was always told it’s better to stay out of [politics].…The Trump presidency forced me to lean in and educate myself. I found myself talking about government and the presidency and policy with my boyfriend [Joe Alwyn], who supported me in speaking out. I started talking to my family and friends about politics and learning as much as I could about where I stand. I’m proud to have moved past fear and self-doubt and to endorse and support leadership that moves us beyond this divisive, heartbreaking moment in time.”\n\nJanuary 12, 2021\n\nIn case you still have concerns about the whole “never being pictured together” thing, ~sources~ are here to make it clear Taylor and Joe are in it for the long haul.\n\n“Taylor has gotten more and more comfortable being public with Joe and letting fans in on their romance in a way that she feels is still protecting it,” a source tells Entertainment Tonight. “She loves Joe so much and, of course, is not trying to hide their relationship, but she prefers to keep specific details private.”\n\nFans def knew that last part, but the rest is good intel!\n\nJanuary 11, 2021\n\nTaylor and Joe are seen in London while on a walk with Joe’s mother, Elizabeth. The two look v cute and cozy in winter gear, and according to sources who spoke with E!, the singer has been traveling back and forth between Nashville and London to spend time with her and her boyfriend’s family. 🥺\n\nDecember 16, 2020\n\n\n\nTaylor seemingly can’t stop talking about Joe and their collaborations! Taylor cowrote a song with Joe on her second surprise album of 2020, Evermore, and in an Apple Music interview she said, “Joe and I really love sad songs…we’ve always bonded over music…we write the saddest [songs]. We just really love sad songs. What can I say?”\n\n\n\nSpeaking about their song “Champagne Problems” from Evermore, Taylor says:\n\n“He started that one and came up with the melodic structure of it…and I say it was a surprise that we started writing together, but in a way, it wasn’t because we have always bonded over music and had the same musical tastes. And he’s always the person who’s showing me songs by artists and then they become my favorite songs or whatever. But yeah, ‘Champagne Problems,’ that was one of my favorite bridges to write. I really love a bridge where you tell the full story in the bridge, like you really shift gears in that bridge. I’m so excited to one day be in front of a crowd when they all sing, ‘She would have made such a lovely bride. What a shame she’s f*cked in the head.’…Because I know it’s so sad. I know it’s so sad, but it’s those songs, like ‘All Too Well’—performing the song ‘All Too Well’ is one of the most joyful experiences I ever go through when I perform live. So when there’s a song like ‘Champagne Problems’ where you know it’s so sad, you know that, but I love a sad song, you know?”\n\n“He’s always just playing instruments and he doesn’t do it in a strategic ‘I’m writing a song right now’ thing,” Taylor adds. “He’s always done that. But do I think we would have taken the step of, ‘Hey, let’s see if there’s a song in here. Let’s write a song together’? If we hadn’t been in lockdown, I don’t think that would have happened, but I’m so glad that it did.”\n\n\n\nA People source also had insight into their relationship these days, and it sounds like things between Taylor and Joe have been nothing but smooth sailing. “He is her rock,” says the source. “Their relationship is mature and wonderful.” Love to hear it!\n\nDecember 15, 2020\n\n\n\nRemember that William Bowery theory in which fans speculated Joe was using a pseudonym for writing songs on Folklore? Welp, turns out it was 100 percent true. “There’s been a lot of discussion about William Bowery and his identity. He’s not a real person.…William Bowery is Joe, as we know. And Joe, Joe plays piano beautifully, and he’s always just playing and making things up and kind of creating things,” Taylor said on Jimmy Kimmel Live.\n\nNovember 13, 2020\n\nLooks like Folklore fans were worried for nothing because Taylor’s fully out here talking about her song “Peace” with Paul McCartney in Rolling Stone and how it applies to her ’ship with Joe.\n\nShe said:\n\n“‘Peace’ is actually more rooted in my personal life. I know you have done a really excellent job of this in your personal life: carving out a human life within a public life and how scary that can be when you do fall in love and you meet someone, especially if you’ve met someone who has a very grounded, normal way of living. I, oftentimes, in my anxieties, can control how I am as a person and how normal I act and rationalize things, but I cannot control if there are 20 photographers outside in the bushes and what they do and if they follow our car and if they interrupt our lives. I can’t control if there’s going to be a fake weird headline about us in the news tomorrow.”\n\nPaul then asked Taylor if Joe can “sympathize with that and understand” her life, to which she replied, “Oh, absolutely.” Taylor elaborated: “I think that in knowing him and being in the relationship I am in now, I have definitely made decisions that have made my life feel more like a real life and less like just a storyline to be commented on in tabloids.”\n\nJuly 24, 2020\n\nWell. Can we talk about that new Folklore album? And how it really sounds like Taylor and Joe have broken up?! If you haven’t had an hour to dedicate to listening to Taylor’s latest project, lyrics like, “Waking up alone. But we were something, don’t you think so?” have fans fully freaking out.\n\nBut before you get too carried away, remember that in her album announcement, Taylor said, “In isolation my imagination has run wild and this album is the result, a collection of songs and stories that flowed like a stream of consciousness. Picking up a pen was my way of escaping into fantasy, history, and memory.”\n\nSo this album isn’t necessarily based on her personal experiences, okay? Okay.\n\n\n\nJuly 23, 2020\n\nTaylor made a surprise announcement that she’ll drop a brand-new album tonight, and fans are convinced that Joe wrote two songs on Folklore. You see, in her Instagram announcement, Taylor tagged all but one of her collaborators.\n\nAfter trying to find out who “William Bowery” is to no avail, Swifties are wondering if it’s a pseudonym for Joe. After all, she did make the album while in quarantine, and she was quarantining with him. Also, Taylor and Joe met at the Bowery Hotel, so….\n\nApril 30, 2020\n\nJoe posts a picture of Taylor’s cat and basically confirms they’ve been quarantining together.\n\nInstagram\n\nMarch 24, 2020\n\nAccording to Us Weekly, the couple is reportedly talking about marriage, but they don’t have a date set. Their source added, “Taylor considers Joe one of the only safe constants in her life. He has always been a huge support and stuck by her.”\n\nFebruary 12, 2020\n\nJoe and Taylor kiss at the NME Awards. Their PDA moment was caught on camera by a fan in attendance and can be viewed right this way.\n\nJanuary 31, 2020\n\nTaylor releases her Miss Americana Netflix documentary and briefly talks about Joe. She said, “I also was falling in love with someone who had a really wonderfully normal, balanced, grounded life and we decided together that we wanted our relationship to be private.”\n\nJanuary 5, 2020\n\nTaylor and Joe walk the red carpet (separately) at the 2020 Golden Globes. During an after-party, the two reportedly “appeared smitten.”\n\nOctober 5, 2019\n\nTaylor and Joe are photographed holding hands on the way to a Saturday Night Live after-party following her performance on the show. Clearly, they’re getting more comfortable with PDA because they definitely aren’t trying to hide their vibes in front of this sea of photogs!\n\nGetty Images\n\nAccording to Us Weekly sources, the couple hit up a restaurant with Gigi Hadid that same night and couldn't keep their hands off each other. “They were definitely very cozy with each other. Taylor was on Joe’s arm the whole night and [they] were definitely holding hands a bunch,” a source says, adding, “They were surprisingly warm and intimate toward one another the whole evening.”\n\nAugust 24, 2019\n\nTaylor makes it clear during an interview with The Guardian that she’s never, e-v-e-r going to talk about Joe. “I’ve learned that if I do [talk about it], people think it’s up for discussion, and our relationship isn’t up for discussion,” she says. “If you and I were having a glass of wine right now, we’d be talking about it—but it’s just that it goes out into the world. That’s where the boundary is, and that’s where my life has become manageable. I really want to keep it feeling manageable.”\n\nAugust 22, 2019\n\nTaylor Swift’s album Lover leaks and fans swarm Twitter with theories that she and Joe are secretly engaged/married. Mostly thanks to lyrics in the title track that go, “I take this magnetic force of a man to be my lover / My heart’s been borrowed and yours has been blue.”\n\nIf you’re currently like, “WTF does this even mean?” apparently, the words “borrowed” and “blue” made everyone spiral because of the whole “something borrowed, something blue” wedding tradition. A reach, I know, but tell that to the internet:\n\nAugust 14, 2019\n\nTaylor drops the lyric video for “Lover” and fans manage to convince themselves the entire song is about Joe. Even the part about leaving “Christmas lights up till January.” It’s a lot!\n\nTo be fair, the lyric “I’ve loved you three summers now, honey” IS pretty telling. Remember how Joe and Taylor met in 2016? Yeah.\n\n\n\nMay 24, 2019\n\nTaylor and Joe are spotted holding hands in Paris in a unicorn-levels-of-rare PDA moment:\n\nBACKGRID\n\nMarch 21, 2019\n\nA source tells People that Joe has “zero interest in being a celebrity” and that his and Taylor’s “personalities are very compatible, and they’re respectful of each other’s careers.”\n\nThat explains a lot, to be honest.\n\nFebruary 24, 2019\n\nRemember the Academy Awards? When Bradley Cooper and Lady Gaga eye-f*cked their way through “Shallow,” causing the entire internet to melt down? Yeah, well, Joe hit the red carpet without Taylor—buuut they were spotted PDA’ing big time at the Vanity Fair Oscars after-party.\n\nFebruary 10, 2019\n\nTaylor and Joe hit up a BAFTAs party in London, where they’re photographed all up on each other.\n\nAnd, like, fine, the pics above technically don’t show either of their faces. But this is totally Taylor and if you need proof, JUST LOOK AT HER DRESS:\n\nNovember 22, 2018\n\nTaylor goes vaguely Instagram official with Joe…by which I mean she shouts out his movie The Favourite. Obviously, this IG was posted before Taylor changed up her grid aesthetic or it would have been filtered pink and inexplicably covered in sparkles.\n\nOctober 18, 2018\n\nJoe awkwardly/finally talks about Taylor in an interview when a reporter asks what he thinks of her political efforts. His response, while literally backing away? “I think it’s great, I think it’s important.” Wow, he’s a man of so many words!\n\nSeptember 28, 2018\n\nTaylor sneaks into the premiere of Joe’s new movie The Favourite—although she skips the red carpet and uses the back door to exit. For those of you who are all “pics or it didn’t happen,” here ya go:\n\nGetty Images\n\nSeptember 20, 2018\n\nJoe is interviewed by British Vogue and fully SHUTS THEM DOWN when asked about dating Taylor, saying, “I’m aware people want to know about that side of things. I think we have been successfully very private and that has now sunk in for people…but I really prefer to talk about work.”\n\nWork, like wearing this very important billowing blouse!\n\nTumblr\n\nJuly 4, 2018\n\nTaylor and Joe spend Fourth of July in Turks and Caicos and are fully spotted frolicking in the water like two adorable horny mermaids. Pics here:\n\nRelated Story Taylor Swift Abandons Taymerica for Joe Alwyn\n\nMay 7 and 8, 2018\n\nTaylor and Joe post Instagrams of the exact same random cactus. Truly, they couldn’t be less good at hiding their relationship:\n\nMarch 30, 2018\n\nTaylor makes a public declaration of love in her “Delicate” Spotify video, wearing a necklace with Joe’s initial.\n\nShe also refers to him in the official video when his name appears on a deli sign behind her while she’s dancing in the streets:\n\nDecember 10, 2017\n\nTaylor and Joe are spotted swaying and kissing at the Jingle Ball and it’s all too much!\n\nAlso, Joe is seen filming her performance like a true Instagram husband, bless him:\n\nOctober 26, 2017\n\nTaylor drops the video for “…Ready for It,” and it’s full of Joe references. First up, his birth year is written on a wall next to her birth year:\n\nYouTube\n\nMeanwhile, these characters spell out “Joseph”:\n\nYouTube\n\nAnd in this scene, she punches in “2-1” into a phone. Kinda whatever, ’cept Joe’s birthday is February 21….\n\nYouTube\n\nJune 5, 2017\n\nTaylor and Joe are in Nashville spotted for what appears to be the first time, having a coffee date on a balcony and looking “simply smitten.” Head this way for the pics.\n\nCirca May 2017\n\nJoe and Taylor’s relationship *finally* breaks in British tabloid The Sun, which reports that Taylor has been staying in London in disguise (wow, incredible) and that she and Joe “are the real deal, this is a very serious relationship. But after what happened with Tom Hiddleston, they were determined to keep it quiet.”\n\nFair, considering what happened with Tom Hiddleston was THIS:\n\nInstagram\n\nThe First Monday in May 2016\n\nTaylor and Joe meet at the Met Gala! But no one has any idea because their relationship isn’t confirmed for an entire freakin’ year. However, Taylor’s song “Dress” seems to imply they had a moment based on these lyrics: “Flashback to when you met me / Your buzz cut / And my hair bleached.” Apparently, Joe had a buzz cut at the event, and Taylor’s hair looked like this:\n\nGetty Images\n\nTo be fair, most great love stories begin at the Met Gala—just ask the ghost of Shakespeare, he knows.", "images": ["http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-performs-onstage-during-taylor-swift-the-news-photo-1681469030.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2025-11-13-at-8-26-25-am-6915dccd7e9c7.png?crop=0.563xw:1.00xh;0.219xw,0&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/cosmopolitan/static/images/logos/logo.eca17dd.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-529029826-1556207086.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/beastinme-102-240924-cs-00259-r-6917adfc5ec1f.jpg?crop=0.668xw:1.00xh;0.154xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/bgus-1601753-001-1572357910.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-joe-alwyn-1546866744.jpg?crop=0.888888888888889xw:1xh;0,0", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://hips.hearstapps.com/hmg-prod/images/bgus-1280087-001-1530891906.jpg?crop=0.668xw:1.00xh;0.167xw,0&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-ready-for-it-hidden-message-5-1509112453.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/selling-the-oc-cast-leave-6915b3b002820.jpg?crop=0.505xw:1.00xh;0.274xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-joe-alwyn-1546866744.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523000000&id=social-button-icon", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://hips.hearstapps.com/hmg-prod/images/katy-perry-and-taylor-swift-at-the-52nd-annual-grammy-news-photo-1708716384.jpg?crop=1.00xw:0.657xh;0,0&resize=300:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/image-from-ios-646cd5bcba057.jpg?crop=1.00xw:0.818xh;0,0.0527xh&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/prince-andrew-duke-of-york-and-king-charles-iii-attend-news-photo-1763066178.pjpeg?crop=0.758xw:1.00xh;0.122xw,0&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/joe-instagram-taylor-cat-1595528805.jpeg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/bgus-2408260-002-1655926369.jpg?crop=0.503xw:0.754xh;0.218xw,0.215xh&resize=300:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/m-the-puppet-master-jeff-probst-addresses-the-remaining-news-photo-1585256153.jpg?crop=0.676xw:1.00xh;0.0401xw,0&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523ffffff&id=social-button-icon", "http://www.cosmopolitan.com/_assets/design-tokens/cosmopolitan/static/images/logos/logo.eca17dd.svg?primary=%2523000000", "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-and-joe-alwyn-seen-out-and-about-in-manhattan-news-photo-1042762182-1538232841.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/wicked-brand-collabs-2025-69028628d3416.png?crop=0.502xw:1.00xh;0.498xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2022-05-06-at-1-03-26-pm-1651856614.png?resize=980:*", "http://www.cosmopolitan.com/_assets/design-tokens/cosmopolitan/static/images/logos/network-logo.722abed.svg?primary=%2523ffffff", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523000000&id=social-button-icon", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/tay-35322f16-f923-4413-889e-41225cf96c5d-1556207214.jpg?crop=1xw:1xh;center,top&resize=980:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/bookmark-simple-regular.9d9d56b.svg", "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-at-the-63rd-annual-grammy-awards-broadcast-news-photo-1651854201.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/tayjoe-1572357185.jpg?resize=980:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523000000&id=social-button-icon", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/x-regular.e414d97.svg", "https://hips.hearstapps.com/hmg-prod/images/sarah-ferguson-duchess-of-york-attends-the-traditional-news-photo-1763131536.pjpeg?crop=0.883xw:1.00xh;0.0595xw,0&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/globe-simple-regular.e7f303c.svg", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=currentColor&id=link-out-embed", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-ready-for-it-hidden-message-2-1509112391.jpg?crop=1xw:1xh;center,top&resize=980:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1611786953-51Twk4ae7AL.jpg?crop=1xw:1xh;center,top&resize=980:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/568669905-1390146615809557-6973902315575227966-n-68fa6145198d0.jpg?crop=1xw:0.6417100694444444xh;center,top&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-ready-for-it-hidden-message-7-1509112524.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/tumblr-pn7orkfxmk1qd5s0eo1-r2-500-1556206421.gif?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/171339-0701-v1-691b41c82c55d.jpg?crop=0.803xw:1.00xh;0.0913xw,0&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/disney-night-its-the-most-enchanting-night-of-the-season-as-news-photo-1759888936.pjpeg?crop=0.732xw:0.916xh;0.146xw,0.0581xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-tiktok-1595341164.jpg?crop=0.500xw:1.00xh;0.500xw,0&resize=300:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/saved.ad81f1a.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/season-3-momtok-is-back-but-damaging-revelations-and-news-photo-1763047973.pjpeg?crop=0.668xw:1.00xh;0.167xw,0&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523000000&id=social-button-icon", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/clock-regular.b2f2888.svg", "https://hips.hearstapps.com/hmg-prod/images/untitled-design-2024-09-18t103848-899-66eae66b47c2d.png?crop=0.330xw:0.660xh;0.335xw,0.0929xh&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/caret-left-regular.5546078.svg", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/envelope-simple-regular.91a0134.svg"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-joe-alwyn-1546866744.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.cosmopolitan.com/entertainment/a27270853/taylor-swift-joe-alwyn-relationship-timeline/", "title": "An Official Timeline of Taylor Swift and Joe Alwyn’s Super-Private Relationship Pre-Breakup", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Taylor Swift and Joe Alwyn Relationship Timeline", "description": "Taylor Swift and Joe Alwyn have been quietly (but seriously) dating for a while now. Here's everything you need to know about Taylor and Joe's relationship.", "theme-color": "#000000", "og": {"site_name": "Cosmopolitan", "title": "An Official Timeline of Taylor Swift and Joe Alwyn’s Super-Private Relationship Pre-Breakup", "description": "Joe is “slighted and is distraught” over Taylor and Matty Healy.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-joe-alwyn-1546866744.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.cosmopolitan.com/entertainment/a27270853/taylor-swift-joe-alwyn-relationship-timeline/", "type": "article"}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "opinion": "false", "section": "Pop Culture", "modified_time": "2023-05-23T15:14:00Z", "published_time": "2023-05-23T15:14:00Z"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "parsely-metadata": "{\"socialHeadline\":\"An Official Timeline of Taylor Swift and Joe Alwyn’s Super-Private Relationship Pre-Breakup\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-joe-alwyn-1546866744.jpg?crop=0.502xw:1.00xh;0,0&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-joe-alwyn-1546866744.jpg?crop=1.00xw:1.00xh;0,0&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-joe-alwyn-1546866744.jpg?crop=0.502xw:1.00xh;0,0", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-joe-alwyn-1546866744.jpg?crop=1.00xw:1.00xh;0,0&resize=640:*", "card": "summary_large_image"}, "auto-publish": "never", "sailthru.excerpt": "Psst: This timeline is in reverse chronological order. To go back, back to the beginning, scroll alllll the way down.Taylor Swift must have learned a lot from the super-public mess that was her relationship with Tom “Questionable Taste in Tank Tops” Hiddleston, because her ’ship with British actor Joe Alwyn", "sailthru.tags": "entertainment,Pop Culture,celebrity-relationship-timelines,Celebrity Relationship Timelines,Cosmopolitan-US", "sailthru.date": "2023-05-23 15:14:00", "sailthru.socialtitle": "An Official Timeline of Taylor Swift and Joe Alwyn’s Super-Private Relationship Pre-Breakup", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1684854840.0, "source": "http://www.cosmopolitan.com", "summary": ""}