{"url": "https://en.wikipedia.org/wiki/The_Way_(Ariana_Grande_song)", "text": "2013 single by Ariana Grande\n\n\"The Way\" is a song by American singer-songwriter Ariana Grande featuring American rapper Mac Miller. It was released on March 26, 2013 by Republic Records as the lead single from Grande's debut studio album, Yours Truly (2013). The song was written by Amber Streeter, Al Sherrod Lambert, Jordin Sparks, Brenda Russell, Miller, and the producer Harmony Samuels. The song samples Big Pun's 1998 song \"Still Not a Player\", which itself samples Russell's 1979 song \"A Little Bit of Love\".\n\n\"The Way\" received positive reviews from music critics for its 2000's R&B sound and Grande's vocals, which drew comparisons to those of Mariah Carey. The song became Grande's breakthrough hit and peaked at number nine on the US Billboard Hot 100, earning both Grande and Miller their first top-ten song on the chart. \"The Way\" has since sold 2.4 million copies in the United States as of 2020 and was certified sextuple platinum by the Recording Industry Association of America (RIAA) for surpassing six million units. An accompanying music video was directed by Jones Crow and released on March 28, 2013. It depicts Grande and Miller dancing inside a room covered in balloons, as Miller takes several photographs of Grande. A Spanglish version was also released featuring Miller and Colombian rapper J Balvin.\n\nBackground and development [ edit ]\n\nRapper Mac Miller was featured on \"The Way\".\n\nOn December 12, 2011, Grande released her debut single \"Put Your Hearts Up\", which is a bubblegum pop song with a vastly different style of music and target demographic than \"The Way.\"[5] Whereas the lyrics in \"The Way\" deal with the subject of a flirty, romantic relationship, some sections with sexual implications, \"Put Your Hearts Up\" was a song aimed at young audiences, with lyrics about making the world a better place. During a radio interview on KIIS-FM on March 25, 2013 about her debut single, Grande confessed that she had in fact \"hated\" both the music video for and the song itself, considering it to be \"a terrible first impression\". She added that she had wanted to \"pretend it never happened before it already happened\" and that she had felt no enthusiasm to promote the song at the time.[6] In a 2013 interview with Billboard, Grande implied that her music needed to relate to her maturing personality. Although she insisted on being \"there for [her] younger fans\" while portraying Cat Valentine on the American teen sitcom Sam & Cat (2013), Grande also wanted to perform music as a result of \"growing up\".[7]\n\n\"The Way\" was initially co-written by Jordin Sparks (pictured) for her third album, but gave it to Grande.\n\nIn January 2013, she met with producer Harmony Samuels, at which point he presented her with a demo of the song that featured the vocals of co-writer Jordin Sparks, whom the song was originally intended.[8] The beat he had created for the single, samples Brenda Russell's \"A Little Bit of Love\" either directly or indirectly, via Big Pun's \"Still Not a Player\".[9][10] Grande immediately connected with the sound and asked Mac Miller to feature on the song with her, to which he responded, \"Sounds like a hit to me.\"[7] The song was recorded that same month, and caught the attention of Republic Records VP Charlie Walk when he heard it being played from Republic co-founder Monte Lipman's office. \"It was 8:00 one night, and I heard a song coming from Monte's office through my wall. He called me down and I played a video, a DIY of Ariana Grande. We heard the song and I immediately made the decision to set it up [and] put the song out.\"[11]\n\nPromotion and release [ edit ]\n\nGrande created online buzz in the weeks leading up to her single's release through social media. She first tweeted about \"The Way\" on March 5, 2013, stating that the song would be released later that month.[12] On March 13, 2013, she announced the release date.[13] She posted a teaser trailer for both the song and the music video on her YouTube account on March 16, 2013,[14] then shared a second teaser on March 21, 2013.[15]\n\nIn the later half of March, Grande went on a radio tour across the United States, focusing on some of the most popular Top 40 stations in the country. She visited both Y-100 Miami and 93.3 FM on March 18, 2013, for interviews. The next day she went on Elvis Duran and the Morning Show[16][17] and attended a release party thrown by Z100, where she spoke to fans about her music.[18] On March 25, 2013, she visited KIIS-FM for an interview with JoJo Wright.[19] She visited 99-7 Now on March 29, 2013.[20] \"The Way\" debuted on On Air with Ryan Seacrest on March 25, 2013.[21]\n\nAn official R&B remix for \"The Way\" was released on July 11, 2013, which features American rapper Fabolous adding two verses.[22]\n\nCritical reception [ edit ]\n\nCritics have compared Grande's vocals to that of Mariah Carey (pictured).\n\nDigital Spy gave the song a five out of five star rating comparing the song's sound and Ariana's vocals to Mariah Carey's, continuing to say Ariana has a \"powerful vocal\" whilst the song has \"bouncy piano riff\" and \"throwback R&B beats\".[23] Sam Lansky of Idolator gave the song a positive review, calling the vocals \"sweet, soulful, and grown-up\".[24] MTV Buzzworthy's Jenna Hally Rubenstein praised the song, advising readers to \"keep one eye on Ariana\" as \"she may very well be the hottest pop newcomer in the game\". Rubenstein also commented that the song's \"early '00s-influenced R&B vibes\" made it sound like an updated version of Jennifer Lopez's \"I'm Real\" featuring Ja Rule.[25] Nick Catucci of Rolling Stone magazine gave the song 3 and half stars out of five, criticizing Grande's vocals for being \"more flirty than freaky\", but positively compared her vocals to Carey for being \"ecstatic\".[26]\n\nAs for Jessica Sager, from PopCrush, the track sounds implausible. According to her, the song deviates from the standards that were expected for the artist, who despite having Victoria Justice and Miranda Cosgrove as closer musical examples, is inspired by \"Mariah Carey of the early 2000s\". Sager further states that \"While Grande has the vocal cords necessary to record any kind of music she desires, her Nickelodeon background will likely make her talent ring false, and it's unclear whether she'll be able to sell herself as a R&B star\". Still according to her, \"the track itself is neither good nor bad - its problem is that it is not memorable\", since it \"gets lost in the middle of the melody\" and Miller's rhymes, which is not enough for that it is heard \"many times\".[27]\n\nAccolades [ edit ]\n\nYear Organization Award Result Ref. 2013 Teen Choice Awards Choice Love Song Nominated [ 28 ]\n\nCommercial performance [ edit ]\n\nFollowing its release, \"The Way\" sold over 120,000 digital downloads within the first 48 hours and 219,000 in its first week.[7][29] It debuted at number 10 on the Billboard Hot 100 chart for the week ending April 5, 2013, becoming Grande and Miller's first top-ten hit. This made Grande the first top-ten arrival for a lead female artist making her first Hot 100 appearance since Yael Naim, who launched with \"New Soul\" back in 2008.[29] The song dropped to number 22 during its second week on the chart, and then to number 37. As radio stations gave it more attention, the song gradually rebounded, eventually peaking at number 9 for two weeks.[30] \"The Way\" spent 26 weeks in the Billboard Hot 100 chart.[citation needed] The Spanglish version of \"The Way\" reached number 5 on Billboard's Latin Pop Songs chart on the week ending August 24, 2013.[4] On July 30, 2014, \"The Way\" was certified triple platinum by the Recording Industry Association of America for sales and streaming data in excess of three million units in the United States.[31] As of June 2020, the song has sold over 2.4 million copies in the United States.[32]\n\nCopyright infringement lawsuit [ edit ]\n\nOn December 11, 2013, Minder Music filed a copyright infringement lawsuit against Grande, Sony/ATV, UMG Recording and other parties. It claimed that the line \"What we gotta do right here is go back, back into time\", which is spoken in the introduction to \"The Way\", infringes its copyright in the 1972 single \"Troglodyte\" by The Jimmy Castor Bunch, which contains the spoken lyric, \"What we're gonna do right here is go back, way back, back into time\".[33]\n\nThe suit argued that the songs' similarities include \"nearly identical lyrics; similar enunciation speed with a fast and consistent pace for \"What we gotta do right\" and a slightly slower pace for \"here is go back,\" and substantially similar placement\" at the beginning of both songs.[33] Minder Music sought a permanent injunction, statutory damages of $150,000 per infringement, and legal fees.[33][34] The case was settled outside of court in 2015.[35]\n\nMusic video [ edit ]\n\nThe music video for \"The Way\" was filmed on February 10 and 11, 2013. On March 16, 2013, the first teaser for the song was released via her YouTube page.[36][37][38] The second teaser was released on Ryan Seacrest's website two days later, and later on Grande's page.[39] The video was released on March 28, 2013. Directed by Jones Crow, the video consists of Grande, Miller, and a group of dancers. Grande poses for pictures taken by Miller on various cameras, while dancing around a room filled with balloons and their images are projected on the wall. At the end of the video, Miller and Grande kiss, which Grande described as \"quite a statement\" of growing up.[7] The video was Vevo-certified on October 2, 2013, having reached 100 million views.[40] As of August 2020, the music video has over 400 million views on YouTube.[41]\n\nLive performances [ edit ]\n\nGrande debuted the live performance of \"The Way\" with \"multi-octave pipes\" on the May 29, 2013, episode of The Ellen DeGeneres Show. Miller was invited on stage before he snuggled on Grande and kissed her hand, as Rap-Up staff opined that the performance was \"fun and flirty\".[42] Grande and Miller also performed the song together on the June 15, 2013, episode of Late Night with Jimmy Fallon,[43][44] and on the morning show Today in Rockefeller Plaza on September 3, 2013,[45] as Miller name-dropped American rapper Lil B during his opening verse in the latter performance.[46] During the pre-show of the 2013 MTV Video Music Awards, Grande performed \"The Way\" in a medley alongside \"Baby I\" (2013). She wore a purple silk dress with \"prom-style\" jewels and high heels, while accompanied by two backup dancers sporting black.[47] Writing about the performance, Caitlin White of MTV News noted that Grande appeared \"a little nervous\" when singing the former song.[48] On October 16, 2013, she performed \"The Way\" on Jimmy Kimmel Live! while sporting a shimmery, strapless, sequined dress.[49]\n\nGrande included \"The Way\" on the setlist of several concerts. During her debut concert titled The Listening Sessions, the song was included as the concert's encore performance, as she incorporated an a cappella in the introduction and utilized several vocal harmony lines in place of the backing vocalists.[50] Grande performed \"The Way\" as a duet with Miller at One Love Manchester on June 4, 2017,[51] before providing vocals for a performance of Miller's 2016 song \"Dang!\".[52] From August 6 to 8, 2021, she performed \"The Way\" as a part of her 14-minute virtual concert setlist during the Rift Tour in the video game Fortnite Battle Royale.[53][54][55] During the song's performance, Grande's avatar climbs a white staircase to approach a bright light,[56] which Ilana Kaplan of NME described the singer's \"enlarged\" appearance as \"a judge flexing her gavel outside of a courthouse\".[3]\n\nTrack listings [ edit ]\n\n\"The Way\" (featuring Mac Miller) – 3:46 \"The Way\" (Spanglish Version featuring Mac Miller) – 3:46\n\n\"The Way\" (featuring Mac Miller) – 3:48 \"The Way\" (Solo Version) – 3:10\n\nCredits [ edit ]\n\nCredits adapted from the CD single liner notes.[58]\n\nComposed by – Harmony Samuels\n\nEngineer – Carlos King, Jose Cardoza\n\nEngineer [Vocals] – Chris \"Tek\" O'Ryan\n\nFeaturing – Mac Miller\n\nMixed by – Jaycen Joshua\n\nMixed by [Assistant] – Trehy Harris\n\nProducer – Harmony Samuels\n\nProducer [Vocals] – Ariana Grande, Sauce\n\nWritten by – Al Sherrod Lambert, Amber Streeter, Brenda Russell, Harmony Samuels, Jordin Sparks, Malcolm McCormick\n\nCharts [ edit ]\n\nCertifications [ edit ]\n\nRelease history [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Mariah_Carey_Neighborhood_Ball_in_downtown_Washington_2009_cropped.JPG/250px-Mariah_Carey_Neighborhood_Ball_in_downtown_Washington_2009_cropped.JPG", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Jordin_Sparks_at_the_2012_USO_Gala_in_Washington_D.C.%2C_2012.jpg/250px-Jordin_Sparks_at_the_2012_USO_Gala_in_Washington_D.C.%2C_2012.jpg", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/e/ed/Ariana_Grande_-_The_Way.png/250px-Ariana_Grande_-_The_Way.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/20px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Mac_Miller_Governors_Ball.jpg/250px-Mac_Miller_Governors_Ball.jpg", "https://upload.wikimedia.org/wikipedia/en/e/ed/Ariana_Grande_-_The_Way.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/e/ed/Ariana_Grande_-_The_Way.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Way_(Ariana_Grande_song)", "title": "The Way (Ariana Grande song)", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/e/ed/Ariana_Grande_-_The_Way.png", "width": 1200, "height": 1200}, "title": "The Way (Ariana Grande song) - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}