{"url": "https://en.wikipedia.org/wiki/Mohamed_Hadid", "text": "Palestinian-American real estate developer (born 1948)\n\nMohamed Anwar Hadid ( hə-DEED; Arabic: محمد أنور حديد; born (1948-11-06)November 6, 1948)[1] is a Palestinian-American real estate developer. He is known for building luxury hotels and mansions, mainly in the Bel Air neighborhood of Los Angeles and the city of Beverly Hills, California. He is the father of models Gigi and Bella Hadid. Born in Nazareth, Hadid immigrated to the United States as a teenager.\n\nEarly life\n\nHadid was born into a Palestinian Muslim family[2][3][4] in 1948[5] in Nazareth.[6] He is the son of Anwar Mohamed Hadid (1918[7]–1989[8]) and his wife Khairiah Daher (1925–2008),[9] and has two brothers and five sisters.[8] Through his mother, Hadid claims descent from Dahir al-Umar, an 18th-century Arab ruler of northern Palestine.[10][11]\n\nDue to the 1948 Palestine war, Hadid and his family fled to Lebanon as part of the 1948 Palestinian expulsion and flight, ultimately settling in Syria. In 1989, Hadid stated his father left because he \"did not want the family to live under the Israeli occupation.\"[12] In 2015, Hadid stated in a post on Instagram: \"...[W]e became refugees to Syria and we lost our home in Safad to a Jewish family that we sheltered when they were refugees from Poland on the ship that was sailing from country to country and no one would take them... they were our guest for 2 years till they made us refugees and they kicked us out of our own home.\"[13]\n\nHis father studied at a teachers' college in Jerusalem and attended a university[which?] in Syria to study law, before working in land settlement for the British Mandatory authorities and teaching English at a teachers' college in Palestine. In 1948, the family moved to Syria, and Hadid's father joined the United States Information Agency (USIA) and Voice of America (VOA). Hadid and his family lived in Damascus, Tunisia and Greece before moving to Washington, D.C. when he was 14 years old, as his father had a job at the VOA headquarters there and spent the rest of his career there with VOA and USIA as a writer, editor and translator.[8][10][14] While in Damascus, the whole family obtained Jordanian citizenship when Hadid's father defeated the Jordanian ambassador in backgammon; by then, they had been stateless for seven years.[15]\n\nHadid graduated from Washington-Lee High School in Arlington, Virginia, where he was the only Arab student, before attending North Carolina State University and the Massachusetts Institute of Technology.[14][16][6]\n\nCareer\n\nAmong his early ventures was a company that exported equipment to the Middle East.[5][17] He started his career restoring and reselling classic cars in the Georgetown neighbourhood of Washington, D.C., before moving to Greece, where he opened a nightclub on an island, and with the profits, started developing real estate in the United States.[18]\n\nIn the 1980s, much of his financial clout came from the SAAR Foundation, a Herndon-based foundation with Saudi roots. The foundation was a 50–50 partner in many of Hadid's ventures.[17] In the late 1980s, he faced at least 30 lawsuits from creditors and banks claiming he had not fulfilled various financial obligations.[19] He paid $150 million for the Ritz-Carlton hotels in Washington and New York. He also converted a Houston hotel into a Ritz-Carlton Hotel and developed a Ritz-Carlton resort in Scottsdale, Arizona. He outmaneuvered Donald Trump, paying $42.9 million for several choice parcels in Aspen and announcing plans for a 292-room Ritz resort.[17][19]\n\nIn 1992, a settlement was reached in a lawsuit by Riggs Bank against Columbia First Bank Chairman Melvin Lenkin, a Hadid partner in a Washington, D.C., construction project that involved a loan on which Hadid defaulted. Following the settlement Hadid closed his local office, lost his McLean home to foreclosure, and left the Washington area.[20]\n\nHe developed Le Belvedere, a mansion in Bel Air, Los Angeles,[21] that sold for $50 million in 2010. In 2012, he developed The Crescent Palace, a 48,000-square-foot home on an acre plot next door to the Beverly Hills Hotel, which he listed for sale at $58 million.[22]\n\nEstate on Strada Vecchia Road\n\nShortly after Hadid received approval for the construction of a mansion in Bel Air, the Bel Air Homeowners Alliance, chaired by Fred Rosen, was formed to oppose it.[21] In January 2015, Nancy Walton Laurie, an heiress to the Walmart fortune and a Bel Air resident, filed a lawsuit through her company, LW Partnership, against Hadid.[23] Laurie accused Hadid of damaging the roots of a eucalyptus tree on her property with a retaining wall he built next to her house.[23]\n\nIn December 2015, the Los Angeles city council voted to pursue criminal charges over a claim that Hadid violated local zoning laws. The council alleged he built his house contrary to multiple planning orders and made it twice the permitted size.[24][25] In May 2017, Hadid pleaded no contest to misdemeanor charges stemming from mansion-construction issues for which he did not receive city approval, and was sentenced that July to community service and fines.[26][27]\n\nIn July 2017, he was sentenced to 200 hours of community service, summoned to return $14,191 to the City of Los Angeles in damages, and fined $3,000.[28] He was also given a three-year probation period to ensure the property would comply with existing regulations, or he would face a 180-day jail sentence.[28]\n\nA 2018 civil lawsuit filed by multiple neighbors resulted in Hadid being made to pay a reward of $3 million. In 2019, Los Angeles County Superior Court Judge Craig D. Karlan ordered the demolition of the 30,000 sq ft (2,800 m2) structure, declaring that it put neighbors at, \"legitimate risk of suffering damage and harm to their home.\" The property was offloaded by Hadid in an auction, with the winning bidder paying $5 million.[29]\n\nAthletic career\n\nHadid competed in the demonstration sport of speed skiing at the 1992 Winter Olympics, representing Jordan. He was 43 years old at the time. Hadid was encouraged to participate by his friend, Austrian Olympic skier Franz Weber. Hadid was the only member of the Jordanian delegation,[6] and remains the only person to have represented Jordan in the Winter Olympics.[30][31]\n\nTelevision appearances\n\nHadid has appeared on the TV show The Real Housewives of Beverly Hills, as the ex-husband of Yolanda Hadid.[22] He has also appeared on Shahs of Sunset,[21] and Second Wives Club on E! with his fiancée Shiva Safai in 2017.[32]\n\nPersonal life\n\nHadid identifies as an American-Palestinian.[33]\n\nHadid's first marriage was with Mary Butler, with whom he had two daughters, Alana Hadid and Marielle Hadid. He and Butler ended their marriage in 1992.[34][35]\n\nFrom 1994 until their divorce in 2000, he was married to the Dutch model Yolanda Hadid, née Van den Herik.[36] They had three children, who all became models: Gigi (born 1995), Bella (born 1996),[35] and Anwar (born 1999).[37] After his marriage ended, he had a brief relationship with a woman that ended with the birth of his youngest daughter, Aydan Nix.[38]\n\nIn 2014, Hadid was engaged to Shiva Safai, a model and businesswoman. She was born in Iran and raised in Norway, and at age 19, moved to Los Angeles with her family.[39] Safai, who is 33 years his junior, began to appear in E! reality show, Second Wives Club in 2017.[40][41] As of December 2019, Hadid and Safai had split.[42]\n\nHadid is a dual Jordanian-American citizen.[6] He does not consider himself a devout Muslim but does not drink or smoke and fasts during Ramadan.[11] He has never drunk alcohol, although he does have a 5,000-bottle wine cellar, including some from his own Beverly Hills winery.[18]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8c/Extended-protection-shackle.svg/20px-Extended-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Mohamed_Hadid", "title": "Mohamed Hadid", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "viewport": "width=1120", "og": {"title": "Mohamed Hadid - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}