{"url": "https://www.washingtonpost.com/lifestyle/style/the-arrangement-is-quite-clear-its-a-drama-based-on-tom-cruise-and-katie-holmes/2017/03/02/8783746a-ff5b-11e6-99b4-9e613afeb09f_story.html", "text": "In the first episode of \"The Arrangement,\" aspiring actress Megan Morrison (Christine Evangelista) is asked to settle a bet between two young businessmen dining at the restaurant where she waits tables. One is convinced that he's seen her in something, but his douchey buddy won't pay up until she delivers a line from one of her past roles.\n\n“That is a risk I’m willing to take, Lieutenant, because last I checked all citizens are entitled to legal counsel,” Megan says. “Even vampires.”\n\nEvangelista plays Megan as effortlessly cool — confident, with just a hint of vulnerability — and she's the main reason that the new E! scripted series is a delight to watch. The 10-episode drama, which premieres Sunday, is a thinly veiled spin on one of the biggest mysteries of our time: the whirlwind relationship between Tom Cruise and Katie Holmes, which some speculate was arranged by the Church of Scientology.\n\nFollowing a bizarre audition process, Megan is plucked from the obscurity of her side hustle and thrust into the limelight as the new girlfriend of superstar Kyle West (Josh Henderson), whose acting career is micromanaged by the Institute for the Higher Mind, a self-help organization clearly meant to evoke Scientology.\n\nKyle credits the institute, led by Terence Anderson (an oh-so-serious Michael Vartan), for his rise to fame, which followed family tragedy and months of sleeping in his car. When he meets Megan, he’s fresh off a broken engagement to an A-list actress, whose path he will cross while promoting his latest film at the Venice Film Festival. The institute sets out to find Kyle a new leading lady, ostensibly for his next blockbuster, “The Kill Plan.” Terence’s wife, Deann (Lexa Doig), a producer on the film, has her eyes on Megan.\n\nAt her audition, Megan is asked three questions designed to reveal her “true character.” Assuming she flopped, Megan prepares for a weekend getaway with her boyfriend. But their plans are scrapped when a woman shows up to his house in tears, announcing that she’s pregnant with his child. Reeling from her own unexpected breakup, Megan gets drunk with her two besties, and is surprised — and hung over — when her agent calls to tell her she will soon be reading opposite Kyle.\n\nMegan pulls it together and offers a raw, emotional (perhaps nausea-induced) performance. Impressed, Kyle runs after her and their whirlwind courtship begins with a paparazzi-dodging motorcycle ride, lunch at his favorite taco spot and a trip to a romantic Mexican bungalow.\n\nBy the end of the first episode, Megan has landed a contract proposal — but it’s not for “The Kill Plan.” The contract lays out the terms of what would eventually become a marriage — with a cool $10 million wrapped into the deal. “There’s no big secret,” Kyle insists. The contract is about his reputation and, he says with a wince, his brand. Despite warnings from her lawyer friend, Megan agrees to consider the offer — first accompanying Kyle to the film festival — because it beats waiting tables, and because she actually likes him.\n\nDespite the puppet strings attached to their union, Kyle and Megan have genuine chemistry. In fact, they can't keep their hands off each other, which presents a rather salacious theory for Cruise's crazy, couch-jumping appearance on \"The Oprah Winfrey Show\" in 2005. \"The Arrangement\" may be on basic cable, but there's a reason it doesn't come on until 10 p.m.\n\nDespite their connection, Megan and Kyle’s relationship is complicated by interference from the institute — full of sinister motives that remain intriguingly obscure three episodes in — and the fact that Terence isn’t sold on the pairing. But it’s fun to watch their relationship unfold. In Italy, Megan is amused to learn that a tabloid has dubbed them “Kygan.” When Deann says the moniker will undoubtedly lead to babies named Kygan, Megan replies, bewildered, “That’s so saaaad.”\n\nThere’s tension in the fact that, despite her aspirations, Megan doesn’t appear to take her craft — or fame — as seriously as Kyle does. But it also seems that Megan, like pretty much everyone else in her orbit, is hiding something.\n\n\"The Arrangement\" isn't top-tier television, but it's sharper than one might expect from the celebrity-obsessed network that brought us \"Keeping Up With the Kardashians\" and that weird Glambot thingamajig that forces the stars to strut their stuff in slow motion on awards show red carpets. (I've never watched the network's other scripted series, \"The Royals,\" but it gets fairly solid ratings).\n\nThat said, you will never, ever forget that “The Arrangement” is an E! show. The opening scene is a faux E! news report about Kyle, featuring real-life reporters Zuri Hall and Jason Kennedy, who resurface in subsequent episodes.\n\nAnd the network has gone all out in building a backstory for the drama. A few days ago, in the name of research, I cued up a YouTube video of Cruise's infamous \"Oprah\" appearance. The pre-roll ad was for an \"E! True Hollywood Story\" installment about (the fictional) Kyle West. Algorithms, smalgorithms — I prefer to think of it as me and the universe sharing an inside joke.\n\nBut honestly, “The Arrangement” doesn’t need all those cross-promotional bells and whistles. It’s pretty delicious on its own.", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VCPIALX7T4I6NGNUTZQTV7VQT4&w=1440", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/d8999eec-087b-4d7c-b3bf-75c1196210c4.png&h=196&w=196", "https://www.washingtonpost.com/dr/resources/images/generic-newsletter-signup.png"], "top_img": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VCPIALX7T4I6NGNUTZQTV7VQT4&w=1440", "keywords": [], "authors": ["Bethonie Butler", "Ian Duncan", "Emmanuel", "Dylan Moriarty", "Emily Yahr", "Perry Stein", "Jeremy Roebuck", "Theodoric Meyer", "Kelly Kasulis Cho", "Adam Taylor"], "canonical_link": "https://www.washingtonpost.com/lifestyle/style/the-arrangement-is-quite-clear-its-a-drama-based-on-tom-cruise-and-katie-holmes/2017/03/02/8783746a-ff5b-11e6-99b4-9e613afeb09f_story.html", "title": "‘The Arrangement’ is quite clear: It’s a drama based on Tom Cruise and Katie Holmes", "meta_data": {"description": "The E! scripted series, about a Hollywood contract marriage, is mysterious and surprisingly sexy.", "og": {"site_name": "The Washington Post", "type": "article", "url": "https://www.washingtonpost.com/lifestyle/style/the-arrangement-is-quite-clear-its-a-drama-based-on-tom-cruise-and-katie-holmes/2017/03/02/8783746a-ff5b-11e6-99b4-9e613afeb09f_story.html", "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VCPIALX7T4I6NGNUTZQTV7VQT4&w=1440", "title": "‘The Arrangement’ is quite clear: It’s a drama based on Tom Cruise and Katie Holmes", "description": "The E! scripted series, about a Hollywood contract marriage, is mysterious and surprisingly sexy."}, "og_site_name": "The Washington Post", "og_type": "article", "og_url": "https://www.washingtonpost.com/lifestyle/style/the-arrangement-is-quite-clear-its-a-drama-based-on-tom-cruise-and-katie-holmes/2017/03/02/8783746a-ff5b-11e6-99b4-9e613afeb09f_story.html", "og_image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VCPIALX7T4I6NGNUTZQTV7VQT4&w=1440", "og_title": "‘The Arrangement’ is quite clear: It’s a drama based on Tom Cruise and Katie Holmes", "og_description": "The E! scripted series, about a Hollywood contract marriage, is mysterious and surprisingly sexy.", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "‘The Arrangement’ is quite clear: It’s a drama based on Tom Cruise and Katie Holmes", "description": "The E! scripted series, about a Hollywood contract marriage, is mysterious and surprisingly sexy."}, "last_updated_date": "2023-05-24T07:13:28.047Z", "article": {"published_time": "2017-03-03T01:49:36.000Z", "modified_time": "2023-05-24T07:13:28.047Z", "section": "Old Style", "content_tier": "metered"}, "article_published_time": "2017-03-03T01:49:36.000Z", "article_modified_time": "2023-05-24T07:13:28.047Z", "article_section": "Old Style", "article_content_tier": "metered", "og_author": "Bethonie Butler", "robots": "noarchive, max-image-preview:large", "viewport": "width=device-width, initial-scale=1", "next-head-count": 88, "apple-itunes-app": "app-id=352509417, app-argument=https://www.washingtonpost.com/lifestyle/style/the-arrangement-is-quite-clear-its-a-drama-based-on-tom-cruise-and-katie-holmes/2017/03/02/8783746a-ff5b-11e6-99b4-9e613afeb09f_story.html?sourceApp=apple-banner"}, "movies": [], "publish_date": 1488430800.0, "source": "https://www.washingtonpost.com", "summary": ""}