{"url": "www.nydailynews.com/news/national/kim-kardashian-bound-begging-life-paris-robbery-article-1.2815551", "text": "While tout le monde was buzzing about the shocking, $10 million Paris robbery of Kim Kardashian, French authorities began putting together the pieces of her horrifying ordeal.\n\nAs Kardashian put distance between herself and the swanky hotel where she feared for her life Sunday night, details of the holdup, supplied by sources and her reps, began to emerge.\n\nThey painted a harrowing picture of a woman who feared she would be killed — or raped — by masked men.\n\n“This was a life and death matter,” a source told the Daily News. “That’s what’s important. The fact people keep focusing on what was stolen is irrelevant. She might have not been on this planet anymore.\n\n“She begged for them to let her live and (said) she has babies at home,” the source said. “Then they wrapped her mouth in tape and put her in the bathtub.”\n\nCiting sources, celebrity gossip site TMZ.com said Kardashian was in bed after a night on the town and wearing a robe when two men stormed the room.\n\n<img loading=\"\" class=\"lazyload size-article_feature\" data-sizes=\"auto\" alt=\"Kim Kardashian attends Paris Fashion Week on Sunday, before the robbery. ” title=”Kim Kardashian attends Paris Fashion Week on Sunday, before the robbery. ” data-src=”/wp-content/uploads/migration/2016/10/04/JYVPZTI3O3KFHDZA2T24LRIARI.jpg”> Kim Kardashian attends Paris Fashion Week on Sunday, before the robbery.\n\nShe initially feared they would rape her. She tried to call her bodyguard, but one of the bandits snatched the phone before she could complete the call, according to TMZ.\n\nKardashian later told cops the men spoke only French, except for one word — ring — a reference to a new, widely publicized bauble she had received from her doting husband, rap star Kanye West.\n\nShe told them where it was before they taped her mouth shut. They also bound her ankles with duct tape and zip-tied her hands with plastic handcuffs before putting her in the tub, a source told The News.\n\nBefore the robbery, five men threatened a concierge with a weapon and forced him to enter Kardashian’s private two-story residence at the hotel. The suspects made off with a jewelry box, a ring and a pair of cell phones.\n\nMeanwhile, a Kardashian friend who was sleeping in a downstairs bedroom heard the commotion and locked herself in a bathroom.\n\nThere, she called Kardashian’s bodyguard, who arrived two minutes after the thieves left.\n\nThe entire ordeal lasted six minutes.\n\nOne of the men, who were dressed as police officers, even pointed a handgun at Kardashian’s temple before tying her up, according to various accounts.\n\nA rep said the reality star was “badly shaken but physically unharmed.”\n\nThe thieves reportedly fled on bicycles, authorities said.\n\nKanye West and Kim Kardashian arrive at their Manhattan apartment after her return from Paris.\n\nKardashian’s children, North and Saint West, were not in the room at the time.\n\nThe five thieves remain at large. Still, many details about the robbery remained a mystery, even after the distraught reality star bolted the City of Light and met up with West, in New York.\n\nMissing from the chaotic scene was Kardashian’s usually ever-present bodyguard, Pascal Duvier, who was shadowing sisters Kourtney Kardashian and Kendall Jenner at the time, since Kim had turned in for the night, according to TMZ.\n\nDuvier was by Kim Kardashian’s side last week when a notorious prankster ran up and tried to kiss her famous derriere. Duvier tackled the man mid-pucker.\n\n“My security @PascalDuvier is a G,” Kim tweeted after the incident.\n\nKim Kardashian was held at gunpoint in a Paris hotel room.\n\nHours before the hotel robbery, Kardashian had posted a picture online of herself with Duvier in the background, joking that he was always in her shot.\n\nCops also questioned a photographer who had posed as a cop to get a picture of the star in a restaurant earlier in the week, according to The Sun newspaper.\n\nFrench police force Brigade de Repression du Banditisme, which specializes in armed robbery investigations, is leading the Kardashian heist probe. The elite investigators are known for their ongoing case against the gang known throughout Europe as the “Pink Panthers.”\n\nCBS’s 60 Minutes credited the notorious jewel thieves with over 370 capers worth $500 million.\n\nIt’s unclear if the mysterious gang — made up of mostly former soldiers from Yugoslavia — had any part in the Monday theft.\n\nThe “Pink Panthers” are known for speed, minimal violence and meticulous planning that utilizes disguises.\n\nThe so-called No Address Hotel is a historic private mansion that was converted into luxury apartments with hotel-like accommodations. Among its guests have been Prince, Madonna and Leonardo DiCaprio.\n\nKardashian, in town for Fashion Week, bid Paris a quick au revoir, fleeing Europe within hours of talking to the police\n\nAfter her private jet touched down at Teterboro Airport, Kardashian, 35, was joined by a battalion of bodyguards in a head-of-state-like motorcade featuring at least eight SUVs for the ride from New Jersey to New York.\n\nThe first member of the family to emerge from the line of vehicles was Kardashian’s mother, Kris Jenner, who was with the TV personality in Paris. Jenner was joined by her boyfriend, Corey Gamble. Kardashian was also accompanied by Duvier, who was questioned by cops, but was not considered a suspect, according to reports.\n\nKanye West in Manhattan Monday morning, preparing to meet his wife at an airport.\n\nKardashian wasn’t wearing her massive wedding band after being photographed with it on Sunday evening in Paris.\n\nThe reality star emerged from her car and quickly darted inside her Manhattan apartment with West.\n\nA day earlier West, abruptly stopped his performance mid-song at the Meadows Festival in Queens on Sunday night after learning what happened, telling the audience he had a “family emergency.”\n\n“He wanted to get to her as soon as he could,” the source told People. “He told her that he couldn’t care less about the jewelry; he’s just thankful that she’s okay.” Kardashian — who was in the City of Light for Fashion Week — considered getting robbed one of her “biggest fears,” an insider close to the reality star told People.\n\n“She’s always known the threats are out there, but for something to happen, it’s almost unimaginable,” the source said. “It’s going to take her a very long time to feel safe again.”\n\nNews Wire Services\n\nWith Helene Goutany in Paris, Nancy Dillon, Nicole Hensley", "images": ["data:image/webp;base64,UklGRiQAAABXRUJQVlA4IBgAAAAwAQCdASoBAAEAAwA0JaQAA3AA/v3AgAA=", "https://secure.gravatar.com/avatar/?s=85&d=mm&r=g", "https://www.nydailynews.com/wp-content/uploads/migration/2016/10/04/JYVPZTI3O3KFHDZA2T24LRIARI.jpg?w=1024&h=670", "https://www.nydailynews.com/wp-content/uploads/2023/08/New_York_Daily_News_nydredblack-1.svg"], "top_img": "https://www.nydailynews.com/wp-content/uploads/migration/2016/10/04/JYVPZTI3O3KFHDZA2T24LRIARI.jpg?w=1024&h=670", "keywords": [], "authors": ["Brian Niemietz", "Jason Silverstein", "Leonard Greene"], "canonical_link": "https://www.nydailynews.com/2016/10/04/kim-kardashian-was-bound-gagged-and-begging-for-life-during-paris-jewelry-robbery/", "title": "Kim Kardashian was bound, gagged and begging for life during Paris jewelry robbery", "meta_data": {"application-name": "newyorkdailynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "robots": "max-image-preview:large", "tdm-reservation": 1, "mrf": {"authors": "Brian Niemietz;Jason Silverstein;Leonard Greene", "canonical": "https://www.nydailynews.com/2016/10/04/kim-kardashian-was-bound-gagged-and-begging-for-life-during-paris-jewelry-robbery/"}, "description": "Kardashian thought the men “were for sure going to kill her,” a source said.", "generator": "WordPress 6.8.3", "og": {"type": "article", "title": "Kim Kardashian was bound, gagged and begging for life during Paris jewelry robbery", "url": "https://www.nydailynews.com/2016/10/04/kim-kardashian-was-bound-gagged-and-begging-for-life-during-paris-jewelry-robbery/", "description": "While tout le monde was buzzing about the shocking, $10 million Paris robbery of Kim Kardashian, French authorities began putting together the pieces of her horrifying ordeal. As Kardashian put dis…", "site_name": "New York Daily News", "image": {"identifier": "https://www.nydailynews.com/wp-content/uploads/migration/2016/10/04/JYVPZTI3O3KFHDZA2T24LRIARI.jpg?w=1024&h=670", "width": 1024, "height": 670}, "locale": "en_US"}, "article": {"published_time": "2016-10-04T02:11:24+00:00", "modified_time": "2018-04-08T16:44:49+00:00"}, "twitter": {"text": {"title": "Kim Kardashian was bound, gagged and begging for life during Paris jewelry robbery"}, "image": "https://www.nydailynews.com/wp-content/uploads/migration/2016/10/04/JYVPZTI3O3KFHDZA2T24LRIARI.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.nydailynews.com/wp-content/uploads/2023/09/cropped-DailyNewsCamera-7.webp?w=270"}, "movies": [], "publish_date": 1475547084.0, "source": "http://www.nydailynews.com", "summary": ""}