{"url": "www.huffingtonpost.com/entry/kylie-jenner-new-mom-changing-diapers_us_5ae9c564e4b06748dc8e6ed4", "text": "Travis Scott and Kylie Jenner watch the Western Conference playoffs together on April 18. Bob Levey via Getty Images\n\nKylie Jenner talked about why she enjoys changing diapers, how she and boyfriend Travis Scott came up with the name “Stormi” and what’s changed in her life since becoming a mother in an intimate interview published Wednesday.\n\nKim Kardashian conducted the interview with her younger sister for the Evening Standard, bringing up everything from Jenner’s career to her views on plastic surgery. But the 20-year-old beauty mogul had the most to say about little Stormi. She told Kardashian all about what surprised her most about motherhood and even admitted that she likes changing her daughter’s diapers.\n\nAdvertisement\n\n“I think more about the future because of her. Every time I leave and I’m stressed about leaving her, I’m like, ‘I’m doing it for you,’” Jenner said. “Everyone says you change completely when you become a mom, but I really feel the same, just better. So I don’t know what really has completely changed my world, besides her, of course.”\n\nShe added, “But I feel like it’s only gotten better. You’re less selfish — and I actually enjoy changing diapers. It’s really satisfying. To make her clean again. And I don’t know, the whole thing is really… it’s like such an amazing experience.”\n\nScott and Jenner, who are currently on vacation together, celebrated their daughter’s three-month birthday on Tuesday, sharing an adorable photo on Instagram.\n\nAdvertisement\n\nA post shared by Kylie (@kyliejenner) on May 1, 2018 at 8:46pm PDT\n\nJenner noted in the interview that she and Travis were originally thinking of just going with the name “Storm” instead of “Stormi.”\n\n“I really don’t know how we thought of Storm. Her dad insisted it was him, but I feel like it was me. And that kind of just stuck with us,” she said.\n\nAdvertisement\n\n“And then I didn’t really like just Storm — I didn’t feel like that was her name. So then it became Stormi,” Kylie said. “And it just stuck. I feel like there were a lot of other names that I might have even liked better, to be honest, but I feel like Stormi picked her own name, like it was just her name.”\n\nJenner said that being a new mom has “been so amazing” and “so much fun” but she admitted things can sometimes be difficult.\n\n“I’m learning so much more about myself and life, and it’s been such a great experience,” Kylie said. “Of course, there’s hard times and stuff … even in the beginning, just not sleeping, the nights, like, baby blues … and all the ups and downs.”\n\nAdvertisement\n\nA post shared by Kylie (@kyliejenner) on May 1, 2018 at 11:12am PDT\n\nStormi Webster was born on Feb. 1, weighing 8 lbs., 9 oz. She is the first child for both Jenner and Scott, whose real name is Jacques Webster.\n\nStories That Inspire You Your Support Fuels Our Mission Your Support Fuels Our Mission Become a Member Today As the year ends, our reporting does not slow down. Support the journalists who continue asking questions and telling stories with depth and care. Your membership today helps ensure we start the new year strong. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. Support HuffPost Already a member? Log in to hide these messages.\n\n“Pregnancy has been the most beautiful, empowering, and life-changing experience I’ve had in my entire life and I’m actually going to miss it,” Jenner said in an statement a few days after giving birth. “I’ve never felt love and happiness like this I could burst!”\n\nAdvertisement\n\nA post shared by Kylie (@kyliejenner) on May 1, 2018 at 12:30pm PDT", "images": ["https://img.huffingtonpost.com/asset/5ae9d13d1a00002700cdd75d.jpeg?ops=scalefit_720_noupscale", "https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNkYAAAAAYAAjCB0C8AAAAASUVORK5CYII=", "https://img.huffingtonpost.com/asset/5a9950b81e000008087ad4a7.png?cache=fZddhPEUtN&ops=1200_630", "https://img.huffingtonpost.com/asset/631d16ff2200001900ca9324.png?ops=100_100", "https://img.huffingtonpost.com/asset/691c87541700009d2b9c5f37.jpg?ops=50_50"], "top_img": "https://img.huffingtonpost.com/asset/5a9950b81e000008087ad4a7.png?cache=fZddhPEUtN&ops=1200_630", "keywords": [], "authors": ["Senior Reporter", "Whitney Snyder", "Editor-In-Chief Huffpost"], "canonical_link": "https://www.huffpost.com/entry/kylie-jenner-new-mom-changing-diapers_n_5ae9c564e4b06748dc8e6ed4", "title": "New Mom Kylie Jenner Explains Why She Loves Changing Diapers", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "The 20-year-old also spoke about the \"baby blues\" and the \"ups and downs\" of parenting.", "keywords": "Celebrities,Parenting ,kim kardashian,Kylie Jenner, travis scott", "fb": {"app_id": 46744042133}, "og": {"title": "New Mom Kylie Jenner Explains Why She Loves Changing Diapers", "type": "article", "image": {"identifier": "https://img.huffingtonpost.com/asset/5a9950b81e000008087ad4a7.png?cache=fZddhPEUtN&ops=1200_630", "url": "https://img.huffingtonpost.com/asset/5a9950b81e000008087ad4a7.png?cache=fZddhPEUtN&ops=1200_630", "type": "image/png", "width": 1200, "height": 630}, "url": "https://www.huffpost.com/entry/kylie-jenner-new-mom-changing-diapers_n_5ae9c564e4b06748dc8e6ed4", "site_name": "HuffPost", "locale": "en_US", "description": "The 20-year-old also spoke about the \"baby blues\" and the \"ups and downs\" of parenting."}, "article": {"tag": "Celebrities,Parenting ,kim kardashian,Kylie Jenner, travis scott", "section": "Entertainment", "published_time": "2018-05-02T17:05:16Z", "modified_time": "2018-05-02T17:05:16Z"}, "twitter": {"card": "summary_large_image", "site": "@HuffPostEnt", "title": "New Mom Kylie Jenner Explains Why She Loves Changing Diapers", "image": {"identifier": "https://img.huffingtonpost.com/asset/5a9950b81e000008087ad4a7.png?cache=fZddhPEUtN&ops=1200_630", "width": 1200, "height": 630}, "description": "The 20-year-old also spoke about the \"baby blues\" and the \"ups and downs\" of parenting."}, "al": {"ios": {"url": "huffpostnews:///?editionID=us&entryID=us_5ae9c564e4b06748dc8e6ed4", "app_store_id": 306621789, "app_name": "HuffPost"}}, "bingbot": "noarchive", "robots": "max-snippet:-1,max-image-preview:large,max-video-preview:-1", "google-site-verification": "97Mj-wW7u8U1NOnkW1rfH-I1kgO0-a9YsgoesOk41R8"}, "movies": [], "publish_date": 1525280716.0, "source": "http://www.huffingtonpost.com", "summary": ""}