{"url": "http://abcnews.go.com/ThisWeek/week-transcript-kaine-steele/story?id=10721384", "text": "May 23, 2010 — -- TAPPER: Hello again. Joining me now, the chairman of the Democratic National Committee, Tim Kaine, and the chairman of the Republican National Committee, Michael Steele. Gentlemen, welcome.\n\nKAINE: Hey, Jake, good to be with you.\n\nSTEELE: Jake, good to see you.\n\nTAPPER: I want to get to the general election results in a second, but first, I want to bear in on a couple of controversies we have, and I'm going to start with you, Mr. Steele.\n\nSTEELE: OK.\n\nTAPPER: I don't know if you were expecting (ph) that or not--\n\nSTEELE: Kind of.\n\n(LAUGHTER)\n\nTAPPER: The Kentucky Senate candidate, Rand Paul, has expressed his objections philosophically to the federal government being able to tell businesses that they cannot discriminate. Here's Rand Paul.\n\n(BEGIN VIDEO CLIP)\n\nRAND PAUL, SENATORIAL CANDIDATE, R-KY.: I like the Civil Rights Act in a sense that it ended discrimination in all public domains. I abhor racism. I think it's a bad business decision to ever exclude anybody from your restaurant. But at the same time, I do believe in private ownership.\n\nThere's ten different titles, you know, to the Civil Rights Act. One deals with private institutions, and had I been around, I would have tried to modify that.\n\n(END VIDEO CLIP)\n\nTAPPER: Chairman Steele, you have worked so hard to bring minorities into the Republican Party. Here is a Senate candidate saying that he doesn't think the government, philosophically, should be able to tell a business that they can't -- that they have to serve you.\n\nSTEELE: Right, right.\n\nTAPPER: Do you have an issue with that?\n\nSTEELE: Well, I do, and I think it's important to understand that Rand Paul has clarified his statement and has reiterated his support for and, you know, movement towards pushing civil rights forward as opposed to going backwards, number one.\n\nNumber two, our party has always had a strong view on this issue. We fought very hard in the '60s to get the civil rights bill passed as well as the voting rights bill. So I think that, you know, any -- any, you know, attempted look backwards, it's not in the best interests of our country, certainly, and certainly not in the best interests of the party.\n\nSo, you know, I've talked to Rand. He and I are on the same page. Our party stands four-square about moving forward on civil rights. Looking at the civil rights issues of the day -- education, for example -- there are many other fights that loom ahead for us in this area, so Rand Paul as United States senator will be four-square with the Republican Party, in lockstep with moving forward on civil rights, not looking backwards.\n\nTAPPER: Chairman Kaine, this is traditionally a Republican seat. Do these views of Rand Paul make this seat more competitive in your mind?\n\nKAINE: Absolutely, they do, Jake. Of course, it starts with our candidate, Jack Conway, who's the attorney general, I think he's going to run a great race. But Rand Paul's views on this, his statement this week that he thinks it's un-American for President Obama to try to hold British Petroleum accountable for the spill in the Gulf--\n\nTAPPER: Let's talk about that. What do you think about that?\n\nSTEELE: Well, I mean, our own speaker of the House referred to American citizens as un-American, so I think referring to a policy which he did not say it was un-American per se. He said going in that direction could be an un-American--\n\nTAPPER: We have -- we actually have the video clip. Let's watch that.\n\n(CROSSTALK)\n\n(BEGIN VIDEO CLIP)\n\nPAUL: What I don't like from the president's administration is this sort of, you know, I'll put my boot heel on the throat of BP, and I think it's part of this sort of blame game society in the sense that it's always got to be someone's fault, instead of the fact that maybe sometimes accidents happen.\n\n(END VIDEO CLIP)\n\nTAPPER: Certainly, accidents happen is not what you want the Republican response about the BP oil spill--\n\nSTEELE: Well, you know, well, look, I mean, it's not -- people shouldn't worry about the Republican response to the BP oil spill. They should worry about the Democrat president's response to the BP oil spill. It is one thing to actually get on the ground and get in front of this thing. It's another thing to sit back and hold BP accountable without helping them, and that's what's happening here. I mean, the federal government should have stepped into this thing immediately, to help make sure that the appropriate steps are being taken by BP, all federal agencies in support of the state government to try to get this thing cleaned up. And here we are, almost a month and a half later, and it's still spilling oil.\n\nTAPPER: How about that, Chairman Kaine? A lot of Democrats are criticizing the Obama administration for not doing enough to hold BP accountable.\n\nKAINE: The administration is doing two things. It starts with BP's accountability, and Rand Paul is wrong. It isn't un-American to hold somebody accountable for a massive environmental disaster of this kind. This isn't just a mistake that we can wash away. BP has got to be accountable for stopping the spill and then cleaning up and paying for the consequences. The administration has had a team working with BP from the very beginning trying to look at ways to help them do it, but it is BP's job. They have to be held accountable, and saying that it's just a mistake that needs to be washed away, or saying, as Rand Paul did, for example, that, you know, we needn't be so worried about things like mining regulations -- I mean, this is a very important role that the government has, to protect the safety of the environment and the health of its citizens. And so, Rand Paul's statements along these lines are very, very troubling, and it's important for Republican leaders to say whether they back this kind of an attitude or not.", "images": ["https://i.abcnewsfe.com/a/bf2f8ed5-a320-4d7e-b583-179abe072d92/trump-signs-shutdown-bill-20251112-ap-jh_1763006747268_hpMain_square.jpg?w=208", "https://i.abcnewsfe.com/a/009e3420-a5ae-477a-aeb3-edfa85648814/johnson-2-gty-jef-251118_1763480583977_hpMain_square.jpg?w=208", "https://i.abcnewsfe.com/a/a904a3c1-1e2d-4174-9130-e846e8059dee/carnivaldeath_1762746067738_hpMain_square.jpg?w=208", "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://i.abcnewsfe.com/a/7669390d-d027-4ec7-9673-1d2eccafbbec/comey-gty-er-251117_1763404424377_hpMain_square.jpg?w=208", "https://assets-cdn.abcotvs.net/static/images/DisneyPlus.svg"], "top_img": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "keywords": [], "authors": ["Abc News"], "canonical_link": "https://abcnews.go.com/ThisWeek/week-transcript-kaine-steele/story?id=10721384", "title": "'This Week' Transcript: Kaine and Steele", "meta_data": {"viewport": "initial-scale=1.0, user-scalable=yes", "og": {"locale": "en_US", "site_name": "ABC News", "url": "https://abcnews.go.com/ThisWeek/week-transcript-kaine-steele/story?id=10721384", "title": "'This Week' Transcript: Kaine and Steele", "description": "Transcript of 'This Week' interview with DNC Chairman Tim Kaine and RNC Chairman Michael Steele.", "image": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "type": "article"}, "description": "Transcript of 'This Week' interview with DNC Chairman Tim Kaine and RNC Chairman Michael Steele.", "keywords": "this week, jake tapper, tim kaine, michael steele, dnc, rnc, Article, 10721384", "theme-color": "#fff", "copyright": "2025 ABC News", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "'This Week' Transcript: Kaine and Steele", "lastPublishedDate": "2010-05-24T09:55:15Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/prism-story,10721384", "ipad": "abcnewsipad://link/prism-story,10721384", "googleplay": "https://abcnews.go.com/ThisWeek/week-transcript-kaine-steele/story?id=10721384"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "'This Week' Transcript: Kaine and Steele", "description": "Transcript of 'This Week' interview with DNC Chairman Tim Kaine and RNC Chairman Michael Steele.", "url": "https://abcnews.go.com/ThisWeek/week-transcript-kaine-steele/story?id=10721384", "image": {"identifier": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/prism-story,10721384", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/prism-story,10721384", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/ThisWeek/week-transcript-kaine-steele/story?id=10721384", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/ThisWeek/week-transcript-kaine-steele/story?id=10721384"}}}, "movies": [], "publish_date": null, "source": "http://abcnews.go.com", "summary": ""}