{"url": "www.celebritynetworth.com/richest-celebrities/actors/jamie-lee-curtis-net-worth/", "text": "What Is Jamie Lee Curtis' Net Worth?\n\nJamie Lee Curtis is an American actress, producer, and author who has a net worth of $60 million. That is a combined net worth with her husband of several decades, actor/writer/producer Christopher Guest.\n\nJamie Lee Curtis began her acting career with her breakthrough role in the 1978 horror film \"Halloween,\" where she played Laurie Strode, establishing herself as a \"scream queen.\" Following this success, she continued to appear in horror films like \"The Fog,\" \"Prom Night,\" and \"Terror Train.\"\n\nCurtis successfully transitioned to comedy in the 1980s with films like \"Trading Places\" (1983) and \"A Fish Called Wanda\" (1988), showcasing her versatility as an actress. Her performance in James Cameron's action thriller \"True Lies\" (1994) alongside Arnold Schwarzenegger earned her a Golden Globe.\n\nThroughout her career, Curtis has balanced roles in both independent and mainstream films, including \"Freaky Friday\" (2003), \"Blue Steel,\" and \"My Girl.\" She returned to the \"Halloween\" franchise multiple times, most recently in a trilogy that concluded with \"Halloween Ends\" (2022).\n\nBeyond acting, Curtis is an accomplished author of children's books and has been involved in philanthropic work. Her career reached a pinnacle when she won the Academy Award for Best Supporting Actress for her role in \"Everything Everywhere All at Once\" (2022).\n\nEarly Life\n\nJamie Lee Curtis was born on November 22, 1958, in Santa Monica, California. Her father was the late actor Tony Curtis, and her mother was the late actress Janet Leigh. Jamie Lee was raised alongside an older sister, and her parents divorced when she was four. After graduating from high school, Curtis studied at the University of the Pacific. Although she studied law initially, she later dropped out to pursue a career as an actress.\n\nCareer\n\nCurtis' first film role was in the 1978 horror film \"Halloween.\" This role became quite iconic, and \"Halloween\" became the highest-grossing independent film when it was released. This was the beginning of her career as a so-called \"scream queen,\" which is a name for actresses who are famous for roles in horror films. She followed up with leading roles in horrors such as \"The Fog,\" \"Prom Night,\" \"Terror Train,\" and many sequels and spin-offs to \"Halloween.\" Many of these films performed well at the box office.\n\nIn 1983, Curtis successfully escaped the scream queen typecast with a performance in the comedy \"Trading Places.\" She earned a BAFTA Award for Best Actress in a Supporting Role for her performance. After proving her comedic talents, she followed up with a role in another 80s comedy called \"A Fish Called Wanda,\" which later became a cult classic. Curtis continued to branch out into different genres during the 90s, taking a role in the action-thriller \"Blue Steel.\"\n\nIn 1994, Curtis received a Golden Globe award as a result of her role in the film \"True Lies.\" During the '90s, she also appeared in a number of other notable films, such as \"My Girl,\" \"My Girl 2,\" and \"Freaky Friday,\" the latter of which co-starred Lindsay Lohan. In 2004, Curtis appeared in the film \"Christmas with the Kranks,\" which also became a cult classic. This proved to be a turning point for Jamie Lee, as she announced in 2006 that she was taking an indefinite break from acting in order to focus on her family.\n\nHowever, this break only lasted for one year. In 2007, Curtis appeared in the live-action-animated film \"Beverly Hills Chihuahua\" alongside Piper Perabo. Three years later, she followed up with a role in the comedy \"You Again\" alongside Kristen Bell and Sigourney Weaver. Further voice acting roles followed with films like \"The Little Engine That Could\" and \"From Up on Poppy Hill\" before Curtis joined the cast of films like \"Veronica Mars\" and \"Spare Parts.\"\n\nA notable moment in Curtis' career came in 2018 when she reprised her role as Laurie Strode in the reboot of \"Halloween.\" The film proved to be a massive box office success, raking in over $76 million on its debut, becoming the second-best opening weekend in October. When all was said and done, the film earned over $255 million at the box office. The film's debut at the box office was also the highest-earning for any film with a lead actress over 55 years of age. In addition, 2018's \"Halloween\" proved to be the most commercially successful film of the entire franchise.\n\nThe year 2018 was busy for Jamie Lee, as she also starred in films such as \"An Acceptable Loss\" and \"Knives Out,\" the latter of which received widespread critical acclaim and raked in over $300 million at the box office.\n\nOutside of her film roles, Curtis has appeared in series such as \"Quincy, M.E.,\" \"Columbo,\" \"Charlie's Angels,\" \"Anything But Love,\" \"The Drew Carey Show,\" \"NCIS,\" and \"New Girl.\" From 2015 to 2016, she played Cathy Munsch on the Fox comedy horror series \"Scream Queens,\" earning a Golden Globe nomination. She also directed the episode \"Rapunzel, Rapunzel.\"\n\nIn 2020, it was announced that Curtis will reprise her iconic role once again in two more Halloween sequels: \"Halloween Kills\" and \"Halloween Ends.\" During this period, she also joined the cast of the sci-fi film \"Everything Everywhere At Once.\" She received widespread acclaim for her role in this movie and ultimately won an Oscar for Best Actress in a Supporting Role.\n\nEndorsements\n\nJamie Lee Curtis has lent her star power to several notable brands throughout her career. In the late 1980s, she appeared in commercials for Hertz rental cars. By the mid-1990s, she became the face of L'EGGS Pantyhose. Perhaps most famously, from 2007 to 2014, she endorsed Dannon's Activia yogurt, a campaign that became widely recognized and even parodied on \"Saturday Night Live.\" Curtis has mentioned that these endorsement deals provided her with financial stability and the flexibility to spend more time with her family, as commercial shoots required shorter commitments compared to film projects.\n\nRelationships\n\nIn 1984, Jamie Lee Curtis married Christopher Guest, a well-known screenwriter, composer, musician, actor, director, and comedian. Curtis connected with Guest after watching \"This Is Spinal Tap,\" in which he starred. Over the next few years, Curtis and Guest adopted two children.\n\nSubstance Abuse\n\nJamie Lee Curtis has struggled with alcoholism over her life and was addicted to painkillers at one point. In 1999, she became inspired to pursue a sober lifestyle and successfully recovered from her substance abuse issues.\n\nReal Estate\n\nIn 1989, Jamie and Christopher paid $1.683 million for a home in Santa Monica, California. Today, this home is likely worth $7-8 million. In 2016, they expanded their footprint by acquiring the home next door for $2.2 million. The combined property is likely worth $10-12 million. In the 2025 Palisades fire, Jamie and Christopher evacuated from their home. It's unclear as of this writing if their home was damaged.", "images": ["https://vz.cnwimg.com/thm/1JoH3482haSLevnlEMdqhrz36y0=/132x132/center/top/filters:format(webp)/2009/11/George-Clooney.jpg", "https://vz.cnwimg.com/thm/I4dSiTJhq0kprSuO--deoPCEAmQ=/132x132/center/top/filters:format(webp)/2020/06/taylor.png", "https://vz.cnwimg.com/thm/uRsxoLs7Ymmit5ATgRtN2utad40=/221x5:381x236/132x132/filters:format(webp):strip_exif()/2009/09/P-Diddy.jpg", "https://vz.cnwimg.com/wp-content/uploads/2020/09/jamie.jpg?x46379", "https://vz.cnwimg.com/thm/809jlKzAvL80CZT_qM8qS5SAeYM=/132x132/center/top/filters:format(webp)/2017/09/janet.jpg", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "https://vz.cnwimg.com/thm/XYlwYKV36MlseiU4i654NEx6L_Q=/132x132/center/top/filters:format(webp)/2012/09/Christopher-Guest.jpg", "https://vz.cnwimg.com/thm/FwCdse333XOp_YOGMLxl3ADxDr4=/132x132/center/top/filters:format(webp)/2009/11/Sigourney-Weaver.jpg", "https://vz.cnwimg.com/thm/ytXN9b8w9It76K9VoWgy4G4qch4=/132x132/center/top/filters:format(webp)/2011/11/John-Carpenter.jpg", "https://vz.cnwimg.com/thm/WQzwdRZ5sMLHnGu2Ix56qQA7xB8=/600x300/center/top/filters:format(webp)/2020/09/jamie.jpg", "https://vz.cnwimg.com/thm/0dOqT2nlNQM7u_J-5xWrCsf2nAw=/132x132/center/top/filters:format(webp)/2020/02/Angelina-Jolie.png", "http://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/thm/Y14fttV9jls9mxFLuNAHJTnNWTE=/132x132/center/top/filters:format(webp)/2019/10/denzel-washington-1.jpg", "https://vz.cnwimg.com/thm/yboGsO77E1kQwELLmrwRZv_4RmE=/132x132/center/top/filters:format(webp)/2017/02/GettyImages-528215436.jpg", "https://vz.cnwimg.com/thm/lt1abKKVHSBtY-US0k9GLU9MTmM=/132x132/center/top/filters:format(webp)/2009/09/Brad-Pitt.jpg", "https://vz.cnwimg.com/thm/IoWqGPmFDjvC6iTqcDsspXBuxqo=/132x132/center/top/filters:format(webp)/2018/03/GettyImages-821622848.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/thm/dXuAPIEBU--L_kRib4u0nSzjUtE=/132x132/center/top/filters:format(webp)/2020/04/Megan-Fox.jpg", "https://vz.cnwimg.com/thm/6YeVHh0J-Lz8ENawMlr6spsoFNI=/132x132/center/top/filters:format(webp)/2020/01/lohan.jpg", "https://vz.cnwimg.com/thm/lY3-oCS-xIdiqDaOi1qHd6UaTjg=/132x132/center/top/filters:format(webp)/2009/09/Cristiano-Ronaldo.jpg", "https://vz.cnwimg.com/thm/95i5RI1LWkjHyyoolMeto-z_WeU=/132x132/center/top/filters:format(webp)/2020/01/lopez3.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2020/09/jamie.jpg?x46379", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/jamie-lee-curtis-net-worth/", "title": "Jamie Lee Curtis Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Jamie Lee Curtis is an American actress, producer, and author who has a net worth of $60 million. That is a combined net worth with her husband of several decades, actor/writer/producer Christopher Guest.", "slick": {"wpversion": "3.0.1", "wppostid": 2764, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2020/09/jamie.jpg?x46379", "group": "post", "category": "actors:Actors"}, ";": "richest-celebrities:Richest Celebrities", "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "cnw": {"wppostid": 2764}, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Jamie Lee Curtis Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/jamie-lee-curtis-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2020/09/jamie.jpg?x46379", "site_name": "Celebrity Net Worth", "description": "What is Jamie Lee Curtis's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2025-05-12T17:48:55+00:00", "published_time": "2020-09-16T23:21:33+00:00", "section": "Actors", "tag": "richest actresses"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2020/09/jamie.jpg?x46379", "title": "Jamie Lee Curtis Net Worth", "description": "Jamie Lee Curtis is an American actress, producer, and author who has a net worth of $60 million. That is a combined net worth with her husband of several decades, actor/writer/producer Christopher Gu"}}, "movies": [], "publish_date": 1600298493.0, "source": "http://www.celebritynetworth.com", "summary": ""}