{"url": "https://people.com/style/we-tried-it-kim-kardashian-beauty-routine/", "text": "What It Is: As someone who works in beauty, new products are constantly hitting my desk, which means my routine doesn’t ever stay the same for too long. But in an effort to live like Kim Kardashian, I swapped out everything — and I mean everything — in my regimen so I could mimic the KKW Beauty mogul’s routine for a few weeks.\n\nWho Tried It: Kaitlyn Frey, Style & Beauty Assistant and Kardashian superfan\n\nWhy We Tried It: I love the Kardashians, and I’m willing to try anything that makes me feel like the 6th member of the KarJenner sister squad. I dyed my hair from dark brunette to Khloé’s beachy blonde, tested Kim’s KKW Beauty contour kits on camera and invested in more Kardashian-approved bodysuits than I can count. But it was time to take my Kardashian transformation to the next logical level.\n\nI wanted to try Kim’s full-fledged beauty routine. Now that she’s started her own cosmetics company, she’ starting to assimilate into the YouTube makeup vlogger world (she’s recently guest starred in tutorials with Jaclyn Hill, Patrick Starrr and Desi Perkins), and I’ve become especially interested in her makeup and skincare routines. When I watched the star’s first YouTube video alongside Hill, I was more mesmerized by how amazing her makeup-free skin looked on a high-definition camera than I was by the actual tutorial. No pimples, no pigmentation, no wrinkles, no nothing. And I wondered, would her go-to products work the same magic on me?\n\nSo I started digging, made a long list of every product Kim has said she loves and swears by and then replaced everything in my arsenal with her approved picks. I felt queasy looking at the price tags on some of the products — you’ll understand when you see for yourself — but hoped it would all be worth it.\n\nLevel Of Difficulty: Basically, a 10/10. I thought I was high-maintenance to begin with, but after three days of Kim’s routine, I felt completely exhausted. And that’s not even counting the financial burden (over $3,000!!!) her product rundown would cost me if brands didn’t help with this We Tried It pursuit by generously sending over the products. Below, the comprehensive list:\n\nTHE LINEUP\n\nGrand Total: $3,050.98\n\nThe Verdict: To be honest, I went into this experiment not expecting to see much of a difference in the way my skin and makeup looked. I’d like to think I have a fairly decent complexion, so as much as I wanted to look as flawless as Kim, deep down I really didn’t think I would see mic-drop worthy results.\n\nRELATED PHOTOS: Cleavage and Contouring! Let a Bikini-Clad Kim Kardashian Teach You How to Use Her Beauty Products\n\nBoy, was I wrong. My biggest skin concerns were a cluster of three tiny whiteheads on the apple of my right cheek and horrible horizontal forehead lines from my expressions (I got Botox for them once before. It wore off.). After three days of doing Kim’s incredibly long skincare routine, it all disappeared. Seriously. My bumps were gone, my forehead lines diminished — okay, not completely — and my skin looked so smooth. Like baby skin smooth.\n\nHere’s how it worked: I started at night by removing my makeup with the Neutrogena makeup removing wipes (on my face) and This Works Cleansing Pads (on my eyes). It worked nicely, but typically I prefer melting off my makeup with an oil cleanser. I followed up by doing a full-face cleanse using By Terry’s balm in the shower, then slathered some Bio-Oil all over as soon as I got out. It feels greasy, but moisturized my legs like no other.\n\nNext, I prayed my turkey neck would disappear as I applied Lancer’s Decollete Firming treatment. I felt the area tightening a little after using it, but maybe that was all in my head. I followed that with Tracie Martyn’s toner and one of the many eye creams Kim uses — I even got to try a not-yet-released one from La Mer (she’s a huge fan of the Serum Essence from the Genaissance de la Mer collection), that you can try too by signing up to land on the secret waitlist right now! I’m only 23, so I didn’t see immediate results from the eye treatments, but am faithful they’ll keep my under-eyes youthful in the long run.\n\nLooking for more style content? Click here to subscribe to the PeopleStyle Newsletter for amazing shopping discounts, can’t-live-without beauty products and more.\n\nAt this point, I wasn’t even halfway done with the nighttime portion of Kim’s skin routine…I know. The Bachelorette was on, my roommates were sipping Sauvignon Blanc on the couch, and I was stuck in my 7-by-5-foot closet-of-a-bedroom making sure I (God forbid!) didn’t miss a step. It was taxing.\n\nI moved on to using more serums and moisturizers: the fancy schmancy Guerlain serum that I can’t pronounce which cost more than $500, Tracie Martyn’s Resculpting Cream (that lifts and tightens your face) and Anastasia Beverly Hills’ Hydrating Oil. Finally, I reached my last step: La Mer’s Perfecting Treatment. I snatched it in triumph knowing I reached the end, to which the $220 cream catapulted across the room and slammed into my hardwood floor. “And this is why expensive things don’t belong in my hands,” I thought. No products were broken in the making of this story, but I did feel like I belonged in beauty jail after that performance.\n\nKaitlyn Frey\n\nI can’t deny I felt bougie AF using such luxury products on my face (not to mention lucky). But I’d be lying if I said a part of me didn’t dread going through the extensive ordeal again in the morning. Of course, I haphazardly did it when I woke up, but just omitted the face oil and replaced it with some insanely expensive La Mer SPF.\n\nIn terms of getting through Kim’s makeup routine every day, I didn’t struggle as much as I did with the skin. I’m a makeup junkie at heart and love wearing full glam. So going through her steps of foundation (either Laura Mercier or Giorgio Armani), concealer (NARS), brows (Anastasia Beverly Hills), mascara (Kevyn Aucoin or Lancome), eye shadow (LORAC or Kylie Cosmetics) wasn’t a problem. The actual problem, however, was the contour. I consider myself a pretty well-adjusted contourer, and even gave my first impression of Kim’s KKW Beauty contour kits on-camera. So it wasn’t a physical challenge to contour my face every day. But it was incredibly annoying.\n\nIt’s pretty hard to contour your face in five minutes or less, despite what anyone tells you. A proper contour requires a decent amount of blending and focus — not what I wanted to be doing at 7 a.m. before work every morning. After a few days, I gave up with the KKW Beauty contour sticks. Sorry Kim! I couldn’t be bothered blending anymore, didn’t love the formula and preferred a few quick swipes of my usual bronzer instead. Maybe her KKW Beauty powder contour kits launching next week will impress me more.\n\nA week into my experiment, I spent a weekend in the Hamptons, thus committing to lugging all Kim’s products with me. Ultimately, I weighed down my small duffle bag with more beauty products than clothes. This weekend was when the slacking began. I wasn’t about to wear makeup to lay out by the pool. That’s just not my style. I made sure to apply all my skincare as I normally would, but by Sunday was too lazy to do more than just the La Mer SPF. Yes, I admit it. I’m lazy! Judge me all you want. I’m convinced Kim falls off the wagon once and a while too, so I tried not to feel guilty about it.\n\nI woke up Monday morning after my weekend away so sleepy I couldn’t bear to think of doing anything beauty-wise — skincare, makeup or hair — before work. My skin looked dull after a weekend filled of rosé, and I hated myself for copping out of at least putting on moisturizer. But luckily for me, that night I was following in Kim’s footsteps (literally) and trying the super luxurious facial at the Tracie Martyn Skin Care Salon on 5th Ave in N.Y.C. a few days after she visited.\n\nAfter work I headed to my appointment feeling totally giddy. Using the same products as someone is one thing, but doing a treatment like Tracie Martyn’s $450 Red Carpet Facial had to make me look as fabulous as Kim. I was convinced this could be her secret to ageless skin — especially considering A-list stars like Kate Winslet, Naomi Campbell, Rihanna, Lady Gaga and Brad Pitt swear by Martyn’s services too.\n\nKaitlyn Frey\n\nMy aesthetician told me I would be receiving my facial in the exact same private suite that Kim got hers done in only a few days prior. I looked around the expansive room larger than my entire East Village apartment, which was filled with luxurious couches, oversized pillows and its own private bathroom thinking, “So this is what it must feel like to be Kim.”\n\nI undressed, put on the strapless white terrycloth robe they provided, laid down on the bed and we got to work.\n\nThe 60-minute Red Carpet Facial consists of seven steps using cutting-edge technology to stimulate lymphatic drainage, lift your cheekbones, sculpt your jawline and ultimately contour every crevice of your face. Without getting into too much of the nitty gritty details, this is basically what happened: the aesthetician started with a crystal-free, diamond-tip microdermabrasion concentrating on large pores, fine lines, wrinkles and hyperpigmentation. She told me my skin concerns were quite minor, so in my case, it was a proactive treatment.\n\nWhile letting Tracie’s Enzyme Exfoliant sit on my face as a mask, she grabbed the proprietary Resculptor machine. To put it simply, it pumps a precise amount electricity into your face to lift everything, especially focusing on the jawline and cheekbones. It sounds scary, but somehow I didn’t feel any pain. My aesthetician handed me a mirror to look at the difference after doing just the left side. I couldn’t believe my eyes. My double chin seemed minimized, and for once it looked like I had a defined jawline. The best part: I was told I’d continue seeing the effects of it for a few days, and it would last around two months. What a miracle!\n\nShe continued using the Resculptor all over my face — including my forehead where I faced my worst deep-set horizontal lines. Then I relaxed as she placed cooling LotoSculpt pads under my eyes and a larger LotoSculpt sheet mask on my forehead. My aesthetician followed that by using Radiant Glow amber LED light all over to boost collagen production. My treatment ended by getting slathered in the brand’s luxurious-smelling Face Resculpting Cream, which Kim’s been using since her visit too.\n\nWhen I looked in the mirror, my skin glowed in the best way possible. My pores looked even better than they looked when I walked in, and they were pretty good to begin with considering the lineup of products I’d been using.\n\nBy the end of my two-week trial, I was Kim-level confident and everyone around me noticed. I knew my new routine, albeit expensive, made a difference in my skin. Even my coworkers commented on how great my makeup looked and how clear my skin seemed.\n\nMy biggest takeaway: beautifying yourself like Kim Kardashian takes a ton of work. I commend her for keeping up with such an elaborate routine daily, on top of everything else she has going on in her life. As tiring as it was for me to do, I admit the results were worth it. And I hate myself for saying that. I secretly hoped I would be let down by Kim’s products, knowing I surely can’t afford a $3,000 regimen on my own dime. But I haven’t had a breakout since using her skincare, the makeup glides on like butter and I feel like the best version of myself using what Kim does. While I don’t know if I can afford to keep up such a pricey regimen, you can find me stretching out these serums, moisturizers, mascara and more until their last drop.\n\nWould you try any of Kim’s favorite beauty products? Tell us in the comments below.", "images": ["https://people.com/thmb/r642p4XwylqeGE3RxIxX-S7Q0j8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(870x0:872x2)/kim-kardashain-be94af8a4b9d4d05b2af2b47e7d1c7de.jpg", "https://people.com/thmb/Rd6vXSaMjSYP0zNmTTCGraNSn5s=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/celine-dion-charlotte-tilbury-111025-1-97ba8f912cd841c28f0b3600e6db31c0.jpg", "https://people.com/thmb/idgy4Xm7fqTni0ObF9I4P23fp6I=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/peo-beauty-hilary-duff-skin-tint-tout-8ef854f345b34a7caa877a9846867bbe.jpg", "https://people.com/thmb/Y6jO4yCCqhTMPPaUla1oS8St520=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/celine-dion-charlotte-tilbury-111025-1-97ba8f912cd841c28f0b3600e6db31c0.jpg", "https://people.com/thmb/yFr2dXd7aGzevGScrMci4UIcfpM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Shay-Mitchell-kids-skincare-299-110425-e4f4976f88814b3ba9298d823fb18d0f.jpg", "https://people.com/thmb/erPbsCNeoiXNSGnxhWsw0r4UbmM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/peo-bethenny-frankel-holiday-picks-tout-1b13e36e5e884e0bb12ea1c0c3c0ddb1.jpg", "https://people.com/thmb/aJXo7HEFm7oF8YflyVvf351zM9o=/200x200/filters:no_upscale():max_bytes(150000):strip_icc()/Headshot-2000-ca8c28b4e983413d8ad4635965a0a09e.jpg", "https://people.com/thmb/Ja20JEJRDwDFAnz2Jjlt2LwEeH8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/peo-ent-team-amazon-one-off-jessica-alba-fluffy-robe-tout-94846049bbe64670a2c946818c55aa37.jpg", "https://people.com/thmb/6C7GqVqWTC1RihjIqwAR_BTpLmc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/peo-i-tried-the-pants-trend-jennifer-aniston-and-celeb-stylists-co-signed-for-fall-tout-08538c3f5a49430ca774f3da156fa2a4.jpg", "https://people.com/thmb/TDGBDgFGcMAOS7Ym5XCxLJwfVjE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Jordan-Chiles-1-103125-1ee633241dbb4e0f9def264d77dcf948.jpg", "https://people.com/thmb/i_CH79AjXp_4Ki6OKBskNyteoro=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/peo-bethenny-frankel-holiday-picks-tout-1b13e36e5e884e0bb12ea1c0c3c0ddb1.jpg", "https://people.com/thmb/PgXKi_tsxv4KZJf9vROo2E5ZhXM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/peo-oprah-loved-bags-tout-e29cf3e205b5412e827acb1de93c2a05.jpg", "https://people.com/thmb/hol4sbW3C0Y2mBtjX5dbwl02R88=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(359x0:361x2)/img_5620-1-ced946ea912a4d0dba11225a41bcfe26.jpg", "https://people.com/thmb/GoIC-wC1-jCqhhUeFgLeRHxvZn8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/peo-jen-aniston-lip-balm-tout-c6ad4840142f491eb5ac54cb38a84307.jpg", "https://people.com/thmb/v6mzalulOUWsaQgwr87x0EizXPg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/peo-ent-team-amazon-roundup-tswift-tights-tout-7981b5f73cd64886b31a1b41c17efcb4.jpg", "https://people.com/thmb/l1heBQe1jhrtwJjca13fVum5wTk=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/ekaterina-gordeeva-sergei-grinkov-ice-skating-111925-43f6a37ba62840c685a1b57f3a2569ac.jpg", "https://people.com/thmb/qgUjF4GwyqxsZxLrCOxjroUnZUU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/peo-madison-lecroy-attends-amazon-home-for-the-holidays-at-gh-tout-079373bceb8f4382b62230225dfcf799.jpg", "https://people.com/thmb/W7pR5Ab5uQ2xdjO8WSlfEinulo0=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/Vencent-Hickerson-111925-6-f70136ab95854fed905274e761d98e0f.jpg", "https://people.com/thmb/QI9mrBZ8So_IGDFWMg27suvC4Lo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/peo-week-of-11-10---ent-team-amazon-roundup---reese-witherspoon-peacoat-tout-f21c9b96402e4122a495a6db14eb17a5.jpg", "https://people.com/thmb/Vius8ggqCcg5hTDN1NFJmr-Imao=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/peo-k-carroll-accessories-riva-reversible-nylon-tote-oprahs-favorite-things-2025-tout-dcfac7e6bfe44cff83908bdd9f93c14c.jpg", "https://people.com/thmb/6IyhFgQT3wu0NWP0Aphz5wDFs4s=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/Kelsey-Zach-Top-Riley-Green-111925-f36976ca5eb14ae792f092060f209f93.jpg", "https://people.com/thmb/YVILqCr7pvZKs3FAGRnT36uAAj8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/peo-charlotte-tilbury-x-celine-dion-holiday-collection-tout-b790852b4fc74d88b7b84e39ec70fcb6.jpg", "https://people.com/thmb/G66g3WiZhFKA1M-xJlMwKDCzZlY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/courteney-cox-homecourt-1-102925-3b332ef768144b8587af36093a78a6d1.jpg", "https://people.com/thmb/aNg75lw3kLnUci_hxBb9u4HUsdY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/img_5647-1-2000-a0f0f79d638241f69c4d59db53094b80.jpg", "https://people.com/thmb/c1LYzjEd3kDMamds8Zqa2iwxZNQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Jennifer-Garner-is-seen-in-Los-Angeles-121724-d8a3ae95996e4cbda4c51aac69995776.jpg", "https://people.com/thmb/wjGzrhugTJwbONWKP2-z21Tn43A=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/kim-kardashian-6601-03a1def152bc4bd88916c3fac19b93a7.jpg", "https://people.com/thmb/SLX76p4w-rfRc_Kk1N7oqdNk8qw=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/meghan-king-5th-Annual-Vanderpump-Dog-Foundation-Gala-2023-jim-edmonds-Busch-Stadium-2024-092425-66f95d42ed374e038155e8e43fc99358.jpg", "https://people.com/thmb/so0RlGGNVpt6y_LRmpIkDwUy5mE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/peo-k-carroll-accessories-riva-reversible-nylon-tote-oprahs-favorite-things-2025-tout-dcfac7e6bfe44cff83908bdd9f93c14c.jpg"], "top_img": "https://people.com/thmb/r642p4XwylqeGE3RxIxX-S7Q0j8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(870x0:872x2)/kim-kardashain-be94af8a4b9d4d05b2af2b47e7d1c7de.jpg", "keywords": [], "authors": ["Kaitlyn Frey", "People Editorial Guidelines", "Jackie Fields", "Clara Mcmahon", "Alyssa Grabinski", "Catherine Santino", "Rylee Johnston", "Taylor Jean Stephan", "Jeaneen Russell", "Averi Baudler"], "canonical_link": "https://people.com/style/we-tried-it-kim-kardashian-beauty-routine/", "title": "We Tried It: Kim Kardashian's $3,000+ Beauty Routine Changed My Skin Forever", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "I stockpiled every pricey product Kim swears by to see if they actually made a difference", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "PEOPLE", "sailthru.author": "Kaitlyn Frey", "parsely-section": "Lifestyle", "parsely-tags": "People.com,Lifestyle,Celebrity,Shopping,Beauty & Style,Person,Kim Kardashian,Celebrity Skincare,Beauty Products,The Scoop", "article": {"section": "People", "author": "https://www.facebook.com/peoplemag"}, "og": {"type": "article", "site_name": "People.com", "url": "https://people.com/style/we-tried-it-kim-kardashian-beauty-routine/", "title": "We Tried It: Kim Kardashian's $3,000+ Beauty Routine Changed My Skin Forever", "description": "I stockpiled every pricey product Kim swears by to see if they actually made a difference", "image": "https://people.com/thmb/r642p4XwylqeGE3RxIxX-S7Q0j8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(870x0:872x2)/kim-kardashain-be94af8a4b9d4d05b2af2b47e7d1c7de.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "We Tried It: Kim Kardashian's $3,000+ Beauty Routine Changed My Skin Forever", "description": "I stockpiled every pricey product Kim swears by to see if they actually made a difference", "image": "https://people.com/thmb/r642p4XwylqeGE3RxIxX-S7Q0j8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(870x0:872x2)/kim-kardashain-be94af8a4b9d4d05b2af2b47e7d1c7de.jpg"}, "vf": {"url": "https://people.com/style/we-tried-it-kim-kardashian-beauty-routine/"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.147.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.147.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.147.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.147.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.147.0/icons/favicons/mstile-310x150.png", "fb": {"pages": 95926963131}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}