{"url": "https://www.thewrap.com/evan-rachel-wood-westworld-equal-pay-male-co-stars-season-3-video/", "text": "It’s hard to argue that anyone’s face is more strongly associated with “Westworld” than Dolores Abernathy’s (Evan Rachel Wood).\n\nBut the actress who plays the robotic rancher’s daughter in HBO’s sci-fi hit tells TheWrap that her paycheck didn’t match her status for the series’ first two seasons. At least, it wasn’t equal to what the leading men were raking in.\n\n“I think I’m just now to the point where I’m getting paid the same as my male co-stars,” Wood said in a recent interview with Sharon Waxman, TheWrap’s founder and CEO.\n\nWith the sophomore installment about to premiere, Wood found out she was getting a bump for Season 3 equal to the likes of Anthony Hopkins and Ed Harris — the men of Jonathan Nolan and Lisa Joy’s drama (well, the latter still is, as of that messy freshman year finale).\n\n“I was just told that, you know, ‘Hey you’re, you’re getting equal pay.’ And I was like [gasp]. And I almost got emotional,” Wood said. “I was like, ‘I have never been paid the same as my male counterparts … Never, never.’”\n\n“I found out … I’m always fighting for that,” Wood added. “And I have turned down projects — “Westworld,” it’s like, I get it a little more,” she said laughing. “It’s like, ‘Well, you’re Anthony Hopkins or Ed Harris.’ But I think now we’re all doing equal amounts of work and really hard work.”\n\nWood said up until now, she has been making “pretty much the same amount of money on things for years.”\n\n“I have not moved,” Wood said. “And I’m not saying I’m in like dire straits. I’m very lucky … It’s more about if you’re getting paid fairly, or the same, or if you’re getting paid less simply because you’re a woman, that’s not fair.”\n\n“There’s a lot of politics, but there’s a lot of things that are now being talked about in a different way,” Wood added. “There is a lot of stuff that goes on behind the scenes. There is a lot of trying to make things equal and trying to make things fair. I don’t know, there is a lot of stuff. But this is the first time that somebody made a point of being like, ‘Hey you’re getting this. And you deserve it.’ And that was nice.”\n\nEarlier this month, HBO boss Casey Bloys addressed the topic of pay parity at the premium cabler following comments made by an exec who said the bump in salaries the cast of “Big Little Lies” received for Season 2 “short of raped” the network.\n\n“One of the things that’s come out of thinking about the movement and some conversations with Reese [Witherspoon], who’s really at the forefront, is something we’ve done recently,” Bloys told The Hollywood Reporter. “We’ve proactively gone through all of our shows — in fact, we just finished our process where we went through and made sure that there were no inappropriate disparities in pay; and where there were, if we found any, we corrected it going forward. And that’s is a direct result of the Times Up movement.”\n\nBloys added that pay parity “becomes more of an issue when you get into Season 2 and Season 3, assuming the show is a success.”\n\n“When you’re putting a show together, people come in with different levels of experience and maybe some people have won awards or something that makes them stand out. But when you get into Season 2 or 3 of a show and the show is a success, it is much harder to justify paying people wildly disparate numbers, and that’s where you have to make sure that you’re looking at the numbers — that they don’t end up just on the path they were on from the pilot stage. So, the thing that has been interesting about the whole movement is that it really is reminding everybody to do what’s right, and I think it’s retraining all of our thinking.”\n\nHBO declined TheWrap’s request for comment on this story.\n\nWatch the full interview above.\n\n“Westworld” Season 2 will premiere Sunday at 9/8 c on HBO.", "images": ["https://i0.wp.com/www.thewrap.com/wp-content/uploads/2025/11/111325_COVER-_IR_5x4.png?fit=240%2C300&quality=80&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2021/07/Jennifer-Maas.jpeg?resize=150%2C150&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2023/07/waxword-pill-300.png?fit=300%2C43&quality=80&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/07/Sharon-Waxman.png?fit=276%2C300&quality=80&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2018/04/Evan-Rachel-Wood-Westworld.png?fit=618%2C412&quality=80&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2021/07/Jennifer-Maas.jpeg?fit=53%2C58&quality=89&ssl=1"], "top_img": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2018/04/Evan-Rachel-Wood-Westworld.png?fit=618%2C412&quality=80&ssl=1", "keywords": [], "authors": ["Jennifer Maas", "Tv Reporter", "Jennifer.Maas Thewrap.Com", "Twitter", ".Wp-Block-Post-Author Box-Sizing Border-Box Display Flex Flex-Wrap Wrap .Wp-Block-Post-Author__Byline Font-Size Margin-Bottom Margin-Top Width", ".Wp-Block-Post-Author__Avatar Margin-Right .Wp-Block-Post-Author__Bio Font-Size Margin-Bottom .Wp-Block-Post-Author__Content Flex-Basis Flex-Grow .Wp-Block-Post-Author__Name Margin", ".Wp-Block-The-Wrap-Author-Bios__Entry Align-Items Center Display Flex Flex-Wrap Wrap Gap .Wp-Block-The-Wrap-Author-Bios__Entry .Wp-Block-The-Wrap-Author-Bios__Entry Margin-Top .Wp-Block-The-Wrap-Author-Bios__Entry-Excerpt Flex-Basis", ".Wp-Block-The-Wrap-Author-Bios Border-Top Solid", "Margin-Block Padding-Top .Wp-Block-The-Wrap-Author-Bios__Entry-Avatar Display Var --Display-No-Mobile", "Block"], "canonical_link": "https://www.thewrap.com/evan-rachel-wood-westworld-equal-pay-male-co-stars-season-3-video/", "title": "Evan Rachel Wood Is ‘Just Now’ Receiving the Same Pay as Male ‘Westworld’ Co-Stars (Exclusive Video)", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Evan Rachel Wood Is 'Just Now' Receiving the Same Pay as Male 'Westworld' Co-Stars (Exclusive Video)", "description": "\"I've never been paid the same as my male counterparts. Never, never,\" actress tells TheWrap of pay parity throughout her career", "url": "https://www.thewrap.com/evan-rachel-wood-westworld-equal-pay-male-co-stars-season-3-video/", "site_name": "TheWrap", "image": {"identifier": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2018/04/Evan-Rachel-Wood-Westworld.png?fit=618%2C412&quality=80&ssl=1", "width": 618, "height": 412, "type": "image/png"}}, "article": {"author": "https://www.facebook.com/thewrap/", "published_time": "2018-04-17T00:20:36+00:00", "modified_time": "2018-04-21T01:51:07+00:00"}, "author": "Jennifer Maas", "twitter": {"card": "summary_large_image", "creator": "@thewrap", "label1": "Written by", "data1": "Jennifer Maas", "label2": "Est. reading time", "data2": "4 minutes"}, "generator": "WordPress 6.8", "article-tags": "anthony_hopkins, casey-bloys, ed_harris, evan_rachel_wood, hbo, jeffrey_wright, jonathan-nolan, lisa-joy, westworld, westworld-season-2, wrap-women", "article-section": "tv", "article-categories": "culture, dailies, tv, videos, waxword", "msapplication-TileImage": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2024/05/the_wrap_symbol_black_bkg.png?fit=270%2C270&quality=80&ssl=1"}, "movies": [], "publish_date": 1523924436.0, "source": "https://www.thewrap.com", "summary": ""}