{"url": "people.com/tv/kylie-jenner-and-travis-scott-relationship-timeline/", "text": "Kylie Jenner and Travis Scott were first spotted together at Coachella in 2017 and later began dating\n\nThey share two children — daughter Stormi and son Aire\n\n— Jenner and Scott announced a break in their relationship in October 2019\n\nAfter getting back together, Jenner and Scott split again toward the end of 2022\n\n\n\nKylie Jenner and Travis Scott's relationship has had its ups and downs.\n\nThe beauty mogul and rapper first sparked romance rumors after being spotted holding hands together at Coachella in 2017. Then Jenner and Scott decided to take their love on the road, with Jenner revealing to GQ in 2018 that she joined Scott on tour.\n\n\"He said, 'I'm going back on tour — what do we want to do about this?' Because we obviously liked each other,\" the reality TV star said in the joint interview with Scott. \"And I was like, 'I guess I'm going with you' ... And then we rode off into the sunset.\"\n\nHowever, after two years of dating and welcoming their first child together in February 2018, the pair split in October 2019. During their time apart, Jenner and Scott remained friendly while co-parenting their daughter, Stormi. By the summer of 2021, the couple reunited, and Jenner later announced on Instagram that she was pregnant with their second child (born in February 2022).\n\nThe couple called it quits for a second time less than a year after welcoming their son. A source told PEOPLE in early January 2023 that Jenner is \"not with\" Scott but that \"this is probably not the end of their relationship.\"\n\nFrom stylish date nights and breakups to red-carpet PDA and the birth of their two children, Stormi and Aire, here's a complete timeline of Kylie Jenner and Travis Scott's relationship.\n\nApril 2017: Kylie Jenner is spotted with Travis Scott at a party\n\nDuring an off phase of Jenner's relationship with Tyga, the reality star was spotted getting cozy with Scott at a Coachella party. \"Travis and Kylie have been friends for a while and they all hang out,\" a source told PEOPLE at the time. \"When she and Tyga are having drama, she tries to make him jealous by hanging out with other guys.\"\n\nBut it turns out, Scott became more than just someone to make Tyga jealous with.\n\nApril 25, 2017: Kylie Jenner and Travis Scott attend a Houston Rockets game together and show some PDA\n\nTravis Scott and Kylie Jenner. Bob Levey/Getty\n\nAfter hanging out at Coachella together, the couple seemed to make their love official by getting cuddly at an NBA playoff game in Scott's hometown of Houston.\n\nAccording to an onlooker at the Houston Rockets vs. Oklahoma City Thunder game — where Scott performed before tip-off — the Keeping Up with the Kardashians star and the hip-hop artist were spotted holding hands and \"definitely looked like a couple.\"\n\n\"During his performance, Kylie was hiding in the Rockets' courtside club anxiously waiting for him to come back to her. Once he got back, they definitely looked like a couple, cuddled up next to each other among her friends,\" said the onlooker, who attended the game and spotted Jenner kissing Scott's neck.\n\nApril 29, 2017: Kylie Jenner and Travis Scott make a club appearance together after his show\n\nJenner headed to Bentley University to support her beau. Located just outside Boston in the town of Waltham, Bentley was celebrating its annual Spring Day, which included a big concert on campus featuring Scott.\n\nLater, the couple headed to Boston's Theater District where Scott made an appearance at Bijou nightclub.\n\n\"He was definitely looking for something intimate,\" one club-goer told PEOPLE. \"They also talked a lot. Like, actually having a conversation. They were dancing at the club. They were definitely super into each other. He didn't really perform, he just showed up and partied. They left in the same car too.\"\n\nApril 30, 2017: Travis Scott and Kylie Jenner are spotted getting handsy\n\nGAMR / BACKGRID\n\nJenner stopped by the rapper's Los Angeles home, where the two were spotted getting handsy with one another. Scott was photographed grabbing the bum of the then-19-year-old Kylie Cosmetics founder, who sported a black sweatshirt with an embroidered hoodie and black leggings. At one point during their romantic embrace, Scott lifted up the reality star into the air as they snuggled up in front of the black Cadillac SUV outside of his residence.\n\nJune 2017: Travis Scott and Kylie Jenner get matching tattoos\n\nKylie Jenner Snapchat\n\nJenner and Scott attended Khloé Kardashian's 33rd birthday party at TAO in L.A., where they were \"all over each other,\" said one source.\n\n\"They recently got matching butterfly tattoos on their ankles that they were showing off to their friends and family,\" the insider added. \"They were super affectionate and Travis was constantly kissing her on the cheek and whispering in her ear. Their relationship seems to be getting stronger and they're closer than ever.\"\n\nJenner also went on to get an ankle tattoo in tribute to ex Tyga changed — transforming what once was a lowercase \"t\" to a lowercase \"la.\"\n\nJune 28, 2017: Kylie Jenner and Travis Scott step out with matching rings\n\nJenner and Scott seemed determined to make their love known, and their next romantic display came in theform of matching rings. The Keeping Up with the Kardashians star and the rapper were spotted out and about in L.A. wearing sparkling bands on their ring fingers.\n\nAugust 2017: Travis Scott gifts Kylie Jenner a diamond necklace for her birthday\n\nBACKGRID\n\nOn her 20th birthday in August, the Life of Kylie star enjoyed a low-key family celebration at home before hitting a movie theater with Scott. But what fans were quick to point out was the fact that Jenner was sporting some new bling — a very sparkly new diamond necklace, which was a birthday gift from her rapper-boyfriend.\n\nAugust 2017: Kylie Jenner's family jumps on board with Travis Scott\n\nINSTARimages.com\n\nThough Jenner and Scott's relationship was relatively new at the time, her family was definitely on board with the romance: A source told PEOPLE that the Kardashian and Jenner crew \"loves Travis.\"\n\n\"Kylie and Travis are doing great,\" said the source. \"There's no drama with Travis. He's a cool guy. He treats Kylie with a lot of respect and love. Kylie is very happy.\"\n\nSeptember 2017: Sources report that Kylie Jenner and Travis Scott are expecting\n\nIn September, multiple sources confirmed to PEOPLE that Jenner was pregnant with her first child.\n\n\"They started telling friends a few weeks ago,\" said the source. \"The family has known for quite some time. She is really excited and so is Travis.\" Another source close to the family told PEOPLE: \"It is an unexpected but completely amazing turn of events that she could not be more excited or thrilled about.\"\n\nFebruary 1, 2018: Kylie Jenner and Travis Scott welcome their first child\n\nAfter months of keeping fans in the dark, Jenner confirmed the pregnancy rumors and announced she and Scott had welcomed their first child, daughter Stormi Webster, on Feb. 1.\n\n\"After the baby was born, Kylie was relieved that the moment was finally here,\" a source told PEOPLE. And even though the delivery room was \"a bit chaotic with all the family and friends around,\" the source added that the 20-year-old \"was overwhelmed in a good way — overwhelmed with the joy, love and support everyone was giving to her and Travis.\"\n\nFebruary 2018: Travis Scott and Kylie Jenner learn to co-parent\n\nAfter welcoming Stormi, Scott kept his own pad as he co-parented with Jenner.\n\n\"Despite being new parents, Kylie and Travis are still in a new relationship too. Kylie is happy with their living situation,\" a source close to Jenner told PEOPLE. \"Travis is a great dad. When he wants to work, Kylie is supportive. She has everything she needs right now and seems very happy.\"\n\nMarch 23, 2018: Kylie Jenner flaunts her 'push present' from Travis Scott\n\nKylie Jenner/Instagram\n\nShowing off two sleek new cars, Jenner hinted that they were meant for her and her boyfriend when she captioned the shot, \"mom and dad.\" One was a bright orange Lamborghini Aventador, and the other appeared to be a matching model in a darker hue.\n\nApril 2018: Kylie Jenner and family celebrate Travis Scott's birthday at Six Flags\n\nKylie Jenner/Instagram\n\nTo celebrate boyfriend Scott's 27th birthday, Jenner had a private party at Six Flags Magic Mountain in L.A., which was attended by her sisters Kendall Jenner, Kourtney Kardashian, Kim Kardashian and her then-husband Kanye West. \"Rented out six flags for baby's birthday,\" she wrote alongside a video of the start of one of the night's many roller coaster rides on her Instagram Story.\n\nMay 7, 2018: Kylie Jenner and Travis Scott make their red carpet debut at the Met Gala\n\nTravis Scott and Kylie Jenner. Evan Agostini/Invision/AP/Shutterstock\n\nJenner made her post-baby return to the red carpet at the 2018 Met Gala. The parents to then-3-month-old Stormi stepped out together for fashion's biggest night, with Jenner in a head-turning strapless black Alexander Wang gown with a stomach cutout, mirrored sunglasses and 5-carat Chopard diamond earrings.\n\nFor his part, the rapper wore a black military-style suit with a harness on top.\n\nJuly 2018: Kylie Jenner and Travis Scott cover GQ magazine's August issue\n\nPaola Kudacki exclusively for GQ\n\nGracing the cover of GQ's August issue, Jenner and her boyfriend opened up about how they first met, how their lives have changed since they welcomed daughter Stormi — and whether they're worried about the so-called \"Kardashian curse,\" the belief that all the men who date a member of the famous family ultimately end up derailing.\n\n\"I don't even be looking at motherf—ers,\" he told the magazine. \"I don't be looking at s—. Kylie actually likes me for me. Man, hell nah. Nervous for what? I'm on my own island. So hey, come over there to Astroworld. I'm not into all the other s—. I don't get involved. I'm over here. Kylie is different.\"\n\nAugust 2, 2018: Kylie Jenner makes a cameo in Travis Scott's music video\n\nJust three days after the release of Scott's album Astroworld, the artist dropped the visual for \"Stop Trying to Be God\" featuring none other than his baby mama. Jenner makes a cameo covered in gold paint and is seen again at the end of the video holding a lamb, who mouths \"stop trying to be God.\"\n\nFebruary 3, 2019: Kylie Jenner supports Travis Scott at the Super Bowl halftime show\n\nWhen Scott took the stage alongside Maroon 5 and Big Boi at the Super Bowl halftime show in Atlanta, Jenner and Stormi were cheering him on from backstage.\n\nJenner shared a sweet Instagram video of her daughter cooing as she watched her dad performing on TV, calling it \"PRICELESS.\"\n\nFebruary 10, 2019: Kylie Jenner and Travis Scott attend the Grammys together\n\nVALERIE MACON/AFP/Getty\n\nJenner and Scott made their first awards show appearance as a couple at the 2019 Grammys. Scott scored three nominations for best rap album (for Astroworld), best rap song (for his hit single \"SICKO MODE\") and best rap performance (also for \"SICKO MODE\").\n\nJenner wore a baby pink halter Balmain Haute Couture jumpsuit with full-glove sleeves and a satin-lace belt, ivory pumps and Lorraine Schwartz jewels for the night out.\n\nFebruary 2019: Kylie Jenner's home, which incorporates Travis Scott, appears in Architectural Digest\n\nKevin Mazur/Getty\n\nJenner took her boyfriend's style into consideration when decorating her Hidden Hills mansion, her designer revealed to PEOPLE after the star unveiled the property in the March issue of Architectural Digest.\n\n\"She loves pink, so we wanted to do layers of pink,\" said Martyn Lawrence Bullard. \"But it wasn't overly feminine because she wants to make sure the man in her life enjoys it as well. He spends a lot of time at the house and has his own closet there. The design was obviously for Kylie but it's done in a way to really be a family home.\"\n\n\"They're incredibly loving together. It's really quite beautiful,\" he added. \"Obviously, they're very young, but to see this young family that actually has this real connection even though they're both unbelievably in the public eye, it's kind of wonderful because I think they've found somewhat of a sanctuary in each other.\"\n\nFebruary 14, 2019: Travis Scott showers Kylie Jenner with roses\n\nOn Valentine's Day, Jenner showed off a truly over-the-top display installed in the entry of her home. The scene featured a series of heart-shaped sculptures completely covered in red roses and lining a mirrored aisle, with a neon pink heart light at the end of the candle-lined walkway. While she played one of Scott's songs in the background of the video, she didn't outright say that he was responsible for the eye-catching installation.\n\nWhoever shelled out for the hearts, however, paid a sizable sum: about $67,000, one floral expert estimated to PEOPLE.\n\nFebruary 2019: Kylie Jenner debunks speculation she and Travis Scott are engaged\n\nThough Jenner and Scott had been fueling speculation that they're engaged — or even already married! — for months, she put the rumors to rest in a cover interview with Paper.\n\nCalling Scott a great dad, a \"big kid,\" and a fantastic partner, Jenner said when it happens — and she seemed certain it will soon, according to Paper — she'll be sure to announce it.\n\n\"I'll let everybody know,\" she promised.\n\nIn July a source told PEOPLE \"Kylie is very happy with her life.\"\n\n\"She and Travis are discussing marriage.\"\n\nFebruary, 28 2019: TMZ reports Travis Scott canceled a show after cheating allegations from Kylie Jenner\n\nIn late February, a TMZ report surfaced that Jenner had accused Scott of cheating, which prompted him to cancel his Feb. 28 Buffalo, New York, show and remain in Los Angeles. (Scott announced on Twitter that he had both canceled and rescheduled his concert due to illness.)\n\nA rep for Scott, however, strongly denied to PEOPLE that he was unfaithful or that he and Jenner had fought about cheating. A rep for Jenner had no comment.\n\nApril 30, 2019: Kylie Jenner wishes Travis Scott a happy birthday and hints at another baby\n\nTravis Scott and Kylie Jenner with daughter Stormi. Kylie Jenner Instagram\n\nIn honor of Scott's 28th birthday on April 30, Jenner dedicated a touching tribute to the rapper on Instagram calling him her \"real life bestie & hubby.\"\n\n\"My real life bestie & hubby all wrapped into one. I love you and I'm so so proud of you. happy happy birthday.\"\n\nThe reality star even hinted at baby number two writing, \"Let's f— around and have another baby.\"\n\nIn July a source told PEOPLE Scott and Jenner \"are trying\" to have another baby and that, \"Kylie loves being a mom and can't wait to give Stormi a sibling.\"\n\n\"Everyone thinks Kylie will be pregnant with her second baby soon,\" the source added.\n\nAugust 2019: Kylie Jenner and Travis Scott vacation in Europe\n\nScott and Jenner put their love on full display while vacationing in Europe for Jenner's 22nd birthday.\n\nThey were spotted holding hands in Italy and dancing in Cannes, France.\n\nIn a video obtained by TMZ, Scott and Jenner were seen grinding in the middle of a beachfront restaurant before facing each other to engage in some salsa dancing.\n\nAugust 28, 2019: Kylie Jenner and daughter Stormi support Travis Scott at his Netflix documentary premiere\n\nTravis Scott, Stormi Webster, Kylie Jenner. Tommaso Boddi/Getty Images\n\nJenner and Scott stepped out together at the premiere of Scott's Netflix documentary, Travis Scott: Look Mom I Can Fly on Aug. 28.\n\nJenner and Scott brought out baby Stormi for the special night. The rapper was seen giving his daughter a sweet kiss on the cheek as Jenner held her in her arms.\n\nThe documentary, which gives viewers a look into the musician's life and rise to stardom, featured glimpses of his romance with Jenner and his journey to fatherhood.\n\nSeptember 2019: Kylie Jenner and Travis Scott cover Playboy magazine\n\nSasha Samsanova/Playboy\n\nThe couple opened up about their relationship (and sex life!) in a cover story for Playboy's \"Pleasure Issue,\" where they admitted the arrival of their daughter hasn't gotten in the way of them continuing to connect on a physical level.\n\n\"A lot of people claim that having a baby can hurt your sex life, but I feel like that's the opposite of our experience,\" said the \"Sicko Mode\" rapper.\n\nAdded the Keeping Up with the Kardashians star, laughing, \"Yeah, I feel like we've definitely proven that rumor to be wrong.\"\n\nOn the contrary, \"You remind me that motherhood and sexuality can coexist, and just because you embrace your sexuality doesn't mean you have loose morals or you're not a good mother,\" Jenner told Scott, who also creatively directed the shoot and posed alongside his girlfriend for the eight-page spread.\n\n\"You can be sexy and still be a badass mom,\" the Kylie Cosmetics mogul added.\n\nOctober 1, 2019: Kylie Jenner and Travis Scott announce they're taking a break\n\nOn Oct. 1 it was revealed that Jenner and Scott decided to take a break from their relationship.\n\n\"They are taking some time but not done,\" a source close to Jenner told PEOPLE. \"They still have some trust issues but their problems have stemmed more from the stress of their lifestyles.\"\n\nNovember 2019: Kylie Jenner is spotted with Drake amid break with Travis Scott\n\nEthan Miller/Getty Images, Bryan Steffy/WireImage\n\nIn November 2019, it was rumored that the makeup mogul was involved with rapper Drake. The source exclusively told PEOPLE, \"He and Kylie have been spending time together recently,\" adding, \"They've been friends for a long time and Drake is very close to the family.\" Another insider insisted that the pair are \"just friends.\"\n\nFebruary 1, 2020: Kylie Jenner and Travis Scott reunite for daughter Stormi's birthday\n\nKhloe Kardashian / Instagram\n\nThe pair were together for their daughter Stormi's birthday on Feb. 1. The co-parents doted on their adorable daughter at her StormiWorld 2-themed party.\n\nFebruary 9, 2020: Kylie Jenner and Travis Scott attend Oscar afterparties together\n\nTheo Wargo/WireImage; Taylor Hill/FilmMagic\n\nWhile on her way to an Oscar afterparty, Jenner posted videos of her sisters Kourtney and Khloé and Travis Scott in the back of a limousine. Were they just carpooling? Or was it a romantic night out? A source made it clear to PEOPLE that they are not officially back together.\n\n\"They are very happy,\" the source said. \"It seems too early to say that they are officially back together, though.\" They added that it seems like Kylie \"doesn't want the pressure to announce that they are back together until there is more of a commitment from Travis.\"\n\nJenner \"has done very well without Travis,\" the source continued. \"Her family knows that she will continue to do well, even if things with Travis don't work out.\"\n\n\"But they are great together,\" the source added. \"And of course, it's best for Stormi to have both parents around as much as possible.\"\n\nFebruary 2020: Travis Scott isn't \"thrilled\" Kylie Jenner may be moving on\n\nA source told PEOPLE, \"Travis was obviously never thrilled that Kylie hung out with other guys. He is very protective of Kylie. They added that the prospect of a reunion isn't out of the question. \"Kylie doesn't want this public back-and-forth when it comes to her relationship with Travis,\" a source told PEOPLE. \"When she is ready to announce that they are back together, she will.\"\n\n\"For now, they are great and happy. They spend most days together with Stormi,\" the source concluded.\n\nApril 2020: Kylie Jenner shows Travis Scott love for his birthday\n\nKylie Jenner/instagram\n\nJenner shouted out Scott on his 29th birthday, sharing a candid carousel of photos and videos. The post included shots of the rapper with their daughter, photos of Scott alone and photos of the family of three, including an intimate image of the Keeping Up with the Kardashians star holding a newborn Stormi in a hospital bed while Scott looked on.\n\n\"DADA 🤍 happy birthday to daddy of the year! i'm slowly but surely starting to accept the fact that storm is a daddy's girl. 😫 but whatever,\" she wrote on Instagram last year. \"We went half on greatness! the most beautiful, smart, loving and funny little baby. the best gift. ok i'm crying. love you forever!\"\n\nAs the COVID-19 pandemic hit, the pair were largely out of the public eye, and off each other's social media.\n\nApril 30, 2021: Kylie Jenner wishes Travis Scott a happy birthday on her story\n\nTravis and Stormi. Kylie Jenner/Instagram. inset: getty\n\nKeeping with tradition, one year later the reality star celebrated Scott on his 30th birthday, posting a sweet series to her Instagam Story of the \"Goosebumps\" rapper with their daughter.\n\n\"Happy birthday @TravisScott !!!! ✨✨✨✨✨✨✨✨ Stormi's daddy 🚀🚀,\" she captioned a snap, which showed the father-daughter duo sitting inside a small ball pit.\n\nIn other photos, Scott carried the 3-year-old in his arms, and got a kiss on the cheek from his toddler.\n\nMay 1, 2021: Kylie Jenner celebrates Travis Scott's birthday with him in Miami\n\nKylie Jenner and Travis Scott. Thaddaeus McAdams/Shutterstock\n\nWhile the Kylie Cosmetics mogul flew to Miami for Scott's birthday celebrations, during which a source told PEOPLE the parents \"kept flirting and looked happy,\" the former couple was \"not fully back together,\" the insider stressed.\n\n\"Even after they split, they always spent a lot of time together,\" the source said. \"They are great co-parents and love hanging out. They share a fun life with Stormi, but have separate homes. They haven't dated anyone else seriously since they split though. It always seemed possible that they would get back together.\"\n\nMay 9, 2021: Travis Scott wishes Kylie Jenner a happy Mother's Day\n\nTravis Scott/Instagram\n\nFeeling the love on Mother's Day, Scott celebrated Jenner with a rhyming poem.\n\n\"Of all the special things in life/The big ones and small/A mamas love and rage and tenderness/Is the most special of them all,\" he wrote, posting two photos of the makeup mogul with Stormi.\n\nMay 18, 2021: Kylie Jenner and Travis Scott spend the day at Disney with daughter Stormi\n\nKylie Jenner, Travis Scott and their daughter. Kylie Jenner/Instagram\n\nA week later, Jenner and Scott treated Stormi, her cousins Dream, Chicago, and another friend to a trip to the happiest place on earth. Proving that the theme park truly is fun for the whole family, the parents were pictured on a ride with their toddler in a snap posted by Jenner.\n\n\"Hands full today 😅 😅,\" she jokingly captioned a photo, walking alongside Scott and her sister Kim Kardashian, who joined the outing, as the toddlers strolled in front of them.\n\nMay 21, 2021: Kylie Jenner and Travis Scott remain friendly through split\n\nOn May 21, a source told PEOPLE that Jenner and Scott were not exclusively dating, but that they still cared for each other.\n\n\"They love each other. They enjoy spending family time with Stormi. They all travel together. Kylie and Travis also have date nights,\" the source said. \"They have worked hard to create a family situation that's best for them. Being together 24/7 doesn't work, so they still have separate homes.\"\n\n\"They are not exclusive, but Kylie isn't seeing anyone else, either,\" the insider added.\n\nRemaining friendly through their split and prioritizing co-parenting, another source told PEOPLE on May 31 the parents \"continue to spend a lot of quality family time together\" and that Jenner was \"very happy\" with Scott.\n\n\"They are not putting any pressure on their relationship. They get along and things are great. They both want to be as present as possible for Stormi. Kylie and Travis have worked hard to create a great family situation,\" the insider said.\n\n\"They love each other. Everyone is very proud of how mature they are. Stormi is the happiest little girl,\" they added. \"It's all benefitting her.\"\n\nJune 15, 2021: Kylie Jenner and Travis Scott appear on the red carpet together as a family\n\nTravis Scott, Kylie Jenner and Stormi. Craig Barritt/Getty\n\nThe reality star and Stormi flew to N.Y.C. to support Scott at the annual Parsons Benefit in New York City, and a source told PEOPLE the pair \"seemed fully back on\" at the event. Posing for photos on the red carpet with their daughter, the onlooker said the parents were open with their affection towards one another.\n\nHonored alongside fellow creatives and receiving an award during the big night out, Scott showed some love for Jenner during his acceptance speech too, saying, \"Wifey, I love you so much,\" the source added.\n\n\"Although they always got along, there is a different energy between them now,\" an insider said. \"Kylie and Travis are very close again. Kylie flew to N.Y.C. to support him. It's just great to see them back together.\"\n\n\"They never put any pressure on their relationship,\" the source added. \"The focus was always on being the best co-parents. They still keep separated homes in L.A. because this is what works for them.\"\n\nJune 20, 2021: Kylie Jenner wishes Travis Scott a happy Father's Day\n\nTravis Scott and Kylie Jenner with daughter Stormi. Kylie Jenner/Instagram\n\nJenner spoke from the heart in wishing Scott a happy Father's Day, sharing just how much he means to her and Stormi.\n\n\"Happy father's day @travisscott,\" she wrote alongside a snap leaning into Scott as he held their daughter. \"One day isn't enough to honor the dad you are. we are so blessed to have you.\"\n\nAugust 20, 2021: PEOPLE confirms Kylie Jenner and Travis Scott are expecting their second child\n\nThe family is growing! PEOPLE confirmed on Aug. 20, 2021, that the on-again couple was expecting baby No. 2.\n\nJenner has long been open about her desire to expand her family further. She told a fan in 2019, \"I can't wait to have more babies,\" then in a January 2020 YouTube video, she said she sees herself \"for sure having four kids\" but doesn't \"have a timeline to this.\"\n\nOctober 31, 2021: Kylie Jenner and Travis Scott celebrate Halloween with daughter Stormi\n\nKylie Jenner Instagram\n\nThe day after Halloween, Jenner shared photos on Instagram of her holiday celebrations with Scott and Stormi.\n\nA pregnant Jenner wore a black leather trench coat teamed with cat ears and combat boots, while Scott wore a Michael Myers mask. Stormi went trick-or-treating dressed as a mermaid.\n\nNovember 2, 2021: Travis Scott gifts Kylie Jenner and daughter Stormi matching rings\n\nOn Nov. 2, Jenner shared a photo on Instagram of her hand next to her daughter Stormi's wearing identical rings. Jenner captioned the post, \"daddy got us matching rings 🤍⛈,\" referring to Scott's gift.\n\nNovember 3, 2021: Kylie Jenner and Travis Scott have date night in his hometown\n\nJenner posted a series of photos on Instagram from her and Scott's \"date night\" in Houston. The images included a candlelit table with roses and Jenner showing off her baby bump in a black dress and leather trench coat.\n\nNovember 4, 2021: Kylie Jenner supports Travis Scott at his charity softball game\n\nJenner and daughter Stormi showed their support from the crowd for Scott's The Cactus Jack Foundation Fall Classic at Minute Maid Park in Houston. The mother-daughter pair cheered on Scott and sister Kendall at the charity softball game, with Jenner holding a \"Kendall is our MVP\" sign and Stormi sporting a foam finger.\n\nNovember 7, 2021: Kylie Jenner supports Travis Scott after Astroworld Festival tragedy\n\nOn Nov. 5, 2021, eight people were killed, and over 300 people were injured (two more people would die later from their injuries) after a crowd surge during Scott's 2021 Astroworld Festival in Houston. Scott was performing on stage when the incident occurred, and Jenner was also in attendance.\n\nJenner released a statement on her Instagram story expressing sadness for the victims of the tragedy. \"My thoughts and prayers are with all who lost their lives, were injured or affected in anyway by yesterday's events,\" she wrote.\n\nJenner also showed her support for Scott after he faced backlash for not stopping his performance. \"I want to make it clear we weren't aware of any fatalities until the news came out after the show and in no world would have continued filming or performing,\" she added.\n\nFebruary 2, 2022: Kylie Jenner and Travis Scott welcome their second baby\n\nKylie Jenner Instagram\n\nJenner announced on Instagram that she had given birth to a son on Feb. 2, 2022. She captioned the black-and-white photo of their newborn's hand with \"2/2/22.\"\n\nJenner and Scott initially named their bundle of joy Wolf, but they would later change it. Their son was born just one day after big sister Stormi's fourth birthday.\n\nFebruary 14, 2022: Travis Scott gives Kylie Jenner dozens of roses for Valentine's Day\n\nLess than two weeks after Jenner gave birth to their second child, Scott celebrated Valentine's Day by giving her a huge pink bear, a gingerbread house and dozens of white and pink roses. Jenner shared photos of all the gifts on Instagram.\n\nAfter Scott presented Jenner with her gifts, a source told PEOPLE Kylie is \"very grateful for Travis.\"\n\n\"He is a romantic guy,\" the source added. \"He surprised her with lots of white and pink roses for Valentine's Day. She was teary-eyed about it. They also had a special dinner.\"\n\nThe source continued, \"They are enjoying being a family of four. Kylie is still resting and recovering. She likes staying home. Travis makes sure that she has everything that she needs. Stormi is helping out with [her] baby brother. She is the cutest big sister.\"\n\nMarch 21, 2022: Kylie Jenner reveals she and Travis Scott are changing the name of their newborn son\n\nThough Jenner initially introduced their son by the name of Wolf Webster, she later revealed on her Instagram Story that she and Scott decided to change their baby's name. The couple has not publicly revealed their son's new name.\n\n\"FYI our sons [sic] name isn't Wolf anymore,\" Jenner wrote. \"We just really didn't feel like it was him. Just wanted to share because I keep seeing Wolf everywhere.\"\n\nLater, in an April 2022 interview with USA Today, Jenner revealed that as soon as she signed the birth certificate she knew she would eventually change their son's name.\n\n\"It just didn't suit him,\" she said. \"We haven't legally changed his name yet. We're in the process, so it just wouldn't feel right to share anything when we don't have an official name.\"\n\nApril 17, 2022: Kylie Jenner and Travis Scott celebrate Easter with their new baby boy\n\nOn Easter Sunday, Jenner posted photos on Instagram from her family's Easter celebrations, including a picture of Scott holding their baby son in his arms.\n\nApril 30, 2022: Kylie Jenner wishes Travis Scott a happy birthday on Instagram\n\nTo celebrate Scott's 31st birthday, Jenner posted a photo of the two together on Instagram.\n\n\"Happy birthday my love my best friend,\" Jenner captioned the photo. \"The most special person and father to our babies.\"\n\nMay 2022: Kylie Jenner and Travis Scott enjoy a tropical getaway\n\nKylie Jenner Instagram\n\nThree months after the birth of their son, Jenner and Scott took daughter Stormi on a beach vacation. On May 5, Jenner shared photos on Instagram from the trip, including one with Jenner embracing Scott before sunset on the beach. She captioned the images with emojis: \"🤍🦋🌅.\"\n\nAnother post showed Jenner posing in a white dress with the beach landscape behind her. \"Love like a sunset,\" she wrote.\n\nJune 19, 2022: Kylie Jenner celebrates Travis Scott on Father's Day\n\nKylie Jenner Instagram\n\nJenner honored Scott on Father's Day by sharing a photo of Scott relaxing with their two children on Instagram.\n\nJenner captioned the post, \"Happy father's day daddyyyyy we love you 🤎\".\n\nJuly 5, 2022: Kylie Jenner makes a sandwich for Travis Scott\n\nJenner showed off her sandwich-making skills on Instagram, posting various ingredients, including Italian sub rolls, fresh pickles, cheese, turkey, salami, mustard and salad dressing. She captioned the series of photos, \"Bae said i want a sandwich,\" referring to Scott. Other images included the couple enjoying the sandwiches together.\n\nJuly 10, 2022: Kylie Jenner and Travis Scott have dinner in West Hollywood\n\nJenner and Scott stepped out for what appeared to be their first date night since welcoming their son on Feb. 2, 2022. The two went to dinner at Craig's in West Hollywood, and Scott was photographed holding Jenner's hand as they made their way into the restaurant.\n\nJuly 14, 2022: Kylie Jenner and Travis Scott help their daughter create a volcano science experiment\n\nJenner shared a sweet moment between Scott and daughter Stormi on TikTok as dad helped the budding scientist create the classic experiment of making a volcano with vinegar and baking soda.\n\nAugust 10, 2022: Travis Scott wishes Kylie Jenner a happy birthday\n\nScott helped celebrate Jenner's 25th birthday on his Instagram Story. He posted various pictures, including one of Jenner in a pink bodysuit and text that read, \"Happy f------- birthday mi,\" adding brown heart emojis.\n\nThe rapper also shared a shot of Jenner and Scott holding hands, writing, \"That's the I want it now look.\"\n\nOctober 2022: Travis Scott denies rumors he cheated on Kylie Jenner\n\nCheating rumors sparked after model Rojean Kar posted a video of Scott from the set of a shoot. The rapper addressed the allegations by sharing that he never met the model. \"It's a lot of weird s--- going on,\" Scott wrote on his Instagram Story. \"An uninvited person was sneaking photos on, what was supposed to be, a closed set while I was directing a video. I'm saying this for the last time. I don't know this person. I've never been with this person. So please stop with the continuous cyber games and the fictional storytelling.\"\n\nKar later accused the musician of cheating in a video posted to her Instagram Story. \"Saying you don't know me and you've never once been with me when you've definitely been with me, when f------ everybody's seen you with me, when I have pictures and videos of you with me, come on,\" Kar said in the selfie video. \"Come on, sir.\"\n\nJanuary 2023: Source confirms that Kylie Jenner is \"not with\" Travis Scott\n\nAfter rumors that the couple had called it quits for a second time, a source confirmed to PEOPLE that Jenner is \"not with\" Scott.\n\n\"She spent the holidays in Aspen with her family,\" the source shared. \"[But] this is probably not the end of their relationship.\"\n\nThe insider continued: \"Kylie is very focused on her kids and her business. She is not a big partier. Travis is the opposite. He likes to party. They definitely have different focuses. They always did.\"\n\nThe relationship between Jenner and Scott has \"never been easy,\" according to the source, who adds that \"there is a reason that they never got married. It's always been very up and down.\"\n\nApril 1, 2023: Travis Scott calls Kylie Jenner \"a beauty\" on Instagram\n\nOn the Kylie Cosmetics Instagram account, Jenner shared a series of behind-the-scenes images from a photoshoot. She was dressed in a skintight black gown and had her hair pulled back in a sleek bun.\n\nScott left a comment on the post that said: \"A beauty.\"\n\nJuly 28, 2023: Travis Scott seemingly disses Kylie Jenner's rumored beau Timothée Chalamet in new track\n\nFrazer Harrison/GettyAraya Doheny/GettyGreg Doherty/WireImage\n\nJenner and Chalamet have been \"getting to know each other\" since April 2023 — and Scott may not be too happy about it.\n\nIn a new track titled \"Meltdown,\" the rapper seemingly dissed the Wonka star when he said: \"Chocolate AP and chocolate the Vs got the Willy Wonka factory (Vs)/ Burn a athlete like it's calories, find another flame hot as me, bitch.\"", "images": ["https://people.com/thmb/UPBcArFgdYFgX5SWanRJrTpxRiA=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/travis-scott-stormi-110825-bc6568ae2314403ea514c4ae58a5e4b9.jpg", "https://people.com/thmb/uZsmXnOqt01G-64rM6W0OTiwJUc=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/kim-kardashian-kylie-jenner-kris-jenner-kendall-jenner-111125-f8bba80ac6dd4090813c164b12ede293.jpg", "https://people.com/thmb/64csDZrPzfrmswqgc3eUw2EhK0k=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/kylie-jenner11-6e40652737f94535befc9646d5b6d54e.jpg", "https://people.com/thmb/LztNjwaQ-ix4eK4edUooLhNiWi4=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/anna-kepner-3-111025-c6a90b2f57474459a89ae04e296ec343.jpg", "https://people.com/thmb/8qusORpO7THhVVW_WCq4NKU30PA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(837x0:839x2)/kylie-jenner-travis-scott-2-706ee5f61c3345eab5c613a372634daf.jpg", "https://people.com/thmb/tu6vZO8lEnfAzuG_n75yjENlGAQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(603x529:605x531)/kylie-jenner-c27e846122b64e1d8a44afbe979fad6a.jpg", "https://people.com/thmb/p59pCo344i0_rNdqBqhEEvBxyQM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(319x0:321x2)/people_social_image-60e0c8af9eb14624a5b55f2c29dbe25b.png", "https://people.com/thmb/-CwcvfFHuSQXJJG7MkjXDBnjg9g=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/kim-kardashian-kylie-jenner-kris-jenner-kendall-jenner-111125-f8bba80ac6dd4090813c164b12ede293.jpg", "https://people.com/thmb/C92uIc6BEkMPlQ5Ro-NupTUpfSE=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(741x0:743x2)/kylie-jenner-travis-scott-5-5df1544e16134b459de443e4b8f2a623.jpg", "https://people.com/thmb/i1DI3LRoI37BAT2hdtWOnMdUe2Y=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Travis-Scott50tout-e0ba90037d1e437586138454aa49be30.jpg", "https://people.com/thmb/LO1RdQlHt933YZIWzHXDZMK5Hew=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/lily-allen-the-hunger-games-on-stage-the-global-stage-premiere-111325-1-e86743b6585b4fe59ae1cebdd3aab8ea.jpg", "https://people.com/thmb/FLMrTm3ICHIs4rXuDicP8qg3gB8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(511x0:513x2)/kylie02-ee834ccc152f4b2d9cef83ed60503d73.jpg", "https://people.com/thmb/x1MANXl6tVK9A7RljkI-ZiSZAf0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(374x0:376x2)/kylie-b1-ea5b28d7f07e49b0af5aa1aa5681a7e6.jpg", "https://people.com/thmb/DHws8_Wzw-DA_HR0THJHkZKr118=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Helena-Bonham-Carter-Nell-Burton-Larkspur-Hawk-111125-aab769ce177047a0bcc4b52aee0dd403.jpg", "https://people.com/thmb/7unS3EOqPI3510uMKHkapj9nhKM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(704x0:706x2)/kylie-jenner-travis-scott-2000-0d49b7287b1a4373a6f5ac6b9d613e6d.jpg", "https://people.com/thmb/w6vYmtzrbkP91RfKDS8ZrBVWCy4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(699x0:701x2)/kylie-tout-559d3ffc07a1458d8d999c12302bbdab.jpg", "https://people.com/thmb/orWY7yFtRmPMD8wGFA6Kcx2MutY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/travis-scott-kylie-2901f76c5f104f099671db821c071e02.jpg", "https://people.com/thmb/e0nyvG00YBmksRVCPMm4C4H6LtM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(679x572:681x574)/kylie-jenner-1-2000-58388bc5a3aa42c19eca27895170fca7.jpg", "https://people.com/thmb/O2ohLs-vX0ji35cQV-27ftu5wF4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/travis-scott-stormi-110825-bc6568ae2314403ea514c4ae58a5e4b9.jpg", "https://people.com/thmb/ydAr7Lvv0VTsL56Z9lP3om4lnFs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Kylie-Jenner-Kim-Kardashian-Kylie-Cosmetics-Celebration-101926-fb527251156e410eb2486fbadab4766a.jpg", "https://people.com/thmb/0GQET3gjOwVqhr1m1pCu_lVbf6g=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(755x366:757x368)/kylie-jenner-1-c88f84cbb40642d59babcbc0a6698f21.jpg", "https://people.com/thmb/RQ0JVJ9c4M__Kc4ZzatqjTiwoos=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(460x599:462x601)/celebs-at-disney-kylie-travis-d42f8ea4ea7f4bff988726ace8335738.jpg", "https://people.com/thmb/NUxN-FQ1Zn41EZekBeShi09RHUY=/200x200/filters:no_upscale():max_bytes(150000):strip_icc()/janine-henni-57d47b03f624493fb0e9843f319ac2c8.jpg", "https://people.com/thmb/U-mjd6lmq1aWbjfplhLYd-PUdCc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/north-west-kris-jenner-111925-d915b2784e2a40d9a5c25751eb8e270a.jpg", "https://people.com/thmb/aKBLMgsxZsZYiOYP3_G6i_JF7Zs=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/kylie-jenner-travis-scott-4-6fa4d3e4ff784179aacea236e781a2ce.jpg", "https://people.com/thmb/JR82Mu-6q0OzCeFdxLskGpzAxIs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/kim-kardashian-halle-berry-111025-7f12d71762bf49758503724049c47962.jpg", "https://people.com/thmb/in5dXeL5ExalD4FL8RL-A75rKyk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(534x0:536x2)/slack-imgs-4331d91aac8a4a1798e32fe2a5bdf658.jpg", "https://people.com/thmb/HzUuaMgF2qPY-6qcXogzwtEqJyQ=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/kendall-jenner-khloe-kardashian-110525-b0c33360ee6142419bc7536bafbcbc04.jpg", "https://people.com/thmb/BB7vYW82d0oBPiFINmr76DIy2dY=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/ben-dreyfuss-richard-dreyfuss-111925-b670f8ab6f994d1d9dfce1fa0726d205.jpg", "https://people.com/thmb/XwQyixXA_011ylkQPHQEydOxz4Q=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/kardashian-kids-111723-b9dc7981e88e493aad4ae1113e3f4f65.jpg", "https://people.com/thmb/_vNXS4LEVAAMHKOchMD6HqZ0oac=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(627x0:629x2)/gettyimages-1097532190-2000-452792f90a974bc0a537f72f3e7ac904.jpg", "https://people.com/thmb/um9IVKmC_zD338Il-y7XFb8mvSc=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(734x0:736x2)/kylie-jenner-2-2-5daa0e3e49a74a79aa98d2e636746403.jpg", "https://people.com/thmb/BwyqG0krwdzC_4edDaz5tUq963k=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(374x0:376x2)/kylie-c-3962785a620447a78b8e46de021287ea.jpg", "https://people.com/thmb/mlo5ZanbrmJ2FAvaEEH7CBaMsS0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/kylie-and-travis-20-1-2000-4d87605daee742999e781c5131db0663.jpg", "https://people.com/thmb/RHokPgm8yu5TtnXKdejLaCCxc-0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Kris-Jenner-Birthday-Givenchy-Haute-Couture-by-Alexander-McQueen-1110125-tout-223790a0333a4c868955ad1eed6ffe50.jpg", "https://people.com/thmb/B76V10Pf5fRpFi1plso5AwqqI1k=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(912x0:914x2)/kylie-jenner-travis-scott-6-59ac25876166473585433b4df3afa3d4.jpg", "https://people.com/thmb/THhvOr3hMvKGC0mIyG4UCuB9OM4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/kendall-jenner-khloe-kardashian-110525-b0c33360ee6142419bc7536bafbcbc04.jpg", "https://people.com/thmb/HlKeX7joGrB0my1n64Btdg6d4v4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/BRAVOCON-Nikki-Hilton-and-Kathy-Hilton-111825-67976f68f6bd46b7b21dae9f66a4a3ba.jpg", "https://people.com/thmb/bAXfVUA_AALcxg3AQ5xGlIHnHhA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/kris-jenner-family-111125-c0a5fb56384347fba817e910cd1e554b.jpg", "https://people.com/thmb/Wsogw-ztsj5Pd8Jb5-9U3bTNjHA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/irina-shayk-lea-111425-841586f224054beeb943736aa7081b68.jpg", "https://people.com/thmb/5nK0-zQbLcB62AUVGpk5rEsmKIY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/kylie-jenner3-1-19b5cc9238a645e19560cf4e2f4d9013.jpg", "https://people.com/thmb/kgIbGiF2GazbUU1fzIXHW5p2CtM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/Kylie-Jenner-and-Travis-Scott38-1eb1794cb7494821b41d88d499a42f91.jpg", "https://people.com/thmb/YizZ5fGW9TvzN5bU-T9cx1TW6q4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/kylie-jenner-drake-1-2000-5ddde015001245fdadc5684b9b0e5852.jpg", "https://people.com/thmb/y_o8U-3aL1bb6sAi_ORxsCOuHEI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(366x0:368x2)/travis-kylie-stormi-74916a72d16541bd8e38b3a534e8833b.png", "https://people.com/thmb/TbejnnXGsJDDYFaXsGCuR8gLfZg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(739x0:741x2)/kylie-jenner-travis-scott-3-0fe6074fd2944c67abb340e66c482feb.jpg", "https://people.com/thmb/d3PWLHoWCeHClDxD2RIRcBAiNdw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/taylor-swift-travis-kelce-1-110725-5fda7e607bae456991bfb6908741fa04.jpg", "https://people.com/thmb/d9hNB3_Z_e1ZbYYPh1bo9bWjkRY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(745x164:747x166)/travis-scott-kylie-jenner-Timothee-Chalamet-072823-tout-b3b7610613dc40ca8f5d1dc1d03e5067.jpg", "https://people.com/thmb/C7iapU3Z2mTTK5RPD7JCX2ooSR0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Kim-Kardashian-Santa-Claus-outfit-2008-111325-tout-88dc502722464040b9815b5f6cdaef04.jpg", "https://people.com/thmb/ue4tnYcYbQOfvbcSiXSr_JgL3rE=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(633x0:635x2)/kylie-jenner-travis-scott-1-d19ce6dae5b0466ab542cfa6bd64e42f.jpg", "https://people.com/thmb/wL_QLCtcGfOlTUCXDEcw0MuRo8U=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/travis-scott-stormi-88facf6143744394833ae9b1139fa0c4.jpg", "https://people.com/thmb/0jKnK8bSyr7Fb41sXsNwd1jtAFM=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/jenna-bush-hager-minka-kelly-today-with-jenna-and-friends-111925-7e3c2b8605fe4a96a1b712c168083adb.jpg", "https://people.com/thmb/MWY_CtfddWs0ImzYO3BhOoDn-ko=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(963x0:965x2)/kylie-jenner7-3b9f7868fd86483f9220d5132ac5b662.jpg", "https://people.com/thmb/fz3Ng9xUAJaNultctB3AileBXGQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Kylie-Jenner-avril-lavigne-024-102325-c29b62b9d1a54848afc4ca47ead7ef1d.jpg", "https://people.com/thmb/zdFS1n2y9dNM-ndOtRjWY9G0kI4=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/Daniella-Karagach-111925-ls-1ffa54ba0f1749e380cfe98771660e16.jpg"], "top_img": "https://people.com/thmb/p59pCo344i0_rNdqBqhEEvBxyQM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(319x0:321x2)/people_social_image-60e0c8af9eb14624a5b55f2c29dbe25b.png", "keywords": [], "authors": ["Grace Gavilanes", "Grace Gavilanes Is A Former Associate Editor At People. She Left People In", "People Editorial Guidelines", "Aurelie Corinthios Is A Former Staff Editor At People. She Left People In", "Robyn Merrett Is A Former Associate Morning News Editor At People. She Left People In", "Charlotte Phillipp", "Michelle Lee", "Ingrid Vasquez", "Julia Moore", "Catherine Santino"], "canonical_link": "https://people.com/tv/kylie-jenner-travis-scott-relationship-timeline/", "title": "Kylie Jenner and Travis Scott's Relationship Timeline", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Kylie Jenner and Travis Scott were first linked in April 2017 before calling it quits in late 2022. Here is a complete timeline of their relationship.", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "PEOPLE", "sailthru.author": "Grace Gavilanes", "parsely-section": "Celebrity", "parsely-tags": "Entertainment,Celebrity Relationships,Music,Travis Scott,Kylie Jenner,Celebrity Parenting,Celebrity,Stormi Webster,The Scoop", "article": {"section": "People", "author": "https://www.facebook.com/peoplemag"}, "og": {"type": "article", "site_name": "People.com", "url": "https://people.com/tv/kylie-jenner-travis-scott-relationship-timeline/", "title": "Kylie Jenner and Travis Scott's Relationship Timeline", "description": "Kylie Jenner and Travis Scott were first linked in April 2017 before calling it quits in late 2022. Here is a complete timeline of their relationship.", "image": "https://people.com/thmb/p59pCo344i0_rNdqBqhEEvBxyQM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(319x0:321x2)/people_social_image-60e0c8af9eb14624a5b55f2c29dbe25b.png"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Kylie Jenner and Travis Scott's Relationship Timeline", "description": "Kylie Jenner and Travis Scott were first linked in April 2017 before calling it quits in late 2022. Here is a complete timeline of their relationship.", "image": "https://people.com/thmb/p59pCo344i0_rNdqBqhEEvBxyQM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(319x0:321x2)/people_social_image-60e0c8af9eb14624a5b55f2c29dbe25b.png"}, "vf": {"url": "https://people.com/tv/kylie-jenner-travis-scott-relationship-timeline/"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.146.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.146.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.146.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.146.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.146.0/icons/favicons/mstile-310x150.png", "fb": {"pages": 95926963131}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}