{"url": "https://www.indiewire.com/2018/04/2018-new-indie-movies-summer-releases-1201951208/", "text": "This week, IndieWire will be rolling out our annual Summer Preview, including offerings that span genres, niche offerings for dedicated fans, a closer look at festival favorites finally headed to a theater near you, and plenty of special attention to all the new movies you need to get through a jam-packed summer movie-going season. Check back throughout the week for a new look at the best the season has to offer, and clear your schedule, because we’re going to fill it right up.\n\nRead More: Check out our entire Summer Preview right here\n\nToday — 29 indie standouts and festival favorites (including exciting new offerings from some of our favorite directors, from Jason Reitman to Debra Granik, Spike Lee to Gus Van Sant, Paul Schrader to Desiree Akhavan, and plenty of rising stars) bound for a big screen near you.\n\n“Tully,” May 4\n\nA very different kind of adult fairy tale (one that frequently doubles as a feature-length advertisement for tubal ligation), “Tully” is a fantasy of the highest order; it might look like an episode of “This Is Us,” but this story is every bit as magical as “The Shape of Water.” Think of it as Diablo Cody’s modern take on “Mary Poppins”: What it lacks in musical sequences, it more than makes up for in sex scenes and Carly Rae Jepsen sing-alongs. Starring a convincingly worn-out Charlize Theron as a 40-year-old mother of two, “Tully” tells the story of a woman who’s at her wit’s end before a luminous young night nurse (Mackenzie Davis) rings her doorbell and restores her to life. Funnier than “Juno” and almost as ruthlessly honest as “Young Adult,” Cody’s third collaboration with director Jason Reitman is a razor-sharp movie about the trials of motherhood, and the clear and present danger of losing yourself once you start living for someone else. —DE\n\n“RBG,” May 4\n\nWhen she was growing up, Ruth Bader Ginsburg’s beloved mother Celia gave her two lessons to guide her through life: “Be a lady” and “Be independent.” That two-pronged approach appears to have influenced every aspect of the Supreme Court justice’s life, both personal and political. In Betsy West and Julie Cohen’s wide-ranging “RBG,” Ginsburg’s life — and its many lessons, both learned and taught — come to entertaining and energetic life. It’s a fist-pumping, crowd-pleasing documentary that makes one heck of a play to remind people of Ginsburg’s vitality and importance, now more than ever. “RBG” serves as a compelling Ginsburg primer, and West and Cohen are understandably interested in driving home just how fully she fought back sexism at every stage of her professional life, from her experience at Harvard Law to her first steps into full-time work to her Supreme Court appointment. Yet it’s the insights into her personal life that feel the most vital, moving “RBG” beyond the kind of information you could read on a Wikipedia page (as ably and entertainingly rendered as they may be on the big screen). -KE\n\n“Revenge,” May 11\n\nIf you love New French Extremity films like “High Tension” and “Martyrs,” and have been yearning for a grisly, blood-soaked heroine, have we got the film for you. “Revenge” stars Matilda Anna Ingrid Lutz, who transforms from sex kitten to badass on a mission to seek revenge against the men who wronged her. Jen (Lutz) is taken on a getaway by her lover, a married man, but is surprised when two of his friends also show up on the trip. The men have sinister intentions, but Jen isn’t going down without a fight and the guys have a big surprise waiting for them, as Jen morphs into a defiant Final Girl for the ages. Bloody, brutal, and unforgettable, “Revenge” is a great way to kick off the summer horror season. —JR\n\n“Beast,” May 11\n\nA stylish romantic noir, “Beast” debuted at TIFF last year and breaks out two well-matched UK actors, “Taboo” star Jessie Buckley and “Lovesick” regular Johnny Flynn. Rookie director Michael Pearce balances gorgeous scenery with two mysterious and charismatic yet unreliable characters who draw us into their love affair but are capable of…what, exactly? We are afraid to find out, and you should be, too. You’ll hear more from Pearce very soon, who’s been doing the LA meeting rounds. -AT\n\n“The Day After,” May 11\n\nSouth Korean favorite Hong Sang-soo has been unstoppable as of late. “The Day After” will be the director’s third in the U.S. in the last year alone, following “On the Beach Alone at Night” and “Claire’s Camera.” Hong’s latest premiered at Cannes last year and stars his recent muse and “The Handmaiden” star Kim Min-hee. The story, shot in black and white, centers on a dramatic love triangle between a man, his wife, and the unassuming woman his wife mistakes for being romantically involved with her husband. -ZS\n\n“Filmworker,” May 11\n\nAn absolute must-see documentary for fans of Stanley Kubrick, Tony Zierra’s “Filmworker” brings us into the life of the legendary and mysterious director’s long-time assistant Leon Vitali. Kubrick was both notoriously private and insistent on working with a tight-knit group of confidants and, for over two decades Vitali – who first worked with Kubrick as an actor in “Barry Lyndon” (1975) – was one of those who dedicated his life to serving the great master’s vision. Not only does “Filmworker” give cinephiles an unique view inside this closed-door world of Kubrick’s process, it paints a fascinating portrait of those lesser-known collaborators who enable such an obsessive artist – something that becomes particularly emotional resonant in the role Vitali played ushering “Eyes Wide Shut” to the finish line after Kubrick died in 1999. -CO\n\n“First Reformed,” May 18\n\nFor 40 years, Paul Schrader has made movies about serious, driven men isolated by deep-seated philosophical conflicts. From “American Gigolo” to “Mishima: A Life in Four Chapters” to “Affliction” — not to mention the “Taxi Driver” screenplay for which he’s best known — Schrader’s stone-faced protagonists are guided by a spiritual sense of purpose that reflects his Calvinist upbringing. With “First Reformed,” that obsession takes center stage in an absorbing late period achievement that brings Schrader’s talent back into focus. “First Reformed” consolidates the decades of bubbling guilt and frustration experienced by so many Schrader protagonists into a single enraged priest, played with brilliant layers of guilt and discontent by Ethan Hawke. Hawke’s character wrestles with an ecological crisis, his own faith, and his allegiance to his church in a suspenseful pileup of circumstances that keeps you guessing all the way through the shocking finale. It’s the best work in years for both men, a fascinating meditation on inner turmoil in which doing the right thing can lead down many wrong directions. –EK\n\n“Pope Francis – A Man of His Word,” May 18\n\nWim Wenders’ latest documentary, “Pope Francis – A Man of His Word,” will make its global debut at Cannes, but without the Pope. After producer Alessandro Lo Monaco worked closely with the Vatican on Gianfranco Pannone’s documentary about the Vatican’s Swiss Guard, the Vatican approached him about co-producing a documentary about outspoken Pope Francis, who seeks to communicate directly with the people. Lo Monaco turned to three-time Oscar nominee Wenders (documentaries “Buena Vista Social Club,” “Pina,” and “Salt of the Earth”), who devised a direct-to-camera visual and narrative concept to engage the audience face-to-face with the pope, creating a dialogue between him and a cross-section of humanity as he responds to questions from farmers, workers, refugees, children, the elderly, prison inmates, and those who live in favelas and migrant camps. Intended as a personal journey with the Pope rather than a biography, the movie films Pope Francis addressing his audience on the big subjects: life, death, social justice, immigration, ecology, wealth inequality, materialism, and the role of the family. -AT\n\n“How to Talk to Girls at Parties,” May 25 John Cameron Mitchell’s “How To Talk to Girls at Parties” premiered at the Cannes Film Festival last year and is finally coming to theaters this summer, thanks to A24. The film is adapted from the short story by Neil Gaiman and is kind of like a punk rock version of “Under the Skin.” Elle Fanning plays an alien who falls in love with humanity after befriending an English teenager obsessed with the punk scene. With its outlandish costumes and edgy storyline, the film finds Mitchell back in “Hedwig” mode following his dramatic last feature, “Rabbit Hole.” There’s also Nicole Kidman as an alien leader, so you know you can’t miss it. -ZS\n\n“American Animals,” June 1\n\n“You’ve seen too many movies.” It’s a line that’s almost as old as the movies themselves. And yet, in reality, very few people have actually seen too many movies. More often, the trouble is that someone hasn’t seen enough movies — or, in the case of Bart Layton’s “American Animals,” that they’ve seen just enough movies to get them into trouble. A slick, well-acted, and intensely self-reflexive docudrama from the director of “The Impostor,” “American Animals” stars Barry Keoghan and Evan Peters in the true story of some bored young film buffs who hatch a plan that’s too good to be true: They’re going to break into the special-collection section of the Transylvania University Library — home to some of the world’s rarest books — and steal millions of dollars worth of classic literature. You’ll be shocked to learn that things don’t go according to plan. A fun heist thriller with a seriously meta twist, “American Animals” is fiercely entertaining from start to finish, even when its characters are acting so dumb that you start to suspect they still have some more evolving to do. —DE\n\n“Hereditary,” June 8\n\nA24 has been at the forefront of some of the best indie horror releases in past years thanks to “The Witch” and “It Comes at Night,” and “Hereditary” looks to continue that tradition. After taking Sundance by storm earlier this year, “Hereditary” seems poised to conquer the summer horror box office, and rival “A Quiet Place” as one of the year’s best horror movies. After the death of her mother, Annie (Toni Collette) and her family discover dark secrets about their ancestry, but they soon discover you cannot outrun the things you have inherited, especially when they are sinister. Filled with chilling images (seriously, that man on fire!), a powerhouse performance by Collette, and one eerie little girl, “Hereditary” is sure to terrifying audiences, and be an unforgettable experience at the movies this summer. —JR\n\n“Hearts Beat Loud,” June 8\n\nIt’s hard to imagine being embarrassed to have Nick Offerman as your dad, but by sheer force of effortless charm, Kiersey Clemons (“Dope”) makes it look natural. From three-time Sundance alum Brett Haley (“The Hero,” “I’ll See You in My Dreams”), “Hearts Beat Loud” stars Offerman as a father who convinces his daughter into starting a band with him. Saddled with a struggling record shop, he pressures her to take a year off before college after their song receives minor attention on Spotify. The film was critically well-received out of Sundance, with many praising the heartwarming story and singling out Clemons’ performance. Toni Collette, Blythe Danner, and Ted Danson also star, with an original music by Keegan DeWitt. The film also boasts a tender teen romance between Clemons and Sasha Lane (“American Honey”), which is sure to interest anyone with an eye on the rising indie stars. -JD\n\n“Won’t You Be My Neighbor?,” June 8\n\n“When I was a boy and I would see scary things in the news, my mother would say to me, ‘Look for the helpers,’” wrote beloved children’s television host Fred Rogers in one of his 36 books. “‘You will always find people who are helping.’” Rogers died in 2003, leaving an imprint on the entire galaxy (an asteroid was named in his honor). Yet these words have been recirculated often in the intervening years, when the nation Rogers wished good morning for more than three decades awakes to another mass shooting or act of terrorism. And there’s more to come: a Tom Hanks-led biopic called “You Are My Friend” will follow this documentary from Oscar recipient and recent Cannes casualty Morgan Neville (“20 Feet from Stardom”). An ordained minister whose red cardigan now resides in the Smithsonian, Rogers harkens back to a simpler, gentler-seeming time – numerous audience members were overheard weeping during the tribute’s Sundance Film Festival premiere. Yet he confronted societal injustices everyday on his Emmy-winning “Mister Rogers’ Neighborhood” – where Michael Keaton was once a stagehand – phrasing lessons with great care that was never patronizing, even when conveyed a miniature trolley-ride away, by the puppet nobility of The Neighborhood of Make-Believe. -JM\n\nCheck out more summer preview picks on the next page.\n\nContinue Reading: 29 Indies and Festival Favorites You Can’t Miss This Summer Season\n\nNext »", "images": ["https://www.indiewire.com/wp-content/uploads/2018/04/american-animals.jpg?w=496&h=480&crop=1", "https://www.indiewire.com/wp-content/uploads/2018/01/sundancerbg-tpr-011718-1240x6981.jpg?w=780", "https://www.indiewire.com/wp-content/uploads/2018/04/beast.png?w=600&h=480&crop=1", "https://www.indiewire.com/wp-content/uploads/2018/04/beast-pc-kerry-brown.jpg?w=780", "https://deadline.com/wp-content/uploads/2025/09/mark-ruffalo.jpg?resize=232,175", "https://www.indiewire.com/wp-content/uploads/2018/01/37781692685_d9a7712589_o.jpg?w=780", "https://variety.com/wp-content/uploads/2025/11/RS-Talks.jpg?resize=232,175", "https://www.indiewire.com/wp-content/uploads/2018/04/femaledirected2018.jpg?w=300&h=168&crop=1", "https://www.indiewire.com/wp-content/uploads/2018/04/ant-man-and-the-wasp.jpeg?w=600&h=480&crop=1", "https://www.indiewire.com/wp-content/uploads/2025/11/RP_B7155.jpg?w=3000&h=2656&crop=1", "https://www.indiewire.com/wp-content/uploads/2024/12/TNB_05859_R-H-2024-1.jpeg?w=300&h=300&crop=1", "https://www.indiewire.com/wp-content/uploads/2018/03/screen-shot-2018-03-20-at-11-32-09-am.png?w=600", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.indiewire.com/wp-content/uploads/2018/04/indiessummer2018.jpg?w=650", "https://www.indiewire.com/wp-content/uploads/2018/04/screen-shot-2018-04-16-at-5-42-11-pm1.png?w=600&h=480&crop=1", "https://www.indiewire.com/wp-content/uploads/2018/04/indiessummer2018.jpg?w=986&h=616&crop=1", "https://www.indiewire.com/wp-content/uploads/2017/11/hbl_still_color_final-full-frame.jpg?w=780", "https://www.indiewire.com/wp-content/uploads/2025/11/RP_B7417.jpg?w=1200&h=800&crop=1", "https://www.indiewire.com/wp-content/uploads/2025/11/anaconda.jpg?w=300&h=300&crop=1", "https://www.rollingstone.com/wp-content/uploads/2025/11/project-veritas-serial-fraudster.jpg?resize=232,175", "https://www.indiewire.com/wp-content/uploads/2025/11/john-and-yoko.jpg?w=770&h=980&crop=1", "https://www.indiewire.com/wp-content/uploads/2025/11/thoughts-and-prayers-hbo.jpeg?w=300&h=300&crop=1", "https://www.indiewire.com/wp-content/uploads/2017/09/revenge.jpg?w=780", "https://www.indiewire.com/wp-content/uploads/2017/08/first-reformed.jpg?w=780", "https://www.sportico.com/wp-content/uploads/2025/11/Sac_Sabonis.png?resize=232,175", "https://www.indiewire.com/wp-content/uploads/2025/01/Apple_TV_Your_Friends_and_Neighbors_key_art_graphic_header_16_9_show_home.jpg.large_2x.jpg?w=300&h=300&crop=1", "https://www.indiewire.com/wp-content/uploads/2018/01/tully-charlize-theron-today-191101-tease-03_2852959446ae0e3b7eeef46253ba76fd.jpg?w=780", "https://www.indiewire.com/wp-content/uploads/2025/11/GettyImages-2246549744.jpg?w=3000&h=3000&crop=1", "https://www.indiewire.com/wp-content/uploads/2025/01/Screenshot-2025-01-01-at-8.32.46 PM.png?w=300&h=300&crop=1", "https://www.indiewire.com/wp-content/uploads/2017/05/1ac64290efa5c8bf4cafb1b5dc9512d4bf221d7c.jpg?w=780", "https://www.indiewire.com/wp-content/uploads/2025/11/RP_B7173.jpg?w=1200&h=800&crop=1", "https://www.indiewire.com/wp-content/uploads/2025/11/The-Lowdown-Ethan-Hawke-interview.jpg?w=1200&h=800&crop=1", "https://www.indiewire.com/wp-content/uploads/2018/01/screen-shot-2018-01-29-at-1-28-03-pm.png?w=300&h=168&crop=1", "https://www.indiewire.com/wp-content/uploads/2018/01/group_table_029.jpg?w=780", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c4=&cv=3.9&cj=1"], "top_img": "https://www.indiewire.com/wp-content/uploads/2018/04/indiessummer2018.jpg?w=650", "keywords": [], "authors": ["Kate Erbland Eric Kohn David Ehrlich Anne Thompson Jenna Marotta Zack Sharf Jamie Righetti Chris O'Falt"], "canonical_link": "https://www.indiewire.com/features/general/2018-new-indie-movies-summer-releases-1201951208/", "title": "29 Indies and Festival Favorites You Can’t Miss This Summer Season", "meta_data": {"description": "Including new films from Jason Reitman, Debra Granik, Spike Lee, Gus Van Sant, Paul Schrader, Desiree Akhavan, and plenty of rising stars.", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=1400654071", "generator": "WordPress 6.7.4", "author": "Kate Erbland,Eric Kohn,David Ehrlich,Anne Thompson,Jenna Marotta,Zack Sharf,Jamie Righetti,Chris O'Falt", "og": {"type": "article", "title": "29 Indies and Festival Favorites You Can’t Miss This Summer Season", "url": "https://www.indiewire.com/features/general/2018-new-indie-movies-summer-releases-1201951208/", "description": "Including new films from Jason Reitman, Debra Granik, Spike Lee, Gus Van Sant, Paul Schrader, Desiree Akhavan, and plenty of rising stars.", "site_name": "IndieWire", "image": {"identifier": "https://www.indiewire.com/wp-content/uploads/2018/04/indiessummer2018.jpg?w=650", "width": 650, "height": 406, "alt": "2018's New Indie Movies: 29 Movies You Need to See This Summer"}, "locale": "en_US"}, "article": {"published_time": "2018-04-19T15:15:43+00:00", "modified_time": "2018-06-04T18:46:22+00:00"}, "twitter": {"description": "Including new films from Jason Reitman, Debra Granik, Spike Lee, Gus Van Sant, Paul Schrader, Desiree Akhavan, and plenty of rising stars.", "site": "@IndieWire", "creator": "@katerbland", "card": "summary_large_image", "title": "29 Indies and Festival Favorites You Can’t Miss This Summer Season", "image": "https://www.indiewire.com/wp-content/uploads/2018/04/indiessummer2018.jpg?w=650"}, "msapplication-TileImage": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=270", "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1524196800.0, "source": "https://www.indiewire.com", "summary": ""}