{"url": "https://wellnessmama.com/121495/apple-cider-vinegar-mother/", "text": "I use apple cider vinegar a lot. From making cleaning recipes to its many health benefits, ACV is a staple in our home.\n\nFor cleaning, any vinegar will do. In food or drink recipes though, I always use an organic and unrefined version of apple cider vinegar with “the Mother.”\n\nOver the years, my mentions of “vinegar with the mother,” have gotten a lot of questions. Readers ask what “the mother” means and how to find it, so I wanted to fully explain exactly what it is and why it is important.\n\nHere’s why:\n\nWhat is Apple Cider Vinegar with The Mother?\n\nIn short, it is apple cider vinegar that still has the culture of beneficial bacteria that turns regular apple cider into vinegar in the first place. This is similar to the SCOBY (also called a “mother”) in Kombucha making.\n\nPasteurized vs. Unrefined & Unfiltered Apple Cider Vinegar\n\nIn ACV particularly, “the mother” is a complex structure of beneficial acids that seem to have health benefits. Unrefined vinegars have a murky appearance and typically still contain the mother culture. Clear and pasteurized vinegars typically do not contain the mother culture and don’t carry the same benefits.\n\nRefined and clear vinegars are great for cleaning as they don’t leave residue. Raw, unfiltered and unrefined versions contain many more beneficial properties for culinary uses.\n\nHow Apple Cider Vinegar is Made\n\nThe word vinegar comes from the latin words vinum (wine) and acer (sour) and in essence vinegar is just that: sour wine.\n\nOrganic unfiltered vinegars have a long history of use, having been discovered thousands of years ago!\n\nFolklore claims that Cleopatra once dissolved a pearl in vinegar and drank it in order to win a bet with Marcus Antonius (Marc Antony). She wagered that she could spend a fortune on a single meal. Vinegar is mention in the Bible and Hippocrates often recommended it for a variety of ailments.\n\nAny carbohydrate or alcohol in theory can become vinegar. Carbohydrates are made into an alcohol through a process of careful fermentation.\n\nThe (non-distilled) alcohol in beer, wine or cider is exposed to air and a group of bacteria (acetobacter) that convert the alcohols into acetic acid.\n\nIn unfiltered organic apple cider vinegar, this beneficial group of bacteria and acids remains and creates the murky web-like “Mother.”\n\nThis type of vinegar gained commercial popularity in the 1930s:\n\nIn 1394, a group of French vintners developed a continuous method for making vinegar called the Orleans method. In this method, oak barrels were used as fermentation vessels and the vinegar was siphoned off through a spigot at the bottom of the barrel. About 15% of the vinegar was left behind which contained the “mother of vinegar” and its concentrated bacteria floating on top. A new batch of cider or wine was carefully added to the barrel and was quick started by the remaining vinegar. (source)\n\nThis is similar to the process for continuous brew kombucha, and at the time, it allowed these Frenchmen to satisfy the growing market for vinegars. They went on to create infused vinegars with herbs, spices, and fruits to meet the growing demand.\n\nBenefits of The Mother in Apple Cider Vinegar\n\nAs with many things in nature, vinegar in its unfiltered, unadulterated and unrefined form has a variety of benefits that are lost when it is filtered and heated.\n\nThe acetic acid created in the secondary fermentation process is a component of the finished vinegar and has a host of benefits on its own. Certain medications contain acetic acid in concentrated form and studies have looked at the role of acetic acid in balancing blood sugar, blood pressure and dissolving cholesterol deposits in arteries.\n\nMore research is needed, but acetic acid in vinegar has a long history of use in alternative medicine.\n\nCleaning and Preserving\n\nThe high acid content in vinegar makes it a powerful preservative for food and it is often also recommended in cleaning for this reason. In fact, historically, vinegars were added to water to make the water more drinkable.\n\nIt is important to note that vinegar has some limitations as a natural cleaner and that it is not a registered disinfectant for disinfecting uses. A hydrogen peroxide based formula is a better choice and strong natural soaps (like this one) are better for degreasing.\n\nDigestive Support\n\nDigestive problems and acid reflux can often be from too little stomach acid rather than too much. Apple cider vinegar is a simple and really inexpensive remedy for low stomach acid. Personally, I’ve found relief from minor heartburn by adding 1 teaspoon of vinegar to water and drinking.\n\nImmune Support\n\nACV also has a long history of use for immune support. According to legend, thieves during the bubonic plague survived by making an herbal vinegar with herbs like rosemary, thyme and lavender.\n\nThe “mother,” which provides immune boosting properties on its own, also allows the vinegar to get stronger over time and maintain its beneficial properties.\n\nBeautiful Hair\n\nThe beneficial acids in the “mother” of apple cider vinegar are also great for hair, and this is one reason that ACV is often recommended as a hair rinse for conditioning hair and increasing shine.\n\nFor Healthy Skin\n\nUnrefined Apple Cider Vinegar is also often used in skin remedies and beauty recipes. It can be used to help sunburns, skin rashes and mosquito bites (I typically dilute 50:50 with water).\n\nBlood Sugar Balance\n\nUnrefined apple cider vinegar, high in beneficial compounds, is also known for its ability to help keep blood sugar in check. It isn’t a wonder drug, but studies have shown that it can help lower blood sugar and improve insulin sensitivity. (source)\n\nOther studies have shown the benefits of ACV in helping improve cholesterol levels, and support heart health.\n\nWhere to buy Apple Cider Vinegar with the Mother\n\nMost grocery stores should carry it, or you can purchase it online on as well.\n\nApple Cider Vinegar with The Mother: Bottom Line\n\nApple cider vinegar with the mother is simply unrefined, unpasteurized and unfiltered ACV. The “mother” is a colony of beneficial bacteria, similar to a Kombucha SCOBY, that helps create vinegar through a secondary fermentation process.\n\nVinegar is high in acetic acid and other beneficial compounds. Unfiltered apple cider vinegar may have more benefits that filtered and heated types of vinegar (though those types can work well for cleaning).\n\nDoes your vinegar have a mother?", "images": ["https://wellnessmama.com/wp-content/uploads/What-is-the-mother-in-apple-cider-vinegar.jpg", "https://secure.gravatar.com/avatar/5583be10ef7740f95c9a672282ebe16b7bdbab62071374a6ddcbd2b282732eb6?s=48&d=https%3A%2F%2Fwellnessmama.com%2Fwp-content%2Fthemes%2Fwellnessmama%2Fimages%2Favatar-default.png&r=g", "https://secure.gravatar.com/avatar/db7939633df207610341721fe0f80b50b141e14f1918b330fdd075a21b103bcb?s=48&d=https%3A%2F%2Fwellnessmama.com%2Fwp-content%2Fthemes%2Fwellnessmama%2Fimages%2Favatar-default.png&r=g", "https://wellmama.wpenginepowered.com/wp-content/uploads/seven-easy-habits-ipad.png", "https://wellnessmama.com/wp-content/uploads/Wellness-Mama-Cookbook-Blog-Ad-Nov.png", "https://secure.gravatar.com/avatar/441f5ddfd1dc5dd7b80a418b25f45f1dd086e08bbbef9668c42bbc3dca3cc934?s=48&d=https%3A%2F%2Fwellnessmama.com%2Fwp-content%2Fthemes%2Fwellnessmama%2Fimages%2Favatar-default.png&r=g", "https://secure.gravatar.com/avatar/1f931086f536d76952140ef0bf77468fd9415e7d402d821f3d2ceb13215c3f7a?s=48&d=https%3A%2F%2Fwellnessmama.com%2Fwp-content%2Fthemes%2Fwellnessmama%2Fimages%2Favatar-default.png&r=g", "https://secure.gravatar.com/avatar/50ae3c3b46b0b07384e9b8f004ea6856d20d96eaa800a787cdc684c3fc8b2077?s=48&d=https%3A%2F%2Fwellnessmama.com%2Fwp-content%2Fthemes%2Fwellnessmama%2Fimages%2Favatar-default.png&r=g", "https://secure.gravatar.com/avatar/ce174cc8830c10b4e2241c9f9224309c4901d2e70808360e3f1abbc6a941bdb6?s=48&d=https%3A%2F%2Fwellnessmama.com%2Fwp-content%2Fthemes%2Fwellnessmama%2Fimages%2Favatar-default.png&r=g", "https://secure.gravatar.com/avatar/3c187da66d156b702658d81b818217bb30d5d8dfea4140c4a0f0315213f83e5f?s=48&d=https%3A%2F%2Fwellnessmama.com%2Fwp-content%2Fthemes%2Fwellnessmama%2Fimages%2Favatar-default.png&r=g", "https://secure.gravatar.com/avatar/847477fa7217490ded8d820493f945656fb5851356548ecce7450e288ccf303f?s=48&d=https%3A%2F%2Fwellnessmama.com%2Fwp-content%2Fthemes%2Fwellnessmama%2Fimages%2Favatar-default.png&r=g", "https://secure.gravatar.com/avatar/8919c8f698179541757298c19a5b7b6b5739f2edea983a448f93f887a097605a?s=48&d=https%3A%2F%2Fwellnessmama.com%2Fwp-content%2Fthemes%2Fwellnessmama%2Fimages%2Favatar-default.png&r=g", "https://secure.gravatar.com/avatar/ac48fa6e340a667e5e0eb225e7261b6d2d9d388575b7edcea0b0f5353d4c31fa?s=48&d=https%3A%2F%2Fwellnessmama.com%2Fwp-content%2Fthemes%2Fwellnessmama%2Fimages%2Favatar-default.png&r=g", "https://secure.gravatar.com/avatar/ed2ab665c9ef809b0e8e4c6ab46556369efc7051ae0562f78f288d4c90dc7a66?s=80&d=https%3A%2F%2Fwellnessmama.com%2Fwp-content%2Fthemes%2Fwellnessmama%2Fimages%2Favatar-default.png&r=g", "https://secure.gravatar.com/avatar/e45048de33e977ab53fef4ed8c180a43b72d5d133c4532018bcb35fac1c48fb5?s=48&d=https%3A%2F%2Fwellnessmama.com%2Fwp-content%2Fthemes%2Fwellnessmama%2Fimages%2Favatar-default.png&r=g", "https://wellnessmama.com/wp-content/uploads/site-logo.svg", "https://secure.gravatar.com/avatar/4b2e8dfe1bfda1a4870e708cf976faa6271de0fc7198aa07c2985276a5eef3ba?s=48&d=https%3A%2F%2Fwellnessmama.com%2Fwp-content%2Fthemes%2Fwellnessmama%2Fimages%2Favatar-default.png&r=g", "https://secure.gravatar.com/avatar/4f0e33e0fb5da2d6453e26383d6647a9749df1b716120f0338c586baca77d389?s=48&d=https%3A%2F%2Fwellnessmama.com%2Fwp-content%2Fthemes%2Fwellnessmama%2Fimages%2Favatar-default.png&r=g", "https://secure.gravatar.com/avatar/ed2ab665c9ef809b0e8e4c6ab46556369efc7051ae0562f78f288d4c90dc7a66?s=48&d=https%3A%2F%2Fwellnessmama.com%2Fwp-content%2Fthemes%2Fwellnessmama%2Fimages%2Favatar-default.png&r=g", "https://secure.gravatar.com/avatar/a0f9d8ef84a5e5cf13ab92cf70291bef84b9ef1d551f452ef40b8d7165dc850f?s=48&d=https%3A%2F%2Fwellnessmama.com%2Fwp-content%2Fthemes%2Fwellnessmama%2Fimages%2Favatar-default.png&r=g"], "top_img": "https://wellnessmama.com/wp-content/uploads/What-is-the-mother-in-apple-cider-vinegar.jpg", "keywords": [], "authors": ["Katie Wells", "Hillel Batafik"], "canonical_link": "https://wellnessmama.com/natural-home/apple-cider-vinegar-mother/", "title": "What is Apple Cider Vinegar with The Mother?", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Apple cider vinegar with the mother is unrefined ACV that contains beneficial bacteria and acetic acid, making it good for digestion & other uses.", "og": {"locale": "en_US", "type": "article", "title": "What is Apple Cider Vinegar with The Mother?", "description": "Apple cider vinegar with the mother is unrefined ACV that contains beneficial bacteria and acetic acid, making it good for digestion & other uses.", "url": "https://wellnessmama.com/natural-home/apple-cider-vinegar-mother/", "site_name": "Wellness Mama®", "image": {"identifier": "https://wellnessmama.com/wp-content/uploads/What-is-the-mother-in-apple-cider-vinegar.jpg", "width": 740, "height": 493, "type": "image/jpeg"}}, "article": {"publisher": "https://www.facebook.com/WellnessMama", "author": "https://www.facebook.com/profile.php?id=100009065413850", "published_time": "2016-06-28T15:47:16+00:00", "modified_time": "2019-07-30T15:56:18+00:00"}, "author": "Katie Wells", "twitter": {"card": "summary_large_image", "creator": "@wellnessmama", "site": "@wellnessmama", "label1": "Written by", "data1": "Katie Wells", "label2": "Est. reading time", "data2": "5 minutes"}, "generator": "Site Kit by Google 1.166.0", "msapplication-TileImage": "https://wellnessmama.com/wp-content/uploads/site-icon.png"}, "movies": [], "publish_date": 1467128836.0, "source": "https://wellnessmama.com", "summary": ""}