{"url": "https://www.nydailynews.com/entertainment/movies/selena-gomez-mom-told-not-work-woody-allen-article-1.3760060", "text": "Selena Gomez’s mother says she urged her daughter not to work with accused child abuser Woody Allen on his latest film — to no avail.\n\nMandy Teefey made that revelation in a since-deleted Instagram comment Monday after a fan asked her to make Gomez apologize for starring in Allen’s upcoming movie, “A Rainy Day in New York.”\n\nMandy Teefey tried to tell Selena Gomez not to work with Woody Allen.\n\n“Sorry, No one can make Selena do anything she doesn’t want to. I had a long talk with her about not working with him and it didn’t click,” Teefey commented below an Instagram post on her account. “Her team are amazing people. There is no fall person here. No one controls her. She makes all her own decisions. No matter how hard you try to advise. It falls on deaf ears.”\n\nAllen is accused by his daughter, Dylan Farrow, of molesting her when she was 7 years old. Those allegations were investigated by Connecticut police as well as the Child Sexual Abuse Clinic of the Yale-New Haven Hospital, though charges were never filed despite a state attorney determining there was “probable cause” to prosecute, according to The New York Times.\n\nFarrow brought renewed attention to the allegations when she reiterated those claims against Allen in a 2014 open letter.\n\nGomez has not expounded on her decision to join the movie directed by Allen, which does not have a premiere date. She told Billboard last year that she didn’t know how to reply when asked if she considered the accusations against Allen before signing on for the film.\n\n“To be honest, I’m not sure how to answer — not because I’m trying to back away from it,” Gomez told the music outlet. “(The Harvey Weinstein scandal) actually happened right after I had started (the Allen film). They popped up in the midst of it. And that’s something, yes, I had to face and discuss. I stepped back and thought, ‘Wow, the universe works in interesting ways.'”\n\nAt least three stars of the movie — Timothee Chalamet, Rebecca Hall and Griffin Newman — have vowed to donate their income from the movie to different charities supporting women and the Time’s Up movement.\n\nGomez stars in Woody Allen’s new film “A Rainy Day in New York.”\n\nMeanwhile Tuesday, actor Alec Baldwin tweeted his support for Allen.\n\n“Woody Allen was investigated forensically by two states (NY and CT) and no charges were filed,” he wrote. “The renunciation of him and his work, no doubt, has some purpose. But it’s unfair and sad to me. I worked w WA 3 times and it was one of the privileges of my career.”\n\nTeefey’s comment about her daughter working with Allen comes during the same week where she told Gossip Cop she’s “not happy” about Gomez rekindling her relationship with on-and-off boyfriend Justin Bieber.", "images": ["https://www.nydailynews.com/wp-content/uploads/migration/2018/01/16/2RTSAQF22JPHOR4BI7ECP72DZU.jpg?w=1024&h=670", "data:image/webp;base64,UklGRiQAAABXRUJQVlA4IBgAAAAwAQCdASoBAAEAAwA0JaQAA3AA/v3AgAA=", "https://www.nydailynews.com/wp-content/uploads/2023/08/New_York_Daily_News_nydredblack-1.svg"], "top_img": "https://www.nydailynews.com/wp-content/uploads/migration/2018/01/16/2RTSAQF22JPHOR4BI7ECP72DZU.jpg?w=1024&h=670", "keywords": [], "authors": ["Peter Sblendorio"], "canonical_link": "https://www.nydailynews.com/2018/01/16/selena-gomezs-mom-told-her-not-to-work-with-woody-allen/", "title": "Selena Gomez’s mom told her not to work with Woody Allen", "meta_data": {"application-name": "newyorkdailynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "robots": "max-image-preview:large", "tdm-reservation": 1, "mrf": {"authors": "Peter Sblendorio", "canonical": "https://www.nydailynews.com/2018/01/16/selena-gomezs-mom-told-her-not-to-work-with-woody-allen/"}, "description": "Gomez has drawn backlash for starring in the scandal-scarred  Allen's new film, \"A Rainy Day in New York.\"", "generator": "WordPress 6.8.3", "og": {"type": "article", "title": "Selena Gomez’s mom told her not to work with Woody Allen", "url": "https://www.nydailynews.com/2018/01/16/selena-gomezs-mom-told-her-not-to-work-with-woody-allen/", "description": "Selena Gomez’s mother says she urged her daughter not to work with accused child abuser Woody Allen on his latest film — to no avail. Mandy Teefey made that revelation in a since-delete…", "site_name": "New York Daily News", "image": {"identifier": "https://www.nydailynews.com/wp-content/uploads/migration/2018/01/16/2RTSAQF22JPHOR4BI7ECP72DZU.jpg?w=1024&h=670", "width": 1024, "height": 670}, "locale": "en_US"}, "article": {"published_time": "2018-01-16T13:40:47+00:00", "modified_time": "2018-04-07T08:21:56+00:00"}, "twitter": {"text": {"title": "Selena Gomez’s mom told her not to work with Woody Allen"}, "image": "https://www.nydailynews.com/wp-content/uploads/migration/2018/01/16/2RTSAQF22JPHOR4BI7ECP72DZU.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.nydailynews.com/wp-content/uploads/2023/09/cropped-DailyNewsCamera-7.webp?w=270"}, "movies": [], "publish_date": 1516110047.0, "source": "https://www.nydailynews.com", "summary": ""}