{"url": "https://www.bbc.com/news/entertainment-arts-42164798", "text": "Meghan Markle was written out of Suits a year ago\n\n29 November 2017 Share Save Share Save\n\nWhy Meghan Markle was written out of Suits\n\nThe creator of Suits has said the decision was taken to write Meghan Markle's character out of the TV series as long as a year ago.\n\nAaron Korsh told Radio 4's Today programme he \"took a gamble\" on Ms Markle's relationship with Prince Harry working out.\n\nMs Markle plays lawyer Rachel Zane in the American legal drama.\n\nShe confirmed this week that she would leave the show after announcing her engagement to the prince.\n\n'Two people in love'\n\nIn the interview, Korsh said: \"I knew from a year ago that this relationship was burgeoning.\n\n\"And I had a decision to make because I didn't want to intrude and ask her, 'hey what's going on and what are you going to do?'.\n\n\"So collectively with the writers, we decided to take a gamble that these two people were in love and it was going to work out.\"\n\nGetty Images Aaron Korsh says he anticipated Meghan Markle's departure from Suits\n\nKorsh added: \"What we decided to do (was to) say, 'look, I would rather have good things happen to Meghan in her life' - which would likely mean her leaving the show.\n\n\"So let's plan on that and it's much easier to undo that, if it came to it, than to just plan on her staying forever and then finding out she's going to go.\n\n\"And the only way to write a character out like that would be if they got hit by a bus or something.\"\n\nMs Markle has played the paralegal turned lawyer since the first series of Suits in 2011.\n\nThe current series will be her last and - in instance of art imitating life - will show her character marrying boyfriend Mike Ross, played by Patrick J Adams.\n\nAfter hearing news of the engagement, Adams joked on Twitter he thought his on-screen partner had just popped out for milk.\n\nAllow X content? X’s cookie policy privacy policy ‘accept and continue’. This article contains content provided by X . We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readandbefore accepting. To view this content choose Accept and continue\n\nHe later posted a glowing tribute to Ms Markle, telling Prince Harry: \"Your Royal Highness, you are a lucky man and I know your long life together will be joyful, productive and hilarious. Meghan, so happy for you, friend. Much love.\"\n\nThe royal wedding will take place at Windsor Castle in May.\n\nAsked how he thought Ms Markle would deal with the pressure of royal life, Korsh said: \"She is just a natural in front of the camera, and her intelligence and poise... I mean if anyone could handle it I'd say it was Meghan.\"\n\nOn the couple's engagement, he added that \"the whole thing is like a fairytale\" describing it as \"like a dream come true\".", "images": ["https://ichef.bbci.co.uk/news/624/mcs/media/images/76020000/jpg/_76020974_line976.jpg", "https://ichef.bbci.co.uk/news/480/cpsprodpb/168A8/production/_98982329_aaron-korsh.jpg.webp", "https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png", "https://ichef.bbci.co.uk/news/1024/branded_news/1791A/production/_98983569_meghan-markle.jpg"], "top_img": "https://ichef.bbci.co.uk/news/1024/branded_news/1791A/production/_98983569_meghan-markle.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bbc.com/news/entertainment-arts-42164798", "title": "Meghan Markle was written out of Suits a year ago", "meta_data": {"viewport": "width=device-width", "page.section": "Culture", "page.subsection": "Entertainment_and_arts", "og": {"title": "Meghan Markle was written out of Suits a year ago", "description": "The creator of the TV show says he \"took a gamble\" on her relationship with Prince Harry working out.", "image": {"identifier": "https://ichef.bbci.co.uk/news/1024/branded_news/1791A/production/_98983569_meghan-markle.jpg", "alt": "Meghan Markle"}}, "twitter": {"title": "Meghan Markle was written out of Suits a year ago", "description": "The creator of the TV show says he \"took a gamble\" on her relationship with Prince Harry working out.", "image": {"src": "https://ichef.bbci.co.uk/news/1024/branded_news/1791A/production/_98983569_meghan-markle.jpg", "alt": "Meghan Markle"}, "card": "summary_large_image"}, "description": "The creator of the TV show says he \"took a gamble\" on her relationship with Prince Harry working out.", "msapplication-TileColor": "#da532c", "theme-color": "#ffffff", "robots": "NOODP, NOYDIR", "apple-itunes-app": "app-id=364147881, app-argument=https://www.bbc.com/news/entertainment-arts-42164798", "version": "web-2.33.2-3", "al": {"ios": {"url": "bbcx://news/entertainment-arts-42164798", "app_store_id": 364147881, "app_name": "BBC: World News & Stories"}, "android": {"url": "bbcx://news/entertainment-arts-42164798", "app_name": "BBC: World News & Stories", "package": "bbc.mobile.news.ww"}, "web": {"url": "https://bbc.com/news/entertainment-arts-42164798"}}, "cXenseParse": {"pageclass": "article", "publishtime": "2017-11-29T11:34:19.000Z"}, "article": {"modified_time": "2017-11-29T11:34:19.000Z"}, "next-head-count": 41}, "movies": [], "publish_date": null, "source": "https://www.bbc.com", "summary": ""}