{"url": "https://www.huffingtonpost.com/entry/la-la-anthony-explains-why-she-hasnt-divorced-carmelo-anthony_us_59551be3e4b0da2c7321bfe1", "text": "La La Anthony isn’t ready to call it quits with long-time beau Carmelo Anthony.\n\nThe television personality stopped by “The Wendy Williams Show” on Tuesday to promote the new season of “Power,” the Starz show in which she stars. When the host asked about the status of her split from the NBA star, La La said she did not plan to file for divorce just yet.\n\n“Not right now, I’m not,” the 38-year-old said. “You know marriages are tough, and you know that. We all know that. It’s filled with ups and downs. We are just going through a time right now.”\n\nAdvertisement\n\nThe Puerto Rican actress, who tied the knot with Carmelo in 2010, said the most important thing for her was her 10-year-old son.\n\n″[Carmelo] and I are the best of friends and our number one commitment is to our son, Kiyan,” she continued. “I would absolutely never say a bad thing about my husband. That’s my son’s father and he is an amazing dad. I could not ask for a better dad.”\n\nIn April, TMZ reported that La La and Carmelo had split and were living apart and that the decision was allegedly amicable. Rumors that Carmelo had cheated also began to circulate shorty after.\n\nAdvertisement\n\nWilliams also asked La La to comment on the loving photo Carmelo shared via Instagram on Monday, in which he sent a birthday message to his estranged wife saying she was his “earth.”\n\nA post shared by Carmelo Anthony (@carmeloanthony) on Jun 25, 2017 at 9:53pm PDT\n\nWhen the host said the caption sounded like Carmelo wanted her back, the actress responded: “Why wouldn’t he?”\n\nAdvertisement\n\nAs far as whether there’s still a chance to work things out, La La said she didn’t know what would happen in the future but that what she and Carmelo have shared could not be erased.\n\n“We are the best of friends, I’ve been with Melo since he was 19 years old,” she said. “You’re not with somebody for that long and it just goes out the window. I love him with all of my heart.”\n\nCelebrate Truth This Season Your Support Fuels Our Mission Your Support Fuels Our Mission The holidays can get loud. But some stories cut through the noise -- the ones that make sense of the chaos and hold power to account. Support the newsroom built on clarity, accountability, and a healthy dose of reality. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. “Our fierce, independent reporting and unvarnished perspective hold power to account and inform millions of readers. Please support this hard-hitting journalism.” Monthly Annually SAVE 16% Support $5/month (about $0.17/day) Silver Huffposter 🤍 Monthly recurring supporter-only email\n\nFewer requests for financial support Support $10/month (about $0.33/day) Gold Everything in the Silver Tier\n\nAd-free access on the HuffPost website OR HuffPost apps\n\nSay goodbye to annoying video interruptions while you read. No more autoplay videos. Support $20/month (about $0.67/day) Platinum HuffPoster 🏆 Everything in the Gold Tier\n\nAd-free access on the HuffPost website AND HuffPost apps\n\nEarly access to new features\n\nMembership to Platinum Club focus group Make a One Time Contribution Support HuffPost Already a member? Log in to hide these messages.", "images": ["https://img.huffingtonpost.com/asset/559d3cdd1700001600b065cf.jpg?ops=100_100", "https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNkYAAAAAYAAjCB0C8AAAAASUVORK5CYII=", "https://img.huffingtonpost.com/asset/59552cc82100003700fc4aea.jpeg?ops=1200_630", "https://img.huffingtonpost.com/asset/691c87541700009d2b9c5f37.jpg?ops=50_50"], "top_img": "https://img.huffingtonpost.com/asset/59552cc82100003700fc4aea.jpeg?ops=1200_630", "keywords": [], "authors": ["Reporter", "Whitney Snyder", "Editor-In-Chief Huffpost"], "canonical_link": "https://www.huffpost.com/entry/la-la-anthony-explains-why-she-hasnt-divorced-carmelo-anthony_n_59551be3e4b0da2c7321bfe1", "title": "La La Anthony On Why She Hasn't Divorced Carmelo Anthony", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "It's not over, yet.", "keywords": "Celebrities,sports,Carmelo Anthony,La La Anthony,Latino Voices,Black Voices,Women,Entertainment,Divorce,Sports", "fb": {"app_id": 46744042133}, "og": {"title": "La La Anthony On Why She Hasn't Divorced Carmelo Anthony", "type": "article", "image": {"identifier": "https://img.huffingtonpost.com/asset/59552cc82100003700fc4aea.jpeg?ops=1200_630", "url": "https://img.huffingtonpost.com/asset/59552cc82100003700fc4aea.jpeg?ops=1200_630", "type": "image/jpeg", "width": 1200, "height": 630}, "url": "https://www.huffpost.com/entry/la-la-anthony-explains-why-she-hasnt-divorced-carmelo-anthony_n_59551be3e4b0da2c7321bfe1", "site_name": "HuffPost", "locale": "en_US", "description": "It's not over, yet."}, "article": {"tag": "Celebrities,sports,Carmelo Anthony,La La Anthony,Latino Voices,Black Voices,Women,Entertainment,Divorce,Sports", "section": "Latino Voices", "published_time": "2017-06-29T18:07:47Z", "modified_time": "2017-06-29T18:07:47Z"}, "twitter": {"card": "summary_large_image", "site": "@LatinoVoices", "title": "La La Anthony On Why She Hasn't Divorced Carmelo Anthony", "image": {"identifier": "https://img.huffingtonpost.com/asset/59552cc82100003700fc4aea.jpeg?ops=1200_630", "width": 1200, "height": 630}, "description": "It's not over, yet."}, "al": {"ios": {"url": "huffpostnews:///?editionID=us&entryID=us_59551be3e4b0da2c7321bfe1", "app_store_id": 306621789, "app_name": "HuffPost"}}, "bingbot": "noarchive", "robots": "max-snippet:-1,max-image-preview:large,max-video-preview:-1", "google-site-verification": "97Mj-wW7u8U1NOnkW1rfH-I1kgO0-a9YsgoesOk41R8"}, "movies": ["https://www.youtube.com/embed/LynjN_rtaLg?rel=0&showinfo=0&controls=2&enablejsapi=1"], "publish_date": 1498759667.0, "source": "https://www.huffingtonpost.com", "summary": ""}