{"url": "https://en.wikipedia.org/wiki/Head_of_the_Commonwealth", "text": "Symbolic head of association of independent states\n\nThe Head of the Commonwealth is the ceremonial leader who symbolises \"the free association of independent member nations\" of the Commonwealth of Nations, an intergovernmental organisation that currently comprises 56 sovereign states. There is no set term of office or term limit and the role itself has no constitutional relevance to any of the member states within the Commonwealth. The position has always been held by the monarch of the United Kingdom, and thus is currently held by King Charles III.[1] Head of the Commonwealth is also a title of the monarch of each of the Commonwealth realms according to the Royal Style and Titles Act.\n\nBy 1949, what was then called the British Commonwealth was a group of eight countries, each having King George VI as monarch. India, however, desired to become a republic, but not to leave the Commonwealth by doing so. This was accommodated by the creation of the title Head of the Commonwealth for the King and India became a republic in 1950. Subsequently, during the reign of Queen Elizabeth II, other nations, including Pakistan, Sri Lanka, Ghana, and Singapore, also became republics, but, as members of the Commonwealth, recognised her as the organisation's head.[2] Per agreement reached at the CHOGM in 2018, Charles III succeeded Elizabeth II as head of the Commonwealth upon her death on 8 September 2022.[3]\n\nHistory [ edit ]\n\nIn the late 19th and early 20th century, the British Empire began to be referred to as the Commonwealth of Nations, with several colonies gaining substantial autonomy as they achieved Dominion status.[4] Nevertheless, the unity of this Commonwealth was seen as being established by a shared allegiance to the British monarch. During the negotiations to end the Irish War of Independence, the rebel Irish president Éamon de Valera proposed a relationship between Ireland and the British Empire he called external association, under which Ireland would be a republic \"associated\" with the rest of the British Commonwealth, and would \"recognise His Britannic Majesty as head of the Association\" but not as Ireland's King or head of state. This proposal was rejected, and the treaty that ended the war saw the Irish Free State remain part of the Commonwealth as a Dominion.[5]\n\nThe Balfour Declaration of 1926 and the Statute of Westminster 1931 established that the Dominions were equal in status to one another and legislatively independent, which gave each of them the right to legislate in regard to their shared head of state; thus, the abdication of Edward VIII and the accession of his brother as George VI required separate action in each Dominion. The Irish Free State, under de Valera's leadership, changed its constitutional law to create the office of an elected President of Ireland and limit the monarch to only a ceremonial role in foreign relations as a \"symbol of cooperation\" with other nations of the Commonwealth.[6] This ambiguity over the Irish head of state allowed the rest of the Commonwealth to continue to regard George VI as a monarch they shared with Ireland even as de Valera declared that Ireland was now \"demonstrably a republic\".[7] Eventually the Irish government passed The Republic of Ireland Act 1948, eliminating the final roles the King had in the state and terminating the Republic's membership in the Commonwealth when it went into effect in 1949.\n\nThe Commonwealth prime ministers with King George VI at Buckingham Palace for the Commonwealth Prime Ministers' Conference, 1949\n\nAt that point, George VI was still king of the United Kingdom, Canada, Australia, New Zealand, South Africa, India, Pakistan, and Ceylon. However, India also wished to become a republic, but, unlike Ireland, did not wish to leave the Commonwealth. To accommodate this, the London Declaration, issued in late April 1949,[13] stated that India wished to remain part of the Commonwealth, and regarded the King as the symbol of the voluntary association of the countries of the Commonwealth \"and as such the Head of the Commonwealth\". By implication, this allowed India and other nations to become republics without leaving the Commonwealth. When India adopted a republican constitution on 26 January 1950, George VI ceased to be its monarch (the President of India, Rajendra Prasad, became head of state) and, thereafter, the country regarded him as Head of the Commonwealth.\n\nGeorge VI's daughter, Elizabeth II, became Head of the Commonwealth upon her accession on 6 February 1952, stating at the time, \"the Commonwealth bears no resemblance to the empires of the past. It is an entirely new conception built on the highest qualities of the spirit of man: friendship, loyalty, and the desire for freedom and peace.\"[14] The following year, a royal styles and titles act was passed in each of the Commonwealth realms, adding, for the first time, the term Head of the Commonwealth to the monarch's titles.\n\nThe Queen had a personal flag created in December 1960 to symbolise her as Head of the Commonwealth without being associated with her role as queen of any particular country. Over time, the flag replaced the British royal standard when the Queen visited Commonwealth countries of which she was head of state, but did not possess a royal standard for that country,[15] or of which she was not head of state, as well as on Commonwealth occasions in the United Kingdom. When the Queen visited the headquarters of the Commonwealth Secretariat in London, this personal standard—not any of her royal standards—was raised.[16]\n\nQueen Elizabeth II with the prime ministers of the Commonwealth, including Kwame Nkrumah (third from right), at Windsor Castle, May 1960\n\nSouth Africa was barred from re-entering the Commonwealth after it became a republic in 1961, as many Commonwealth members, particularly those in Africa and Asia, as well as Canada, were hostile to its policy of racial apartheid. Through the 1980s, Queen Elizabeth II sided with the majority of Commonwealth heads of government, and against her British prime minister, Margaret Thatcher, on the matter of imposing sanctions on apartheid South Africa,[17] a point echoed by former Commonwealth Secretary-General Shridath Ramphal, who said, \"so steadfast was the Queen to the antiapartheid cause ... that, once again, she stood firm against the position of Thatcher\".[18] South Africa was re-admitted to the Commonwealth in 1994, following its first multiracial elections that year.[19] Former Canadian Prime Minister Brian Mulroney said Elizabeth was a \"behind the scenes force\" in ending apartheid in the country.[20][21]\n\nWhile the Queen never spoke publicly on the matter of apartheid, she was in 1961 photographed dancing with President Kwame Nkrumah of Ghana during her visit to Accra, celebrating Ghana's establishment as a republic (also removing Elizabeth as head of state) within the Commonwealth the year before. This act was taken as the Queen's symbolic expression of her anti-apartheid stance;[22] the image offended the white South African government.[17] However, Elizabeth's visit, made despite recent bombings in the capital, was mainly intended to keep Ghana in the Commonwealth amid fears the country was getting too close to the Soviet Union.[23]\n\nAfter the Queen's death in 2022, King Charles III became Head of the Commonwealth. He delivered his first Commonwealth Day message on 13 March 2023, in the week that marked the 10th anniversary of the Charter of the Commonwealth, which Charles III said, \"gives expression to our defining values—peace and justice; tolerance, respect, and solidarity; care for our environment and for the most vulnerable among us\".[24]\n\nTitle [ edit ]\n\n{{{annotations}}} Head of the Commonwealth, on the royal proclamation of the Elizabeth II's Canadian style and title, which included, on the royal proclamation of the National Flag of Canada , 1965\n\nThe title was devised in the London Declaration as a result of discussions at the 1949 Commonwealth Prime Ministers' Conference. It is rendered in Latin as Consortionis Populorum Princeps,[25][26][27] and in French as Chef du Commonwealth.[28]\n\nRoles and duties [ edit ]\n\nThe head of the Commonwealth serves as a leader, alongside the Commonwealth secretary-general and Commonwealth chair-in-office. Although Charles III is king of 15 member-states of the Commonwealth, he does not have any constitutional role in any Commonwealth state by virtue of his position as head of the Commonwealth. He keeps in touch with Commonwealth developments through regular contact with the Commonwealth secretary general and the Secretariat, the Commonwealth's central organisation.[29]\n\nThe head of the Commonwealth or a representative attends the biennial Commonwealth Heads of Government Meeting (CHOGM), held at locations throughout the Commonwealth. This is a tradition begun by Queen Elizabeth II at the suggestion of Canadian Prime Minister Pierre Trudeau in 1973,[30] when the CHOGM was first held in Canada. During the summit, the head of the Commonwealth has a series of private meetings with Commonwealth countries' heads of government, attends a CHOGM reception and dinner, and makes a general speech.\n\nThe head of the Commonwealth or a representative has also been present at the quadrennial Commonwealth Games. The Queen's Baton Relay, held prior to the opening of each Commonwealth Games, carries a message from the head of the Commonwealth to all Commonwealth Nations and territories.[31][32]\n\nEvery year on Commonwealth Day, the second Monday in March, the head of the Commonwealth broadcasts a special message to the population of the Commonwealth; approximately 2.5 billion people.[33] On the same day, the head attends an inter-denominational Commonwealth Day service, held at Westminster Abbey.[34]\n\nSuccession [ edit ]\n\nThe position of head of the Commonwealth is not hereditary, with successors chosen by the Commonwealth heads of government.[1] Once in office, there is no term limit.\n\nDespite this, the words Head of the Commonwealth form part of the monarch's title in each Commonwealth realm. Before Charles was selected as the organisation's next head, Prime Minister of Canada Stephen Harper referred to Charles as \"the future head of the Commonwealth\"[35] and Prime Minister of New Zealand John Key said, \"the title [of head of the Commonwealth] should just go with the Crown\".[36]\n\nBy 2018, with Elizabeth II in her 90s, there had been discussions for some time about whether her eldest son, Charles, or someone else should become the third head of the Commonwealth.[37] Commentators in British newspapers opined on whether it should be a one-off decision to elect Prince Charles to the headship, the monarch of the Commonwealth realms should automatically become head of the Commonwealth, or the post should be elected or chosen by consensus.[38][39][40] There was also speculation that a rotating ceremonial \"republican\" headship might be instituted.[41][42] The Daily Telegraph reported that \"the post is not hereditary and many leaders want an elected head to make the organisation more democratic.\"[43]\n\nIt was argued by Philip Murphy and Daisy Cooper that the role should simply lapse upon Queen Elizabeth's death, as Prince Charles was, at the time, in an \"impossible position\": promoting himself would be \"anachronistic and presumptuous\", whereas showing no interest would be \"characterised as neglectful\". Murphy and Cooper went further to say Charles would be a \"positively harmful\" symbol, \"reinforcing the prejudice that the Commonwealth is merely a throwback to empire\". They felt that the position itself was an impediment to the influence of the Commonwealth Secretariat.[44]\n\nA report that Prince Charles would accompany the Queen to the 2015 Commonwealth Heads of Government Meeting in Malta claimed Elizabeth was \"determined to see the headship descend to her son\", while accepting that \"it is not a done deal\".[44] In 2018, following that year's CHOGM, the delegates declared that Charles would be the next head of the Commonwealth,[45] while the role remained non-hereditary.[46][47] Consequently, after the Queen's death on 8 September 2022, Charles became head of the Commonwealth.[48]\n\nList of heads [ edit ]\n\nSee also [ edit ]\n\nNotes [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/The_President%2C_Smt._Pratibha_Devisingh_Patil_receiving_the_Baton_from_the_Queen_Elizabeth_II%2C_for_Baton_relay_of_XIX_Commonwealth_Games_2010%2C_at_Buckingham_Palace%2C_in_London_on_October_29%2C_2009.jpg/120px-thumbnail.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/The_Prime_Minister%2C_Dr._Manmohan_Singh_alongwith_the_Heads_of_Commonwealth_countries_with_the_Queen_Elizabeth_II%2C_at_CHOGM_2009%2C_in_Port_of_Spain_on_November_27%2C_2009.jpg/250px-thumbnail.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Her_Majesty_Queen_Elizabeth_II_at_the_Closing_Ceremony_of_the_XII_Commonwealth_Games%2C_Brisbane.jpg/250px-Her_Majesty_Queen_Elizabeth_II_at_the_Closing_Ceremony_of_the_XII_Commonwealth_Games%2C_Brisbane.jpg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/Queen_Elizabeth_II_in_March_2015.jpg/120px-Queen_Elizabeth_II_in_March_2015.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Commonwealth_Heads_of_Government_meeting_1973_Canada_stamp.jpg/120px-Commonwealth_Heads_of_Government_meeting_1973_Canada_stamp.jpg", "https://upload.wikimedia.org/wikipedia/commons/a/ac/King_Charles_III_%28July_2023%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/King_George_VI_LOC_matpc.14736_A_%28cropped%29.jpg/120px-King_George_VI_LOC_matpc.14736_A_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Queen_Elizabeth_II_at_the_1974_Commonwealth_Games_%281%29.jpg/250px-Queen_Elizabeth_II_at_the_1974_Commonwealth_Games_%281%29.jpg", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Prime_Minister_Keir_Starmer_attends_CHOGM_Summit_in_Samoa_-Day_2_%2854091914325%29.jpg/250px-Prime_Minister_Keir_Starmer_attends_CHOGM_Summit_in_Samoa_-Day_2_%2854091914325%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Queen_Elizabeth_II_and_the_Prime_Ministers_of_the_Commonwealth_Nations%2C_at_Windsor_Castle_%281960_Commonwealth_Prime_Minister%27s_Conference%29.jpg/250px-Queen_Elizabeth_II_and_the_Prime_Ministers_of_the_Commonwealth_Nations%2C_at_Windsor_Castle_%281960_Commonwealth_Prime_Minister%27s_Conference%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/DSCF6026_Queen_arrives_at_Commonwealth_Games_Opening_Ceremony.jpg/250px-DSCF6026_Queen_arrives_at_Commonwealth_Games_Opening_Ceremony.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/Her_Majesty_Queen_Elizabeth_II_delivering_the_inaugural_address_at_the_CHOGM_2011_at_Perth_Convention_and_Exhibition_Centre%2C_in_Australia._The_Vice_President%2C_Shri_Mohd._Hamid_Ansari_and_other_Heads_of_States_are_also_seen.jpg/250px-thumbnail.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Ram_Nam_Kovind_congratulated_the_Prince_of_Wales_on_his_election_as_the_head_of_the_Commonwealth.jpg/250px-Ram_Nam_Kovind_congratulated_the_Prince_of_Wales_on_his_election_as_the_head_of_the_Commonwealth.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/King_Charles_III_%28July_2023%29.jpg/250px-King_Charles_III_%28July_2023%29.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Proclamation_of_the_National_Flag_of_Canada_%28January_1965%29.jpg/960px-Proclamation_of_the_National_Flag_of_Canada_%28January_1965%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/King_Charles_III_%28July_2023%29.jpg/120px-King_Charles_III_%28July_2023%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Commonwealth_Prime_Ministers_in_London_1949.jpg/250px-Commonwealth_Prime_Ministers_in_London_1949.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/a/ac/King_Charles_III_%28July_2023%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Head_of_the_Commonwealth", "title": "Head of the Commonwealth", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/a/ac/King_Charles_III_%28July_2023%29.jpg", "width": 851, "height": 1200}, "title": "Head of the Commonwealth - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}