{"url": "https://en.wikipedia.org/wiki/Regeneration_(Doctor_Who)", "text": "Fictional alien species in the Doctor Who universe\n\nThis article is about the species from Doctor Who. For other uses, see Time Lord (disambiguation)\n\nThe Time Lords are a fictional ancient race of extraterrestrial people in the British science fiction television series Doctor Who. In-universe, they hail from the planet Gallifrey and are stated to have invented time travel technology. They have sworn an oath to not interfere in the universe; those who reject this and leave the planet to live in the universe are referred to as \"renegades\". One of their number, the Doctor, fled Gallifrey, stealing one of their time machines known as a TARDIS. In the early days of the series, the Time Lords were not initially referred to, and though the Doctor was stated to be non-human, the character did not clarify beyond that. The Time Lords, as well as the Doctor's affiliation with them, first appeared in the 1969 serial The War Games. Following this appearance, the Time Lords serve as recurring characters, with many individual Time Lords serving either antagonistic or supporting roles in the series. Following the show's 2005 revival, it is revealed the Time Lords had been wiped out in-universe, killed by the Doctor during the events of a war against a species known as the Daleks. Though the Doctor is later able to go back and save the Time Lords in the 2013 episode \"The Day of the Doctor\", they are killed again by the antagonist the Master during the events of the 2020 episode \"Spyfall\".\n\nThe Time Lords originally did not exist in the series' narrative, though the Doctor referred to not being human. When creating 1969 serial The War Games, the production team needed a way to resolve the narrative of the serial in a satisfying manner. The team decided to have him meet his own people to bring the narrative back to the Doctor's origins. The Time Lords are believed to have been conceived by producer Derrick Sherwin, who initially had assumed they were a pre-existing element in the series. Sherwin discussed and planned out the Time Lords' role with co-writer Terrance Dicks, laying the groundwork for the Time Lords' future appearances in the series. Though the Time Lords were initially portrayed as god-like figures, they were recontextualised significantly by the 1976 serial The Deadly Assassin. The serial depicted them as having internal political struggles, with Time Lords being hypocritical and corrupt in their nature. The serial also established a distinct visual identity for the Time Lord race, having them wear ceremonial robes and large collars. This depiction of the Time Lords would be maintained throughout the rest of the show's original run. The show's 2005 revival would end up killing the Time Lord race due to showrunner Russell T Davies finding the Time Lords boring, while also wanting to establish them as mythological figures in the series' lore. The following showrunner, Steven Moffat, would bring them back to establish a new character arc for the Doctor, allowing the character to move on from their guilt caused by their actions in destroying them.\n\nThe Time Lords have been treated with a mixed response, particularly for their depiction in episodes following The Deadly Assassin. The decision to kill the Time Lords was met with praise by critics, who noted how it helped to expand the Doctor's character as well as the Time Lords' role in the series' wider narrative. The Time Lords have been the subject of scholarly analysis for a variety of subjects.\n\nIn-universe information [ edit ]\n\nDoctor Who is a long-running British science-fiction television series that began in 1963. It stars its protagonist, the Doctor, an alien who travels through time and space in a ship known as the TARDIS, as well as their travelling companions.[1] When the Doctor dies, they are able to undergo a process known as \"regeneration\", completely changing the Doctor's appearance and personality.[2] Throughout their travels, the Doctor often comes into conflict with various alien species and antagonists.[3][4]\n\nCharacteristics [ edit ]\n\nThe Time Lords live on a planet known as Gallifrey, a yellow-orange planet. A large city called the Capitol resides on the planet, where a large number of Time Lords live. All Time Lords are part of the species known as Gallifreyans, but not every Gallifreyan is a Time Lord,[6] though many involved with the show have interchangeably referenced the Time Lords being either a race or a species.[7][8][9] Time Lord society is largely present within the Capitol, also called the Citadel, with the land outside of the cities being a wasteland. The Citadel contains a location known as the Academy, where young Gallifreyans are raised as Time Lords.[10][11] Those who drop out of Time Lord society live outside of the Citadel, and are dubbed \"outsiders\",[10] while those who become Time Lords tend to be from \"ruling houses\", which are implied to be at the top Gallifreyan society.[12] Gallifrey is protected by an impenetrable barrier, which prevents most forms of attack.[13]\n\nThe term \"Time Lord\" tends to refer to a male Time Lord, while \"Time Lady\" is used to refer to a female Time Lord; despite this, the term Time Lord has also often been used as an overarching term to refer to both sexes of Time Lord.[12] Time Lords and human beings look alike, but differ in that they have several physiological differences, with Time Lords having two hearts. Time Lords, upon death, have the ability to \"regenerate\", during which they are healed from their mortal injuries, but have their physical appearances and minds changed in the process. Time Lords are capable of regenerating twelve times, making for a total of thirteen lives in one Time Lord's life. Another process that exists, introduced in 2023 episode \"The Giggle\", is known as bi-generation, in which the Time Lord splits into two copies of the same person when regenerating.[15] Time Lords also have some level of psychic powers, as well as the power of hypnosis and a \"respiratory bypass system\" which allows them to avoid being strangled.[16] Time Lords are also capable of disguising themselves as humans using a device called a Chameleon Arch.[17]\n\nThe Time Lords were originally members of a species known as the Shobogans who were genetically altered with the DNA of a being known as the Timeless Child, a being that later would become the Doctor. This granted Time Lords the ability to regenerate.[18] Later, a Time Lord named Rassilon would work with another Time Lord named Omega to create the first time travel spaceship, harnessing the power of a star going supernova to fuel the device. Though it succeeded, Omega disappeared during the incident.[19] Rassilon harnessed the nucleus of the resulting black hole to provide the energy that powers time travel,[20] resulting in much of Omega's praise being given to Rassilon,[19] and Rassilon became a defining figure in Time Lord society. Rassilon took control of the Time Lords' home planet Gallifrey as its \"Lord High President\".[20] The Time Lords became an influential race in the universe, becoming important figures during a period known as \"The Dark Times\", waging war with a species known as the Great Vampires.[21] They also established a faction known as the Division to interfere with history when needed, though the Division split off to become separate from the Time Lords entirely, often outsourcing their work to other alien species, such as the Weeping Angels and Lupari.[18][22] As the universe stabilised, the Time Lords decided to take a vow of non-interference, deciding not to interact with the universe and merely observe it.[19] Though most Time Lords follow this vow of non-intervention, those who leave the planet for one reason or another to act on their own accord in the universe are dubbed \"renegades\" and include recurring characters such as the Doctor, the Master, and the Rani.[23]\n\nAppearances [ edit ]\n\nClassic series [ edit ]\n\nThe First Doctor steals a TARDIS, one of the time-travel ships the Time Lords use, and flees Gallifrey with his granddaughter Susan Foreman sometime prior to the events of the series. Subsequently, the Doctor, during his travels, encounters and thwarts many conflicts throughout history.[24][25] Eventually, in the 1969 serial The War Games, during an incident in which a group known as the War Lords capture humans from throughout time and space, the Second Doctor is forced to contact the Time Lords to resolve the situation. The Time Lords deal with the War Lords, but subsequently put the Doctor on trial for his interference throughout time and space. After showing them how he has stopped evils during his travels, the Time Lords decide to force him to regenerate and exile him to Earth, where the Doctor has spent a significant amount of time during his travels.[26]\n\nThe Third Doctor is used as an agent by the Time Lords during his exile in the 1971 serial Colony in Space and the 1972 serials The Mutants and The Curse of Peladon, in which he is sent off-world to resolve conflicts on the Time Lords' behalf.[27][28][29] The Doctor also comes into conflict with another renegade Time Lord, the Master, who repeatedly has his schemes thwarted by the Doctor, and would repeatedly feature as a recurring antagonist.[30] The Time Lords eventually contact the first three incarnations of the Doctor during 1973 serial The Three Doctors in order to defeat Omega, who has returned to the universe and is attempting to get revenge on the Time Lords for seemingly abandoning him. After Omega is seemingly destroyed, the Time Lords revoke the Third Doctor's exile, allowing him to travel freely again.[31] He is later sent on a mission by the Time Lords during the events of the 1975 serial Genesis of the Daleks, where they request the Doctor to go back in time to the Daleks' creation in an attempt to destroy them.[32]\n\nThe Fourth Doctor eventually returns to Gallifrey during the events of the 1976 serial The Deadly Assassin, during which he stops a plan by the Master to destroy Gallifrey to gain more regenerations. The Doctor again returns to Gallifrey during the 1978 serial The Invasion of Time, where the Doctor stops a dual Vardan and Sontaran invasion of Gallifrey,[33] and later travels with a Time Lady named Romana, who was sent by the Time Lords to help him in his quest to assemble the Key to Time.[34] The Time Lords again appear in the 1983 serial Arc of Infinity, during which the Fifth Doctor helps stop another attempt by Omega to return to reality.[35] The 1983 anniversary special \"The Five Doctors\" sees the Lord President of Gallifrey, Borusa, capture several incarnations of the Doctor, as well as many of their companions and old enemies, from throughout time and space, using them to break into Rassilon's tomb so Borusa can obtain the secret to immortality. The Time Lords send the Master to help the Doctor in stopping the scheme, though the Master ends up betraying the Time Lords; the Master is eventually knocked unconscious. Borusa arrives in the tomb after the Doctors find their way in, but is turned to stone by a disembodied apparition of Rassilon. Rassilon returns everyone captured by Borusa back to their home times.[36]\n\nThe Sixth Doctor later encounters a Time Lady who has left the planet, named the Rani, who acts as a recurring enemy.[37] The Time Lords eventually again capture the Doctor and put him on trial in The Trial of a Time Lord. The Sixth Doctor debates against the prosecutor known as the Valeyard, who is revealed to be a dark incarnation of the Doctor from his future. The Valeyard has manipulated the trial to try and get the Doctor's remaining regenerations, and flees into Time Lord information repository the Matrix in an attempt to escape. The Doctor stops both him and the Master, and is released by the Time Lords as thanks for his help in stopping them.[38]\n\nRevived series [ edit ]\n\nSometime following the events depicted in the Classic series but before the revival's first series, the Daleks, realizing the Time Lords attempted to interfere in their creation, become involved in a massive interstellar war fought across time and space against the Time Lords known as the \"Last Great Time War\". Both sides utilised time travel, with the war being fought outside of normal space-time. Many key figures in Time Lord society participated in the war, including Rassilon, who was resurrected from the dead to act as a leader, and the Master, who initially fought in the war before eventually fleeing from it. The Doctor's Eighth incarnation was originally a conscientious objector, working to help those in the cosmos where he could, but eventually, after a young woman named Cass denies him rescuing her from a crashing ship on account of him being a Time Lord, the Doctor chooses to regenerate into a warrior. His subsequent incarnation, the War Doctor, entered the war and actively participated in it, eventually ending the war by using a device called the Moment to seemingly destroy both sides, leaving the Doctor the apparent sole Time Lord left in the universe.[32]\n\nThough the Master was also revealed to have escaped the war, the Time Lords as a race did not physically re-appear until \"The End of Time\" (2009-2010), in which Rassilon, during the final days of the Time War, attempts to destroy time and space as a whole to make the Time Lords become the final living race in the universe. Though Gallifrey is briefly able to escape the war, the Tenth Doctor stops Rassilon, sending the Time Lords back into the war.[39]\n\nDuring the 2013 50th anniversary special \"The Day of the Doctor\", the War Doctor meets his future incarnations, the Tenth and Eleventh Doctors, and the three are able to work together to save the Time Lords from the last day of the war, sending the Time Lords and Gallifrey into a pocket universe.[40] The Time Lords attempt to return the universe during the events of the 2013 episode \"The Time of the Doctor\", needing the Doctor to speak his name into a crack in time to know if it's safe to return. Species from across the universe lay siege to the planet Trenzalore to stop the Doctor from speaking his name; though the Eleventh Doctor, on his final regeneration, does not intend to speak his name, he stays to defend the town of Christmas on the planet, as it will be destroyed by the invading forces if he is to leave. After hundreds of years of defending the planet, he is about to die; the Time Lords gift the Doctor more regeneration energy, allowing him to survive and defeat an invading Dalek fleet.[41] The Time Lords subsequently return to the universe, with the Twelfth Doctor eventually making it back to Gallifrey in \"Hell Bent\" (2015), during which the Doctor exiles Rassilon and uses Time Lord technology to pluck his companion Clara Oswald from moments before her death to save her life.[42]\n\nGallifrey is destroyed again by the Master in the 2020 episode \"Spyfall\",[43] with the Master exterminating all Time Lords in the universe off-screen with a \"genetic explosion\".[44] The Master later converts the Time Lords into mechanical cyborgs known as Cybermen in the 2020 episode \"The Timeless Children\".[45] These Cybermen, dubbed \"Cybermasters\",[46] have the ability to regenerate, unlike regular Cybermen.[45] The Master reveals to the Thirteenth Doctor that she is the Timeless Child. The Doctor is able to rig a \"death particle\" to destroy all organic life on the planet, destroying most of the Cybermasters, though some are implied to escape with the Master.[47] The Cybermasters re-appear during the events of the 2022 special \"The Power of the Doctor\", and are seemingly all killed during the episode.[46]\n\nThe Doctor also encounters the Division during the events of \"Fugitive of the Judoon\" (2020) in which she and her Fugitive incarnation, who was a former Division operative, defeat a Time Lord operative named Gat.[18] During the events of Doctor Who: Flux, the Thirteenth Doctor encounters Tecteun, a Time Lord who adopted the Timeless Child and pioneered regeneration in Time Lords. Following the Doctor learning about the nature of her true identity from the Master,[48] Tecteun attempts to orchestrate a wave of anti-matter[49] known as the Flux to destroy the entire universe, allowing her and the Division to escape to another reality away from the Doctor.[48] Tecteun is killed by Swarm and Azure, enemies of the Division,[50] with the Doctor later defeating them and stopping the Flux wave.[49]\n\nThe Rani is later revealed to have survived the genetic explosion, and during the events of 2025 episodes \"Wish World\" and \"The Reality War\", attempts to summon Omega so she can revive the Time Lords using DNA from his body. The Rani, who has bi-generated, is eaten by a monstrous Omega, with her other self, dubbed Mrs. Flood, escaping. Omega is blasted with a laser back into his home dimension by the Fifteenth Doctor.[51]\n\nIn spin-off media [ edit ]\n\nMany pieces of spin-off media focus on Gallifrey, particularly in terms of the Doctor's origins on the planet. However, many of these accounts are contradictory and do not align with events portrayed in other media: For example, accounts of the Doctor's true name that they used on Gallifrey are never consistent and often are different between different forms of media.[25] Many of these contradictory elements were explained in canon by various means, but most notably by the introduction of the Time War, which explained narrative inconsistencies by stating that the War's effects caused the events of different pieces of media to be \"cancelled out\".[52] Several elements of the Time Lords' history are present across spin-off media, but are not always present in the main show. One major element was the concept of looms, which are devices used by the Time Lords to reproduce after being rendered infertile. These have been used in multiple forms of media, such as comics and novels.[53] Another is the character of Irving Braxiatel, the Doctor's brother, who acts as a recurring character across multiple spin-off series, including in media focusing on the character of Bernice Summerfield.[54] Other concepts that originate in spin-off media, such as the domed citadel of the Time Lords that debuted in comic strips, would later be adapted and made canon to the television series.[10]\n\nThe spin-off media crossover event Time Lord Victorious depicts the Tenth Doctor going back in time to the Dark Times and defeating Death, which has negative consequences for the universe.[55] The crossover event depicts Time Lords during the Dark Times, with the Daleks and many incarnations of the Doctor becoming involved in the conflict.[56] One comic, for example, depicts a conflict between Gallifreyans, before they became Time Lords, fighting in the war against the Great Vampires, and depicts Rassilon as a field commander before they came to power.[57] Time Lord Victorious was depicted across multiple pieces of spin-off media, including novels, audio dramas, comic strips, and real-world immersive events.[56]\n\nNovels [ edit ]\n\nThe 1997 Virgin New Adventures novel Lungbarrow depicted an execution of a planned storyline for the Classic series before its cancellation; the novel revealed the Doctor to secretly be a mythical figure in Time Lord society known as the Other. This conflicted with other novels published by BBC Books at the time, which followed the idea of the Doctor being half human.[24] Another concept introduced in Lungbarrow was that of the Pythia, a being who, in the past of the Time Lords, rendered the Time Lords infertile, resulting in them utilising looms for reproduction.[53]\n\nLater books published by BBC Books introduced a group known as the Faction Paradox, who opposed Time Lord society and aimed to cause time anomalies for fun. The Faction was revealed to be run by an alternate version of the Doctor dubbed Grandfather Paradox, and though the Doctor stopped Paradox and ended the Faction, Gallifrey was destroyed in the process.[24] Other novels would include the concept of a time war prior to its introduced in the revived series.[52] In various media starring the Eighth Doctor, as well in Faction Paradox spin-off material, a concept known as the \"War in Heaven\" is introduced, in which the Time Lords are depicted fighting an unidentified \"enemy\" in a massive temporal conflict. The Time Lords are depicted as having more than thirteen regenerations. These Time Lords also have the ability for Time Lord soldiers to adapt their bodies depending on the terrain of the battlefield, with some being mutated into organic weapons of war.[58]\n\nAudio [ edit ]\n\nThe Gallifrey audio drama series produced by Big Finish Productions depicts Romana returning to Gallifrey and assuming the position of President, working alongside the character Leela to improve Time Lord society for the better while dealing with political drama and terrorist attacks.[24] Later audio dramas would depict the build-up to the Time War depicted on-screen, such as in the Dark Eyes and The Eighth Doctor: The Time War spin-off series.[59][60] Several audio dramas focusing on the War Doctor also reveal more about the events of the Time War,[61][54] while the audio drama series The War Master depicts the incarnation of the Master that fought in the war, as well as several of the war's events.[32][62][63] Another series, dubbed Susan's War, focuses on Susan's role in the Time War.[64]\n\nCreation and development [ edit ]\n\nClassic series [ edit ]\n\nEarly on in the series, the Doctor was identified as a human being;[65] however, their home planet, which from the start of the series is explicitly established as not being Earth,[66] was not named. Regeneration, out of universe, was introduced to replace First Doctor actor William Hartnell, who was falling into poor health.[67] The Doctor's process of regeneration was also not initially specified, with the process being described as \"renewal\" and its origins unclear,[68] not being clearly elaborated until the 1970s.[67] Details of the Doctor's home were never specified, even when encountering another character implied to be of the same species, the Meddling Monk.[69]\n\nThe Time Lords were created for the 1969 serial The War Games, with the initial idea being brought up by producer Derrick Sherwin, who suggested the Doctor meet his own people. The idea of the Doctor belonging to another species was only vaguely brought up in the series' early days, with Sherwin stating that the inclusion of the Time Lords in this episode would either serve as a good end point if the series was cancelled, or allow the series to progress into a new format if it kept going.[26] Elaborating on this genesis in a 2014 interview in Doctor Who Magazine, Sherwin said of The War Games, \"It was a case of what shall we do, how can we end this? Let's go back to the beginning and say [the Doctor] was a Time Lord, a renegade Time Lord, a pain in the arse for the other Time Lords who stole his TARDIS and buggered off around the universe. So if he's going to be called to book let's bring in the Time Lords.\"[70] In The War Games DVD commentary, Sherwin mentioned that he recalled hearing about the Time Lords at the beginning of the series, but as no one else remembered this, it \"might have come out of [his] dreams\".[71] In a 2016 interview with The Essential Doctor Who magazine, Dicks mentioned how when Sherwin and he were discussing The War Games one day, Sherwin said, \"He belongs to this mysterious race called the Time Lords, doesn't he?\" with \"everything\" ultimately coming from that discussion.[72] In an audio commentary recorded for the 2009 DVD release of The War Games, the serial's co-writer Terrance Dicks stated he believed Sherwin had created the Time Lords, though Sherwin did not remember himself.[73] A recurring Time Lord enemy, the Master, would be introduced to the series in 1971's Terror of the Autons, serving as a foil and recurring enemy to the Doctor, characterised as the Professor Moriarty to the Doctor's Sherlock Holmes.[74] Dicks, as well as producer Barry Letts, disliked the Doctor's exile to Earth at the hands of the Time Lords, and so used them as a plot device to get the Doctor in adventures off the planet.[16]\n\nA Time Lord costume, as seen on display at the Doctor Who Experience.\n\nPreviously, for Terror of the Autons, a Time Lord appeared disguised as a regular city inhabitant to warn the Doctor of the Master's arrival. Toby Hadoke, a person affiliated with the series, has stated that this was an early example of writer Robert Holmes deciding he was disinterested in the god-like concept of the Time Lords.[16] Holmes would later write the 1976 serial The Deadly Assassin, which greatly recontextualised the Time Lords. Whereas before they were characterised as \"austere, god-like beings\", the Time Lords now had internal political struggles, with the Time Lords only becoming powerful due to scientific achievement and not a \"mystical\" power or ability. Holmes wanted to make the Time Lords more \"human\" in how they acted, being unsatisfied with god-like characters. Holmes wished to \"correct the picture\", retconning much of the Time Lords' history to be hypocritical and corrupt; for example, the Time Lords' previous off-world use of the Doctor during his exile was done in-universe so the Time Lords could interfere with galactic affairs despite their oath of non-intervention.[75] Holmes similarly introduced many concepts relating to the Time Lords in this serial. He introduced Rassilon, who usurped the character Omega as being a mystic, founding figure in Time Lord society, and introduced the concept of the Matrix as an information repository for the species. Holmes laid out that regeneration could only be performed twelve times, and also named the Time Lords' home planet, Gallifrey, which had been name-dropped previously in Holmes' 1973-1974 serial The Time Warrior.[75] Gallifrey was originally known as \"Galfrey\", with an extra syllable added during production.[10]\n\nIn The War Games, the Time Lords had instead worn simple black and white robes for their costumes.[16] For The Deadly Assassin, the Time Lords instead wore ceremonial robes with large collars,[16] with the collars designed by designer James Acheson.[75] These new costumes from The Deadly Assassin would be retained and re-used in the Time Lords' subsequent appearances in the series, with many aspects of the design, notably the collar, being adapted into other Time Lord imagery throughout the series.[76] A symbol that had featured in the 1975 serial Revenge of the Cybermen was re-used and became a symbol associated visually with the Time Lords as the \"Seal of Rassilon\".[75]\n\nThe return to Gallifrey in 1978 serial The Invasion of Time was done due to producer Graham Williams wanting to see more of the environment established in The Deadly Assassin. This was also done due to the team being able to cheaply re-use costumes and set pieces from The Deadly Assassin. The serial sought to explore the idea that not all Gallifreyans were Time Lords, and wanted to take a deeper look at those who did not become Time Lords. The Invasion of Time also saw the return of Borusa, who was previously in a smaller role in The Deadly Assassin but was now promoted to a higher rank in Time Lord society.[33] Due to frequent appearances by the Time Lords during the 1970s, the Guardians were created to fulfill a role as god-like beings in the sixteenth season of the show. The only Time Lords to feature over the next season barring the Doctor were the Doctor's new companion Romana, a Time Lady designed as a \"perfect foil\" to the Doctor's character due to her acting more like traditional Time Lords, and another Time Lord named Drax who appeared in the 1979 serial The Armageddon Factor as a supporting character.[33]\n\nThe subsequent return to Gallifrey in 1983's Arc of Infinity was done to celebrate the show's twentieth anniversary, with the serial bringing back many past Time Lord characters such as Borusa and Omega.[35] Subsequently, the show's twentieth anniversary special, \"The Five Doctors\", saw a further re-appearance by the Time Lords, with Dicks incorporating Borusa into the role of main antagonist to subvert audience expectations that the Master was behind the episode's events; Rassilon was also incorporated into the narrative. Several Time Lord characters were also re-used from Arc of Infinity.[36]\n\nThe Time Lords putting the Doctor on trial in 1986's The Trial of a Time Lord was done symbolically; Doctor Who was not doing well at the time, and the show was struggling to continue. The trial was representative of how the show was \"on trial for its life\", and also served to reference The War Games in how the Doctor was tried for interfering with the affairs of the universe. Several new Time Lord characters were introduced, such as the Valeyard, a villainous incarnation of the Doctor, and the Inquisitor, who presides over the trial.[38]\n\nA planned expansion to the lore of the Time Lords was the introduction of a being known as \"the Other\", a mysterious mythic figure from the Time Lords' past that was a founding figure of Time Lord society alongside Rassilon and Omega. The Other would be revealed as the Doctor. Dubbed the Cartmel Masterplan after then-script editor Andrew Cartmel, hints were dropped toward the Doctor's true identity in the last two seasons of the Classic era, though these ideas would not be enacted upon due to the show's cancelation. Several of these ideas would be used as a baseline for the Virgin New Adventures tie-in novel range, most notably in the 1997 novel Lungbarrow.[77] Another concept planned for a cancelled series of the show was in the planned serial Ice Time, which would have seen a return of the Ice Warriors. The Doctor would have tried to enroll his companion Ace in a Time Lord academy in order to \"shake Time Lord society out of its lethargy\", with Ace being judged for inclusion by Time Lords.[78]\n\nRevived series [ edit ]\n\nA scene from \"The Day of the Doctor\" depicting Time Lords in a war room, on display at the Doctor Who Experience.\n\nWhen the show was revived following its cancellation in 1989, then-showrunner Russell T Davies decided to kill the Time Lords in a large conflict known as the Time War, which removed both them and the Daleks as established forces in the universe. Davies found the Time Lords boring, and even with rewrites to make them more human, he felt that their execution would have de-valued the narrative impact of the Time War. Davies also wished to make the Time Lords more mythological figures, wanting to distance them from being \"figures of continuity\".[10] Davies envisioned the War as being a conflict so horrible that the dead were brought back to life constantly, allowing him to bring back figures like Rassilon who were previously thought dead.[79] The Doctor would experience survivor guilt as a result of surviving the war, and the war would greatly affect the series' universe going forward.[80] For the Time Lords' eventual return in \"The End of Time\" (2009-2010), Davies decided to characterise them as being corrupt figures who had evolved into monsters during the course of the war, justifying why the Doctor would have to stop their return and why he had to end the war by destroying both sides.[79]\n\nThe return of the Time Lords in \"The Day of the Doctor\" (2013) was done by then-showrunner Steven Moffat, who wanted to write a special episode for the show's fiftieth anniversary that was narratively important to the Doctor's character. Wanting it to focus on a pivotal day in the Doctor's life, Moffat chose to write about the Time War, Gallifrey, and the Time Lords, and their impact on the Doctor's character, with the Doctor's saving of the Time Lords allowing the character to move on from their guilt from the war. This would eventually result in a plot thread in which the Doctor began to seek out Gallifrey following the events of this episode.[81] Moffat eventually had the Doctor return to Gallifrey in \"Hell Bent\" (2015), a story which showed the Doctor at their lowest point. The story would depict not only the return of Rassilon and a character called the General, who had previously appeared in \"The Day of the Doctor\", but also saw an expansion on elements of the Time Lord lore, such as with the introduction of a location known as the Cloisters, a place below the Capitol that was considered dangerous by other Time Lords.[82]\n\nReception and analysis [ edit ]\n\nReception [ edit ]\n\nThe initial decision to not make the Time Lords god-like beings in The Deadly Assassin was controversial among fans of the series at the time, as they did not like the changes made to the Time Lords established nature. The serial would retroactively be considered one of the show's best, however.[16] The book Who Is The Doctor 2: The Unofficial Guide to Doctor Who — The Modern Series stated that despite the Time Lords' mythic status within the show, the consistent returns to the planet featured mundane presentation, which the book stated provided Time Lord stories with \"diminishing returns\".[10] Literary critic John Kenneth Muir stated in the book A Critical History of Doctor Who on Television that by the end of the series, the Time Lords had become the show's biggest villains, more evil than other antagonists due to the hypocrisy of their actions. He stated that while the Time Lords wouldn't be revisited again in the Classic series following the revelation of their villainy, he believed there wasn't much room left for their characters to progress, stating \"Where can you go after exposing the super race as bunch of lying, conspiratorial hypocrites?\".[83]\n\nWriting for Radio Times, Olivia Garrett positively highlighted the decision to kill the Time Lords for the series' revival, as it allowed for the Doctor to be expanded as a character.[84] Adi Tantimedh, writing for Bleeding Cool, similarly stated that the Time Lords' demise allowed for the Doctor to develop into a \"mythic\" figure on their own, while also allowing for new viewers to jump onto the show without needing to be familiar with the Time Lords' lore.[85] Who Is The Doctor 2: The Unofficial Guide to Doctor Who — The Modern Series stated that the decision allowed the Time Lords to never disappoint audiences when they returned due to their lack of heavy involvement in the series' narrative, and that their in-universe disappearance allowed for the Doctor to gain additional emotional sympathy from the audience.[10] Steven Cooper, writing for Slant Magazine, praised the decision to retcon the Doctor's decision to destroy the Time Lords be to also save the universe from them, as it provided greater narrative weight to the Doctor's actions.[86] Lewis Knight, writing for Radio Times, believed the Time Lords should be brought back permanently, as the Time Lords' continued presence in the universe allowed for a greater exploration of the dynamic between them and the Doctor, as well as of Time Lord culture as a whole.[87]\n\nAnalysis [ edit ]\n\nThe book Once Upon a Time Lord: The Myths and Stories of Doctor Who discussed how the depiction of the Time Lords in Doctor Who media emphasised how Romantic ideas of traditional society could be warped and distorted, as despite the Time Lords maintaining a vow of non-intervention, they are shown to be a cruel and despotic race not dissimilar from the warmongering Daleks in their actions.[88] The book Academia and Higher Learning in Popular Culture stated that the Time Lords have a close association between the academy and their teachings of non-interference; these allusions are shown to illustrate how the Time Lords view themselves as being intellectually superior to other races, and how they look down on those below them.[11] The paper Doctor Who and Race: Reflections on the Change of Britain's Status in the International System stated that the destruction of the Time Lords allowed for the Doctor to be symbolic of how class warfare evolved over time, as the Doctor no longer represented an \"upper-class Englishman\" during the show's revival as they had during the Classic era, with the rest of the Time Lords they opposed being characterised as destructive and power hungry individuals. Similarly, the Fifth Doctor's clashes with Gallifreyan society in the Classic series were considered symbolic of class struggles at the time of those episodes' airings.[89]\n\nThe book Design for Doctor Who: Vision and Revision in Science Fiction Television analysed the usage of the Time Lords' ceremonial robes and collars in their iconography; it stated that while the costumes had proven to be cumbersome and not be taken as seriously by modern day audiences, they still continued to be retained due to their importance in the visual identity of the Time Lords, which the book stated helped unify the classic and revived series through this shared element.[76] The paper \"Gallifrey Falls No More: Doctor Who's Ontology of Time\" analysed the Time Lords' role in maintaining time in the Doctor Who universe, as well as their relation to eternalism. Comparing their role as \"gods\" of time in the series to how eternalism treats all of time equally, the paper stated that the ability for the universe to be changed without the Time Lords' presence showed how all points in time were already set in stone, and thus the show's depiction of time fell within an eternalist perspective.[90] A paper by the Scientific American analysed how the Time Lords' two hearts could work in real life.[91]\n\nReferences [ edit ]\n\nBibliography [ edit ]\n\nDonaghy, Craig (2014). Doctor Who: How to Be a Time Lord: Official Guide . London: BBC Children's Books. ISBN 978-0-723-29436-8 .\n\nParkin, Lance (2006). Additional material by Lars Pearson (ed.). AHistory: An Unauthorised History of the Doctor Who Universe. Des Moines: Mad Norwegian Press. ISBN 0-9725959-9-6 .\n\nTime Lord on Tardis Wiki, the Doctor Who Wiki", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Doctor_Who_Experience_%2813080741605%29.jpg/250px-Doctor_Who_Experience_%2813080741605%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/20px-Symbol_support_vote.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8b/Gallifrey_Sound_of_Drums.jpg/250px-Gallifrey_Sound_of_Drums.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/TARDIS-trans.png/20px-TARDIS-trans.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Dr_Who_Gallifrey_%2814392611581%29.jpg/250px-Dr_Who_Gallifrey_%2814392611581%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e2/Symbol_portal_class.svg/20px-Symbol_portal_class.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/The_Time_Lords_%2813049288195%29.jpg/1200px-The_Time_Lords_%2813049288195%29.jpg", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/e/e7/Regeneration_4-5.gif", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/20px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/The_Time_Lords_%2813049288195%29.jpg/250px-The_Time_Lords_%2813049288195%29.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/The_Time_Lords_%2813049288195%29.jpg/1200px-The_Time_Lords_%2813049288195%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Time_Lord#Characteristics", "title": "Time Lord", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/The_Time_Lords_%2813049288195%29.jpg/1200px-The_Time_Lords_%2813049288195%29.jpg", "width": 1200, "height": 900}, "title": "Time Lord - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}