{"url": "en.wikipedia.org/wiki/Prince_Harry,_Duke_of_Sussex", "text": "British prince (born 1984)\n\nPrince Harry, Duke of Sussex[fn 2] (Henry Charles Albert David; born 15 September 1984), is a member of the British royal family. As the younger son of King Charles III and Diana, Princess of Wales, he is fifth in the line of succession to the British throne.\n\nEducated at Wetherby School, Ludgrove School, and Eton College, Harry completed officer training at the Royal Military Academy Sandhurst. He was commissioned as a cornet into the Blues and Royals and served briefly alongside his older brother, William. Harry was deployed twice on active duty to Afghanistan; first for 10 weeks in Helmand Province during 2007–2008, and then for 20 weeks with the Army Air Corps in 2012–2013.\n\nInspired by the Warrior Games in the United States, Harry launched the Invictus Games in 2014 as founding patron and remains involved. Two years later, alongside his brother William and sister-in-law Catherine, Harry jointly initiated the mental health awareness campaign \"Heads Together\".\n\nIn 2018 Harry was made Duke of Sussex prior to his wedding to American actress Meghan Markle. They have two children: Archie and Lilibet. Harry and Meghan stepped down as working royals in January 2020, moved to Meghan's native Southern California, and launched Archewell Inc., a Beverly Hills-based mix of for-profit and not-for-profit business organisations. In March 2021, Harry sat for Oprah with Meghan and Harry, a much-publicised American television interview with his wife and Oprah Winfrey. The couple filmed Harry & Meghan, a Netflix docuseries, which was released in December 2022. In 2023, Harry released his memoir, Spare.\n\nEarly life\n\nA 1985 Seychellois stamp depicting Harry with his great-grandmother Queen Elizabeth The Queen Mother at his christening\n\nHarry was born at 4:20 pm on 15 September 1984 in the Lindo Wing of St Mary's Hospital in Paddington, London, as the second child of Charles, Prince of Wales (later King Charles III), and his first wife, Diana, Princess of Wales, during the reign of his paternal grandmother Queen Elizabeth II.[2][3][fn 3] He was christened Henry Charles Albert David on 21 December 1984 at St George's Chapel, Windsor Castle, by Robert Runcie, the then archbishop of Canterbury.[fn 4] Growing up, he was referred to as \"Harry\" by family, friends, and the public, and was nicknamed \"Harold\" by his brother.[7] Harry and his elder brother, William, were raised at Kensington Palace in London, and Highgrove House in Gloucestershire.[8][9] Diana wanted her sons to have a broader range of experiences and a better understanding of ordinary life than previous royal children. She took them to venues that ranged from Walt Disney World and McDonald's to AIDS clinics and homeless shelters.[10] Harry began accompanying his parents on official visits at an early age; his first overseas tour was with his parents to Italy in 1985.[11] He also travelled with his family to Canada in 1991 and 1998.[12][13]\n\nHarry's parents divorced in 1996. His mother died in a car crash in Paris the following year while he and William were staying with their father at Balmoral Castle. Their father informed them about their mother's death.[14] At his mother's funeral, Harry, then aged 12, accompanied his father, brother, paternal grandfather Prince Philip, Duke of Edinburgh, and maternal uncle Charles Spencer, 9th Earl Spencer, in walking behind the funeral cortège from Kensington Palace to Westminster Abbey.[15] Harry and his brother William inherited the \"bulk\" of the £12.9 million left by their mother on their respective 30th birthdays, a figure that had grown since her 1997 death to £10 million each in 2014.[16][17] In 2014 Harry and William inherited their mother's wedding dress along with many of her other personal possessions, including dresses, diamond tiaras, jewels, letters, and paintings. The brothers also received the original lyrics and score of \"Candle in the Wind\", by Bernie Taupin and Elton John, as performed by John at Diana's funeral.[17] In 2002 The Times reported that Harry would also share with his brother a disbursement of £4.9 million from trust funds established by their great-grandmother, Queen Elizabeth The Queen Mother, on their respective 21st birthdays and would share a disbursement of £8 million upon their respective 40th birthdays.[18] It was reported that Harry would inherit the bulk of the money left by the Queen Mother for the two brothers, as William is set to ascend to the throne, which will bring him additional financial benefits.[19]\n\nEducation\n\nLike his father and brother, Harry was educated at private schools. He started at London's Jane Mynors' nursery school and the pre-preparatory Wetherby School.[20] Following this, he attended Ludgrove School in Berkshire. After passing entrance exams, he was admitted to Eton College. The decision to place Harry at Eton went against the past practice of the Mountbatten-Windsors to send children to Gordonstoun, which his grandfather, father, two uncles, and two cousins had attended. It did, however, see Harry follow in his elder brother's footsteps and the Spencer family's, as both his mother's father and her brother attended Eton.[10] As was the case with his brother, the royal family and the tabloid press agreed Harry would be allowed to study free from intrusion in exchange for occasional photograph opportunities in what became known as the \"pressure cooker agreement\".[21]\n\nIn June 2003, Harry completed his education at Eton with two A-Levels,[22] achieving a grade B in art and D in geography, having decided to drop history of art after AS level.[23] He has been described as \"a top tier athlete\", having played competitive polo and rugby union.[24] One of his former teachers, Sarah Forsyth, has asserted that he was a \"weak student\" and that staff at Eton conspired to help him cheat on examinations.[25][26] Both Eton and Harry denied the claims.[25][27] While a tribunal made no ruling on the cheating claim, it \"accepted the prince had received help in preparing his A-level 'expressive' project, which he needed to pass to secure his place at Sandhurst.\"[25][28] Harry also joined the Combined Cadet Force while studying at Eton and was made cadet officer in his final year, leading the corps' annual parade at the Eton tattoo.[29]\n\nAfter school, Harry took a gap year, during which he spent time in Australia working as a jackaroo on a cattle station, and participating in the Young England vs Young Australia Polo Test match.[30][31] He also travelled to Lesotho, where he worked with orphaned children and produced the documentary film The Forgotten Kingdom: Prince Harry in Lesotho.[32][33]\n\nMilitary career\n\nSandhurst; Blues and Royals; deployment to Afghanistan\n\nOfficer Cadet Wales (standing next to the horse) on parade at Sandhurst, 21 June 2005\n\nHarry passed the Regular Commissions Board (RCB) in September 2004 and entered the Royal Military Academy Sandhurst on 8 May 2005, where he was known as Officer Cadet Wales, and joined Alamein Company.[34][35] His entry into the academy had to be delayed for 4 months as he recovered from an injury to his left knee.[36] In April 2006, Harry completed his officer training and was commissioned as a Cornet (second lieutenant) in the Blues and Royals, a regiment of the Household Cavalry in the British Army. On 13 April 2008, when he reached two years' seniority, Harry was promoted to lieutenant.[37]\n\nIn 2006 it was announced that Harry's unit was scheduled to be deployed in Iraq the following year. A public debate ensued as to whether he should serve there. In April 2006, the Ministry of Defence announced that Harry would be shielded from the front line if his unit was sent to war, with a spokeswoman stating that he was expected to \"undertake the fullest range of deployments\", but his role needed to be monitored as \"his overt presence might attract additional attention\" that would put him or those he commanded at risk.[38] Defence Secretary John Reid said that he should be allowed to serve on the front line of battle zones. Harry agreed saying, \"If they said 'no, you can't go front line' then I wouldn't drag my sorry ass through Sandhurst and I wouldn't be where I am now.\"[39] Harry completed the Troop Leaders' Course in October 2006 and rejoined his regiment in Windsor, where he was put in charge of a troop of 11 soldiers and four Scimitar reconnaissance vehicles.[40] The Ministry of Defence and Clarence House made a joint announcement on 22 February 2007 that Harry would be deployed with his regiment to Iraq, as part of the 1st Mechanised Brigade of the 3rd Mechanised Division – a move supported by Harry, who had stated that he would leave the army if he was told to remain in safety while his regiment went to war.[41]\n\nThe head of the British army at the time, General Sir Richard Dannatt, said on 30 April 2007 that he had personally decided that Harry would serve with his unit in Iraq as a troop commander,[42][43] and Harry was scheduled for deployment in May or June 2007 to patrol the Maysan Governorate.[44] By 16 May, however, Dannatt announced that Harry would not serve in Iraq;[45] concerns included Harry being a high-value target (as several threats by various groups had already been made against him) and the dangers the soldiers around him would face should any attempt be made on his life or if he were captured. Clarence House made public Harry's disappointment with the decision, though he said he would abide by it.[46]\n\nIn the summer of 2007 Harry was trained as a joint terminal attack controller at RAF Leeming.[47] In early June 2007, it was reported that Harry had arrived in Canada to train alongside soldiers of the Canadian Forces and British Army, at CFB Suffield near Medicine Hat, Alberta. It was said that this was in preparation for a tour of duty in Afghanistan, where Canadian and British forces were participating in the NATO-led Afghan War.[48] This was confirmed in February of the following year when the British Ministry of Defence revealed that Harry had been secretly deployed as a joint terminal attack controller to Helmand Province in Afghanistan for the previous ten weeks.[49][50] The revelation came after the media – notably, German newspaper Bild and Australian magazine New Idea[51][52] – breached the blackout placed over the information by the Canadian and British authorities.[53] He was immediately pulled out due to the fear that the media coverage would put his security and the security of fellow soldiers at risk.[54][55] It was later reported that Harry helped Gurkha troops repel an attack from Taliban insurgents,[56] and performed patrol duty in hostile areas while in Afghanistan.[57][58][59]\n\nHarry's tour made him the first member of the British royal family to serve in a war zone since his uncle Prince Andrew, who flew helicopters during the Falklands War. For Harry's service, his aunt Princess Anne presented him with an Operational Service Medal for Afghanistan at the Combermere Barracks in May 2008.[60]\n\nArmy Air Corps and second deployment to Afghanistan\n\nIn October 2008, it was announced that Harry would follow his brother, father and uncle in learning to fly military helicopters.[61][62] Harry attended the Defence Helicopter Flying School at RAF Shawbury, where he joined his brother.[63] He initially failed his pilot's theory test in February 2009.[64] Prince Charles presented him with his flying brevet (wings) on 7 May 2010 at a ceremony at the Army Air Corps Base (AAC), Middle Wallop.[65] Harry was awarded his Apache Flying Badge on 14 April 2011.[66] On 16 April 2011, it was announced that Harry had been promoted to captain.[67] In June 2011, Clarence House announced that Harry would be available for deployment in current operations in Afghanistan as an Apache helicopter pilot. The final decision rested with the Ministry of Defence's senior commanders, including principally the Chief of the Defence Staff in consultation with the wishes of Harry, the Prince of Wales, and the Queen.[68] In October, he was transferred to a US military base in California to complete his helicopter gunship training.[69] This final phase included live-fire training and \"environmental and judgment training\" at naval and air force facilities in California and Arizona.[70] In the same month, it was reported that Harry was top of his class in extensive training undertaken at the Naval Air Facility, El Centro, California.[71] While training in Southern California, he spent time in San Diego.[72] In November 2011, Harry returned to England. He went to Wattisham Airfield in Suffolk, in the east of England, to complete his training to fly Apache helicopters.[73]\n\nOn 7 September 2012, Harry arrived at Camp Bastion in southern Afghanistan as part of the 100-strong 662 Squadron, 3 Regiment, Army Air Corps,[74] to begin a four-month combat tour as a co-pilot and gunner for an Apache helicopter.[75] On 10 September, within days of arriving in Afghanistan, it was reported that the Taliban had threatened his life.[76] On 18 September 2012, it was reported that Harry had been moved to a safe location after an attack by the Taliban on Camp Bastion that killed two US marines.[77] Defence Secretary Philip Hammond stated that \"additional security arrangements\" were put in place, for Harry could be a potential target, but added that he would face \"the same risk as any other Apache pilot\" while in combat.[78] In files obtained on the incident, Major General Gregg A. Sturdevant was quoted as saying \"The night of the attack, he slept through the entire thing. We didn't do anything special for him. He came and went, and you never would have known he was there\" and \"the only thing special we did for him was we had a place identified as a safe house in case the base came under attack.\"[79] On 21 January 2013, it was announced that Harry was returning from a 20-week deployment in Afghanistan.[80] On 8 July 2013, the Ministry of Defence announced that Harry had successfully qualified as an Apache aircraft commander.[81] Harry compared operating the Apache's weapons systems in Afghanistan to playing video games.[82][83]\n\nHarry later revealed in his 2023 memoir Spare that he flew on six missions that resulted in him killing 25 Taliban members, writing that he felt he was trained to not view them as \"people\" but instead as \"chess pieces\" that had been taken off the board. He added that \"It's not a number that gave me any satisfaction. But neither was it a number that made me feel ashamed.\"[84] Following the publishing of Harry's claims, Pen Farthing, a British former Royal Marines commando and founder of the Nowzad Dogs charity, was evacuated from Kabul on 6 January 2023 to avoid \"potential reprisal attacks on ex-forces people\".[85][86] Harry's revelations prompted backlash from both Taliban members and British politicians and military figures.[87]\n\nHQ London District and Invictus Games\n\nHarry (left) talking to an injured soldier at the Walter Reed National Military Medical Center, Bethesda, Maryland, US; 15 May 2013\n\nOn 17 January 2014, the Ministry of Defence announced that Harry had completed his attachment to 3 Regiment Army Air Corps, and would take up a staff officer role, SO3 (Defence Engagement) in HQ London District. His responsibilities would include helping to coordinate significant projects and commemorative events involving the Army in London. He was based at Horse Guards in central London.[88]\n\nOn 6 March 2014, Harry launched Invictus Games, a Paralympic-style sporting event for injured servicemen and women, which was held on 10–14 September 2014.[89] Harry met British hopefuls for the Invictus Games at Tedworth House in Wiltshire for the start of the selection process on 29 April 2014.[90] On 15 May 2014, Harry attended a ticket sale launch for Invictus Games at BT Tower, from where he tweeted on the Invictus Games' official Twitter account as the president of the Games.[91] To promote the Games, he was interviewed by BBC Radio 2's Chris Evans along with two Invictus Games hopefuls. He said: \"[The Invictus Games] is basically my full-time job at the moment, making sure that we pull this off.\" The show aired on 31 July 2014.[92] Harry later wrote an article in The Sunday Times about his experiences in Afghanistan: how they had inspired him to help injured personnel and how, after the trip to the Warrior Games, he had vowed to create the Invictus Games.[93] Harry and officials attended the British Armed Forces Team announcement for Invictus Games at Potters Field Park in August 2014.[94][95] As president of the Invictus Games, he attended all events related to the Games from 8 to 14 September 2014.[96]\n\nIn January 2015, it was reported that Harry would take on a new role in supporting wounded service personnel by working alongside members of the London District's Personal Recovery Unit for the MOD's Defence Recovery Capability scheme to ensure that wounded personnel have adequate recovery plans. The palace confirmed weeks later[97] that the scheme was established in partnership with Help for Heroes and the Royal British Legion.[98] In late January 2015, Harry visited The Battle Back Centre[99] set up by the Royal British Legion, and Fisher House UK at the Queen Elizabeth Hospital Birmingham. A partnership between Help for Heroes, the Fisher House Foundation and the Queen Elizabeth Hospital Birmingham (QEHB) Charity created the Centre.[100] Fisher House Foundation is one of the Invictus Games' sponsors.[101] In February and March 2015, Harry visited Phoenix House in Catterick Garrison, North Yorkshire, a recovery centre run by Help for Heroes. He also visited Merville Barracks in Colchester, where Chavasse VC House Personnel Recovery Centre is located, run by Help for Heroes in partnership with the Ministry of Defence and Royal British Legion.[102]\n\nSecondment to Australian Defence Force\n\nHarry in New South Wales, May 2015\n\nOn 17 March 2015, Kensington Palace announced that Harry would leave the Armed Forces in June.[103] Before then, he would spend four weeks throughout April and May at army barracks in Darwin, Perth and Sydney whilst seconded to the Australian Defence Force (ADF). After leaving the Army, while considering his future, he would return to work in a voluntary capacity with the Ministry of Defence, supporting Case Officers in the Ministry's Recovery Capability Programme. He would be working with both those who administer and receive physical and mental care within the London District area.[103][104]\n\nOn 6 April 2015, Harry reported for duty to Australia's Chief of the Defence Force, Air Chief Marshal Mark Binskin at the Royal Military College, Duntroon in Canberra, Australia.[105] Harry flew to Darwin later that day to begin his month-long secondment to the ADF's 1st Brigade. His visit included detachments to NORFORCE as well as to an aviation unit.[106] While in Perth, he trained with Special Air Service Regiment (SASR), participating in the SASR selection course, including a fitness test and a physical training session with SASR selection candidates. He also joined SASR members in Perth for live-fire shooting exercises with numerous Special Forces weapons at a variety of ranges. Harry completed an insertion training exercise using a rigid-hull inflatable boat. In Sydney, he undertook urban operations training with the 2nd Commando Regiment. Training activities included remotely detonating an Improvised Explosive Device (IED) and rappelling from a building. He also spent time flying over Sydney as co-pilot of an Army Black Hawk helicopter and participated in counter-terrorism training in Sydney Harbour with Royal Australian Navy clearance divers.[107]\n\nHarry's attachment with the ADF ended on 8 May 2015,[108] and on 19 June 2015 he resigned his short service commission.[109][110]\n\nPost-military service\n\nIn 2021, Harry described his 10 years (2005–2015) in the army as \"the happiest times in my life\".[111] Since leaving the army, he has been closely involved with the armed forces through the Invictus Games, honorary military appointments and other official engagements. On 19 December 2017, he succeeded his grandfather Prince Philip as the Captain General Royal Marines.[112] In May 2018, he was promoted to the substantive ranks of Lieutenant Commander of the Royal Navy, Major of the British Army and Squadron Leader of the Royal Air Force.[113]\n\nOn 18 January 2020, Buckingham Palace announced that an agreement had been reached for Harry \"to step back from Royal duties, including official military appointments\".[114] In February 2021, the Palace confirmed that the Duke would give up his position as Captain General Royal Marines and hand back all the other honorary military appointments.[115]\n\nPersonal life\n\nBachelorhood\n\nChelsy Davy, the daughter of Zimbabwean South Africa-based businessman Charles Davy, was referred to as Harry's girlfriend in an interview conducted for his 21st birthday, and Harry said he \"would love to tell everyone how amazing she is but once I start talking about that, I have left myself open.... There is truth and there is lies and unfortunately I cannot get the truth across.\"[116] Davy was present when Harry received his Operational Service Medal for Afghanistan[60] and also attended his graduation ceremony when he received his flying wings from his father.[65] In early 2009, it was reported the pair had parted ways after a relationship that had lasted for five years.[117]\n\nIn his 2023 memoir, Harry states that months after breaking up with Davy he was introduced to Caroline Flack, whom he described as \"funny\", \"sweet\", and \"cool\".[118] The two saw each other for a while before press intrusion \"tainted\" their relationship \"irredeemably\" according to Harry.[118] Flack had discussed the relationship in her own autobiography as well.[119][120]\n\nIn May 2012, Harry's cousin Princess Eugenie introduced him to Cressida Bonas, an actress and model who is the granddaughter of Edward Curzon, 6th Earl Howe.[121] On 30 April 2014, it was reported that the couple had parted amicably.[122]\n\nMarriage and family\n\nWith Markle on Christmas Day, 2017\n\nIn mid-2016, Harry began a relationship with American actress Meghan Markle.[124][125][126] According to the couple, they first connected with each other via Instagram,[127] though they have also said that they were set up on a blind date by a mutual friend in July 2016. On 8 November, eight days after the relationship was made public by the press, Harry directed his communications secretary to release a statement on his behalf to express personal concern about pejorative and false comments made about his girlfriend by mainstream media and internet trolls.[128][129] In September 2017, Harry and Markle first appeared together in public at the Invictus Games in Toronto.[130][131] Their engagement was announced on 27 November 2017 by Harry's father.[132][133][124][134] The announcement prompted generally positive comments about having a mixed-race person as a member of the royal family,[135] especially in regard to Commonwealth countries with populations of blended or native ancestry.[136] On the morning of the wedding, Queen Elizabeth II conferred the title of Duke of Sussex upon Harry; Markle became Duchess of Sussex through her marriage to him later that day.[137] The marriage ceremony was held at St George's Chapel, Windsor Castle on 19 May 2018.[138][139] The couple later revealed in the 2021 television interview Oprah with Meghan and Harry that, three days prior to the ceremony, they had privately exchanged vows in their garden, in the presence of the Archbishop of Canterbury.[140] However, this earlier exchange of vows was not an official religious or legally recognised marriage.[141][142]\n\nThe Duke and Duchess initially lived at Nottingham Cottage in London, in the grounds of Kensington Palace.[143] In May 2018, it was reported that they had signed a two-year lease on WestfieldLarge, located on the Great Tew Estate in the Cotswolds.[144] They gave up the lease after photos of the house and its interior were published by a paparazzi agency.[144] The couple considered settling at the 21-room Apartment 1 within Kensington Palace,[145] but moved to Frogmore Cottage in the Home Park of Windsor Castle which Queen Elizabeth II had recently gifted to them instead.[146][147] The Crown Estate refurbished the cottage at a cost of £2.4 million, paid out of the Sovereign Grant, with the Duke later reimbursing expenses beyond restoration and ordinary maintenance, a part of which was offset against rental payments that were due at the time.[148][149][150] On 6 May 2019, the Duke and Duchess's son, Archie, was born.[151] Their office was moved to Buckingham Palace and officially closed on 31 March 2020 when the Sussexes ceased \"undertaking official engagements in support of the Queen\".[152][153] After some months in Canada and the United States, the couple bought a house in June 2020 on the former estate of Riven Rock in Montecito, California.[154][155] The next month, the Duchess suffered a miscarriage.[156] On 4 June 2021, their daughter, Lilibet, was born.[157] The Duke and Duchess have owned a Labrador named Pula, and two Beagles named Guy and Mamma Mia.[158][159]\n\nIn 2017, Harry stated that he had \"five or six\" godchildren, some of whom later attended his wedding.[160][161]\n\nHealth\n\nIn May 1988, Harry underwent a surgery for a minor hernia.[162] In November 2000, he broke his thumb while playing football at Eton and underwent a minor operation.[163] In his memoir, Spare, Harry admits that he took cocaine at the age of 17.[164] In 2002, it was reported that, with Charles's encouragement, Harry had paid a visit to a drug rehabilitation unit to talk to drug addicts after it had emerged that he had been smoking cannabis and drinking at his father's Highgrove House and at a local pub in the summer of 2001.[165][166][167] He adds in his memoir that he smoked cannabis at Eton and in Kensington Palace gardens,[168] but he later told a court that \"he never smoked in [his] father's house\".[169] In the memoir, he also detailed taking magic mushrooms at a party at Courteney Cox's house in January 2016.[170][171]\n\nIn 2017 and during an appearance on Bryony Gordon's podcast Mad World, Harry acknowledged that with the support of his brother he had sought counselling years after his mother's death.[172][173] He added that he had struggled with aggression, had suffered from anxiety during royal engagements, and had been \"very close to a complete breakdown on numerous occasions\".[172] He later added that he had taken up boxing as a way of coping with mental stress and \"letting out aggression\".[174] In other interviews he stated that besides therapy he took alcohol to cope and used experimental drugs recreationally, including \"psychedelics, Ayahuasca, psilocybin, mushrooms.\"[175][176] He also stated that what he experienced after his mother's death \"was very much\" post-traumatic stress disorder (PTSD).[177]\n\nIn his mental-health television documentary, The Me You Can't See, which premiered in 2021, he added that he had undergone four years of therapy to address his mental health issues, having been encouraged to do so by his future wife after they had started dating.[178] He also mentioned that he had suffered from \"panic attacks [and] severe anxiety\" in his late 20s and that the heavy load of official visits and functions had eventually \"led to burnout\".[178] In an episode of Armchair Expert, Harry attributed his mental health issues to the ineffective parenting style of previous generations and to the \"genetic pain and suffering\" passed down in his family, adding that he believed his issues stemmed from \"the pain or suffering that perhaps my father or my parents had suffered\".[179][180] In his 2023 memoir, Harry described himself as an agoraphobe.[181]\n\nPolitical views\n\nIn September 2020, Harry and his wife released a video addressing American voters to \"reject hate speech, misinformation and online negativity\" in the 2020 United States presidential election, which was seen by some as an implicit endorsement of Joe Biden.[182] Harry was the subject of a prank by the Russian comedy duo Vovan and Lexus, who posed as climate activist Greta Thunberg and her father during two phone calls on New Year's Eve and 22 January 2020.[183] During the conversations, Harry described his decision to leave the monarchy as \"not easy\" and criticised Donald Trump's stance on climate change and his support of the coal industry.[183]\n\nIn May 2021, Harry was a guest on Dax Shepard and Monica Padman's podcast Armchair Expert during which he talked about the freedom of speech and laws related to it in the United States, stating \"I've got so much I want to say about the First Amendment as I sort of understand it, but it is bonkers.\"[184] He added that it was \"a huge subject and one which [he didn't] understand\", emphasising that one could \"capitalise or exploit what's not said rather than uphold what is said.\"[184] The comments were met by backlash from conservative Americans and Britons, prompting figures such as Ted Cruz, Dan Crenshaw, Nigel Farage, Candace Owens, Jack Posobiec, and Laura Ingraham to criticise him publicly.[184][185]\n\nIn November 2021, in a panel at Wired's Re:Wired Conference, Harry claimed that a day before the January 6 United States Capitol attack he emailed Jack Dorsey, CEO of Twitter, and 'warned' of potential civil unrest, but had not received a response.[186][187][188] In the same month, Conservative politician and MP Johnny Mercer, who was leading the efforts to waive visa fees for foreign-born UK veterans and their families, announced in the Commons that the Duke of Sussex was supportive of their proposal and viewed it as \"morally right\" and not as \"a political intervention\".[189]\n\nIn June 2022, in an interview with Jessica Yellin for Vogue, Meghan described Harry's reaction to the Supreme Court of the United States's decision that abortion is not a protected constitutional right as \"guttural\".[190] Harry later condemned the decision as \"rolling back of constitutional rights\" in his address to the United Nations on Mandela Day in July 2022.[191] Associate justice of the Supreme Court Samuel Alito, who wrote the majority decision for the case, criticised foreign figures including Harry for their comments on \"American law\" during a speech.[192]\n\nIn June 2023, Harry broke royal protocol by criticising the UK government in his witness statement to a court.[193] He argued that both the British press and the government were \"at rock bottom\" and instead of scrutinising the government the press got \"into bed with them so they can ensure the status quo\".[193]\n\nDrug use and U.S. visa application\n\nIn March 2023, the Heritage Foundation (HF) sent a dossier on Harry's drug use to different government entities, asking whether he had admitted to past drug use on his U.S. visa application.[194] The following month, they filed a lawsuit against the U.S. Department of Homeland Security (DHS) demanding his immigration records.[195]\n\nIn March 2024, the U.S. government was ordered to hand over Harry's visa application details to a D.C. court. The move followed an initial failed freedom of information request that was asked for by the HF from DHS a year earlier.[196] In September 2024, the case brought forward by the HF was closed due to the filing of two sealed orders and a sealed \"memorandum opinion\".[197] The HF subsequently filed a request to \"vacate\" the ruling and release confidential correspondence between the judge and DHS.[198] Judge Carl Nichols ordered for the redacted versions of the court documents to be released by 18 March 2025.[199] 82 pages across seven exhibits that were heavily redacted and did not include the visa application itself were released, though his immigration status was withheld and it was not revealed whether he disclosed his drug use on his visa application.[200] Immigration officials argued in the case that HF could \"not point to any evidence of government misconduct\" while Harry's team stated that he was \"truthful\" and the documents suggested that he did not receive preferential treatment.[200]\n\nIn February 2025, new U.S. President Donald Trump ruled out deporting Harry from the US, telling the New York Post: \"I'll leave him alone.\"[199]\n\nPublic life\n\nAt the age of 21, Harry was appointed a Counsellor of State and began his duties in that capacity. The Queen granted Harry and William their own royal household on 6 January 2009. Previously, William and Harry's affairs had been handled by their father's office at Clarence House in central London. The new household released a statement announcing they had established their own office at nearby St James's Palace to look after their public, military and charitable activities.[201] In March 2012, Harry led an official visit to Belize as part of the Queen's Diamond Jubilee celebrations.[202] He continued to the Bahamas and Jamaica, where the Prime Minister, Portia Simpson-Miller, was considering initiating a process of turning Jamaica into a republic.[203] He then visited Brazil to attend the GREAT Campaign.[204] Harry also played tambourine and took part in the music video for the song \"Sing\", which was released in May 2012 to commemorate the Diamond Jubilee.[205]\n\nBetween 9 and 15 May 2013, he made an official visit to the United States. The tour promoted the rehabilitation of injured American and UK troops, publicised his own charities and supported British interests. It included engagements in Washington, DC, Colorado, New York, New Jersey, and Connecticut. He met survivors of Hurricane Sandy in New Jersey.[206][207] In October 2013, he undertook his first official tour of Australia, attending the International Fleet Review at Sydney Harbour.[208] He also paid a visit to the Australian SAS HQ in Perth.[209] In May 2014, he visited Estonia and Italy. In Estonia, he visited Freedom Square in the capital Tallinn to honour fallen Estonian soldiers. He also attended a reception at the Estonian Parliament[210] and a NATO military exercise.[211] In Italy, Harry attended commemorations of the 70th anniversary of the Monte Cassino battles, in which Polish, Commonwealth and British troops fought.[212][213] He opened the Field of Remembrance at Westminster Abbey on 6 November 2014,[214] a task usually performed by Prince Philip.[215]\n\nBefore reporting for duty to the Australian Defence Force (ADF), Harry visited the Australian War Memorial in Canberra on 6 April 2015.[105] He made a farewell walkabout at the Sydney Opera House on 7 May 2015 and visited Macquarie University Hospital.[216][217] He joined his father in Turkey to attend commemorations of the centenary of the Gallipoli Campaign in April 2015.[218] In October 2015, Harry carried out a day of engagements in the US. He launched the Invictus Games Orlando 2016 with First Lady Michelle Obama and Second Lady Jill Biden at Fort Belvoir.[219] He later attended an Invictus Games board meeting and a reception to celebrate the launch at the British Ambassador's Residence.[220] Harry, as patron of Sentebale, travelled to Lesotho to attend the opening of the Mamohato Children's Centre in November 2015.[221] From 30 November to 3 December 2015, he made an official visit to South Africa.[222] He visited Cape Town, where he presented the insignia of the Order of the Companions of Honour to the Archbishop on behalf of the Queen.[223] Harry also played the Sentebale Royal Salute Polo Cup, at Val de Vie Estate in Cape Town, fundraising for Sentebale.[224] He visited Nepal 19–23 March 2016.[225] He stayed until the end of March 2016 to help rebuild a secondary school with Team Rubicon UK, and visited a Hydropower Project in Central Nepal.[226]\n\nThe Duke with British prime minister Boris Johnson at the 2020 UK–Africa Investment Summit\n\nIn April 2018, he was appointed Commonwealth youth ambassador, a position which he held until March 2020.[227][228] Also in that month, Harry became a patron of Walk of America, a campaign which brings together a number of veterans who will take part in a 1,000-mile expedition across the US in mid-2018.[229][230] The Prince was appointed the president of The Queen's Commonwealth Trust, which focuses on projects involving children and welfare of prisoners, in April.[231] Periodically, online QCT chat sessions were conducted and uploaded to YouTube for general public viewing.[232] He remained the charity's president until February 2021.[115] In July 2018, Harry travelled to Dublin, Ireland, alongside his wife Meghan, which marked their first overseas visit as a couple.[233][234] In October 2018, the Duke and Duchess of Sussex travelled to Sydney, for the 2018 Invictus Games.[235] This formed part of a Pacific tour that included Australia, Fiji, Tonga and New Zealand.[236][237]\n\nHarry identifies as a feminist.[238][239] During their visit to Morocco in February 2019, the Duke and Duchess focused on projects centred on \"women's empowerment, girls' education, inclusivity and encouragement of social entrepreneurship\".[240] As part of establishing a separate office from that of the Duke and Duchess of Cambridge in 2019, the Duke and Duchess created an Instagram social media account, which broke the record for the fastest account at the time to reach a million followers.[241] During his trip to Angola in 2019, the Duke visited the Born Free to Shine project in Luanda, an initiative by First Lady Ana Dias Lourenço which aims to \"prevent HIV transmission from mothers to babies\" through education, medical testing and treatment. He also met HIV+ youth and teenagers during his visit.[242] During his visit to the Luengue-Luiana National Park, the Duke unveiled an initiative by the Queen's Commonwealth Canopy to help with protecting \"an ancient elephant migration route\" by providing safe passage for them in the forest.[243] In September and October 2019, a Southern African tour included Malawi, Angola, South Africa and Botswana. Because infant son Archie travelled with the Sussexes, this was \"their first official tour as a family\".[244] Harry completed 1,190 engagements between 2006 and 2019.[245]\n\nStepping back and subsequent public appearances\n\nIn January 2020, the Duke and Duchess announced that they were stepping back from their role as senior members of the royal family, and would balance their time between the United Kingdom and North America.[246][247] A statement released by the Palace confirmed that the Duke and Duchess were to become financially independent and cease to represent the Queen.[248] At the time of the announcement of Harry and Meghan's decision to \"step back\" as senior members of the royal family in 2020, 95% of the couple's income derived from the £2.3 million given to them annually by Harry's father, Charles, as part of his income from the Duchy of Cornwall.[249] The couple retain their HRH stylings but are not permitted to use them.[248] The formal role of the Duke and Duchess was subject to a twelve-month review period, ending in March 2021. In March 2020, Harry attended the opening of the Silverstone Experience in Silverstone Circuit together with racing driver Lewis Hamilton. Harry's appearance at the museum was his final solo engagement as a senior royal.[250] He and Meghan attended the Commonwealth Day service at Westminster Abbey on 9 March 2020, which was their last engagement as a couple before they officially stepped down on 31 March. Harry's personal wealth was estimated at £30 million by The Daily Telegraph in 2020.[249] In April 2021, Harry returned to the UK to attend the funeral of his grandfather, Prince Philip, Duke of Edinburgh. Meghan did not attend due to her pregnancy.[251] The following year, they made their first official appearance in the UK in June 2022 while attending the Platinum Jubilee National Service of Thanksgiving.[252]\n\nThe Sussexes visited the UK and Germany in September 2022 for a number of charity events in Manchester and Düsseldorf.[253] On 8 September 2022, while Harry and Meghan were in London preparing to attend a charity event, Queen Elizabeth II died at Balmoral Castle in Scotland, and they remained in the United Kingdom for her funeral.[254]\n\nHarry and Meghan visited Nigeria in May 2024 to honour the work of the Invictus Games. According to CNN, their trip focused on \"sports rehabilitation, mental health, and women's empowerment\".[255] On 3 November 2025, Harry's office announced that he would travel to Toronto, Canada, for a series of events ahead of Remembrance Day.[256]\n\nPublicly funded police security\n\nHarry faced difficulties with obtaining and maintaining publicly funded security, both in Canada and the United Kingdom, after he and Meghan announced their self-demotion within the royal family. While the couple resided on Vancouver Island, the Canadian Taxpayers Federation launched a petition calling for the Royal Canadian Mounted Police to cease providing security to the Sussexes.[257] The Government of Canada announced RCMP security would not be provided after March 2020 when the couple's status changed.[258][259] A similar petition circulated in the UK in mid-March 2020.[260] The backlash in the two countries led President Donald Trump to preemptively assert that the United States would not pay either; though, the couple never intended to ask for it while in the US.[261]\n\nIn January 2022, it was reported that Harry had been in a legal fight since September 2021 over the Home Office's refusal to allow him to pay for police protection.[262][263] He had made the offer to pay during the Sandringham Summit and \"self-evidently believed\" that it would be passed on to the government.[264] Following the first court hearing of the case by the High Court, it was revealed that Harry had 'exceptional status' and the Royal and VIP Executive Committee (RAVEC) still determined his personal protective security on a case-by-case basis.[265][266] After receiving applications by the Duke and the Home Office to keep parts of the case private, the High Court ruled in March 2022 that some parts of it would remain confidential.[267] Mr Justice Swift also reacted to the Duke's legal team sending a copy of the ruling to someone who was not a lawyer, describing it as \"entirely unacceptable\".[267] In July 2022, Mr Justice Swift granted permission for part of Harry's claim to proceed for a judicial review.[268]\n\nHarry filed a lawsuit against the Home Office and the Metropolitan Police in August 2022, challenging the decision by RAVEC from January 2022 which stated that State security could not be made available to private individuals even if they wished to pay for it themselves.[269][270] In February 2023, a High Court judge ruled that the second case should be thrown out;[271] however, the decision was later appealed by Harry's legal team.[272] He lost the legal challenge in May 2023, meaning that he will not be allowed to make private payments for police protection.[273] In June 2023, a Freedom of Information request revealed that Harry's legal fight with the Home Office had cost £502,236, with £492,000 covered by the state and the remaining £10,000 covered by Harry.[274] In February 2024, the High Court ruled against Harry in his case against the Home Office and upheld the decision by RAVEC, stating that there had been no unlawfulness in the decision-making process for his security arrangements.[275] In April 2024, he lost an initial attempt to appeal against the ruling.[276] Despite his lawyers' attempts to have him pay no more than 50% of the Home Office's legal costs of defending his challenge, the judge held him liable for 90% of the costs.[276] It was also revealed that during the proceedings Harry had leaked information via email to \"a partner of Schillings\" and to Johnny Mercer, for which he apologised to the court.[277] In May 2024, he was given permission by the Court of Appeal to challenge the High Court's decision.[278] His appeal was rejected by three senior judges in May 2025 and he was likely to be held liable for the UK government's legal fees.[279][280]\n\nCivilian career and investments\n\nIn summer 2019, before announcing their decision to step back in January 2020, Harry and his wife were involved in talks with Jeffrey Katzenberg, the founder of the now-defunct streaming platform Quibi, over a possible role in the service without gaining personal profits, but they eventually decided against joining the project.[281] In September 2019, it was reported that the couple had hired New York-based PR firm Sunshine Sachs, which represented them until 2022.[282][283][284] The couple has also been associated with Adam Lilling's Plus Capital, a venture capital fund designed to connect early stage companies with influencers and investors.[285] Between 2019 and 2020, Harry and Meghan contributed to the book Finding Freedom through a third-party source.[286] Despite initially denying their involvement with the book,[287] their contributions to the book became apparent during Meghan's court case against Associated Newspapers who were trying to use the book in their defense.[288][289]\n\nIn June 2020, they signed with the Harry Walker Agency, owned by media company Endeavor, to conduct paid public speaking engagements.[290] In September 2020, the Sussexes signed a five-year private commercial deal with Netflix.[291][292] In December 2020, the Duke and Duchess signed a multi-year deal with Spotify to produce and host their own programs through their audio producing company, Archewell Audio.[293][294] A holiday special was released by the couple on the service in December 2020.[295] In June 2023, Spotify announced they would not proceed with the deal, cancelling Archetypes which had run for a single season of 12 episodes.[296] Harry & Meghan, a docuseries about the Sussexes, was produced by Netflix and the couple's Archewell Productions and premiered on 8 December 2022. It is directed by Liz Garbus.[297] The series received mixed reviews.[298] In April 2024, it was announced that Archewell Productions is working with Netflix to produce two new shows – on lifestyle and on polo – for the streaming platform.[299][300] The Polo docuseries was released in December 2024 and was a critical and commercial disappointment.[301][302] In August 2025, Archewell Productions renewed its partnership with Netflix under a multi-year first-look deal, which included plans for other documentary and scripted projects.[303]\n\nIn March 2021, San Francisco-based mental health start-up BetterUp, a company that helps people get in contact with coaches or counsellors, said that Harry would become its first chief impact officer.[304][305] In the same month, Harry was appointed as a commissioner for the Aspen Institute's Commission on Information Disorder to carry out a six-month study on the state of misinformation and disinformation in the United States.[306] The study was published in November 2021 as a report with 15 recommendations.[307] In the following month, in his capacity as BetterUp's chief impact officer, Harry was interviewed by Fast Company, stating that the recent trend of people leaving their jobs (known as the Great Resignation) was something that needed to be celebrated, though his remarks were criticised for coming from a position of privilege.[308][309] In April 2022, reports emerged of criticism by the company's coaches over the new metrics placed for evaluating their services and over the opacity surrounding Harry's actual role in the firm.[310]\n\nIn April 2019, it was announced that Harry was working as co-creator and executive producer on a documentary series about mental health together with Oprah Winfrey, which was initially set to air in 2020 on Apple TV+.[311] It was later announced that the series, titled The Me You Can't See, would be released on 21 May 2021.[312] In the following month, UCAS reported an increase in the percentage of students declaring mental health issues on their university applications, citing self-help books and Harry's statements on his struggles with \"panic attacks and anxiety\" as contributing factors.[313] In October 2021, Harry and Meghan announced their partnership with Ethic, a sustainable investment firm based in New York City, which also manages the couple's investments.[314][315] According to state filings from Delaware, where the couple's Archewell foundation is registered, Harry and Meghan incorporated 11 companies and a trust beginning in early 2020 which include Orinoco Publishing LLC and Peca Publishing LLC to hold the rights for their books as well as Cobblestone Lane LLC and IPHW LLC which are holders of their foundation's logos.[316]\n\nIn July 2021, it was announced that Harry was set to publish his memoir Spare via Penguin Random House, with Harry reportedly earning an advance of at least $20 million.[317][318] Spare was ghostwritten by novelist J. R. Moehringer.[319][320] The memoir is reportedly the first of a four-book publishing deal that is set to include a second book by Harry and a wellness guide by Meghan.[321] Spare was officially published on 10 January 2023 in 16 languages, and it has since become the UK's fastest selling non-fiction book with 400,000 confirmed sales in all formats on publication day.[322][323] Harry announced that $1.5 million of the proceeds from the memoir were pledged to the charity Sentebale,[324] while £300,000 would be given to WellChild.[325]\n\nCharity work\n\nHumanitarian and environmental activities\n\nHarry has granted his patronage to organisations including WellChild, Dolen Cymru, MapAction and the London Marathon Charitable Trust; he stepped down from MapAction in 2019 and the London Marathon Charitable Trust in 2021.[326][327][328] In 2007 he and William organised the Concert for Diana, in memory of their mother, which benefited the charities and patronages of Diana, William, and Harry.[329] In October 2008, Harry and his brother embarked on the 1,000 mile eight-day Enduro Africa motorbike ride across South Africa to raise money for Sentebale, UNICEF and the Nelson Mandela Children's Fund.[330] In September 2009, William and Harry set up The Foundation of Prince William and Prince Harry to enable them to take forward their charitable ambitions.[331][332][333] Harry left the charity in June 2019.[334]\n\nAfter taking part in an unfinished trip to the North Pole with Walking With The Wounded in 2011, Harry joined the charity's 200-mile expedition to the South Pole in Antarctica during December 2013, accompanying twelve injured servicemen and women from the UK, the US and the Commonwealth.[335][336] As patron of Walk of Britain, he walked with the team on 30 September[337] and 20 October 2015.[338] To raise awareness for HIV testing, Harry took a test live on the royal family Facebook page on 14 July 2016.[339] He later attended the 21st International AIDS Conference in Durban, South Africa, on 21 July 2016.[340][341] On World AIDS Day, Harry and Rihanna helped publicise HIV testing by taking the test themselves.[342] Since 2016 Harry has been working with Terrence Higgins Trust to raise awareness about HIV and sexual health.[343][344] In November 2019, to mark the National HIV Testing Week, the Duke interviewed HIV+ Rugby player Gareth Thomas on behalf of the trust.[345]\n\nIn December 2017, Harry guest edited BBC Radio 4's Today programme, conducting interviews with his father, then Prince of Wales, former US president Barack Obama, and others on issues such as youth violence, the Armed Forces, mental health, the Commonwealth, conservation and the environment.[346][347] Harry was officially appointed the new president of African Parks (a conservation NGO) on 27 December 2017, a position which he held until 2023 when he was appointed a member of its board of directors.[348][349] He had previously spent three weeks in Malawi with African Parks where he joined a team of volunteers and professionals to carry out one of the largest elephant translocations in history. The effort to repopulate areas decimated due to poaching and habitat loss moved 500 elephants from Liwonde and Majete National Parks to Nkhotakota Wildlife Reserve.[350] Harry had previously helped with relocating rhinos in the Okavango Delta and later became patron of the Rhino Conservation Botswana.[351] Accusations of abuse by the charity surfaced publicly in 2022 and 2024, when reports claimed that rangers managed by African Parks had been torturing, beating, raping, and forcibly displacing members of the indigenous Baka community.[352][353]\n\nWith Meghan visiting Catalyst Inc, 2018\n\nIn July 2018, the Elton John AIDS Foundation announced that the Duke of Sussex and British singer Elton John were about to launch a global coalition called MenStar that would focus \"on treating HIV infections in men\".[354][355] In May 2019, the Duke and Duchess of Sussex together with Harry's brother and sister-in-law launched Shout, the UK's first 24/7 text messaging service for those who suffer from mental issues.[356] In September 2019, the Duke launched Travalyst during his visit to the Netherlands after two years of development. The initiative is set \"to encourage sustainable practices in the travel industry\" and \"tackle climate change and environmental damage\", in collaboration with a number of companies, including Tripadvisor, Booking.com, Ctrip, Skyscanner, and Visa Inc.[357][358] The organisation later announced a partnership with Google in 2021.[359] In October 2019, along with other members of the royal family, Harry voiced a Public Health England announcement, for the \"Every Mind Matters\" mental health program.[360]\n\nIn February 2020, Harry recorded a new version of the song \"Unbroken\" with Jon Bon Jovi. The new version features backing vocals from members of the Invictus Choir.[361] The song was released on 27 March 2020, the proceeds of which were donated to the Invictus Games Foundation.[362] In April 2020, Harry launched a new initiative named HeadFIT, a platform designed to provide mental support for members of the armed forces. The initiative was developed mutually by the Royal Foundation's Heads Together campaign, the Ministry of Defence, and King's College London.[363] In June 2020, the Duke and Duchess backed the Stop Hate for Profit campaign and encouraged CEOs of different companies to join the movement.[364]\n\nWith Meghan and the U.S. ambassador to the UN Linda Thomas-Greenfield at the 2021 Global Citizen live event\n\nIn April 2021, Harry and Meghan were announced as campaign chairs for Vax Live: The Concert to Reunite the World, an event organised by Global Citizen to increase access to COVID-19 vaccinations.[365] They also announced their support for a vaccine equity fundraiser initiated by the same organisation,[366] and penned an open letter to the pharmaceutical industry CEOs urging them to address the vaccine equity crisis.[367] Later that month, he narrated \"Hope Starts Here\", a special video rereleased by African Parks to mark the Earth Day in which he urged organisations and communities to preserve biodiversity and paid tribute to his grandfather Prince Philip for his efforts as a conservationist.[368] He helped with the establishment of Peak State, a mental fitness programme aimed at providing tools and resources for managing mental health, to which he publicly lent his support in May 2021.[369][370]\n\nLike his mother, Harry has worked with the HALO Trust, an organisation that removes debris—particularly landmines—left behind by war.[371] He had previously visited a minefield in Mozambique with the charity and spent two days learning about their work and mine-clearing techniques.[372] In 2013 he was named as patron of the charity's 25th Anniversary Appeal.[373] In April 2017, he hosted the Landmine Free 2025 reception at Kensington Palace, during which the UK government announced an increase in its financial support for de-mining efforts.[374] In September 2019, he walked through a de-mining site in Angola, the same country visited by his mother 22 years earlier.[371] In June 2021, after ten members of the trust were killed by an armed group at a mine clearance camp in Afghanistan, Harry issued a statement saying the attack \"was nothing less than an act of barbarism\".[375]\n\nIn September 2021, together with First Lady Jill Biden, he hosted a virtual event for the Warrior Games, which were cancelled due to the COVID-19 pandemic.[376] In October 2021, he spoke against oil drilling in the Okavango River in an op-ed for The Washington Post.[377] In the same month and ahead of the 2021 G20 Rome summit, Harry and his wife penned an open letter together with the Director-General of the World Health Organization Tedros Adhanom, asking the G20 leaders to expedite efforts for the global distribution of COVID-19 vaccines.[378] In March 2022, they were among more than a hundred people who signed an open letter published by the People's Vaccine Alliance, asking for free global access to COVID-19 vaccines and calling out the UK, EU and Switzerland for opposing a waiver that would allow vaccine intellectual property protections to be lifted.[379] In April 2022 and in a video featuring Rhys Darby and Dave Fane on Māori Television, Harry launched an eco-travel campaign through his non-profit Travalyst, encouraging people to travel sustainably.[380] In November 2023, he was named global ambassador for Scotty's Little Soldiers,[381] one of the seven charities which he and his wife had invited people to support in lieu of giving them wedding presents.[382]\n\nIn September 2025, Harry announced that he had personally donated £1.1 million to BBC Children in Need in December 2024, describing it as a \"significant investment\" in grassroots organisations in Nottingham supporting young people affected by violence.[383][384] In the following month, he and Meghan joined a coalition of public figures, scientists, and tech experts in signing an open letter calling for a global ban on the development of artificial superintelligence until there is strong scientific consensus and public support ensuring it can be created safely and ethically, emphasising the existential risks such unchecked AI could pose to humanity.[385]\n\nSport\n\nCompeting in an exhibition sitting volleyball match between the UK and the US teams during the Warrior Games, 2013\n\nHarry has enjoyed playing sports, such as competitive polo, skiing, and motocross.[31] Like his brother and father, he has participated in polo matches to raise money for charitable causes.[31][386] Harry is also a keen Rugby football fan and supported England's bid to host rugby union's 2015 Rugby World Cup,[387] and presented the trophy at rugby league's 2019 Challenge Cup finals.[388] In 2004 Harry trained as a Rugby Development Officer for the Rugby Football Union and coached students in schools to encourage them to learn the sport. He, along with former rugby player Brian Moore, both argued that in response to Black Lives Matter, the song \"Swing Low, Sweet Chariot\" should no longer be sung in rugby context.[389][390] Between December 2016 and February 2021, he was patron of both the Rugby Football Union (RFU) and Rugby Football League (RFL), Rugby League's governing body in England.[391][115] He had served as the RFU's vice-royal patron since 2010, supporting the Queen as patron.[392]\n\nIn 2012 Harry launched Coach Core alongside his brother and sister-in-law, the Duke and Duchess of Cambridge. The program was set up following the 2012 Olympics and provides apprenticeship opportunities for people who desire to pursue a career as a professional coach.[393] In January 2017, Harry visited the Running Charity and its partner Depaul UK to highlight the role of sport in helping homeless and vulnerable people.[394] In June 2019, the Duke was present at the launch of Made by Sport, a charity coalition set to raise money to boost sport in disadvantaged communities. In his statement, he lent his support to the charity by arguing that its role in bringing sport into the life of disadvantaged people would save \"hundreds of millions of pounds\" towards treating the issues among young people.[395]\n\nSussex Royal and Archewell\n\nIn June 2019, it was announced that the Duke and Duchess of Sussex would split from The Royal Foundation and establish their own charity foundation by the end of 2019. Nevertheless, the couple would collaborate with Harry's brother and his wife on mutual projects, such as the mental health initiative Heads Together.[396][397] In July 2019, Harry and Meghan's new charity was registered in England and Wales under the title \"Sussex Royal The Foundation of The Duke and Duchess of Sussex\".[398] It was confirmed on 21 February 2020 that \"Sussex Royal\" would not be used as a brand name for the couple following their withdrawal from public life.[399] Sussex Royal Foundation was renamed \"MWX Foundation\" on 5 August 2020 and dissolved the same day.[400]\n\nIn March 2021, it was reported that the Charity Commission for England and Wales was conducting a review of the Sussex Royal organisation in a \"regulatory and compliance case\" regarding its conduct under charity law during dissolution.[401] Representatives for the couple claimed that Sussex Royal was \"managed by a board of trustees\" and that \"suggestion of mismanagement\" directed exclusively at the Duke and Duchess would be incorrect.[401] The commission later concluded that the foundation did not act unlawfully, but criticised the board of directors for expending a \"substantial proportion of funds\" to setting up and closing the charity.[402][403]\n\nIn April 2020, Meghan and Harry confirmed their new foundation (in lieu of Sussex Royal) would be called \"Archewell\".[404] The name stems from the Greek word \"arche\", which means \"source of action\"; the same word that inspired the name of their son.[404] Archewell was registered in the United States.[405] Its website was officially launched in October 2020.[406]\n\nSentebale\n\nIn 2006 Harry visited Mants'ase Children's Home near Mohale's Hoek in Lesotho, which he had first toured in 2004, and alongside Prince Seeiso of Lesotho, he launched Sentebale: The Princes' Fund for Lesotho, a charity to assist children orphaned by HIV/AIDS. In March 2025, Harry and Prince Seeiso of Lesotho resigned from their roles as patrons of Sentebale following a dispute between the charity's trustees and the chair of the board, Sophie Chandauka.[407] Chandauka reported the charity to the Charity Commission due to what she described as \"poor governance, weak executive management, abuse of power, bullying, harassment, misogyny, misogynoir – and the coverup that ensued\".[408] Chandauka later accused Harry of \"harassment and bullying at scale\" by authorising \"the release of a damaging piece of news to the outside world\", adding that his \"toxic\" brand was \"the number one risk\" for the organisation.[409] There were also allegations that through his contacts Harry had asked Chandauka to issue a statement in support of his wife following an awkward interaction between the two women during a polo match in Miami, and had later demanded that she \"explain herself\" in a note that was described as \"unpleasant\" in tone and reportedly used \"imperious\" language.[410] In August 2025 the Charity Commission announced it found no evidence of \"widespread or systemic bullying or harassment, including misogyny or misogynoir\" or \"over-reach\" by either Chandauka or Harry but acknowledged a \"strong perception of ill treatment felt by a number of parties\" and stated that deciding on specific allegations of bullying was outside the purview of its regulatory authority.[411] It also criticised all sides for allowing the conflict \"to play out publicly\" and cited poor internal governance and a \"failure to resolve disputes internally\" as factors that impacted the charity's reputation.[411]\n\nPublic image\n\nIn his youth, Harry earned a reputation for being rebellious, leading the tabloid press to label him a \"wild child\".[412] At the age of 17, he was seen smoking cannabis, drinking underage with friends, and clashing physically with paparazzi outside nightclubs.[412][413] In early 2005, he was photographed at a \"Colonial and Native\"-themed birthday party in Wiltshire wearing a Nazi German Afrika Korps uniform with a swastika armband.[414] His choice sparked a backlash from the media, politicians, and religious figures.[415] Clarence House later issued a public statement in which Harry apologised for his behaviour.[416][417] In an interview for his 21st birthday he stated that it \"was a very stupid thing to do and I've learnt my lesson\".[418]\n\nIn January 2005, in response to an inquiry about his Zimbabwean girlfriend Chelsy Davy, Harry responded \"She's not black or anything, you know\".[419] In January 2009, the British tabloid, the News of the World, revealed a video made by Harry three years earlier in which he referred to a Pakistani fellow officer cadet as \"our little Paki friend\" and called a soldier wearing a camouflage hood a \"raghead\". These terms were described by the Leader of the Opposition at the time David Cameron as \"unacceptable\", and by The Daily Telegraph as \"racist\". A British Muslim youth organisation called Harry a \"thug\".[421] Further extracts showed him telling a comrade \"I love you\" before giving him a kiss on the cheek and licking his face, and asking another whether he felt gay, queer, or on the side.[422][423] Clarence House immediately issued an apology from Harry, who stated that no malice was intended in his remarks.[424] Subsequently, it was reported that the military had instructed Harry to attend a diversity course.[425] In the same year, British stand-up comedian Stephen K. Amos alleged that after a stand-up show for Charles's 60th birthday celebrations in November 2008 Harry had commented on his performance by saying, \"You don't sound like a black chap\", though he hoped that the remarks were made in jest.[426]\n\nIn October 2007, a video from Harry's trip to Namibia with his friends surfaced, which showed him snorting vodka and licking a male friend's nipples.[427][428] While on holiday in Las Vegas in August 2012, Harry and an unknown young woman were photographed naked in a Wynn Las Vegas hotel room, reportedly during a game of strip billiards. The pictures were leaked by American celebrity website TMZ on 21 August 2012,[429] and reported worldwide by mainstream media on 22 August 2012.[430][431] The photographs were shown by the American media, but British media were reluctant to publish them.[432] Royal aides suggested Clarence House would contact the Press Complaints Commission (PCC) if British publications used the pictures.[433] St James's Palace confirmed that Harry was in the photographs, saying that he was essentially a victim whose privacy had been invaded and contacted the PCC upon hearing that a number of British newspapers were considering publishing the photographs.[434] On 24 August 2012, The Sun newspaper published the photographs.[435] At a 2014 event in England, Foo Fighters drummer Taylor Hawkins was slapped by Harry after he had told him \"I can't wake up, so tired\", with Harry subsequently stating \"You awake now?\"[436] Hawkins added \"I got slapped in the face by the prince. That's OK really, if you think about it. But in the moment, I was like, 'You fucking slapped me, dude.'\"[436]\n\nIn December 2021, reports emerged about Harry's meetings with Saudi businessman Mahfouz Marei Mubarak bin Mahfouz, whose receipt of a CBE became the subject of an investigation by the Scottish Charity Regulator.[437] Mahfouz had met Harry in 2013 and 2014 and donated £50,000 to his charity Sentebale and £10,000 to Walking With The Wounded, of which Harry is patron. The Sunday Times claimed that the meetings with Harry opened the way for Mahfouz to get access to the Prince of Wales.[438] Harry referred to the incident as the \"CBE scandal\" in December 2021 and stated that he severed ties with Mahfouz in 2015 after expressing \"growing concerns\" about his motives, though aides from his father's household denied having any discussions with him regarding Mahfouz.[439] A spokesperson for Sentebale defended the meetings and added that there was not any impropriety regarding the donations.[440]\n\nIn March 2024, Harry was named in a lawsuit against P. Diddy who was facing allegations of sexual trafficking. He was mentioned as a well-known celebrity associate of Combs, whom he would use among other famous figures to draw guests to his parties.[441]\n\nPublic opinion\n\nIn view of their environmental activism, Harry and Meghan were criticised in August 2019 for reportedly taking four private jet journeys in 11 days, including one to Elton John's home in Nice, France.[442] The criticism was in line with the reactions the royal family faced in June 2019, after it was revealed that they \"had doubled [their] carbon footprint from business travel\".[443][444] Harry received backlash again in August 2021 and 2022 for taking a two-hour flight on private jets between California and Aspen, Colorado, to participate in an annual charity polo tournament.[445][446] In June 2022 and on their way to California after the Queen's Platinum Jubilee, Harry and Meghan boarded a private jet that was estimated to have emitted \"ten times more carbon than flying commercial\".[447]\n\nAfter his marriage, Harry's popularity skyrocketed above all the other royals as he was deemed likable by 77 per cent of respondents in a poll of 3,600 Britons conducted by statistics and polling company YouGov.[448] However, his popularity fell after stepping back from royal duties, and it plummeted after the release of his controversial interview with Oprah Winfrey, his Netflix docuseries, and his memoir.[449][450][451] In December 2022, Harry was found to be the third most disliked member of the British royal family by YouGov, preceded by his uncle Prince Andrew and his wife Meghan.[452] Writing for The New York Times, Sarah Lyall noted that following the release of his memoir Harry and his wife lost support within segments of the American public and press.[453] It has been suggested by critics that this fall from public esteem is due to Harry and Meghan's frequent attempts to achieve ongoing relevancy,[454] and their perceived hypocrisy and selfishness.[455][456][457] Harry and Meghan's exit from the royal family was satirized in a 2023 episode of South Park.[458]\n\nIn 2018 and 2021, Harry was selected as one of the 100 Most Influential People in the World by Time magazine.[459] In 2019, the magazine named Harry and his wife as among the 25 Most Influential People on the Internet.[460] In 2021, the couple was featured on one of the magazine's seven worldwide Time 100 covers.[461] In 2023, People named him as one of the \"25 Most Intriguing People of the Year\".[462] In the same year, James Hibberd of The Hollywood Reporter named Harry and Meghan among the Hollywood losers of 2023.[463]\n\nFollowing Harry and Meghan's trip to Nigeria in May 2024, Lucia Stein of the ABC argued that the couple could have been used by the royal family, and added that \"perhaps how helpful they would have been\" had an agreement on a \"hybrid working model\" been achieved.[464] Media editor, Tina Brown commented in relation to the visit, they are \"enormously appealing to the public, and very good at [public engagement].\"[464] In the same year Harry's role as founder of Travalyst was recognised in the second edition of the Time 100 Climate list which ranked the most influential climate action leaders.[465]\n\nIn January 2025, Harry and Meghan's appearance at a food bank during the Southern California wildfires in the Pacific Palisades drew mixed reactions from segments of the media and public figures, who labeled it \"disaster tourism\".[466][467][468] In October 2025, Ranker rated him the third most disliked celebrity in the United States, in its poll of 48,000 people.[469]\n\nPrivacy and the media\n\nLegal issues and incidents\n\nAssociated Newspapers\n\nIn January 2020, the Independent Press Standards Organisation (IPSO) sided with the Mail on Sunday over a dispute between the Duke and the newspaper regarding an Instagram photo involving Harry in which, according to the newspaper, elephants were in fact \"tranquilised\" and \"tethered\" during a relocating process. The IPSO rejected Harry's claim that the paper's description was \"inaccurate\" or \"misleading\".[470]\n\nIn December 2020, Harry's legal team sued Associated Newspapers Limited (ANL) for publishing a story in the Mail on Sunday claiming his working relationship with the Royal Marines had suffered post-royal departure.[471] The newspaper subsequently accepted the claims were false and issued an apology. The prince's lawyer said the \"substantial damages\" paid by the publisher would be donated to the Invictus Games Foundation.[472]\n\nIn February 2022, Harry filed a libel suit in the High Court against ANL for a Mail on Sunday article which alleged he was trying to keep his legal battle against the Home Office to restore his police protection secret from the public through requesting a confidentiality order on the case and that he offered to pay for police protection only after filing a lawsuit against the government.[473][474][475] In June 2022, Mr Justice Nicklin ruled that parts of the article were potentially defamatory, though Nicklin rejected claims by Harry's lawyers that the article portrayed him as a liar.[476] Harry attempted to have the publisher's defence thrown out, but the judge rejected his motion in December 2023 and decided that the case should proceed to trial.[477] He later ordered Harry to pay Mail on Sunday £48,447 in legal costs.[478] Harry withdrew the libel claim in January 2024 and became liable for the publisher's £250,000 legal costs.[479]\n\nIn October 2022, the Duke of Sussex joined Doreen Lawrence, Sir Elton John, David Furnish, Sadie Frost, and Elizabeth Hurley in launching a legal action against ANL for their alleged \"abhorrent criminal activity\", which was said to involve listening to and recording people's phone calls and daily activities, obtaining sensitive information and medical records, and accessing bank accounts and financial transactions.[480] In a statement, ANL described the allegations as \"preposterous smears\", and Gavin Burrows, the private investigator whose alleged 2021 statement was used as a key element in the case, said that the statement was not signed by him and was \"a cut and paste from my evidence\" of other publishers targeting individuals.[480][481] In November 2023, Mr Justice Nicklin ruled that the case brought by Harry and the other claimants could proceed but unpublished material provided to the Leveson Inquiry was inadmissible as proof in this case.[482]\n\nNews Group and Mirror Group newspapers\n\nIn October 2019, it was announced that Harry had sued the Daily Mirror, The Sun and the now-defunct News of the World \"in relation to alleged phone-hacking\".[483] Former News of the World royal editor Clive Goodman had previously stated that he had hacked Harry's phone on nine occasions.[484] Andy Coulson, the editor of the News of the World, apologised to Harry and his brother for invading their privacy, accepting \"ultimate responsibility\" for the actions of Goodman.[485] In his lawsuit, Harry sought damages in excess of £200,000 from the publisher of the News of the World and The Sun and alleged an earlier agreement between News Group Newspapers (NGN) and the royal family which would see he and William not take legal action in return for an apology had not been honoured.[486] Both brothers brought a claim privately through their mutual attorneys, but Harry decided to pursue his case separately with a new solicitor in 2019.[486][487] In July 2023, the judge ruled that part of Harry's case involving allegations of illegal information gathering would go to trial but his phone-hacking claims were dismissed for being made too late.[488] In May 2024, Mr Justice Fancourt refused Harry the permission to include claims against Rupert Murdoch, expand his case's scope back to 1994 and 1995 to cover allegations involving his mother or to add new allegations from 2016 involving his then-girlfriend Meghan.[489] In October 2024, the judge announced that the two sides should either settle or go to trial in January 2025 and refused to let Harry's team include allegations that bugs were placed in rooms and cars, and trackers placed on vehicles as \"no particulars whatsoever of such allegations\" were provided.[490] In January 2025, the two parties settled with NGN paying more than £10 million in pay outs and legal fees in the settlements involving both Harry and former Labour deputy leader Tom Watson.[491] NGN made a \"full and unequivocal apology\" for \"serious intrusion\" by The Sun between 1996 and 2011, for \"phone hacking, surveillance and misuse of private information by journalists and private investigators instructed by them at the News of the World\" and the intrusion into the life of his mother, and admitted \"incidents of unlawful activity\" were carried out by private investigators working for the newspaper, but \"not by journalists\".[491] The BBC reported on the \"scrapped case\", highlighting NGN's statement which said that the settlement agreement \"drew a line under the past\" and that they rejected the claims that would have been made in court about a corporate cover-up.[492]\n\nLawyers for the Mirror denied accessing Harry's voicemail messages and other allegations, but admitted to instructing \"private investigators to unlawfully obtain private information\" about Harry on a single occasion that involved him visiting Chinawhite.[493] In January 2023, a High Court judge ruled that Harry's lawsuit against Mirror Group Newspapers (MGN) as well as other similar lawsuits against the publisher would go to trial in May 2023.[494][495] At the beginning of trial, MGN apologised for one instance of unlawful information gathering against Harry and added that his legal challenge \"warrants compensation\".[496] In June 2023, Harry testified in the court case accusing former Daily Mirror editor Piers Morgan of horrific personal attacks and claimed that his phone had been hacked dating back to when he was still at Eton.[497] His appearance marked the first time a member of the royal family had been cross-examined in court since Albert Edward, Prince of Wales, appeared as a witness in court in 1891.[498] In December 2023, the High Court ruled in favour of Harry for 15 of the 33 sample stories used in his claims of phone hacking against MGN and awarded him £140,600 of the £440,000 he sought in damages.[499][500][501][502] Mr Justice Fancourt concluded Piers Morgan and other editors knew about the phone hacking at their publications and were involved in it.[503][504][505] Harry through his lawyer David Sherborne called the ruling \"vindicating and affirming\" and urged the authorities to further investigate and prosecute the company.[500] An additional 115 articles from Harry's claim might have been the focus of two further trials, but in February 2024 he settled his claim with MGN. The publisher agreed to cover Harry's legal costs and pay damages reported to be in the region of £300,000.[506]\n\nOther cases\n\nIn October 2013, Jo Brand appeared on Have I Got News for You and while talking about Prince George's christening she said: \"George's godparents include Hugh van Cutsem ... I presume that's a nickname as in Hugh van cuts 'em and Harry then snorts 'em.\"[507] Representatives of Kensington Palace contacted the BBC after the programme aired, pointing out the error and the implications of the joke.[508] The BBC wrote to Kensington Palace apologising for the \"factual inaccuracy\" as George's godfather was William van Cutsem, but it did not apologise for the comment itself as it was part of the show's \"irreverent humor\".[508]\n\nIn February 2014, a judge sentenced the convicted criminal Ashraf Islam to three years in prison, as he had plotted to murder Harry and had given it \"considerable thought\" due to his belief that Harry had \"a moral guilt\" since he was in the army.[509][510] In June 2019, two members of the neo-Nazi group Sonnenkrieg Division were jailed for eighteen months and four years, respectively, for sharing propaganda posters among which was one that labelled Harry as a \"race traitor\" with a gun pointed at his head.[511]\n\nIn May 2019, Splash News issued a formal apology to the Sussexes for sending photographers to their Cotswolds residence, which put their privacy at risk. The agency also agreed to pay damages and legal costs associated with the case.[512][513] In December 2019, PA Media retracted the publishing of a Christmas card photograph of Harry, Meghan, and their son Archie. The agency said that the photo was retracted because they had been advised that the photograph was \"not representative of the Christmas card sent by the Duke and Duchess of Sussex\".[514] In January 2020, lawyers issued a legal warning to the press after paparazzi photographs were published in the media.[515] In March 2020, the couple took Splash UK to court after the Duchess and their son were photographed without permission during a \"private family outing\" while staying in Canada. The case was settled later that year with Splash UK agreeing to no longer take unauthorised photos of the family.[516] In April 2020, the Duke and Duchess announced that they would no longer cooperate with the Daily Mail, the Sun, the Mirror and the Express.[517] They won an apology in October that year from American news agency X17 for taking photographs of their son at their home using drones.[518]\n\nIn June 2020, it was reported that Harry's lawyers had issued a 'letter before action', threatening to sue the Sun and Dan Wootton, based on the allegations that they had paid money to associates of palace officials to secure their stories. It was alleged that the Sun had made two payments amounting to £4,000 to the partner of a royal official in relation to stories published in June and July 2019 which detailed the nannying and god-parenting arrangements for Harry and Meghan's son Archie. News Group Newspapers, publisher of the Sun, emphasised that they had done nothing \"unlawful\" in sourcing the stories and no illegal payments were made. Wootton's lawyers denied that any payments were made unlawfully to a public official or a proxy and described the claims as \"a smear campaign by unknown bad actors.\" Wootton has been credited with breaking the story about Megxit and Harry and Meghan's initial plans for moving to Canada in the Sun on 8 January 2020, which prompted the couple to issue an announcement within hours, confirming their plans for stepping back from their royal duties.[520] Sources close to the couple later spoke to The New York Times, stating that they \"felt forced to disclose their plans prematurely\" as they learned about the Sun's intentions to publish the story.[520] Wootton disputed the claim as \"They released the statement after we had published the story and had so much notice.\"[520]\n\nA September 2020 article by The Times claiming an Invictus Games fundraiser had been cancelled due to its affiliation with a competitor of Netflix, Harry's business partner, became the subject of a legal complaint issued by the Duke.[521] In January 2022, the couple mutually filed a legal complaint against The Times for an article reporting on Archewell raising less than $50,000 in 2020.[522]\n\nDespite the palace congratulating the Duke and Duchess on the birth of their daughter Lilibet in June 2021, a few days later the BBC reported that Harry and Meghan had not sought the permission of the Queen before naming their daughter with her personal family nickname.[523][524] Lawyers for the couple subsequently accused the BBC of defamation and sent letters out to various media organisations saying the report was false and defamatory, and the allegations should not be repeated as Harry had spoken to the Queen before announcing their daughter's name.[525][526]\n\nIn January 2024, two neo-Nazis, Christopher Gibbons and Tyrone Patten-Walsh, were given prison sentences between 8 and 11 years for terrorism, which included calling for the deaths of Harry and his son Archie on their podcast.[527][528]\n\nInterviews\n\nHarry and his wife were interviewed by Oprah Winfrey in a television special for CBS, broadcast on 7 March 2021.[529] Meghan spoke about marriage, motherhood, and the pressures of public life. Harry joined her later, and the pair talked about the initial difficulties associated with their move to the United States in 2020 and their plans for the future.[530] During the interview, Harry criticised his father's parenting style, mentioned his father did not answer his calls and had cut him off financially, and he had no relationship with his brother.[531][532][533] There was a wide and polarised reaction to the interview.[534]\n\nIn April 2022, Harry sat down for an interview with Today's Hoda Kotb during the Invictus Games, during which he claimed that he had visited his grandmother the Queen earlier to make sure that she was \"protected and got the right people around her.\"[535] In January 2023 and ahead of the release of his memoir Spare, Harry sat down for a series of interviews, including an interview by Anderson Cooper on 60 Minutes, another one by Tom Bradby titled Harry: The Interview on ITV1, and a third interview by Michael Strahan on Good Morning America, titled Prince Harry: In His Own Words.[536] In the interview with Bradby, Harry said that he \"would like to get my father back, I would like to have my brother back\".[537] Referring to the press as \"the devil\", he also alleged that \"certain members\" of his family were \"in the bed\" with them to \"rehabilitate their image\".[538]\n\nIn a live-streamed interview with Harry in March 2023, physician Gabor Maté suggested publicly that he could be suffering from PTSD, ADD, anxiety, and depression based on his conversation with him and having read his autobiography Spare.[539][540]\n\nIn May 2025, Harry was interviewed by Nada Tawfik of the BBC, during which he reflected on his loss of taxpayer-funded security and his ongoing estrangement from his family.[541] Writing for The Guardian, Stephen Bates stated that Harry's \"megaphone diplomacy isn't working\" and \"his private security needs are probably not near the top of anybody's priorities\".[542]\n\nIn October 2021, Twitter analytics service Bot Sentinel alleged that 83 accounts with a combined number of 187,631 followers were responsible for approximately 70% of the negative content posted about Harry and Meghan.[543] The report prompted an investigation by Twitter.[543] Twitter stated that it found no evidence of \"widespread coordination\" between the accounts, and said that it had taken action against users who violated Twitter's conduct policy.[543] Bot Sentinel released three more reports in the following months.[544][545] In January 2022, the BBC named Harry and Meghan among people whose photos and videos were used in fake instant profits advertisements and bitcoin-related investment schemes.[546]\n\nTitles, styles, honours and arms\n\nTitles and styles\n\nHarry was originally styled \"His Royal Highness Prince Henry of Wales\". He used Wales as his surname for military purposes and was known as \"Captain Harry Wales\" in such contexts.[547]\n\nOn the morning of his wedding,[548] Elizabeth II granted him the Dukedom of Sussex, the Earldom of Dumbarton and Barony of Kilkeel. He thus became known as \"His Royal Highness The Duke of Sussex\". He uses the earldom in Scotland[549] and the barony in Northern Ireland.[550][551]\n\nOn 18 January 2020, Buckingham Palace announced that, following their decision to step back from royal duties, from 31 March 2020 the Duke and Duchess would not use their Royal Highness styles in practice or publicly. They are still referred to as \"His/Her Royal Highness\" in legal and private settings.[552][553][554][555]\n\nWhile on his gap year in Lesotho in 2003, Harry was given the nickname Mohale ( transl. 'the warrior'), a name that belonged to the younger brother of Moshoeshoe I.[556]\n\nMilitary ranks\n\nHonours\n\nForeign\n\nWear of orders, decorations, and medals\n\nThe ribbons worn regularly by Harry in undress uniform are as follows:\n\nRibbons of the Duke of Sussex\n\nAppointments\n\nFellowships\n\nFormer honorary military appointments\n\nThe honorary military appointments above were returned to Elizabeth II in February 2021.[565]\n\nAwards\n\nIn December 2010, the German charity Ein Herz für Kinder (\"A Heart for Children\") awarded him its Golden Heart Award, in recognition of his \"charitable and humanitarian efforts\".[571][572] On 7 May 2012, the Atlantic Council awarded him its Distinguished Humanitarian Leadership Award.[573] In August 2018, the Royal Canadian Legion granted him the 2018 Founders Award for his role in founding the Invictus Games.[574] In October 2018, he was presented with the RSA Badge in Gold, the organisation's highest honour, for his work with injured veterans.[575] In July 2021, Harry and Meghan were among people who were selected by UK-based charity Population Matters to receive the Change Champions Award for their decision to have only two children and help with maintaining a smaller and more sustainable population.[576] In February 2022, Harry and Meghan were selected to receive the NAACP's President's Award for their work on causes related to social justice and equity.[577] In October 2022, the couple were named as Ripple of Hope Award laureates for their work on racial justice, mental health, and other social initiatives through their foundation Archewell.[578] Harry was inducted into the Living Legends of Aviation in January 2024.[579] He received the Pat Tillman Award for Service during the 2024 ESPY Awards ceremony, recognising his service in the British Armed Forces and work with the Invictus Games, despite Tillman's mother believing that the award should have gone to \"more fitting\" recipients.[580] In October 2025, he and his wife received the Humanitarians of the Year award at Project Healthy Minds' annual gala in New York City in recognition of their commitment to mental health support.[581]\n\nArms\n\nAncestry\n\nAgnatically, Harry is a member of the House of Glücksburg, a cadet branch of the House of Oldenburg, one of Europe's oldest royal houses. Harry's paternal grandmother, Elizabeth II, issued letters patent on 8 February 1960 declaring his father to be a member of the House of Windsor.[584]\n\nAncestors on Harry's father's side include most of the royal families of Europe,[584] and on his mother's side, the earls Spencer—a cadet branch of the Spencer family descended from the earls of Sunderland; the senior branch are now also dukes of Marlborough; the Barons Fermoy; and more anciently from Henry FitzRoy, 1st Duke of Grafton; and Charles Lennox, 1st Duke of Richmond—two illegitimate sons of King Charles II.[585]\n\nHarry and his brother William descend matrilineally from Eliza Kewark (18th-century), who is variously described in contemporary documents as \"a dark-skinned native woman\", \"an Armenian woman from Bombay\", and \"Mrs. Forbesian\".[585] Genealogist William Addams Reitwiesner assumed Kewark was Armenian.[586] In June 2013, BritainsDNA announced that genealogical DNA tests on two of Harry and William's distant matrilineal cousins confirm Kewark was matrilineally of Indian descent.[587][588][589][590]\n\nFilmography\n\nBibliography\n\nBooks\n\nAuthored articles and letters\n\nReferences\n\nFurther reading", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Coat_of_arms_of_Harry%2C_Duke_of_Sussex_%282015%E2%80%932022%29.svg/120px-Coat_of_arms_of_Harry%2C_Duke_of_Sussex_%282015%E2%80%932022%29.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Flag_of_the_Canadian_Army.svg/40px-Flag_of_the_Canadian_Army.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/20px-Wikiquote-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/9/9a/Flag_of_Spain.svg/40px-Flag_of_Spain.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Prince_Harry_%2817396840192%29.jpg/250px-Prince_Harry_%2817396840192%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/66/OSM_for_Afghanistan_w_bar.svg/60px-OSM_for_Afghanistan_w_bar.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/66/OSM_for_Afghanistan_w_bar.svg/120px-OSM_for_Afghanistan_w_bar.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Coat_of_Arms_of_Harry%2C_Duke_of_Sussex.svg/250px-Coat_of_Arms_of_Harry%2C_Duke_of_Sussex.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Badge_of_the_House_of_Windsor.svg/120px-Badge_of_the_House_of_Windsor.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Stamp_of_Seychelles_-_1985_-_Colnect_537390_-_Queen_Mother_with_Prince_Henry.jpeg/250px-Stamp_of_Seychelles_-_1985_-_Colnect_537390_-_Queen_Mother_with_Prince_Henry.jpeg", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Prince_Harry_talks_to_an_injured_soldier.jpg/250px-Prince_Harry_talks_to_an_injured_soldier.jpg", "http://en.wikipedia.org/static/images/icons/wikipedia.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Royal_Military_Academy_Sandhurst_inspection_of_new_Colours%2C_June_2005.jpg/330px-Royal_Military_Academy_Sandhurst_inspection_of_new_Colours%2C_June_2005.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/40px-Flag_of_the_United_Kingdom.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Imperial_Crown_Heraldry.svg/20px-Imperial_Crown_Heraldry.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Royal_Standard_of_Prince_Harry%2C_Duke_of_Sussex.svg/60px-Royal_Standard_of_Prince_Harry%2C_Duke_of_Sussex.svg.png", "http://en.wikipedia.org/static/images/footer/wikimedia.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/40px-Wikidata-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Flag_of_Great_Britain_%281707%E2%80%931800%29.svg/40px-Flag_of_Great_Britain_%281707%E2%80%931800%29.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Johnson_and_Prince_Harry_at_2020_African_Investment_Summit.jpg/250px-Johnson_and_Prince_Harry_at_2020_African_Investment_Summit.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Coronet_of_a_British_Duke.svg/120px-Coronet_of_a_British_Duke.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Prince_Harry_Trooping_the_Colour_cropped.JPG/250px-Prince_Harry_Trooping_the_Colour_cropped.JPG", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Coat_of_Arms_of_Henry_of_Wales_%282002-2015%29.svg/120px-Coat_of_Arms_of_Henry_of_Wales_%282002-2015%29.svg.png", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Linda_Thomas-Greenfield_attends_2021_Global_Citizen_Live_%281%29.jpg/250px-Linda_Thomas-Greenfield_attends_2021_Global_Citizen_Live_%281%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Flag_of_the_British_Army.svg/40px-Flag_of_the_British_Army.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Saint_Patrick%27s_Saltire.svg/40px-Saint_Patrick%27s_Saltire.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Royal_Standard_of_Prince_Harry%2C_Earl_of_Dumbarton.svg/60px-Royal_Standard_of_Prince_Harry%2C_Earl_of_Dumbarton.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Canada_%28Pantone%29.svg/40px-Flag_of_Canada_%28Pantone%29.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/22/Prince_Harry_competes_in_Warrior_Games_volleyball_exhibition_130511-M-IX060-015.jpg/250px-Prince_Harry_competes_in_Warrior_Games_volleyball_exhibition_130511-M-IX060-015.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Naval_ensign_of_the_United_Kingdom.svg/40px-Naval_ensign_of_the_United_Kingdom.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Arms_of_Philip%2C_Duke_of_Edinburgh.svg/120px-Arms_of_Philip%2C_Duke_of_Edinburgh.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/89/QEII_Diamond_Jubilee_Medal_ribbon.svg/120px-QEII_Diamond_Jubilee_Medal_ribbon.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/5/59/Flag_of_the_Royal_Marines.png/40px-Flag_of_the_Royal_Marines.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/89/QEII_Diamond_Jubilee_Medal_ribbon.svg/60px-QEII_Diamond_Jubilee_Medal_ribbon.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/Air_Force_Ensign_of_the_United_Kingdom.svg/40px-Air_Force_Ensign_of_the_United_Kingdom.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Flag_of_Jamaica.svg/40px-Flag_of_Jamaica.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/UK_Queen_Elizabeth_II_Golden_Jubilee_Medal_ribbon.svg/60px-UK_Queen_Elizabeth_II_Golden_Jubilee_Medal_ribbon.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Prince_Harry_and_Ms._Markle_visit_Catalyst_Inc_%2841014635231%29.jpg/250px-Prince_Harry_and_Ms._Markle_visit_Catalyst_Inc_%2841014635231%29.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/40px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Prince_Harry_launching_the_2020_Invictus_Games_%28cropped%29.jpg/960px-Prince_Harry_launching_the_2020_Invictus_Games_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Maple_Leaf_%28from_roundel%29.svg/20px-Maple_Leaf_%28from_roundel%29.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Royal_Victorian_Order_UK_ribbon.png/60px-Royal_Victorian_Order_UK_ribbon.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/UK_Queen_EII_Platinum_Jubilee_Medal_ribbon.svg/60px-UK_Queen_EII_Platinum_Jubilee_Medal_ribbon.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Flag_of_Scotland_%281542%E2%80%932003%2C_navy_blue%29.svg/40px-Flag_of_Scotland_%281542%E2%80%932003%2C_navy_blue%29.svg.png", "http://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/be/UK_Royal_Victorian_Order_ribbon.svg/120px-UK_Royal_Victorian_Order_ribbon.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/b/be/Flag_of_England.svg/40px-Flag_of_England.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Prince_Harry_launching_the_2020_Invictus_Games_%28cropped%29.jpg/250px-Prince_Harry_launching_the_2020_Invictus_Games_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Prince_Harry%27s_signature.svg/250px-Prince_Harry%27s_signature.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Flag_of_California.svg/40px-Flag_of_California.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/UK_Queen_Elizabeth_II_Golden_Jubilee_Medal_ribbon.svg/120px-UK_Queen_Elizabeth_II_Golden_Jubilee_Medal_ribbon.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Harry_and_Meghan_on_Christmas_Day_2017_%28cropped%29.jpg/250px-Harry_and_Meghan_on_Christmas_Day_2017_%28cropped%29.jpg", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/UK_Queen_EII_Platinum_Jubilee_Medal_ribbon.svg/120px-UK_Queen_EII_Platinum_Jubilee_Medal_ribbon.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Prince_Harry_launching_the_2020_Invictus_Games_%28cropped%29.jpg/960px-Prince_Harry_launching_the_2020_Invictus_Games_%28cropped%29.jpg", "keywords": [], "authors": ["Authored Articles"], "canonical_link": "https://en.wikipedia.org/wiki/Prince_Harry,_Duke_of_Sussex", "title": "Prince Harry, Duke of Sussex", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Prince_Harry_launching_the_2020_Invictus_Games_%28cropped%29.jpg/960px-Prince_Harry_launching_the_2020_Invictus_Games_%28cropped%29.jpg", "width": 811, "height": 1200}, "title": "Prince Harry, Duke of Sussex - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}