{"url": "https://www.vox.com/culture/2017/11/3/16602628/kevin-spacey-sexual-assault-allegations-house-of-cards", "text": "wrote about pop culture, media, and ethics. Before joining Vox in 2016, they were a staff reporter at the Daily Dot. A 2019 fellow of the National Critics Institute, they’re considered an authority on fandom, the internet, and the culture wars.\n\nAfter being acquitted in courts of a handful of the dozens of sexual assault allegations against him, disgraced actor Kevin Spacey now wants to revive his career.\n\nPrior to the ongoing litany of allegations made against him for sexual assault and misconduct, Spacey was primarily known as a decorated Hollywood and stage veteran, a two-time Oscar winner, and the star of Netflix’s groundbreaking House of Cards. That all changed in 2017 when actor Anthony Rapp accused Spacey of sexually assaulting him in 1986, when Rapp was 14 and Spacey was 26.\n\nThe allegations made Spacey one of the most prominent celebrities accused as part of 2017’s #MeToo movement. Spacey was fired from House of Cards and his storied career seemed to end overnight. The years since have seen a floodgate of similar accusations against Spacey from men of various ages and backgrounds — over 50 in total, spanning a period of over 40 years and ranging from harassment to attempted rape.\n\nThough Spacey initially apologized to Rapp, he later denied Rapp’s allegations. In 2022, a jury found Spacey not liable for sexual battery in a civil lawsuit brought against him by Rapp. In a UK criminal trial in 2023, a jury acquitted Spacey on nine different counts of assaulting four different men. Spacey claimed that three of the four men were lying and the fourth had simply misunderstood an awkward but harmless pass. He characterized his own actions as those of “a big flirt.” The jury believed him. He has reportedly issued a blanket “absolute” denial of all other allegations against him.\n\nA recent incendiary documentary from the UK’s Channel 4, Spacey Unmasked (which aired on Investigation Discovery and Max in the US), collected more new accounts from some of Spacey’s alleged survivors. Spacey continues to deny all of the allegations made against him, including those in the documentary. Speaking to the Telegraph in May, he claimed he had been the victim of a “rush to judgment.” In the same article, several prominent celebrities, including Sharon Stone and Liam Neeson, defended Spacey. Neeson claimed the industry “needs him and misses him greatly.” Oscar winner F. Murray Abraham called Spacey’s detractors “vultures,” while Stephen Fry characterized his offenses as “clumsy” and “inappropriate” but implied they were nowhere near the type of behavior of disgraced Hollywood producer Harvey Weinstein. Bestselling author Peter Attia also recently joined the list of public figures trying to rehabilitate Spacey’s image.\n\nSpacey, who continues to enjoy a positive reception in Britain because of his long association with London’s Old Vic Theatre (where at least 20 men allege he assaulted or harassed them), sat for an interview with UK pundit Piers Morgan on June 11, 2024, in which he cried, confessed to getting “handsy,” and framed his behavior as “pushing the boundaries.” He depicted himself as having failed to understand when his sexual advances were unwanted, while denying more serious accusations of assault and nonconsensual misconduct.\n\nCollected below is every public account of Spacey’s alleged long history of serial predation. The portrait painted by these allegations is suggestive of an aggressive, volatile, repeat sexual predator who frequently physically intimidates his targets, manipulates them into being alone with him, and uses his power and promises of career advancement as bait.\n\nMore than 50 accusers have come forward against Spacey with allegations that span decades. Here’s a rundown.\n\nSince Rapp came forward in 2017, numerous other allegations against Spacey have surfaced. More than 50 men have made extremely consistent claims against the actor. Many of Spacey’s accusers describe witnessing or experiencing behavior from the actor that, like that of Weinstein, involved using the lure of his success and the opportunity of career mentorship to put himself in a position where he could prey on young men. Taken together, the allegations suggest a pattern of escalating physical contact and aggression, the consistent presence of alcohol, and Spacey making a habit of cornering his victims in order to confront them.\n\nThe allegations against Spacey are so numerous, spanning multiple decades and continents, that it’s difficult to track them all. Additionally, some of the allegations may overlap due to the confidential nature of police investigations. Still, to the best of our ability, we’ve attempted to clarify as many distinct alleged accounts on public record as we can.\n\nHere are all of the allegations we know about so far.\n\n1977: Greg, a high school student\n\nIn the Channel 4 documentary Spacey Unmasked, a man named Greg, who was a year behind Spacey at Chatsworth High School in Los Angeles, alleged that Spacey sexually assaulted him when Spacey was 17. While Greg was driving them both to a party and Spacey was sitting next to him in the passenger seat, Spacey allegedly grabbed Greg’s genitals. “It was a very aggressive sexual move,” Greg recalled. Greg also claimed that he felt “trapped” because of the circumstances. He says Spacey later begged him not to tell anyone what happened.\n\n1981: Andy Holtzman\n\nOn November 10, 2017, USA Today reported that Andy Holtzman, then 27, was working at New York’s Public Theater when Spacey, then 22, allegedly entered his office and wordlessly assaulted him.\n\n“It was so out of place, so sudden,” Holtzman said. “It was the wordlessness of it — he never spoke to me throughout, not one word. I was saying things, he was saying nothing.”\n\nHoltzman claimed that Spacey silently entered, sat down, then stood up and cornered him, assaulting him with “more than a grope.”\n\n“He was up and all over me... When I was finally able to push him off and scream (at him), he theatrically stepped back, incredibly angry, grabbed his coat and bag, stormed out and slammed the door.”\n\nHoltzman’s allegation is the first on the public record of many that characterize Spacey as extremely persistent during the assaults — and extremely angry if he was rejected. Holtzman later testified in the 2022 civil case brought by Rapp against Spacey; here he told jurors that Spacey “lifted me up by my crotch” and “pushed me back onto my desk” during the 1981 incident. Spacey denied Holtzman’s allegation.\n\nHoltzman’s allegations were later included in the documentary Spacey Unmasked. He described the alleged occurrence as “completely out of the blue” and added that “there was nothing but force — physical force.”\n\n1983–1984: Anonymous 14-year-old boy\n\nAn anonymous man told New York magazine that in 1983, when he was 14 and Spacey was 24, he began a sexual relationship with Spacey that allegedly culminated in Spacey attempting to rape him.\n\nThe anonymous actor stated that his relationship with Spacey lasted about a year, during which time he became aware that “25-year-olds don’t have sex with 14- and 15-year-olds, that that’s wrong, that I was not the guilty party and I could leave.” He told New York that the relationship ended when he was 15, after Spacey allegedly attempted to rape him.\n\n“I guess he must have come up behind me and yanked down my baggy jeans, and he goes to fuck me and I’m like, “No, I don’t want to.” And he pushes hard, and grabs me, and starts shoving up against my asshole, and it hurts like a motherfucker. I again tell him no, and he tries again.”\n\nThe actor said he was able to fight Spacey off and escape. Spacey denied the allegation.\n\nAfter Rapp came forward in 2017, the anonymous man approached him about filing a civil lawsuit against Spacey. While both men pursued the case and stood by their allegations, the anonymous man ultimately dropped his claims after the judge in the case refused to grant him anonymity or pseudonymity.\n\n1985: Anonymous 17-year-old boy\n\nThe BBC reported on November 1, 2017, that Spacey allegedly approached an anonymous 17-year-old boy in 1985, befriending the teen and then ultimately inviting him to visit his home, where Spacey progressed from being “charming and brotherly” to sexually inappropriate. After rejecting Spacey’s initial advances, the accuser says he woke up to find “Spacey’s head on his stomach and his arms wrapped around him.” The anonymous source described Spacey to the BBC as “either very stupid or predatory or ... both,” and noted that Spacey had not been drunk during their encounter.\n\n“It seems he was grooming me,” the anonymous source told the BBC.\n\n1986: Kate Edwards\n\nThough Edwards is an outlier in the list in terms of gender, her alleged experience has commonalities with several of the other allegations.\n\nWhen London performing arts teacher Kate Edwards was 17, she worked as a production assistant for the 1986 Broadway revival of Long Day’s Journey Into Night, in which Spacey starred alongside his longtime idol Jack Lemmon. Edwards alleged to the BBC that Spacey, then 27, invited her up to his flat for an apparently nonexistent party, where he kissed her. When it became clear he wanted sex, she made her excuses about wanting to leave, alleging that he then “became cold” and told her to “find [her] own way” home.\n\nEdwards said that Spacey subsequently “cut her dead” after the encounter, telling the BBC that she became depressed and eventually had to quit the show because of how “confused, completely isolated, ashamed” she felt over the incident.\n\n1986: Anthony Rapp\n\nRapp told BuzzFeed that Spacey befriended him in 1986, when Rapp was 14 years old and performing in the Broadway play Precious Sons. According to Rapp, Spacey made “a sexual advance” toward him while he was attending a party at Spacey’s home. In his subsequent lawsuit, he claimed Spacey picked him up bridal-style, put him on the bed, and lay on top of him until he managed to extricate himself and flee into the bathroom.\n\n1988: Justin Dawes\n\nA man named Justin Dawes told BuzzFeed that he met a 29-year-old Spacey through a Connecticut theater when he was 16 years old and a junior in high school. Spacey allegedly invited Dawes and a friend to hang out at his apartment, where he served them cocktails and showed gay porn. According to BuzzFeed, even though nothing else happened, “at the time, the 16-year-old felt like he ‘should’ve realized’ that Spacey wanted him to come over for reasons related to sex.”\n\n“He knew that I was in high school,” Dawes told BuzzFeed. “It was pretty clear.”\n\n1992: An unnamed accuser\n\nIn April 2018, the Los Angeles County District Attorney’s Office confirmed that it had received an allegation by an unnamed man that Spacey had sexually assaulted him in 1992. Though the office, which ultimately declined to prosecute the case since it fell outside the statute of limitations, revealed little about the claim, they did confirm that the accuser was an adult at the time of the incident.\n\nStarting in 1995: 20 actors and workers associated with the Old Vic\n\nSpacey’s involvement with London’s Old Vic Theatre began in the mid-90s, and the theater would go on to serve as the site for 20 accusations. He served as the theater’s artistic director from 2004 to 2015. In 2017, after the initial allegations against Spacey came to light, the Old Vic set up a confidential email to receive tips and reports about the actor. Multiple allegations concerning Spacey’s behavior while at the Old Vic quickly surfaced.\n\nOn November 16, 2017, the Old Vic announced that it had received 20 “personal testimonies” through its investigation into Spacey. These claims reportedly ranged “from behavior that made people feel uncomfortable all the way through to sexually inappropriate behavior.” The claims spanned 1995 through 2013, with most occurring before 2009. All of the claims involved young men, all of whom were over the age of 18 at the time of the alleged incidents.\n\nDuring his tenure, Spacey hosted workshops for new and rising artists. In the documentary Spacey Unmasked, an aspiring actor named Tim alleged that Spacey used one such workshop to openly — and publicly — sexually touch multiple performers. Tim alleged that Spacey first touched his hand, then “hugged [one performer] quite aggressively.” When the time came for Tim to read his part of the scene, Tim alleged that Spacey grabbed both of his arms and pressed his full body against Tim. Tim speculated that the entire workshop was a false pretense to provide Spacey with a hunting ground for “who to flirt with next.”\n\nMexican actor Robert Cavazos alleged in a 2017 Facebook post (written in Spanish) that Spacey touched him inappropriately numerous times, and said that Spacey would frequently grope men while hanging out at the Old Vic’s bar. “It appears that all that was needed was a male under the age of 30 for Mr. Spacey to feel free to touch us,” Cavazos wrote. “It was so common that it turned into a local joke (in very bad taste).”\n\nThe Associated Press reported that the Old Vic had urged 14 of the 20 respondents to go to the police with their allegations, but couldn’t confirm whether any of them had done so. In 2022, the Crown brought multiple charges against Spacey. In a UK criminal trial in 2023, a jury acquitted Spacey on nine different counts of assaulting four different men.\n\n1995: Mark Ebenhoch\n\nMark Ebenhoch told BuzzFeed that he had been working as a military adviser on the set of Outbreak, in which Spacey played a supporting role, when one of Spacey’s on-set assistants propositioned him on Spacey’s behalf.\n\n“They asked flat out to engage in a sexual act,” Ebenhoch alleged. “It was enough to stun me. It blew me away.” Ebenhoch told BuzzFeed that he rejected the invitation and avoided Spacey for the duration of the production.\n\n1995: Anonymous crew member on the film Albino Alligator\n\nThe BBC reported that while working on the 1995 film Albino Alligator, which marked Spacey’s film debut, the actor allegedly harassed an anonymous crew member who was 22 years old at the time. According to the anonymous crew member, Spacey initially seemed friendly and took an interest in his career, but progressed to “creepy” behavior such as giving him an unwanted massage.\n\n“On one of the last days of shooting ... he sat down next to me and put his thigh against mine and put his hand on my thigh and moved it toward my inner thigh,” the man alleged. “I felt trapped. I felt harassed, sexually harassed.”\n\n1998: Scott\n\nAs alleged in Spacey Unmasked, Scott, a post-production film crew worker, met Spacey at LA’s Viper Room club. Later, at a house in the Hollywood Hills, Spacey asked Scott for a hug that Spacey allegedly turned into a “bear grip” involving unwanted sexual contact. When Scott resisted, Spacey allegedly told him, “It’s okay,” and continued to grope him.\n\nAt a later date, Spacey, dangling an offer to help Scott with his career, went with Scott to see the movie Saving Private Ryan. In the movie theater, Spacey allegedly began masturbating during the disturbing and graphic battle scene of the invasion of Normandy. After a few moments, Spacey allegedly tried to pull Scott’s hand into his lap to take over. Scott described feeling shame in the moment. “You feel like you did something wrong ... like you brought it on yourself.” At a different time, Spacey allegedly manipulated Scott into joining him alone in a hotel room before making unwanted sexual advances, implying to Scott that trading sexual favors for career advancement was all a routine part of the Hollywood casting couch.\n\n1999: Jesse\n\nAs a young acting professional, Jesse interned on the set of The Big Kahuna. Jesse claimed that Spacey would “kidnap me off set to run lines” and initiate unwanted physical contact. “It felt like because I was straight it was more of a challenge,” Jesse said in the documentary Spacey Unmasked. He also described a whisper network within the crew, in which he learned that “everybody knows if you don’t want to go home with Kevin, don’t be the last guy in a bar with him.”\n\nAfter weeks of alleged escalating nonconsensual sexual advances, Spacey allegedly assaulted Jesse at the film wrap party by following him into a bathroom, exposing himself, and forcibly kissing him. “I was in shock for months,” Jesse recalls. In the early 2000s, Spacey allegedly invited Jesse to a hotel room and nonconsensually exposed himself to Jesse before coercing him into touching him briefly; Jesse panicked and ran out of the room.\n\nA third alleged encounter in which Jesse says he tried but failed to perform a sexual act for Spacey resulted in Jesse realizing that Spacey had no interest in actually helping him and his career. This led to a final phone call in which Jesse rejected Spacey, which allegedly led to Spacey screaming at him.\n\nAn anonymous journalist gave a detailed account to BuzzFeed of an alleged incident that occurred in London during the early 2000s, when the journalist was in his early 20s. The journalist was assigned to interview Spacey at his office at the Old Vic; after the interview, Spacey allegedly invited the journalist to hang out with him and some friends at a club, where he allegedly groped the journalist “aggressively” despite repeated attempts to get him to stop. When the journalist told Spacey he was in a committed relationship with a woman, it seemed to make no difference; when he tried to leave, Spacey allegedly implored him to stay. “He had somehow convinced himself that this was a sexual liaison that we both wanted,” the journalist told BuzzFeed.\n\nFinally, the journalist said, Spacey tried to prevent him from leaving:\n\n[Spacey] was screaming in my face outside of the main bar area, red-faced, spit flying out of his mouth, screaming at me with fury because I didn't want to fuck him. He was actually saying that I did want to and I was a coward. That was his tactic. It was unbelievable.\n\nThe journalist said he reported the incident to his editor, who confirmed as much to BuzzFeed, and the story ultimately ran without a byline. The journalist told BuzzFeed that a major concern that prevented him from going public with the incident was his fear of outing Spacey as gay. “Being closeted has for him enabled him to use this privacy claim as a shield against anybody looking closely at his actual behavior,” he said.\n\nSeth, a student at Juilliard, alleged in Spacey Unmasked that during the mid-2000s, while Spacey was a guest teacher at the school, he used the pretext of professional mentoring to attend a theater performance with Seth. Throughout the performance, Spacey allegedly nonconsensually touched Seth, including on his inner thigh. “I felt this was about pursuit and sex,” Seth said.\n\n2003: Director Tony Montana\n\nDirector Tony Montana was the second person to publicly come forward with an allegation against Spacey. On October 31, 2017, he told the gossip website Radar Online that Spacey physically assaulted him in 2003, when Montana was in his 30s. Montana alleges that Spacey approached him in a bar, groped him, and said, “this designates ownership,” as he did so. “I had PTSD for six months after” the incident, Montana said.\n\n2003: Danny\n\nIn 2003, according to the Channel 4 documentary Spacey Unmasked, Spacey allegedly assaulted a young Old Vic usher named Danny. In the middle of a family-oriented pantomime performance of Cinderella, Spacey allegedly physically wedged himself into a small gap between the wall and the seat Danny used as an usher. Then he allegedly sexually assaulted Danny by pushing his groin into Danny’s face. Danny froze and reported being scared to come to work. After the incident, Spacey would allegedly frequently nonconsensually touch Danny in a sexual manner, including one time in which Spacey allegedly touched him inside of his pants.\n\n2005: Travis Aaron Wade\n\nIn Spacey Unmasked, Wade, an aspiring actor, alleged that Spacey manipulated him into being in a hotel room alone with him on the pretense of hosting a Golden Globes after-party. Wade says Spacey made an unwanted sexual advance, even though he allegedly knew Wade was straight, then locked the door when Wade said he wanted to leave. In order to leave without offending Spacey and potentially harming his own career, Wade claims he theatrically kissed Spacey before fleeing.\n\n2007: Bartender Kris Nixon\n\nAccording to the BBC, Belfast bartender Kris Nixon met Spacey in 2007 while Nixon was working at a cocktail bar in London near the Old Vic. In a videotaped interview, Nixon alleged that after attending a party at Spacey’s penthouse, “Kevin Spacey sat down next to me on a sofa, then reached over and grabbed my penis,” declaring to Nixon, “I could fuck you better than [Nixon’s girlfriend, who was also in attendance].”\n\nNixon claimed that he left the party immediately but encountered Spacey again two weeks later while he was on shift at the bar where he’d first met Spacey. Nixon alleges that Spacey followed him down to a basement storeroom and cornered him, grabbing him by the waistband and offering to “make it up to [him].”\n\n“I didn’t speak out at the time because I didn’t think anyone would believe me,” Nixon said, adding that he “[didn’t] want to risk getting fired.” Nixon told the BBC that by coming forward, Rapp has made it possible for others to speak out. “Now that it’s become clear that this is a pattern of behavior,” he said, “I feel I have a responsibility to say what happened, so that other people, who maybe don’t yet feel in a position to speak out, feel empowered to do so.”\n\n2007: Writer Ari Behn\n\nAri Behn is a Norwegian writer who was married to Princess Märtha Louise when he attended the 14th Annual Nobel Peace Prize Concert in Oslo in December 2007. The concert was hosted by Spacey and Uma Thurman.\n\nAfterward, according to an on-air interview Behn gave to the Norwegian radio network P4 on December 5, 2017, Spacey and Behn attended an afterparty at a nightclub, where they were seated next to each other.\n\n“After five minutes, he says, ‘Hey, let’s go out and have a cigarette,’” Behn recalled, saying that Spacey then allegedly reached “under the table” and groped his genitals.\n\nBehn said he responded with, “Eh, maybe later,” and declined the invitation. He seemed to laugh off the incident.\n\nIn 2019, Behn died by suicide. He was 47.\n\n2008: Actor Harry Dreyfuss\n\nIn a piece he wrote for BuzzFeed, actor Harry Dreyfuss alleged that Spacey groped him when he was 18 years old, recalling an incident that took place while he was helping his father, the actor Richard Dreyfuss, rehearse for a play at Spacey’s London apartment.\n\nIn a very detailed account, Dreyfuss alleged that Spacey touched him inappropriately throughout the rehearsal, and describes his failed attempts to stop Spacey from fondling him without disrupting the rehearsal or alerting his father. Thinking back to what was going through his head at the time, Dreyfuss writes:\n\nLooking into his eyes, I gave the most meager shake of my head that I could manage. I was trying to warn him without alerting my dad, who still had his eyes glued to the page. I thought I was protecting everyone. I was protecting my dad’s career. I was protecting Kevin, who my dad surely would have tried to punch. I was protecting myself, because I thought one day I’d want to work with this man. Kevin had no reaction and kept his hand there. My eyes went back to the script and I kept reading.\n\n“In retrospect, what disgusts me about Kevin was how safe he did feel,” Dreyfuss concluded. “He knew he could fondle me in a room with my father and that I wouldn’t say a word.”\n\nSpacey denied Dreyfuss’s allegations via his lawyer.\n\n2008: Anonymous 23-year-old man\n\nAccording to Variety in 2017, Scotland Yard began an investigation into a claim that a man who is believed to be Spacey assaulted a 23-year-old bartender in London in 2008. “On 1 November, City of London police referred an allegation of sexual assault to the Metropolitan police service,” a Scotland Yard spokesperson said in a press statement released November 3, 2017. “It is alleged a man assaulted another man in 2008 in Lambeth. Officers from the child abuse and sexual offences command are investigating.”\n\nThough Scotland Yard has not named Spacey as the alleged perpetrator, Variety notes that the incident being investigated took place in the South London neighborhood of Lambeth, where Spacey maintains a home. The details, which were first reported by the British tabloid the Sun, allegedly involve the victim approaching Spacey to ask for help with his career, passing out after smoking weed at Spacey’s apartment, and waking up to find Spacey performing oral sex on him. The man, who was then 32, is said to have reported the incident to police in early November 2017, after other allegations against Spacey became public.\n\n2010: Daniel Beal\n\nA British bartender named Daniel Beal told the Sun that Spacey allegedly flashed his genitals at him in 2010, while Beal was working at a bar in West Sussex. Beal, then 19, photographed himself at the time wearing an expensive watch, which was allegedly given to him by Spacey shortly after the incident. “Looking back I realize it was to keep me quiet,” Beal alleged.\n\n2012 to 2017: At least six different cast and crew members on the set of Netflix’s House of Cards\n\nOver the years, at least six different claims have surfaced from the House of Cards set — two from CNN in 2017, two more revealed in a 2021 arbitration, and a final two coming in the documentary Spacey Unmasked.\n\nPer CNN, Spacey allegedly harassed a House of Cards production assistant for months before allegedly assaulting him. Spacey allegedly sexually assaulted the production assistant while the assistant was driving Spacey to the set. The crew member did not report this.\n\nAdditionally, a different anonymous crew member said Spacey allegedly routinely touched him inappropriately throughout the six seasons he worked on set, and that he did not “feel comfortable” asking Spacey to stop.\n\nAccording to a 2021 arbitration, Spacey allegedly groped a “20-something” production assistant, again while the assistant was driving. The arbitration also claimed that in a later season of the show, Spacey lured an actor to the Getty Center, found an empty room, and began groping him. The actor got away and hailed an Uber in order to leave the situation. Spacey was ultimately held liable for violating his contract’s requirement for professional behavior on set. He was ordered to pay over $30 million to the production because of the costs incurred by his behavior on the set over five seasons.\n\nThe documentary Spacey Unmasked unearthed two additional claims of harassment. Daniel, a young background actor on House of Cards, alleged that he was nonconsensually groped by Spacey during filming. He spoke of his fear that Spacey would ruin his career if he spoke out due to his power and his role as executive producer on the show. A fellow actor on set, Dawn, said she saw Daniel frantically trying to “hide” from Spacey at one point.\n\nAdditionally, one production staff member corroborated witnessing Spacey allegedly behaving inappropriately on set. The staff member, Evelyn, described Spacey’s behavior as “grabby flirtatiousness” with other actors “if he felt like he could get away with it.” She claimed Spacey made several crew members “uncomfortable.” The Hollywood Reporter further alleged that Spacey had been recorded “making sexual overtures toward crew members.”\n\n2013: Anonymous Old Vic actor\n\nAn anonymous actor alleged in 2017 that Spacey “repeatedly sexually assaulted him in a public place in 2013” and treated the Old Vic “like a playground.”\n\n2013: Ruari\n\nThe final alleged assault cited in the Spacey Unmasked documentary occurred in 2013 during a production of Sweet Bird of Youth at the Old Vic. An actor named Ruari claims Spacey sexually assaulted him during a press night for the play at the Savoy. Ruari alleges that Spacey, in front of legions of photographers, digitally penetrated him through his clothes. Ruari froze during the alleged assault. He later stopped auditioning and fell into “addiction issues and relationship issues.”\n\n2016: The teenage son of journalist Heather Unruh\n\nHeather Unruh, a former news anchor for the Boston news outlet WVCB, was one of the first people to mention Spacey in the wake of the Weinstein allegations, when her October 13, 2017, tweet that the actor had assaulted a loved one went viral. At a press conference in Boston on November 8, 2017, Unruh alleged that Spacey came on to her then-18-year-old son at a restaurant in Nantucket.\n\nAccording to Unruh, Spacey encountered her son at Nantucket’s Club Car Restaurant in July 2016. Spacey “bought [her underage son] drink after drink after drink,” then allegedly sexually assaulted him. “Spacey stuck his hand inside my son’s pants and grabbed his genitals,” Unruh alleged. “My son’s efforts to shift his body to remove Spacey’s hand were only momentarily successful. My son panicked, he froze. He was intoxicated.”\n\nUnruh claims that after Spacey allegedly repeatedly pressured her son to attend a party with him, Spacey got up to go to the bathroom, at which point a woman at the bar approached her “very shaken” son and told him to “run.” Her son left, and disclosed the incident to his sister and Unruh later that night.\n\nUnruh stated that her son had filed a police report against Spacey with the Nantucket Police Department. A spokesperson for the Cape and Islands District Attorney’s Office told Boston.com that “an individual has provided information to the Nantucket Police regarding an allegation of an indecent assault and battery” but did not provide further details. On December 24, 2018, news broke that Spacey would face arraignment on a count of sexual assault in Nantucket District Court.\n\nOn July 17, 2019, the charges against Spacey were dismissed by the court after Unruh’s son invoked his Fifth Amendment right not to testify about the whereabouts of a phone that Spacey’s attorney argued contained messages relevant to the case. The court decided the case against Spacey could not proceed without the plaintiff’s testimony on this subject.\n\n2016: “John Doe”\n\nIn July 2018, according to Variety, the Los Angeles County Sheriff’s Department referred an investigation of an alleged assault by Spacey to the Los Angeles district attorney. The accuser, an unnamed massage therapist, later filed a lawsuit against Spacey, claiming Spacey had forced him to grab Spacey’s genitals while he was working at a private Malibu residence. According to the Hollywood Reporter, Spacey allegedly tried multiple times to initiate sexual activity with the man, including forcing him to massage his groin during the massage session. Spacey then allegedly repeatedly tried to prevent the man from leaving.\n\nIn 2019, while both the lawsuit and the criminal investigations were still pending, the accuser died of cancer. The district attorney subsequently declined to pursue the charges.\n\nIn 2021, the Hollywood Reporter reported that two different massage businesses, the app Soothe and the chain Burke Williams, had both banned Spacey from booking appointments because of a past history of allegedly assaulting their staff members.\n\nVariety reported that in August 2018, the Los Angeles district attorney’s office received a new investigation referral from the sheriff’s office into an allegation against Spacey. No information was available about the date, details, or alleged victim of the incident. It’s unclear whether this investigation is connected to at least two other investigations referred to the DA involving Spacey. As Variety noted, the DA has yet to pursue any of the charges.\n\nSpacey’s supporters say he has apologized and repented. He hasn’t.\n\nSpacey has continually denied nearly all of the allegations against him while creating the impression that some of the alleged encounters are simply fumbling or socially awkward misunderstandings. He came out as gay in response to Rapp’s initial allegations, which many people saw as an attempt at deflection, and subsequently remained defiant as the litany of accusations piled up.\n\nThen there was the bizarre 2018 video in which he role-played his former House of Cards character Frank Underwood. In language that recalls several of the more disturbing allegations of nonconsensual physical assault made against Spacey, the actor seems to tell the audience that he’s making a comeback, regardless of what they say they want: “We’re not done, no matter what anyone says. And besides, I know what you want. You want me back.” Spacey released more distasteful videos each subsequent year through 2021, then returned in 2023 alongside Tucker Carlson. In the latest video, he claimed that the allegations against him had been “proven false.”\n\nSpacey is far from the only alleged sexual predator in Hollywood, or the only one who’s led a successful career despite his behavior apparently being an open secret. And while some of the most powerful men in the industry — including Weinstein and former CBS head Les Moonves — have seen their careers topple, others remain largely unscathed by allegations against them. Spacey’s repeated diminishment of the high number of allegations against him suggest that he has yet to fully accept either the reality of his own actions or any responsibility for the harm he has allegedly caused. And despite the overwhelming number of people who’ve spoken out against him, he seems to feel entitled to a comeback.\n\nIt’s highly unlikely he’ll get one. But his confidence is a telling statement about an entertainment industry that for so long has allowed powerful men to operate with impunity — one that allowed him to allegedly prey on targets for decades with no repercussions, and that could still harbor many predators in its midst.\n\nVox has reached out to Spacey’s representatives for comment but has received no response.\n\nUpdate, June 12, 2024, 9:50 am: This story was originally published in 2017 and has been updated multiple times, most recently to include Spacey’s appearance on Piers Morgan Uncensored.", "images": ["https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-468814460.jpg?quality=90&strip=all&crop=0%2C2.3825770499261%2C100%2C95.234845900148&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-2155209999.jpg?quality=90&strip=all&crop=16.669458870833%2C0%2C66.661082258335%2C100&w=2400", "https://www.google-analytics.com/g/collect?v=2&tid=G-C3QZPB4GVE&cid=555&en=noscript_page_view", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/the-true-meaning-of-friendsgiving.jpg?quality=90&strip=all&crop=21.875%2C0%2C56.25%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/3_Vox_FuturePerfect25_LandingPage.gif?quality=90&strip=all&crop=16.666666666667%2C0%2C66.666666666667%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9538503/headshots_1508964052528.jpg?quality=90&strip=all&crop=16.666666666667%2C0%2C66.666666666667%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-2155209999.jpg?quality=90&strip=all&crop=0.0041883062489489%2C0%2C99.991623387502%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-590696434.jpg?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/3_Vox_FuturePerfect25_LandingPage.gif?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-590696434.jpg?quality=90&strip=all&crop=16.666666666667%2C0%2C66.666666666667%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9605083/687736578.jpg?quality=90&strip=all&crop=0.46666666666667%2C0%2C77%2C77&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/gettyimages-2217689678.jpg?quality=90&strip=all&crop=16.650390625%2C0%2C66.69921875%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9605083/687736578.jpg?quality=90&strip=all&crop=0%2C3.4925%2C77.933333333333%2C61.204188481675&w=1200", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/author_profile_images/191459/me.0.jpg?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=96", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-468814460.jpg?quality=90&strip=all&crop=14.998805827561%2C0%2C70.002388344877%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9538503/headshots_1508964052528.jpg?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/the-true-meaning-of-friendsgiving.jpg?quality=90&strip=all&crop=7.8125%2C0%2C84.375%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/18351762/1052846684.jpg.jpg?quality=90&strip=all&crop=7.1634363541121%2C0%2C92.836563645888%2C41.260694953728&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/10711815/490064598.jpg.jpg?quality=90&strip=all&crop=0%2C1.8536350505537%2C100%2C96.292729898893&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/gettyimages-2217689678.jpg?quality=90&strip=all&crop=0%2C0.024402147388969%2C100%2C99.951195705222&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/18351762/1052846684.jpg.jpg?quality=90&strip=all&crop=38.108957569408%2C0%2C61.891042430592%2C41.260694953728&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/10711815/490064598.jpg.jpg?quality=90&strip=all&crop=15.383333333333%2C0%2C69.233333333333%2C100&w=2400"], "top_img": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9605083/687736578.jpg?quality=90&strip=all&crop=0%2C3.4925%2C77.933333333333%2C61.204188481675&w=1200", "keywords": [], "authors": ["Aja Romano"], "canonical_link": "https://www.vox.com/culture/2017/11/3/16602628/kevin-spacey-sexual-assault-allegations-house-of-cards", "title": "Here are all 50+ sexual misconduct allegations against Kevin Spacey", "meta_data": {"bingbot": "nocache", "twitter": {"card": "summary_large_image", "site": "@voxdotcom", "url": "https://www.vox.com/culture/2017/11/3/16602628/kevin-spacey-sexual-assault-allegations-house-of-cards", "title": "Here are all 50+ sexual misconduct allegations against Kevin Spacey", "description": "They span nearly half a century and paint a picture of a serial predator.", "image": {"identifier": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9605083/687736578.jpg?quality=90&strip=all&crop=0%2C3.4925%2C77.933333333333%2C61.204188481675&w=1200", "alt": "Build Presents Kevin Spacey Discussing His New Play 'Clarence Darrow' And Hosting The Tony Awards"}}, "fb": {"app_id": 549923288395304}, "og": {"site_name": "Vox", "title": "Here are all 50+ sexual misconduct allegations against Kevin Spacey", "description": "They span nearly half a century and paint a picture of a serial predator.", "url": "https://www.vox.com/culture/2017/11/3/16602628/kevin-spacey-sexual-assault-allegations-house-of-cards", "type": "article", "image": {"identifier": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9605083/687736578.jpg?quality=90&strip=all&crop=0%2C3.4925%2C77.933333333333%2C61.204188481675&w=1200", "alt": "Build Presents Kevin Spacey Discussing His New Play 'Clarence Darrow' And Hosting The Tony Awards", "type": "image/jpeg", "width": 1200, "height": 628}}, "viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Vox", "robots": "index,follow,max-image-preview:large", "description": "Kevin Spacey has been accused of assault by many people", "article": {"published_time": "2017-11-03T23:20:02+00:00", "modified_time": "2024-06-12T13:50:00+00:00"}, "author": "Aja Romano", "amazonbot": "noarchive", "parsely-type": "post", "parsely-title": "Here are all 50+ sexual misconduct allegations against Kevin Spacey", "parsely-link": "https://www.vox.com/culture/2017/11/3/16602628/kevin-spacey-sexual-assault-allegations-house-of-cards", "parsely-image-url": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9605083/687736578.jpg?quality=90&strip=all&crop=0,3.4925,77.933333333333,61.204188481675", "parsely-pub-date": "2017-11-03T23:20:02+00:00", "parsely-section": "culture", "parsely-tags": "vox,pagetype:story,metoo,culture,life,tv,stream-16198791", "parsely-author": "Aja Romano", "cse-category": "Culture", "cse-authors": "Aja Romano", "next-head-count": 51}, "movies": [], "publish_date": 1509681600.0, "source": "https://www.vox.com", "summary": ""}