{"url": "https://people.com/music/drake-dating-relationships-nicki-minaj-jennifer-lopez-rihanna/", "text": "Drake wasn't kidding when he called himself a certified lover boy.\n\nThe Canadian-born rapper has had several high-profile flings, including a longtime on-again-off-again relationship with Rihanna and rumored romances with A-listers like Hailey Bieber, Julia Fox, Kylie Jenner and Jennifer Lopez.\n\nIn a November 2022 deep fake interview with Howard Stern posted to Drake's Instagram, Drake said he dates four or five women at a time. \"I get in this habit of dating like four or five women to make one woman because I like these two things about each girl, and then I like what this girl does for a living,\" he said, adding that he's \"sure he could\" get married someday.\n\n\"I think that eventually, once all this is said and done for us — that addiction of work and success and forward movement is over. I feel like we're all going to need something real. Hopefully, it's not too late,\" he said. \"Hopefully, I'll find somebody. The biggest thing is I need to be inspired.\"\n\nDrake counts SZA and Tatyana Ali among his other muses. In fact, the rapper made headlines in December 2022 when he created a necklace with 42 engagement ring diamonds, dedicated to all the times he was inspired to propose but never quite got there.\n\nIn February 2023, Drake appeared on A Moody Conversation, hosted by fellow rapper Lil Yachty, and revealed that he carries some regret for naming his exes in songs.\n\n\"Maybe I coulda done without, like, s—ting on people for age or disrupting somebody's life,\" he said. \"The lyrics are never with ill intent, but I had somebody tell me one time, 'You know, it's not necessarily what you're saying about me, it's the fact that you said it.' \"\n\nDrake added: \"So, I've tried my best to stop doing that. But I like to be honest in music too so that one's a push and pull.\"\n\nFrom his long-term relationships to his rumored flings, here's a look back at Drake's complete dating history.\n\nSZA\n\nSZA. Dia Dipasupil/WireImage\n\nIn October 2021, Drake name-dropped SZA in his song \"Mr. Right Now,\" claiming that he and the \"Kill Bill\" singer were previously an item.\n\n\"Yeah, said she wanna f--- to some SZA, wait / 'Cause I used to date SZA back in '08,\" he rapped.\n\nSZA later confirmed that she and Drake had dated, but clarified that the rapper's timeline was a little off.\n\n\"So It was actually 2009 lol ... in this case a year of poetic rap license mattered lol,\" she tweeted. \"I think he jus innocently rhymed 08 w wait. Anybody who really knows me and was around during this time can confirm ... it's all love all peace.\"\n\nThe \"Prom\" singer discussed her past with Drake during a December 2022 interview with Audacy.\n\n\"We're cool, we've always been cool. It's never been weird,\" she said. \"Anytime he's ever mentioned me, it's always been positive. He never said anything negative about me, and I'm grateful for that. I think really highly of him … I'm an artist now, I wasn't then, and he's King Drake!\"\n\nWhile talking to Rolling Stone in October 2023, SZA shared that what she and Drake had \"wasn't hot and heavy,\" instead she called it \"youth vibes\" and \"childish.\"\n\nEricka Lee\n\nDrake dated a woman named Ericka Lee for a period between early 2010 and mid-2011; her voice is featured on his 2011 hit \"Marvins Room.\" Lee sued Drake over the track in 2012 according to The Hollywood Reporter, alleging that they had both a romantic and a business partnership and that he was withholding co-writer royalties from her from the song, and that they had an acrimonious split after the track's release.\n\nShe was credited as a vocalist on the song as \"Syren Lyric Muse,\" which Drake's legal team said was her only request at the time. Lee claimed that Drake offered her 2% of publishing royalties, then upped it to 4% to 5% and a $50,000 one-time payment and that he threatened her over the phone when she got a lawyer involved. Drake denied all the allegations. TMZ reported that the exes settled out of court on Feb. 2, 2013; details of whatever agreement they reached weren't made public.\n\nHe later addressed the relationship in his song \"Redemption,\" rapping, \"Ericka sued me and opened a business / Wonder if they wish it could've been different / Wonder what they'd do put in my position / I wonder, when my s**t drop, do they listen? / Wonder if they're second guessin' their decisions.\"\n\nKat Dennings\n\nJason Merritt/Getty\n\nDrake thirst-tweeted his way into a date with Kat Dennings.\n\n\"Kat Dennings I just woke up out of bed to let you know you were a dime on Conan tonight. XO,\" he tweeted at 5 a.m. ET on May 10, 2011. He later told Ellen DeGeneres, \"I just always had a huge crush on Kat Dennings, and she was kind enough one night to oblige me and we went out for dinner.\"\n\nDennings also later recalled their date to Chelsea Handler. \"We had sushi — we were being followed by a black SUV with his security,\" she described. \"It was overwhelming the amount of security.\"\n\nSerena Williams\n\nSerena Williams in 2024. Leon Bennett/Getty\n\nSerena Williams and Drake always maintained that they were \"simply longtime friends,\" despite romance rumors that swirled consistently from 2011 to 2015.\n\nA source told PEOPLE in October 2015 that the pair never dated; however, the two were seen seemingly kissing at a restaurant in Cincinnati two months prior, per images obtained by TMZ. The rapper also supported Williams at the U.S. Open and sat front row at her fashion show.\n\nIn August 2024, Drake released 100 Gigs — a website full of archival footage and unreleased songs. One particular video clip revealed that the rapper wrote his 2016 track \"Too Good\" about Williams.\n\n“I know Serena very well, and I know that she’ll hear it loud and clear, but not hate me for it because it’s lighthearted,\" Drake said while speaking to his mom, who was off camera.\n\nWilliams, who is now married to tech entrepreneur Alexis Ohanian, made headlines in February 2025 when she made a surprise cameo during Kendrick Lamar's Super Bowl Halftime show. She was seen dancing to the rapper's \"Not Like Us\" — a diss track aimed at Drake.\n\nTyra Banks\n\nAmy Sussman/Getty\n\nTyra Banks and Drake went on a single date to Disneyland in 2012, he revealed on The Ellen DeGeneres Show in 2013. When DeGeneres showed him a slideshow of women, he confirmed that he and Banks were friends and went out together once.\n\n\"I went on a date with her one time, yeah,\" he told the host. \"We went to Disneyland in disguise, actually, which was fun. I don't know if it was a date. It was a get-together. We're close as well.\"\n\nBanks appeared on The Steve Harvey Show that October and called out Drake in a playful rap, spitting, \"Drake rhymes with snake but no he ain't, he's more like a lion / Going on Ellen but not lyin', telling the truth what's up dude, about that day on Disneyland / You ain't my man, right now / But why you gotta not kiss and tell, but chill and tell / You goin' to jail / And this is my Tyra mail.\"\n\nStill, the pair are good pals, with Banks co-starring in Drake's \"Child's Play\" music video in 2016.\n\nRihanna\n\nDrake's most high-profile romance was with Rihanna, with whom he was in an on-again-off-again relationship for nearly 10 years. Though they met in 2005 when he was an extra in her \"Pon de Replay\" music video, Drake and Rihanna were first linked romantically in 2009, when there were spotted on a date at the Lucky Strike bowling alley in New York City.\n\nHe later referenced the evening on his 2010 track \"Fireworks,\" rapping, \"Who coulda predicted Lucky Strike would have you stuck with me? / What happened between us that night, it always seems to trouble me.\" Rihanna quickly struck down romance rumors in a radio interview, however, insisting they were just friends.\n\nIn 2010, Drake said in an interview that Rihanna treated him as \"a pawn,\" lamenting to The New York Times, \"You know what she was doing to me? She was doing exactly what I've done to so many women throughout my life, which is show them quality time, then disappear. I was like, wow, this feels terrible.\" Later that year, however, they were amicable enough to collaborate on her hit \"What's My Name\" and performed together at the 2011 Grammys.\n\nIn July 2011, TMZ obtained photos of Drake and Rihanna getting cozy at a nightclub a few weeks prior, and in January 2012, the pair released their second collaboration, the title track from Drake's Take Care; Rihanna also appeared with Drake in the \"Take Care\" music video released that April.\n\nIt seemed like whatever spark they'd had may have fizzled, however, by September 2013, when Drake spoke about their relationship in the past tense during an interview on The Ellen DeGeneres Show: \"Yeah, great girl. We had our moment. Always support and have love for her and yeah.\"\n\nOver the next two years, Rihanna and Drake would each answer questions about one another in interviews. In a Rolling Stone interview published in February 2014, Drake called Rihanna \"the ultimate fantasy.\" Rihanna told Vanity Fair in November 2015 that despite rumors of a Drake romance, her \"last real, official boyfriend was Chris Brown.\"\n\nBy 2016, Rihanna and Drake were back on. They released her hit \"Work\" in January 2016 and the accompanying music video a month later, and by that May, they were spotted \"being very affectionate\" and \"dancing all night together\" at an afterparty for one of Rihanna's concerts in Los Angeles. A source told PEOPLE at the time, \"They have been keeping it a secret because this time around, they want to do it right and keep their relationship private.\"\n\nThe next month, Drake and Rihanna released \"Too Good,\" and in July, a source told PEOPLE, \"Drake has always wanted to make things work with Rihanna. They are still dating. Things get more serious when they're in the same place.\"\n\nSamir Hussein/Redferns\n\nIn August 2016, Drake made their romance significantly more public in several ways. On Aug. 1, he brought Rihanna onstage during OVO Fest and cracked, \"You showed up two nights in a row for my city. You might have to go half on a baby.\"\n\nLater that month, before the 2016 MTV Video Music Awards, Drake bought a billboard in L.A. that read, \"Congratulations to Rihanna from Drake and Everyone at Ovo.\" Rihanna posted a photo of the billboard on Instagram, captioning it, \"When he extra ❤🏆!!!\"\n\nOn Aug. 28, Drake presented Rihanna with the MTV Michael Jackson Video Vanguard Award, telling the crowd, \"She's someone I've been in love with since I was 22 years old. She's one of my best friends in the world. She's a living breathing legend in our industry.\"\n\nSources told PEOPLE that later that night at an afterparty, Drake \"was literally shadowing her every movement and was just so affectionate and adoring the entire night.\" Drake also posted a celebratory Instagram with Rihanna to mark her big night; she later thanked him for his \"touching\" speech in kind and wrote, \"I love you for that!\"\n\nDays later, Drake and Rihanna were spotted being affectionate both at one of his Miami concerts onstage and at a nightclub. By September, they each sported matching new tattoos of a camouflage-print plush shark that Drake had once gifted her. In October, a source told PEOPLE that Rihanna and Drake were going strong, but noted their relationship was \"an open thing.\"\n\nTheir last known quasi-PDA came on Feb. 20, 2017, when Drake marked Rihanna's 29th birthday by performing \"Work\" onstage.\n\nIn May 2018, Rihanna said she and Drake no longer spoke and were in a relationship with someone else. \"We don't have a friendship now, but we're not enemies either,\" she told Vogue. \"It is what it is.\" She also said that Drake's VMAs speech was awkward for her, explaining, \"Waiting through that speech was probably the most uncomfortable part. I don't like too many compliments; I don't like to be put on blast.\" She has also since covered up her shark tattoo.\n\nDrake still spoke of his romance with Rihanna warmly in October 2018, telling LeBron James in The Shop, \"As life takes shape and teaches you your own lessons, I end up in this situation where I don't have the fairy tale, like, 'Oh, Drake started a family with Rihanna and this is like so perfect.' It looks so good on paper. By the way, I wanted that too at one time.\"\n\nHailey Bieber\n\nFrazer Harrison/Getty\n\nIn May 2016, during what was likely an off-again period with Rihanna, Hailey Bieber (then Baldwin) and Drake reportedly got cozy at his Memorial Day party.\n\n\"They were having a lot of fun together and were very affectionate,\" a source said at the time.\n\nThe pair were linked again weeks later after being spotted together at Hollywood hotspot The Nice Guy.\n\n\"Drake and Hailey are dating super casually, but he is really into her,\" an insider told PEOPLE. \"They met through mutual friends and are taking things slow.\" He was spotted the same month wearing her Jennifer Fisher \"h\" pendant necklace.\n\nOf course, Hailey went on to marry a different Canadian crooner, tying the knot with Justin Bieber in 2018.\n\nJennifer Lopez\n\nLeon Bennett/Getty Images\n\nJennifer Lopez and Drake sparked dating rumors in December 2016 when they worked together on a collaboration and posted the same caption-free snap of themselves cuddling on Instagram.\n\n\"They seem to really like and respect each other, but it's early,\" an insider told PEOPLE at the time. \"Where it goes, we shall see. Friends of them both are hoping it becomes something, but it's too early to say more than that.\"\n\nAbout a week later, a source told PEOPLE, \"Jen loves the attention and she seems very happy to be spending time with him. Drake is very charming. He treats Jen with lots of respect. She seems very smitten.\"\n\nThe pair celebrated New Year's Eve together, where J. Lo rocked a $100,000 Tiffany necklace that Drake gifted her. They dated throughout January, with Drake even meeting Lopez's children Max and Emme, but fizzled by February. \"It was never very serious. They like one another and had fun together,\" a source said at the time. \"It was and is fun when they see each other. They love hanging out and making music together. [Jennifer] has great respect for him and his talent and he does for her as well.\"\n\nBy March, Lopez was dating Alex Rodriguez.\n\nSophie Brussaux\n\nSophie Brussaux Instagram\n\nDrake and Sophie Brussaux were not together long, but they'll forever be linked through their son, Adonis.\n\nDrake and Brussaux, a former adult film star turned painter, we first spotted together in January 2017 after his split from Lopez. That May, she reportedly claimed she was pregnant with Drake's child. Drake denied it at the time, with a rep for the \"One Dance\" rapper telling PEOPLE, \"If it's in fact Drake's child, which he does not believe it is, he will do right by the child. She's just another woman in a long line of women claiming he got them pregnant.\"\n\nIn May 2018, Pusha-T rapped about Drake having a secret son in his diss track \"Son of Adidon.\"\n\nAccording to TMZ, Drake began financially supporting Brussaux shortly before she gave birth to their baby boy on Oct. 11, 2017; a paternity test in March 2018 proved the boy was his. Drake referenced the paternity test as well as his own mother, Sandi Graham, in a song called \"March 14\" from his album Scorpion, rapping, \"She's not my lover like Billie Jean but the kid is mine/Sandi used to tell me all it takes is one time, and it took was one time/S—, we only met two times, two times.\"\n\nSince Drake's paternity was proven, he and Brussaux have successfully co-parented Adonis, often sharing sweet moments with their son on social media.\n\nKylie Jenner\n\nKevin Mazur/Getty\n\nDrake may have had a fling with Kylie Jenner in 2019 during one of her off-again periods with Travis Scott (with whom she shares daughter Stormi and son Aire). A source told PEOPLE in November 2019 that Jenner and Drake took their once-platonic relationship to romance, explaining, \"He and Kylie have been spending time together recently. They've been friends for a long time and Drake is very close to the family.\" While some insiders said the pair were dating casually, others said they weren't dating at all.\n\nA source later told PEOPLE, \"She has been hanging out with Drake. Mostly together with other friends as well. She has known Drake for a while. They are not in a relationship. It mostly seems like they have chemistry, flirt and hang out. Nothing too complicated.\"\n\nDrake and Jenner had a bit of awkward history as well, as Drake previously feuded with Jenner's ex Tyga.\n\nJulia Fox\n\nJulia Fox. Dominik Bindl/WireImage\n\nJulia Fox was quite public in her brief romance with Kanye West, but her even briefer 2020 dalliance with the \"Hotline Bling\" rapper flew much more under the radar.\n\nFox opened up about her date with Drake in a February 2022 episode of her Forbidden Fruits podcast. \"He's a great guy and a gentleman ... and that was it. Nothing really happened, we were just, like, friends hanging out,\" Fox said. \"I wouldn't say that we were dating.\"\n\nFox also said that Drake and West were no longer beefing, explaining, \"I feel like they've squashed their issues. Obviously, when I first started speaking to Ye, I told him immediately — I think on the first day, before it went any further — because I'm just an honest person.\"\n\nIn a January 2023 interview on Watch What Happens Live With Andy Cohen, Cohen got Fox to admit that Drake was her best celebrity date, though she had initially said she wouldn't reveal the identity of the mystery man who wooed her by \"being on a private jet, cuddled on the jet, landed, got some Chanel bags … it was great, yeah.\"\n\nJohanna Leia\n\nVivien Killilea/Getty\n\nIn 2021, Drake dated Johanna Leia, the mom of young basketball phenom Amari Bailey, for several months, with their romance going public in July of that year. At the time, Drake acted as a mentor to Bailey, who was set to begin playing basketball for UCLA in 2022. Drake treated Leia to a private dinner at an otherwise empty Dodger Stadium after he made a donation to the Los Angeles Dodgers Foundation, ABC 7 reported. The pair appear to have fizzled out, as Leia said she was single and mingling in an interview in March 2022.", "images": ["https://people.com/thmb/4spDnnMQRYK9lRmor6IXKBrK1lA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/jane-fonda-NAMI-Benefit-Performance-2025-103125-37840e82dbf24109a639caff253df57b.jpg", "https://people.com/thmb/LztNjwaQ-ix4eK4edUooLhNiWi4=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/anna-kepner-3-111025-c6a90b2f57474459a89ae04e296ec343.jpg", "https://people.com/thmb/1lanvimOx0qxc55WKx9bVJ8Dfi8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/kat-dennings-e9704ffbc6a340c2aec42d16a4b4729a.jpg", "https://people.com/thmb/7eFBql8ZZe4iIl8RO9K1pd-UAEc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/justin-hailey-bieber-victoria-monet-tout-123024-a66fb0ee0a89478fbe5e25ba9df61587.jpg", "https://people.com/thmb/908JzGVf8M4nuM_--fa2TdEz7xw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Timothee-Chalamet-090725-1-f04c76d314c3438eb4627a24a297b70b.jpg", "https://people.com/thmb/JriXaljCvYCwii_fihblnkg52tc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/justin-bieber-hailey-bieber-111325-75f47ad4431d4e9085a6570e2de2bde4.jpg", "https://people.com/thmb/rINDtB0MQCo48KtXUg0m4fJhGfc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/asap-rocky-cfda-speech-110425-7eb2d6d7735d4911810bf0f0c93984c6.jpg", "https://people.com/thmb/WO727RY_VPTJT1R-zMu5fn2Pzw8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/sophie-brussaux-443619764b664691ad0be2bff607e789.jpg", "https://people.com/thmb/GDCOzkxBCGOp67K4hBAXD1iBSio=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/eddie-murphy-nicole-mitchell-paige-butcher-split-111325-ce081c34ea7b46f884155c23e91c0aef.jpg", "https://people.com/thmb/kaRHNOhVgjno5d6zhDwXgSOyFLU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Britney-Spears-Kim-Kardashian-111625-5-8cb8385fc6b64c5aae2953f05f700a88.jpg", "https://people.com/thmb/LzR1NhfY9LSTTN6Vl_yg0YFF0jU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(1059x105:1061x107)/julia-fox2-2000-5e135b98c9cf4bb9b107b4f95e62d09f.jpg", "https://people.com/thmb/BB7vYW82d0oBPiFINmr76DIy2dY=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/ben-dreyfuss-richard-dreyfuss-111925-b670f8ab6f994d1d9dfce1fa0726d205.jpg", "https://people.com/thmb/9p9g47o9Da87a-A2CquNpS3cz4k=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(1618x0:1620x2)/jennifer-lopez-green-houndstooth-coat-tout-d57b0f6151fe4bfcb6966f79b1aaa13e.jpg", "https://people.com/thmb/oMAhmBVvFbzWV0QWJrniU92tUlk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/justin-bieber-hailey-beiber-111425-d61e4c9363354321a091b810b74f7bf4.jpg", "https://people.com/thmb/W58dZh_abhfwOMH-87XLa_f-GpE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Britney-Spears-Khloe-Kim-Kardashian-111525-11e2f82bf31c480b912e26530a2f9217.jpg", "https://people.com/thmb/RASqpftmadWtNWHswpVB_6OhgJE=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(959x0:961x2)/rihanna-and-drake-wp-1-24e9b858fd1847b9a4b0a50e8621f801.jpg", "https://people.com/thmb/GV6bqVjqa4Mk6AbFtOKnwkphnF8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Hailey-Bieber-Justin-Bieber-The-League-090525-tout-29ed83d66f3f4ea483a0a52387bb4ca8.jpg", "https://people.com/thmb/nCumenD_dFsoeySCRVQlphXJJvY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/tyra-banks-0f13d21e4083482386f1c3734cc02040.jpg", "https://people.com/thmb/88LvTiUHo55bEx_tk4HZKy5ltvU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/johanna-leia-4f294ee360cc49559496631f050e3d35.jpg", "https://people.com/thmb/XGKy6h_fuvbuTE9HF1a3rx9Sfns=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Hailey-Bieber---Kendall-and-Kylie-Jenner-384-110725-d987361412f949cab010204c704c0bdc.jpg", "https://people.com/thmb/uyAxSo0cYEf54-wLbh03HFJybzs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/jennifer-anniston-boyfriend-jim-curtis-main-split-071425-d2a379b4d8c54b38bbdb04702f5913e7.jpg", "https://people.com/thmb/NME7lkCtOeNzPmLBS9A804fpAaU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/kylie-jenner-best-fashion-24-891cd385f0874ba583c8a590caf9aba9.jpg", "https://people.com/thmb/3Vnur9Vvx8F6lWI5EUBfmQaG010=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/Timothee-Chalamet-090725-1-f04c76d314c3438eb4627a24a297b70b.jpg", "https://people.com/thmb/LqI5lbwNdLhDVlgyU_CBYhOVoAE=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/drake-rihanna-9db2219bba1b4a14bd3dfda52a9a56d3.jpg", "https://people.com/thmb/5dgpVgL820ifGGAGW_ZSYKsWBKk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/hailey-bieber-justin-bieber-5-484cc6f2e7074c6893410cfa6c1cd90b.jpg", "https://people.com/thmb/FjT94g7ysMghoUznUkd490vtzlg=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/Hailey-Bieber---Kendall-and-Kylie-Jenner-384-110725-d987361412f949cab010204c704c0bdc.jpg", "https://people.com/thmb/CqoWQ8dw_MZShXbG8ZvEQw-P5dY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(734x349:736x351)/sza-met-gala-121322-37108b028e7a43f29e7504af9dbf86ab.jpg", "https://people.com/thmb/j3qf-BDqR2Nhug2Ay4nDyrYVeyI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(1079x449:1081x451)/drake-dcb24fd1c49644c1b5e7de9ac22396cd.jpg", "https://people.com/thmb/GwFXLRu6Xcrg6J_kcVOsm190DD0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/billy-bob-thornton-angelina-jolie-connie-angland-split-111925-73d94569a50e4ea2a0963c4f658f9471.jpg", "https://people.com/thmb/7yAdqIptqiGU5AN5YuY6z9Tp51U=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(787x276:789x278)/Serena-Williams-Vanity-Fair-121724-tout-2c08f635188a41d59a3c2803c520fc44.jpg", "https://people.com/thmb/0jKnK8bSyr7Fb41sXsNwd1jtAFM=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/jenna-bush-hager-minka-kelly-today-with-jenna-and-friends-111925-7e3c2b8605fe4a96a1b712c168083adb.jpg", "https://people.com/thmb/ZQpWhCusQJrOZFRAzvCa5CbL8PM=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/asap-rocky-cfda-speech-110425-7eb2d6d7735d4911810bf0f0c93984c6.jpg", "https://people.com/thmb/xJ5yPr4B8rV0NvxaSXb8GkCfE98=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/rihanna-asap-rocky-092225-4862bde1b319450c8fac79c6ade3931e.jpg", "https://people.com/thmb/zdFS1n2y9dNM-ndOtRjWY9G0kI4=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/Daniella-Karagach-111925-ls-1ffa54ba0f1749e380cfe98771660e16.jpg", "https://people.com/thmb/t8nkiyEbv1aONVIGFnkS1IxtoHI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/hailey-bieber-2d94c1bafe17412b98a2baf82837e462.jpg", "https://people.com/thmb/PRUt5Rb6-Pby6Uiffq1Ns9snXjg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/justin-bieber-hailey-bieber-110425-79cd3c2c5d4d4c28aef21f5fc0422ef7.jpg"], "top_img": "https://people.com/thmb/j3qf-BDqR2Nhug2Ay4nDyrYVeyI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(1079x449:1081x451)/drake-dcb24fd1c49644c1b5e7de9ac22396cd.jpg", "keywords": [], "authors": ["Jessica Sager", "People Editorial Guidelines", "Charna Flam", "Angel Saunders", "Bailey Richards", "Elizabeth Rosner", "Kimberlee Speakman", "Stephanie Kaloi", "Samantha Stutsman", "Skyler Caruso"], "canonical_link": "https://people.com/music/drake-dating-history/", "title": "Drake's Dating History: From Rihanna to Jennifer Lopez", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Drake has been linked to stars like Rihanna, Jennifer Lopez, Kylie Jenner and more over the years. Here's a look back at his complete dating history.", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "PEOPLE", "sailthru.author": "Jessica Sager", "parsely-section": "Celebrity", "parsely-tags": "People.com,Celebrity,Person,Celebrity Relationships,Kylie Jenner,Hailey Bieber,Drake,Sza", "article": {"section": "People", "author": "https://www.facebook.com/peoplemag"}, "og": {"type": "article", "site_name": "People.com", "url": "https://people.com/music/drake-dating-history/", "title": "Drake's Dating History: From Rihanna to Jennifer Lopez", "description": "Drake has been linked to stars like Rihanna, Jennifer Lopez, Kylie Jenner and more over the years. Here's a look back at his complete dating history.", "image": "https://people.com/thmb/j3qf-BDqR2Nhug2Ay4nDyrYVeyI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(1079x449:1081x451)/drake-dcb24fd1c49644c1b5e7de9ac22396cd.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Drake's Dating History: From Rihanna to Jennifer Lopez", "description": "Drake has been linked to stars like Rihanna, Jennifer Lopez, Kylie Jenner and more over the years. Here's a look back at his complete dating history.", "image": "https://people.com/thmb/j3qf-BDqR2Nhug2Ay4nDyrYVeyI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(1079x449:1081x451)/drake-dcb24fd1c49644c1b5e7de9ac22396cd.jpg"}, "vf": {"url": "https://people.com/music/drake-dating-history/"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.146.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.146.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.146.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.146.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.146.0/icons/favicons/mstile-310x150.png", "fb": {"pages": 95926963131}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}