{"url": "https://stayglam.com/life/couples-halloween-costumes/", "text": "65 Genius Couples Halloween Costumes\n\nAttending Halloween celebrations with your other half? Then consider a couples Halloween costume. There are so many amazing costumes that can involve the both of you. Some match and some aren’t complete without each other. We love these costumes and think you will too, so we have found 65 of the most genius couples Halloween costumes. There is something for everyone, from costumes inspired by TV shows to classics like clowns. Take a look and get inspired!\n\n1. Scary Couples Halloween Costume\n\nThe first costume idea we have for you is this scary clown couple. This pair have created scary circus clown inspired makeup, complete with outfits. Costumes like these will be a hit at any party and you will look spooky together and apart. Recreate this look or create your own terrifying or nice clown costumes.\n\n2. Barbie and Ken Couples Halloween Costume\n\nAre you a Barbie girl, in a Barbie world? Then this next costume idea is for you. These two have dressed up as one of the most iconic couples – Barbie and Ken. This is such a fun idea since they have given the costumes a Halloween twist by adding fake blood. Create outfits similar to these, or try your own stylish and spooky ideas.\n\n3. Medusa and Stone Statue\n\nOur next costume idea was inspired by Greek mythology. Here we have Medusa and a stone statue. Medusa was a mythical monster who had the power to turn people to stone when they looked at her. This couple features Medusa and the unfortunate person who looked at her face. This is a fun and unique costume idea that would be amazing for a Halloween party.\n\n4. Little Red Riding Hood and the Wolf\n\nNext, we have a costume idea inspired by the fairy tale Little Red Riding Hood. One has dressed up as Red Riding Hood and the other is the wolf. The couple have given the costume a Halloween twist by adding claw marks. You can recreate it with or without the fake blood. Either way, this couples Halloween costume will be a hit!\n\n5. Zombie Trash Family\n\nLooking for a fun and unique couple’s costume? Then this is the idea for you. These two have dressed up as family called zombie trash. A costume like this is perfect for the couple who like to have a laugh and a joke. It is a costume that allows you both to join in with Halloween, but not take the costume too seriously.\n\n6. Ventriloquist and Dummy\n\nVentriloquist dummies are known to be super creepy so it is no surprise that they have inspired many Halloween costumes. This next couple have created an awesome costume where one is the dummy and the other is the ventriloquist. You can recreate doll makeup like featured or go for even a more a scarier look with fake blood and colored contact lenses.\n\n7. Bonnie and Clyde\n\nNext, we have Halloween costume idea inspired by Bonnie and Clyde. Bonnie and Clyde were a gangster couple in the 1930’s and their story has since been turned into movies and musicals. These two have created a couples Halloween costume based on their look. It is a cool idea that has some history to it too. Also, the costume is super easy to put together.\n\n8. Stranger Things Couples Halloween Costume\n\nStranger Things is a super popular TV show and many have chosen this show as inspiration for their Halloween costumes. These two have dressed up as two different versions of the character Eleven. You can recreate something similar to this or choose two other characters. This costume is unique and creative – we love it!\n\n9. The Sims\n\nAnyone who is a fan of the game The Sims will love this next idea. These two have created a Sims couple’s costume. Their costumes are complete with a plumbob (green diamond above the head) and mouse cursor. You can wear any outfit for this costume, but The Sims do have expansion packs like Vampires, so this would be perfect for Halloween.\n\n10. Skeleton Couple Costume\n\nSkeletons are very popular costumes for Halloween. If you have already done the spooky and scary costumes, why not go for something unique and sparkly like these two?! They have cool skull makeup complete with gems and stylish outfits. A costume idea like this is perfect for the trendy couples that want to fit in with Halloween, but also look fashionable.\n\n11. Deer and Hunter\n\nDeer makeup has been very popular for a few Halloweens because it’s cute and easy to create. These two have turned the deer makeup into a creative and unique couple’s costume. One is the deer complete with a cute outfit and the other is a hunter complete with a camouflage suit. A costume like this would be great for a party.\n\n12. Cookie Monster and Cookie\n\nNext, we have a cute and funny couple’s costume idea. These two are dressed as the cookie monster and a cookie. It is a unique idea and it will make everyone laugh. Something like this is great for the couples that want to wear a costume but don’t want to be scary.\n\n13. Joker and Harley Quinn\n\nOur next couple have used popular costumes, the Joker and Harley Quinn, but added their own little twist. Instead of the guy being the Joker and the girl being Harley Quinn, they have swapped roles. This is a fun idea that will make your costumes be remembered! Is your partner willing to put some makeup on? We bet he will be thrilled!\n\n14. Gumball Machine and Money\n\nThe next couple featured have created a quirky Halloween costume of a gumball machine and money. This is so cute and would be a great DIY project. Something like this would be perfect for any Halloween celebrations, from parties with friends to parties with the family.\n\n15. IT Inspired Couples Halloween Costumes\n\nIT is a story about a clown that has terrified many people! This couple have put a unique twist on the characters from the story. One is wearing an outfit inspired by IT the clown while the other’s costume is inspired by the character Georgie. Outfits like these are perfect for parties and Halloween nights out.\n\n16. Funny Couples Halloween Costumes\n\nOur next idea is unique, bold and different. It is perfect for the couples who like to laugh and be daring. These two are dressed as flashers. They are wearing long coats and when they open the coat, they are wearing nothing except pixels, which keep them decent. A costume like this is fun and will be remembered.\n\n17. Mermaid and Sailor\n\nNext, we have a cute Halloween costume idea for couples. One is dressed as a sailor and the other is dressed as a mermaid. Costumes like these are quite easy to put together. You can go for a look similar to this one or try other mermaid and sailor costumes.\n\n18. The Joy of Painting\n\nThis next couple have unique and fun costumes. Their costume was inspired by a TV show called The Joy of Painting which aired during the 80’s and 90’s. The girl is dressed as presenter Bob Ross and the guy is dressed as the painting. We love this quirky costume idea!\n\n19. Popeye and Olive Oyl\n\nLooking for a cute couples Halloween costume that everyone will know? Then this is for you. Here we have costumes inspired by Popeye and Olive Oyl. Costumes like these are perfect for parties and great if you both want to dress up without being scary.\n\n20. Scooby Doo and Shaggy\n\nScooby Doo is a classic cartoon. It is all about monsters, ghosts and more so it is perfect as inspiration for Halloween costumes. This couple have dressed up as Shaggy and Scooby Doo. These two go together like salt and pepper, so it is a great costume for the inseparable couples. It is a fun choice for Halloween.\n\n21. The Handmaid’s Tale\n\nThe Handmaid’s Tale is another popular show and these two have dressed up as characters from the series. This is a clever costume because it involves the ladies baby bump. Costumes like these will be a hit at parties as fans of the show will love your outfits.\n\n22. The Purge\n\nOur next Halloween costume is scary in a different way from ghosts and ghouls. This costume has been inspired by The Purge. You wouldn’t want to come across these two at a party, what a fright! Costumes like these will look great on photos and give everyone chills.\n\n23. Up Inspired Costumes\n\nWe couldn’t have a costumes list without mentioning Disney! This couple have created costumes inspired by the movie Up. One is dressed as Carl Fredricksen and the other is Russell. This is a cute costume idea and you can recreate outfits from any Disney movie.\n\n24. Sexy Couples Halloween Costumes\n\nNext, we have a zombie bride and groom idea. The couple have dressed in outfits inspired by a bride and groom with fake wounds and scary contacts. This would be great for newly weds or for the couples due to be married. You can recreate a similar look for the bride or wear a white dress.\n\n25. Game of Thrones Inspired Costumes\n\nThe next couples Halloween costumes on our list were inspired by Game of Thrones. The couple have created costumes and makeup that make them look like they were infected with Greyscale. As fans will know, this causes the skin to become like stone. This is an awesome costume idea, perfect for fans of the show.\n\n26. Spooky Skeletons\n\nNext, we have a couple that look like spooky skeletons. The outfits are kept simple and one of them has full face makeup while the other has only half. This is an easy to wear couples costume that would be perfect for a party. Recreate this look or you can both have matching skeleton makeup. Either way, you both will look cool and creepy.\n\n27. Beetlejuice and Lydia Deetz\n\nLove the movie Beetlejuice? Then this idea is perfect for you! Here we have a couple dressed as Beetlejuice himself and Lydia Deetz. You can recreate this look or choose to wear your favorite costume from the movie – the striped suit is very popular. We think this idea is awesome and all the other fans of the movie will love your costume too.\n\n28. Creative Corona and Lime Wedge Costume\n\nIf you love beer and want a fun and unique costume, then you need to check this out. This couple have created a Corona and lime wedge costume. We love this because you can’t have a Corona without a lime wedge which can also represent how you can’t have one of you without the other. This would be perfect for a party or if you are celebrating Halloween out on the town.\n\n29. Frankenstein and His Bride\n\nFrankenstein is one of the most popular Halloween characters. This next couple have chosen to be Frankenstein and his bride for Halloween. It is such a fun and spooky look. This is perfect for those who are a fan of classic horror. We love this idea, it is one of our favorites!\n\n30. Scary Pumpkin and Scarecrow\n\nThe next idea will definitely creep everyone out this Halloween! Here we have a scarecrow and a pumpkin. The makeup is amazing and once it is dark, the pumpkin will look especially scary. Makeup like this will take practice but it is quite easy to do. You can recreate this or make the scarecrow look even more terrifying. Either way, you both will look awesome.\n\n31. Pop Art Zombies\n\nZombie costumes are so popular at Halloween. This next couple have given their zombie costumes a unique twist. Instead of the classic gory and bloody makeup, these two have gone for a more vibrant, pop art look. We love this because it reminds us of zombies that you would see in a comic. With makeup like this you will both stand out from the rest of the undead.\n\n32. Ariel and Prince Eric\n\nJust because it is Halloween, it doesn’t mean that your costume has to be scary. You could go for something cute like this. This couple have chosen to be Ariel and Prince Eric from the movie The Little Mermaid. Costumes like these are for the couples who are Disney fans and for those who prefer the heroes over the scary villains.\n\n33. Morticia and Gomez Addams\n\nNext, we have a costume that is perfect for those who love The Addams Family. These two have chosen to dress up as the iconic Morticia and Gomez Addams. Costumes like these will be easy to recreate and are perfect for a party. Not only that, but you can join in the fun of Halloween but you will still look like an elegant and stylish couple too.\n\n34. Mexican Sugar Skull Inspired Costumes\n\nSugar skulls are another popular costume and idea and this couple have worn the look in style. The costumes and makeup are amazing. You can go all out like this or choose a more toned down look. Either way, you will look awesome. Sugar skull makeup does take practice but there are plenty of tutorials online.\n\n35. Circus Skeletons\n\nThe next couples costume idea has been inspired by the circus. These two are dressed up as ringmasters and have skeleton makeup. This is a creepy and super cool costume idea. It is a unique take on the classic skeleton look and we love the circus theme. These costumes are perfect for a party!\n\n36. Skeleton Couple Costume\n\nCelebrate Halloween in style with skeleton costumes like these. The guy is wearing spooky skeleton makeup and a tuxedo while his partner is wearing cute skull makeup with a trendy outfit. Costumes like these are for the couples that want to dress up for Halloween but who still want to look fashionable too.\n\n37. Starbucks Couple Costume Idea\n\nDo you and your other half love Starbucks? If so, this is the costume for you. One is dressed as the barista and the other is dressed as a drink. These costumes will require creativity and imagination but they are fun and unique. You can dress as any drink. This idea will definitely make you stand out from the crowd.\n\n38. Gangster Clowns\n\nLike clown makeup but would like a design that is a little more unique? If so, check out this next idea. Here we have gangster clowns. As you can see, you still get the creepiness and fun of the clown makeup but it has a twist. Recreate colorful makeup like this or you can go for darker and more spooky colors.\n\n39. Britney Spears Costume Idea\n\nThis next costume idea is a must-have for fans of Britney Spears. Here we have a couples costume that features Britney from the music video Oops I Did It Again and her other half is the astronaut. This is a very unique idea and we love how creative it is. If you can’t find a red suit, then just choose a red top and pants. Astronaut costumes can be bought online.\n\n40. Funny Popeye and Olive Costumes\n\nNext, we have another unique costume idea. This couple chose to celebrate Halloween dressed as Popeye and Olive Oyl. It is perfect for anyone who loves the cartoon. You can buy Popeye and Olive Oyl costumes online. If you want to be creative, then you can create your own version of the costumes yourself.\n\n41. Prom Zombies\n\nIf you love the zombie costume ideas, then you need to see this next idea. These two are dressed like they are going to the prom but they look like zombies. This is such a cool idea! It is also different to the zombie costumes that we usually see. You can also dress in a glam clothes so you get the best of both worlds – you can be scary but gorgeous too!\n\n42. Last Minute Couples Costume\n\nGive everyone a fright this Halloween with costumes like these. One is wearing a creepy mask and the other has skeleton makeup which looks like a mask too. Both are wearing bloody clothes. This is a scary idea and it would be great as a last minute costume. It is the perfect look for a party!\n\n43. Funny Cleopatra and Caesar\n\nDo you both like to joke and have a laugh? If so, show your sense of humor this Halloween with a costume like this. This couple have created a unique take on Cleopatra and Caesar. Her costume is beautiful and classic while her other half seems to have accidentally dressed as a Caesar salad dressing. This is a quirky and fun costume that will be remembered.\n\n44. Couples Frankenstein Costume\n\nEarlier in the post we shared a Frankenstein costume idea. If you liked that, then you need to see these costumes too. This couple are also dressed as Frankenstein and his bride. This time they both have matching stitches makeup but it is just a different color. These are cool and easy to wear costumes that will be great for any party. It would be great for any last minute events too.\n\n45. Scary Skeletons\n\nWant costumes that make a statement? If so, this idea could be perfect for you. Here we have more skeleton couples costumes. One is dressed in a skeleton suit with skull makeup and glam hair. The guy is more scary with contact lenses and a wig. Costumes like these are perfect for a Halloween night on the town.\n\n46. Ash and Pikachu\n\nNext, we have an idea that is perfect for those who love Pokemon. This couple have dressed up as Ash and Pikachu. It is such a fun idea and you can DIY the costume or buy them online. Recreate these two characters or base it off your favorite characters instead. There are lots of Pokemon to choose from.\n\n47. Beetlejuice Costumes for Halloween\n\nBeetlejuice is a Halloween classic and this next couple have created perfect costumes. One is dressed as Lydia and the other as Beetlejuice himself. This is a fun Halloween costume and everyone will know who you are. Recreate these or maybe dress up as Adam and Barbara instead.\n\n48. Jack and Sally\n\nAre you and your other half a fan of The Nightmare Before Christmas? If so, these costumes are for you. One is dressed up as Sally and the other is Jack. These costumes look so cool and they are great for those who love Halloween. You can buy Jack and Sally costumes online and there are makeup tutorials online.\n\n49. Dexter Inspired Costumes\n\nThis next costume is one of our favorites! These two have based their costumes on the TV show Dexter. One is dressed as the killer himself while the other is his victim. This is unique idea and it is a must-have for fans of the show. You can dress up as any character as there are a lot of victims to choose from.\n\n50. Priest and a Nun\n\nThe next idea is fun and it has become a very popular Halloween costume in recent years. For this couple’s costume, one is a nun and the other is a priest. There are lots of different priest and nun costumes available online so there is a style for everyone. You could even make these more spooky by adding contact lenses and scarier makeup.\n\n51. Who Framed Rodger Rabbit Costumes\n\nJessica Rabbit is another popular costume and here is a cool version for couples. These two look very much like the characters in the movie and it is fun look. Something like this is great for those who want to dress up without being scary. You can DIY this costume or buy a set online. Jessica Rabbit is more popular so you may have to shop around to find the other one.\n\n52. Grandma and Grandpa\n\nIf you’re looking for a fun and simple costume, then this is perfect. These two are dressed as grandma and grandpa. You can have so much fun with this costume as you can shop around to find some fun and vintage clothing. Maybe even make zombie versions as it is Halloween.\n\n53. Geralt and Yennefer Costumes\n\nAre you a fan of the Witcher? Then you need to see this. One is dressed as Geralt and the other Yennefer. This is an awesome idea for couples and it is great for those who love the series, books and games. Something like this is perfect for parties as the Witcher is very popular at the moment. You can buy Witcher costumes online.\n\n54. Pirates\n\nAhoy there mateys! Here is a costume for those who love pirates. As you can see, both are dressed as pirates. This is an fun and awesome costume for parties and night outs. There are lots of different pirate costumes available online so you can choose one that’s right for you. You could even dress up as a skeleton pirate.\n\n55. Hot Sauce Inspired Costumes\n\nNext, we have cute and fun costumes inspired by hot sauce. The couple are dressed as different versions of hot sauce with different outfits and signs. This is a unique idea and it is perfect for those who love hot sauce. Recreate this or create an outfit based on your favorite sauce, drink or food.\n\n56. Barbie and Ken\n\nThis next costume is a classic! Here we have a couple dressed as Barbie and Ken! Barbie is wearing a pink outfit complete with accessories while Ken is wearing a simple and stylish outfit with a wig. This is a fun idea and there are so many outfits worn by Barbie and Ken that you can be inspired by. You could even make scary versions.\n\n57. Ninja Costumes for Halloween\n\nShow off your fierce side with ninja costumes like these. The costumes color match and are the same style so you know this is a couple’s costume. Both look super cool and it is a fun look for Halloween. There are lots of ninja costumes available online so there is something for everyone.\n\n58. Doctor and Nurse\n\nThe next costume idea is another Halloween classic. This couple are dressed as a doctor and a nurse. Not the kind that you would want to save you though, as these are scary versions. Both have fake bloodstained clothes complete with contacts. This is a spooky idea and it is perfect for Halloween parties with friends.\n\n59. Game of Thrones Inspired Costumes\n\nIf you and your other half are fans of Game of Thrones, then this is for you. One is dressed as Daenerys Targaryen and one is dressed as white walker. This is a must-have for fans of the show. Try and recreate these characters or you can choose two others. Maybe Jon Snow?\n\n60. Where’s Wally\n\nNext, we have a unique costume idea. This couple have dressed up as Wally or Waldo and Carmen Sandiego. These are fun costumes and are perfect for couples who do not want to be scary or for those dressing up with family. It is also great for those who want to try something different to the usual Halloween classics.\n\n61. Skeleton Couples Costumes\n\nThis next couple have chosen another Halloween classic. Here we have two skeletons. This couple look stylish and spooky, and one also has a Lara Croft vibe. Something like this is perfect for those who want to look scary but also look trendy. Outfits and makeup like this is great for parties and you can find skeleton makeup tutorials online.\n\n62. Funny Couple’s Costume for Halloween\n\nIf you want to show off your sense of humor, then this costume idea is perfect. These two are dressed in fun outfits complete with beer, a baby and they are also smoking. It is a fun way to say that sometimes people can be a little scarier than the classic Halloween characters. This is a great DIY costume too.\n\n63. Police Couple’s Costumes\n\nNext, we have another classic costume. One is a dressed as a cop and the other a prisoner. This is another fun costume. You can buy these costumes online so you can recreate the look. You could try this or you could even make the costumes more scary by wearing contact lenses and spooky makeup.\n\n64. Lara Croft and Indiana Jones\n\nLove adventures? If so, these costumes are for you. Here we have a couple and one is dressed as Lara Croft and the other is Indiana Jones. It is such a unique idea and it is perfect for those who love Tomb Raider and Indiana Jones. These costumes can be a DIY project or can be bought.\n\n65. Chucky Couple’s Costumes\n\nThe next couple are super scary. As you can see, one is dressed up as Chucky and the other as his bride Tiffany. This is perfect for fans of the movie and there are lots of Chucky makeup tutorials online. Both costumes can be easy to recreate and you can buy costumes or make them yourself.\n\nWe hope you’ve been inspired by these genius couples Halloween costumes and have found the perfect look for you and your partner!", "images": ["https://stayglam.com/wp-content/uploads/2020/08/Grandma-and-Grandpa.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Genius-Couples-Halloween-Costumes-1.jpg", "https://stayglam.com/wp-content/uploads/2020/08/Lara-Croft-and-Indiana-Jones.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Little-Red-Riding-Hood-and-the-Wolf.jpg", "https://stayglam.com/wp-content/uploads/2020/08/Skeleton-Costumes.jpg", "https://stayglam.com/wp-content/uploads/2019/08/Stylish-Skeletons.jpg", "https://stayglam.com/wp-content/uploads/2020/08/Jack-and-Sally.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Gumball-Machine-and-Money.jpg", "https://stayglam.com/wp-content/uploads/2020/08/Hot-Sauce-Inspired-Costumes.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Zombie-Bride-and-Groom.jpg", "https://stayglam.com/wp-content/uploads/2023/05/stayglam-logo-bw.png", "https://stayglam.com/wp-content/uploads/2020/08/Wheres-Wally.jpg", "https://stayglam.com/wp-content/uploads/2020/08/Doctor-and-Nurse.jpg", "https://stayglam.com/wp-content/uploads/2020/08/Who-Framed-Rodger-Rabbit-Costumes.jpg", "https://stayglam.com/wp-content/uploads/2020/08/Beetlejuice-Costumes-for-Halloween.jpg", "https://stayglam.com/wp-content/uploads/2023/05/logofooter.png", "https://stayglam.com/wp-content/uploads/2018/08/Scary-Clowns.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Up-Inspired-Costumes.jpg", "https://stayglam.com/wp-content/uploads/2019/08/Couples-Costume-for-Starbucks-Lovers.jpg", "https://stayglam.com/wp-content/uploads/2020/08/Pirates.jpg", "https://stayglam.com/wp-content/uploads/2020/08/Game-of-Thrones-Inspired-Costumes.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Medusa-and-Stone-Statue.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Ventriloquist-and-Dummy.jpg", "https://stayglam.com/wp-content/uploads/2019/08/Scary-Pumpkin-and-Scarecrow.jpg", "https://stayglam.com/wp-content/uploads/2019/08/Scary-Skeletons.jpg", "https://stayglam.com/wp-content/uploads/2019/08/Britney-Spears-Costume-Idea.jpg", "https://stayglam.com/wp-content/uploads/2020/08/Chucky-Couples-Costumes.jpg", "https://stayglam.com/wp-content/uploads/2019/08/Couples-Frankenstein-Costume.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Deer-and-Hunter.jpg", "https://stayglam.com/wp-content/uploads/2020/08/Priest-and-a-Nun.jpg", "https://stayglam.com/wp-content/uploads/2020/08/Barbie-and-Ken-1.jpg", "https://stayglam.com/wp-content/uploads/2019/08/Circus-Skeletons.jpg", "https://stayglam.com/wp-content/uploads/2018/08/The-Joy-of-Painting.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Bonnie-and-Clyde.jpg", "https://stayglam.com/wp-content/uploads/2019/08/Ariel-and-Prince-Eric.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Funny-Couples-Costume-Idea.jpg", "https://stayglam.com/wp-content/uploads/2020/08/Ninja-Costumes-for-Halloween.jpg", "https://stayglam.com/wp-content/uploads/2020/08/Funny-Couples-Costume-for-Halloween.jpg", "https://stayglam.com/wp-content/uploads/2020/08/Geralt-and-Yennefer-Costumes-.jpg", "https://stayglam.com/wp-content/uploads/2020/08/Police-Couples-Costumes.jpg", "https://stayglam.com/wp-content/uploads/2020/08/Ash-and-Pikachu.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Scooby-Doo-and-Shaggy.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Stylish-Skeletons.jpg", "https://stayglam.com/wp-content/uploads/2018/08/IT-Inspired-Costumes.jpg", "https://stayglam.com/wp-content/uploads/2018/08/The-Handmaids-Tale.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Cookie-Monster-and-Cookie.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Game-of-Thrones-Inspired-Costumes.jpg", "https://stayglam.com/wp-content/uploads/2019/08/Pop-Art-Zombies.jpg", "https://stayglam.com/wp-content/uploads/2019/08/Prom-Zombies.jpg", "https://stayglam.com/wp-content/uploads/2019/08/Gangster-Clown-Costumes.jpg", "https://stayglam.com/wp-content/uploads/2018/08/The-Purge.jpg", "https://stayglam.com/wp-content/uploads/2019/08/Beetlejuice-and-Lydia-Deetz.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Joker-and-Harley-Quinn.jpg", "https://stayglam.com/wp-content/uploads/2020/08/Dexter-Inspired-Costumes.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Stranger-Things.jpg", "https://secure.gravatar.com/avatar/50ec3eaadf212d0207f48fa87ea7804970aadf79f818fe748c98d0868b528c8f?s=150&d=mm&r=g", "https://stayglam.com/wp-content/uploads/2018/08/Genius-Couples-Halloween-Costumes.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Popeye-and-Olive-Oyl.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Barbie-and-Ken.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Last-Minute-Couples-Costume.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Zombie-Trash-Family.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Mermaid-and-Sailor.jpg", "https://stayglam.com/wp-content/uploads/2019/08/Creative-Corona-and-a-Lime-Wedge-Costume.jpg", "https://stayglam.com/wp-content/uploads/2018/08/The-Sims.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Frankenstein-and-His-Bride-Couples-Costume.jpg", "https://stayglam.com/wp-content/uploads/2019/08/Popeye-and-Olive.jpg", "https://stayglam.com/wp-content/uploads/2019/08/Mexican-Sugar-Skull-Inspired-Costumes.jpg", "https://stayglam.com/wp-content/uploads/2019/08/Spooky-Skeletons.jpg", "https://stayglam.com/wp-content/uploads/2019/08/Morticia-and-Gomez-Addams.jpg", "https://stayglam.com/wp-content/uploads/2018/08/Flashers.jpg"], "top_img": "https://stayglam.com/wp-content/uploads/2018/08/Genius-Couples-Halloween-Costumes.jpg", "keywords": [], "authors": ["Rebecca Puttock", "About The Author"], "canonical_link": "https://stayglam.com/life/couples-halloween-costumes/", "title": "65 Genius Couples Halloween Costumes", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "max-image-preview:large", "og": {"title": "65 Genius Couples Halloween Costumes", "description": "Attending Halloween celebrations with your other half? Then consider a couples Halloween costume. There are so many amazing costumes that can involve the both of you. Some match and some aren’t complete without each other. We love these costumes and think you will too, so…", "url": "https://stayglam.com/life/couples-halloween-costumes/", "site_name": "StayGlam", "image": "https://stayglam.com/wp-content/uploads/2018/08/Genius-Couples-Halloween-Costumes.jpg"}, "twitter": {"title": "65 Genius Couples Halloween Costumes", "description": "Attending Halloween celebrations with your other half? Then consider a couples Halloween costume. There are so many amazing costumes that can involve the both of you. Some match and some aren’t complete without each other. We love these costumes and think you will too, so…", "image": "https://stayglam.com/wp-content/uploads/2018/08/Genius-Couples-Halloween-Costumes.jpg", "card": "summary_large_image"}}, "movies": [], "publish_date": null, "source": "https://stayglam.com", "summary": ""}