{"url": "www.independent.co.uk/life-style/meghan-markle-nephew-cannabis-royal-wedding-sparkle-tyler-dooley-prince-harry-a8357426.html", "text": "Your support helps us to tell the story Read more Support Now From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it's investigating the financials of Elon Musk's pro-Trump PAC or producing our latest documentary, 'The A Word', which shines a light on the American women fighting for reproductive rights, we know how important it is to parse out the facts from the messaging. At such a critical moment in US history, we need reporters on the ground. Your donation allows us to keep sending journalists to speak to both sides of the story. The Independent is trusted by Americans across the entire political spectrum. And unlike many other quality news outlets, we choose not to lock Americans out of our reporting and analysis with paywalls. We believe quality journalism should be available to everyone, paid for by those who can afford it. Your support makes all the difference. Read more\n\nMeghan Markle’s nephew has announced details of the special strain of cannabis he has created to celebrate the upcoming royal wedding.\n\nTyler Dooley grows cannabis in Oregon, US – which has been legal in the American state since 2015 – and previously announced that he would be developing a new potent hybrid named Markle’s Sparkle.\n\nNow, days before Markle is due to marry Prince Harry, details of the drug’s price, flavour and effects have been released on Leaf Buyer – an online cannabis dispensary database.\n\nIn an online description of Markle Sparkle, the website says: “Noble families often inspire their country persons to craft and dedicate products to them.\n\n“For a Royal baby, a royal cheddar. For a Royal wedding, a royal weed.\n\n“Markle Sparkle is a cannabis strain dedicated to the soon-to-be British Royal Meghan Markle.”\n\nThe $150-an-ounce (£111) strain is tipped to be good for helping alleviate insomnia, pain and anxiety, and it has been specially engineered so that it doesn’t make users feel too hungry.\n\nThe website also says that Markle Sparkle has a “very sweet, silky taste” with “notes of fresh blueberry and a unique, fruity and smooth flavour.”\n\n(leafbuyer.com)\n\nAs for its effect, the drug is supposed to provide users with an “uplifting” experience and a “tingling body sensation.”\n\n“There is a sense of relief and euphoria that comes with the high as well,” it says.\n\n“These benefits make for a great all-around versatile strain for any medical patient or recreational consumer.”\n\nThe Markle Sparkle tests at 23 per cent THC - the active ingredient in marijuana – and is made by crossbreeding three varieties including NYC Diesel, Northern Lights with Blueberry and a secret strain which Dooley is not revealing.\n\nSold as part of a company called Royally Grown which Dooley set up with his mother Tracy - who was married to Markle’s half-brother Tom Markle Jr – Markle Sparkle isn’t the only product they are working on.\n\nRoyally Grown is also selling edibles like Markle Sparkle-infused brownies, oils and tinctures, as well as makeup, jewellery, bath products and an organic hemp clothing line.\n\nAccording to the Daily Mail, the new drug has already won the praise of marijuana industry newspaper High Times.\n\nIts spokesman Jon Cappetta has said: “If the quality of the strain matches the hype over its name, Markle Sparkle has the potential to be very lucrative.\n\n“Title strains like Blue Dream, Sour Diesel, or OG Kush are sought out by name across the world, and in turn can command higher rates.\n\n“These are decades old strains we're talking about. If this hits in the way they are hoping, it will not only make money for years to come, it actually has the potential to outlast the marriage.”", "images": ["https://static.the-independent.com/s3fs-public/thumbnails/image/2018/05/18/11/markle-sparkle-cannabis.jpg?width=1200&height=800&crop=1200:800", "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/05/18/11/markle-sparkle-cannabis-leafbuyer.jpg"], "top_img": "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/05/18/11/markle-sparkle-cannabis.jpg?width=1200&height=800&crop=1200:800", "keywords": [], "authors": [], "canonical_link": "https://www.independent.co.uk/life-style/meghan-markle-nephew-cannabis-royal-wedding-sparkle-tyler-dooley-prince-harry-a8357426.html", "title": "Meghan Markle's nephew sells new cannabis strain for the royal wedding", "meta_data": {"robots": "max-image-preview:large,max-video-preview:-1", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "Lifestyle", "sitename": "The Independent", "page path": "/life-style", "page type": "Article", "adPageType": "Article Page", "description": "Meghan Markle’s nephew has announced details of the special strain of cannabis he has created to celebrate the upcoming royal wedding.", "og": {"updated_time": "2018-05-18T11:05:24.000Z", "site_name": "The Independent", "title": "Meghan Markle's nephew sells new cannabis strain for the royal wedding", "url": "https://www.the-independent.com/life-style/meghan-markle-nephew-cannabis-royal-wedding-sparkle-tyler-dooley-prince-harry-a8357426.html", "type": "article", "description": "Meghan Markle’s nephew has announced details of the special strain of cannabis he has created to celebrate the upcoming royal wedding.", "image": {"identifier": "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/05/18/11/markle-sparkle-cannabis.jpg?width=1200&height=800&crop=1200:800", "secure_url": "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/05/18/11/markle-sparkle-cannabis.jpg?width=1200&height=800&crop=1200:800"}, "locale": "en_US"}, "article": {"published_time": "2018-05-18T11:05:24.000Z", "modified_time": "2018-05-18T11:05:24.000Z", "section": "Lifestyle", "author_name": "Sarah Jones", "content_type": "story", "word_count": 577, "image_count": 2, "embed_count": 3, "video_count": 1, "internal_link_count": 0, "external_link_count": 3}, "date": "2018-05-18T11:05:24.000Z", "viewport": "width=device-width,initial-scale=1,minimum-scale=1", "theme-color": "#919191", "indy-test-internal-article-helmet": "indy", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "twitter": {"title": "Meghan Markle's nephew sells new cannabis strain for the royal wedding", "site": "@Independent", "card": "summary_large_image", "description": "Meghan Markle’s nephew has announced details of the special strain of cannabis he has created to celebrate the upcoming royal wedding.", "image": "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/05/18/11/markle-sparkle-cannabis.jpg?width=1200&height=800&crop=1200:800"}, "keywords": "[\"Meghan Markle\",\"Royal Wedding\",\"Cannabis\",\"Internal\"]"}, "movies": [], "publish_date": 1526641524.0, "source": "http://www.independent.co.uk", "summary": ""}