{"url": "http://nymag.com/strategist/article/best-white-button-down-shirts-for-women.html", "text": "Best in Class The Strategist’s carefully chosen and rigorously vetted flagship shopping guides. Learn about our methodology here, and find all our Best in Class guides here. Photo: Marcus McDonald\n\nA white button-down shirt is just about as versatile as a piece of clothing gets. What else works equally well for a job interview, a late-night drink, and over a bikini? That said, sometimes you might want a specific kind of white button-down for a specific occasion — say, a linen one for vacation or a silk one for a date. With that in mind, I reached out to a number of women with admirable tastes — including stylists, designers, and brand founders — about the button-downs they wear most often. I tried a few of these out myself — checking for fit, especially, and the feeling of the fabric. Below, you’ll find the best white button-downs for women, from the fitted to the oversize. And for more button-downs, we have guides to the best button-downs for bigger busts, best white button-downs for men, and best Oxford shirts.\n\n﻿Updated on September 19, 2025\n\n﻿We checked the prices and stock of all products. Lululemon’s Relaxed-Fit Cotton-Blend Poplin Button-Down Shirt is currently out of stock, while J.Crew’s Garçon Classic Shirt is on sale for $70 now (from $98).\n\nOur top picks\n\nWhat we’re looking for Sizes As always with any kind of apparel, we’re focused on featuring button-downs offered in a wider selection of sizes rather than the frustratingly limited (but all too common) small-to-large range. Fabric Traditionally, cotton is the material of choice for button-downs, so that’s what most of the ones on this list are made of. It’s cheaper (compared to something like silk) and wears well, especially on the wrinkle-fighting front (unlike linen). Design details The old rule that a button-down must have buttons on the collar points (similar to a men’s Oxford shirt) isn’t really enforced in modern womenswear. In fact, button-down and button-up are used interchangeably to refer to any shirt with a row of buttons and a collar. Beyond those foundational details, anything’s really fair game, whether that’s pockets, ruffle pleats, curved hems, or puffed sleeves. I made sure to list the details of each shirt for easy reference. Just note that our panelists generally favored oversize styles (think Carrie Bradshaw’s post-pond look versus Carolina Herrera’s runway-ready tops). Price The cost-per-wear philosophy is helpful here — it makes sense to invest in a button-down since it’s pretty much dress code–proof. But my focus was on finding high-quality shirts that are actually worth what they cost, and whenever one was pricier, I tried to include an affordable alternative. The ones that made it onto this list are categorized as either under $50 ($), under $150 ($$), or over $150 ($$$).\n\nBest white button-down overall\n\nSaved View Want to be emailed when products you’ve saved are over 20% off? Success! You'll get an email when something you've saved goes on sale. Yes New! You can now save this product for later. AYR The Deep End Shirt - White $145 Sizes: XS–XL | Fabric: Cotton | Design details: Big patch pocket, curved hem | Price: $$ As I set out to make this guide, I imagined what the best button-down looked like: loose, with sleeves that could be cuffed at the elbow, and not sheer in the slightest. (Really, Ina Garten’s Hamptons uniform, thinking back on it.) The Deep End Shirt is just that. The lines of the silhouette just feel right, from the flattering seam across the shoulders to the curved hem that falls perfectly, and is neither too long nor too short. When I talked to Kate Sokolov, co-founder of Social Goods and a fan of this top, she suggested sizing down, and so I did. This meant the shirt just brushed against the shape of my body but wasn’t so billowing that my waist got lost. (If you prefer a looser fit, I’d say go for your regular size.) What convinced me that this was the best white button-down on the market was that it didn’t feel too buttoned-up. I can wear it with just about anything, from old jeans to itty-bitty shorts. And as Iva Pawling, founder of Richer Poorer, says, “I feel put together but not trying too hard.” The Oxford cotton — milled in Italy — that the shirt is made from has a pleasing weightiness, too, and reminds me of old Ralph Lauren button-downs. (If you prefer a different material, the shirt comes in chambray and linen too.) $145 at Ayr Buy\n\nBest (less-expensive) white button-down\n\nSaved View Want to be emailed when products you’ve saved are over 20% off? Success! You'll get an email when something you've saved goes on sale. Yes New! You can now save this product for later. Everlane The Boxy Oxford $98 $98 Sizes: XXS–XXL | Fabric: Cotton | Design details: Point collar, dropped shoulders, big patch pockets | Price: $ When I reached out to stylish women for this story, Everlane was the brand mentioned the most — “For the price, you can’t do much better” was the general sentiment I heard — and out of all the button-downs I tried, Everlane’s Boxy Oxford is the closest to Ayr’s Deep End. It comes with big patch pockets (two instead of one), dropped shoulder seams, and a curved hem (with cutouts on the sides — as seen here). And while the fit is similar to Ayr’s, the main difference is that the Boxy Oxford is squarer in shape. I liked that about it; the Oxford is very “I borrowed this shirt from someone else’s closet.” It also looks just as nice buttoned up as it does unbuttoned (usually, button-downs only look good one way or the other, in my opinion). It’s a real steal at $88, making it an affordable alternative to our best-in-class button-down. Other Everlane button-downs of note: the Relaxed Oxford and Way-Short. Bum-Cake Vintage owner Christiana Greene likes that the first is a little oversize. Blogger Kristina Zias agrees: “I wouldn’t say it’s the most ‘flattering’ shirt — I wear it unbuttoned.” Blogger Hailey Rizzo thinks the second is “cropped but not too cropped,” making it ideal for anyone hunting for a slightly shorter button-down. $98 at Everlane Buy\n\nBest white button-down for plus sizes\n\nSaved View Want to be emailed when products you’ve saved are over 20% off? Success! You'll get an email when something you've saved goes on sale. Yes New! You can now save this product for later. Old Navy Oversized Boyfriend Shirt $40 $40 Sizes: XS–4X (with petite and tall options) | Fabric: Cotton | Design details: Spread collar, patch pocket, curved hem | Price: $ Plus-size cuts have evolved over the years and become better fitting in the process. Content creator Nikki Apostolou — who is one of my go-to sources for plus-size fashion coverage — cites this button-down as one such example. She praises the boyfriend-style fit, which falls to the thighs rather than the top of the hips. And while it’s meant to be oversize, it’s not so oversize that you lose your shape entirely when it’s on. “If you have nothing to wear, reach for this and you do,” she says. “This is one of those pieces that works for any outfit.” The shirt is made from a cotton poplin that’s thin and delicate, according to writer Mya Gelber, who tried it on as part of her hunt for the perfect white button-down. It’s “something to throw over a swimsuit or for a stroll to the farmers’ market,” Gelber says. The Old Navy number comes in at just under $40 — and is often marked down — making it the cheapest button-down on this list. $40 at Old Navy Buy\n\nBest fitted white button-down\n\nSaved View Want to be emailed when products you’ve saved are over 20% off? Success! You'll get an email when something you've saved goes on sale. Yes New! You can now save this product for later. J.Crew Garçon Classic Shirt $75 $98 now 24% off $75 Sizes: 00-24 | Fabric: Cotton poplin | Design details: Bigger patch pocket | Price: $$ I’d be remiss not to include J.Crew on this list — I’ve been buying its button-downs for close to a decade. I feel well dressed in the shirts, which are well made and well tailored from a material that feels more expensive than it is. Even as someone who’s bustier, curvier, and shorter, I find that J.Crew just gets the fit right. Each season, there are new additions to its line of shirts — everything from embellished numbers to pin-striped options. Under the creative direction of Olympia Gayot, the brand’s signature button-downs are now called the Garçon and Étienne, which are fully stocked currently. The Garçon is slimmer and more fitted than the Étienne (something I noticed with the brand’s button-downs overall is they’re now made to fit slightly smaller, so keep that in mind while shopping and size up if you want a roomier fit). The Garçon, which is made of crisp cotton poplin, is also available in sizes 00 to 24 (plus petite and tall), one of the largest size ranges on this list. $75 at J.Crew Buy\n\nBest (splurgeworthy) fitted white button-down\n\nSaved View Want to be emailed when products you’ve saved are over 20% off? Success! You'll get an email when something you've saved goes on sale. Yes New! You can now save this product for later. Classic Six Donna Button-Down Shirt $195 $195 Sizes: 0–14 | Fabric: Cotton | Design details: Long cuffs, side slits, French seams, grosgrain detailing, and pearl buttons | Price: $$$ Classic Six’s Donna Shirt is fitted, too, with extra-long cuffs designed to hit past the wrist. Style coach Kim Hancher likes the playful touch. “It’s always fun to have an interesting detail on a basic, which a white shirt is,” she says. (The Donna also has convenient buttons on the cuffs that make it easy to double them up if you want them out of your way.) Though it’s a more tailored take than the more oversize options above, it’s designed with dropped shoulders and a “torso [long enough] that it stays tucked in.” Hancher explains that she usually has to size up to get that kind of length, but “then it’s big all over, which is sometimes a look I want, sometimes not.” According to Hancher, the proportions on this shirt are pretty much perfect, with a larger collar and nipped-in waist. “It’s just a white shirt, but it adds so much to every outfit that I wear it with,” Hancher says. Another splurge-worthy contender: styles from French label Anne Fontaine — the “master of the white shirt,” according to stylist Jessica Cadmus — which have a “trim and tailored” silhouette, with eye-catching details, like Shakespearean ruffles. $195 at Classic Six Buy\n\nBest relaxed-fit white button-down\n\nSaved View Want to be emailed when products you’ve saved are over 20% off? Success! You'll get an email when something you've saved goes on sale. Yes New! You can now save this product for later. Lululemon Relaxed-Fit Cotton-Blend Poplin Button-Down Shirt $98 $98 Sizes: XS–XL | Fabric: Cotton, nylon, elastane | Design: Single patch pocket, wide cuffs, and box pleat on back yoke | Price: $$ If you want a button-down that falls between fitted and oversize, you’ll want to look for one billed as “relaxed fit” (sometimes simply called “relaxed”). It’s the silhouette Gelber had in mind when she began her button-down hunt, which included trying on shirts at Alex Mill and J.Crew and placing orders at Gap and Land’s End. More than two dozen button-downs later, Gelber found a winner in Lululemon’s. Lululemon might not be the brand that comes to mind when you hear the word “button-down,” but its Relaxed-Fit Cotton-Blend Poplin Button-Down Shirt (the only one it currently sells for women) fits her strict standards. It looks just as good tucked or untucked and has a longer, bum-covering length, along with “big stiff cuffs as well as a structured collar and a back box pleat that makes it billow really beautifully,” she says. And because it’s from Lululemon, it’s lightweight, quick-drying, and sweat-wicking too. Editor’s note: This shirt is currently sold out in all sizes. You can sign up to receive an email if your size comes back in stock. $98 at Lululemon Buy\n\nBest oversize white button-down shirt\n\nSaved View Want to be emailed when products you’ve saved are over 20% off? Success! You'll get an email when something you've saved goes on sale. Yes New! You can now save this product for later. Maeve The Bennet Buttondown Shirt $98 $98 Sizes: XXS–3X | Fabric: Cotton | Design: Single patch pocket, high-low shirttail hem | Price: $$ Up until recently, most of Anthropologie’s button-downs were under the label Cloth & Stone. But when I interviewed Anthropologie employees last year, I learned that the Bennet Buttondown from Maeve, an in-house line, is what’s hanging in stores now. The latest iteration is a hit with customers and employees alike: “They got the proportions of it really right,” a display coordinator says. A manager told me that the button-down has an oversize silhouette and recommended sizing down if you want something more fitted. I’m especially impressed with the shirt’s size inclusiveness: It comes in sizes XXS through 3X (along with a petite length). Even better: There’s an adaptive version for those who have disabilities — with magnetic snap closures, a tab on the sleeve cuffs (rather than buttons), and a higher shirttail slits (for more coverage). I’d like to give Baserange’s “lavishly oversize” Ole Shirt an honorable mention in this category, too — Strategist writer Erin Schwartz says it’s “so crisp you could crack an egg on it.” $98 at Anthropologie Buy\n\nBest white linen button-down\n\nSaved View Want to be emailed when products you’ve saved are over 20% off? Success! You'll get an email when something you've saved goes on sale. Yes New! You can now save this product for later. Frank & Eileen Eileen Linen Button-Up Shirt $258 $258 Sizes: XXS–XL | Fabric: Linen | Design: Looser fit, bust-flattering button placement | Price: $$$ Frank & Eileen launched in 2009 with the mission to “reinvent the button-up for women” — since then, the company has earned a loyal following. The Eileen is its No. 1 best-selling shirt, cut from an Italian linen that’s then made into a shirt in Mexico. Stylist Grace Thomas likes that the button-down is a combination of relaxed and elevated — even when wrinkled, the shirt has an air of “I just threw this on” to it without looking sloppy. “It hangs well on my body, always looks crisp, and makes me feel put-together so simply,” says Thomas. She preaches about quality over quantity to clients, and says that Frank & Eileen’s shirts are really the only button-down you’ll need. (If you prefer something other than linen, the style is also available in denim, flannel, cotton, and voile, too.) My runner-up in this category is Aritzia’s Wilfred button-down, which is made with a blend of linen and viscose, will run you only $88, and is a favorite of Sips By founder Staci Brinkman, who likes that it doesn’t feel starchy or stiff in the slightest. $258 at Frank & Eileen Buy\n\nBest short-sleeved white button-down\n\nSaved View Want to be emailed when products you’ve saved are over 20% off? Success! You'll get an email when something you've saved goes on sale. Yes New! You can now save this product for later. Cubavera Linen Short-Sleeved Button-Down Guayabera Shirt $69 now 26% off From $51 Sizes: XS–5X (men’s) | Fabric: Linen | Design details: Camp collar, notched sleeves, pleating | Price: $$ I know this is a men’s button-down, but there’s nothing wrong with taking from menswear for your own closet. Guayaberas are famous in Caribbean fashion — my Dominican dad plans to wear them exclusively once he retires —and are known for their distinctive pleating on the front and back. This one has those traditional lines and makes an excellent short-sleeved button-down for hot summer days or as a beach shirt. Coming of Age founder Amanda Lurie owns a collection of guayaberas that are new and old, almost always layering them over her bathing suits. Lurie suggests going down at least a size in this version, especially as the linen shirts are designed to be flowing. Just be sure to double check Cubavera’s (very extensive) size chart to make sure you’re getting the right size. From $51 at Amazon Buy From $115 at Cubavera Buy\n\nBest white silk button-down\n\nSaved View Want to be emailed when products you’ve saved are over 20% off? Success! You'll get an email when something you've saved goes on sale. Yes New! You can now save this product for later. Equipment Slim Signature Silk Shirt From $182 Sizes: XXS–XXL | Fabric: Silk | Design details: Two chest pockets, point collar, button cuffs | Price: $$$ Equipment’s silk shirts have become somewhat iconic — and this one counts stylist Jasmine Caccamo, Birdy Grey, and author Jen Doll as fans. Caccamo had been “scouring every inch of the internet” to find the perfect white button-down, and her search led her to this slimmer-cut silk option that hangs especially nicely across the bodice. That’s a sentiment that Lee and Doll, who are both bigger-busted, share. “I live in slouchy silk button-downs by Equipment,” Lee says. It’s neither too tailored nor too fitted on her, and she buttons it low enough for a hint of clavicle (and bra). Doll explains that the “buttons don’t pull awkwardly across the chest,” calling them a godsend. “There are pockets on each breast, but unlike other brands I’ve worn (J.Crew, Uniqlo, Banana Republic), they don’t look bulky or do strange things to the cleavage.” Even though it’s on the pricier side, our panelists buy it in multiples. From $182 at Amazon Buy\n\nBest (less-expensive) silk white button-down\n\nget the strategist newsletter Actually good deals, smart shopping advice, and exclusive discounts. Email This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Vox Media, LLC Terms and Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.\n\nThe Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best women’s jeans, rolling luggage, pillows for side sleepers, ultraflattering pants, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.\n\nEvery editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.\n\n", "images": ["https://pyxis.nymag.com/v1/imgs/af6/02a/10821b425c8d57f3ecfbce811e4732d7f1-AmbarParadillaFINAL.2x.rsquare.w168.jpg", "https://pyxis.nymag.com/v1/imgs/e75/306/ecf2a9481319ba15448d3986687cd9afea-usbuttondown.rsquare.w600.png", "https://pyxis.nymag.com/v1/imgs/415/b21/7bc289d10400ec3a0f44c6c24d381555e9-lululemon.rdeep-vertical.w245.png", "https://pyxis.nymag.com/v1/imgs/9fb/37c/14eb787bcdaaf4314415b2833f77598947-linen-guayabera.rsquare.w600.jpg", "https://pyxis.nymag.com/v1/imgs/9f1/77a/cee15f5e18c30f64452f12114210e2f01e-equipment-silk.rsquare.w600.jpg", "https://pyxis.nymag.com/v1/imgs/1ba/f22/53898ff0841cbadee41970d369b02cf296-donna.rdeep-vertical.w245.png", "https://pyxis.nymag.com/v1/imgs/76e/984/518ba5bdde943a80e7c437dbcc93fbe365-ANINE-BING-MIKA-SHIRT-WHITE-A-09-2006-10.rsquare.w600.jpg", "https://assets.nymag.com/media/components/auth-modal/modal-image.jpg", "https://pyxis.nymag.com/v1/imgs/158/4ac/bf264c70e2a29ca711791f21184ff376ea-ayr-shirt.rsquare.w600.png", "https://pyxis.nymag.com/v1/imgs/22d/1ce/3dc869ba04f1086240971e291c39e3f96d-SharkLogo-1c-Black.png", "https://pyxis.nymag.com/v1/imgs/74f/543/6ce5d71b9b5427ca75a9d8b278e65469c7-garcon.rsquare.w600.png", "https://pyxis.nymag.com/v1/imgs/7b6/931/dec2447d3fa49d67d325a71808ba9a6811-jjill.rsquare.w600.png", "https://assets.nymag.com/media/components/newsletters-container/close.svg", "https://pyxis.nymag.com/v1/imgs/4d7/ec1/b232928ac30cfe5e3e492f5207103f9e96-oldnavy.rdeep-vertical.w245.png", "https://pyxis.nymag.com/v1/imgs/6e0/096/cbfba8acc19dcc4eaf37be5d354c557741-frank.rdeep-vertical.w245.png", "https://pyxis.nymag.com/v1/imgs/f21/cd7/1f348dca5094fbdba6762c9bad5afd9fbd-silk-.rdeep-vertical.w245.png", "https://pyxis.nymag.com/v1/imgs/962/e28/3c89cbba82c938b8ed92e9aa0f8863dff9-maeve.rdeep-vertical.w245.png", "https://pyxis.nymag.com/v1/imgs/257/e19/438808d21b00ca8a42fc398371ece14935-bic-womens-white-button-down.1x.rsocial.w1200.jpg", "https://pyxis.nymag.com/v1/imgs/8c3/687/de5e0fd4be3595b80568e339a8b7a784d5-cc-4b5-type-single.w240.gif", "https://pyxis.nymag.com/v1/imgs/257/e19/438808d21b00ca8a42fc398371ece14935-bic-womens-white-button-down.rsquare.w700.jpg", "https://pyxis.nymag.com/v1/imgs/74f/543/6ce5d71b9b5427ca75a9d8b278e65469c7-garcon.rdeep-vertical.w245.png", "https://pyxis.nymag.com/v1/imgs/9d0/4c9/0fa6a0b71bdb3503eeb7602578bbec93d7-womens-boxy-oxford-white.rdeep-vertical.w245.jpg", "https://pyxis.nymag.com/v1/imgs/9d0/4c9/0fa6a0b71bdb3503eeb7602578bbec93d7-womens-boxy-oxford-white.rsquare.w600.jpg"], "top_img": "https://pyxis.nymag.com/v1/imgs/257/e19/438808d21b00ca8a42fc398371ece14935-bic-womens-white-button-down.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Ambar Pardilla", "A Writer At The Strategist Covering Fashion", "Home Organization.", "She Joined The Strategist As A Writer In", "Before That Worked At Nbc"], "canonical_link": "https://nymag.com/strategist/article/best-white-button-down-shirt-women.html", "title": "The 11 Very Best White Button-down Shirts for Women", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "parsely-tags": "style, women’s fashion, best in class, women’s apparel, featuretype:q&a, featuretype:list or roundup", "og": {"title": "The 11 Very Best White Button-down Shirts for Women", "url": "https://nymag.com/strategist/article/best-white-button-down-shirt-women.html", "description": "From classic cotton to luxurious silk.", "image": "https://pyxis.nymag.com/v1/imgs/257/e19/438808d21b00ca8a42fc398371ece14935-bic-womens-white-button-down.1x.rsocial.w1200.jpg", "site_name": "The Strategist", "type": "article"}, "twitter": {"title": "The 11 Very Best White Button-down Shirts for Women", "description": "From classic cotton to luxurious silk.", "image": "https://pyxis.nymag.com/v1/imgs/257/e19/438808d21b00ca8a42fc398371ece14935-bic-womens-white-button-down.2x.rsocial.w600.jpg", "card": "summary_large_image", "creator": "@AmbarPardilla", "site": "@strategist"}, "article": {"published_time": "2025-09-19T15:30:00.000-04:00", "tag": "style, women's fashion, best in class, women's apparel", "publisher": "https://www.facebook.com/nymagstrategist"}, "description": "Ayr’s the Deep End shirt is the best classic white button-down for women, according to our fashion writer.", "robots": "max-image-preview:large", "sailthru.tags": "style, women's fashion, best in class, women's apparel", "author": "Ambar Pardilla", "type": "Article", "vertical": "The Strategist", "sectionOverride": "The Strategist", "apple-mobile-web-app-title": "The Strategist", "application-name": "The Strategist", "msapplication-TileColor": "#111", "msapplication-TileImage": "https://assets.nymag.com/media/sites/strategist/icon.144x144.png"}, "movies": [], "publish_date": 1758310200.0, "source": "http://nymag.com", "summary": ""}