{"url": "https://en.wikipedia.org/wiki/Henry_Hall_(bandleader)", "text": "English bandleader (1898–1989)\n\nMusical artist\n\nHenry Robert Hall, CBE (2 May 1898 – 28 October 1989)[1] was an English bandleader who performed regularly on BBC Radio during the British dance band era of the 1920s and 1930s, through to the 1960s.[2]\n\nEarly life and career [ edit ]\n\nHenry Hall was born in Peckham, South London, England.[1] He won a scholarship to Trinity College of Music where he studied trumpet, piano, harmony and counterpoint.[1]\n\nHis first job was as a copyist at the head office of the Salvation Army for which he wrote several marches.[1] During World War I, Hall served with the Royal Field Artillery,[1] and played trumpet and piano in the regimental band.\n\nHall's musical career was slow to start but eventually he was engaged by the London Midland and Scottish Railway to take charge of music throughout their then large chain of hotels, including Gleneagles Hotel, where he had previously led the band.[2]\n\nHall describes in his autobiography, Here's to the Next Time, that in October 1923 he met a young woman, Margery Harker, while travelling by rail to Dartmoor. Hall mentions that he and Margery were about the same age and had much in common, after discussing the C. B. Cochran production of the musical Little Nellie Kelly and Paul Whiteman's take on \"Till My Luck comes Rolling Along\", a number from the show. The following day, Henry invited Margery to a dance and proposed to her at the end of the evening. Two days after meeting, the two were engaged and were married in January 1924, at St. George's, Hanover Square, London.[3][4] Henry and Margery had two children during their marriage, Mike and Betty.\n\nIn June 1924, on the opening night of the Gleneagles Hotel, Hall persuaded the BBC to broadcast the event on radio,[1] which began his long association with BBC radio.[2]\n\nThe 1930s: broadcasting star [ edit ]\n\nIt was from Gleneagles that the BBC took him in 1932 to succeed Jack Payne as band leader of the BBC Dance Orchestra.[5] At 5.15pm each weekday, Hall's radio programme from Broadcasting House gathered a huge following across the nation.[6] His signature tune was \"It's Just the Time for Dancing\", and he usually concluded with his own composition \"Here's to the Next Time\".[1][7]\n\nIn 1932 he recorded the songs \"Hush, Hush, Hush, Here Comes the Bogeyman\" and \"Teddy Bears' Picnic\" with his BBC Orchestra, featuring singer Val Rosing on vocals.[7] The latter song gained enormous popularity and sold over a million copies. In 1934 his popularity was confirmed when his orchestra topped the bill at the London Palladium.[2]\n\nHe featured in the documentary BBC The Voice of Britain (1935), the source of the \"This is Henry Hall speaking\" clip much used in documentaries on this period.\n\nIn 1936, Henry Hall made his first feature film and in the same year he was guest conductor of the ship's orchestra on the Queen Mary's maiden voyage, where he wrote the song \"Somewhere at Sea\".[1][8]\n\nIn 1937, the BBC Dance Orchestra played at the opening of the Gaumont State Cinema in Kilburn, London.[1] Hall's last broadcast with the B.B.C. Dance Orchestra was on 25 September 1937, the band embarking on a variety tour before disbanding in 1939.[7][1] He generated controversy by dropping songs by Jewish composers while playing in Berlin in February 1938.[9]\n\nLater years [ edit ]\n\nDuring the Second World War, Hall played for the troops, and gave concerts and shows in factories all over Britain. Many of these concerts came in the form of \"Guest Night\" broadcasts. From June to November, 1943, \"Guest Night\" was replaced by \"Henry Hall's Rhythm Entertainment\" intended to provide radio entertainment for troops overseas.\n\nAfter the war he developed his show business interests, becoming something of an agent and producer.[1] His BBC work again blossomed as he hosted Henry Hall's Guest Night on the radio and later on television. Hall was also involved in the launch of the television programme Face the Music.[1]\n\nHall had a son, Michael, and daughter, Betty. The former served in the Royal Navy, and later became one of the resident chairmen at the Players' Theatre in London, founded by actor Leonard Sachs.\n\nIn 1955, Hall published his autobiography Here's to the Next Time. He dedicated it to his wife, Margery.\n\nHe ceased regular broadcasting in 1964 and was appointed a Commander of the Order of the British Empire, CBE, in 1970.[1] He died in Eastbourne, Sussex, on October 28, 1989.[1]\n\nA green memorial plaque on the site of his former home at 8 Randolph Mews, Little Venice, was unveiled on 2 May 1996.[10] A blue plaque commemorates Hall at 38 Harman Drive in Cricklewood, London, where he lived between 1932 and 1959.[11]\n\nPopular culture [ edit ]\n\nHall unknowingly lent his name to a work shift at Frickley Colliery in South Yorkshire. Miners at the colliery who worked the unpopular night shift referred to the shift as Henry Hall's shift or simply Henry's, as the shift began at 6pm, the same time as Hall started his show on the radio. When he died, the local football club Frickley Athletic, who had close ties with the colliery, marked the occasion in their matchday programme with a page, dedicated to Hall, entitled \"No More Henry's\".[citation needed]\n\nThe song \"Home\" by Henry Hall and His Gleneagles Hotel Band is used in the 1980 Stanley Kubrick film The Shining as well as in its sequel from 2019, Doctor Sleep, directed by Mike Flanagan.The song was remastered by Keith Gooden and Geoff Milne in room 517 at Decca in London and is available on the release, ” And The Bands Played On” ( Cat: DDV5001/2)", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/60px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Wills_card_of_Henry_Hall.JPG/960px-Wills_card_of_Henry_Hall.JPG", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Wills_card_of_Henry_Hall.JPG/250px-Wills_card_of_Henry_Hall.JPG", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Wills_card_of_Henry_Hall.JPG/960px-Wills_card_of_Henry_Hall.JPG", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Henry_Hall_(bandleader)", "title": "Henry Hall (bandleader)", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Wills_card_of_Henry_Hall.JPG/960px-Wills_card_of_Henry_Hall.JPG", "width": 900, "height": 1200}, "title": "Henry Hall (bandleader) - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}