{"url": "http://www.politifact.com/truth-o-meter/statements/2015/jul/10/generation-forward-pac/did-bernie-sanders-vote-against-background-checks-/", "text": "As hype around Democratic presidential candidate Bernie Sanders grows, political opponents and media reporters are once again suggesting the socialist Vermont senator is a gun nut.\n\n\"One issue your Democratic rivals are starting to hit you with is the fact that you have, in the past, sided with the NRA on some gun issues,\" CNN’s Jake Tapper said in a July 5 interview with Sanders, alluding to an attack ad paid for by a pro-Martin O’Malley group.\n\n\"Bernie Sanders voted against the Brady Bill -- background checks and waiting periods,\" said the attack, which first aired June 25. \"Bernie Sanders is no progressive when it comes to guns.\"\n\nSanders’ record on guns has been the subject of liberal ire (\"Bernie Sanders, gun nut\") as well as conservative glee (\"Sorry liberals, Bernie Sanders is a gun nut\"). So we wanted to take a look at his vote on the Brady Handgun Violence Prevention Act, a landmark piece of gun control legislation.\n\nThe Brady Act mandated that everyone who wanted to buy a handgun had to wait five days while local law enforcement ran criminal background checks. (After 1998, the firearm dealers became responsible for conducting the checks.)\n\nBut before Brady became law, it underwent many transformations. Sanders, elected to the House of Representatives in 1990, voted on it numerous times, virtually almost always in opposition:\n\n• In May 1991, Sanders voted against a version that mandated a seven-day waiting period for background checks, but the bill passed in the House.\n\n• The Senate decreased the waiting period to five days and the bill returned to the House. In Nov. 1991, Sanders voted against that version. Though it passed in the House, the Senate didn’t muster enough votes. The Brady bill and its gun control stance remained in limbo during 1992.\n\n• After some back and forth, a version of the bill resurfaced that reinstated the five day waiting period. In November 1993, Sanders voted against that version but for an amendment imposing an instant background check instead (seen by some as pointless, as the technology for instant checks didn’t exist at the time).\n\n• He also voted against an amendment that would have ended state waiting periods, and for an amendment giving those denied a gun the right to know why.\n\n• The final compromise version of the Brady bill -- an interim five-day waiting period while installing an instant background check system -- was passed and signed into law on Nov. 30, 1993. Sanders voted against it.\n\nAccording to Sanders' campaign manager Jeff Weaver, Sanders’ reason for opposing the Brady bill was two-fold. First, he believed implementing a national waiting period was federal overreach. And second, he was doing his job.\n\n\"He wasn't opposed to states having (waiting periods) if they wanted to. The Republicans wanted to repeal waiting periods in states that had them, and Bernie voted that down,\" Weaver said. \"He said he would be against waiting periods, and he kept his word to the people of Vermont.\"\n\nIn April 1991, Sanders’ then-chief of staff Anthony Pollina echoed the idea that Sanders was simply representing the will of his constituents.\n\n\"Bernie’s response is that he doesn’t just represent liberals and progressives. He was sent to Washington to present all of Vermont,\" Pollina said. \"It’s not inappropriate for a congressman to support a majority position, particularly on something Vermonters have been very clear about.\"\n\nThe Green Mountain State, though left-leaning, has a high gun ownership rate and lax gun control laws (as well as a low homicide rate). That and Sanders’ own personal views are reflected in his overall voting record, experts told us.\n\n\"As a rural state with a large number of hunters and other gun owners, Vermont has been less liberal on guns than on most other issues, historically,\" explained Bertram Johnson, a professor of political science at Middlebury College in Vermont. \"He seems to support more regulation of guns than the U.S. presently has, but he recognizes his constituents’ preferences so does not make gun control a priority.\"\n\n\"I think he has disappointed many progressives in Vermont with his gun positions, which sort of walk a middle line – and angering both sides through the years,\" said Chris Graff, the former Vermont Associated Press bureau chief. \"Gun control is a tough issue in Vermont for all politicians.\"\n\nFormer Vermont Gov. Howard Dean, whose 2004 presidential bid is often compared to Sanders’ 2016 run, received high marks from the National Rifle Association. Vermont Democratic Sen. Patrick Leahy also voted against the Brady bill. For his part, Sanders has voted to tighten gun control about half the time, and to protect Second Amendment rights the other half.\n\nHere are his votes on key gun bills in his 25 years in Congress (bold reflects a pro-gun control position):\n\nYear\n\nLegislation\n\nSanders’ Vote\n\nResult\n\n1993\n\nImposes a five-day waiting period and background checks on firearm purchases, part of the Brady Bill\n\nNay\n\nPassed\n\n1993\n\nImposes instant background checks instead for firearm purchases, part of an amendment to Brady Bill\n\nYea\n\nPassed\n\n1993\n\nImposes an interim five-day waiting period while while waiting to put a instant background check system in place, part of Brady Bill conference report\n\nNay\n\nPassed\n\n1994\n\nBans semi-automatic assault weapons\n\nYea\n\nPassed\n\n1996\n\nRepeals the semi-automatic weapons ban\n\nNay\n\nPassed\n\n1998\n\nIncreases minimum sentencing for gun crimes\n\nYea\n\nPassed\n\n1999\n\nCreates \"instant check registrants\" and narrowly defines \"gun shows,\" part of the Mandatory Gun Show Background Check Act\n\nNay\n\nFailed\n\n1999\n\nImposes three day waiting period for guns purchased at gun shows, part of an amendment to the Gun Show Act\n\nYea\n\nFailed\n\n2002\n\nAllows pilots and flight personnel to carry firearms in the cockpit\n\nYea\n\nPassed\n\n2003\n\nProhibits lawsuits against firearm makers for unlawful misuse of a firearm\n\nYea\n\nPassed\n\n2005\n\nProhibits lawsuits against firearm makers for unlawful misuse of a firearm\n\nYea\n\nPassed\n\n2006\n\nProhibits funds from being used to enforce trigger locks on guns\n\nNay\n\nPassed\n\n2006\n\nIncreases the burden of proof for the AFT to penalize law-breaking gun dealers, as part of the Bureau of Alcohol, Tobacco, and Firearms reform bill\n\nYea\n\nPassed\n\n2007\n\nProhibits foreign aid funding restrictions on U.S. gun ownership, as an amendment to the Consolidated Appropriations Act 2008\n\nYea\n\nPassed\n\n2008\n\nPrevents the use of funds for anti-gun programs as an amendment to the Indian Health Care Improvement Act\n\nYea\n\nPassed\n\n2009\n\nGives the District of Columbia seats in the House of Representatives and repeals the district’s ban on semi-automatic weapons\n\nYea\n\nPassed\n\n2009\n\nAllows the use of firearms in National Parks\n\nYea\n\nPassed\n\n2009\n\nAllows concealed and carry across state lines\n\nNay\n\nFailed\n\n2009\n\nAllows firearms in checked baggage on Amtrak trains, as an amendment to the congressional budget\n\nYea\n\nPassed\n\n2009\n\nProhibits higher insurance premiums for gun owners, as part of an amendment to the Affordable Care Act\n\nYea\n\nPassed\n\n2013\n\nPrevents the U.S. from entering the United Nations Arms Trade Treaty, as an amendment to the congressional budget\n\nNay\n\nPassed\n\n2013\n\nAllows concealed and carry across state lines in states where the practice is not prohibited\n\nNay\n\nFailed\n\n2013\n\nLists all people prohibited buying a firearm in the National Instant Criminal Background Check System\n\nYea\n\nFailed\n\n2013\n\nBans high-capacity ammunition magazines carrying more than 10 rounds\n\nYea\n\nFailed\n\n2013\n\nBans assault weapons and high-capacity ammunition magazines\n\nYea\n\nFailed\n\nSanders’ moderate stance is noted by firearm enthusiasts and gun control advocates alike. Former NRA research coordinator Paul Blackman says the group doesn’t consider Sanders \"an anti-gunner,\" and he’s received mixed marks from NRA ranging from a C- to F. Brady Campaign president Dan Gross says Sanders has shown suppleness and evolution since those first Brady votes and added he isn’t a \"gun lobby lapdog.\"\n\nExperts agreed that on guns, Sanders’ views are to the right of his Democratic rivals.\n\n\"When it comes to guns, he’s not Ted Cruz, but he believes federal policy should be less intrusive than Martin O’Malley or Hillary Clinton,\" said Eric Davis, who studies Vermont politics at Middlebury College. \"Guns are not an important issue for him, because they don’t fit into the class-based framework that Bernie looks at politics through.\"\n\nOur ruling\n\nAn attack ad said, \"Bernie Sanders voted against the Brady Bill -- background checks and waiting periods.\"\n\nThe Brady bill imposed a five-day waiting period for would-be purchasers of handguns. Between 1991 and 1993, Sanders voted against it five times. He did, however, vote for a version of the bill that imposed instant background checks, and against an amendment that repealed state background checks.\n\nExperts noted Sanders’ votes were representative of Vermont’s gun owners and gun laws. Since the 1990s, his record on gun control is mixed.\n\nWe rate the ad’s claim Mostly True.", "images": ["https://static.politifact.com/img/meter-mostly-true.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/Logo400/984b95095446cbb31180be0a1022c6be.jpg", "https://static.politifact.com/img/meter-mostly-true-th.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/nancy_mace_headshot/d10eb8381344dbcf420c2a0e6a9be5ab.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/politifact-mugs-mug-independentgroup____________________/df4eaf56ef02f0fe8dcb1410d3a2d2a7.jpg", "https://static.politifact.com/img/meter-half-true.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/James_Uthmeier_profile_photo/dd67f8bc48e9576fe0177365647e61df.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/logo-black/72988380e8c8bd188dc360d11552e4a0.jpg", "https://static.politifact.com/img/meter-barely-true.jpg", "http://www.facebook.com/tr?id=292850974235854&ev=PageView&noscript=1", "https://static.politifact.com/img/meter-barely-true-th.jpg", "https://static.politifact.com/img/meter-false-th.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/Logo400/242858f2f6c48e55bfa228afecc9f181.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/danielle_nierenberg/10c2201ddbc969cd7e2d03672055e564.JPG", "https://static.politifact.com/CACHE/images/politifact/mugs/AP_19107081282049_1/c342ac02b882eea8aca7034097714f94.jpg", "https://static.politifact.com/img/meter-false.jpg", "https://static.politifact.com/img/meter-pants-fire.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/James_Uthmeier_profile_photo/548c8acc1ae6320c56ea08ebc9305390.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/AndersonClayton/e1e1f12b0930640fd49abd3c4decccae.jpg", "https://static.politifact.com/img/logo-footer.png", "https://static.politifact.com/CACHE/images/politifact/mugs/jerry-brown_3/d957b67a6cfb99961ae39c6523da7812.jpg", "https://static.politifact.com/img/meter-half-true-th.jpg", "https://static.politifact.com/CACHE/images/mugs/Schumer/1464c619916506d504c72ba5b28aa4bd.JPG", "https://static.politifact.com/CACHE/images/politifact/mugs/nancy_mace_headshot/d314d653d1e5a0b5c241ab47c5f68b49.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/logo/287a9611b2eb68e94b29620ac6c536a8.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/danielle_nierenberg/7193e26c0376bf6256ba46b21ef5d799.JPG", "https://static.politifact.com/politifact/rulings/meter-mostly-true.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/logo-black/4590875651af69b2c789ceab409664dd.jpg", "https://static.politifact.com/CACHE/images/politifact/rulings/meter-mostly-true/4ac7c61540eff5211f6a04d98a6bc93a.jpg.", "https://static.politifact.com/CACHE/images/politifact/staffers/Linda_Qiu/b253e02ea061958f3d284149dc4b0139.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/SPICER/bb785637a1d5bf77cb4302efc71de3e0.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/SPICER/8f3a0ef1ab578fb22725c82217bdfcde.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/download_11/129886c04abe08501b6b6586038fac7a.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/Screen_Shot_2017-01-22_at_2.40.42_PM/d2f61c5201a79fe284d28f7a1a729e27.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/download_11/0367e36ef90ba2d6653597d8486e415c.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/Screen_Shot_2017-01-22_at_2.40.42_PM/1da2a42f0ece349c94275880038390fe.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/socialmedia3/e9244e144527030de445b61561ad0de1.jpeg", "https://static.politifact.com/img/meter-pants-fire-th.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/jerry-brown_3/6e29f64b18a0e689f0b6901d76f846bb.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/politifact-mugs-mug-independentgroup____________________/41dfed38296fe3f48d11ff286b0da1cc.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/AP_19107081282049_1/cf6da0f8f51a2a29ea76f74e726c093c.jpg", "https://static.politifact.com/CACHE/images/mugs/Schumer/ce6b1b7af867e1d073b1fcc0e3203597.JPG", "https://static.politifact.com/CACHE/images/politifact/mugs/socialmedia3/dd55caa1d27710286c5817da62931314.jpeg", "https://static.politifact.com/CACHE/images/politifact/mugs/logo/d171e2434e24274fead565f26d27d02d.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/new_djt_mugshot/80bd15ec0d50cf908299031c9790109e.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/new_djt_mugshot/c1c32c5a2e0a94447f75d2e6dfe5573d.jpg", "https://static.politifact.com/CACHE/images/politifact/mugs/AndersonClayton/4b7eaf8fdb4b2f24e643d3356107b278.jpg"], "top_img": "https://static.politifact.com/politifact/rulings/meter-mostly-true.jpg", "keywords": [], "authors": ["Linda Qiu", "July"], "canonical_link": "https://www.politifact.com/factchecks/2015/jul/10/generation-forward-pac/did-bernie-sanders-vote-against-background-checks-/", "title": "Did Bernie Sanders vote against background checks and waiting periods for gun purchases?", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "As hype around Democratic presidential candidate Bernie Sanders grows, political opponents and media reporters are once", "robots": "all", "publisher": "PolitiFact", "keywords": "National,Voting Record,Guns", "author": "Linda Qiu", "og": {"url": "https://www.politifact.com/factchecks/2015/jul/10/generation-forward-pac/did-bernie-sanders-vote-against-background-checks-/", "image": {"identifier": "https://static.politifact.com/politifact/rulings/meter-mostly-true.jpg", "secure_url": "https://static.politifact.com/politifact/rulings/meter-mostly-true.jpg", "width": 600, "height": 600}, "title": "Did Bernie Sanders vote against background checks and waiting periods for gun purchases?", "type": "website", "site_name": "@politifact", "description": "As hype around Democratic presidential candidate Bernie Sanders grows, political opponents and media reporters are once"}, "fb": {"pages": 61308923432, "admins": 750116788}, "twitter": {"username": "PolitiFact", "card": "summary", "site": "PolitiFact", "url": "https://www.politifact.com/factchecks/2015/jul/10/generation-forward-pac/did-bernie-sanders-vote-against-background-checks-/", "title": "Did Bernie Sanders vote against background checks and waiting periods for gun purchases?", "description": "As hype around Democratic presidential candidate Bernie Sanders grows, political opponents and media reporters are once", "image": "https://static.politifact.com/politifact/rulings/meter-mostly-true.jpg"}, "facebook-domain-verification": "vrxxsw8mwnf2pxgnwxvgsn4g93w3vm"}, "movies": [], "publish_date": 1436500800.0, "source": "http://www.politifact.com", "summary": ""}