{"url": "www.celebritynetworth.com/richest-celebrities/actors/roseanne-barr-net-worth/", "text": "What is Roseanne Barr's net worth and salary?\n\nRoseanne Barr is an American comedian, actress, writer, television producer, and director who has a net worth of $70 million. Roseanne Barr rose to fame as a stand-up comedian in the 1980s, known for her brash, working-class persona. Her breakthrough came with the sitcom \"Roseanne\" (1988-1997, 2018), which she created and starred in. The show was groundbreaking for its realistic portrayal of a blue-collar American family and became one of the most-watched television series of its time.\n\nBarr won an Emmy and a Golden Globe for her performance on \"Roseanne.\" She also hosted her own talk show, \"The Roseanne Show\" (1998-2000), and judged on \"Last Comic Standing.\" Throughout her career, she appeared in various films and television shows, often playing versions of her outspoken, no-nonsense character.\n\nIn 2018, \"Roseanne\" was revived to high ratings but was quickly canceled due to a controversial tweet by Barr. The show was then retooled as \"The Conners\" without her involvement.\n\nSalary & Lost $100 Million\n\nIn the final season of the original \"Roseanne\" series, Roseanne Barr earned $21 million. At the time, that made her the highest-paid television actor in the world. For her brief work on the 2018 rebooted series, Roseanne was set to make $250,000 per episode. By not earning her $250,000 per-episode salary, Roseanne lost $3.25 million just on that one season. More importantly, in the wake of the controversy, Roseanne agreed to give up her share of ownership equity points in the reboot. This concession likely cost Roseanne at least $100 million.\n\nEarly Life\n\nRoseanne Cherrie Barr was born to a Jewish family in Salt Lake City, Utah, in November 1952. She is the oldest of four children of Helen, a bookkeeper and cashier, and Jerome, a salesman. Her maternal grandmother was devoutly Orthodox Jewish. They got involved in The Church of Jesus Christ of Latter-day Saints to fit in and hide their faith from their neighbors. When Barr was six, she began giving talks at LDS churches in Utah. She was elected president of her Mormon youth group.\n\nWhen she was 16, Barr suffered a traumatic brain injury in a car accident. Due to the drastic change in her behavior as a result of the TBI, she was institutionalized for eight months. She had a baby when she was in the institution. She put the baby girl, Brandi Ann Brown, up for adoption. At 18, in 1970, she told her parents she was going to visit a friend in nearby Colorado for two weeks. She never returned home again.\n\nCareer\n\nShe started her career doing stand-up comedy. She appeared on \"The Tonight Show\" in 1985. The following year, she did her stand-up routine for one of comedian Rodney Dangerfield's specials. That same year, she appeared on \"Late Night with David Letterman.\" In 1987, Barr was given her own special called \"The Roseanne Barr Show,\" which aired on HBO and earned her an American Comedy Award. The success of her stand-up act led to her own series on ABC, which originally aired from 1988 to 1997 and was revived in 2018. For her work on the show, Roseanne won a Golden Globe Award and an Emmy for Best Actress.\n\nFrom 1998 to 2000, she hosted the talk show \"The Roseanne Show,\" and in 2011, she hosted a show called \"Roseanne's Nuts.\" She has also appeared in a number of feature films over the years. She starred in the 2016 documentary film \"Roseanne For President!\"\n\nIn April 2017, news broke that Barr and most of the original cast of \"Roseanne\" were reuniting for an eight-episode revival of the show. ABC ended up picking up the revival, which premiered in late March 2018 to high ratings. Three days later, ABC renewed Roseanne for another season. In late May, the series was canceled by the network in the aftermath of a racist tweet from Barr.\n\nPersonal Life\n\nBarr married Bill Pentland, a motel clerk she met while in Colorado, in February 1974. They had three children: Jessica, Jennifer, and Jake. Pentland and Barr divorced in early 1990.\n\nFour days later, on January 20, 1990, Barr married Tom Arnold. She was known as Roseanne Arnold during the marriage. Barr met Arnold in 1983 in Minneapolis, where he opened for her stand-up comedy act. Barr filed for divorce from Tom Arnold on April 18, 1994.\n\nBarr is also remembered for singing a widely panned version of \"The Star-Spangled Banner\" before a baseball game between the San Diego Padres and Cincinnati Reds in San Diego in 1990. She sang off-key while spitting and grabbing her crotch, apparently mimicking the actions of baseball players. Barr later said that the Padres had suggested she \"bring humor to the song,\" but many criticized the episode, including President George H. W. Bush, who called her rendition \"disgraceful.\"\n\nIn 1992, Barr received a star on the Hollywood Walk of Fame.\n\nIn November 1994, she became pregnant through in-vitro fertilization and had a son named Buck with Ben Thomas, who at one time was her personal security guard. On Valentine's Day, 1995, Barr and Thomas got married. The couple divorced in 2002.\n\nBarr elicited criticism in July 2009 when she posed as Adolf Hitler in a feature for the satirical Jewish publication Heeb magazine called \"That Oven Feelin.\"\n\nBarr ran for president in 2012 as part of the Green Party. Although she did not win the nomination, she went on to be nominated by the Peace and Freedom Party and came in 6th in the popular vote for President.\n\nIn 2020, Roseanne took to Twitter to post a video in which she said: \"You know what I think — discuss amongst yourselves if you don't agree — you don't really have to burn me at the stake for not agreeing with me — but let me just throw out one idea. And I hope that the hungry dogs in the street have enough meat as to not come after me for thinking and speaking. I'm tired of it. I'm tired of being monitored and corrected and s–t, ya know, f–k it. I'll say what I'm gonna say. Trump — hear me when I say this — Trump is, in my opinion, the first woman president of the United States.\" The video then abruptly ended with no explanation. It was later deleted, but not before plenty of people screengrabbed the latest bizarre rant from Barr.\n\nReal Estate\n\nWhen Barr and Arnold were married, they began construction on a 28,000-square-foot mansion in southeast Iowa in 1993. After their divorce in 1994, construction was halted, and the half-finished mansion sat crumbling for decades. In 2018, when Roseanne, the sitcom, was rebooted, it was revealed that Barr and Arnold donated the 1,338-acre property to the Indian Hills Community College Foundation, which sold it to MJW Hawkeye LLC. A spokesman for the owner said that the mansion was too expensive to tear down.\n\nIn 2000, she paid $6.5 million for a 10,000-square-foot home in Rolling Hills, California. She sold this home in October of 2003 for $8.2 million.\n\nIn 2003, Roseanne paid $1.17 million for a home in El Segundo, California. She put this home on the market in September 2020 for $3.5 million. In 2005, she bought the house right across the street. Also in 2005, she paid $1.5 million for a home in nearby Playa Del Rey. And two years later, she bought another Playa Del Rey home for around $2 million.\n\nIn 2007, Barr purchased a 2,212-square-foot ranch-style house and 46-acre property sight unseen on the Big Island, Hawaii, for $1.78 million. The property, known as Hidden Hamakua Farm, is in Honokaa/Hamakua. She moved there from Los Angeles full-time in 2010. Barr's property has 2,000 macadamia nut trees, an organic garden, and a beehive. Rosanne sold this farm in October 2025 for $2.6 million.", "images": ["https://vz.cnwimg.com/thm/I4dSiTJhq0kprSuO--deoPCEAmQ=/132x132/center/top/filters:format(webp)/2020/06/taylor.png", "https://vz.cnwimg.com/thm/THT2ufzAkwB_xb_QESsCvKgKejE=/132x132/center/top/filters:format(webp)/2021/05/tom-arnold.jpg", "https://vz.cnwimg.com/thm/KNDSqD-9inbRekV6AGgXDEG2Scw=/375x35:810x586/132x132/filters:format(webp):strip_exif()/2015/09/GettyImages-476575299.jpg", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "https://vz.cnwimg.com/thm/0dOqT2nlNQM7u_J-5xWrCsf2nAw=/132x132/center/top/filters:format(webp)/2020/02/Angelina-Jolie.png", "https://vz.cnwimg.com/thm/BmP9r4GGPIwv8DiEhTkjDGXUoMM=/132x132/center/top/filters:format(webp)/2020/06/john-goodman.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/thm/_hOmdPz8Ht24ZxIeZM7m4mGRouk=/132x132/center/top/filters:format(webp)/2019/11/GettyImages-1094653148.jpg", "https://vz.cnwimg.com/wp-content/uploads/2020/02/roseanne.jpg?x46379", "https://vz.cnwimg.com/thm/Y14fttV9jls9mxFLuNAHJTnNWTE=/132x132/center/top/filters:format(webp)/2019/10/denzel-washington-1.jpg", "https://vz.cnwimg.com/thm/54aOzPly0wL1uWCyz2gCLZzQeVk=/132x132/center/top/filters:format(webp)/2020/04/George-Lopez.jpg", "https://vz.cnwimg.com/thm/yboGsO77E1kQwELLmrwRZv_4RmE=/132x132/center/top/filters:format(webp)/2017/02/GettyImages-528215436.jpg", "https://vz.cnwimg.com/thm/lt1abKKVHSBtY-US0k9GLU9MTmM=/132x132/center/top/filters:format(webp)/2009/09/Brad-Pitt.jpg", "https://vz.cnwimg.com/thm/IoWqGPmFDjvC6iTqcDsspXBuxqo=/132x132/center/top/filters:format(webp)/2018/03/GettyImages-821622848.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/thm/dXuAPIEBU--L_kRib4u0nSzjUtE=/132x132/center/top/filters:format(webp)/2020/04/Megan-Fox.jpg", "https://vz.cnwimg.com/thm/eCD0UBdhw6X2HQ-ckcEPuQgWTAo=/600x300/center/top/filters:format(webp)/2020/02/roseanne.jpg", "https://vz.cnwimg.com/thm/z7sMiMCXyxJ18aPkyQ5qXpzC_WY=/132x132/center/top/filters:format(webp)/2021/04/Sara-Gilbert.jpg", "https://vz.cnwimg.com/thm/lY3-oCS-xIdiqDaOi1qHd6UaTjg=/132x132/center/top/filters:format(webp)/2009/09/Cristiano-Ronaldo.jpg", "https://vz.cnwimg.com/thm/UxnQSql1h0QyX1CgkPqKhTxCTHM=/132x132/center/top/filters:format(webp)/2009/09/Jennifer-Aniston.jpg", "https://vz.cnwimg.com/thm/95i5RI1LWkjHyyoolMeto-z_WeU=/132x132/center/top/filters:format(webp)/2020/01/lopez3.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2020/02/roseanne.jpg?x46379", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/roseanne-barr-net-worth/", "title": "Roseanne Barr Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Roseanne Barr is an American comedian, actress, writer, television producer, and director who has a net worth of $70 million. Roseanne Barr rose to fame as a stand-up comedian in the 1980s", "slick": {"wpversion": "3.0.1", "wppostid": 5126, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2020/02/roseanne.jpg?x46379", "group": "post", "category": "actors:Actors"}, ";": "richest-celebrities:Richest Celebrities", "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "cnw": {"wppostid": 5126}, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Roseanne Barr Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/roseanne-barr-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2020/02/roseanne.jpg?x46379", "site_name": "Celebrity Net Worth", "description": "What is Roseanne Barr's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2025-10-07T00:13:31+00:00", "published_time": "2020-02-23T07:42:54+00:00", "section": "Actors", "tag": "roseanne barr salary"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2020/02/roseanne.jpg?x46379", "title": "Roseanne Barr Net Worth", "description": "Roseanne Barr is an American comedian, actress, writer, television producer, and director who has a net worth of $70 million. Roseanne Barr rose to fame as a stand-up comedian in the 1980s"}}, "movies": [], "publish_date": 1582443774.0, "source": "http://www.celebritynetworth.com", "summary": ""}