{"url": "hiplatina.com/jennifer-lope-alex-rodriguez-together-penthouse/", "text": "We know it’s serious when a couple moves in together. Jennifer Lopez and Alex Rodriguez, however, isn’t your average couple moving in together, so when they do — they do it big. The couple — who’ve been hot and heavy for a year now, are taking their relationship to the next level by purchasing a penthouse together.\n\nWhile the couple have been basically living together at Jennifer’s house in Los Angeles, they have now gone in on something as a real committed unit. It’s being reported that J.Lo and A.Rod have been thinking of moving in together for a few months now. Jennifer put up her previous penthouse ( $27 million!) on the market in October. So what’s up with the new place? Here are some deets:\n\nThe penthouse is located at 432 Park Avenue — also known as the tallest residential building in Manhattan. It cost the couple a whopping $15.32 million (why does it sound like a step down from her previous place?). The penthouse is stacked with three bedrooms, four and half bathrooms, and a library, Curbed reports.\n\nStay connected! Subscribe now and get the latest on culture, empowerment, and more. SIGN ME UP! Este sitio está protegido por reCAPTCHA y Google Política de privacidad y Se aplican las Condiciones de servicio. Thank You! You are already subscribed to our newsletter\n\nHere’s some more details, according to Variety: “A private elevator landing and a 21-plus-foot entrance gallery lead to a nearly 30-foot square combination living and dining room with 12.5-foot ceilings, solid oak floorboards laid at a herringbone pattern and four, ten-foot square single pane windows with staggering open views to the north and east across the city and the entirety of Central Park.”\n\nHere are some of the cons that have been reported about this building. Some drawbacks to living in the tallest residential building: “I’ve been up in that building, and it sways quite a bit. You can feel it,” New York real estate agent Dolly Lenz tells realtor.com. Some have also said it looks like a trashcan because that was the “inspiration” behind its design. Other reports say, because mostly business-types own places there, that no one is ever in the building.\n\nWell, who gives a damn!? Check out this amazing pictures of the place.\n\nhttps://www.instagram.com/p/BgvtofSguh8/?hl=en&taken-at=227112967\n\nhttps://www.instagram.com/p/Bg4nAe2BO3B/?hl=en&tagged=432parkavenue", "images": ["https://hiplatina.com/wp-content/themes/contenthub/admin/images/users/default_avatar.png", "https://hiplatina.com/wp-content/uploads/sites/6/2018/03/john-cameron-fGiJtgi2RRg-unsplash.jpg?fit=720,540&crop=0px,68px,720px,404px", "https://hiplatina.com/wp-content/uploads/sites/6/2018/03/john-cameron-fGiJtgi2RRg-unsplash.jpg?w=1200"], "top_img": "https://hiplatina.com/wp-content/uploads/sites/6/2018/03/john-cameron-fGiJtgi2RRg-unsplash.jpg?w=1200", "keywords": [], "authors": [], "canonical_link": "https://hiplatina.com/jennifer-lope-alex-rodriguez-together-penthouse/", "title": "J.Lo and A.Rod Just Bought Their Own Penthouse Together and It’s Insane", "meta_data": {"viewport": "width=device-width,minimum-scale=1", "description": "We know it’s serious when a couple moves in together. Jennifer Lopez and Alex Rodriguez, however, isn’t your average couple moving in together, so w", "robots": "max-image-preview:standard", "theme-color": "#FFFFFF", "og": {"locale": "en_US", "type": "article", "site_name": "HipLatina", "title": "J.Lo and A.Rod Just Bought Their Own Penthouse Together and It's Insane - HipLatina", "description": "We know it’s serious when a couple moves in together. Jennifer Lopez and Alex Rodriguez, however, isn’t your average couple moving in together, so w", "url": "https://hiplatina.com/jennifer-lope-alex-rodriguez-together-penthouse/", "image": {"identifier": "https://hiplatina.com/wp-content/uploads/sites/6/2018/03/john-cameron-fGiJtgi2RRg-unsplash.jpg?w=1200", "width": 800, "height": 600, "alt": "Photo: Unsplash/@john_cameron"}}, "article": {"published_time": "2018-03-30T13:02:33Z", "modified_time": "2023-09-27T11:32:42Z", "author": {"username": "araceli-cruz"}, "section": "Lifestyle", "tag": "relationships"}, "twitter": {"card": "summary_large_image", "site": "@hip_latina", "title": "J.Lo and A.Rod Just Bought Their Own Penthouse Together and It's Insane - HipLatina", "description": "We know it’s serious when a couple moves in together. Jennifer Lopez and Alex Rodriguez, however, isn’t your average couple moving in together, so w", "url": "https://hiplatina.com/jennifer-lope-alex-rodriguez-together-penthouse/", "image": {"identifier": "https://hiplatina.com/wp-content/uploads/sites/6/2018/03/john-cameron-fGiJtgi2RRg-unsplash.jpg?w=4096", "alt": "Photo: Unsplash/@john_cameron"}}}, "movies": [], "publish_date": 1522414953.0, "source": "http://hiplatina.com", "summary": ""}