{"url": "www.billboard.com/articles/columns/pop/7728734/katy-perry-recounts-christian-past-human-rights-campaign-gala-los-angeles", "text": "Trending on Billboard\n\nKaty Perry‘s conservative Christian past is no secret, but the pop superstar took a trip down memory lane on Saturday night (March 18) while dropping some new truths in the process of detailing her journey to enlightenment.\n\nThe reason: Human Rights Campaign’s Los Angeles gala dinner at JW Marriott L.A. Live in downtown Los Angeles, where Perry picked up the org’s highest honor, the National Equality Award. HRC feted the 32-year-old alongside America Ferrera, 32, who took home the Ally for Equality Award, a trophy presented to her by her good friend Lena Dunham. Perry received her award from her own BFF of 11 years, actress Shannon Woodward, who said the singer “finds a way to act as an ally virtually every single time she performs or speaks publicly.”\n\nExplore Katy Perry See latest videos, charts and news\n\nBFF of 11 ys @shannonwoodward presents to @katyperry, lauding her as global pop star who created soundtrack to our lives #HRCLADinner @HRC pic.twitter.com/6f36zHaNrQ — Chris Gardner (@chrissgardner) March 19, 2017\n\nFor Saturday’s edition, Perry first praised her LGBTQ friends for informing her own evolution. “There’s no other community that has done more to shape who I am today, and there is no other community that I believe in more than you,” she exclaimed. “This community here tonight has achieved more progress toward a more perfect union in a short amount of time as any group in our history. So I stand with you and I know that we stand together against discrimination, whether it be in the LGBTQ community or our Latino brothers and sisters or the millions of Muslims in this country.”\n\nThen came Perry’s peek at the past. After noting that she speaks her truths and paints her fantasies courtesy of “little, bite-sized pop songs,” she referenced her 2008 smash hit single “I Kissed a Girl.” The lesbian lyrics were just a tease.\n\n“Truth be told: A) I did more than that,” Perry purred. “But B) How was I going to reconcile that with the gospel singing girl raised in youth groups that [was] pro-conversion camps? What I did know is that I was curious, and even then, I knew that sexuality wasn’t as black and white as this dress.” (For the record, she was wearing a Rasario design.)\n\nHowever, Perry’s own curiosity seemed to have gotten repressed by her Christian leanings. “My first words were ‘mama’ and ‘dada,’ ‘God’ and ‘Satan,'” she related. “Right and wrong were taught to me on felt boards and, of course, through the glamorous Jan Crouch crying diamond teardrops every night on that Vaseline-TBN television screen. When I was growing up, homosexuality was synonymous with the word ‘abomination’ … and hell. A place of gnashing of teeth, continual burning of skin and probably Mike Pence’s ultimate guest list for a barbecue. No way, no way. I wanted the pearly gates and unlimited fro-yo toppings.”\n\nAs a result of the anti-homosexuality education she received, Perry turned toward prayer.\n\n“Most of my unconscious adolescence, I prayed the gay away at my Jesus camps,” she revealed. “But then in the middle of it all, in a twist of events, I found my gift, and my gift introduced me to people outside of my bubble. My bubble started to burst.”\n\nThe “pop” happened with the introduction of LGBTQ friends and collaborators.\n\n“These people were nothing like I had been taught to fear,” Perry continued. “They were the most free, strong, kind and inclusive people I have ever met. They stimulated my mind and they filled my heart with joy, and they freaking danced all the while doing it. These people are actually magic, and they are magic because they are living their truth. Oh, my goodness, what a revelation! — and not the last chapter of the Bible.”\n\nOne of those magic people in Perry’s life is her longtime manager, “Bradford Elton Cobb III,” a man she described as “one of the greatest champions of my life,” for going on 15 years. “Many of the people I admire and trust and work with belong to the LGBTQ community, and without them, I would be half the person I am today. My life is rich in every capacity because of them. They are trusted allies that provide a safe space to fall, to not know it all and to make mistakes,” she concluded at the close of her speech, which was bookended by standing ovations. “I hope I stand here as evidence for all that it doesn’t matter where you come from, it is about where you are going. Real change, real evolution and real perception shift can happen if we open our minds and soften our hearts. People can change — believe me.”\n\nThis article originally appeared on The Hollywood Reporter.", "images": ["https://www.billboard.com/wp-content/uploads/media/katy-perry-hrc-2017-billboard-1548.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://cdn.shopify.com/s/files/1/0237/2843/products/2020_04_540x.jpg?v=1581608516", "https://www.billboard.com/wp-content/uploads/media/katy-perry-hrc-2017-billboard-1548.jpg?w=942&h=628&crop=1", "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/public/lazyload-fallback.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c4=&cv=3.9&cj=1"], "top_img": "https://www.billboard.com/wp-content/uploads/media/katy-perry-hrc-2017-billboard-1548.jpg?w=1024", "keywords": [], "authors": ["Chris Gardner", ".Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow", "Class", "Wp-Block-Co-Authors-Plus", "Display Inline", ".Wp-Block-Co-Authors-Plus-Avatar", "Where Img", "Height Auto Max-Width", "Vertical-Align Bottom .Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow .Wp-Block-Co-Authors-Plus-Avatar", "Vertical-Align Middle .Wp-Block-Co-Authors-Plus-Avatar Is .Alignleft .Alignright"], "canonical_link": "https://www.billboard.com/music/pop/katy-perry-recounts-christian-past-human-rights-campaign-gala-los-angeles-7728734/", "title": "Katy Perry Recounts Christian Past at HRC Gala, Talks Conversion Therapy and Praying Gay Away: ‘People Can Change — Believe Me’", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/icon-144x144.png", "msapplication-TileColor": "#eff4ff", "description": "Katy Perry's conservative Christian past is no secret, but the pop superstar took a trip down memory lane at the Human Rights Campaign's Los Angeles gala dinner.", "robots": "max-image-preview:large", "generator": "WordPress 6.7.4", "author": "Chris Gardner", "og": {"type": "article", "title": "Katy Perry Recounts Christian Past at HRC Gala, Talks Conversion Therapy and Praying Gay Away: ‘People Can Change — Believe Me’", "url": "https://www.billboard.com/music/pop/katy-perry-recounts-christian-past-human-rights-campaign-gala-los-angeles-7728734/", "description": "Katy Perry's conservative Christian past is no secret, but the pop superstar took a trip down memory lane at the Human Rights Campaign's Los Angeles gala dinner.", "site_name": "Billboard", "image": {"identifier": "https://www.billboard.com/wp-content/uploads/media/katy-perry-hrc-2017-billboard-1548.jpg?w=1024", "width": 1024, "height": 677, "alt": "Honoree Katy Perry accepts the HRC National Equality Award onstage the Human Rights Campaign's 2017 Los Angeles Gala Dinner at JW Marriott Los Angeles at L.A. LIVE on March 18, 2017 in Los Angeles."}, "locale": "en_US"}, "article": {"published_time": "2017-03-19T22:45:40+00:00", "modified_time": "2023-09-20T02:34:35+00:00"}, "twitter": {"description": "Katy Perry's conservative Christian past is no secret, but the pop superstar took a trip down memory lane at the Human Rights Campaign's Los Angeles gala dinner.", "site": "@billboard", "card": "summary_large_image", "title": "Katy Perry Recounts Christian Past at HRC Gala, Talks Conversion Therapy and Praying Gay Away: ‘People Can Change — Believe Me’", "image": "https://www.billboard.com/wp-content/uploads/media/katy-perry-hrc-2017-billboard-1548.jpg?w=1024"}}, "movies": [], "publish_date": 1489963540.0, "source": "http://www.billboard.com", "summary": ""}