{"url": "https://usweekly.com/news/22/884/the-surprisingly-downtoearth-way-es-erin-lim-arrived-at-the-emmys-2017-red-carpet.html", "text": "Unprecedented Economic Boom\n\nBefore the China Virus invaded our shores, we built the world’s most prosperous economy.\n\nAmerica gained 7 million new jobs – more than three times government experts’ projections.\n\nMiddle-Class family income increased nearly $6,000 – more than five times the gains during the entire previous administration.\n\nThe unemployment rate reached 3.5 percent, the lowest in a half-century.\n\nAchieved 40 months in a row with more job openings than job-hirings.\n\nMore Americans reported being employed than ever before – nearly 160 million.\n\nJobless claims hit a nearly 50-year low.\n\nThe number of people claiming unemployment insurance as a share of the population hit its lowest on record.\n\nIncomes rose in every single metro area in the United States for the first time in nearly 3 decades.\n\nDelivered a future of greater promise and opportunity for citizens of all backgrounds.\n\nUnemployment rates for African Americans, Hispanic Americans, Asian Americans, Native Americans, veterans, individuals with disabilities, and those without a high school diploma all reached record lows.\n\nUnemployment for women hit its lowest rate in nearly 70 years.\n\nLifted nearly 7 million people off of food stamps.\n\nPoverty rates for African Americans and Hispanic Americans reached record lows.\n\nIncome inequality fell for two straight years, and by the largest amount in over a decade.\n\nThe bottom 50 percent of American households saw a 40 percent increase in net worth.\n\nWages rose fastest for low-income and blue collar workers – a 16 percent pay increase.\n\nAfrican American homeownership increased from 41.7 percent to 46.4 percent.\n\nBrought jobs, factories, and industries back to the USA.\n\nCreated more than 1.2 million manufacturing and construction jobs.\n\nPut in place policies to bring back supply chains from overseas.\n\nSmall business optimism broke a 35-year old record in 2018.\n\nHit record stock market numbers and record 401ks.\n\nThe DOW closed above 20,000 for the first time in 2017 and topped 30,000 in 2020.\n\nThe S&P 500 and NASDAQ have repeatedly notched record highs.\n\nRebuilding and investing in rural America.\n\nSigned an Executive Order on Modernizing the Regulatory Framework for Agricultural Biotechnology Products, which is bringing innovative new technologies to market in American farming and agriculture.\n\nStrengthened America’s rural economy by investing over $1.3 billion through the Agriculture Department’s ReConnect Program to bring high-speed broadband infrastructure to rural America.\n\nAchieved a record-setting economic comeback by rejecting blanket lockdowns.\n\nAn October 2020 Gallup survey found 56 percent of Americans said they were better off during a pandemic than four years prior.\n\nDuring the third quarter of 2020, the economy grew at a rate of 33.1 percent – the most rapid GDP growth ever recorded.\n\nSince coronavirus lockdowns ended, the economy has added back over 12 million jobs, more than half the jobs lost.\n\nJobs have been recovered 23 times faster than the previous administration’s recovery.\n\nUnemployment fell to 6.7 percent in December, from a pandemic peak of 14.7 percent in April – beating expectations of well over 10 percent unemployment through the end of 2020.\n\nUnder the previous administration, it took 49 months for the unemployment rate to fall from 10 percent to under 7 percent compared to just 3 months for the Trump Administration.\n\nSince April, the Hispanic unemployment rate has fallen by 9.6 percent, Asian-American unemployment by 8.6 percent, and Black American unemployment by 6.8 percent.\n\n80 percent of small businesses are now open, up from just 53 percent in April.\n\nSmall business confidence hit a new high.\n\nHomebuilder confidence reached an all-time high, and home sales hit their highest reading since December 2006.\n\nManufacturing optimism nearly doubled.\n\nHousehold net worth rose $7.4 trillion in Q2 2020 to $112 trillion, an all-time high.\n\nHome prices hit an all-time record high.\n\nThe United States rejected crippling lockdowns that crush the economy and inflict countless public health harms and instead safely reopened its economy.\n\nBusiness confidence is higher in America than in any other G7 or European Union country.\n\nStabilized America’s financial markets with the establishment of a number of Treasury Department supported facilities at the Federal Reserve.\n\nTax Relief for the Middle Class\n\nPassed $3.2 trillion in historic tax relief and reformed the tax code.\n\nSigned the Tax Cuts and Jobs Act – the largest tax reform package in history.\n\nMore than 6 million American workers received wage increases, bonuses, and increased benefits thanks to the tax cuts.\n\nA typical family of four earning $75,000 received an income tax cut of more than $2,000 – slashing their tax bill in half.\n\nDoubled the standard deduction – making the first $24,000 earned by a married couple completely tax-free.\n\nDoubled the child tax credit.\n\nVirtually eliminated the unfair Estate Tax, or Death Tax.\n\nCut the business tax rate from 35 percent – the highest in the developed world – all the way down to 21 percent.\n\nSmall businesses can now deduct 20 percent of their business income.\n\nBusinesses can now deduct 100 percent of the cost of their capital investments in the year the investment is made.\n\nSince the passage of tax cuts, the share of total wealth held by the bottom half of households has increased, while the share held by the top 1 percent has decreased.\n\nOver 400 companies have announced bonuses, wage increases, new hires, or new investments in the United States.\n\nOver $1.5 trillion was repatriated into the United States from overseas.\n\nLower investment cost and higher capital returns led to faster growth in the middle class, real wages, and international competitiveness.\n\nJobs and investments are pouring into Opportunity Zones.\n\nCreated nearly 9,000 Opportunity Zones where capital gains on long-term investments are taxed at zero.\n\nOpportunity Zone designations have increased property values within them by 1.1 percent, creating an estimated $11 billion in wealth for the nearly half of Opportunity Zone residents who own their own home.\n\nOpportunity Zones have attracted $75 billion in funds and driven $52 billion of new investment in economically distressed communities, creating at least 500,000 new jobs.\n\nApproximately 1 million Americans will be lifted from poverty as a result of these new investments.\n\nPrivate equity investments into businesses in Opportunity Zones were nearly 30 percent higher than investments into businesses in similar areas that were not designated Opportunity Zones.\n\nMassive Deregulation\n\nEnded the regulatory assault on American Businesses and Workers.\n\nInstead of 2-for-1, we eliminated 8 old regulations for every 1 new regulation adopted.\n\nProvided the average American household an extra $3,100 every year.\n\nReduced the direct cost of regulatory compliance by $50 billion, and will reduce costs by an additional $50 billion in FY 2020 alone.\n\nRemoved nearly 25,000 pages from the Federal Register – more than any other president. The previous administration added over 16,000 pages.\n\nEstablished the Governors’ Initiative on Regulatory Innovation to reduce outdated regulations at the state, local, and tribal levels.\n\nSigned an executive order to make it easier for businesses to offer retirement plans.\n\nSigned two executive orders to increase transparency in Federal agencies and protect Americans and their small businesses from administrative abuse.\n\nModernized the National Environmental Policy Act (NEPA) for the first time in over 40 years.\n\nReduced approval times for major infrastructure projects from 10 or more years down to 2 years or less.\n\nHelped community banks by signing legislation that rolled back costly provisions of Dodd-Frank.\n\nEstablished the White House Council on Eliminating Regulatory Barriers to Affordable Housing to bring down housing costs.\n\nRemoved regulations that threatened the development of a strong and stable internet.\n\nEased and simplified restrictions on rocket launches, helping to spur commercial investment in space projects.\n\nPublished a whole-of-government strategy focused on ensuring American leadership in automated vehicle technology.\n\nStreamlined energy efficiency regulations for American families and businesses, including preserving affordable lightbulbs, enhancing the utility of showerheads, and enabling greater time savings with dishwashers.\n\nRemoved unnecessary regulations that restrict the seafood industry and impede job creation.\n\nModernized the Department of Agriculture’s biotechnology regulations to put America in the lead to develop new technologies.\n\nTook action to suspend regulations that would have slowed our response to COVID-19, including lifting restrictions on manufacturers to more quickly produce ventilators.\n\nSuccessfully rolled back burdensome regulatory overreach.\n\nRescinded the previous administration’s Affirmatively Furthering Fair Housing (AFFH) rule, which would have abolished zoning for single-family housing to build low-income, federally subsidized apartments.\n\nIssued a final rule on the Fair Housing Act’s disparate impact standard.\n\nEliminated the Waters of the United States Rule and replaced it with the Navigable Waters Protection Rule, providing relief and certainty for farmers and property owners.\n\nRepealed the previous administration’s costly fuel economy regulations by finalizing the Safer Affordable Fuel Efficient (SAFE) Vehicles rule, which will make cars more affordable, and lower the price of new vehicles by an estimated $2,200.\n\nAmericans now have more money in their pockets.\n\nDeregulation had an especially beneficial impact on low-income Americans who pay a much higher share of their incomes for overregulation.\n\nCut red tape in the healthcare industry, providing Americans with more affordable healthcare and saving Americans nearly 10 percent on prescription drugs.\n\nDeregulatory efforts yielded savings to the medical community an estimated $6.6 billion – with a reduction of 42 million hours of regulatory compliance work through 2021.\n\nRemoved government barriers to personal freedom and consumer choice in healthcare.\n\nOnce fully in effect, 20 major deregulatory actions undertaken by the Trump Administration are expected to save American consumers and businesses over $220 billion per year.\n\nSigned 16 pieces of deregulatory legislation that will result in a $40 billion increase in annual real incomes.\n\nFair and Reciprocal Trade\n\nSecured historic trade deals to defend American workers.\n\nImmediately withdrew from the job-killing Trans-Pacific Partnership (TPP).\n\nEnded the North American Free Trade Agreement (NAFTA), and replaced it with the brand new United States-Mexico-Canada Agreement (USMCA).\n\nThe USMCA contains powerful new protections for American manufacturers, auto-makers, farmers, dairy producers, and workers.\n\nThe USMCA is expected to generate over $68 billion in economic activity and potentially create over 550,000 new jobs over ten years.\n\nSigned an executive order making it government policy to Buy American and Hire American, and took action to stop the outsourcing of jobs overseas.\n\nNegotiated with Japan to slash tariffs and open its market to $7 billion in American agricultural products and ended its ban on potatoes and lamb.\n\nOver 90 percent of American agricultural exports to Japan now receive preferential treatment, and most are duty-free.\n\nNegotiated another deal with Japan to boost $40 billion worth of digital trade.\n\nRenegotiated the United States-Korea Free Trade Agreement, doubling the cap on imports of American vehicles and extending the American light truck tariff.\n\nReached a written, fully-enforceable Phase One trade agreement with China on confronting pirated and counterfeit goods, and the protection of American ideas, trade secrets, patents, and trademarks.\n\nChina agreed to purchase an additional $200 billion worth of United States exports and opened market access for over 4,000 American facilities to exports while all tariffs remained in effect.\n\nAchieved a mutual agreement with the European Union (EU) that addresses unfair trade practices and increases duty-free exports by 180 percent to $420 million.\n\nSecured a pledge from the EU to eliminate tariffs on American lobster – the first United States-European Union negotiated tariff reduction in over 20 years.\n\nScored a historic victory by overhauling the Universal Postal Union, whose outdated policies were undermining American workers and interests.\n\nEngaged extensively with trade partners like the EU and Japan to advance reforms to the World Trade Organization (WTO).\n\nIssued a first-ever comprehensive report on the WTO Appellate Body’s failures to comply with WTO rules and interpret WTO agreements as written.\n\nBlocked nominees to the WTO’s Appellate Body until WTO Members recognize and address longstanding issues with Appellate Body activism.\n\nSubmitted 5 papers to the WTO Committee on Agriculture to improve Members’ understanding of how trade policies are implemented, highlight areas for improved transparency, and encourage members to maintain up-to-date notifications on market access and domestic support.\n\nTook strong actions to confront unfair trade practices and put America First.\n\nImposed tariffs on hundreds of billions worth of Chinese goods to protect American jobs and stop China’s abuses under Section 232 of the Trade Expansion Act of 1962 and Section 301 of the Trade Act of 1974.\n\nDirected an all-of-government effort to halt and punish efforts by the Communist Party of China to steal and profit from American innovations and intellectual property.\n\nImposed tariffs on foreign aluminum and foreign steel to protect our vital industries and support our national security.\n\nApproved tariffs on $1.8 billion in imports of washing machines and $8.5 billion in imports of solar panels.\n\nBlocked illegal timber imports from Peru.\n\nTook action against France for its digital services tax that unfairly targets American technology companies.\n\nLaunched investigations into digital services taxes that have been proposed or adopted by 10 other countries.\n\nHistoric support for American farmers.\n\nSuccessfully negotiated more than 50 agreements with countries around the world to increase foreign market access and boost exports of American agriculture products, supporting more than 1 million American jobs.\n\nAuthorized $28 billion in aid for farmers who have been subjected to unfair trade practices – fully funded by the tariffs paid by China.\n\nChina lifted its ban on poultry, opened its market to beef, and agreed to purchase at least $80 billion of American agricultural products in the next two years.\n\nThe European Union agreed to increase beef imports by 180 percent and opened up its market to more imports of soybeans.\n\nSouth Korea lifted its ban on American poultry and eggs, and agreed to provide market access for record exports of American rice.\n\nArgentina lifted its ban on American pork.\n\nBrazil agreed to increase wheat imports by $180 million a year and raised its quotas for purchases of United States ethanol.\n\nGuatemala and Tunisia opened up their markets to American eggs.\n\nWon tariff exemptions in Ecuador for wheat and soybeans.\n\nSuspended $817 million in trade preferences for Thailand under the Generalized System of Preferences (GSP) program due to its failure to adequately provide reasonable market access for American pork products.\n\nThe amount of food stamps redeemed at farmers markets increased from $1.4 million in May 2020 to $1.75 million in September 2020 – a 50 percent increase over last year.\n\nRapidly deployed the Coronavirus Food Assistance Program, which provided $30 billion in support to farmers and ranchers facing decreased prices and market disruption when COVID-19 impacted the food supply chain.\n\nAuthorized more than $6 billion for the Farmers to Families Food Box program, which delivered over 128 million boxes of locally sourced, produce, meat, and dairy products to charity and faith-based organizations nationwide.\n\nDelegated authorities via the Defense Production Act to protect breaks in the American food supply chain as a result of COVID-19.\n\nAmerican Energy Independence\n\nUnleashed America’s oil and natural gas potential.\n\nFor the first time in nearly 70 years, the United States has become a net energy exporter.\n\nThe United States is now the number one producer of oil and natural gas in the world.\n\nNatural gas production reached a record-high of 34.9 quads in 2019, following record high production in 2018 and in 2017.\n\nThe United States has been a net natural gas exporter for three consecutive years and has an export capacity of nearly 10 billion cubic feet per day.\n\nWithdrew from the unfair, one-sided Paris Climate Agreement.\n\nCanceled the previous administration’s Clean Power Plan, and replaced it with the new Affordable Clean Energy rule.\n\nApproved the Keystone XL and Dakota Access pipelines.\n\nOpened up the Arctic National Wildlife Refuge (ANWR) in Alaska to oil and gas leasing.\n\nRepealed the last administration’s Federal Coal Leasing Moratorium, which prohibited coal leasing on Federal lands.\n\nReformed permitting rules to eliminate unnecessary bureaucracy and speed approval for mines.\n\nFixed the New Source Review permitting program, which punished companies for upgrading or repairing coal power plants.\n\nFixed the Environmental Protection Agency’s (EPA) steam electric and coal ash rules.\n\nThe average American family saved $2,500 a year in lower electric bills and lower prices at the gas pump.\n\nSigned legislation repealing the harmful Stream Protection Rule.\n\nReduced the time to approve drilling permits on public lands by half, increasing permit applications to drill on public lands by 300 percent.\n\nExpedited approval of the NuStar’s New Burgos pipeline to export American gasoline to Mexico.\n\nStreamlined Liquefied natural gas (LNG) terminal permitting and allowed long-term LNG export authorizations to be extended through 2050.\n\nThe United States is now among the top three LNG exporters in the world.\n\nIncreased LNG exports five-fold since January 2017, reaching an all-time high in January 2020.\n\nLNG exports are expected to reduce the American trade deficit by over $10 billion.\n\nGranted more than 20 new long-term approvals for LNG exports to non-free trade agreement countries.\n\nThe development of natural gas and LNG infrastructure in the United States is providing tens of thousands of jobs, and has led to the investment of tens of billions of dollars in infrastructure.\n\nThere are now 6 LNG export facilities operating in the United States, with 2 additional export projects under construction.\n\nThe amount of nuclear energy production in 2019 was the highest on record, through a combination of increased capacity from power plant upgrades and shorter refueling and maintenance cycles.\n\nPrevented Russian energy coercion across Europe through various lines of effort, including the Partnership for Transatlantic Energy Cooperation, civil nuclear deals with Romania and Poland, and opposition to Nord Stream 2 pipeline.\n\nIssued the Presidential Permit for the A2A railroad between Canada and Alaska, providing energy resources to emerging markets.\n\nIncreased access to our country’s abundant natural resources in order to achieve energy independence.\n\nRenewable energy production and consumption both reached record highs in 2019.\n\nEnacted policies that helped double the amount of electricity generated by solar and helped increase the amount of wind generation by 32 percent from 2016 through 2019.\n\nAccelerated construction of energy infrastructure to ensure American energy producers can deliver their products to the market.\n\nCut red tape holding back the construction of new energy infrastructure.\n\nAuthorized ethanol producers to sell E15 year-round and allowed higher-ethanol gasoline to be distributed from existing pumps at filling stations.\n\nEnsured greater transparency and certainty in the Renewable Fuel Standard (RFS) program.\n\nNegotiated leasing capacity in the Strategic Petroleum Reserve to Australia, providing American taxpayers a return on this infrastructure investment.\n\nSigned an executive order directing Federal agencies to work together to diminish the capability of foreign adversaries to target our critical electric infrastructure.\n\nReformed Section 401 of the Clean Water Act regulation to allow for the curation of interstate infrastructure.\n\nResolved the OPEC (Organization of the Petroleum Exporting Countries) oil crisis during COVID-19 by getting OPEC, Russia, and others to cut nearly 10 million barrels of production a day, stabilizing world oil prices.\n\nDirected the Department of Energy to use the Strategic Petroleum Reserve to mitigate market volatility caused by COVID-19.\n\nInvesting in America’s Workers and Families\n\nAffordable and high-quality Child Care for American workers and their families.\n\nDoubled the Child Tax Credit from $1,000 to $2,000 per child and expanded the eligibility for receiving the credit.\n\nNearly 40 million families benefitted from the child tax credit (CTC), receiving an average benefit of $2,200 – totaling credits of approximately $88 billion.\n\nSigned the largest-ever increase in Child Care and Development Block Grants – expanding access to quality, affordable child care for more than 800,000 low-income families.\n\nSecured an additional $3.5 billion in the Coronavirus Aid, Relief, and Economic Security (CARES) Act to help families and first responders with child care needs.\n\nCreated the first-ever paid family leave tax credit for employees earning $72,000 or less.\n\nSigned into law 12-weeks of paid parental leave for Federal workers.\n\nSigned into law a provision that enables new parents to withdraw up to $5,000 from their retirement accounts without penalty when they give birth to or adopt a child.\n\nAdvanced apprenticeship career pathways to good-paying jobs.\n\nExpanded apprenticeships to more than 850,000 and established the new Industry-Recognized Apprenticeship programs in new and emerging fields.\n\nEstablished the National Council for the American Worker and the American Workforce Policy Advisory Board.\n\nOver 460 companies have signed the Pledge to America’s Workers, committing to provide more than 16 million job and training opportunities.\n\nSigned an executive order that directs the Federal government to replace outdated degree-based hiring with skills-based hiring.\n\nAdvanced women’s economic empowerment.\n\nIncluded women’s empowerment for the first time in the President’s 2017 National Security Strategy.\n\nSigned into law key pieces of legislation, including the Women, Peace, and Security Act and the Women Entrepreneurship and Economic Empowerment Act.\n\nLaunched the Women’s Global Development and Prosperity (W-GDP) Initiative – the first-ever whole-of-government approach to women’s economic empowerment that has reached 24 million women worldwide.\n\nEstablished an innovative new W-GDP Fund at USAID.\n\nLaunched the Women Entrepreneurs Finance Initiative (We-Fi) with 13 other nations.\n\nAnnounced a $50 million donation on behalf of the United States to We-Fi providing more capital to women-owned businesses around the world.\n\nReleased the first-ever Strategy on Women, Peace, and Security, which focused on increasing women’s participation to prevent and resolve conflicts.\n\nLaunched the W-GDP 2x Global Women’s Initiative with the Development Finance Corporation, which has mobilized more than $3 billion in private sector investments over three years.\n\nEnsured American leadership in technology and innovation.\n\nFirst administration to name artificial intelligence, quantum information science, and 5G communications as national research and development priorities.\n\nLaunched the American Broadband Initiative to promote the rapid deployment of broadband internet across rural America.\n\nMade 100 megahertz of crucial mid-band spectrum available for commercial operations, a key factor to driving widespread 5G access across rural America.\n\nLaunched the American AI Initiative to ensure American leadership in artificial intelligence (AI), and established the National AI Initiative Office at the White House.\n\nEstablished the first-ever principles for Federal agency adoption of AI to improve services for the American people.\n\nSigned the National Quantum Initiative Act establishing the National Quantum Coordination Office at the White House to drive breakthroughs in quantum information science.\n\nSigned the Secure 5G and Beyond Act to ensure America leads the world in 5G.\n\nLaunched a groundbreaking program to test safe and innovative commercial drone operations nationwide.\n\nIssued new rulemaking to accelerate the return of American civil supersonic aviation.\n\nCommitted to doubling investments in AI and quantum information science (QIS) research and development.\n\nAnnounced the establishment of $1 billion AI and quantum research institutes across America.\n\nEstablished the largest dual-use 5G test sites in the world to advance 5G commercial and military innovation.\n\nSigned landmark Prague Principles with America’s allies to advance the deployment of secure 5G telecommunications networks.\n\nSigned first-ever bilateral AI cooperation agreement with the United Kingdom.\n\nBuilt collation among allies to ban Chinese Telecom Company Huawei from their 5G infrastructure.\n\nPreserved American jobs for American workers and rejected the importation of cheap foreign labor.\n\nPressured the Tennessee Valley Authority (TVA) to reverse their decision to lay off over 200 American workers and replace them with cheaper foreign workers.\n\nRemoved the TVA Chairman of the Board and a TVA Board Member.\n\nLife-Saving Response to the China Virus\n\nRestricted travel to the United States from infected regions of the world.\n\nSuspended all travel from China, saving thousands of lives.\n\nRequired all American citizens returning home from designated outbreak countries to return through designated airports with enhanced screening measures, and to undergo a self-quarantine.\n\nAnnounced further travel restrictions on Iran, the Schengen Area of Europe, the United Kingdom, Ireland, and Brazil.\n\nIssued travel advisory warnings recommending that American citizens avoid all international travel.\n\nReached bilateral agreements with Mexico and Canada to suspend non-essential travel and expeditiously return illegal aliens.\n\nRepatriated over 100,000 American citizens stranded abroad on more than 1,140 flights from 136 countries and territories.\n\nSafely transported, evacuated, treated, and returned home trapped passengers on cruise ships.\n\nTook action to authorize visa sanctions on foreign governments who impede our efforts to protect American citizens by refusing or unreasonably delaying the return of their own citizens, subjects, or residents from the United States.\n\nActed early to combat the China Virus in the United States.\n\nEstablished the White House Coronavirus Task Force, with leading experts on infectious diseases, to manage the Administration’s efforts to mitigate the spread of COVID-19 and to keep workplaces safe.\n\nPledged in the State of the Union address to “take all necessary steps to safeguard our citizens from the Virus,” while the Democrats’ response made not a single mention of COVID-19 or even the threat of China.\n\nDeclared COVID-19 a National Emergency under the Stafford Act.\n\nEstablished the 24/7 FEMA National Response Coordination Center.\n\nReleased guidance recommending containment measures critical to slowing the spread of the Virus, decompressing peak burden on hospitals and infrastructure, and diminishing health impacts.\n\nImplemented strong community mitigation strategies to sharply reduce the number of lives lost in the United States down from experts’ projection of up to 2.2 million deaths in the United States without mitigation.\n\nHalted American funding to the World Health Organization to counter its egregious bias towards China that jeopardized the safety of Americans.\n\nAnnounced plans for withdrawal from the World Health Organization and redirected contribution funds to help meet global public health needs.\n\nCalled on the United Nations to hold China accountable for their handling of the virus, including refusing to be transparent and failing to contain the virus before it spread.\n\nRe-purposed domestic manufacturing facilities to ensure frontline workers had critical supplies.\n\nDistributed billions of pieces of Personal Protective Equipment, including gloves, masks, gowns, and face shields.\n\nInvoked the Defense Production Act over 100 times to accelerate the development and manufacturing of essential material in the USA.\n\nMade historic investments of more than $3 billion into the industrial base.\n\nContracted with companies such as Ford, General Motors, Philips, and General Electric to produce ventilators.\n\nContracted with Honeywell, 3M, O&M Halyard, Moldex, and Lydall to increase our Nation’s production of N-95 masks.\n\nThe Army Corps of Engineers built 11,000 beds, distributed 10,000 ventilators, and surged personnel to hospitals.\n\nConverted the Javits Center in New York into a 3,000-bed hospital, and opened medical facilities in Seattle and New Orleans.\n\nDispatched the USNS Comfort to New York City, and the USNS Mercy to Los Angeles.\n\nDeployed thousands of FEMA employees, National Guard members, and military forces to help in the response.\n\nProvided support to states facing new emergences of the virus, including surging testing sites, deploying medical personnel, and advising on mitigation strategies.\n\nAnnounced Federal support to governors for use of the National Guard with 100 percent cost-share.\n\nEstablished the Supply Chain Task Force as a “control tower” to strategically allocate high-demand medical supplies and PPE to areas of greatest need.\n\nRequested critical data elements from states about the status of hospital capacity, ventilators, and PPE.\n\nExecuted nearly 250 flights through Project Air Bridge to transport hundreds of millions of surgical masks, N95 respirators, gloves, and gowns from around the world to hospitals and facilities throughout the United States.\n\nSigned an executive order invoking the Defense Production Act to ensure that Americans have a reliable supply of products like beef, pork, and poultry.\n\nStabilized the food supply chain restoring the Nation’s protein processing capacity through a collaborative approach with Federal, state, and local officials and industry partners.\n\nThe continued movement of food and other critical items of daily life distributed to stores and to American homes went unaffected.\n\nReplenished the depleted Strategic National Stockpile.\n\nIncreased the number of ventilators nearly ten-fold to more than 153,000.\n\nDespite the grim projections from the media and governors, no American who has needed a ventilator has been denied a ventilator.\n\nIncreased the number of N95 masks fourteen-fold to more than 176 million.\n\nIssued an executive order ensuring critical medical supplies are produced in the United States.\n\nCreated the largest, most advanced, and most innovative testing system in the world.\n\nBuilt the world’s leading testing system from scratch, conducting over 200 million tests – more than all of the European Union combined.\n\nEngaged more than 400 test developers to increase testing capacity from less than 100 tests per day to more than 2 million tests per day.\n\nSlashed red tape and approved Emergency Use Authorizations for more than 300 different tests, including 235 molecular tests, 63 antibody tests, and 11 antigen tests.\n\nDelivered state-of-the-art testing devices and millions of tests to every certified nursing home in the country.\n\nAnnounced more flexibility to Medicare Advantage and Part D plans to waive cost-sharing for tests.\n\nOver 2,000 retail pharmacy stores, including CVS, Walmart, and Walgreens, are providing testing using new regulatory and reimbursement options.\n\nDeployed tens of millions of tests to nursing homes, assisted living facilities, historically black colleges and universities (HBCUs), tribes, disaster relief operations, Home Health/Hospice organizations, and the Veterans Health Administration.\n\nBegan shipping 150 million BinaxNOW rapid tests to states, long-term care facilities, the IHS, HBCUs, and other key partners.\n\nPioneered groundbreaking treatments and therapies that reduced the mortality rate by 85 percent, saving over 2 million lives.\n\nThe United States has among the lowest case fatality rates in the entire world.\n\nThe Food and Drug Administration (FDA) launched the Coronavirus Treatment Acceleration Program to expedite the regulatory review process for therapeutics in clinical trials, accelerate the development and publication of industry guidance on developing treatments, and utilize regulatory flexibility to help facilitate the scaling-up of manufacturing capacity.\n\nMore than 370 therapies are in clinical trials and another 560 are in the planning stages.\n\nAnnounced $450 million in available funds to support the manufacturing of Regeneron’s antibody cocktail.\n\nShipped tens of thousands of doses of the Regeneron drug.\n\nAuthorized an Emergency Use Authorization (EUA) for convalescent plasma.\n\nTreated around 100,000 patients with convalescent plasma, which may reduce mortality by 50 percent.\n\nProvided $48 million to fund the Mayo Clinic study that tested the efficacy of convalescent plasma for patients with COVID-19.\n\nMade an agreement to support the large-scale manufacturing of AstraZeneca’s cocktail of two monoclonal antibodies.\n\nApproved Remdesivir as the first COVID-19 treatment, which could reduce hospitalization time by nearly a third.\n\nSecured more than 90 percent of the world’s supply of Remdesivir, enough to treat over 850,000 high-risk patients.\n\nGranted an EUA to Eli Lilly for its anti-body treatments.\n\nFinalized an agreement with Eli Lilly to purchase the first doses of the company’s investigational antibody therapeutic.\n\nProvided up to $270 million to the American Red Cross and America’s Blood Centers to support the collection of up to 360,000 units of plasma.\n\nLaunched a nationwide campaign to ask patients who have recovered from COVID-19 to donate plasma.\n\nAnnounced Phase 3 clinical trials for varying types of blood thinners to treat adults diagnosed with COVID-19.\n\nIssued an EUA for the monoclonal antibody therapy bamlanivimab.\n\nFDA issued an EUA for casirivimab and imdevimab to be administered together.\n\nLaunched the COVID-19 High Performance Computing Consortium with private sector and academic leaders unleashing America’s supercomputers to accelerate coronavirus research.\n\nBrought the full power of American medicine and government to produce a safe and effective vaccine in record time.\n\nLaunched Operation Warp Speed to initiate an unprecedented drive to develop and make available an effective vaccine by January 2021.\n\nPfizer and Moderna developed two vaccines in just nine months, five times faster than the fastest prior vaccine development in American history.\n\nPfizer and Moderna’s vaccines are approximately 95 effective – far exceeding all expectations.\n\nAstraZeneca and Johnson & Johnson also both have promising candidates in the final stage of clinical trials.\n\nThe vaccines will be administered within 24 hours of FDA-approval.\n\nMade millions of vaccine doses available before the end of 2020, with hundreds of millions more to quickly follow.\n\nFedEx and UPS will ship doses from warehouses directly to local pharmacies, hospitals, and healthcare providers.\n\nFinalized a partnership with CVS and Walgreens to deliver vaccines directly to residents of nursing homes and long-term care facilities as soon as a state requests it, at no cost to America’s seniors.\n\nSigned an executive order to ensure that the United States government prioritizes getting the vaccine to American citizens before sending it to other nations.\n\nProvided approximately $13 billion to accelerate vaccine development and to manufacture all of the top candidates in advance.\n\nProvided critical investments of $4.1 billion to Moderna to support the development, manufacturing, and distribution of their vaccines.\n\nModerna announced its vaccine is 95 percent effective and is pending FDA approval.\n\nProvided Pfizer up to $1.95 billion to support the mass-manufacturing and nationwide distribution of their vaccine candidate.\n\nPfizer announced its vaccine is 95 percent effective and is pending FDA approval.\n\nProvided approximately $1 billion to support the manufacturing and distribution of Johnson & Johnson’s vaccine candidate.\n\nJohnson & Johnson’s vaccine candidate reached the final stage of clinical trials.\n\nMade up to $1.2 billion available to support AstraZeneca’s vaccine candidate.\n\nAstraZeneca’s vaccine candidate reached the final stage of clinical trials.\n\nMade an agreement to support the large-scale manufacturing of Novavax’s vaccine candidate with 100 million doses expected.\n\nPartnered with Sanofi and GSK to support large-scale manufacturing of a COVID-19 investigational vaccine.\n\nAwarded $200 million in funding to support vaccine preparedness and plans for the immediate distribution and administration of vaccines.\n\nProvided $31 million to Cytvia for vaccine-related consumable products.\n\nUnder the PREP Act, issued guidance authorizing qualified pharmacy technicians to administer vaccines.\n\nAnnounced that McKesson Corporation will produce store, and distribute vaccine ancillary supply kits on behalf of the Strategic National Stockpile to help healthcare workers who will administer vaccines.\n\nAnnounced partnership with large-chain, independent, and regional pharmacies to deliver vaccines.\n\nPrioritized resources for the most vulnerable Americans, including nursing home residents.\n\nQuickly established guidelines for nursing homes and expanded telehealth opportunities to protect vulnerable seniors.\n\nIncreased surveillance, oversight, and transparency of all 15,417 Medicare and Medicaid nursing homes by requiring them to report cases of COVID-19 to all residents, their families, and the Centers for Disease Control and Prevention (CDC).\n\nRequired that all nursing homes test staff regularly.\n\nLaunched an unprecedented national nursing home training curriculum to equip nursing home staff with the knowledge they need to stop the spread of COVID-19.\n\nDelivered $81 million for increased inspections and funded 35,000 members of the Nation Guard to deliver critical supplies to every Medicare-certified nursing homes.\n\nDeployed Federal Task Force Strike Teams to provide onsite technical assistance and education to nursing homes experiencing outbreaks.\n\nDistributed tens of billions of dollars in Provider Relief Funds to protect nursing homes, long-term care facilities, safety-net hospitals, rural hospitals, and communities hardest hit by the virus.\n\nReleased 1.5 million N95 respirators from the Strategic National Stockpile for distribution to over 3,000 nursing home facilities.\n\nDirected the White House Opportunity and Revitalization Council to refocus on underserved communities impacted by the coronavirus.\n\nRequired that testing results reported include data on race, gender, ethnicity, and ZIP code, to ensure that resources were directed to communities disproportionately harmed by the virus.\n\nEnsured testing was offered at 95 percent of Federally Qualified Health Centers (FQHC), which serve over 29 million patients in 12,000 communities across the Nation.\n\nInvested an unprecedented $8 billion in tribal communities.\n\nMaintained safe access for Veterans to VA healthcare throughout the COVID-19 Pandemic and supported non-VA hospital systems and private and state-run nursing homes with VA clinical teams.\n\nSigned legislation ensuring no reduction of VA education benefits under the GI Bill for online distance learning.\n\nSupported Americans as they safely return to school and work.\n\nIssued the Guidelines for Opening Up America Again, a detailed blueprint to help governors as they began reopening the country. Focused on protecting the most vulnerable and mitigating the risk of any resurgence, while restarting the economy and allowing Americans to safely return to their jobs.\n\nHelped Americans return to work by providing extensive guidance on workplace-safety measures to protect against COVID-19, and investigating over 10,000 coronavirus-related complaints and referrals.\n\nProvided over $31 billion to support elementary and secondary schools.\n\nDistributed 125 million face masks to school districts.\n\nProvided comprehensive guidelines to schools on how to protect and identify high-risk individuals, prevent the spread of COVID-19, and conduct safe in-person teaching.\n\nBrought back the safe return of college athletics, including Big Ten and Pac-12 football.\n\nRescued the American economy with nearly $3.4 trillion in relief, the largest financial aid package in history.\n\nSecured an initial $8.3 billion Coronavirus Preparedness and Response Act, supporting the development of treatments and vaccines, and to procure critical medical supplies and equipment.\n\nSigned the $100 billion Families First Coronavirus Relief Act, guaranteeing free coronavirus testing, emergency paid sick leave and family leave, Medicaid funding, and food assistance.\n\nSigned the $2.3 trillion Coronavirus Aid, Relief, and Economic Security (CARES) Act, providing unprecedented and immediate relief to American families, workers, and businesses.\n\nSigned additional legislation providing nearly $900 billion in support for coronavirus emergency response and relief, including critically needed funds to continue the Paycheck Protection Program.\n\nSigned the Paycheck Protection Program and Healthcare Enhancement Act, adding an additional $310 billion to replenish the program.\n\nDelivered approximately 160 million relief payments to hardworking Americans.\n\nThrough the Paycheck Protection Program, approved over $525 billion in forgivable loans to more than 5.2 million small businesses, supporting more than 51 million American jobs.\n\nThe Treasury Department approved the establishment of the Money Market Mutual Fund Liquidity Facility to provide liquidity to the financial system.\n\nThe Treasury Department, working with the Federal Reserve, was able to leverage approximately $4 trillion in emergency lending facilities.\n\nSigned an executive order extending expanded unemployment benefits.\n\nSigned an executive order to temporarily suspend student loan payments, evictions, and collection of payroll taxes.\n\nSmall Business Administration expanded access to emergency economic assistance for small businesses, faith-based, and religious entities.\n\nProtected jobs for American workers impacted by COVID-19 by temporarily suspending several job-related nonimmigrant visas, including H-1B’s, H-2B’s without a nexus to the food-supply chain, certain H-4’s, as well as L’s and certain J’s.\n\nGreat Healthcare for Americans\n\nEmpowered American patients by greatly expanding healthcare choice, transparency, and affordability.\n\nEliminated the Obamacare individual mandate – a financial relief to low and middle-income households that made up nearly 80 percent of the families who paid the penalty for not wanting to purchase health insurance.\n\nIncreased choice for consumers by promoting competition in the individual health insurance market leading to lower premiums for three years in a row.\n\nUnder the Trump Administration, more than 90 percent of the counties have multiple options on the individual insurance market to choose from.\n\nOffered Association Health Plans, which allow employers to pool together and offer more affordable, quality health coverage to their employees at up to 30 percent lower cost.\n\nIncreased availability of short-term, limited-duration health plans, which can cost up to 60 percent less than traditional plans, giving Americans more flexibility to choose plans that suit their needs.\n\nExpanded Health Reimbursement Arrangements, allowing millions of Americans to be able to shop for a plan of their choice on the individual market, and then have their employer cover the cost.\n\nAdded 2,100 new Medicare Advantage plan options since 2017, a 76 percent increase.\n\nLowered Medicare Advantage premiums by 34 percent nationwide to the lowest level in 14 years. Medicare health plan premium savings for beneficiaries have totaled $nearly 1.5 billion since 2017.\n\nImproved access to tax-free health savings accounts for individuals with chronic conditions.\n\nEliminated costly Obamacare taxes, including the health insurance tax, the medical device tax, and the “Cadillac tax.”\n\nWorked with states to create more flexibility and relief from oppressive Obamacare regulations, including reinsurance waivers to help lower premiums.\n\nReleased legislative principles to end surprise medical billing.\n\nFinalized requirements for unprecedented price transparency from hospitals and insurance companies so patients know what the cost is before they receive care.\n\nTook action to require that hospitals make the prices they negotiate with insurers publicly available and easily accessible online.\n\nImproved patients access to their health data by penalizing hospitals and causing clinicians to lose their incentive payments if they do not comply.\n\nExpanded access to telehealth, especially in rural and underserved communities.\n\nIncreased Medicare payments to rural hospitals to stem a decade of rising closures and deliver enhanced access to care in rural areas.\n\nIssued unprecedented reforms that dramatically lowered the price of prescription drugs.\n\nLowered drug prices for the first time in 51 years.\n\nLaunched an initiative to stop global freeloading in the drug market.\n\nFinalized a rule to allow the importation of prescription drugs from Canada.\n\nFinalized the Most Favored Nation Rule to ensure that pharmaceutical companies offer the same discounts to the United States as they do to other nations, resulting in an estimated $85 billion in savings over seven years and $30 billion in out-of-pocket costs alone.\n\nProposed a rule requiring federally funded health centers to pass drug company discounts on insulin and Epi-Pens directly to patients.\n\nEnded the gag clauses that prevented pharmacists from informing patients about the best prices for the medications they need.\n\nEnded the costly kickbacks to middlemen and ensured that patients directly benefit from available discounts at the pharmacy counter, saving Americans up to 30 percent on brand name pharmaceuticals.\n\nEnhanced Part D plans to provide many seniors with Medicare access to a broad set of insulins at a maximum $35 copay for a month’s supply of each type of insulin.\n\nReduced Medicare Part D prescription drug premiums, saving beneficiaries nearly $2 billion in premium costs since 2017.\n\nEnded the Unapproved Drugs Initiative, which provided market exclusivity to generic drugs.\n\nPromoted research and innovation in healthcare to ensure that American patients have access to the best treatment in the world.\n\nSigned first-ever executive order to affirm that it is the official policy of the United States Government to protect patients with pre-existing conditions.\n\nPassed Right To Try to give terminally ill patients access to lifesaving cures.\n\nSigned an executive order to fight kidney disease with more transplants and better treatment.\n\nSigned into law a $1 billion increase in funding for critical Alzheimer’s research.\n\nAccelerated medical breakthroughs in genetic treatments for Sickle Cell disease.\n\nFinalized the interoperability rules that will give American patients access to their electronic health records on their phones.\n\nInitiated an effort to provide $500 million over the next decade to improve pediatric cancer research.\n\nLaunched a campaign to end the HIV/AIDS epidemic in America in the next decade.\n\nStarted a program to provide the HIV prevention drug PrEP to uninsured patients for free.\n\nSigned an executive order and awarded new development contracts to modernize the influenza vaccine.\n\nProtected our Nation’s seniors by safeguarding and strengthening Medicare.\n\nUpdated the way Medicare pays for innovative medical products to ensure beneficiaries have access to the latest innovation and treatment.\n\nReduced improper payments for Medicare an estimated $15 billion since 2016 protecting taxpayer dollars and leading to less fraud, waste, and abuse.\n\nTook rapid action to combat antimicrobial resistance and secure access to life-saving new antibiotic drugs for American seniors, by removing several financial disincentives and setting policies to reduce inappropriate use.\n\nLaunched new online tools, including eMedicare, Blue Button 2.0, and Care Compare, to help seniors see what is covered, compare costs, streamline data, and compare tools available on Medicare.gov.\n\nProvided new Medicare Advantage supplemental benefits, including modifications to help keep seniors safe in their homes, respite care for caregivers, non-opioid pain management alternatives like therapeutic massages, transportation, and more in-home support services and assistance.\n\nProtected Medicare beneficiaries by removing Social Security numbers from all Medicare cards, a project completed ahead of schedule.\n\nUnleashed unprecedented transparency in Medicare and Medicaid data to spur research and innovation.\n\nRemaking the Federal Judiciary\n\nAppointed a historic number of Federal judges who will interpret the Constitution as written.\n\nNominated and confirmed over 230 Federal judges.\n\nConfirmed 54 judges to the United States Courts of Appeals, making up nearly a third of the entire appellate bench.\n\nFilled all Court of Appeals vacancies for the first time in four decades.\n\nFlipped the Second, Third, and Eleventh Circuits from Democrat-appointed majorities to Republican-appointed majorities. And dramatically reshaped the long-liberal Ninth Circuit.\n\nAppointed three Supreme Court justices, expanding its conservative-appointed majority to 6-3.\n\nAppointed Justice Neil Gorsuch to replace Justice Antonin Scalia.\n\nAppointed Justice Brett Kavanaugh to replace Justice Anthony Kennedy.\n\nAppointed Justice Amy Coney Barrett to replace Justice Ruth Bader Ginsburg.\n\nAchieving a Secure Border\n\nSecured the Southern Border of the United States.\n\nBuilt over 400 miles of the world’s most robust and advanced border wall.\n\nIllegal crossings have plummeted over 87 percent where the wall has been constructed.\n\nDeployed nearly 5,000 troops to the Southern border. In addition, Mexico deployed tens of thousands of their own soldiers and national guardsmen to secure their side of the US-Mexico border.\n\nEnded the dangerous practice of Catch-and-Release, which means that instead of aliens getting released into the United States pending future hearings never to be seen again, they are detained pending removal, and then ultimately returned to their home countries.\n\nEntered into three historic asylum cooperation agreements with Honduras, El Salvador, and Guatemala to stop asylum fraud and resettle illegal migrants in third-party nations pending their asylum applications.\n\nEntered into a historic partnership with Mexico, referred to as the “Migrant Protection Protocols,” to safely return asylum-seekers to Mexico while awaiting hearings in the United States.\n\nFully enforced the immigration laws of the United States.\n\nSigned an executive order to strip discretionary Federal grant funding from deadly sanctuary cities.\n\nFully enforced and implemented statutorily authorized “expedited removal” of illegal aliens.\n\nThe Department of Justice prosecuted a record-breaking number of immigration-related crimes.\n\nUsed Section 243(d) of the Immigration and Nationality Act (INA) to reduce the number of aliens coming from countries whose governments refuse to accept their nationals who were ordered removed from the United States.\n\nEnded asylum fraud, shut down human smuggling traffickers, and solved the humanitarian crisis across the Western Hemisphere.\n\nSuspended, via regulation, asylum for aliens who had skipped previous countries where they were eligible for asylum but opted to “forum shop” and continue to the United States.\n\nSafeguarded migrant families, and protected migrant safety, by promulgating new regulations under the Flores Settlement Agreement.\n\nProposed regulations to end the practice of giving free work permits to illegal aliens lodging meritless asylum claims.\n\nIssued “internal relocation” guidance.\n\nCross-trained United States Border Patrol agents to conduct credible fear screenings alongside USCIS (United States Citizenship and Immigration Services) adjudication personnel to reduce massive backlogs.\n\nStreamlined and expedited the asylum hearing process through both the Prompt Asylum Claim Review (PACR) and the Humanitarian Asylum Review Process (HARP).\n\nLaunched the Family Fraud Initiative to identify hundreds of individuals who were fraudulently presenting themselves as family units at the border, oftentimes with trafficking children, in order to ensure child welfare.\n\nImproved screening in countries with high overstay rates and reduced visa overstay rates in many of these countries.\n\nRemoved bureaucratic constraints on United States consular officers that reduced their ability to appropriately vet visa applicants.\n\nWorked with Mexico and other regional partners to dismantle the human smuggling networks in our hemisphere that profit from human misery and fuel the border crisis by exploiting vulnerable populations.\n\nSecured our Nation’s immigration system against criminals and terrorists.\n\nInstituted national security travel bans to keep out terrorists, jihadists, and violent extremists, and implemented a uniform security and information-sharing baseline all nations must meet in order for their nationals to be able to travel to, and emigrate to, the United States.\n\nSuspended refugee resettlement from the world’s most dangerous and terror-afflicted regions.\n\nRebalanced refugee assistance to focus on overseas resettlement and burden-sharing.\n\n85 percent reduction in refugee resettlement.\n\nOverhauled badly-broken refugee security screening process.\n\nRequired the Department of State to consult with states and localities as part of the Federal government’s refugee resettlement process.\n\nIssued strict sanctions on countries that have failed to take back their own nationals.\n\nEstablished the National Vetting Center, which is the most advanced and comprehensive visa screening system anywhere in the world.\n\nProtected American workers and taxpayers.\n\nIssued a comprehensive “public charge” regulation to ensure newcomers to the United States are financially self-sufficient and not reliant on welfare.\n\nCreated an enforcement mechanism for sponsor repayment and deeming, to ensure that people who are presenting themselves as sponsors are actually responsible for sponsor obligations.\n\nIssued regulations to combat the horrendous practice of “birth tourism.”\n\nIssued a rule with the Department of Housing and Urban Development (HUD) to make illegal aliens ineligible for public housing.\n\nIssued directives requiring Federal agencies to hire United States workers first and prioritizing the hiring of United States workers wherever possible.\n\nSuspended the entry of low-wage workers that threaten American jobs.\n\nFinalized new H-1B regulations to permanently end the displacement of United States workers and modify the administrative tools that are required for H-1B visa issuance.\n\nDefended United States sovereignty by withdrawing from the United Nations’ Global Compact on Migration.\n\nSuspended Employment Authorization Documents for aliens who arrive illegally between ports of entry and are ordered removed from the United States.\n\nRestored integrity to the use of Temporary Protected Status (TPS) by strictly adhering to the statutory conditions required for TPS.\n\nRestoring American Leadership Abroad\n\nRestored America’s leadership in the world and successfully negotiated to ensure our allies pay their fair share for our military protection.\n\nSecured a $400 billion increase in defense spending from NATO (North Atlantic Treaty Organization) allies by 2024, and the number of members meeting their minimum obligations more than doubled.\n\nCredited by Secretary General Jens Stoltenberg for strengthening NATO.\n\nWorked to reform and streamline the United Nations (UN) and reduced spending by $1.3 billion.\n\nAllies, including Japan and the Republic of Korea, committed to increase burden-sharing.\n\nProtected our Second Amendment rights by announcing the United States will never ratify the UN Arms Trade Treaty.\n\nReturned 56 hostages and detainees from more than 24 countries.\n\nWorked to advance a free and open Indo-Pacific region, promoting new investments and expanding American partnerships.\n\nAdvanced peace through strength.\n\nWithdrew from the horrible, one-sided Iran Nuclear Deal and imposed crippling sanctions on the Iranian Regime.\n\nConducted vigorous enforcement on all sanctions to bring Iran’s oil exports to zero and deny the regime its principal source of revenue.\n\nFirst president to meet with a leader of North Korea and the first sitting president to cross the demilitarized zone into North Korea.\n\nMaintained a maximum pressure campaign and enforced tough sanctions on North Korea while negotiating de-nuclearization, the release of American hostages, and the return of the remains of American heroes.\n\nBrokered economic normalization between Serbia and Kosovo, bolstering peace in the Balkans.\n\nSigned the Honk Kong Autonomy Act and ended the United States’ preferential treatment with Hong Kong to hold China accountable for its infringement on the autonomy of Hong Kong.\n\nLed allied efforts to defeat the Chinese Communist Party’s efforts to control the international telecommunications system.\n\nRenewed our cherished friendship and alliance with Israel and took historic action to promote peace in the Middle East.\n\nRecognized Jerusalem as the true capital of Israel and quickly moved the American Embassy in Israel to Jerusalem.\n\nAcknowledged Israel’s sovereignty over the Golan Heights and declared that Israeli settlements in the West Bank are not inconsistent with international law.\n\nRemoved the United States from the United Nations Human Rights Council due to the group’s blatant anti-Israel bias.\n\nBrokered historic peace agreements between Israel and Arab-Muslim countries, including the United Arab Emirates, the Kingdom of Bahrain, and Sudan.\n\nIn addition, the United States negotiated a normalization agreement between Israel and Morocco, and recognized Moroccan Sovereignty over the entire Western Sahara, a position with long standing bipartisan support.\n\nBrokered a deal for Kosovo to normalize ties and establish diplomatic relations with Israel.\n\nAnnounced that Serbia would move its embassy in Israel to Jerusalem.\n\nFirst American president to address an assembly of leaders from more than 50 Muslim nations, and reach an agreement to fight terrorism in all its forms.\n\nEstablished the Etidal Center to combat terrorism in the Middle East in conjunction with the Saudi Arabian Government.\n\nAnnounced the Vision for Peace Political Plan – a two-state solution that resolves the risks of Palestinian statehood to Israel’s security, and the first time Israel has agreed to a map and a Palestinian state.\n\nReleased an economic plan to empower the Palestinian people and enhance Palestinian governance through historic private investment.\n\nStood up against Communism and Socialism in the Western Hemisphere.\n\nReversed the previous Administration’s disastrous Cuba policy, canceling the sellout deal with the Communist Castro dictatorship.\n\nPledged not to lift sanctions until all political prisoners are freed; freedoms of assembly and expression are respected; all political parties are legalized; and free elections are scheduled.\n\nEnacted a new policy aimed at preventing American dollars from funding the Cuban regime, including stricter travel restrictions and restrictions on the importation of Cuban alcohol and tobacco.\n\nImplemented a cap on remittances to Cuba.\n\nEnabled Americans to file lawsuits against persons and entities that traffic in property confiscated by the Cuban regime.\n\nFirst world leader to recognize Juan Guaido as the Interim President of Venezuela and led a diplomatic coalition against the Socialist Dictator of Venezuela, Nicolas Maduro.\n\nBlocked all property of the Venezuelan Government in the jurisdiction of the United States.\n\nCut off the financial resources of the Maduro regime and sanctioned key sectors of the Venezuelan economy exploited by the regime.\n\nBrought criminal charges against Nicolas Maduro for his narco-terrorism.\n\nImposed stiff sanctions on the Ortega regime in Nicaragua.\n\nJoined together with Mexico and Canada in a successful bid to host the 2026 FIFA World Cup, with 60 matches to be held in the United States.\n\nWon bid to host the 2028 Summer Olympics in Los Angeles, California.\n\nColossal Rebuilding of the Military\n\nRebuilt the military and created the Sixth Branch, the United States Space Force.\n\nCompletely rebuilt the United States military with over $2.2 trillion in defense spending, including $738 billion for 2020.\n\nSecured three pay raises for our service members and their families, including the largest raise in a decade.\n\nEstablished the Space Force, the first new branch of the United States Armed Forces since 1947.\n\nModernized and recapitalized our nuclear forces and missile defenses to ensure they continue to serve as a strong deterrent.\n\nUpgraded our cyber defenses by elevating the Cyber Command into a major warfighting command and by reducing burdensome procedural restrictions on cyber operations.\n\nVetoed the FY21 National Defense Authorization Act, which failed to protect our national security, disrespected the history of our veterans and military, and contradicted our efforts to put America first.\n\nDefeated terrorists, held leaders accountable for malign actions, and bolstered peace around the world.\n\nDefeated 100 percent of ISIS’ territorial caliphate in Iraq and Syria.\n\nFreed nearly 8 million civilians from ISIS’ bloodthirsty control, and liberated Mosul, Raqqa, and the final ISIS foothold of Baghuz.\n\nKilled the leader of ISIS, Abu Bakr al-Baghdadi, and eliminated the world’s top terrorist, Qasem Soleimani.\n\nCreated the Terrorist Financing Targeting Center (TFTC) in partnership between the United States and its Gulf partners to combat extremist ideology and threats, and target terrorist financial networks, including over 60 terrorist individuals and entities spanning the globe.\n\nTwice took decisive military action against the Assad regime in Syria for the barbaric use of chemical weapons against innocent civilians, including a successful 59 Tomahawk cruise missiles strike.\n\nAuthorized sanctions against bad actors tied to Syria’s chemical weapons program.\n\nNegotiated an extended ceasefire with Turkey in northeast Syria.\n\nAddressed gaps in American’s defense-industrial base, providing much-needed updates to improve the safety of our country.\n\nProtected America’s defense-industrial base, directing the first whole-of-government assessment of our manufacturing and defense supply chains since the 1950s.\n\nTook decisive steps to secure our information and communications technology and services supply chain, including unsafe mobile applications.\n\nCompleted several multi-year nuclear material removal campaigns, securing over 1,000 kilograms of highly enriched uranium and significantly reducing global nuclear threats.\n\nSigned an executive order directing Federal agencies to work together to diminish the capability of foreign adversaries to target our critical electric infrastructure.\n\nEstablished a whole-of-government strategy addressing the threat posed by China’s malign efforts targeting the United States taxpayer-funded research and development ecosystem.\n\nAdvanced missile defense capabilities and regional alliances.\n\nBolstered the ability of our allies and partners to defend themselves through the sale of aid and military equipment.\n\nSigned the largest arms deal ever, worth nearly $110 billion, with Saudi Arabia.\n\nServing and Protecting Our Veterans\n\nReformed the Department of Veterans Affairs (VA) to improve care, choice, and employee accountability.\n\nSigned and implemented the VA Mission Act, which made permanent Veterans CHOICE, revolutionized the VA community care system, and delivered quality care closer to home for Veterans.\n\nThe number of Veterans who say they trust VA services has increased 19 percent to a record 91 percent, an all-time high.\n\nOffered same-day emergency mental health care at every VA medical facility, and secured $9.5 billion for mental health services in 2020.\n\nSigned the VA Choice and Quality Employment Act of 2017, which ensured that veterans could continue to see the doctor of their choice and wouldn’t have to wait for care.\n\nDuring the Trump Administration, millions of veterans have been able to choose a private doctor in their communities.\n\nExpanded Veterans’ ability to access telehealth services, including through the “Anywhere to Anywhere” VA healthcare initiative leading to a 1000 percent increase in usage during COVID-19.\n\nSigned the Veterans Affairs Accountability and Whistleblower Protection Act and removed thousands of VA workers who failed to give our Vets the care they have so richly deserve.\n\nSigned the Veterans Appeals Improvement and Modernization Act of 2017 and improved the efficiency of the VA, setting record numbers of appeals decisions.\n\nModernized medical records to begin a seamless transition from the Department of Defense to the VA.\n\nLaunched a new tool that provides Veterans with online access to average wait times and quality-of-care data.\n\nThe promised White House VA Hotline has fielded hundreds of thousands of calls.\n\nFormed the PREVENTS Task Force to fight the tragedy of Veteran suicide.\n\nDecreased veteran homelessness, improved education benefits, and achieved record-low veteran unemployment.\n\nSigned and implemented the Forever GI Bill, allowing Veterans to use their benefits to get an education at any point in their lives.\n\nEliminated every penny of Federal student loan debt owed by American veterans who are completely and permanently disabled.\n\nCompared to 2009, 49 percent fewer veterans experienced homelessness nationwide during 2019.\n\nSigned and implemented the HAVEN Act to ensure that Veterans who’ve declared bankruptcy don’t lose their disability payments.\n\nHelped hundreds of thousands of military service members make the transition from the military to the civilian workforce, and developed programs to support the employment of military spouses.\n\nPlaced nearly 40,000 homeless veterans into employment through the Homeless Veterans Reintegration Program.\n\nPlaced over 600,000 veterans into employment through American Job Center services.\n\nEnrolled over 500,000 transitioning service members in over 20,000 Department of Labor employment workshops.\n\nSigned an executive order to help Veterans transition seamlessly into the United States Merchant Marine.\n\nMaking Communities Safer\n\nSigned into law landmark criminal justice reform.\n\nSigned the bipartisan First Step Act into law, the first landmark criminal justice reform legislation ever passed to reduce recidivism and help former inmates successfully rejoin society.\n\nPromoted second chance hiring to give former inmates the opportunity to live crime-free lives and find meaningful employment.\n\nLaunched a new “Ready to Work” initiative to help connect employers directly with former prisoners.\n\nAwarded $2.2 million to states to expand the use of fidelity bonds, which underwrite companies that hire former prisoners.\n\nReversed decades-old ban on Second Chance Pell programs to provide postsecondary education to individuals who are incarcerated expand their skills and better succeed in the workforce upon re-entry.\n\nAwarded over $333 million in Department of Labor grants to nonprofits and local and state governments for reentry projects focused on career development services for justice-involved youth and adults who were formerly incarcerated.\n\nUnprecedented support for law-enforcement.\n\nIn 2019, violent crime fell for the third consecutive year.\n\nSince 2016, the violent crime rate has declined over 5 percent and the murder rate has decreased by over 7 percent.\n\nLaunched Operation Legend to combat a surge of violent crime in cities, resulting in more than 5,500 arrests.\n\nDeployed the National Guard and Federal law enforcement to Kenosha to stop violence and restore public safety.\n\nProvided $1 million to Kenosha law enforcement, nearly $4 million to support small businesses in Kenosha, and provided over $41 million to support law enforcement to the state of Wisconsin.\n\nDeployed Federal agents to save the courthouse in Portland from rioters.\n\nSigned an executive order outlining ten-year prison sentences for destroying Federal property and monuments.\n\nDirected the Department of Justice (DOJ) to investigate and prosecute Federal offenses related to ongoing violence.\n\nDOJ provided nearly $400 million for new law enforcement hiring.\n\nEndorsed by the 355,000 members of the Fraternal Order of Police.\n\nRevitalized Project Safe Neighborhoods, which brings together Federal, state, local, and tribal law enforcement officials to develop solutions to violent crime.\n\nImproved first-responder communications by deploying the FirstNet National Public Safety Broadband Network, which serves more than 12,000 public safety agencies across the Nation.\n\nEstablished a new commission to evaluate best practices for recruiting, training, and supporting law enforcement officers.\n\nSigned the Safe Policing for Safe Communities executive order to incentive local police department reforms in line with law and order.\n\nMade hundreds of millions of dollars’ worth of surplus military equipment available to local law enforcement.\n\nSigned an executive order to help prevent violence against law enforcement officers.\n\nSecured permanent funding for the 9/11 Victim Compensation Fund for first responders.\n\nImplemented strong measures to stem hate crimes, gun violence, and human trafficking.\n\nSigned an executive order making clear that Title VI of the Civil Rights Act of 1964 applies to discrimination rooted in anti-Semitism.\n\nLaunched a centralized website to educate the public about hate crimes and encourage reporting.\n\nSigned the Fix NICS Act to keep guns out of the hands of dangerous criminals.\n\nSigned the STOP School Violence Act and created a Commission on School Safety to examine ways to make our schools safer.\n\nLaunched the Foster Youth to Independence initiative to prevent and end homelessness among young adults under the age of 25 who are in, or have recently left, the foster care system.\n\nSigned the Trafficking Victims Protection Reauthorization Act, which tightened criteria for whether countries are meeting standards for eliminating trafficking.\n\nEstablished a task force to help combat the tragedy of missing or murdered Native American women and girls.\n\nPrioritized fighting for the voiceless and ending the scourge of human trafficking across the Nation, through a whole of government back by legislation, executive action, and engagement with key industries.\n\nCreated the first-ever White House position focused solely on combating human trafficking.\n\nCherishing Life and Religious Liberty\n\nSteadfastly supported the sanctity of every human life and worked tirelessly to prevent government funding of abortion.\n\nReinstated and expanded the Mexico City Policy, ensuring that taxpayer money is not used to fund abortion globally.\n\nIssued a rule preventing Title X taxpayer funding from subsiding the abortion industry.\n\nSupported legislation to end late-term abortions.\n\nCut all funding to the United Nations population fund due to the fund’s support for coercive abortion and forced sterilization.\n\nSigned legislation overturning the previous administration’s regulation that prohibited states from defunding abortion facilities as part of their family planning programs.\n\nFully enforced the requirement that taxpayer dollars do not support abortion coverage in Obamacare exchange plans.\n\nStopped the Federal funding of fetal tissue research.\n\nWorked to protect healthcare entities and individuals’ conscience rights – ensuring that no medical professional is forced to participate in an abortion in violation of their beliefs.\n\nIssued an executive order reinforcing requirement that all hospitals in the United States provide medical treatment or an emergency transfer for infants who are in need of emergency medical care—regardless of prematurity or disability.\n\nLed a coalition of countries to sign the Geneva Consensus Declaration, declaring that there is no international right to abortion and committing to protecting women’s health.\n\nFirst president in history to attend the March for Life.\n\nStood up for religious liberty in the United States and around the world.\n\nProtected the conscience rights of doctors, nurses, teachers, and groups like the Little Sisters of the Poor.\n\nFirst president to convene a meeting at the United Nations to end religious persecution.\n\nEstablished the White House Faith and Opportunity Initiative.\n\nStopped the Johnson Amendment from interfering with pastors’ right to speak their minds.\n\nReversed the previous administration’s policy that prevented the government from providing disaster relief to religious organizations.\n\nProtected faith-based adoption and foster care providers, ensuring they can continue to serve their communities while following the teachings of their faith.\n\nReduced burdensome barriers to ensure Native Americans are free to keep spiritually and culturally significant eagle feathers found on their tribal lands.\n\nTook action to ensure Federal employees can take paid time off work to observe religious holy days.\n\nSigned legislation to assist religious and ethnic groups targeted by ISIS for mass murder and genocide in Syria and Iraq.\n\nDirected American assistance toward persecuted communities, including through faith-based programs.\n\nLaunched the International Religious Freedom Alliance – the first-ever alliance devoted to confronting religious persecution around the world.\n\nAppointed a Special Envoy to monitor and combat anti-Semitism.\n\nImposed restrictions on certain Chinese officials, internal security units, and companies for their complicity in the persecution of Uighur Muslims in Xinjiang.\n\nIssued an executive order to protect and promote religious freedom around the world.\n\nSafeguarding the Environment\n\nTook strong action to protect the environment and ensure clean air and clean water.\n\nTook action to protect vulnerable Americans from being exposed to lead and copper in drinking water and finalized a rule protecting children from lead-based paint hazards.\n\nInvested over $38 billion in clean water infrastructure.\n\nIn 2019, America achieved the largest decline in carbon emissions of any country on earth. Since withdrawing from the Paris Climate Accord, the United States has reduced carbon emissions more than any nation.\n\nAmerican levels of particulate matter – one of the main measures of air pollution – are approximately five times lower than the global average.\n\nBetween 2017 and 2019, the air became 7 percent cleaner – indicated by a steep drop in the combined emissions of criteria pollutants.\n\nLed the world in greenhouse gas emissions reductions, having cut energy-related CO2 emissions by 12 percent from 2005 to 2018 while the rest of the world increased emissions by 24 percent.\n\nIn FY 2019 the Environmental Protection Agency (EPA) cleaned up more major pollution sites than any year in nearly two decades.\n\nThe EPA delivered $300 million in Brownfields grants directly to communities most in need including investment in 118 Opportunity Zones.\n\nPlaced a moratorium on offshore drilling off the coasts of Georgia, North Carolina, South Carolina, and Florida.\n\nRestored public access to Federal land at Bears Ears National Monument and Grand Staircase-Escalante National Monument.\n\nRecovered more endangered or threatened species than any other administration in its first term.\n\nSecured agreements and signed legislation to protect the environment and preserve our Nation’s abundant national resources.\n\nThe USMCA guarantees the strongest environmental protections of any trade agreement in history.\n\nSigned the Save Our Seas Act to protect our environment from foreign nations that litter our oceans with debris and developed the first-ever Federal strategic plan to address marine litter.\n\nSigned the Great American Outdoors Act, securing the single largest investment in America’s National Parks and public lands in history.\n\nSigned the largest public lands legislation in a decade, designating 1.3 million new acres of wilderness.\n\nSigned a historic executive order promoting much more active forest management to prevent catastrophic wildfires.\n\nOpened and expanded access to over 4 million acres of public lands for hunting and fishing.\n\nJoined the One Trillion Trees Initiative to plant, conserve, and restore trees in America and around the world.\n\nDelivered infrastructure upgrades and investments for numerous projects, including over half a billion dollars to fix the Herbert Hoover Dike and expanding funding for Everglades restoration by 55 percent.\n\nExpanding Educational Opportunity\n\nFought tirelessly to give every American access to the best possible education.\n\nThe Tax Cuts and Jobs Act expanded School Choice, allowing parents to use up to $10,000 from a 529 education savings account to cover K-12 tuition costs at the public, private, or religious school of their choice.\n\nLaunched a new pro-American lesson plan for students called the 1776 Commission to promote patriotic education.\n\nProhibited the teaching of Critical Race Theory in the Federal government.\n\nEstablished the National Garden of American Heroes, a vast outdoor park that will feature the statues of the greatest Americans to ever live.\n\nCalled on Congress to pass the Education Freedom Scholarships and Opportunity Act to expand education options for 1 million students of all economic backgrounds.\n\nSigned legislation reauthorizing the D.C. Opportunity Scholarship program.\n\nIssued updated guidance making clear that the First Amendment right to Free Exercise of Religion does not end at the door to a public school.\n\nTook action to promote technical education.\n\nSigned into law the Strengthening Career and Technical Education for the 21st Century Act, which provides over 13 million students with high-quality vocational education and extends more than $1.3 billion each year to states for critical workforce development programs.\n\nSigned the INSPIRE Act which encouraged NASA to have more women and girls participate in STEM and seek careers in aerospace.\n\nAllocated no less than $200 million each year in grants to prioritize women and minorities in STEM and computer science education.\n\nDrastically reformed and modernized our educational system to restore local control and promote fairness.\n\nRestored state and local control of education by faithfully implementing the Every Student Succeeds Act.\n\nSigned an executive order that ensures public universities protect First Amendment rights or they will risk losing funding, addresses student debt by requiring colleges to share a portion of the financial risk, and increases transparency by requiring universities to disclose information about the value of potential educational programs.\n\nIssued a rule strengthening Title IX protections for survivors of sexual misconduct in schools, and that – for the first time in history – codifies that sexual harassment is prohibited under Title IX.\n\nNegotiated historic bipartisan agreement on new higher education rules to increase innovation and lower costs by reforming accreditation, state authorization, distance education, competency-based education, credit hour, religious liberty, and TEACH Grants.\n\nPrioritized support for Historically Black Colleges and Universities.\n\nMoved the Federal Historically Black Colleges and Universities (HBCU) Initiative back to the White House.\n\nSigned into law the FUTURE Act, making permanent $255 million in annual funding for HBCUs and increasing funding for the Federal Pell Grant program.\n\nSigned legislation that included more than $100 million for scholarships, research, and centers of excellence at HBCU land-grant institutions.\n\nFully forgave $322 million in disaster loans to four HBCUs in 2018, so they could fully focus on educating their students.\n\nEnabled faith-based HBCUs to enjoy equal access to Federal support.\n\nCombatting the Opioid Crisis\n\nBrought unprecedented attention and support to combat the opioid crisis.\n\nDeclared the opioid crisis a nationwide public health emergency.\n\nSecured a record $6 billion in new funding to combat the opioid epidemic.\n\nSigned the SUPPORT for Patients and Communities Act, the largest-ever legislative effort to address a drug crisis in our Nation’s history.\n\nLaunched the Initiative to Stop Opioid Abuse and Reduce Drug Supply and Demand in order to confront the many causes fueling the drug crisis.\n\nThe Department of Health and Human Services (HHS) awarded a record $9 billion in grants to expand access to prevention, treatment, and recovery services to States and local communities.\n\nPassed the CRIB Act, allowing Medicaid to help mothers and their babies who are born physically dependent on opioids by covering their care in residential pediatric recovery facilities.\n\nDistributed $1 billion in grants for addiction prevention and treatment.\n\nAnnounced a Safer Prescriber Plan that seeks to decrease the amount of opioids prescriptions filled in America by one third within three years.\n\nReduced the total amount of opioids prescriptions filled in America.\n\nExpanded access to medication-assisted treatment and life-saving Naloxone.\n\nLaunched FindTreatment.gov, a tool to find help for substance abuse.\n\nDrug overdose deaths fell nationwide in 2018 for the first time in nearly three decades.\n\nLaunched the Drug-Impaired Driving Initiative to work with local law enforcement and the driving public at large to increase awareness.\n\nLaunched a nationwide public ad campaign on youth opioid abuse that reached 58 percent of young adults in America.\n\nSince 2016, there has been a nearly 40 percent increase in the number of Americans receiving medication-assisted treatment.\n\nApproved 29 state Medicaid demonstrations to improve access to opioid use disorder treatment, including new flexibility to cover inpatient and residential treatment.\n\nApproved nearly $200 million in grants to address the opioid crisis in severely affected communities and to reintegrate workers in recovery back into the workforce.\n\nTook action to seize illegal drugs and punish those preying on innocent Americans.", "images": ["https://trumpwhitehouse.archives.gov/wp-content/themes/whitehouse/assets/img/close.svg", "https://www.archives.gov/nara-banner/nara-logo-eagle.svg", "https://trumpwhitehouse.archives.gov/wp-content/themes/whitehouse/assets/img/presidential-crest-gray.svg", "https://usweekly.com/favicon.ico?ver=e6935da6", "https://trumpwhitehouse.archives.gov/wp-content/themes/whitehouse/assets/img/hamburger.svg", "https://trumpwhitehouse.archives.gov/wp-content/themes/whitehouse/assets/img/search.svg"], "top_img": "https://usweekly.com/favicon.ico?ver=e6935da6", "keywords": [], "authors": [], "canonical_link": "https://trumpwhitehouse.archives.gov/trump-administration-accomplishments/", "title": "Trump Administration Accomplishments – The White House", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "max-image-preview:large", "apple-mobile-web-app-title": "The White House", "application-name": "The White House", "msapplication-TileColor": "#0c2644", "theme-color": "#f5f5f5"}, "movies": [], "publish_date": null, "source": "https://usweekly.com", "summary": ""}