{"url": "https://www.inquisitr.com/4820883/watch-kelly-ripa-hilariously-audition-for-american-idol/", "text": "Kelly Ripa may have been brightening America’s morning on Live since 2001, but it turns out the former soap actress has another career in mind – kind of. The star recently tried her hand at singing in a hilarious new segment for Live with Kelly and Ryan where she tried her hand at becoming the next Carrie Underwood or Kelly Clarkson.\n\nFollowing in the footsteps of Today’s Hoda Kotb and Kathie Lee Gifford after they auditioned for The Voice , E! News reported that Ripa headed to the American Idol audition room to show off her vocal skills in a new clip , performing for judges Luke Bryan, Lionel Richie, and Katy Perry.\n\nThe hilarious clip shows Ripa giving her best singing performance for the trio as she joked before heading into the room, “I don’t think they’ve mentally prepared for what I have to offer” after claiming on the March 9 episode of Live that she has “the voice of an angel.”\n\nAfter getting a pep talk from her Live co-host, who’s also presented American Idol since it first began back in 2002, Ripa made her way to audition and even asked Lionel to hold up her lyrics on a huge board so she didn’t forget the words.\n\nThe star then launched into a unique performance of Peggy Lee’s “Why Don’t You Do Right?” as the judges watched on.\n\nFollowing her audition, Katy told Kelly that she thought her performance was “different” as Lionel awkwardly complimented the host on how she connected with the words of the song.\n\nOther comments from the new trio of judges included describing Ripa’s audition as “special,” “spunky,” and “interesting.”\n\n“I don’t really know how to describe it, so I’m just going to leave it at that,” Katy then told Kelly after seeing her American Idol Season 16 audition.\n\nBut while it’s safe to say that her American Idol audition inspired some mixed and confused reactions, Kelly did in fact land herself a golden ticket as the judges uttered the show’s infamous line by telling the star that she was “going to Hollywood.” Ryan – who Kelly recently defended amid an allegation of sexual misconduct – then celebrated his co-host’s big win with the crew outside the audition room.\n\nBut while Ripa probably won’t be taking her singing career much further despite making it through to the next round, the morning host has made no secret of her love of the competition show in the past.\n\nBack in May 2017, Ripa urged Seacrest to return as the show’s host after it was announced that the series would be returning to TV after leaving Fox in 2016.\n\nSpeaking about the series’ much-anticipated return before it was confirmed that Ryan would be taking back his hosting duties, Variety reported that Kelly joked on Live with Kelly and Ryan that she went into seclusion after it was announced that the show had been canceled because she was such a fan.\n\nShe then urged Ryan to return to the show shortly before ABC confirmed that the star would be back to his former role.\n\nAmerican Idol is set to debut its very first season on ABC, its 16th season overall, on March 11.", "images": ["https://www.inquisitr.com/wp-content/uploads/2025/10/2421769f-57a4-4bff-913f-cf316747493e.jpg", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20500%20157'%3E%3C/svg%3E", "https://secure.gravatar.com/avatar/673ddaf526e964d15376329334d8a5b2?s=120&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20492%20142'%3E%3C/svg%3E", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo-white.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/inquisitr-logo.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent-Dark-Mode.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20120%20120'%3E%3C/svg%3E"], "top_img": "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "keywords": [], "authors": ["News Writer"], "canonical_link": "https://www.inquisitr.com/watch-kelly-ripa-hilariously-audition-for-american-idol", "title": "Watch Kelly Ripa Hilariously Audition For ‘American Idol’", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "https://www.inquisitr.com/wp-content/uploads/2024/12/favicon.png", "description": "Kelly Ripa may have been brightening America’s morning on Live since 2001, but it turns out the former soap actress has another career in mind – kind of. The", "robots": "follow, index, max-snippet:-1, max-video-preview:-1, max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Watch Kelly Ripa Hilariously Audition For ‘American Idol’ - Inquisitr News", "description": "Kelly Ripa may have been brightening America’s morning on Live since 2001, but it turns out the former soap actress has another career in mind – kind of. The", "url": "https://www.inquisitr.com/watch-kelly-ripa-hilariously-audition-for-american-idol", "site_name": "Inquisitr News"}, "article": {"tag": "ryan seacrest", "section": "Entertainment", "published_time": "2018-03-10T05:57:00-05:00"}, "twitter": {"card": "summary_large_image", "title": "Watch Kelly Ripa Hilariously Audition For ‘American Idol’ - Inquisitr News", "description": "Kelly Ripa may have been brightening America’s morning on Live since 2001, but it turns out the former soap actress has another career in mind – kind of. The", "site": "@theinquisitr", "creator": "@theinquisitr"}, "generator": "WP Rocket 3.18.3"}, "movies": [], "publish_date": 1520679420.0, "source": "https://www.inquisitr.com", "summary": ""}