{"url": "https://en.wikipedia.org/wiki/List_of_Olympic_medalists_in_figure_skating", "text": "Figure skating has been part of the Olympic Games since 1908 and has been included in 26 Olympic Games. There have been 286 medals (96 gold, 95 silver, and 95 bronze) awarded to figure skaters representing 29 representing National Olympic Committees. Six events have been contested but one, men's special figures, was discontinued after a single Olympics.\n\nCanadian ice dancers Tessa Virtue and Scott Moir are the only figure skaters to win five Olympic medals (three gold medals and two silver medals). Swedish figure skater Gillis Grafström and Russian figure skater Evgeni Plushenko have each won four medals. The only skaters with three consecutive titles are Grafström in men's singles, Sonja Henie for Norway in women's singles, and Irina Rodnina from the Soviet Union in pair skating. American Nathan Chen, and Canadians Tessa Virtue and Scott Moir, are the only skaters to win two gold medals in the same Olympics.\n\nOn two occasions, there has been a podium sweep. Russian figure skaters hold the unique record of having won gold medals in all six Olympic figure skating events.\n\nMedalists [ edit ]\n\nMen's singles [ edit ]\n\nMen's special figures [ edit ]\n\nNikolai Panin of Russia was the sole winner of the Olympic special figures event.\n\nMen's special figures was only included in one Olympic Games before being discontinued. The sole winner of the event was Russian Nikolai Panin, who gave his country its first ever Olympic gold medal.[27]\n\nWomen's singles [ edit ]\n\nPairs [ edit ]\n\nAt the 1964 Olympics, Marika Kilius and Hans-Jürgen Bäumler of Germany, Debbi Wilkes and Guy Revell of Canada, and Vivian Joseph and Ronald Joseph of the United States placed second, third, and fourth, respectively. Two years later, Kilius and Bäumler's results were invalidated because the pair had signed a professional contract before the Olympics. The silver medals were re-allocated to Wilkes and Revell and the bronze medals to Joseph and Joseph. However, in 1987, the German team was re-awarded their silver medals after an appeal. In November 2014, the International Olympic Committee clarified that both the German and Canadian teams were the silver medalists, and the U.S. team were the bronze medalists.[55][56]\n\nAt the 2002 Olympics, a controversy in the pairs competition culminated in the French judge's scores being thrown out and the Canadian team of Jamie Salé and David Pelletier being awarded gold medals.[57] Additionally, the Russian team of Elena Berezhnaya and Anton Sikharulidze were allowed to keep their medals despite the allegations of vote swapping and buying of votes of the French judge. Judges from Russia, China, Poland, Ukraine, and France had placed the Russians first; judges from the United States, Canada, Germany, and Japan gave the nod to the Canadians. A scheme had been hatched whereby the French pairs judge had agreed to award the gold medal to the Russian team, while the Russian ice dance judge was to award the gold medal to the French ice dance team. The International Skating Union announced a day after the competition that it would conduct an \"internal assessment\" into the judging decision.[58] Marie-Reine Le Gougne, the French judge implicated in collusion, and Didier Gailhaguet, president of the French Federation of Ice Sports, were found guilty of misconduct and were suspended for three years and barred from officiating at the 2006 Winter Olympics.[59]\n\nIce dance [ edit ]\n\nTeam event [ edit ]\n\nThe team event is the newest Olympic figure skating event, first contested in the 2014 Games. It combines the four Olympic figure skating disciplines (men's singles, women's singles, pairs, and ice dance) into a single event; gold is awarded to the team that earns the most placement points.\n\nThe results of the 2022 team event were fraught with controversy. The medal ceremony originally scheduled for February 8 was delayed over what International Olympic Committee (IOC) spokesperson Mark Adams described as a situation that required \"legal consultation\" with the International Skating Union.[99] Several media outlets reported that the issue was over a positive test from December 2021 that showed the presence of trimetazidine in a sample given by Kamila Valieva from the Russian Olympic Committee (ROC),[100][101] which was officially confirmed on February 11. The Russian Anti-Doping Agency (RUSADA), under suspension from the World Anti-Doping Agency (WADA) since 2015[102] for its years of serving solely to hide the positive doping results of Russian athletes,[103][104] cleared Valieva on February 9, a day after the December test results were released and two months after the test. The IOC, WADA, and the ISU appealed the RUSADA's decision.[105]\n\nOn February 14, the Court of Arbitration for Sport (CAS) ruled that Valieva be allowed to compete in the women's single event, stating that preventing her from competing \"would cause her irreparable harm in the circumstances\", although her gold medal in the team event was still under consideration. The favorable decision from the court was made in part due to her age, as minor athletes are subject to different rules than adult athletes.[106][107] The IOC announced that the medal ceremony would not take place until the investigation was over and there was a concrete decision whether to strip Russia of their medals.[108]\n\nOn January 29, 2024, the CAS disqualified Valieva for four years retroactive to December 25, 2021, for an anti-doping rule violation which they found her to have committed.[109] On January 30, 2024, the ISU, among other actions, re-allocated the medals in the figure skating team event, upgrading the United States and Japan to gold and silver, while downgrading the ROC to bronze.[110] By July 25, 2024, the CAS dismissed all of Russia's appeals of their January decision,[111] and on August 7, 2024, the American and Japanese teams were presented with their gold and silver medals at a ceremony held at the Champions Park, near the Eiffel Tower, during the 2024 Summer Olympics.[112]\n\nMultiple medals [ edit ]\n\nIce dancers Tessa Virtue and Scott Moir are the most decorated Olympic figure skaters in history with a total of five medals.\n\nIce dancers Marina Klimova and Sergei Ponomarenko won a bronze medal in 1984, improved to a silver in 1988, and capped their Olympic appearances with a gold in 1992.\n\nRussian ice dancers Oksana Grishuk and Evgeny Platov won the 1994 and 1998 Olympic titles.\n\nMost medals won [ edit ]\n\nSkaters who have won three or more Olympic medals are listed below.[116]\n\nMultiple gold medals [ edit ]\n\nSwedish Gillis Grafström is a three-time Olympic figure skating gold medalist in the men's singles event.\n\nThe only skaters with three consecutive titles are Gillis Grafström in men's singles, Sonja Henie in women's singles, and Irina Rodnina in pairs. The most consecutive titles in ice dance is two, which has only been achieved by Oksana Grishuk and Evgeny Platov. In addition, one women's singles skater, three men's singles skaters, and five pair skaters have earned consecutive titles. Two ice dancers and three pair skaters have earned non-consecutive titles.\n\nSix skaters have won Olympic gold medals in multiple events. Evgeni Plushenko won gold in men's singles in 2006 and team event gold in 2014. Tatiana Volosozhar and Maxim Trankov were the first skaters to win multiple events at a single Olympics, winning in both pairs and the team event. Tessa Virtue and Scott Moir matched this feat four years later, earning golds in ice dance and the team event. Nathan Chen won gold in both men's singles and the team event in 2022.\n\nMultiple medals by event [ edit ]\n\nSonja Henie and Karl Schäfer won a combined five Olympic titles.\n\nMen's singles [ edit ]\n\nKarl Schäfer won two Olympic gold medals in the men's competition in the 1930s.\n\nYuzuru Hanyu is one of only two skaters to win two gold medals in the men's competition after World War II.\n\nSkater Nation Olympics Total Sweden 1920, 1924,\n\n1928, 1932 3 1 0 4 Austria 1932, 1936 2 0 0 2 United States 1948, 1952 2 0 0 2 Japan 2014, 2018 2 0 0 2 Russia 2002, 2006,\n\n2010, 2014 1 2 0 3 United States 1956, 1960 1 0 1 2 Soviet Union\n\nUnified Team 1988, 1992 1 0 1 2 Austria 1924, 1928 0 2 0 2 Canada 1984, 1988 0 2 0 2 Canada 1994, 1998 0 2 0 2 Japan 2018, 2022 0 1 1 2 France 1968, 1972 0 0 2 2 France 1994, 1998 0 0 2 2\n\nWomen's singles [ edit ]\n\nNorwegian Sonja Henie won three consecutive gold medals in the women's individual event (1928–1936).\n\nKatarina Witt from East Germany won the 1988 women's singles gold medal, becoming the second female figure skater in history to win back-to-back Olympic titles.\n\nYuna Kim of South Korea won the women's singles event in 2010 with world record scores in the short program, free skating, and combined total.\n\nPairs [ edit ]\n\nIce dance [ edit ]\n\n^ Nikita Katsalapov won two medals in ice dance with two different partners: a bronze medal in 2014 with Elena Ilinykh and a silver medal in 2022 with Victoria Sinitsina\n\nMultiple disciplines [ edit ]\n\nOnly three skaters have won Olympic medals in multiple figure skating disciplines. All other multi-event medalists won medals in their discipline plus the team event (which, while being a separate event, is not considered its own skating discipline).\n\nIn 1908, Madge Syers became the first skater to medal in multiple figure skating disciplines at a single Olympics. The only skater to match this feat was Ernst Baier in 1936. The only other skater to medal in multiple disciplines was Beatrix Loughran who did so at separate Olympics.\n\nNo skater has won gold medals in multiple disciplines.\n\nSkater Nation Events Olympics Total Germany Men's singles 1936 0 1 0 2 Pairs 1 0 0 Great Britain Women's singles 1908 1 0 0 2 Pairs 0 0 1 United States Women's singles 1924, 1928 0 1 1 3 Pairs 1932 0 1 0\n\nSummer and Winter Olympics [ edit ]\n\nSince figure skating was held during the Summer Olympic Games in 1908 and 1920 before being moved to the Winter Olympic, three skaters won medals in figure skating at both the Summer and Winter Games.\n\nMen's singles skater Gillis Grafström's first gold medal was earned at the 1920 Summer Olympics. His other three medals were won at the 1924–1932 Winter Games. Pair skaters Ludowika Jakobsson and Walter Jakobsson also earned gold during the 1920 Summer Olympics. They later won medals at the 1924 Winter Games.\n\nCountry records [ edit ]\n\nWinning streak [ edit ]\n\nFrom 1964 to 2006, Russian figure skaters — representing the Soviet Union, the Unified Team, or Russia — won the gold medal in the pairs event, in what was the longest series of victories for one country in one winter event.[117]\n\nMost events won [ edit ]\n\nRussian figure skaters hold the unique record of having won gold medals in all six Olympic figure skating events. Since men's special figures was discontinued, this record cannot be matched.\n\nRussia is the only NOC to have won gold medals in all five current Olympic figure skating events. Canada has won gold medals in four events, while Great Britain, the Unified Team, and the United States have won gold medals in three events.\n\nRussia and the Unified Team are the only NOCs to have won three events at the same Olympics, at the 2014 Winter Olympics and the 1992 Winter Olympics respectively. No NOC has won more than three figure skating events at a single Olympics.\n\nPodium sweeps [ edit ]\n\nThere have been two podium sweeps in Olympic figure skating history, where skaters from one nation won all three medals in a single event.\n\nMedal totals by country [ edit ]\n\nUlrich Salchow of Sweden, creator of the Salchow jump, was the first Olympic champion in men's figure skating.\n\nCountries that no longer participate are indicated in italics with a dagger (†).\n\nMen's singles [ edit ]\n\nWomen's singles [ edit ]\n\nPairs [ edit ]\n\nIce dance [ edit ]\n\nRank Nation Gold Silver Bronze Total 1 Russia (RUS) † 3 3 2 8 Soviet Union (URS) † 3 3 2 8 3 France (FRA) 2 2 1 5 4 Canada (CAN) 2 1 1 4 5 United States (USA) 1 2 3 6 6 Great Britain (GBR) 1 0 1 2 Unified Team (EUN) † 1 0 1 2 8 Hungary (HUN) 0 1 0 1 ROC (ROC) † 0 1 0 1 10 Italy (ITA) 0 0 1 1 Ukraine (UKR) 0 0 1 1 Totals (11 entries) 13 13 13 39\n\nTeam event [ edit ]\n\nRank Nation Gold Silver Bronze Total 1 Canada (CAN) 1 1 0 2 2 United States (USA) 1 0 2 3 3 Russia (RUS) † 1 0 0 1 4 Japan (JPN) 0 1 0 1 Olympic Athletes from Russia (OAR) † 0 1 0 1 6 ROC (ROC) † 0 0 1 1 Totals (6 entries) 3 3 3 9\n\nSee also [ edit ]\n\nReferences [ edit ]\n\nGeneral\n\nSpecific", "images": ["https://upload.wikimedia.org/wikipedia/commons/5/5d/Flag_of_the_United_States_%2823px%29.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/Flag_of_Germany_%281867%E2%80%931918%29.svg/40px-Flag_of_Germany_%281867%E2%80%931918%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Flag_of_the_Czech_Republic.svg/40px-Flag_of_the_Czech_Republic.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Nikolai_Panin.jpg/250px-Nikolai_Panin.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Flag_of_Belgium_%28civil%29.svg/40px-Flag_of_Belgium_%28civil%29.svg.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Flag_of_South_Korea.svg/40px-Flag_of_South_Korea.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Flag_of_Switzerland_%28Pantone%29.svg/20px-Flag_of_Switzerland_%28Pantone%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/2011_Four_Continents_Tessa_VIRTUE_Scott_MOIR_3.jpg/250px-2011_Four_Continents_Tessa_VIRTUE_Scott_MOIR_3.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Bundesarchiv_Bild_102-13104%2C_Sonja_Henie_und_Karl_Sch%C3%A4fer.jpg/250px-Bundesarchiv_Bild_102-13104%2C_Sonja_Henie_und_Karl_Sch%C3%A4fer.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Marina_Klimova_and_Sergei_Ponomarenko.jpg/250px-Marina_Klimova_and_Sergei_Ponomarenko.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Bronze_medal_icon_%28B_initial%29.svg/20px-Bronze_medal_icon_%28B_initial%29.svg.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/2018_Winter_Olympics_-_Yuzuru_Hanyu_SP.jpg/250px-2018_Winter_Olympics_-_Yuzuru_Hanyu_SP.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Bundesarchiv_Bild_102-09482%2C_Sonja_Henie.jpg/250px-Bundesarchiv_Bild_102-09482%2C_Sonja_Henie.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Silver_medal_icon_%28S_initial%29.svg/20px-Silver_medal_icon_%28S_initial%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/03/Flag_of_Italy.svg/40px-Flag_of_Italy.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Flag_of_the_People%27s_Republic_of_China.svg/40px-Flag_of_the_People%27s_Republic_of_China.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Cscr-featured.svg/20px-Cscr-featured.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/Flag_of_Hungary.svg/40px-Flag_of_Hungary.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/1908_Olympic_Games_Ulrich_Salchow.jpg/250px-1908_Olympic_Games_Ulrich_Salchow.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Bundesarchiv_Bild_183-1988-0105-018%2C_Katarina_Witt.jpg/250px-Bundesarchiv_Bild_183-1988-0105-018%2C_Katarina_Witt.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Flag_of_Yugoslavia_%281946-1992%29.svg/40px-Flag_of_Yugoslavia_%281946-1992%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Flag_of_France.svg/40px-Flag_of_France.svg.png", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Flag_of_Austria.svg/40px-Flag_of_Austria.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Gold_medal_icon_%28G_initial%29.svg/20px-Gold_medal_icon_%28G_initial%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Flag_of_Germany_%281935%E2%80%931945%29.svg/40px-Flag_of_Germany_%281935%E2%80%931945%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Russian_Olympic_Committee_flag.png/40px-Russian_Olympic_Committee_flag.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Flag_of_Kazakhstan.svg/40px-Flag_of_Kazakhstan.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/9a/Flag_of_Spain.svg/40px-Flag_of_Spain.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Flag_of_Hungary_%281946-1949%2C_1956-1957%3B_1-2_aspect_ratio%29.svg/40px-Flag_of_Hungary_%281946-1949%2C_1956-1957%3B_1-2_aspect_ratio%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/German_Olympic_flag_%281959-1968%29.svg/40px-German_Olympic_flag_%281959-1968%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Flag_of_Switzerland.svg/20px-Flag_of_Switzerland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Flag_of_Ukraine.svg/40px-Flag_of_Ukraine.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/Yunakimedal2.jpg/250px-Yunakimedal2.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Figure_skating_pictogram.svg/40px-Figure_skating_pictogram.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/40px-Flag_of_the_United_Kingdom.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Russian_Nationals_2022_Anna_Shcherbakova.jpg/250px-Russian_Nationals_2022_Anna_Shcherbakova.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Papadakis%2C_Cizeron_-_2019_Internationaux_de_France_-_3.jpg/250px-Papadakis%2C_Cizeron_-_2019_Internationaux_de_France_-_3.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Nathan_Chen_-_2019_Skate_America_-_3.jpg/250px-Nathan_Chen_-_2019_Skate_America_-_3.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Canada_%28Pantone%29.svg/40px-Flag_of_Canada_%28Pantone%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Olympic_flag.svg/40px-Olympic_flag.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Flag_of_the_Netherlands.svg/40px-Flag_of_the_Netherlands.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Grishuk_and_Platov_1994_Europeans.jpg/250px-Grishuk_and_Platov_1994_Europeans.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b1/Olympic_Rings.svg/40px-Olympic_Rings.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Flag_of_East_Germany.svg/40px-Flag_of_East_Germany.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Flag_of_the_Soviet_Union.svg/40px-Flag_of_the_Soviet_Union.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4c/Flag_of_Sweden.svg/40px-Flag_of_Sweden.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/Karl_Schaefer_1935_by_Karl_Schleich.jpg/250px-Karl_Schaefer_1935_by_Karl_Schleich.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f3/Flag_of_Russia.svg/40px-Flag_of_Russia.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Norway.svg/40px-Flag_of_Norway.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/40px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Olympic_rings_without_rims.svg/40px-Olympic_rings_without_rims.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Bundesarchiv_Bild_102-12803%2C_Gilles_Grafstr%C3%B6m.jpg/250px-Bundesarchiv_Bild_102-12803%2C_Gilles_Grafstr%C3%B6m.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Flag_of_Canada_%281957%E2%80%931965%29.svg/40px-Flag_of_Canada_%281957%E2%80%931965%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/9e/Flag_of_Japan.svg/40px-Flag_of_Japan.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Flag_of_Finland.svg/40px-Flag_of_Finland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Sui_and_Han_-_2019_Four_Continents_-_4.jpg/250px-Sui_and_Han_-_2019_Four_Continents_-_4.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Flag_of_Hungary_%281949-1956%3B_1-2_aspect_ratio%29.svg/40px-Flag_of_Hungary_%281949-1956%3B_1-2_aspect_ratio%29.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/20px-Symbol_category_class.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/b/ba/Flag_of_Germany.svg/40px-Flag_of_Germany.svg.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_Olympic_medalists_in_figure_skating", "title": "List of Olympic medalists in figure skating", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "viewport": "width=1120", "og": {"title": "List of Olympic medalists in figure skating - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}