{"url": "https://www.celebritynetworth.com/richest-celebrities/rock-stars/dan-reynolds-net-worth/", "text": "What Is Dan Reynolds' Net Worth?\n\nDan Reynolds is an American musician, singer, songwriter, and producer who has a net worth of $70 million. Dan Reynolds is best known for being the frontman of the rock band Imagine Dragons alongside Wayne Sermon, Ben McKee, and Daniel Platzman, and he was honored with the Songwriters Hall of Fame's Hal David Starlight Award in 2014. With Imagine Dragons, Dan has released the studio albums \"Night Visions\" (2012), \"Smoke + Mirrors\" (2015), \"Evolve\" (2017), \"Origins\" (2018), \"Mercury – Act 1\" (2021), and \"Mercury – Acts 1 & 2\" (2022), most of which went Platinum or higher in the U.S. The band's 2015 single \"Radioactive\" was certified 14× Platinum in the U.S. and 10× Platinum in Australia, and they're also known for songs such as \"It's Time,\" \"On Top of the World,\" \"Whatever It Takes,\" and the Diamond singles \"Demons,\" \"Believer,\" and \"Thunder.\" Reynolds also executive produced the documentary \"Believer\" (2018), appeared in the \"Pig Girls Don't Cry\" episode of the ABC series \"The Muppets.\" (2015) with Imagine Dragons, and lent his voice to the computer-animated Disney film \"Ralph Breaks the Internet\" (2018).\n\nEarly Life\n\nDan Reynolds was born Daniel Coulter Reynolds on July 14, 1987, in Las Vegas, Nevada. He is the son of Christene M. Callister and author/lawyer Ronald Reynolds, and he grew up in a Mormon household with eight siblings. Dan attended Bonanza High School, then he enrolled at the University of Nevada, Las Vegas. At the age of 19, Dan volunteered as a missionary and spent two years in Nebraska. After completing his mission for the Church of Jesus Christ of Latter-day Saints, Reynolds transferred to Brigham Young University to study music, marketing, and communications. While attending BYU, Dan formed Imagine Dragons and won a battle of the bands contest at the school. He later dropped out of BYU to pursue a music career full-time.\n\nImagine Dragons\n\nImagine Dragons released the EPs \"Imagine Dragons\" (2009), \"Hell and Silence\" (2010), \"It's Time\" (2011), and \"Continued Silence\" (2012) before releasing their debut album, \"Night Visions,\" on Interscope Records on September 4, 2012. \"Night Visions\" reached #2 on the \"Billboard\" 200 chart and #1 on the Top Alternative Albums and Top Rock Albums charts, and it was certified 7× Platinum in the U.S. and Canada and Platinum or higher in more than a dozen other countries. The album featured the singles \"It's Time,\" \"Radioactive,\" \"Demons,\" and \"On Top of the World,\" which were all top 10 hits on the \"Billboard\" Hot Rock & Alternative Songs chart and were certified 4× Platinum or higher in the U.S., with \"Demons\" reaching Diamond certification and \"Radioactive\" going 14× Platinum. The band's second album, 2015's \"Smoke + Mirrors,\" topped the \"Billboard\" 200 chart, Top Rock Albums chart, Top Alternative Albums chart, Canadian Albums Chart, Scottish Albums Chart, and UK Albums Chart and went Platinum in five countries. The singles \"I Bet My Life\" and \"Shots\" reached the top 10 on the Hot Rock & Alternative Songs chart. Imagine Dragons followed \"Smoke + Mirrors\" with 2017's \"Evolve\" and 2018's \"Origins,\" which both reached #2 on the \"Billboard\" 200 chart and #1 on the Top Alternative Albums and Top Rock Albums charts. \"Evolve\" went 3× Platinum in the U.S., and the singles \"Believer\" and \"Thunder\" were certified Diamond.\n\nIn 2016, the band collaborated with Lil Wayne, Wiz Khalifa, Ty Dolla $ign, Logic, and X Ambassadors on the song \"Sucker for Pain\" for the \"Suicide Squad\" soundtrack, and it reached the top 10 on the charts in more than 15 countries. In 2018, the Imagine Dragons song \"Zero\" was featured in the Disney film \"Ralph Breaks the Internet,\" and all the band members voiced themselves in the movie. Their fifth album, 2021's \"Mercury – Act 1,\" reached #1 on the Top Alternative Albums chart. In 2022, the band released \"Mercury – Acts 1 & 2,\" which reached #1 in Switzerland. In 2013, Dan discovered the band X Ambassadors and helped them get a record deal with KidinaKorner/Interscope Records. He co-wrote the song \"Fear\" for their 2015 Platinum album \"VHS.\" Reynolds formed the Interscope Records imprint Night Street Records in 2016, and alternative hip-hop musician K. Flay was the first artist he signed. In 2017, he organized a charity festival called LOVELOUD to \"ignite the relevant and vital conversation of what it means to unconditionally love, understand, accept, and support LGBTQ+ youth in our communities.\"\n\nCatalog Sale\n\nIn August 2020 Imagine Dragons sold \"a portion\" of their song catalog to a company called Concord for $100 million.\n\nPersonal Life\n\nDan married Aja Volkman on March 5, 2011, and they have welcomed four children together. Dan and Aja formed the indie rock duo Egyptian in 2011 and released the \"Egyptian – EP\" the following year. In April 2018, Reynolds announced that he and Volkman were divorcing, but a few months later he said they were back together. In September 2022, he announced that they had separated again. Dan suffers from a type of arthritis called ankylosing spondylitis, and in 2016, he teamed up with Novartis's ThisASLife to help raise awareness about the disease. He suffers from ulcerative colitis, which he was diagnosed with in his early twenties. Reynolds has been open about his struggles with depression and has said that he's trying to destigmatize the way society views it. Though Dan was raised in the Church of Jesus Christ of Latter-day Saints, he described himself as \"non-Mormon\" in 2021 and later stated, \"I'm not raising my kids in any religiousness if that means anything. I'm more spiritual based and religion hasn't really been my cup of tea.\"\n\nIn 2013, Imagine Dragons formed The Tyler Robinson Foundation with the family of Tyler Robinson, who died of cancer at the age of 17. The foundation's mission is \"to strengthen families financially and emotionally as they cope with the tragedy of a pediatric cancer diagnosis by offsetting out-of-pocket life expenses,\" and its 2018 gala raised $2.1 million. The band has also been involved with Amnesty International's \"Bringing Human Rights Home,\" Do The Write Thing: National Campaign to Stop Violence, and OneOrlando Fund's \"All Is One Orlando Unity Concert,\" and in 2015, they released the track \"I Was Me\" and donated proceeds to the One4 Project to \"support refugee relief efforts.\" In 2017, Dan received the Trevor Hero Award, which the non-profit organization The Trevor Project awards to an individual who \"serves as an inspiration to LGBTQ youth or increases visibility and understanding of the LGBTQ community.\"\n\nAwards and Nominations\n\nIn 2016, Reynolds earned a Hollywood Music In Media Award nomination for Best Original Song – Sci-Fi/Fantasy Film for \"Sucker For Rain\" from \"Suicide Squad.\" In 2019, he received an Annie Award nomination for Outstanding Achievement for Music in an Animated Feature Production for \"Ralph Breaks the Internet\" and a News & Documentary Emmy nomination for Outstanding Arts & Culture Documentary for \"Believer.\" With Imagine Dragons, Reynolds has won more than 40 awards, including three American Music Awards, 10 \"Billboard\" Music Awards, eight BMI Pop Awards, an MTV Video Music Award, and five Teen Choice Awards. The band has also earned four Grammy nominations, winning Best Rock Performance for \"Radioactive\" in 2014. \"Radioactive\" was also nominated for Record of the Year, and the band earned nominations for Best Pop Vocal Album for \"Evolve\" and Best Pop Duo/Group Performance for \"Thunder\" in 2018.\n\nReal Estate\n\nIn 2017, Dan paid $1.1 million for a home in L.A.'s Eagle Rock neighborhood. He previously owned an 8,400 square-foot home in his native Las Vegas, which he sold in 2019 for $3.5 million.\n\nIn July 2020, Dan paid $11.3 million for a home in Malibu that once belonged to Goldie Hawn and Kurt Russell. He listed this home for sale in September 2023 for $18 million, and found a buyer less than a month later for right around his asking price. Here's a video tour of the home:", "images": ["https://vz.cnwimg.com/thm/1JoH3482haSLevnlEMdqhrz36y0=/132x132/center/top/filters:format(webp)/2009/11/George-Clooney.jpg", "https://vz.cnwimg.com/thm/I4dSiTJhq0kprSuO--deoPCEAmQ=/132x132/center/top/filters:format(webp)/2020/06/taylor.png", "https://vz.cnwimg.com/thm/KNDSqD-9inbRekV6AGgXDEG2Scw=/375x35:810x586/132x132/filters:format(webp):strip_exif()/2015/09/GettyImages-476575299.jpg", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "https://vz.cnwimg.com/thm/3pOZj2xhEz89RG8GHYxwJUH8G4E=/132x132/center/top/filters:format(webp)/2009/11/Minka-Kelly.jpg", "https://vz.cnwimg.com/thm/Gm7hxamtCaZiRUDZC4As5DuoZRk=/132x132/center/top/filters:format(webp)/2010/12/Musiq-Soulchild.jpg", "https://vz.cnwimg.com/thm/0dOqT2nlNQM7u_J-5xWrCsf2nAw=/132x132/center/top/filters:format(webp)/2020/02/Angelina-Jolie.png", "https://vz.cnwimg.com/thm/_hOmdPz8Ht24ZxIeZM7m4mGRouk=/132x132/center/top/filters:format(webp)/2019/11/GettyImages-1094653148.jpg", "https://vz.cnwimg.com/thm/yboGsO77E1kQwELLmrwRZv_4RmE=/132x132/center/top/filters:format(webp)/2017/02/GettyImages-528215436.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/thm/lt1abKKVHSBtY-US0k9GLU9MTmM=/132x132/center/top/filters:format(webp)/2009/09/Brad-Pitt.jpg", "https://vz.cnwimg.com/thm/l1xKA95Hw3j3CzSrPO6fWW5rGfk=/132x132/center/top/filters:format(webp)/2010/05/Colbie-Caillat.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://vz.cnwimg.com/thm/dXuAPIEBU--L_kRib4u0nSzjUtE=/132x132/center/top/filters:format(webp)/2020/04/Megan-Fox.jpg", "https://vz.cnwimg.com/thm/UrxRpZCt0GQp5K892fh15-S82Fc=/132x132/center/top/filters:format(webp)/2019/05/Mark-Stoermer.jpg", "https://vz.cnwimg.com/thm/lY3-oCS-xIdiqDaOi1qHd6UaTjg=/132x132/center/top/filters:format(webp)/2009/09/Cristiano-Ronaldo.jpg", "https://vz.cnwimg.com/thm/UxnQSql1h0QyX1CgkPqKhTxCTHM=/132x132/center/top/filters:format(webp)/2009/09/Jennifer-Aniston.jpg", "https://vz.cnwimg.com/thm/aFm1iOdYx046cHcWJjWWejCoxRw=/400x400/center/top/filters:format(webp)/2016/08/Dan-Reynolds.jpg", "https://vz.cnwimg.com/wp-content/uploads/2016/08/Dan-Reynolds.jpg?x46379", "https://vz.cnwimg.com/thm/95i5RI1LWkjHyyoolMeto-z_WeU=/132x132/center/top/filters:format(webp)/2020/01/lopez3.jpg", "https://vz.cnwimg.com/thm/HPEbABR8JWA2vfj_DPXjKcn5IJs=/132x132/center/top/filters:format(webp)/2020/08/ws.jpg"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2016/08/Dan-Reynolds.jpg?x46379", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/rock-stars/dan-reynolds-net-worth/", "title": "Dan Reynolds Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Dan Reynolds net worth: Dan Reynolds is an American musician, singer, songwriter, and producer who has a net worth of $70 million. Dan Reynolds is best known for being the frontman of the rock band Imagine Dragons alongside Wayne Sermon", "slick": {"wpversion": "3.0.1", "wppostid": 202737, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2016/08/Dan-Reynolds.jpg?x46379", "group": "post", "category": "rock-stars:Rock Stars"}, ";": "richest-celebrities:Richest Celebrities", "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "cnw": {"wppostid": 202737}, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Dan Reynolds Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/rock-stars/dan-reynolds-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2016/08/Dan-Reynolds.jpg?x46379", "site_name": "Celebrity Net Worth", "description": "What is Dan Reynolds's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2023-10-13T23:13:27+00:00", "published_time": "2023-02-27T00:28:50+00:00", "section": "Rock Stars", "tag": "dan reynolds worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2016/08/Dan-Reynolds.jpg?x46379", "title": "Dan Reynolds Net Worth", "description": "Dan Reynolds net worth: Dan Reynolds is an American musician, singer, songwriter, and producer who has a net worth of $70 million. Dan Reynolds is best known for being the frontman of the rock band Im"}}, "movies": [], "publish_date": 1677457730.0, "source": "https://www.celebritynetworth.com", "summary": ""}