{"url": "https://www.thewrap.com/hbo-vs-hulu-vs-netflix-heres-whos-winning-in-streaming-subscribers-by-a-lot/", "text": "On Wednesday, HBO CEO Richard Plepler said his HBO Now streaming video on demand service has “about 800,000” paying subscribers. Those come in addition to the viewers who watch HBO on an ancient platform known as TV.\n\nWe figured this was as good a time as any to update comparisons among the existing streaming options. So here they are, with pretty pictures and variably pretty statistics:\n\nHBO Now\n\nLike Plepler said, the SVOD option for HBO currently has “about” 800,000 paying subscribers after eight months of existence. That’s a lower figure than Wall Street analysts wanted to see, but the service has yet to land on Xbox and PlayStation platforms. The two video game consoles account for about 20 percent of sister app HBO Go’s viewing.\n\nOf course, HBO and Cinemax still do the vast majority of their business on cable — which people in the industry call “linear” viewing, a term that also applies to broadcast TV. A person with knowledge of the numbers told TheWrap that combined totals between the two channels are “approaching 50 million domestic” subscribers. Add in 81 million more paid users internationally, and one can understand why parent company Time Warner appreciates the traditional model.\n\nRead more details on the current state of HBO Now here.\n\nHulu\n\nRight around the previous television upfronts season, Hulu revealed that it had about 9 million paying subscribers. However, a lot has happened since April 2015, and we don’t just mean a long 10 months passing.\n\nSince that number, Hulu has not only added a ton of content, it’s changed subscription options. The 9 million count came about at a time when the service only offered an $8-per-month plan, with which subscribers still had to watch commercials. In September, Hulu rolled out a $12 monthly subscription option that removes the ads.\n\nThe company plans to publicly update its subscriber total sometime this year, but all Hulu told TheWrap today was, “Our subscriber base has continued to grow since then.”\n\nIt’s important to note here that Hulu is only meaningfully active in the United States, unlike …\n\nNetflix\n\nThe big boy of them all, Netflix boasts a massive 70.1 million paid subscriptions worldwide. In the U.S., the company’s 43.4 million paid subscribers is pushing five-times Hulu’s count.\n\nNetflix still does not release viewership information, though it claims “Orange Is the New Black” would be the top show across pay-TV if it did. San Francisco-based Symphony Advanced Media has claimed it can accurately measure Netflix’s viewing, and that the numbers aren’t nearly as impressive as Ted Sarandos and Reed Hastings would like us all to believe. Those two guys say the claim — and Symphony A.M.’s data — is hogwash.\n\nAmazon Prime\n\nAmazon keeps a lid on its figures too, though it has thrown around the phrase “tens of millions” in the past. That said, many — or probably most — of Amazon’s Prime subscribers don’t even watch the TV shows and movies. They just want free two-day shipping on paper towels.\n\nCBS All Access\n\nLast March, CBS Chairman Les Moonves sort of gave guidance about how many subscribers CBS All Access has. While he would not talk statistics, when asked if his streaming option had more subscribers than the roughly 100,000 reported for Dish’s Sling service at the time, Moonves affirmed that it definitely did. He went no further than that, and several analysts took the tone of his quick confirmation to mean that All Access was well above Sling’s 100,000 benchmark.\n\nSling TV\n\nWhich brings us to Sling, which had a company reported 169,000 subscribers by the end of March. That was the last time Dish shared its figures. However, through a little third-party reverse engineering-style mathematics, StreamingMediaBlog.com reported in December that Sling was up to about 400,000 subscribers — but definitely below 500,000.\n\nThe Mysteries\n\nShowtime, YouTube Red and Playstation Vue have not shared subscriber numbers.", "images": ["https://i0.wp.com/www.thewrap.com/wp-content/uploads/2016/02/streaming.jpg?fit=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2015/05/The-Mindy-Project.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2015/12/House-of-Cards.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2015/06/Faris.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2025/11/111325_COVER-_IR_5x4.png?fit=240%2C300&quality=80&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2015/06/Game-of-Thrones-Headey-Cersei.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2015/02/sling-tv.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2015/04/Jeffery-Tambor-Transparent.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/08/Tony-Maglio.png?fit=53%2C58&quality=80&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/08/Tony-Maglio.png?resize=150%2C150&quality=80&ssl=1"], "top_img": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2016/02/streaming.jpg?fit=618%2C412&quality=89&ssl=1", "keywords": [], "authors": ["Tony Maglio", "Tv Editor", "Tony.Maglio Thewrap.Com", "Twitter", ".Wp-Block-Post-Author Box-Sizing Border-Box Display Flex Flex-Wrap Wrap .Wp-Block-Post-Author__Byline Font-Size Margin-Bottom Margin-Top Width", ".Wp-Block-Post-Author__Avatar Margin-Right .Wp-Block-Post-Author__Bio Font-Size Margin-Bottom .Wp-Block-Post-Author__Content Flex-Basis Flex-Grow .Wp-Block-Post-Author__Name Margin", ".Wp-Block-The-Wrap-Author-Bios__Entry Align-Items Center Display Flex Flex-Wrap Wrap Gap .Wp-Block-The-Wrap-Author-Bios__Entry .Wp-Block-The-Wrap-Author-Bios__Entry Margin-Top .Wp-Block-The-Wrap-Author-Bios__Entry-Excerpt Flex-Basis", ".Wp-Block-The-Wrap-Author-Bios Border-Top Solid", "Margin-Block Padding-Top .Wp-Block-The-Wrap-Author-Bios__Entry-Avatar Display Var --Display-No-Mobile", "Block"], "canonical_link": "https://www.thewrap.com/hbo-vs-hulu-vs-netflix-heres-whos-winning-in-streaming-subscribers-by-a-lot/", "title": "HBO vs. Hulu vs. Netflix: Here’s Who’s Winning in Streaming Subscribers – By a Lot", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "HBO vs. Hulu vs. Netflix: Here's Who's Winning in Streaming Subscribers - By a Lot", "description": "Hint: The leader has more than 70 million paid users", "url": "https://www.thewrap.com/hbo-vs-hulu-vs-netflix-heres-whos-winning-in-streaming-subscribers-by-a-lot/", "site_name": "TheWrap", "image": {"identifier": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2016/02/streaming.jpg?fit=618%2C412&quality=89&ssl=1", "width": 618, "height": 412, "type": "image/jpeg"}}, "article": {"author": "https://www.facebook.com/thewrap/", "published_time": "2016-02-10T21:20:54+00:00", "modified_time": "2016-02-11T16:14:21+00:00"}, "author": "Tony Maglio", "twitter": {"card": "summary_large_image", "creator": "@thewrap", "label1": "Written by", "data1": "Tony Maglio", "label2": "Est. reading time", "data2": "4 minutes"}, "generator": "WordPress 6.8", "article-tags": "amazon, amazon_prime, cbs-all-access, hbo, hbo-now, hulu, netflix, playstation-vue, reed_hastings, richard_plepler, sling, ted_sarandos, youtube-red", "article-categories": "category-business, media, tv", "msapplication-TileImage": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2024/05/the_wrap_symbol_black_bkg.png?fit=270%2C270&quality=80&ssl=1"}, "movies": [], "publish_date": 1455139254.0, "source": "https://www.thewrap.com", "summary": ""}