{"url": "https://en.wikipedia.org/wiki/Better_Call_Saul", "text": "American legal crime drama television series (2015–2022)\n\nThis article is about the American legal crime drama TV series. For other uses, see Better Call Saul (disambiguation)\n\nBetter Call Saul is an American neo-noir legal crime drama television series created by Vince Gilligan and Peter Gould for AMC. Part of the Breaking Bad franchise, it is a spin-off of Gilligan's previous series, Breaking Bad (2008–2013), to which it serves primarily as a prequel, with some scenes taking place during and after the events of Breaking Bad. Better Call Saul premiered on AMC on February 8, 2015, and ended on August 15, 2022, after six seasons, totalling 63 episodes.\n\nSet primarily in the early to mid-2000s in Albuquerque, New Mexico, several years before the events of Breaking Bad, Better Call Saul examines the ethical decline of Jimmy McGill (Bob Odenkirk), an aspiring lawyer and former con artist who becomes the egocentric criminal-defense attorney Saul Goodman alongside his romantic interest and colleague Kim Wexler (Rhea Seehorn), while dealing with conflicts with his brother Chuck McGill (Michael McKean) and Chuck's law partner Howard Hamlin (Patrick Fabian). The show also follows Mike Ehrmantraut (Jonathan Banks), a former corrupt police officer who becomes a fixer and enforcer for drug traffickers, such as drug dealer Nacho Varga (Michael Mando), and drug lord Gus Fring (Giancarlo Esposito). The latter half of the show introduces cartel enforcer Lalo Salamanca (Tony Dalton), who becomes a major antagonist to both Jimmy and Mike. In addition to the primary storyline, Better Call Saul includes black-and-white flashforwards set in 2010, after the events of Breaking Bad, which explore the consequences of Saul's actions across both series. Odenkirk, Banks, and Esposito reprise their roles from Breaking Bad, as do many others in guest appearances.\n\nGilligan, who created and developed Breaking Bad, and Gould, who wrote the Breaking Bad episode \"Better Call Saul\", began considering a Saul Goodman spin-off in 2009. Because Saul's role in Breaking Bad had expanded beyond the writing staff's plans, Gilligan felt he could be explored further. He and Gould considered making a half-hour legal comedy featuring Saul and his various clients, but settled on an hour-long tragedy showing how he develops into the character seen in Breaking Bad. Better Call Saul's development began during the production of Breaking Bad's final season in 2013, with Gilligan and Gould serving as co-showrunners and numerous production staff returning. Gilligan left Better Call Saul early in the third season—making Gould the sole showrunner for the remainder of its run—though he returned to help write the final season.\n\nBetter Call Saul received critical acclaim, with praise for its acting, characters, writing, direction, and cinematography. Many reviewers have considered it a worthy successor to Breaking Bad—many deeming it superior to its predecessor—and one of the greatest television series of all time.[6][7][8] It has garnered many accolades, including 2 Peabody Award nominations, 53 Primetime Emmy Award nominations (setting a record for the most-nominated show to never win an Emmy), 19 Writers Guild of America Award nominations, 20 Critics' Choice Television Award nominations, 9 Screen Actors Guild Award nominations, and 6 Golden Globe Award nominations. At the time of its airing, the series premiere held the record for the highest-rated scripted series premiere in basic cable history.\n\nPremise [ edit ]\n\nBetter Call Saul is a spin-off of Breaking Bad, a popular crime drama television series that ran from 2008 to 2013.[9][10] It is primarily a prequel that focuses on Jimmy McGill, a former con artist aiming to gain respectability as a public defender, and chronicles his gradual transformation into his eventual Breaking Bad persona of Saul Goodman, the flamboyant criminal lawyer with ties to the drug cartel. Most of the show takes place over a two-year period before the events of Breaking Bad, spanning approximately 2002 to 2004.[11]\n\nJimmy is inspired by his older brother Chuck McGill to leave his Chicago-area conman past, when he was known as \"Slippin' Jimmy\". He initially works in the mailroom at his brother's Albuquerque law firm, Hamlin, Hamlin & McGill (HHM), where managing partner Howard Hamlin becomes his nemesis. While at HHM Jimmy befriends Kim Wexler, a fellow mailroom employee who completes law school and becomes one of the firm's associates, and their friendship later turns romantic. Jimmy is motivated by Chuck's success to finish college and complete a Juris Doctor degree through a correspondence law school, the fictitious University of American Samoa.[12]\n\nAfter attaining admission to the bar but being denied employment at HHM, Jimmy's pursuits focus on low-paying clients, including working as a public defender. He later begins to build a practice in elder law, which leads to a prolonged lawsuit against a nursing home chain when he discovers it is defrauding its clients. He and Chuck begin working together on a class-action suit, which Chuck quickly turns over to HHM, squeezing out Jimmy. Jimmy begins to unravel due to Chuck's constant belittling, sabotage, and vindictive behavior toward him. Jimmy's life and career begin to intersect with the illegal narcotics trade and feature characters and story arcs that continue into Breaking Bad.\n\nAmong these arcs is the uneasy relationship between rival members of a drug cartel. On one side is Gus Fring, a fried chicken company entrepreneur whose restaurant chain is a front business for his narcotics distribution. On the other are the Salamancas, a Mexican crime family who claim to have begun the drug trade in New Mexico. They are led by Hector Salamanca, and later by his nephew Lalo Salamanca. Those caught up in the conflict between Gus and the Salamancas include Ignacio \"Nacho\" Varga, a Salamanca associate who wants to protect his father from harm, and Mike Ehrmantraut, a former Philadelphia police officer who becomes a fixer for Gus but also has ties to Jimmy. As his interactions with criminals continue, Jimmy takes on the persona of the colorful Saul Goodman, and he starts to draw on his conman past while his work as an attorney goes from questionable to unethical to illegal.\n\nIn addition to selected scenes that take place within the Breaking Bad timeline in 2008,[13] the show includes flashforwards, shown in black and white, to events following Breaking Bad. Taking place in 2010, these flashforwards show Jimmy living as a fugitive under the identity of Gene Takavic, the manager of a Cinnabon store in Omaha, Nebraska. The flashforwards constitute the opening scenes of the first five season premieres, and make up nearly the entirety of the episodes towards the end of the series.\n\nCast and characters [ edit ]\n\nMain cast [ edit ]\n\nRecurring cast [ edit ]\n\nIntroduced in season 1 [ edit ]\n\nIntroduced in season 2 [ edit ]\n\nIntroduced in season 3 [ edit ]\n\nKimberly Hebert Gregory as Assistant District Attorney Kyra Hay\n\nHarrison Thomas as Lyle, the dedicated assistant manager of Los Pollos Hermanos\n\nTamara Tunie as Anita, a member of Mike and Stacey's support group\n\nBonnie Bartlett as Helen, Irene's friend and member of the affected class in the Sandpiper lawsuit\n\nIntroduced in season 4 [ edit ]\n\nDon Harvey (seasons 4–5) and Pat Healy (season 6) as Jeff, a taxi cab driver in the present that recognizes Gene as Saul Goodman\n\nRainer Bock as Werner Ziegler, an engineer hired by Gus to plan and oversee construction of his meth \"superlab\"\n\nBen Bela Böhm as Kai, a rebellious member of the crew Werner Ziegler assembles for the construction of Gus's meth \"superlab\"\n\nStefan Kapičić as Casper, a member of Werner Ziegler's team\n\nPoorna Jagannathan as Maureen Bruckner, a specialist from Johns Hopkins who flew to Albuquerque to treat Hector after Gus arranged for a \"generous grant\"\n\nKeiko Agena as Viola Goto, Kim Wexler's paralegal\n\nIntroduced in season 5 [ edit ]\n\nMax Bickelhaup as Buddy, Jeff's friend who later helps Gene with his schemes\n\nSasha Feldman and Morgan Krantz as Sticky and Ron, two petty crooks who are among \"Saul Goodman\" 's first clients\n\nfirst clients Barry Corbin as Everett Acker, an old man living on leased property belonging to Mesa Verde whom Kim has to evict to make way for the bank's new call center\n\nIntroduced in season 6 [ edit ]\n\nLennie Loftin as Genidowski, a con man hired by Jimmy and Kim to pose as Howard's private investigator\n\nSandrine Holt as Cheryl Hamlin, Howard's estranged wife\n\nJohn Posey as Rand Casimiro, a retired judge who is mediating the Sandpiper case\n\nJohn Ennis as Lenny, a grocery store employee hired by Jimmy and Kim to impersonate Casimiro\n\nCarol Burnett as Marion, Jeff's mother who takes a liking to Gene and eventually reports him to the authorities revealing his true identity\n\nKevin Sussman as Mr. Lingk, a rich man with cancer who is targeted by Gene\n\nIntroduced in Breaking Bad [ edit ]\n\nGuest appearances from Breaking Bad cast members [ edit ]\n\nProduction [ edit ]\n\nConception [ edit ]\n\nBetter Call Saul is a spin-off prequel series centered on Saul Goodman, a character created for Breaking Bad.\n\nThe character of Saul Goodman first appeared during Breaking Bad's second season, in an episode that was also titled \"Better Call Saul\".[9] Bob Odenkirk, who portrayed Saul Goodman, had never seen the series prior to his appearance.[14] The character was originally intended to appear in only four episodes, but soon became much more developed than the staff had planned. He would eventually stay on the series and become central to its narrative.[15][16] As Breaking Bad continued its run, the character would grow in popularity with the audience. Odenkirk speculated this was because he is \"the program's least hypocritical figure\", and \"is good at his job\".[17]\n\nVince Gilligan, who created and developed Breaking Bad, and Peter Gould, who wrote the episode with Goodman's first appearance, considered a Saul Goodman spinoff as early as 2009.[9][10][18] Gould noted that over the course of Breaking Bad, there were several \"what ifs” their team considered, such as if the show won a Primetime Emmy Award, or if people would buy \"Los Pollos Hermanos\" T-shirts. The staff did not expect these events to come to fruition, but after they did, they started considering a spin-off featuring Saul as a thought experiment. With the growth of Saul's character, the writers saw ways to explore the character further.[19] While filming the Breaking Bad episode \"Full Measure\", Gilligan asked Odenkirk his thoughts on a spinoff.[18] In July 2012, Gilligan publicly hinted at the idea, stating that he liked \"the idea of a lawyer show in which the main lawyer will do anything it takes to stay out of court\", including settling on the courthouse steps.[20][21]\n\nDevelopment [ edit ]\n\nBetter Call Saul was developed and co-showrun by was developed and co-showrun by Vince Gilligan (left) and Peter Gould (right). Gould took over as sole showrunner after Gilligan left the writing staff during the third season.\n\nIn April 2013, Better Call Saul was confirmed to be in development by Gilligan and Gould.[22] In July 2013, before the second half of Breaking Bad's final season aired, Gilligan said he and Gould were still working out ideas for the spin-off, but a deal had not yet been made.[23] Netflix was one of many interested distributors, but ultimately a deal was made between AMC and the Breaking Bad production company Sony Pictures Television.[24]\n\nAs Sony and AMC began to commit to a spinoff, Gilligan and Gould worked on what it would be about. They initially considered making it a half-hour show where Saul would see various clients – celebrities in guest roles – in his strip mall office, similarly to Dr. Katz, Professional Therapist, but they had no idea how to write for this type of format. They eventually fell back to planning for hour-long episodes. Gilligan described Breaking Bad as being \"25-percent humor, 75-percent drama\", and speculated that they would reverse that for Better Call Saul.[25] While the intent was to add more humor, the show remained heavy with dramatic elements, with Odenkirk calling the first season \"85 percent drama, 15 percent comedy.\"[26] Gould would call the comedic element of Better Call Saul and its predecessor Breaking Bad the \"secret sauce\" to both series, saying that it made their dramatic elements stronger and vice versa.[27]\n\nGilligan and Gould initially believed that Saul Goodman was insufficient to carry the show by himself, with Gilligan thinking the character was \"great flavoring\" for a show but not the substance. Eventually they came to realize that Saul, in the Breaking Bad timeframe, was a man who had come to accept himself, and recognized the potential of telling the story of how Saul got to be that person.[25] While several of the characters are lawyers in the show, Gilligan and Gould did not want to write a legal show, but instead a crime show, but one that would necessitate some legal elements. To help in these areas, the writers spoke to real lawyers and spent time observing cases at Los Angeles Superior Court, observing that the bulk of the activity in these cases was downtime while waiting for others to complete actions.[28]\n\nWriting [ edit ]\n\nGilligan and Gould began as co-showrunners for the series.[29] Former Breaking Bad writers Thomas Schnauz and Gennifer Hutchison joined the writing staff, with Schnauz serving as co-executive producer and Hutchison as supervising producer.[30] Also joining the initial writing staff were Bradley Paul and former Breaking Bad writer's assistant Gordon Smith.[29]\n\nHaving learned several lessons from Breaking Bad related to foreshadowing without writing the foresight, Gilligan and Gould gave themselves more flexibility in how Better Call Saul's plot would develop over its run.[25] From the beginning they had no firm idea where it would end up outside the connection to Breaking Bad.[31][25] For example, Gilligan and Gould had already committed to the Better Call Saul title in the beginning, so that in following this route, they believed they had to quickly get from Jimmy McGill to Saul Goodman, or they would otherwise disappoint their audience. However, as they wrote the show, they realized \"we don't want to get to Saul Goodman … and that's the tragedy\".[25] Rhea Seehorn's performance as Kim Wexler during the first season also influenced this decision. Impressed with Seehorn and her character, the writers subsequently decided to put more focus on the Jimmy–Kim relationship starting in the second season, in addition to further slowing Jimmy's transition into Saul Goodman for the remainder of the series. Gilligan compared this to the impact Aaron Paul's acting had on Breaking Bad's eventual storyline.[32]\n\nIn writing for Better Call Saul, Gilligan and Gould recognized they were including overlaps with Breaking Bad, and had ideas of characters that they would include, such as Gus Fring, though on no set timetable within the show's development. Gilligan described the writing approach as if developing two separate shows, one that centered on Jimmy/Saul, Kim, Chuck, and Howard, and a second on the more familiar Breaking Bad characters like Mike and Gus.[25] Where possible, they had written in minor Breaking Bad characters in smaller parts or as Easter eggs to fans, but Gilligan preferred to include such major Breaking Bad characters as Walter White or Jesse Pinkman only if this seemed unconstrained and satisfactory to both the production team and the audiences.[25]\n\nBecause of the closeness to the Breaking Bad storyline, a writer would be tasked at the start of each season to rewatch all 62 episodes of the show and verify that the scripts for the Better Call Saul season introduced no conflicts.[33] As the show continued, the show's \"brain trust\" consisting of script coordinators Ariel Levine and Kathleen Williams-Foshee reviewed each script to help maintain the continuity with Breaking Bad, including tracking minor character traits and assuring small details from the previous show were kept correct if brought up again.[34]\n\nGilligan left the Better Call Saul writing staff early in the third season to focus on other projects, resulting in Gould becoming sole showrunner. This transition had been planned since the show's debut. Upon his departure, Gilligan expressed his hopes to return to the writers room during the show's final season.[35] He remained involved in the fourth and fifth seasons, but had little to do with developing the show's contents during this period. Instead, Gilligan reduced his role to being a \"director for hire\", having directed an episode during each season when he was not on the writing staff.[36][37][38] Gilligan went on to laud Gould for maintaining Better Call Saul's high quality, stating the series got better even after he left.[36][39] Gould would bring Gilligan back to the writers room for the sixth and final season, calling it \"wonderful to have him there, so we can finish this show that we started together.\"[40]\n\nCasting [ edit ]\n\nStarring cast [ edit ]\n\nBob Odenkirk confirmed he would reprise Saul Goodman in the starring role when the series was first announced, but his character would be introduced as lawyer Jimmy McGill.[9] In January 2014, it was announced that Jonathan Banks would reprise his Breaking Bad role as Mike Ehrmantraut and be a series regular.[41]\n\nNew cast members included Michael McKean as McGill's elder brother Chuck McGill. McKean previously guest-starred in an episode of Odenkirk's Mr. Show and Gilligan's X-Files episode \"Dreamland\".[42][43] Rhea Seehorn auditioned and got the role of Kimberly \"Kim\" Wexler in April 2014, her character being described as \"prestigious attorney ... whose hard life is complicated by her romantic entanglements with somebody else at the firm\". In May 2014, Patrick Fabian was cast on the show as Howard Hamlin, a \"Kennedy-esque lawyer who's winning at life\". After impressing Gilligan and Gould with his audition tape and screen test, Michael Mando was cast as the \"smart and calculating criminal\" Ignacio \"Nacho\" Varga.[44][45][46] Mando's character had been previously mentioned but not seen in the Breaking Bad episode \"Better Call Saul\".[47]\n\nGoing into the third season, Giancarlo Esposito was added to the main cast as Gus Fring, a drug kingpin who previously served as one of Breaking Bad's main antagonists. Esposito was previously a starring cast member in Breaking Bad for the same role.[48] McKean would leave the series at season's end due to his character being written out, but would make appearances in the fourth and sixth seasons.[49] Tony Dalton made his first appearance as Lalo Salamanca in the fourth season, and would be promoted to the main cast for the fifth.[50] Similar to Nacho, Lalo had been a character mentioned only by name in the same Breaking Bad episode \"Better Call Saul\".[47]\n\nReturn appearances from Breaking Bad cast members [ edit ]\n\nBefore the second season, Gilligan confirmed that more Breaking Bad characters would appear on the spin-off, but remained vague on which ones were likely to be seen.[51] By the next season, Gilligan said that the show had been on long enough that any reuse of Breaking Bad characters would require more than \"just a cameo or an Alfred Hitchcock walkthrough\", and that their appearances would need to be essential to the story.[52]\n\nBreaking Bad lead actors Bryan Cranston and Aaron Paul regularly said throughout the series run that they would be open to reprising their respective roles as Walter White and Jesse Pinkman on Better Call Saul. However, both maintained that they would only appear if Gilligan found a sufficiently good reason to bring them on the show.[52][53] Both would eventually appear in the final season.[54] Dean Norris, a Breaking Bad starring cast member who portrayed Hank Schrader, stated that he could not be part of Better Call Saul in the beginning due to his involvement in the CBS series Under the Dome.[55] However, he was able to reprise his role as a guest star in the fifth season.[56] Plans were initially made for Betsy Brandt to reprise her role as Hank's wife Marie Schrader in a cameo in the second season, but the writer's room objected, considering the idea to be distracting for audiences.[57] Brandt would eventually reprise the role in the final season.[58]\n\nOther Breaking Bad cast members spoke of the potential of being on Better Call Saul. Before the series began, Anna Gunn mentioned a talk with Gilligan over possible guest appearances as Skyler White.[59] Bill Burr was set to return as Patrick Kuby in the fifth season, but scheduling fell through due to him needing to attend to a personal matter.[60][61] After the series ended, Gould mentioned his desire to bring back the remaining Breaking Bad characters for the finale, but he and the writing staff could not find a proper way to have them fit into the story.[62][63]\n\nFilming [ edit ]\n\n(top) and the Old Bernalillo County Courthouse (bottom). The series was filmed in Albuquerque, New Mexico. Shooting locations include Cottonwood Mall and the Old Bernalillo County Courthouse\n\nPrincipal photography for Better Call Saul's six seasons took place from June 2, 2014, to February 9, 2022.[64][65][66] Like its predecessor, Better Call Saul is set in and around Albuquerque, New Mexico, with filming primarily taking place at Albuquerque Studios.[67][68] Gilligan directed the pilot.[29] Additional filming was done in March 2022, after principal photography for the series ended, for the opening teaser of the season six episode \"Point and Shoot\". With several crew members but no cast members on hand, the scene was filmed in Leo Carrillo State Beach, California. This was the only time the series was filmed outside of New Mexico.[69]: 1:00:01–1:01:29 [66]\n\nNotable exterior locations include the Twisters restaurant used previously in Breaking Bad for Gus's Los Pollos Hermanos, a parking lot kiosk at the Albuquerque Convention Center for where Mike worked in the first few seasons, the Old Bernalillo County Courthouse as the local courthouse, and two nearby office buildings in the North Valley, including Northrop Grumman's, that collectively are used for the HHM office spaces.[70] Jimmy's back office is located in an actual nail salon, which the producers accommodated by working with the owners. The Salamanca's restaurant is a real business in the South Valley that production modified slightly for the show, but which otherwise remained open. The scenes set in Omaha are filmed at Cottonwood Mall in Albuquerque; production worked with Cinnabon to bring in the period-specific equipment and service items for the segments, and the extras in the store during these scenes are Cinnabon employees.[70] The New Mexico Film Office reported that the first four seasons of Better Call Saul brought over US$120 million into the state, and they have hired 1,600 crew for each season and a total of 11,300 extras.[71]\n\nBetter Call Saul employs Breaking Bad's signature time jumps.[72] Notably, the opening episode for the first five seasons started with a black and white flash-forward to a period in the years after the finale of Breaking Bad. Here, Saul has been relocated to Omaha, Nebraska, as \"Gene\", a manager of a Cinnabon store, and remains paranoid about anyone discovering his past identity. This was foreshadowed in the penultimate episode of Breaking Bad, \"Granite State\", in which Saul tells Walter: \"If I'm lucky, a month from now, best-case scenario, I'm managing a Cinnabon in Omaha.\"[73]\n\nThe show's director of photography was Arthur Albert for the first two seasons, and Marshall Adams starting with season 3.[74] Additionally, Paul Donachie served as a cinematographer on episodes \"Namaste\" (2020), \"Carrot and Stick\" (2022) and \"Hit and Run\" (2022).[75] Seasons 1 and 2 were filmed mainly on RED Dragon cameras.[76][77] Starting with season 3, Panasonic VariCam Pure were incorporated due to their extra low-light sensitivity.[78][79] This allowed the crew to shoot extra wide exterior shots at night as well as during the day, and to shoot on sets in near total darkness, such as nighttime in Chuck's unelectrified house.[80] For scenes requiring to film from cramped spaces, a Panasonic Lumix GH4 camera was used.[81] In season 4, three RED and two VariCam Pure cameras were used.[78] For seasons 5 and 6, mostly Arri ALEXA LF was used.[82][83][84]\n\nTitle sequences [ edit ]\n\nEach episode's title sequence features a different low-quality image that recalls Saul Goodman's days on Breaking Bad. This includes the inflatable Statue of Liberty balloon that sat atop Saul's office, a drawer of burner phones kept in his desk, and a bus stop bench that advertised his business. Gould and Gilligan were inspired by the poor quality of early VHS tapes and the notoriously low production values of 1980s public-access television, and from the fact that Saul Goodman's law firm ads on Breaking Bad were done in a similar style. They intended for the title sequences to appear \"purposefully shitty\" in order to stand out from its contemporaries, which generally had increased visual quality and production standards. Some of the title sequences were put together from unused footage from Breaking Bad, but others were filmed specifically to create new ones. The title sequences were put together by assistant editor Curtis Thurber, and scored by Little Barrie guitarist Barrie Cadogan.[85][86] When Cadogan was putting the music together, he was told the producers wanted a piece of music that would be cut abruptly at 15 seconds.[86]\n\nAs every season except for the last has ten episodes each, the title credits for every season's corresponding episode number would reuse the same image. However, beginning with the second season, each of the episode's title sequences would continue to decline in picture quality by intermittently flashing black and white, and continue to lose color with each passing season. This caused many to theorize that this symbolized Jimmy McGill's storyline gradually transitioning to that of his post-Breaking Bad alter-ego Gene Takavic, whose scenes were entirely in black and white.[87][88]\n\nWith the final season featuring thirteen episodes instead of the usual ten, the title sequences would take a new format. During \"Nippy\", the title sequence features Saul Goodman's \"World's Greatest Lawyer\" mug falling off his desk and shattering on the floor, as was typical during a season's tenth episode. However, the title image and music prematurely stops and is replaced by a blue screen, recreating the effects of a home video recording on a VCR, and then displayed the show's title and creator credits. This is also the first episode to take place entirely after the events of Breaking Bad.[89] The remaining three title sequences retain the blue background, but briefly flash to an image previously unseen in the intro, with a distorted version of the theme song playing underneath. They then revert to the blue background again and display the title and creator credits. Before the show resumes, they again briefly flash to another new image that will be seen later on in the episodes.[90]\n\nEpisodes [ edit ]\n\nSeries overview for Better Call Saul Season Episodes Originally released First released Last released 1 10 February 8, 2015 ( ) April 6, 2015 ( 2015-04-06 ) 2 10 February 15, 2016 ( ) April 18, 2016 ( 2016-04-18 ) 3 10 April 10, 2017 ( ) June 19, 2017 ( 2017-06-19 ) 4 10 August 6, 2018 ( ) October 8, 2018 ( 2018-10-08 ) 5 10 February 23, 2020 ( ) April 20, 2020 ( 2020-04-20 ) 6 13 7 April 18, 2022 ( ) May 23, 2022 ( 2022-05-23 ) 6 July 11, 2022 ( ) August 15, 2022 ( 2022-08-15 )\n\nBetter Call Saul had its series premiere on February 8, 2015, and aired for six seasons until its series finale on August 15, 2022.[91][92] Its episodes are split between two main timelines.[93] The primary timeline begins in 2002, six years before the first episode of Breaking Bad.[94] During this period, where a majority of the series takes place, Saul Goodman mainly practices as a lawyer in Albuquerque, New Mexico under his birthname Jimmy McGill.[93]\n\nThe secondary timeline takes place in 2010, following events of Breaking Bad's finale, where Saul has fled Albuquerque and hides in Omaha, Nebraska under the alias Gene Takavic.[95] This later timeline would be shown only in the cold open in the first five season premieres, but would be fully explored in the last four episodes of the series.[96][97]\n\nSeason 1 (2015) [ edit ]\n\nThe first season was planned to be released in 2014 but was delayed.[98][99] The first teaser trailer debuted on AMC on August 10, 2014, and confirmed its premiere date of February 2015.[100] On November 20, 2014, AMC announced the series would have a two-night premiere; the first episode aired on Sunday, February 8, 2015, at 10:00 pm (ET), and then moved into its regular time slot the following night, airing new episodes Mondays at 10:00 pm until the season concluded on April 6, 2015.[91]\n\nIn 2002, Jimmy schemes to represent Craig Kettleman, accused of embezzlement, leading to encounters with psychotic drug lord Tuco Salamanca and his lieutenant Nacho. Jimmy also cares for his brother Chuck, who is housebound with electromagnetic hypersensitivity. While pursuing elder law, Jimmy learns of seniors being defrauded by the Sandpiper retirement community. As the class action lawsuit against Sandpiper grows, Chuck suggests giving it to his law firm, Hamlin, Hamlin & McGill. Jimmy receives a small of counsel fee and a share of any future settlement, but is blocked from participation. Jimmy learns Chuck sabotaged his legal career out of resentment. After the death of an old friend, Jimmy finds success when Davis & Main, another firm HHM brought in to assist with the Sandpiper case, offers to hire him.\n\nIn 2010, Gene manages a Cinnabon by day, but in the evening reminisces about his life as Saul by watching a VHS tape of his old television advertisements.\n\nSeason 2 (2016) [ edit ]\n\nPrior to the series' launch, on June 19, 2014, AMC renewed the series for a second season of 13 episodes to premiere in early 2016, which was later reduced to 10 episodes.[29][101] The season premiered on February 15, 2016, and concluded on April 18, 2016.[102]\n\nIn 2002, Jimmy works as an associate at D&M, but quits after his ostentatious legal style doesn't mesh with the firm's corporate demeanor. Kim is demoted by Chuck's partner, Howard Hamlin, because of Jimmy's actions. She secures banking firm Mesa Verde as an HHM client, although Howard denies her credit. Kim quits HHM and opens a shared private practice with Jimmy. Jimmy sabotages Chuck's work for Mesa Verde, which drops HHM and hires Kim, but Chuck discovers this and tricks Jimmy into confessing. Nacho wants to hire Mike Ehrmantraut to kill Tuco, but Mike instead removes him from the Salamanca organization by engineering his imprisonment. Hector Salamanca, cartel elder and Tuco's uncle, confronts Mike. Mike attempts to assassinate Hector, but is mysteriously interrupted.\n\nIn 2010, Gene accidentally locks himself in the dumpster room when closing out the Cinnabon for the night. Instead of alerting police, he spends the night waiting for the janitor to open the door.\n\nSeason 3 (2017) [ edit ]\n\nAMC announced on March 15, 2016, that Better Call Saul was renewed for a 10-episode third season, which premiered April 10, 2017, and concluded on June 19, 2017.[103][104]\n\nIn 2003, the results of the disciplinary hearing have Jimmy's law license suspended and Chuck's hypersensitivity condition is revealed to be psychosomatic. After Jimmy sabotages Chuck's insurance, Howard urges him to retire, but Chuck sues HHM in spite. Howard buys him out of the firm, leading Chuck to commit suicide. Gus prevents Hector's assassination, and Mike attacks Hector's trucks to steal $250,000 on Gus's orders. To launder the money, Gus arranges for Mike's hire as a contracted security consultant at Madrigal. Hector plans to take over the business of Nacho's father, so his son attempts to kill Hector by sabotaging his angina medication. Hector suffers a stroke during a confrontation with cartel lieutenant Juan Bolsa, which renders him comatose.\n\nIn 2010, Gene points mall security guards towards a shoplifter during his lunch break. Later, a stressed Gene suddenly collapses during his work.\n\nSeason 4 (2018) [ edit ]\n\nFollowing the third season's end on June 27, 2017, AMC renewed the series for a 10-episode fourth season, which premiered on August 6, 2018, and concluded on October 8, 2018.[105][106]\n\nIn 2003, Jimmy regains his outgoing demeanor after Howard shoulders the blame for Chuck's death. Jimmy manages a cell phone store but earns more by reselling prepaid phones to criminals. A year later, his law license reinstatement is denied over lack of remorse for Chuck. After faking mourning, he successfully appeals and practices as \"Saul Goodman\". Gus learns Nacho attempted to kill Hector and blackmails him into undermining the Salamancas. Mike escorts engineers who evaluate Gus's industrial laundry site as a potential underground meth lab. Gus hires Werner Ziegler to oversee construction, but Mike is ordered to kill Werner when he goes AWOL to spend time with his wife. Hector recovers from his stroke, but is mute and can only move his right index finger. His nephew, Lalo Salamanca, arrives to run Hector's business, and learns some details of Gus's construction project.\n\nIn 2010, Gene is hospitalized after his collapse and later discharged. He becomes uneasy when a taxi driver with an Albuquerque Isotopes air freshener seems to recognize him.\n\nSeason 5 (2020) [ edit ]\n\nThe series was renewed for a fifth season on July 28, 2018, just prior to the airing of the fourth season.[107] The fifth season was not expected to air until 2020; according to AMC's Sarah Barnett, the delay was \"driven by talent needs\".[108] The 10-episode fifth season would start airing with a special Sunday broadcast on February 23, 2020, with following episodes to air on Mondays until the season concluded on April 20, 2020.[109]\n\nIn 2004, Jimmy's law practice as Saul Goodman draws him into Albuquerque's drug trade and he is conflicted when Howard offers him a position at HHM. Kim balances her Mesa Verde and pro bono work with her own feelings for Jimmy, and finds herself employing similar conman-style tactics. Jimmy and Kim later devise a plan to ruin Howard to settle the Sandpiper case. Lalo's presence in Albuquerque forces Gus to suspend construction of his meth lab. Nacho and Mike become pawns in the feud between the Salamancas and Gus. After Lalo is arrested for murder, he hires Jimmy to represent him and arrange bail, which almost kills Jimmy. After an unsuccessful attempt on Lalo's life by Gus's hired assassins after his release, Lalo deduces that Nacho has betrayed him.\n\nIn 2010, during another lunch break, Gene is approached by the taxi driver, Jeff, and his friend Buddy. Jeff reveals he recognized Gene as Saul Goodman from when he previously lived in Albuquerque. Gene admits he is living with a secret identity.\n\nSeason 6 (2022) [ edit ]\n\nAMC renewed the series for a sixth season on January 16, 2020, with a scheduled premiere in 2021.[110] Showrunner Peter Gould confirmed it would be the show's final season and consist of 13 episodes rather than the usual 10.[111] Production experienced long delays due to COVID-19 and star Bob Odenkirk needing several weeks to fully recover from a heart attack he experienced on set.[112][113] The sixth and final season was split into two halves.[92] The first half premiered with back-to-back episodes on April 18, 2022 and concluded on May 23, 2022.[114][92] The last half of the season premiered on July 11, 2022 and concluded on August 15, 2022.[92]\n\nIn 2004, Nacho attempts to flee from the Salamancas after the attempt on Lalo's life, but after Gus falsely implicates him, Nacho sacrifices himself in exchange for his father's safety. Jimmy and Kim smear Howard's reputation, thereby forcing a settlement of the Sandpiper case. Howard confronts them, but is murdered by Lalo. Lalo uses Kim as a diversion to access the meth lab, but Gus kills him. Mike makes Howard's death appear as a suicide; he and Lalo are buried beneath the lab. A traumatized Kim quits the law and divorces Jimmy. Some time later, Jimmy has fully transformed into Saul Goodman.\n\nIn 2008, Saul deduces Walter White is \"Heisenberg\", a drug manufacturer producing high-quality crystal meth. Despite Mike's reservations, Saul decides to recruit Walter and Jesse Pinkman, a collaborator, as full-time clients.\n\nIn 2010, Gene approaches Jeff and Buddy with an offer to rob a department store. After reaching out to Kim, who now lives in Florida, Gene devises a scheme to steal identities and financial details of rich single men. When the scheme backfires, Buddy quits the operation, Jeff is arrested, and Gene is caught. He is extradited to Albuquerque and feigns testimony implicating Kim so she can be summoned to court. Jimmy confesses to Kim and those at the trial about his crimes during the events of Breaking Bad and Better Call Saul, as well as his role in Chuck's death. Jimmy is recognized as Saul in prison and gains popularity with the inmates. Kim visits him and they share a cigarette before she departs.\n\nRelease [ edit ]\n\nBroadcast [ edit ]\n\nBetter Call Saul would air on cable network AMC. The series premiere drew in 4.4 million and 4 million in the 18–49 and 25–54 demographics, respectively, and received an overall viewership of 6.9 million.[115] This was the record for the highest-rated scripted series premiere in basic cable history, until it was surpassed later the same year by another AMC series, Fear the Walking Dead.[116]\n\nStreaming [ edit ]\n\nIn December 2013, Netflix announced that the entire first season would be available for streaming in the U.S. after the airing of the first-season finale, and in Latin America and Europe each episode would be available a few days after the episode aired in the U.S.[117] However, the first season was not released on Netflix in the U.S. until February 1, 2016.[118][119] Internationally, episodes of the second season became available the day after they aired in the U.S.[120]\n\nNetflix would be the exclusive video-on-demand provider for the series and made the content available in all its territories, except for Australia and New Zealand.[117] In Australia, Better Call Saul premiered on the streaming service Stan on February 9, 2015, acting as the service's flagship program.[121][122] In New Zealand, the show was exclusive to the video-on-demand service Lightbox before moving to Neon in 2020 when both services were merged.[123][124] The episodes were available for viewing within three days of broadcast in the U.S.[125]\n\nIn the United Kingdom and Ireland, the series was acquired by Netflix on December 16, 2013.[126] The first episode premiered on February 9, 2015, with the second episode released the following day. Every subsequent episode was released each week thereafter.[127] In Ireland, the series began airing on Irish TV network TG4 on October 18, 2022.[128] In India, the series was broadcast on Colors Infinity within 24 hours of the U.S. broadcast.[129]\n\nDuring the final season's run in 2022, each episode would be available to stream the day they premiered on AMC+, AMC's streaming service which first launched in June 2020.[130][131] The sixth season premiere resulted in the biggest day of new subscriber sign-ups for AMC+, and by the mid-season finale episodic viewership on the streaming service rose by 61%.[130][132] Upon the release of the series finale, the app experienced an outage, causing many users to be logged out.[133] AMC later reported that first-day viewing numbers for the finale on AMC+ was four times as big as the season premiere, and called the series' final season the highest acquisition driver in the history of the streaming service.[134]\n\nHome media [ edit ]\n\nEach season would be released on Blu-ray and DVD.[135][136][137][138][139][140] A limited edition Blu-ray set for the first season was also released with 3D packaging and a postcard vinyl of the Better Call Saul theme song by Junior Brown.[135] The complete series was issued on Blu-ray and DVD in region 1 on December 6, 2022, which spanned 19 discs and included 70 hours of bonus features.[141][142]\n\nSeason Release dates Episodes Special features Discs Refs Region 1 Season One November 10, 2015 10 List Uncensored Episodes Cast & Crew Commentaries on Every Episode Creating the First Season Gag Reel Better Call Saul: Day One Better Call Saul Music Video Blu-ray exclusives: Deleted Scenes with Commentary by Vince Gilligan, Peter Gould and Thomas Schnauz In Conversation: Bob Odenkirk & Michael McKean Good Cop, Bad Cop: Becoming Mike Kettle Kommentary with Craig & Betsy Kettleman Jimmy in the Courtroom with Introduction by \"Mijo\" Director Michelle MacLaren Jimmy Kaleidoscope with Introduction by Co-Creator and Executive Producer Peter Gould Cast & Crew Table Read on \"Uno\" In the Studio with Junior Brown\n\nBlu-ray exclusives: 3 [ 135 ] Season Two November 15, 2016 10 List Cast & Crew Commentaries on Every Episode \"Switch\" Table Read Gag Reel Building the Shot Settling the Score: Original Music by Composer Dave Porter Blu-ray exclusives: HSC: Beaches 'n' Peaches Jimmy and Kim: A Complicated Relationship Constructing Davis & Main The Takedown Landing \"FIFI\" In Conversation: Jonathan Banks & Mark Margolis Davis & Main Mesothelioma Commercial \"Who Stole My Nest Egg?!\" Commercial Davis & Main Sandpiper Commercial \"Your [sic] the Greatest!\" Commercial\n\nBlu-ray exclusives: 3 [ 136 ] Season Three January 16, 2018 10 List Gag Reel Gene in Omaha In conversation with bob, Jonathan & Rhea Cast and Crew Commentaries on Every Episode Los Pollos Hermanos Training Videos Blu-ray exclusives: It's a Bad, Bad World Signs of Saul The Return of Gus Fring Deleted & Extended Scenes\n\nBlu-ray exclusives: 3 [ 137 ] Season Four May 7, 2019 10 List Gag Reel Slippin' Kimmy featurette Cast & Crew Audio Commentaries for all 10 Episodes Madrigal Security Training Videos with Mike Ehrmantraut Short Film: No Picnic Blu-ray exclusives: Deleted Scenes Flashing Forward, Looking Back Constructing the Superlab Storyboard comparisons and directorial walk-through\n\nBlu-ray exclusives: 3 [ 138 ] Season Five November 24, 2020 10 List Cast & Crew Commentaries on Every Episode Gag Reel Mesa Verde Bank and Trust TV spots Ethics Training with Kim Wexler Crystal Balls Blu-ray exclusives: Deleted Scenes Tell Me Again The Good, The Bags and The Ugly \"Bagman\" – The Ambush \"Bagman\" – The Cannon Roll The Effects for This!\n\nBlu-ray exclusives: 3 [ 139 ] Season Six December 6, 2022 13 List \"Wine and Roses\" - Casa Goodman Deleted Scenes Outtakes Commentaries on Every Episode Easter Eggs Filmmaker Training American Greed Blu-ray exclusives: Series Adjourned: Saying Goodbye to Saul Fear and Loathing in Omaha: The World of Gene Takavic\n\nBlu-ray exclusives: 4 [ 140 ] The Complete Series December 6, 2022 63 Collects the previously released box-sets 19 [ 141 ]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nBetter Call Saul received critical acclaim and is considered to be an outstanding example of how to successfully produce a prequel and spinoff work that defies expectations.[155] Many critics have called Better Call Saul a worthy successor to Breaking Bad and some have even deemed it superior to its predecessor. In September 2019, The Guardian ranked the show at No. 48 on its list of the 100 best TV shows of the 21st century, describing it as \"A supremely measured character piece that has steadily improved as its central tragedy has materialised.\"[156] In 2021, Empire ranked Better Call Saul at No. 27 on their list of The 100 Greatest TV Shows of All Time.[157] Also in 2021, it was voted the 23rd-best TV series of the 21st century by the BBC, as picked by 206 TV experts from around the world.[158] In September 2022, Rolling Stone listed Better Call Saul as the 32nd greatest TV show of all time, in its updated list from 2016.[159]\n\nThe first season has a 97% approval rating on the review aggregator website Rotten Tomatoes, with an average rating of 8.1/10 based on 291 reviews. The website's critical consensus reads, \"Better Call Saul is a quirky, dark character study that manages to stand on its own without being overshadowed by the series that spawned it.\"[143] Metacritic, which uses a weighted average, assigned a \"generally favorable\" score of 78 based on 43 reviews.[144]\n\nThe second season has a 97% approval rating on Rotten Tomatoes, with an average score of 8.7/10 based on 182 reviews. The website's critical consensus reads, \"Better Call Saul continues to tighten its hold on viewers with a batch of episodes that inject a surge of dramatic energy while showcasing the charms of its talented lead.\"[145] On Metacritic, it has a score of 85 out of 100, based on 18 critics, indicating \"universal acclaim\".[146]\n\nThe third season has a 98% approval rating on Rotten Tomatoes, with an average score of 8.75/10 based on 175 reviews. The website's critical consensus is, \"Better Call Saul shows no signs of slipping in season 3, as the introduction of more familiar faces causes the inevitable transformation of its lead to pick up exciting speed.\"[147] On Metacritic, it has a score of 87 out of 100, based on 18 critics, indicating \"universal acclaim\".[148]\n\nThe fourth season has a 99% approval rating on Rotten Tomatoes, with an average score of 8.9/10 based on 185 reviews. The website's critical consensus states, \"Well-crafted and compelling as ever, Better Call Saul deftly balances the show it was and the one it will inevitably become.\"[149] On Metacritic, it has a score of 87 out of 100, based on 16 reviews, indicating \"universal acclaim\".[150]\n\nThe fifth season has a 99% approval rating on Rotten Tomatoes, with an average score of 8.9/10 based on 185 reviews. The website's critical consensus is, \"Grounded by Bob Odenkirk's endlessly nuanced, lived-in performance, Better Call Saul's fifth season is a darkly funny, vividly realized master class in tragedy.\"[151] On Metacritic, it has a score of 92 out of 100 based on 16 critics, indicating \"universal acclaim\".[152]\n\nThe sixth season has a 99% approval rating on Rotten Tomatoes, with an average score of 9.4/10 based on 182 reviews. The website's critical consensus is, \"Better Call Saul remains as masterfully in control as Jimmy McGill keeps insisting he is in this final season, where years of simmering storytelling come to a scintillating boil.\"[153] On Metacritic, the season has a score of 94 out of 100 based on 20 critics, indicating \"universal acclaim\".[154]\n\nComparisons to Breaking Bad [ edit ]\n\nAfter the airing of the series finale, Stuart Jeffries of The Guardian said that the series had surprisingly surpassed its predecessor in quality, saying: \"Over six series, Better Call Saul evolved into a more profound and beautiful drama about human corruption than its predecessor. It mutated into something visually more sumptuous than Breaking Bad, while never, for a moment, losing its verbal dexterity and moral compass\".[160] Craig Elvy of Screen Rant also opined that the series was better than its predecessor, saying: \"Jimmy McGill's spinoff leaves a very familiar legacy – sustained and enthusiastic praise from audiences and critics, capped by an ending that satisfies across the board.\" He went on to say: \"When Better Call Saul began, many would've hoped the spinoff could either escape Breaking Bad's shadow, or somehow enhance Walt and Jesse's story with illuminating new details. Few dared dream Better Call Saul would achieve both, and the sheer ambition to create a spinoff that wholly embraces its predecessor whilst also existing in a totally different realm exemplifies why Better Call Saul has an ever-so-slight edge over Breaking Bad.\"[161] Jeremy Urquhart of Collider made a comparison between the quality of both series, saying: \"Breaking Bad succeeds as a crime-thriller tragedy with a fast-paced plot, and Better Call Saul works as a slower-paced, character-focused drama (with some dark comedy)\". He said the list \"doesn't aim to argue that one is better than the other. It's a matter of personal preference, but it's hard to deny that there are certain things Better Call Saul does better, but also some areas where it isn't quite as great as its parent show.\"[162]\n\nRatings [ edit ]\n\nBetter Call Saul : U.S. viewers per episode (millions) Audience measurement performed by Nielsen Media Research [ 183 ]\n\nAccolades [ edit ]\n\nBetter Call Saul received 53 Emmy Award nominations, with zero wins, which is the record for the most nominations without a win.[184] It is widely regarded as one of the greatest shows of all time to never win an Emmy.[185][186][187] It received seven nominations for Outstanding Drama Series, Bob Odenkirk received six nominations for Outstanding Lead Actor in a Drama Series, Jonathan Banks and Giancarlo Esposito were each nominated for Outstanding Supporting Actor in a Drama Series (four times for Banks and twice for Esposito), Rhea Seehorn received two nominations for Outstanding Supporting Actress in a Drama Series, and Michael McKean was nominated for Outstanding Guest Actor in a Drama Series. The series also received eight nominations for Outstanding Writing for a Drama Series and one nomination for Outstanding Directing for a Drama Series.[188]\n\nFranchise [ edit ]\n\nBetter Call Saul has its own set of official multimedia spin-offs and related media within the Breaking Bad franchise. This includes a talk show, several web series and digital shorts, comic books, and an insider podcast.[189][190][191][192]\n\nNotes [ edit ]\n\n^ Credited as Sony Pictures Television for seasons 1–5 and certain episodes of season 6.", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Vince_Gilligan_by_Gage_Skidmore_3.jpg/250px-Vince_Gilligan_by_Gage_Skidmore_3.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/40px-Wikidata-logo.svg.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Jonathan_Banks_2012_2.jpg/250px-Jonathan_Banks_2012_2.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/Bob_Odenkirk_as_Saul_Goodman_during_shooting_Breaking_Bad.jpg/250px-Bob_Odenkirk_as_Saul_Goodman_during_shooting_Breaking_Bad.jpg", "https://upload.wikimedia.org/wikipedia/en/timeline/f3uog6z9aejy2ipda4uxh9vk1fb2hzo.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Patrick_Fabian_by_Gage_Skidmore.jpg/250px-Patrick_Fabian_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Bob_Odenkirk_by_Gage_Skidmore_2.jpg/250px-Bob_Odenkirk_by_Gage_Skidmore_2.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Peter_Gould_by_Gage_Skidmore.jpg/250px-Peter_Gould_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/Cottonwood_Mall_Albuquerque_%28cropped%29.jpg/250px-Cottonwood_Mall_Albuquerque_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/Better_Call_Saul_logo.svg/1200px-Better_Call_Saul_logo.svg.png", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Wikivoyage-Logo-v3-icon.svg/40px-Wikivoyage-Logo-v3-icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/40px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f1/Tony_Dalton_%28cropped%29.jpg/250px-Tony_Dalton_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/Michael_McKean_1999.jpg/250px-Michael_McKean_1999.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Giancarlo_Esposito_by_Gage_Skidmore_2.jpg/250px-Giancarlo_Esposito_by_Gage_Skidmore_2.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/Bob_Odenkirk%2C_Rhea_Seehorn%2C_Patrick_Fabian%2C_Michael_Mando_%26_Giancarlo_Epsosito_%2843602600451%29.jpg/250px-Bob_Odenkirk%2C_Rhea_Seehorn%2C_Patrick_Fabian%2C_Michael_Mando_%26_Giancarlo_Epsosito_%2843602600451%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Michael_Mando_by_Gage_Skidmore.jpg/250px-Michael_Mando_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Rhea_Seehorn_by_Gage_Skidmore.jpg/250px-Rhea_Seehorn_by_Gage_Skidmore.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/Better_Call_Saul_logo.svg/250px-Better_Call_Saul_logo.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/20px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Old_Bernalillo_County_Courthouse.jpg/250px-Old_Bernalillo_County_Courthouse.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/Better_Call_Saul_logo.svg/1200px-Better_Call_Saul_logo.svg.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Better_Call_Saul", "title": "Better Call Saul", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/Better_Call_Saul_logo.svg/1200px-Better_Call_Saul_logo.svg.png", "width": 1200, "height": 582}, "title": "Better Call Saul - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}