{"url": "https://variety.com/2018/music/news/scott-hutchison-dead-dies-frightened-rabbit-frontman-1202806926/", "text": "A body found Thursday night is that of missing Frightened Rabbit frontman Scott Hutchison, police in Scotland confirmed Friday. The body was discovered about 8:30 p.m. local time Thursday (12:30 p.m. PT) in Port Edgar, Queensferry, just west of Edinburgh, the Scottish capital.\n\nNo official cause of death was given. A statement from Hutchison’s family, issued Friday afternoon by Police Scotland, said the singer had been struggling with mental health problems.\n\n“As a family, we are utterly devastated with the tragic loss of our beloved Scott,” the statement said. “Despite his disappearance, and the recent concerns over his mental health, we had all remained positive and hopeful that he would walk back through the door, having taken some time away to compose himself. Scott, like many artists, wore his heart on his sleeve and that was evident in the lyrics of his music and the content of many of his social media posts.”\n\nThe family said Hutchison had “battled bravely with his own issues” for many years. “Depression is a horrendous illness that does not give you any alert or indication as to when it will take hold of you,” the statement said. “We are immensely proud of [Scott] for being so open with his struggles. His willingness to discuss these matters in the public domain undoubtedly raised awareness of mental health issues and gave others confidence and belief to discuss their own issues.”\n\nThe 36-year-old singer and guitarist was reported missing early Wednesday, and was last seen near the Dakota Hotel in South Queensferry. Hutchison had issued a tweet Tuesday night referring to his life in the past tense: “Be so good to everyone you love….I didn’t live by that standard and it kills me.” Twenty minutes later, his final, poignant tweet simply said: “I’m away now. Thanks.”\n\nBe so good to everyone you love. It’s not a given. I’m so annoyed that it’s not. I didn’t live by that standard and it kills me. Please, hug your loved ones. — Scott Hutchison (@owljohn) May 8, 2018\n\nI’m away now. Thanks. — Scott Hutchison (@owljohn) May 8, 2018\n\nHutchison’s family was informed of the discovery of the body, and formal identification took place Friday.\n\nHutchison formed Scottish indie rock band Frightened Rabbit in 2003. The group’s first studio album, 2006’s “Sing the Greys,” featured just Hutchison and his brother Grant, who is the band’s drummer. Their most recent, fifth album, “Painting of a Panic Attack,” was released in 2016 on Atlantic Records.\n\nThe band also includes Billy Kennedy, Andy Monaghan and Simon Liddell. On Wednesday, the group tweeted: “We are worried about Scott, who has been missing for a little while now. He may be in a fragile state and may not be making the best decisions for himself right now.”\n\nWe are worried about Scott, who has been missing for a little while now. He may be in a fragile state and may not be making the best decisions for himself right now. Please could Scott or anyone with any information on his whereabouts please contact Police Scotland (101). — Frightened Rabbit (@FRabbits) May 9, 2018\n\nNews of the body’s discovery prompted tributes from other Scottish musicians, including Franz Ferdinand frontman Alex Kapranos and Belle and Sebastian singer Stuart Murdoch.\n\nKapranos tweeted that Hutchison’s death was “a terrible loss.” Murdoch said the Scottish music community had been praying for a different outcome and encouraged anyone “having dark thoughts” to talk to family, friends or a doctor.\n\nIrish rock band Snow Patrol said they were devastated to hear the news about their friend.\n\nScottish first minister Nicola Sturgeon said it was “heartbreaking news,” calling Hutchison “a remarkable and much loved talent.”\n\nAwful news about Scott Hutchison. A terrible loss. — Alex Kapranos (@alkapranos) May 11, 2018\n\nTragic news about Scott Hutchison. The whole music community in Scotland was praying for a different outcome. Folks, if you are up against it, having dark thoughts, please tell someone, family, a friend or a doctor. There is always another way, though it might not seem like it. — stuart murdoch (@nee_massey) May 11, 2018\n\nWe are devastated to hear the news about our friend Scott Hutchison this morning. Sending all our love to his family, friends and band mates in frightened rabbit. Xxx — Snow Patrol (@snowpatrol) May 11, 2018\n\nHeartbreaking news. My thoughts are with Scott’s family, friends and fans. A remarkable and much loved talent. @FRabbits https://t.co/nhUIPmOPCl — Nicola Sturgeon (@NicolaSturgeon) May 11, 2018\n\nFrightened Rabbit had recently completed a two-month 10th-anniversary tour titled “The Midnight Organ Fight,” with sold-out dates during February and March in Chicago, Toronto, Boston, New York, Philadelphia and Washington in the U.S., and Manchester, London and Glasgow in Britain. The band was scheduled to begin another tour later this month.\n\nThe Hutchison brothers had announced a side project, with brothers Justin and James Lockey of alt-rock band group Minor Victories, called Mastersystem, which launched a debut album April 6. Scott Hutchison also released a solo album, “Owl John,” which was also his Twitter handle, in 2014.\n\nPOPULAR ON VARIETY:", "images": ["https://variety.com/wp-content/themes/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://source.unsplash.com/random/595x333", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://variety.com/wp-content/uploads/2018/05/scott-hutchison-dead.jpg?w=1000&h=562&crop=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c4=&cv=3.9&cj=1"], "top_img": "https://variety.com/wp-content/uploads/2018/05/scott-hutchison-dead.jpg?w=1000&h=562&crop=1", "keywords": [], "authors": ["Robert Mitchell", ".Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow", "Class", "Wp-Block-Co-Authors-Plus", "Display Inline", ".Wp-Block-Co-Authors-Plus-Avatar", "Where Img", "Height Auto Max-Width", "Vertical-Align Bottom .Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow .Wp-Block-Co-Authors-Plus-Avatar", "Vertical-Align Middle .Wp-Block-Co-Authors-Plus-Avatar Is .Alignleft .Alignright"], "canonical_link": "https://variety.com/2018/music/news/scott-hutchison-dead-dies-frightened-rabbit-frontman-1202806926/", "title": "Scott Hutchison, Frightened Rabbit Frontman, Found Dead", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://variety.com/wp-content/themes/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Police confirmed Friday that a body found Thursday night is that of missing Frightened Rabbit frontman Scott Hutchison.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "robots": "max-image-preview:large", "generator": "WordPress 6.7.4", "author": "Robert Mitchell", "tags": "Scott Hutchison", "fragment": "!", "og": {"type": "article", "title": "Scott Hutchison, Frightened Rabbit Frontman, Found Dead", "url": "https://variety.com/2018/music/news/scott-hutchison-dead-dies-frightened-rabbit-frontman-1202806926/", "description": "Police confirmed Friday that a body found Thursday night is that of missing Frightened Rabbit frontman Scott Hutchison.", "site_name": "Variety", "image": {"identifier": "https://variety.com/wp-content/uploads/2018/05/scott-hutchison-dead.jpg?w=1000&h=562&crop=1", "width": 1000, "height": 562, "alt": "Scott Hutchison dead"}, "locale": "en_US"}, "article": {"published_time": "2018-05-11T12:40:33+00:00", "modified_time": "2018-05-12T13:53:56+00:00"}, "twitter": {"description": "Police confirmed Friday that a body found Thursday night is that of missing Frightened Rabbit frontman Scott Hutchison.", "site": "@variety", "card": "summary_large_image", "title": "Scott Hutchison, Frightened Rabbit Frontman, Found Dead", "image": "https://variety.com/wp-content/uploads/2018/05/scott-hutchison-dead.jpg?w=1000&h=562&crop=1"}}, "movies": [], "publish_date": 1526042433.0, "source": "https://variety.com", "summary": ""}