{"url": "https://theskincareedit.com/2018/06/08/jessica-alba-skincare-routine", "text": "Jessica Alba has two major skin struggles—not that you’d ever be able to tell. The 41-year-old actress and co-founder of The Honest Company is known for her flawless, dewy complexion, but she actually has her share of skin concerns, just like the rest of us.\n\n“One of them is my dry, flaky skin. I can get quite rashy and I have pretty sensitive skin. So I try to avoid anything that will give me that eczema-type rash. And then the other thing is congestion—having underground clogged pores and blackheads.”1\n\nDealing with these challenges over the years was why she turned to clean beauty. “All of the skincare products that I use are clean, and why I’m so passionate about it is because I’ve had such reactive skin literally since I was born. I thought I had chronic cystic acne when I was in my twenties, but what I realized is I’m just allergic to a lot of petroleum-based ingredients, and I’m also allergic to synthetic fragrances.”2,3\n\nNow, Jessica’s skincare routine is mostly her own Honest products. (“It’s the only way that I can ensure that I’m not going to have some kind of reaction.”4) She also uses an array of skin gadgets and face masks, and has regular treatments with her esthetician (and BFF) Shani Darden.\n\nReady to see which treatments keep her complexion calm, clear, and glowing? Read on.\n\nJessica Alba at the 2021 Baby2Baby Gala. Xavier Collin/Image Press Agency/ImageCollect\n\nHer Morning Skincare Routine\n\n1. Face Mask\n\nHonest\n\nHonest Prime + Perfect Mask: “Every morning, I use our Prime + Perfect Mask. I just wake up and throw it on my face! It’s like a smoothie but for your skin, and it’s packed with antioxidants. I love this mask because it makes my skin just look tighter and brighter. I feel like my pores look smaller, and it smells so good—mmm, like berries. And it has shea butter in it, so it’s really moisturizing and soft.”\n\n2. Eye and Lip Balm\n\nHonest\n\nHonest Magic Beauty Balm: “Then I use Magic Balm. It can go everywhere, but I put it on my lips, my eyelids and under my eyes. Now I let it sit for 10 minutes.”\n\n3. Konjac Sponge\n\nHonest\n\nHonest Gentle Konjac Sponge: “I love to take [the face mask] off with a sponge. I feel like the sponge also gives me a little bit of exfoliation.”\n\n4. Serums\n\nHonest\n\nHonest Calm & POREfect Serum: “I’ll use a warm washcloth to take the mask off, and then, I follow it up with our Calm & POREfect Serum.”\n\niS Clinical\n\niS Clinical Active Serum: “I have a brilliant facialist called Shani Darden, who looks after my skin. She recommended iS Clinical Active Serum and said it would stop me from getting wrinkles and breakouts. And she was right—I haven’t broken out during this pregnancy and I’ve noticed the fine lines starting to go away.”\n\n5. Moisturizers\n\nHonest\n\nHonest Hydrogel Cream: “Then, I use the Hydrogel Cream during the day. I love this because this is over 70% water. It instantly hydrates your face and your face looks like it just took a big drink of water. It absorbs quickly.”\n\nHonest\n\nHonest Deep Hydration Face Cream: “So I’ll usually use the Deep Hydration Face Cream, and do a squirt of that.”\n\n6. Balm/Face Oil\n\nHonest\n\nHonest Calm & Heal Melting Balm: “And a nice scoop of the new Calm & Heal Melting Balm. I love rubbing it into my hands, and then, once it melts and transforms, I press it into my face and my neck. There’s this face cream, the fanciest I’ve ever used, that’s popular in Hollywood, but it’s so expensive. Anytime I got the opportunity to use the cream, I loved the immediate effects of it, but then I would break out because it would clog my pores. I asked my chemist in-house, ‘Can we make something that has similar skincare benefits and texture, but without the 2,500 ingredients that we’re not using in our products?’”\n\nHonest\n\nHonest Organic Beauty Facial Oil: “[In colder weather,] I’ll add the Organic Facial Oil for my daytime routine as well, not just at night. I love the texture of this oil because it’s not heavy. It actually just melts and blends right into your skin… you can wear it over makeup or under makeup. You can even mix it with your makeup if you want that barely there bare skin look.”\n\n7. Eye Cream\n\nHonest\n\nHonest Honestly Bright Eyes Tinted Eye Cream: “Next, I’ll apply the Honestly Bright Eyes Tinted Eye Cream—it has this great hydrogel base with pigment, and it just counters the blue from my dark circles.”\n\n8. Sunscreen\n\nHonest\n\nHonest CCC Clean Corrective with Vitamin C Tinted Moisturizer SPF 30: “Then I go in with the CCC; it’s like an SPF, like a tinted moisturizer. It’s like makeup with skincare benefits. It can replace foundation and it helps block out blue light and UV rays, especially with all the exposure to our screens. Ours is great for indoors or outdoors. It’s a nice, light coverage that you can layer.”\n\n9. Lip Balms\n\nHonest\n\nHonest Magic Beauty Balm: “This is such a great product because you can put it on your lips, at the top of your cheekbones, and I like to put it down the bridge of my nose. And I’ll even do a quick glossy lid with it.”\n\nHonest\n\nHonest Gloss-C Lip Gloss: “And then, I use our Gloss-C Lip Gloss—it’s like a gloss and lip treatment in one.”\n\n10. Face Mist\n\nHonest\n\nHonest Elevated Hydration Mist: “I always finish everything off with the Elevated Hydration Mist. It’s like an instant spa treatment all the time.”\n\nHer Evening Skincare Routine\n\n1. Headband\n\nHonest\n\nHonest Fuzzy Headband: “First, a headband. It’s cute. I always pull my hair back because, you know, I would say that I’m kinda messy when it comes to my skincare.”\n\n2. Konjac Sponge\n\nHonest\n\nHonest Gentle Konjac Sponge: “I like to do just a good wipe down of the face, sort of like wiping away the day.”\n\n3. Cleansers\n\nHonest\n\nHonest Magic Gel-To-Milk Makeup Melting Cleanser: “I do like to double cleanse when I’m wearing more of a glam face. So the first one is a gel-to-milk, and what’s nice is it just sort of breaks down all of the makeup. But because it’s made with more natural ingredients, it doesn’t sting my eyes. There’s no perfume, no fragrance. It sort of transforms when you add water and you can see it gets sort of milky.”\n\nHonest\n\nHonest Calm On Foaming Cream Cleanser: “Next… I’m gonna use Calm On Foaming Cleanser by Honest Beauty, and you could really just use this. I usually just use this one every single day and it does break down makeup. But like I said, for those heavier makeup days, I do like to double cleanse.”\n\nHonest\n\nHonest Gentle Gel Cleanser: “I’ll double cleanse using the Gentle Gel Cleanser because I like my skin to feel squeaky clean. [This] doesn’t overly dry the skin. It’s great for everyone—[my daughter] Honor uses it, I use it, [my husband] Cash uses it. [My daughter] Haven even uses it.”\n\n4. Serums\n\nShani Darden\n\nShani Darden Retinol Reform: “I started using [retinol] after I had my first daughter—I don’t use it when I’m pregnant. It takes away fine lines, it takes away spots and makes the texture of my skin better. Finding a formula that isn’t too drying is the key. Mine is a lotion called Retinol Reform—my facialist makes it and she ships it all over the world. It’s the best because it doesn’t overly dry your skin, which is usually the case with retinol. As I’ve gotten older, I’ve found that I don’t have as many fine lines and wrinkles as someone my age might, and I definitely credit this to my consistent use of retinol over time.”\n\nHonest\n\nHonest Vitamin C Radiance Serum: “Now that my face is dry and cleansed, I’m going to go in with vitamin C. What I love about this vitamin C is that it actually has two hyaluronic acids with it. So it brightens your skin without drying your skin out.”\n\nHonest\n\nHonest Beauty Sleep Resurfacing Serum: “I apply Beauty Sleep Resurfacing Serum about three times a week. It works overnight to dissolve away dead skin cells, leaving me with refreshed, glowy skin. Literally I feel like in one night you can see such a difference. So I don’t know if you all have like blackheads on your nose or congestion, but in seven days of using this every night, it’s a dramatic difference. It’s recommended that you can use it once a week after that, or you could use it every day. It’s really whatever is your jam.”\n\n5. Moisturizer\n\nHonest\n\nHonest Hydrogel Cream: “The Hydrogel is amazing. It’s life-changing. Anyone that tries it is like, ‘Oh my God!’ because you don’t rub it all the way, and you leave that little bit of a layer. It has this time-release moisturizer kind of vibe. And if you want to rub it in right away and get it into your skin, it’s very watery, and it feels very refreshing. It’s like your face instantly drinks up that hydration. It’s not greasy. It’s not oily. It’s not super heavy. Letting it sit on the face for like 10 minutes makes a world of difference.”\n\n6. Face Oil/Balm\n\nHonest\n\nHonest Organic Beauty Facial Oil: “At night, I like to combine the Organic Facial Oil and the Hydrogel Cream. This is great for all skin types. It smells really nice.”\n\nHonest\n\nHonest Calm & Heal Melting Balm: “At night, I’ll use the Calm & Heal Melting Balm.”\n\n7. Eye Cream\n\nHonest\n\nHonest Calm & Renew Melting Eye Balm: “And then I’ll use the Calm & Renew Eye Balm around my eyes.”\n\n8. Lip Scrub\n\nFresh\n\n“When I’m really trying to do the most for myself, I’ll go in with a lip scrub and really go to town.”\n\n9. Lip Balm\n\nDr. Barbara Sturm\n\nDr. Barbara Sturm Lip Balm: “And then a really luxurious lip butter and layer that on. What’s nice is if you put it on right before you sleep, I feel like it just sort of penetrates.”\n\nHer Skincare Treatments\n\nFace Mask\n\nHonest\n\nHonest 3-in-1 Detox Mud Mask: “I do a lot of face masks with my daughters, at least two or three times a week. I like to use the Detox Mask to combat congestion. My daughter Honor, who’s a tween, has more of that hormonal kind of skin right now, so she does really well with the Detox Mask, too. A lot of these activated charcoal masks can be quite drying, and I wanted to create one that just doesn’t really overly dry your skin.”\n\nEye Masks\n\nComfort Zone\n\nComfort Zone Sublime Skin Eye Patch: “This I actually discovered when I was in Italy. We launched Honest Beauty at Douglas in Italy and when I was there, we went to a bunch of cities and my makeup artist discovered this amazing brand. Literally, my eyes react to so many things and these are the only patches that I can use that I haven’t had a reaction to. I wish they were cheaper!”\n\nJoanna Vargas\n\nJoanna Vargas Bright Eye Firming Mask: “These are fantastic because they’re so compact, and they’re this jelly texture. They’re very hydrating and they just feel really cooling and good underneath the eyes. You leave it on for 10 minutes and it really kind of penetrates. It takes down the appearance of crow’s feet and just makes me feel more bright and awake. I’ll even put this on when I’m flying on the plane. The person next to me usually thinks I’m crazy.”\n\nLight Therapy\n\nShani Darden by Déesse PRO\n\nShani Darden by Déesse PRO LED Light Mask: “My girlfriend, Shani Darden, she’s a facialist, and she just came out with this LED light mask that has a neck component, and that’s pretty dope. And when you’re my age, you appreciate the neck.”\n\nSculpting Tool\n\nShani Darden\n\nShani Darden Facial Sculpting Wand: “My friend Shani Darden just came out with this Facial Sculpting Wand that I love.”\n\nFacial Rollers/Massagers\n\nNurse Jamie\n\nNurse Jamie NuVibe RX Amethyst Massaging Beauty Tool: “I like to use this little device. It basically just gets the blood flowing.”\n\nReFa\n\nReFa Carat Ray Face & Body Roller: “It’s called ReFa. I actually don’t know any of the technical aspects of it. All I know is that my girlfriend, Monika Blunder, who is a makeup artist, she got this for me as a gift, and I don’t know, it just feels fancy. As you can see, I got these rosy cheeks now.”\n\nNurse Jamie\n\nNurse Jamie UpLift Facial Massaging Beauty Roller: “One last piece of the puzzle to get the circulation going is I like to use this tool. I don’t really know if I’m doing it right, but I feel like I might be. I just feel like it kind of gives you those cheekbones and under here gets rid of that double chin that you don’t want. That’s all that blood circulating.”\n\nNurse Jamie\n\nNurse Jamie Eyeonix Eye Massaging Beauty Tool: “It’s called Eyeonix, and it just sort of like vibrates… and it just feels really good on the face, especially after a long day. It feels like you’re really massaging. It’s like, how do I take the best part of a facial and bring it into my daily routine? Yes, but I wouldn’t recommend doing it on a dry face. I think you really need to have product to help move around without pulling your skin under your eyes.”\n\nFacials\n\nShani Darden: “When I became a mom, and I stopped acting full time… they say that your daughters take your beauty away from you. Well, they did! So I cried a lot, and I became best friends with my esthetician, ‘cause I basically saw her every other day. Anytime I leave, it’s weird, with her I look better. Because you know how sometimes you get facials, you look a little busted after? Go to Shani, you look better. She was the first facialist that actually made me look better right after my appointment. You usually look crazy after a facial, and need three days for your skin to calm down. That doesn’t happen with Shani.”\n\nTraci Martyn: “When I’m in New York, I’ll see Tracie Martyn for facials. She uses this zappy electric current thing that makes my skin feel really tight after. It’s amazing.”\n\nDermatologist\n\n“I don’t really have a regular dermatologist. I probably should! I feel like I really should. I am not afraid to use a skin tightening laser. Bring it! I am not afraid to use an IPL. Bring it!”\n\nHer Diet, Exercise & Lifestyle\n\nDiet\n\n“I really think [clear skin] has to do with nutrition. Staying away from refined sugars as much as you can, and carbohydrates—going for more complex carbohydrates. Having a balanced diet, having as much fresh produce as possible. Not as much processed food. And really eliminating fried foods.”\n\nNutritionist\n\nKelly LeVeque: “My go-to nutritional guru is Kelly LeVeque, so I always turn to her for advice.”\n\nHydration\n\n“I drink coconut water and I drink a ton of water. It’s not just putting hydration on the [outside], it’s also about the health of your skin inside. I think staying hydrated is really important… for glowing skin and high energy. [Dehydration] shows on the outside. As you get older, you really see it on your face.”\n\nSupplements\n\n“Definitely consult your doctor, but I do think taking a high-quality DHA is really helpful, and I am an advocate for probiotics and having a good multivitamin on hand. I also love prenatals. They’re packed with all kinds of vitamins to help grow a baby, and any time I’ve taken them, whether I was pregnant or not or trying to get pregnant or not, I’ve found that everything just looks more glowy and vibrant. I also like to put collagen in my coffee in the morning, or I’ll use a protein powder with collagen if I’m making a smoothie. I take a hyaluronic acid supplement as well.”\n\nSleep\n\n“Sleeping and eating right is more important than you think. I didn’t sleep at all in my 20s. I worked so much. I [still] don’t sleep as much as I’d like, but I don’t know if anybody does. I really want eight hours of sleep at night, but I just don’t get it.”\n\nExercise\n\n“[After] breakfast… I do try to do some movement, whether it’s yoga or spinning. We converted our garage to a gym, and there’s a bunch of workout apps.”\n\nMeditation\n\nHeadspace: “I like to listen to meditations. I did TM [transcendental meditation] but I find it’s kind of tough to meditate on your own—for me—so I like Headspace. And you can do five-minute meditations, 10-minute mediations… and you can go to whatever it is you’re dealing with. It’s pretty dope.”\n\nAttitude\n\n“As I’ve gotten older, I’ve really grown to love who I’ve become and who I’ve turned into. I don’t have the same fullness in my face that I had when I was younger, but I’m okay with having more angles. I’m okay with waking up and seeing this person that I am today because it represents the comfort and the confidence and the life experience that comes with aging—there’s just an ease now. When I was younger, I was always in my head, and I was so insecure. I was worried about such silly things that, at the end of the day, mean absolutely nothing. I wasn’t living in the moment. I didn’t have the same quality of life when I was younger as I do now. I had more collagen and fluffier cheeks and no pores, and my cellulite wasn’t as dominant… I didn’t have stretch marks on my boobs, and yet I was still so insecure about every little thing, you know? I never just enjoyed and lived in the moment, and now, it’s just like whatever! Let me live!”\n\nMore Celebrity Skincare\n\nFor more celebrity skincare, check out these celebrity skincare routines and discover the top skincare products that celebrities always use.\n\nSources: 1 • 2 • 3 • 4 • 5 • 6 • 7 • 8 • 9 • 10 • 11 • 12 • 13 • 14 • 15 • 16 • 17", "images": ["https://theglowmemo.com/wp-content/uploads/2022/11/honest-3-in-1-detox-mud-mask-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/honest-calm-on-foaming-cream-cleanser-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/honest-hydrogel-cream-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/honest-magic-gel-to-milk-makeup-melting-cleanser-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2025/11/anne-hathaway-skincare-routine-promo-v1-360x202.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/dr-barbara-sturm-lip-balm-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/honest-calm-porefect-serum-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/is-clinical-active-serum-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/honest-organic-beauty-facial-oil-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/comfort-zone-sublime-skin-eye-patch-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2023/08/jessica-alba-skincare-routine-3000x2000-1-scaled.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/honest-deep-hydration-face-cream-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/honest-fuzzy-headband-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/honest-elevated-hydration-mist-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/shani-darden-retinol-reform-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/honest-gentle-konjac-sponge-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2025/11/beauty-sales-2025-11-03-promo-360x202.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/honest-calm-renew-melting-eye-balm-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2025/11/governors-awards-2025-promo-360x202.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/honest-ccc-clean-corrective-with-vitamin-c-tinted-moisturizer-spf-30-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/shani-darden-by-deesse-pro-led-light-mask-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2023/04/jessica-alba-skincare-routine-1097x1536.jpg", "https://theglowmemo.com/wp-content/uploads/2025/11/sephora-holiday-sale-2025-promo-360x202.jpg", "https://theglowmemo.com/wp-content/uploads/2023/08/jessica-alba-skincare-routine-3000x2000-1-1024x683.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/honest-magic-beauty-balm-1-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/nurse-jamie-eyeonix-eye-massaging-beauty-tool-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/honest-gloss-c-lip-gloss-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2025/11/anya-taylor-joy-before-and-after-2025-promo-360x202.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/honest-vitamin-c-radiance-serum-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/honest-prime-perfect-mask-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/honest-beauty-sleep-resurfacing-serum-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/joanna-vargas-bright-eye-firming-mask-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/shani-darden-facial-sculpting-wand-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/nurse-jamie-nuvibe-rx-amethyst-massaging-beauty-tool-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/honest-honestly-bright-eyes-tinted-eye-cream-1536x1229.jpg", "https://theglowmemo.com/wp-content/themes/the-glow-memo/graphics/headers/the-latest.svg", "https://theglowmemo.com/wp-content/uploads/2025/11/black-friday-beauty-deals-2025-promo-360x202.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/honest-calm-heal-melting-balm-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/refa-carat-ray-face-body-roller-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/nurse-jamie-uplift-facial-massaging-beauty-roller-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2025/06/michelle-villett-150x150.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/honest-magic-beauty-balm-1536x1229.jpg", "https://theglowmemo.com/wp-content/themes/the-glow-memo/graphics/the-glow-memo.svg", "https://theglowmemo.com/wp-content/uploads/2022/11/honest-gentle-gel-cleanser-1536x1229.jpg", "https://theglowmemo.com/wp-content/uploads/2022/11/fresh-sugar-lip-polish-1536x1229.jpg"], "top_img": "https://theglowmemo.com/wp-content/uploads/2023/08/jessica-alba-skincare-routine-3000x2000-1-1024x683.jpg", "keywords": [], "authors": ["Xavier Collin Image Press Agency Imagecollect", "Is Clinical", "Shani Darden", "Dr. Barbara Sturm", "Comfort Zone", "Joanna Vargas", "Shani Darden Déesse Pro", "Nurse Jamie"], "canonical_link": "https://theglowmemo.com/jessica-alba-skincare-routine", "title": "Jessica Alba Skincare Routine and Beauty Secrets", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "Jessica Alba shares her complete skincare routine for dryness, sensitivity and congestion, including her go-to Honest Beauty products, skincare tools and more.", "robots": "follow, index, max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Jessica Alba Skincare Routine and Beauty Secrets", "description": "Jessica Alba shares her complete skincare routine for dryness, sensitivity and congestion, including her go-to Honest Beauty products, skincare tools and more.", "url": "https://theglowmemo.com/jessica-alba-skincare-routine", "site_name": "The Glow Memo", "image": {"identifier": "https://theglowmemo.com/wp-content/uploads/2023/08/jessica-alba-skincare-routine-3000x2000-1-1024x683.jpg", "secure_url": "https://theglowmemo.com/wp-content/uploads/2023/08/jessica-alba-skincare-routine-3000x2000-1-1024x683.jpg", "width": 1024, "height": 683, "alt": "Jessica Alba skincare routine", "type": "image/jpeg"}}, "article": {"tag": "Skincare Routines", "section": "Routines", "published_time": "2022-09-20T16:00:00-04:00"}, "twitter": {"card": "summary_large_image", "title": "Jessica Alba Skincare Routine and Beauty Secrets", "description": "Jessica Alba shares her complete skincare routine for dryness, sensitivity and congestion, including her go-to Honest Beauty products, skincare tools and more.", "image": "https://theglowmemo.com/wp-content/uploads/2023/08/jessica-alba-skincare-routine-3000x2000-1-1024x683.jpg", "label1": "Written by", "data1": "Michelle Villett", "label2": "Time to read", "data2": "16 minutes"}, "generator": "Site Kit by Google 1.165.0"}, "movies": [], "publish_date": 1528430400.0, "source": "https://theskincareedit.com", "summary": ""}