{"url": "https://www.washingtonblade.com/2017/11/30/shadowhunters-star-dominic-sherwood-apologizes-using-gay-slur/", "text": "Actor Guillermo Diaz has been working hard in the entertainment industry for more than three decades. Proud of his heritage and queer identity, he has broken through many glass ceilings to have a prolific career that includes tentpole moments such as roles in the films Party Girl, Half Baked, and Bros, and in major TV shows like Weeds and Scandal, and even in a Britney Spears music video. This season, he made his feature-length directorial debut with the film Dear Luke, Love Me.\n\nIn an intimate sit-down with the Blade, Diaz shares that he attributes a lot of his success to his Cuban upbringing.\n\n“Well, it prepared me to learn how to lie really well and be a good actor because it was a lot of acting like you were straight, back in the eighties and nineties (laugh). Another thing I learned from my Cuban immigrant parents is that they work super hard. They both had two jobs; we were latchkey kids, and I just saw them constantly working and wanting to provide for us by any means. So that was super instilled in me. That was the one thing that really stuck out that I admire and respect.”\n\nBesides Diaz’s recurring roles on TV, his resume includes appearances in just about every genre of programming out there. If there is a major show out there, he was probably on it. Law and Order, Girls, The Closer, Chappelle’s Show, ER, Party of Five, and the list goes on. He’s accomplished more in his career thus far than most actors do in a lifetime. There is no doubt he is a hard worker.\n\n“It’s a sign that I just loved to work, and it’s funny looking back at it now because you see all those things, but at the time it was just the next gig, the next job. I was just wanting to keep working and acting and learning and doing all that stuff. Then it sort of accumulates, and you look back and you’re like, damn! That’s a lot of stuff!”\n\nActing was never on Diaz’s radar until he was asked to fill in for a friend in a Beastie Boys medley for a talent show when he was a sophomore in high school.\n\n“I did it and fell in love with it. I was teased a lot in high school. Then, when I did that performance, all those people who teased me were like, you were so great! So I looked at it initially as a thing of like, oh, this is where I’m accepted and people like me when I’m on stage. It’s kind of sad, too, because that’s what I latched onto. And then of course, I fell in love with the craft and performing and acting, but that initial rush was because all these people who were messing with me and teasing me all of a sudden liked me. And I was like, this is what I have to do.”\n\nLittle did Diaz know that he would break the mold when it came to stereotypical casting. When he first hit the industry, diversity and positive representation were not a thing in Hollywood.\n\n“You just kind of accepted at the time. It was the early nineties. 90% of the time, it was playing a thug or a gun dealer, or a crack head – it was all bad guys, negative characters. But it was either that or not act and not be in anything. So you just kind of accept it, and then you have this sort of vision or hope that in the future it’s going to get better.\n\nDiaz’s management was trepidatious about him playing gay roles for fear of being typecast. But Diaz did play a handful of gay roles early on, although he passed on But I’m A Cheerleader, which went on to become a gay cult classic. Diaz decided early on that he was not going to hide his sexuality. Diaz appeared in the film Stonewall. That was the defining point for him in sharing his identity.\n\n“Being cast in that historical sort of dramatization of the 1969 Stonewall riots – I couldn’t believe I was in the midst that I was in the middle of doing this and playing the lead drag queen on the film. I just felt so honored, and I knew it was important, and I knew I needed to do a really good job. I thought, what a special moment this is. And it kicked my ass shooting that movie.\n\nI remember after doing Stonewall, people saying, well, now you’re either going to have to make a choice if you’re going to lie, or if you’re going to just be honest, and you’re going to have to be out from now on if you’re going to be honest. And I was like, I’m not going to freaking lie. When they’d asked me, I would say I was gay. I think because I never tried to hide it, it didn’t become a thing. So people just kind of ignored it. It didn’t mess with me or my career. I don’t know. Or I just got lucky. I don’t freaking know.”\n\nAs a queer, Latin actor, Diaz is all too aware of what is happening politically and socially in the world towards minority communities. Does he think actors have a place in politics?\n\n“For sure. I mean, we’re people first, right? Like, I hate when people sort of are like, oh, you’re an actor, shut up. I’m super political and outspoken, and I’m that guy who will say shit. I’m on the right side of history, at least. I’m not being complicit and silent. So, yeah, I think actors for sure have a place in politics. Absolutely.”\n\nWhile directing was on Diaz’s radar, it wasn’t something that he was actively searching out. But as life would have it, his friend Mallie McCown sent him her script for Dear Luke, Love Me, a film she would play the lead in. Diaz was hooked.\n\n“It was one of those scripts that I had to keep putting down every like 20 pages. I would put it down because I didn’t want it to end. It was so good. Originally, I was just going to come on as a producer of the film, and then the director dropped out, and then Mallie asked me if I was interested in directing. I was scared as shit. I had never directed a feature film. But I was like, it’s now or never.”\n\nThe film covers a decade of the friendship between Penny and Luke, covering themes of platonic love, asexuality, co-dependence, and self-identity. With most of the film focusing on just the two leads, Diaz has crafted an intimate and raw film. What is his message with the film?\n\n“That love is complicated, but it’s beautiful and rewarding and worth all the heartache. I believe that. I don’t want to give away too much in the film either, but I think everyone can relate to it because there’s heartache and there’s pain, and there’s beauty and there’s love.”\n\nAnd in looking at his past work and in looking toward his future career, what kind of legacy does Diaz want to build?\n\n“That I broke some ground, that I knocked down some walls as an artist; I’m hoping that made a difference. It’s funny because when you’re in it, you’re not thinking about all this stuff that could possibly pave the way for other people. You’re just kind of moving along and living your life. But yeah, I would hope that I broke down some walls as a queer Latino.\n\nI hope that people can sort of get something out of me trying to live as authentically as I can, just being my queer self. Hopefully, that helps someone along who is having some troubles being accepted or being comfortable with who they are.”", "images": ["data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%2078%2080'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20400%20240'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201%201'%3E%3C/svg%3E", "https://www.washingtonblade.com/content/files/2017/11/Dominic_Sherwood_Instagram_460_by_470.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201200%20800'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20360%20240'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20460%20470'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20235%20240'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20361%20240'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201200%20798'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201200%20813'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201200%201159'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20400%20221'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%2080%2080'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201200%20799'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201200%201257'%3E%3C/svg%3E"], "top_img": "https://www.washingtonblade.com/content/files/2017/11/Dominic_Sherwood_Instagram_460_by_470.jpg", "keywords": [], "authors": ["Mariah Cooper", "Alexander Rodriguez", "Michael Key", "Patrick Folliard"], "canonical_link": "https://www.washingtonblade.com/2017/11/30/shadowhunters-star-dominic-sherwood-apologizes-using-gay-slur/", "title": "'Shadowhunters' star Dominic Sherwood apologizes for using gay slur", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0, user-scalable=no", "og": {"type": "article", "image": "http://www.washingtonblade.com/content/files/2017/11/Dominic_Sherwood_Instagram_600_by_400.jpg", "url": "https://www.washingtonblade.com/2017/11/30/shadowhunters-star-dominic-sherwood-apologizes-using-gay-slur/", "title": "'Shadowhunters' star Dominic Sherwood apologizes for using gay slur", "description": "\"Shadowhunters\" actor Dominic Sherwood has apologized after he was caught using a gay slur during a Facebook Live stream.", "locale": "en_US", "site_name": "Washington Blade: LGBTQ News, Politics, LGBTQ Rights, Gay News"}, "twitter": {"image": "https://www.washingtonblade.com/content/files/2017/11/Dominic_Sherwood_Instagram_460_by_470.jpg", "card": "summary_large_image", "url": "https://www.washingtonblade.com/2017/11/30/shadowhunters-star-dominic-sherwood-apologizes-using-gay-slur/", "title": "‘Shadowhunters’ star Dominic Sherwood apologizes for using gay slur", "description": "the actor was caught on camera using derogatory language", "creator": "@WashBlade", "site": "@WashBlade", "label1": "Written by", "data1": "Mariah Cooper", "label2": "Est. reading time", "data2": "1 minute"}, "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "\"Shadowhunters\" actor Dominic Sherwood has apologized after he was caught using a gay slur during a Facebook Live stream.", "article": {"publisher": "http://www.facebook.com/WashingtonBlade", "published_time": "2017-11-30T18:07:25+00:00"}, "author": "Mariah Cooper", "generator": "WP Font Awesome Settings v1.1.10"}, "movies": [], "publish_date": 1512018000.0, "source": "https://www.washingtonblade.com", "summary": ""}