{"url": "https://en.wikipedia.org/wiki/Jennifer_Aniston", "text": "American actress (born 1969)\n\nJennifer Joanna Aniston (born February 11, 1969) is an American actress. She rose to international fame for her role as Rachel Green on the television sitcom Friends from 1994 to 2004, which earned her Primetime Emmy, Golden Globe, and Screen Actors Guild Awards. Aniston has consistently ranked among the world's highest-paid actresses, as of 2023.[1][2]\n\nThe daughter of actors John Aniston and Nancy Dow, she began working as an actress at an early age with an uncredited role in the 1988 film Mac and Me. Her first major film role came in the 1993 horror comedy Leprechaun. She has since starred in a string of successful comedy films such as Office Space (1999), Bruce Almighty (2003), The Break-Up (2006), Marley & Me (2008), Just Go with It (2011), Horrible Bosses (2011), We're the Millers (2013), Dumplin' (2018), and Murder Mystery (2019). Aniston also starred in the acclaimed independent films The Good Girl (2002), Friends with Money (2006), and Cake (2014). She returned to television in 2019, producing and starring in the Apple TV+ drama series The Morning Show, for which she received a Screen Actors Guild Award.\n\nAniston has been included in numerous magazines' lists of the world's most beautiful women. Her net worth is estimated as US$300 million, and her box office gross is over $1.6 billion worldwide.[3] She is the recipient of a star on the Hollywood Walk of Fame and is the co-founder of the production company Echo Films, established in 2008.\n\nEarly life\n\nAniston was born on February 11, 1969, in the Sherman Oaks neighborhood of Los Angeles[4][5] to Greek-born actor John Aniston and actress Nancy Dow.[4] One of her maternal great-grandfathers, Louis Grieco, was from Italy.[6] Her mother's other ancestry includes English, Irish, Scottish, and a small amount of Greek. Her father's ancestry is from the Greek island of Crete. Aniston has two half-brothers: John Melick, her older maternal half-brother; and Alex Aniston, her younger paternal half-brother.[4] Her godfather was actor Telly Savalas, one of her father's best friends.[4][7]\n\nHer family moved to New York City when she was a child.[4] Despite her father's television career, she was discouraged from watching television, though she found ways around the prohibition. When she was six, she began attending a Waldorf school.[8] Her parents divorced when she was nine.[9]\n\nHaving discovered acting at age 11 at the Waldorf school,[9] Aniston enrolled in Manhattan's Fiorello H. LaGuardia High School of Music & Art and Performing Arts, where she joined the school's drama society,[10] and where Anthony Abeson was her drama teacher.[11] She performed in The Sign in Sidney Brustein's Window by Lorraine Hansberry and Three Sisters by Anton Chekhov.[12]\n\nCareer\n\n1988–1993: Beginnings\n\nAniston with Laila Robins and Stephen Mailer in For Dear Life in 1989\n\nAniston first worked in off-Broadway productions such as For Dear Life and Dancing on Checker's Grave,[4] and supported herself with part-time jobs including work as a telemarketer, waitress and bike messenger.[4] In 1988, she had an uncredited minor role in the critically panned sci-fi adventure film Mac and Me. The next year, she appeared on The Howard Stern Show as a spokesmodel for Nutrisystem,[13] and moved back to Los Angeles.[14]\n\nHer first regular television role was in the TV series Molloy in 1990, and she appeared in the television adaptation of the 1986 film Ferris Bueller's Day Off; both series were quickly canceled. She starred as a teenage summer camp counselor in the made-for-television film Camp Cucamonga (1990), and as a spoiled teenager followed by a vengeful leprechaun in the horror film Leprechaun (1993).[15] A 2014 retrospective from Entertainment Weekly identified Leprechaun as her worst role,[16] and Aniston herself has expressed embarrassment over it.[17]\n\nAniston also appeared in the two failed television comedy series The Edge and Muddling Through,[18] and guest-starred in Quantum Leap, Herman's Head and Burke's Law.[19][20]\n\n1994–2004: Friends and worldwide recognition\n\nDepressed over her four unsuccessful television shows, Aniston approached TV executive Warren Littlefield at a Los Angeles gas station asking for reassurance. As the head of NBC entertainment, he encouraged her to continue acting, and a few months later helped cast her in Friends,[21][18] a sitcom set to debut on NBC's 1994–1995 fall lineup. The producer wanted Aniston to audition for the role of Monica Geller,[22] but Courteney Cox was deemed more suitable, and Aniston was cast as Rachel Green. She was also offered a spot as a featured player on Saturday Night Live, but turned it down in favor of Friends.[23] She played Rachel until the show ended in 2004, when Aniston took a 15-year hiatus from television save for occasional guest roles.\n\nThe program was a massive hit and Aniston, along with her co-stars, gained worldwide recognition. Her character was especially popular.[24][25] She received five Primetime Emmy Award nominations (two for Supporting Actress, three for Lead Actress), and won for Lead Actress.[26] She was also nominated for two Golden Globe Awards and won in 2003 as Best Actress – Television Series Musical or Comedy. According to the Guinness Book of World Records, Aniston (along with her female co-stars) became the highest-paid television actress of all time with her $1 million-per-episode paycheck during the final season of Friends.[27] Her character's relationship with Ross Geller, portrayed by David Schwimmer, was widely popular among audiences; they were frequently voted television's favorite couple in polls and magazines.[28]\n\nAfter a four-year hiatus, Aniston returned to film work in 1996, when she performed in the ensemble cast of romantic comedy She's the One.[29] Her first starring film vehicle was Picture Perfect (1997), where she played a struggling young advertising executive opposite Kevin Bacon and Jay Mohr. It received mixed reviews and was only a moderate commercial success;[30] but Aniston's performance was more warmly received, with many critics suggesting that she had screen presence.[31] In 1998, she appeared as a woman who falls for a gay man (played by Paul Rudd) in the romantic comedy The Object of My Affection,[32] and the next year she starred as a restaurant waitress in the cult film Office Space.[33] In 1999, Aniston had the first voice acting role of her career as a single mother in Brad Bird's animated science fiction film The Iron Giant.[34][35][36] Despite receiving critical acclaim, the film was considered a box office failure upon release,[37] but has since earned a cult following.[36]\n\nAniston appeared in the dramedy Rock Star (2001) opposite Mark Wahlberg and Dominic West. She starred in the independent dramedy The Good Girl (2002) as an unglamorous cashier who cheats on her husband. The film was a commercial success in limited release, taking in over $14 million in North America.[38] Film critic Roger Ebert declared it her breakthrough:\n\nAfter languishing in a series of overlooked movies that ranged from the entertaining Office Space to the disposable Picture Perfect, Jennifer Aniston has at last decisively broken with her Friends image in an independent film of satiric fire and emotional turmoil. It will no longer be possible to consider her in the same way.[39]\n\nAniston's biggest commercial success in film has been the comedy Bruce Almighty (2003), where she played the girlfriend of a television field reporter (Jim Carrey) offered the chance to be God for one week.[40] With a worldwide box office gross of $484 million,[41][42] it was the fifth-highest-grossing feature film of the year.[43] Aniston next starred as the old classmate of a tightly wound newlywed in the romantic comedy Along Came Polly (2004) opposite Ben Stiller,[44] which placed number one at the North American box office, earning $27.7 million in its opening weekend;[45] it eventually made $172 million worldwide.[46]\n\n2005–2013: Continued film success\n\nIn 2005, Aniston appeared as an alluring woman having an affair with an advertising executive in the thriller Derailed, and as an obituary and wedding announcement writer in the romantic comedy Rumor Has It.[47][48] Both films were moderate box office hits.[49][50] Aniston took on the role of a single, cash-strapped woman working as a maid in the independent drama Friends with Money (2006), which received a limited release.[51]\n\nHer next film was the romantic comedy The Break-Up (2006), alongside Vince Vaughn, in which she starred as one half of a couple having a complicated split when both refuse to move out of the pair's recently purchased home. It received mixed reviews but grossed approximately $39.17 million during its opening weekend and $204 million worldwide.[52] The A.V. Club's Keith Phipps gave the film a negative review, stating, \"It's like watching the 'we were on a break' episode of Friends stretched to feature length, and without the blessed relief of commercial breaks or the promise of Seinfeld around the corner.\"[53] CinemaBlend gave the film a positive review stating, \"In an era of formulaic romantic movies that bear no resemblance to reality, The Break-Up offers a refreshing flipside.\"[54]\n\nIn 2006, Aniston directed the short film Room 10, set in a hospital emergency room and starring Robin Wright and Kris Kristofferson, as part of Glamour's Reel Moments film series.[55] She noted that she was inspired to direct by actress Gwyneth Paltrow, who also directed a short film that year.[56] In 2007, Aniston guest-starred in an episode of Dirt—playing the rival of Courteney Cox's character[57]—and in an episode of 30 Rock, playing a woman who stalks Jack Donaghy.[58] For the latter she received a Primetime Emmy Award nomination as Outstanding Guest Actress in a Comedy Series.[59]\n\nAniston at the premiere of He's Just Not That Into You in 2009\n\nThe 2008 comedy drama Marley & Me, starring Aniston and Owen Wilson as the owners of the titular dog, set a record for the largest Christmas Day box office sales ever with $14.75 million. It earned a total of $51.7 million over the four-day weekend and placed number one at the box office, a position it maintained for two weeks.[60] The total worldwide gross was $242.7 million.[61] Her next film in wide release, the romantic comedy He's Just Not That Into You (2009), in which she starred opposite Ben Affleck, grossed $178.8 million globally[62] and ranked number one at the United States box office for its opening weekend.[63] While it received mixed reviews, Aniston, along with Affleck, Ginnifer Goodwin, and Jennifer Connelly, were praised by critics as standouts in the film.[64][65]\n\nAniston appeared as the former wife of a bounty hunter (Gerard Butler) in the romantic comedy action film The Bounty Hunter (2010). The film was panned by critics, with The Hollywood Reporter writing that \"the mishmash ends up as a thoroughly unfunny adult cartoon.\"[66] Nevertheless, it was a box office success, garnering over $130 million worldwide.[67] A lukewarm box office reception greeted her next film, the romantic comedy The Switch (2010), in which she starred with Jason Bateman as a 30-something single woman who decides to have a child using a sperm bank. The film's opening weekend drew what The Hollywood Reporter dubbed \"a dispiriting $8.4 million\".[68] The film received generally mixed reviews, with review site Metacritic showing 13 out of 30 critics delivering a positive verdict.[69]\n\nAniston in 2010\n\nIn 2010, Aniston was also a guest star on the season two premiere of ABC's sitcom Cougar Town, playing a psychiatrist.[70] Her announcement that she would appear on Cougar Town garnered excitement and was dubbed her return to television. The A.V. Club wrote, \"[her role] is a funny bit, and it highlights just how much Jennifer Aniston is built to be a TV star.\"[71][72][73] In 2011, she starred opposite Adam Sandler as an office manager posing as the wife of a plastic surgeon in the romantic comedy Just Go with It,[74][75][76] and played a sexually aggressive dentist in Horrible Bosses.[77] Just Go with It and Horrible Bosses both made over $100 million in North America and $200 million worldwide.[78][79]\n\nAniston appeared in the comedy Wanderlust (2012) with Paul Rudd,[80] with whom she acted in The Object of My Affection and also Friends, as a married couple who join a commune after losing their money and deciding modern life is not for them.[81] The script for Wanderlust, bought by Universal Pictures,[82] was produced by Judd Apatow.[83][84] Wanderlust received positive reviews but was a box office failure, grossing only $21 million worldwide, against a production budget of $35 million.[85] Aniston starred as a struggling stripper who agrees to pose as a wife for a drug deal, with Jason Sudeikis, in We're the Millers (2013). The film received mixed reviews from critics,[86] but was a financial success, grossing $269 million against a budget of $37 million.[87]\n\n2014–present: Film roles and return to television\n\nAniston played the role of a stoic socialite who becomes the target of an ill-planned kidnapping plot in Life of Crime (2014), a film adaptation of Elmore Leonard's 1978 novel The Switch.[88] The film was released in limited theaters, to positive reviews.[89] Catherine Shoard of The Guardian described her performance as \"endearingly comic\"[90] and Eric Kohn of IndieWire wrote that \"Aniston tops any of her recent performances with a spirited turn that harkens back to her neurotic days on Friends.\"[91] She also reprised her role for Horrible Bosses 2 (2014).[92]\n\nIn Cake (2014), Aniston starred as an astringent woman named Claire Simmons who struggles with chronic pain.[93] The film received mixed reviews; nonetheless, Aniston's performance was acclaimed, dubbed by some critics as \"Oscar-worthy\".[94][95][96][97] The Toronto International Film Festival called her performance \"heartbreakingly good\",[98] Gregory Ellwood of HitFix stated, \"It's really on most people's radar for being a rare dramatic turn for Jennifer Aniston, and she doesn't disappoint.\" He further stated, \"Aniston makes you believe in Claire's pain. She makes you believe this character is at her lowest point and only she can pull herself out of it. ... It's a complete performance from beginning to end and she deserves the appropriate accolades for it.\"[99] For her performance, Aniston was nominated for the Golden Globe Award for Best Actress in a Motion Picture – Drama, SAG Award for Outstanding Performance by a Female Actor in a Leading Role, and Critics' Choice Movie Award for Best Actress.[100][101] She was also nominated multiple nominations for its latter seasons.\n\nAniston at the London premiere of Horrible Bosses in 2011\n\nIn 2015, Aniston starred as a reluctant therapist in the screwball comedy She's Funny That Way,[102] which received mixed reviews and found a limited release in theaters, but her performance was once again noticed. Wesley Morris of Grantland called her \"one of the great screen comedians. ... Most of her scenes here are extraneous, but her vulgarity and tartness are so sharp that the movie needs them. ... This isn't just Aniston having the best stuff. It's her having the most fun with her talent. She's funny in every way.\"[103]\n\nAniston starred as the recently divorced mother of two children in the romantic comedy Mother's Day (2016), directed by Garry Marshall, and opposite Julia Roberts and Kate Hudson.[104] The film was panned by critics and a moderate commercial success.[105] In 2016, she voiced a workaholic and overprotective mother in the animated film Storks, alongside Andy Samberg and Kelsey Grammer,[106] which was released to mostly positive reviews; it grossed over $183.4 million against a $70 million budget.[107][108] Her last 2016 film role was that of a frigidly cold head honcho of a company in the comedy Office Christmas Party, directed by Will Speck and Josh Gordon and opposite Jason Bateman and Kate McKinnon.[109] It grossed $114.5 million worldwide.[110]\n\nIn The Yellow Birds, a war drama directed by Alexandre Moors, Aniston portrays the mother of a deceased soldier, alongside Alden Ehrenreich, Tye Sheridan, Jack Huston, and Toni Collette.[111] While she said she does not \"normally gravitate toward being in war films\", she made an exception because the film was \"written so beautifully and in such a way [she] had never experienced\".[112] The film, first presented at the 2017 Sundance Film Festival, received a video on demand release in June 2018.[113] The Los Angeles Times wrote in its review: \"Toni Collette and Jennifer Aniston as the soldiers' quite different but equally concerned mothers, deliver uniformly naturalistic performances\".[114]\n\nIn December 2018, Netflix released the musical comedy Dumplin', with Aniston as executive producer and star—marking her first project for a streaming service.[115] That year, she began work on another Netflix project, Murder Mystery, a comedy that reunited her with Adam Sandler, which premiered on June 14, 2019.[116] The two of them reunited for the sequel Murder Mystery 2, which premiered on March 31, 2023.[117]\n\nAniston made her return to television on November 1, 2019, producing and starring alongside Reese Witherspoon in the Apple TV+ drama The Morning Show. It was her first main television role since the conclusion of Friends in 2004.[118] For its first season, Aniston won the Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Drama Series,[119] and received a Primetime Emmy Award nomination for Outstanding Lead Actress in a Drama Series and two Golden Globe Award nominations for Best Actress – Television Series Drama and Best Television Series – Drama as a producer.[120][121] The series' subsequent seasons earned her multiple additional nominations at Critics' Choice, Golden Globe, Primetime Emmy and SAG awards.[122][123][124][125]\n\nShe reunited with her Friends cast mates for an HBO Max unscripted television special titled Friends: The Reunion in May 2021.[126] The special earned her a nomination for the Primetime Emmy Award for Outstanding Variety Special (Pre-Recorded) for her producing credit.[127]\n\nOther ventures\n\nBusiness and endorsements\n\nAniston has appeared in commercials and music videos throughout her career. After starting on Friends, Aniston and her co-star Matthew Perry shot a 60-minute instructional video for the release of Microsoft's Windows 95 operating system.[128] The next year she appeared in commercials for L'Oréal hair products.[129]\n\nUnder a contract with Elizabeth Arden, Inc.,[130] Aniston worked for over a year on her first perfume, which was released in July 2010.[131][132] Original plans called for the perfume to be named \"Lolavie by Jennifer Aniston\", but to avoid confusion with a similarly named perfume, the name was changed to simply \"Jennifer Aniston\".[133] In 2014, she launched her second perfume, named J,[134][135] followed by Near Dusk (2015),[130] Beachscape (2016),[136] Luxe and Chapter One (both in 2017), Chapter Two (2018), Silver and Solstice Bloom (both in 2020).[137][138] In 2021, Aniston launched the LolaVie haircare company.[139]\n\nSince 2007, she has worked in a publicity campaign for the drink SmartWater; on March 7, 2011, she released a YouTube video for SmartWater, Jennifer Aniston Goes Viral, which tripled online interest in the product within 24 hours of its release.[140] In 2012, Aniston co-founded hair care brand Living Proof and also became its spokeswoman. She left when the company was sold to Unilever in 2016.[141] In January 2013, she became the new spokeswoman of Aveeno Skincare.[142] Aniston is paid \"eight figures\" for her endorsement.[143] She became the new face of Emirates airline in 2015,[144] which was reportedly a success.[145] For pharmaceutical company Shire, she appeared in a 2016 campaign raising awareness about chronic dry eye.[146][147]\n\nShe appeared in the 1996 Tom Petty and the Heartbreakers music video for \"Walls\", and in Melissa Etheridge's 2001 music video for \"I Want to Be in Love\".[148][unreliable source?] She also appeared in a 2005 Heineken commercial.[129]\n\nAlong with Brad Pitt and Brad Grey, CEO of Paramount Pictures, Aniston founded the film production company Plan B Entertainment in 2002,[149] although she and Grey withdrew in 2005.[150][151] In 2008, she and producer Kristin Hahn formed Echo Films.[152]\n\nPhilanthropy\n\nAniston and Kristin Hahn during a tour of the Inova Breast Care Center in Alexandria, Virginia, in October 2011. They co-produced the breast-cancer-related film Five.\n\nAniston has been a celebrity advocate for numerous charities and received attention for her own donations. She has appeared in television commercials for St. Jude's Children's Research Hospital, and hosted September 2008's Stand Up to Cancer show.[153] In the \"It Can't Wait\" campaign to free Burma, Aniston directed and starred in a video.[154] She is a supporter of Friends of El Faro, a nonprofit organization that helps raise money for Casa Hogar Sion, an orphanage in Tijuana, Mexico.[155]\n\nOn April 14, 2007, Aniston received GLAAD's Vanguard Award for her contributions to increased visibility and understanding of the LGBT community.[156] In 2013, she was named the Entertainment Industry Foundation (EIF) ambassador for the Saks Fifth Avenue Key to the Cure campaign, which raises funds for the EIF Women's Cancer Research Fund.[157] In 2015, she supported the Comic Relief, Inc. charity.[158] Other charities that Aniston has publicly supported include Clothes Off Our Back, Feeding America, EB Medical Research Foundation, Project A.L.S., OmniPeace, and the Rape, Abuse & Incest National Network.[159]\n\nAniston donated $500,000 to Doctors Without Borders, Haitian health care provider Partners in Health and AmeriCares,[160][161] and also participated in the Hope for Haiti Now telethon. She donated $500,000 to the Red Cross and another $500,000 to the Ricky Martin Foundation in 2017 to help victims of hurricanes Harvey, Irma and Maria.[162]\n\nAfter being honored by SmartWater in 2016 for her ongoing philanthropic work for St. Jude's, Aniston spoke of the importance of philanthropy in her life to InStyle magazine: \"We live an extremely beautiful, fortunate life being able to do what we get to do for a living. And so it's a way of being able to be in a position to do something for people who are less able. It's something that makes my heart smile.\"[163]\n\nMedia image\n\nAniston's star on the Hollywood Walk of Fame\n\nThe media nicknamed Aniston \"America's sweetheart\" while she was starring in Friends.[164] In 2019, Rachel Simon of NBCNews.com said Aniston \"has filled the role of our most beloved celebrity for nearly two and a half decades now, and there are no signs of her being replaced anytime soon\", arguing that few celebrities have maintained the \"America's sweetheart\" title for as long as she has.[165] Aniston has been included in various magazine lists of the world's most beautiful women.[166][167][168] In 2005, she became the first GQ (Gentlemen's Quarterly) Woman of the Year. She has frequently appeared on People magazine's annual list of Most Beautiful Women, topping the ranking in 2004 and 2016.[169] She also topped the magazine's Best Dressed List in 2006. She has been a regular on the FHM (For Him Magazine) 100 Sexiest Women in the World list since 1996, most recently ranking at number 79 in 2012.[170] A survey of their patients by two Hollywood plastic surgeons, reported in 2011 by The Daily Telegraph, identified her (alongside Gisele Bündchen and Penélope Cruz) as having one of the most sought-after body shapes.[171] In the same year, readers of Men's Health voted her as the Sexiest Woman of All Time.[172] Men's Health also included her on its 100 Hottest Sex Symbols of All Time list, explaining that \"Her down-to-earth persona makes her seem attainable, ... she makes even pieces of flair look good. She rarely plays the airhead, and she seldom overplays a role: she's funny in a quiet, refreshingly human way. And her all-too-human love life off screen inspires sympathy ... throughout her career Aniston has remained sexy, funny, and unmistakably real.\"[173] Although Aniston disliked the hairstyle she wore during her first two years on Friends, \"The Rachel\" became very popular.[174][175]\n\nAniston was one of the world's highest-paid actresses in 2018.[176] She has been on the Forbes Top Earning Actresses list for 15 years, every year since 2001—and since then also on its Celebrity 100 list (based on \"earnings and fame\"), topping it in 2003.[177][178] According to Forbes, in October 2007, Aniston was the best-selling celebrity face of the entertainment industry.[179] The magazine estimated her net worth at $110 million in 2007,[180] and $200 million in 2017.[181] It listed her earnings as $19.5 million in 2018.[182]\n\nShe received a motion picture star on the Hollywood Walk of Fame on February 22, 2012,[183] located at 6270 Hollywood Boulevard.[184] She was ranked third on Forbes' list of the 100 Most Powerful Actresses in Hollywood in 2013.[185]\n\nIn July 2016, amidst media speculation over whether she was pregnant, Aniston penned an essay for The Huffington Post condemning the \"objectification and scrutiny we put women through\". She asserted: \"We are complete with or without a mate, with or without a child. We get to decide for ourselves what is beautiful when it comes to our bodies. [...] We don't need to be married or mothers to be complete. We get to determine our own 'happily ever after' for ourselves.\"[186] The piece was supported by many celebrities and widely covered in the media.[187]\n\nAfter years of aversion to social media, Aniston joined Instagram on October 15, 2019, causing the app to \"break\" (for hours the \"follow\" button became inoperable due to an overload of web traffic to her account) with the first picture of the planned Friends cast reunion for HBO Max (whose release was delayed until 2021 due to the COVID-19 pandemic). She broke the Guinness World Record for fastest time to reach one million followers on Instagram, by doing so within five hours and sixteen minutes.[188]\n\nPersonal life\n\nIn 2014, Aniston became a practitioner of Buddhism.[189][190][191] She practices Hatha yoga and Budokan karate.[192][193][194] In 2014, she spoke of her Transcendental Meditation practice.[195] The following year, she said dyslexia had affected her education and self-esteem and that, after being diagnosed in her twenties, her outlook toward life changed. \"I thought I wasn't smart. I just couldn't retain anything. Now I had this great discovery. I felt like all of my childhood trauma-dies, tragedies, dramas were explained.\"[196]\n\nAniston donated to Barack Obama's 2008 presidential campaign and took part in a fundraiser for Hillary Clinton during her 2016 presidential campaign.[197][198][199] She endorsed Joe Biden in the 2020 presidential election.[200]\n\nAniston does not have any children. In November 2022, she appeared on the cover of Allure for their final print issue.[201] In the accompanying interview, Aniston said she had undergone in vitro fertilization (IVF) to try to have children when she was in her thirties and forties, but the attempts did not result in any pregnancies.[202] She said, \"All the years and years and years of speculation... It was really hard. I was going through IVF, drinking Chinese teas, you name it. I was throwing everything at it.\"[201] In July 2024, after comments about \"childless cat ladies\" that Republican vice presidential nominee JD Vance made in 2021 went viral, Aniston stated on social media that:\n\nAll I can say is… Mr. Vance, I pray that your daughter is fortunate enough to bear children of her own one day (...) I hope she will not need to turn to IVF as a second option. Because you are trying to take that away from her, too.\n\nIn 2023, she said Adam Sandler's family sent her flowers every year on Mother's Day.[204]\n\nRelationships\n\nAniston met Brad Pitt in 1998, and their relationship was highly publicized.[205][206] After two years of dating, they married on July 29, 2000, in a lavish Malibu, California, wedding. For a few years, their marriage was considered a rare Hollywood success.[4] On January 7, 2005, they announced their separation,[207] and finalized their divorce on October 2.[208] During their divorce proceedings, news media speculated that Pitt had been unfaithful to Aniston with his Mr. & Mrs. Smith co-star Angelina Jolie, with whom he began a relationship soon after the split.[209] In the months following, the public's reaction towards the divorce played out as \"Team Aniston\" and \"Team Jolie\" T-shirts appeared throughout the country.[209] In 2015, Aniston said, \"Nobody did anything wrong... It was just like, sometimes things [happen].\"[196]\n\nAniston said the divorce prompted her to reach out to her mother, Nancy, from whom she had been estranged for nearly a decade. Nancy had talked about her daughter on a television show and written From Mother and Daughter to Friends: A Memoir (1999).[210][211]\n\nIn 2006, Aniston said she had been devastated by the death of her longtime therapist, whom she credited for helping make her separation from Pitt easier.[56] She said she did not regret her relationship with Pitt, describing it as \"very intense\" and \"a beautiful, complicated relationship\".[212]\n\nAniston began a relationship with actor, director, and screenwriter Justin Theroux in May 2011. The following January, they purchased a home in the Bel Air neighborhood of Los Angeles for roughly $22 million.[213] They became engaged on August 10, 2012[214] and had a non-legally binding[citation needed] wedding ceremony on August 5, 2015, at their estate.[215] They separated at the end of 2017.[216]\n\nActing credits and awards\n\nAniston received five Primetime Emmy Award nominations, two Golden Globe Award nominations, and nine SAG Award nominations for her role in Friends. From these, she won one of each. She also garnered a Primetime Emmy Award nomination for her guest appearance in 30 Rock, while her performance in Cake earned her nominations at the Golden Globe and SAG awards. Aniston additionally won a SAG Award and was nominated for a Primetime Emmy Award and a Golden Globe Award for the first season of The Morning Show, and earned multiple nominations at Critics' Choice, Golden Globe, Primetime Emmy and SAG awards for its subsequent seasons. As a producer, she was nominated for a Primetime Emmy Award and three Golden Globe Awards.\n\nAccording to review aggregator site Rotten Tomatoes and the box-office site Box Office Mojo, Aniston's most critically acclaimed and commercially successful films are Office Space (1999), The Good Girl (2002), Bruce Almighty (2003), Friends with Money (2006), The Break-Up (2006), Marley & Me (2008), Just Go with It (2011), Horrible Bosses (2011), We're the Millers (2013), and Dumplin' (2018).[217][46]\n\nSee also\n\nReferences", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/JenniferAnistonFeb09.jpg/250px-JenniferAnistonFeb09.jpg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Jennifer_Aniston_image_2_%28cropped%29.jpg/250px-Jennifer_Aniston_image_2_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/1/16/JenniferAnistonHWoFFeb2012.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/20px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Jennifer_Aniston_2011.jpg/250px-Jennifer_Aniston_2011.jpg", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/JenniferAnistonHWoFFeb2012.jpg/250px-JenniferAnistonHWoFFeb2012.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Jennifer_Aniston_signature.svg/250px-Jennifer_Aniston_signature.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Jennifer_Aniston_estrella.jpg/250px-Jennifer_Aniston_estrella.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/40px-Wikiquote-logo.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Emblem-money.svg/20px-Emblem-money.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Jennifer_Aniston_in_For_Dear_Life_%281989%29.jpg/250px-Jennifer_Aniston_in_For_Dear_Life_%281989%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/JenniferAniston08TIFF.jpg/250px-JenniferAniston08TIFF.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Jennifer_Aniston_and_Kristin_Hahn_%28cropped%29.jpg/250px-Jennifer_Aniston_and_Kristin_Hahn_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/40px-Flag_of_the_United_States.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/40px-Blank_television_set.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/20px-Video-x-generic.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/1/16/JenniferAnistonHWoFFeb2012.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jennifer_Aniston", "title": "Jennifer Aniston", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/1/16/JenniferAnistonHWoFFeb2012.jpg", "width": 1139, "height": 1200}, "title": "Jennifer Aniston - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}