{"url": "https://www.nydailynews.com/entertainment/heather-locklear-pleads-not-guilty-attacking-police-officers-article-1.3930879", "text": "Heather Locklear pleaded not guilty Thursday to charges she kicked and shoved Ventura County Sheriff’s deputies who responded to a call of possible domestic violence at her California residence in February.\n\nThe “Melrose Place” actress, 56, didn’t appear in court in person because the case is misdemeanor — so her lawyer Blair Berk entered the pleas on her behalf, a source confirmed to the Daily News.\n\nProsecutors charged Locklear last month with four counts of battery on an officer and one count of resisting arrest.\n\nShe could face a maximum sentence of up to five years if convicted on all charges.\n\nThe Ventura County District Attorney decided not to charge Locklear with felony domestic violence against her boyfriend, even though authorities originally booked her on that charge.\n\nA Sheriff’s spokesman previously told The News that Locklear turned “combative” and resisted arrest when the deputies arrived at her house and found her boyfriend with a visible “traumatic” injury.\n\n“She was immediately uncooperative. She started pushing and kicking when the deputies determined probable cause for the domestic battery and they were attempting to arrest her,” Capt. Garo Kuredjian told The News.\n\nThe deputies did not observe any injuries on Locklear, but the “Dynasty” star claimed she was hurt and visited a hospital before she was booked and released on bail, officials said.\n\nCops did not identify the boyfriend. Locklear was publicly dating former high school sweetheart Chris Heisser, 56, at the time.\n\nHeisser was arrested for DUI shortly after Locklear’s arrest.\n\nLocklear was previously arrested in 2008 on suspicion of driving under the influence. She pleaded to a lesser charge of reckless driving and was sentenced to probation.\n\nThe “T. J. Hooker” actress was one of the biggest TV stars of the 1980s and early 90s and twice married famous rock musicians.\n\nShe was hitched to Motley Crue drummer Tommy Lee from 1986 to 1993 and Bon Jovi guitarist Richie Sambora from 1994 to 2007.\n\nHer engagement to fellow “Melrose Place” star Jack Wagner hit the rocks in 2011. The couple had a post-breakup battle in December 2011 that generated a police report but no criminal charges.", "images": ["data:image/webp;base64,UklGRiQAAABXRUJQVlA4IBgAAAAwAQCdASoBAAEAAwA0JaQAA3AA/v3AgAA=", "https://secure.gravatar.com/avatar/?s=85&d=mm&r=g", "https://www.nydailynews.com/wp-content/uploads/migration/2018/04/12/PBEVMJYJJ2HIPGG3342IHSTUBM.jpg?w=1024&h=670", "https://www.nydailynews.com/wp-content/uploads/2023/08/New_York_Daily_News_nydredblack-1.svg"], "top_img": "https://www.nydailynews.com/wp-content/uploads/migration/2018/04/12/PBEVMJYJJ2HIPGG3342IHSTUBM.jpg?w=1024&h=670", "keywords": [], "authors": ["Nancy Dillon"], "canonical_link": "https://www.nydailynews.com/2018/04/12/heather-locklear-pleads-not-guilty-to-attacking-police-officers-in-february/", "title": "Heather Locklear pleads not guilty to attacking police officers in February", "meta_data": {"application-name": "newyorkdailynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "robots": "max-image-preview:large", "tdm-reservation": 1, "mrf": {"authors": "Nancy Dillon", "canonical": "https://www.nydailynews.com/2018/04/12/heather-locklear-pleads-not-guilty-to-attacking-police-officers-in-february/"}, "description": "Heather Locklear pleaded not guilty to charges she kicked and shoved deputies who responded to a call of possible domestic violence.", "generator": "WordPress 6.8.3", "og": {"type": "article", "title": "Heather Locklear pleads not guilty to attacking police officers in February", "url": "https://www.nydailynews.com/2018/04/12/heather-locklear-pleads-not-guilty-to-attacking-police-officers-in-february/", "description": "Heather Locklear pleaded not guilty Thursday to charges she kicked and shoved Ventura County Sheriff’s deputies who responded to a call of possible domestic violence at her California residen…", "site_name": "New York Daily News", "image": {"identifier": "https://www.nydailynews.com/wp-content/uploads/migration/2018/04/12/PBEVMJYJJ2HIPGG3342IHSTUBM.jpg?w=1024&h=670", "width": 1024, "height": 670}, "locale": "en_US"}, "article": {"published_time": "2018-04-12T18:36:04+00:00", "modified_time": "2018-04-12T22:45:53+00:00"}, "twitter": {"text": {"title": "Heather Locklear pleads not guilty to attacking police officers in February"}, "image": "https://www.nydailynews.com/wp-content/uploads/migration/2018/04/12/PBEVMJYJJ2HIPGG3342IHSTUBM.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.nydailynews.com/wp-content/uploads/2023/09/cropped-DailyNewsCamera-7.webp?w=270"}, "movies": [], "publish_date": 1523558164.0, "source": "https://www.nydailynews.com", "summary": ""}