{"url": "www.vanityfair.com/news/2010/12/william-and-kate-201012", "text": "I just want to go to university and have fun. I want to go there and be an ordinary student. I mean, I’m only going to university. It’s not like I’m getting married—though that’s what it feels like sometimes.—Prince William\n\nWhile members of the royal family have traditionally gone to Oxford or Cambridge, Prince William was set on breaking 150 years of tradition by going to St. Andrews, Scotland’s oldest university, 50 miles north of Edinburgh. His father, his uncle Edward, and his great-grandfather King George VI had all attended Cambridge, but the four-year history-of-art course at St. Andrews, which is considered one of the best in the United Kingdom, appealed to the prince, who was keen to postpone royal engagements for as long as possible.\n\nWilliam arrived at St. Salvator’s Hall, his home for the next year, on the crisp morning of September 23, 2001. He settled in quickly, and although the town’s 16,000 residents were initially inquisitive, they soon left him alone. William wanted to be treated the same as everyone else, and at St. Andrews he was. The media had agreed with the Palace to leave the prince in peace after he granted the world’s press a brief interview and photo call the day he arrived. He could walk down the street without being bothered and shop at the local Tesco grocery store.\n\nThe prince soon set about making friends. Nicknamed “Sally’s,” St. Salvator’s is one of the university’s 11 halls of residence and is split into male and female living quarters. As he bounded down the stairwell with his folders in his hands, William would often bump into the same brunette, who happened to have the same major. He had noticed her as soon as he arrived. It was hard not to. Kate Middleton had been crowned the prettiest girl at Sally’s by the end of freshman week. She was shy and quieter than the other girls, which William liked, and he looked forward to their meetings. Often Kate would go running before breakfast and arrive at the dining hall just before breakfast was over. Within weeks William was bold enough to invite her to join him. Every morning he and his friends sat in the same place, next to the head table, where a crimson throne and 18 seats were reserved for the wardens and deans. The impressive ground-floor dining hall was decorated with heavy oil paintings of philosophers from the Scottish Enlightenment and beautiful stained-glass windows, and there was always a cooked breakfast available. Health-conscious like his father, William would choose muesli and fruit, as did Kate.\n\nThey quickly discovered they had plenty in common. Kate was a country girl who loved playing sports and was a keen swimmer, like William. She was also a good skier and, just like William, had enjoyed a gap year traveling around the world before going to St. Andrews. Kate had spent several months in Florence, and she chatted with William about the Renaissance artists they would soon be studying and the courses they planned to take. She got along well with William’s friends Fergus Boyd, an Eton classmate, and Olli Chadwick-Healey. They were part of a group known as the Sally’s boys, which also included Ali Coutts-Wood, Graham Booth, Charlie Nelson, and Oli Baker, who would later share a house with William and Kate. If William had a scheduling conflict, Kate would take notes for him, and at the end of the day they would catch up over a drink in the common room, where the floor-to-ceiling Georgian windows looked onto the tidy gardens.\n\nWhen it came to socializing, William kept a low profile. He joined the water-polo team and would swim most mornings at the luxury Old Course Hotel with Kate. He also cycled along the North Sea and in the evening occasionally dropped into the student union for a game of pool. The truth was that William was developing a reputation for being aloof and even a touch boring. The glamorous undergraduates who spent thousands on new wardrobes and drinking in St. Andrews’s fashionable bars hoping to happen upon the prince were disappointed.\n\nDuring his first semester, William started dating an English-language and creative-writing student, Carley Massy-Birch. Often William was invited to supper at Carley’s home, where he would step over her muddy Hunter Wellington boots in the hallway. Carley was also a country girl, which appealed to William—he had been brought up in the Gloucestershire countryside. “I’m a real country bumpkin,” Carley told me. “I think that was why we had a connection. William was in the year below, and we just happened to meet through the general St. Andrews mêlée. It’s such a small place that it was impossible not to bump into William, and after a while there was nothing weird about seeing him around. We got on well, but I think we would have got on well even if nothing had been going on romantically. It was very much a university thing, just a regular university romance.” They discussed plays and literature, and Carley told William all about her home life in Devon. Other evenings they would enjoy pints of cider at the Castle pub, on North Street, and play board games or enjoy dinner parties with their friends. “There wasn’t really a club at St. Andrews, so we tended to go to pubs and bars, and there was always a good dinner party going on,” recalled Carley. Although Kate had been voted the prettiest girl at St. Salvator’s, Carley’s derrière was voted the best at St. Andrews.\n\n“We would joke that Carley’s bottom had been sculpted by the gods,” recalled one of her friends. “William was very taken with her, which was completely understandable. Unlike the hordes of made-up, pashmina-clad undergraduates who devoted their time to stalking William, Carley was happy to stay in and cook for him, and their romance was so beneath the radar it was reported only years after they had both graduated. Their affair was to be short-lived, however, and ended somewhat stickily when Carley told William he had to make a decision between her and Arabella Musgrave, a young woman hundreds of miles away who seemed to be proving something of a distraction.", "images": ["https://media.vanityfair.com/photos/6912033f02774bc2b727aee4/4:3/w_1200%2Cc_limit/undefined", "https://media.vanityfair.com/photos/68fa686659389b4cea701e19/4:3/w_1200%2Cc_limit/undefined", "https://media.vanityfair.com/photos/690e55b2c48e51f42566b396/4:3/w_1200%2Cc_limit/undefined", "https://media.vanityfair.com/photos/690af38b625f5a8c4860325f/4:3/w_1200%2Cc_limit/undefined", "https://media.vanityfair.com/photos/62fe7ae3f9f2d6c81700a52c/1:1/w_90%2Cc_limit/undefined", "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/master/w_2560%2Cc_limit/image.jpg", "https://media.vanityfair.com/photos/691388cbb0b7e0bbf578f04e/4:3/w_1200%2Cc_limit/undefined", "https://media.vanityfair.com/photos/690a5ee0da787343f1849201/4:3/w_1200%2Cc_limit/undefined", "https://media.vanityfair.com/photos/69163ff8fd759a5ca922c157/4:3/w_1200%2Cc_limit/undefined", "https://media.vanityfair.com/photos/6903bca7d353cca0e86410a6/4:3/w_1200%2Cc_limit/undefined", "https://media.vanityfair.com/photos/68f7ebfaa4240e85b9ba5766/4:3/w_1200%2Cc_limit/undefined", "https://media.vanityfair.com/photos/69161589683a0692afe31872/4:3/w_1200%2Cc_limit/undefined", "http://www.vanityfair.com/verso/static/vanityfair-global/assets/VF_Logo_Footer.svg", "https://media.vanityfair.com/photos/690a2457c9b01443eb632273/4:3/w_1200%2Cc_limit/undefined", "https://media.vanityfair.com/photos/690bcf4cd862d6f327955a94/4:3/w_1200%2Cc_limit/undefined", "http://www.vanityfair.com/verso/static/vanityfair-global/assets/VF_Logo_Inverted_Header.svg", "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1280,c_limit/image.jpg"], "top_img": "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1280,c_limit/image.jpg", "keywords": [], "authors": ["Katie Nicholl"], "canonical_link": "https://www.vanityfair.com/news/2010/12/william-and-kate-201012", "title": "Wills and the Real Girl", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "width=device-width, initial-scale=1", "author": "Katie Nicholl", "copyright": "Copyright (c) Condé Nast 2025", "description": "Royal expert Katie Nicholl surveys the breakups, the other women, and the growing bond between a future King and a country girl.", "id": "54cc225a0a5930502f5fb97b", "keywords": "royals,magazine,archive,kate middleton,prince william,society,royal watch", "news_keywords": "royals,magazine,archive,kate middleton,prince william,society,royal watch", "robots": "index, follow, noarchive, max-image-preview:large", "content-type": "article", "parsely-post-id": "54cc225a0a5930502f5fb97b", "parsely-metadata": "{\"description\":\"Royal expert Katie Nicholl surveys the breakups, the other women, and the growing bond between a future King and a country girl.\",\"image-16-9\":\"https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1000,c_limit/image.jpg\",\"image-1-1\":\"https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/1:1/w_1000,c_limit/image.jpg\"}", "og": {"description": "Royal expert Katie Nicholl surveys the breakups, the other women, and the growing bond between a future King and a country girl.", "image": "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1280,c_limit/image.jpg", "site_name": "Vanity Fair", "title": "Wills and the Real Girl", "type": "article", "url": "https://www.vanityfair.com/news/2010/12/william-and-kate-201012"}, "article": {"content_tier": "free", "opinion": "false", "section": "tags", "published_time": "2010-11-04T04:00:00.000Z", "modified_time": "2010-11-04T04:00:00.000Z", "author": "Katie Nicholl"}, "twitter": {"card": "summary_large_image", "creator": "@VanityFair", "description": "Royal expert Katie Nicholl surveys the breakups, the other women, and the growing bond between a future King and a country girl.", "domain": "https://www.vanityfair.com", "image": "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1280,c_limit/image.jpg?mbid=social_retweet", "site": "@VanityFair", "title": "Wills and the Real Girl"}, "pinterest": {"image": "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/2:3/w_1000,h_1500,c_limit/image.jpg"}, "fb": {"app_id": 256281040558, "pages": 8810407571}, "google": "nopagereadaloud", "google-signin-client_id": "1065629119444-svrqo31taikd2j0ji4dgjs9q3vul4133.apps.googleusercontent.com"}, "movies": [], "publish_date": 1288843200.0, "source": "http://www.vanityfair.com", "summary": ""}