{"url": "https://www.celebritynetworth.com/richest-politicians/democrats/maria-shriver-net-worth/", "text": "What Is Maria Shriver's Net Worth?\n\nMaria Shriver is an American journalist, author, and former First Lady of California who has a net worth of $200 million. Maria Shriver is a member of the Kennedy family through her mother, Eunice Kennedy Shriver. Eunice was one of nine children born to Joseph and Rose Kennedy. Eunice's siblings included President John F. Kennedy, Robert F. Kennedy, and Ted Kennedy.\n\nMaria began her journalism career at KYW-TV in Philadelphia before joining CBS News and later NBC News, where she became a co-anchor for \"CBS Morning News\" and \"Sunday Today.\" At NBC, she reported for \"Dateline\" and anchored numerous specials, winning multiple Emmy and Peabody awards. She served as California's First Lady from 2003-2011 while married to Arnold Schwarzenegger, focusing on women's empowerment and Alzheimer's advocacy through initiatives like The Women's Conference. As an author, she's written several bestselling books, including \"Ten Things I Wish I'd Known Before I Went Out Into The Real World\" and \"I've Been Thinking.\" She launched The Sunday Paper, a digital newsletter, and continues her journalism work through NBC News as a special anchor covering women's issues and social topics.\n\nMaria Shriver and Arnold Schwarzenegger have four children, including Katherine Schwarzenegger (born 1989) – Author and lifestyle blogger, married to actor Chris Pratt, Christina Schwarzenegger (born 1991) – Producer and filmmaker; Patrick Schwarzenegger (born 1993) – Actor and model, Christopher Schwarzenegger (born 1997) – The youngest, graduated from the University of Michigan.\n\nEarly Life\n\nMaria Owings Shriver was born on November 6, 1955, in Chicago, Illinois. Her father was a well-known politician named Sargent Shriver, and her mother was Eunice Kennedy Shriver, an activist and member of the affluent and influential Kennedy family. Because of her family roots, Maria was essentially born into royalty – or as close as one can get to royalty in the United States. While growing up, Shriver watched her uncle John. F. Kennedy win an election to become the President of the United States. Two years later, she watched her uncle get assassinated.\n\nMaria Shriver is the daughter of Eunice Kennedy Shriver (sister of President John F. Kennedy) and Sargent Shriver. This makes her JFK's niece.\n\nHer maternal aunts and uncles included:\n\nPresident John F. Kennedy\n\nSenator Robert F. Kennedy\n\nSenator Ted Kennedy\n\nPatricia Kennedy Lawford\n\nJean Kennedy Smith\n\nRosemary Kennedy\n\nKathleen Kennedy Cavendish\n\nHer first cousins include:\n\nHer maternal grandparents were Joseph P. Kennedy Sr. and Rose Fitzgerald Kennedy, who established the Kennedy political dynasty. Through this lineage, she is also related to current political figures like Joe Kennedy III (her first cousin once removed) and other members of the extended Kennedy family.\n\nRaised in a Roman Catholic household, Maria attended high school in Maryland. After graduating, she enrolled at Manhattanville College before transferring to Georgetown University and earning her Bachelor of Arts degree in American Studies.\n\nMedia Career\n\nShriver first became passionate about journalism during her father's vice-presidential campaign in 1972. After graduating from college, she worked with CBS and eventually became co-anchor of \"The CBS Morning News.\" After switching to NBC, she co-anchored \"Sunday Today\" until the end of the '80s. She then anchored shows like \"NBC Nightly News\" and \"Dateline NBC.\" She returned to journalism after becoming the First Lady of California, although she eventually stepped away because of a potential conflict of interest.\n\nMaria then became completely disillusioned with American media after the death of Anna Nicole Smith, vowing never to return to this industry. However, she joined NBC once again in 2013, working as a special anchor who focuses on women's issues in America. She also fills in as a substitute anchor on \"Today\" from time to time.\n\nOutside of journalism, Shriver has appeared in a number of movies, including \"Last Action Hero,\" and television series such as \"That's So Raven.\" She also served as the executive producer for the four-part HBO documentary \"The Alzheimer's Project.\" In addition, Maria is known for authoring several books, including \"I've Been Thinking…: Reflections Prayers and Meditations for a Meaningful Life,\" which became a bestseller.\n\nKennedy Family Fortune\n\nBecause Maria Shriver is a direct descendant of the famed Kennedy family, she receives considerable income through inheritance and other assets/trusts set up in the family name. The Kennedys are essentially considered a royal lineage in the United States, and Shriver certainly benefits from her connection to the family in a financial sense.\n\nDocuments show that Shriver collects income from assets that include \"Vornado Realty Trust\" and \"Vornado Realty Inc.\" Each of these assets is valued at $7.5 million. Reports suggest that the Kennedys have collected more than $170 million since 1998 – and that's just in dividends. The family's financial assets are set up in an ingenious manner – using a system that accepts partnership units instead of cash in order to defer capital gains taxes and depreciation.\n\nRelationships\n\nMaria Shriver met Arnold Schwarzenegger in 1977 when they were introduced at a charity tennis tournament. The pair eventually married in 1986 and subsequently had four children together, all of whom were born in Los Angeles. Their daughter Katherine is married to actor Chris Pratt. In 2011, Shriver and Schwarzenegger announced that they were getting separated, and Maria quickly moved out of the family home.\n\nLater, the reason for their split was apparently revealed when Arnold Schwarzenegger publicly admitted that he had fathered another child out of wedlock with the family maid, Mildred Patricia Baena. Shriver had previously confronted her husband about the affair after she became suspicious. Arnold's extramarital child was born 14 years prior to him making the announcement – well before he entered politics. He and Shriver eventually finalized their divorce in 2017.\n\nIn 2013, Shriver started dating Matthew Dowd, a political consultant and strategist who had previously worked on Schwarzenegger's reelection campaign.\n\nDivorce Settlement\n\nAccording to various sources, Maria Shriver was set to receive up to $200 million after her divorce from Arnold Schwarzenegger. This is because of Arnold's high net worth, which was at least double the amount Shriver received at the time of their divorce. In terms of their children, the split was handled amicably with shared custody of their two underage kids.\n\nReal Estate\n\nMaria Shriver has been quite active in the real estate market, particularly after splitting from Arnold Schwarzenegger.\n\nIn 2002, Arnold and Maria paid $4.8 million for a 6-acre property in LA's Brentwood neighborhood. The property features a 14,500-square-foot home with a tennis court, pool, and never-ending ocean views. Arnold continued owning and occupying this home after their split.\n\nAfter the divorce was finalized, Shriver paid $10 million for an 11,000-square-foot home in Brentwood, not far from the family home she once shared with her husband. In June 2022, Maria paid $12.2 million for a property immediately next door.\n\nIn 2017, Shriver reportedly started shopping for homes with the intention of giving them to her two children who had just graduated from university. Various publications suggested that Maria was eyeing up a pair of Los Angeles properties that were collectively worth about $5 million.", "images": ["https://vz.cnwimg.com/thm/1JoH3482haSLevnlEMdqhrz36y0=/132x132/center/top/filters:format(webp)/2009/11/George-Clooney.jpg", "https://vz.cnwimg.com/thm/I4dSiTJhq0kprSuO--deoPCEAmQ=/132x132/center/top/filters:format(webp)/2020/06/taylor.png", "https://vz.cnwimg.com/thm/uRsxoLs7Ymmit5ATgRtN2utad40=/221x5:381x236/132x132/filters:format(webp):strip_exif()/2009/09/P-Diddy.jpg", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "https://vz.cnwimg.com/thm/BppjT2Zi5Jmtnc-jHXC62jbOjTk=/132x132/center/top/filters:format(webp)/2013/02/Ethel-Kennedy.jpg", "https://vz.cnwimg.com/thm/uIwHXugWeWBGkVwhRSnjerqQHr4=/132x132/center/top/filters:format(webp)/2018/12/Katherine-Schwarzenegger.jpg", "https://vz.cnwimg.com/thm/0dOqT2nlNQM7u_J-5xWrCsf2nAw=/132x132/center/top/filters:format(webp)/2020/02/Angelina-Jolie.png", "https://vz.cnwimg.com/thm/_hOmdPz8Ht24ZxIeZM7m4mGRouk=/132x132/center/top/filters:format(webp)/2019/11/GettyImages-1094653148.jpg", "https://vz.cnwimg.com/wp-content/uploads/2020/08/maria-shriver.jpg?x46379", "https://vz.cnwimg.com/thm/BLl5mZxsVMfiqEw2CnQ_RrjyJjE=/601x235:1020x807/132x132/filters:format(webp):strip_exif()/2020/03/arnold.jpg", "https://vz.cnwimg.com/thm/yboGsO77E1kQwELLmrwRZv_4RmE=/132x132/center/top/filters:format(webp)/2017/02/GettyImages-528215436.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/thm/lt1abKKVHSBtY-US0k9GLU9MTmM=/132x132/center/top/filters:format(webp)/2009/09/Brad-Pitt.jpg", "https://vz.cnwimg.com/thm/vhdteMP3KRXz0FL9pVdul8--iQo=/600x300/center/top/filters:format(webp)/2020/08/maria-shriver.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/thm/dXuAPIEBU--L_kRib4u0nSzjUtE=/132x132/center/top/filters:format(webp)/2020/04/Megan-Fox.jpg", "https://vz.cnwimg.com/thm/2TjN7WqZeB5e-WDmsXe27bm950M=/132x132/center/top/filters:format(webp)/2022/11/Patrick-Schwarzenegger.jpg", "https://vz.cnwimg.com/thm/9ipEYBasB1PLdLPtphHGPRI746Y=/132x132/center/top/filters:format(webp)/2014/09/GettyImages-91172435.jpg", "https://vz.cnwimg.com/thm/UxnQSql1h0QyX1CgkPqKhTxCTHM=/132x132/center/top/filters:format(webp)/2009/09/Jennifer-Aniston.jpg", "https://vz.cnwimg.com/thm/95i5RI1LWkjHyyoolMeto-z_WeU=/132x132/center/top/filters:format(webp)/2020/01/lopez3.jpg", "https://vz.cnwimg.com/thm/KFAqJ9F4o80l6an2fe78-0jw28s=/132x132/center/top/filters:format(webp)/2019/04/rr.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2020/08/maria-shriver.jpg?x46379", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-politicians/democrats/maria-shriver-net-worth/", "title": "Maria Shriver Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Maria Shriver is an American journalist, author, and former First Lady of California who has a net worth of $200 million. Although she has certainly made a name for herself as a journalist and author, Maria Shriver", "slick": {"wpversion": "3.0.1", "wppostid": 5185, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2020/08/maria-shriver.jpg?x46379", "group": "post", "category": "democrats:Democrats"}, ";": "richest-politicians:Richest Politicians", "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "cnw": {"wppostid": 5185}, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Maria Shriver Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-politicians/democrats/maria-shriver-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2020/08/maria-shriver.jpg?x46379", "site_name": "Celebrity Net Worth", "description": "What is Maria Shriver's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2024-12-03T17:13:30+00:00", "published_time": "2020-08-23T14:20:26+00:00", "section": "Democrats", "tag": "richest democrats"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2020/08/maria-shriver.jpg?x46379", "title": "Maria Shriver Net Worth", "description": "Maria Shriver is an American journalist, author, and former First Lady of California who has a net worth of $200 million. Although she has certainly made a name for herself as a journalist and author,"}}, "movies": [], "publish_date": 1598192426.0, "source": "https://www.celebritynetworth.com", "summary": ""}