{"url": "www.mirror.co.uk/3am/celebrity-news/desperate-brad-pitt-begs-angelina-8902417", "text": "Desperate Brad Pitt BEGS Angelina Jolie to see his children after footage CLEARS him of physical abuse\n\nThe actor is believed to be blocked from seeing his children after Angelina fled LA\n\nDesperate Brad Pitt has begged Angelina Jolie to see his children after the actress 'brutally' cut all visitation.\n\n‌\n\n\n\nAngelina, who is said to be staying at a top secret location with the family, is said to be stopping the 52-year-old from visiting their six children allegedly until the FBI investigation has been completed.\n\n‌\n\n\n\nIt was alleged that Brad had an altercation with 15-year-old son Maddox on a private jet last Wednesday.\n\n‌\n\n\n\nBut Pitt could soon be vindicated after footage from Minnesota’s International Falls Airport shows the dad-of-six screaming at Maddox - but there is no physical altercation.\n\nView 8 Images Brad leaves the family jet (Image: INF)\n\nView 8 Images Brad Pitt and children Pax, Shiloh and Maddox (Image: Getty)\n\n‌\n\n\n\nView 8 Images Brad Pitt and his kids (Image: Getty)\n\nAs stories emerged about the couple's split, Brad has reportedly been crying after being left devastated by Angelina's surprise decision to file for divorce.\n\n‌\n\n\n\nIt is said the actor - who will fight for joint physical custody of the couple's six children - was shocked by his wife's decision to end their relationship of more than a decade.\n\n\"He is beside himself and has been crying. He was completely caught off guard and blindsided and had no idea she would do this,\" a source told Us Weekly.\n\n\"Angelina filed the court papers a minute before the courts closed on Monday night. He didn’t have a lawyer or anything. She had threatened divorce in the past but he did not think she would file this time.”\n\n‌\n\n\n\nView 8 Images Brad has apparently been left devastated (Image: FameFlynet.uk.com)\n\n‌\n\n\n\nView 8 Images Pax Jolie-Pitt, Vivienne Jolie-Pitt, Angelina Jolie, Shiloh Jolie-Pitt, Maddox Jolie-Pitt, Knox Jolie-Pitt, Zahara Jolie-Pitt, Brad Pitt June 06, 2015 Couple Brad Pitt and Angelina departing on a flight with their kids Maddox, Pax, Zahara, Shiloh, Vivienne and Knox at LAX airport in Los Angeles, California. (Image: Fameflynet)\n\nHollywood star Brad is at the centre of claims he clashed with one of his kids on board a private plane days before his wife filed for divorce.\n\nThe FBI said they are \"continuing to gather facts\" regarding the claims, while Brad is said to be \"cooperating fully\".\n\n‌\n\n\n\nSources close to the World War Z star told Mirror Celeb: \"He [Brad] is a very caring and attentive father and it's sad that people are continuing these smears, which only hurt the children and the entire family.\"\n\nView 8 Images Angelina Jolie filed for divorce following a 12 year relationship (Image: Getty)\n\nThe actor is accused of being \"wasted\" and \"screaming\" while in the air with his partner and their children.\n\n‌\n\n\n\nIt is claimed Brad began arguing with his wife on the flight from Europe to LA, and when their 15-year-old Maddox jumped up to defend her, he allegedly \"lunged\" at his son.\n\nThe source continued: \"These claims are exaggerated and fabricated. It's unfortunate for the whole family that people are insisting on continuing this endless smear campaign against Brad that hurts everyone.\n\n\"They are a solid family with two caring parents and a normal share of disagreements. Hopefully people can move on and leave them all alone to work this out.\"\n\n‌\n\n\n\nBrangelina:, A timeline of their Hollywood romance and divorce\n\nIt comes as sources close to Brad gave an insight into his \"typical disagreements\" with 15-year-old Maddox and Pax, who turns 13 in November.\n\nA source said: \"Angelina as a mother can be very protective. It was a typical disagreement between parents and kids. Things got heated but they were never in physical danger.\n\n‌\n\n\n\n\"They both love the kids more than anything else in the world. Maddox and Pax are very protective of their mother and they are both growing up and developing their own personalities.\n\n\"And while sometimes there is screaming and yelling and they can all get boisterous, there is no huge problems here. Brad's relationship with the older boys is great but from time to time they have differences, which is very normal for fathers with teenage boys.\"\n\nView 8 Images Brad Pitt and his kids (Image: Getty)\n\n‌\n\n\n\nThe source added to E! News Angelina has \"a totally different approach to parenting\".\n\nThe insider added Pitt - who is \"cooperating fully\" with authorities - denies being abusive and wants to do what is best for his children.\n\nAngelina filed for divorce on Monday citing irreconcilable differences and asking for sole physical custody of their six children, including 11-year-old Zahara, 10-year-old Shiloh, and 8-year-old twins Knox and Vivienne.\n\n‌\n\n\n\nView 8 Images (Image: Splash News)\n\nIn a statement, Angelina said the decision to file for divorce had been made for the 'health of the family'.\n\nAngelina's manager said: \"Angelina is doing what's best in the interest of taking care of her children. She appreciates everyone's understanding of their need for privacy at this time.\"\n\nArticle continues below\n\nAnd entertainment attorney Robert Offer added: \"Angelina has filed for dissolution of the marriage. This decision was made for the health of the family. She will not be commenting, and asks that the family be given its privacy at this time.\"\n\nBrad said in a statement following the divorce: \"I am very saddened by this, but what matters most now is the wellbeing of our kids.\"", "images": ["http://www.mirror.co.uk/footer/trust-project.svg", "https://i2-prod.mirror.co.uk/article8894099.ece/ALTERNATES/s615b/I160922_162740_812495oTextTRMRMMGLPICT000100197919oED.jpg", "https://i2-prod.mirror.co.uk/article8894093.ece/ALTERNATES/s615b/I160922_175611_1131177oTextTRMRMMGLPICT000100193552o.jpg", "https://i2-prod.mirror.co.uk/article8895411.ece/ALTERNATES/s810/MAIN-Brad-Pitt-Maddox-and-Pax.jpg", "https://i2-prod.mirror.co.uk/article8902391.ece/ALTERNATES/s1200/Brad-Pitt-Main.jpg", "https://i2-prod.mirror.co.uk/article8890900.ece/ALTERNATES/s615b/Brad-Pitt-and-Angelina-Jolie.jpg", "https://i2-prod.mirror.co.uk/article7220569.ece/ALTERNATES/s810/sat-travel-supplement.jpg", "https://i2-prod.mirror.co.uk/article8880470.ece/ALTERNATES/s615b/Brad-Pitt-and-Angelina-Jolie-walking-with-their-six-kids-in-New-Orleans-USAED.jpg", "https://i2-prod.mirror.co.uk/article8894102.ece/ALTERNATES/s615b/I160922_165618_915589oTextTRMRMMGLPICT000100370741o.jpg", "http://www.mirror.co.uk/nav-web-static/release-v41-14493b7c888038a7d89b99cb3a7937c2b71eaebe/public/logo-reach.png", "https://i2-prod.mirror.co.uk/article8917186.ece/ALTERNATES/s810/Brad-MAIN.jpg", "http://brightcove01.brightcove.com/24/4221396001/201609/1590/4221396001_5136333987001_5133943944001-vs.jpg?pubId=4221396001", "http://www.mirror.co.uk/footer/ipso.svg", "https://i2-prod.mirror.co.uk/article8894621.ece/ALTERNATES/s615b/Brad-Pitt-and-his-kids.jpg", "https://i2-prod.mirror.co.uk/article8895413.ece/ALTERNATES/s615b/Brad-Pitt-Pax-and-Maddox.jpg", "http://www.mirror.co.uk/assets/mirror/logos/masthead-mirror-default.svg", "https://i2-prod.mirror.co.uk/article6492368.ece/ALTERNATES/s810/Brad-Pitt-Angelina-Jolie.jpg"], "top_img": "https://i2-prod.mirror.co.uk/article8902391.ece/ALTERNATES/s1200/Brad-Pitt-Main.jpg", "keywords": [], "authors": ["Lucy", "Updated"], "canonical_link": "https://www.mirror.co.uk/3am/celebrity-news/desperate-brad-pitt-begs-angelina-8902417", "title": "Desperate Brad Pitt BEGS Angelina Jolie to see his children after footage CLEARS him of physical abuse", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"page_id": 6149699161, "app_id": 123792601022133, "pages": 1814357575554395}, "description": "The actor is believed to be blocked from seeing his children after Angelina fled LA", "author": "Lucy  Buckland", "robots": "noarchive, max-image-preview:large", "Googlebot-News": "noarchive", "referrer": "unsafe-URL", "keywords": "Angelina Jolie, Brad Pitt, Angelina Jolie children, Angelina Jolie and Brad Pitt, Celebrity kids, Brangelina divorce", "news_keywords": "Angelina Jolie, Brad Pitt, Angelina Jolie children, Angelina Jolie and Brad Pitt, Celebrity kids, Brangelina divorce", "allowTaboolaDeepDive": "true", "og": {"title": "Brad Pitt could be cleared of child abuse", "description": "The actor is believed to be blocked from seeing his children after Angelina fled LA", "url": "http://www.mirror.co.uk/3am/celebrity-news/desperate-brad-pitt-begs-angelina-8902417", "site_name": "Daily Mirror", "locale": "en_GB", "image": "https://i2-prod.mirror.co.uk/article8902391.ece/ALTERNATES/s1200/Brad-Pitt-Main.jpg", "type": "article"}, "article": {"published_time": "2016-09-24T06:53:36Z", "modified_time": "2016-09-26T08:11:32Z", "author": "http://www.facebook.com/MirrorCeleb", "section": "Celebrity News", "tag": "Brangelina divorce"}, "twitter": {"card": "summary_large_image", "site": "@DailyMirror", "creator": "@Lucy_Mirror", "title": "Desperate Brad Pitt BEGS Angelina Jolie to see his children after footage CLEARS him of physical abuse  - The Mirror", "description": "The actor is believed to be blocked from seeing his children after Angelina fled LA", "image": "https://i2-prod.mirror.co.uk/article8902391.ece/ALTERNATES/s1200/Brad-Pitt-Main.jpg"}}, "movies": [], "publish_date": 1474700016.0, "source": "http://www.mirror.co.uk", "summary": ""}