{"url": "https://en.wikipedia.org/wiki/Miss_United_States", "text": "American beauty pageant\n\nMiss United States 2024, Lindsey Langston\n\nMiss United States is a pageant held in the United States for unmarried women between the ages of 20 and 29. The pageant includes women selected to represent all 50 states, District of Columbia, American Samoa, Guam, Commonwealth of the Northern Mariana Islands, Puerto Rico, and the U.S. Virgin Islands.\n\nThe Miss United States pageant's mission is to \"celebrate intelligent women of all walks of life.\"[1] The Miss United States pageant includes the following competition segments: Private Interview (a 3-minute private interview with judges about the delegate's career, academic, and charitable accomplishments), Evening Gown (a runway walk in formalwear to demonstrate the delegate's poise), Swimsuit (a runway walk in swimwear to display the delegate's physical fitness and on-stage confidence), and Personal Platform Promise (a 60-second 'pitch' of the delegate's chosen charitable cause followed by an onstage question).[2] All four competition segments are worth 25% of the delegate's overall score.[2]\n\nMiss United States is part of the pageant system known as Mrs. United States Pageant, Inc. (DBA United States National Pageants)[3] which has eight divisions: Little Miss United States, Miss Pre-Teen United States, Miss Jr. Teen United States, Miss Teen United States, Miss United States, Ms. United States, Ms. Woman United States, and Mrs. United States. United States National Pageants is the official and exclusive owner of the \"Miss United States\" trademark. In 2016, Miss United States organizers held the national pageant in Las Vegas, where it initially was held, for a 30th anniversary celebration. The upcoming 2025 pageant will be returning to Las Vegas. [4]\n\nThe reigning Miss United States is Lindsey Langston, who was crowned on October 8, 2024 in Memphis, Tennessee.[5]\n\nNotable recent Miss United States titleholders include Miss United States 2013 Candiace Dillard, who was a reality television personality on Bravo's Real Housewives of Potomac; Miss United States 2022 Lily K. Donaldson, who was the first Miss United States to visit all 50 states during her reign;[6] and Miss United States 2014 Elizabeth Safrit, who also represented the United States at Miss World 2014 in London, England on December 14, 2014, where she placed as 2nd runner-up and earned the title of Continental Queen of Beauty of the Americas.\n\nTitleholders [ edit ]\n\n*From 1933 to 1952 (with the exception of 1935), \"Miss United States\" pageants may have been held by different organizations across the U.S., but there was no centralized organization or trademark.\n\nIn popular media [ edit ]\n\nIn the 2000 American comedy film Miss Congeniality, the FBI asks tomboy agent Gracie (Sandra Bullock) to go under cover as a contestant when a terrorist threatens to bomb the Miss United States pageant. The film also popularized the pop-culture phrase \"she's beauty and she's grace\" from the Miss United States song which has lyrics \"she's beauty and she's grace, she's Miss United States.\"[40]\n\nHistory [ edit ]\n\nRehoboth Beach 1880 pageant [ edit ]\n\nThe very first use of the title \"Miss United States\" allegedly goes back as far as 1880, when Rehoboth Beach, Delaware, held the first recorded \"beauty pageant\" in the United States searching for \"the most beautiful unmarried woman in our nation\" and awarding her the title of 'Miss United States'.[38][41][42] Some attribute this 1880 pageant to P.T. Barnum,[43] although, this may be confused with P.T. Barnum's unsuccessful effort in the 1850s to start a live beauty contest.[44] Several sources, including PBS and the History Channel, cite Thomas Edison as a judge of the 1880 Miss United States pageant.[44][45] However, the very existence of this 1880 pageant is contested.[46][39]\n\nMany news articles about the current Miss United States organization cite the first Miss United States pageant as taking place in 1937 with the title being award to Miss California,[47][48][49] however, other sources point to the first Miss United States title as being awarded in 1925 to Miss California.[50] A 1937 Albuquerque newspaper names the 1937 Miss United States winner as Margaret Smith of Tennessee.[51] One source says the pageant was put on hold during World War 1, and then re-established in 1937,[50] however, the Boston Globe published a 1929 article naming Irene Ahlberg as Miss United States 1929[52] and Universal Newsreel footage from 1931 shows Miss United States 1931, Ann Lee Patterson.[31] Some of this confusion stems from the conflation of the original Miss Universe (International Pageant of Pulchritude) which also selected a 'Miss United States'[53] and the modern Miss Universe pageant which began in 1952 and where from 1952 to 1961, the U.S. representative was called 'Miss United States of America' before the title was renamed to 'Miss USA' in 1962.[54] The International Pageant of Pulchritude, which existed from 1920 to 1935, was the first international beauty pageant and crowned both a 'Miss United States' and 'Miss Universe'.[53]\n\nAdditionally, national \"Miss United States\" pageants were held after 1935 by several different entities across the United States including American Legion auxiliaries[24][26] and Biloxi event promoter R.H. Thompson.[23] Patriotic festivals/parades also often had a young woman play \"Miss United States\" for the festivities, unrelated to a pageant or competition.[55]\n\nThe title \"Miss United States\" was trademarked by Catalina Swimwear (which founded the Miss USA and Miss Universe pageants) in 1957.[56] Catalina Swimwear's competitions, which began in 1952, included both \"Miss Universe\" and \"Miss United States of America\", which would be renamed to \"Miss USA\" in 1962. The \"Miss United States\" trademark was then transferred in accordance with the change of Miss USA ownership, including to Donald Trump's pageant business \"Trump Pageants, L.P.\" in 1996 and to the Miss Universe organization in 1997,[56] although the pageant never used the title \"Miss United States\" or \"Miss United States of America\" after 1962. Organizers of the pageant that chooses the U.S. representative to Miss World used the title \"Miss United States\" from 1958 to 1961.[citation needed]\n\nIn December 2000 (one year after the expiration of the 'Miss United States' trademark), the film Miss Congeniality (which was centered around a 'Miss United States' pageant) was released grossing $212 million worldwide against its $45 million budget.[57] The following year, Mrs. United States Pageant, Inc. (who previously held 'Mrs. United States' and 'Miss Teen United States' pageants) held a \"Miss United States\" pageant for the first time, with their former Miss Teen United States, Starla Smith, taking the crown.[14] Mrs. United States Pageant, Inc. currently owns the \"Miss United States\" trademark which was applied for in 2005, and registered in 2008.[58] In 2012, the Mrs. United States Pageant, Inc. sued organizers of a \"Miss United States of America\" pageant for trademark infringement, and won.[59]\n\nThe \"Miss United States\" pageant is held annually alongside the corporation's Little Miss United States, Miss Pre-Teen United States, Miss Jr. Teen United States, Miss Teen United States, Ms. United States, Ms. Woman United States, and Mrs. United States pageants.[60]\n\nGallery of Past Titleholders [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/6/6d/Lindsey_Langston_-_Miss_United_States_2024.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Miss_United_States_2016_-_Alayah_Benavidez.jpg/250px-Miss_United_States_2016_-_Alayah_Benavidez.jpg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Miss_United_States_with_WWII_Rosies.jpg/250px-Miss_United_States_with_WWII_Rosies.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/97/Alexia_Robinson_-_Miss_United_States_2019.jpg/250px-Alexia_Robinson_-_Miss_United_States_2019.jpg", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/Lindsey_Langston_-_Miss_United_States_2024.jpg/250px-Lindsey_Langston_-_Miss_United_States_2024.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Miss_United_States_2014.jpg/250px-Miss_United_States_2014.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Addison_Grace_Hadley_-_Miss_United_States_2023.jpg/120px-Addison_Grace_Hadley_-_Miss_United_States_2023.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Samantha_Keene_Anderson_-_Miss_United_States_2021.jpg/250px-Samantha_Keene_Anderson_-_Miss_United_States_2021.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Miss_United_States_2017.jpg/250px-Miss_United_States_2017.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Miss_United_States_2012_-_Whitney_Miller_%2852563764975%29.jpg/120px-Miss_United_States_2012_-_Whitney_Miller_%2852563764975%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Miss_United_States_2013.jpg/250px-Miss_United_States_2013.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Tiffany_Rea_-_Miss_United_States_2020.jpg/120px-Tiffany_Rea_-_Miss_United_States_2020.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Miss_United_States_2018.jpg/250px-Miss_United_States_2018.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Lindsey_Langston_-_Miss_United_States_2024.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Miss_United_States", "title": "Miss United States", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Lindsey_Langston_-_Miss_United_States_2024.jpg", "width": 800, "height": 1200}, "title": "Miss United States - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}