{"url": "www.mirror.co.uk/3am/celebrity-news/taylor-swift-tom-hiddleston-obvious-8205027", "text": "Taylor Swift and Tom Hiddleston had 'obvious chemistry' during flirty Met Ball dance-off BEFORE Calvin Harris split\n\nThe couple were spotted locking lips just two weeks after the singer's relationship with Calvin Harris came to an end\n\nView 8 Images\n\nTaylor Swift and Tom Hiddleston 's dance-off at this year's Met Ball, while she was still publicly dating Calvin Harris has taken on a whole new significance following the pictures of the pair kissing.\n\n‌\n\n\n\nThe Shake It Off star, 26, was caught in a passionate embrace with the Night Manager actor, 35, near her Rhode Island home in photos that emerged last night, just two weeks after it was confirmed she had split from the Scottish DJ after a 15 month romance.\n\n‌\n\n\n\nFour weeks before the break-up and Swift and Hiddleston had put on a VERY flirty display as they hit the dancefloor at the Met Ball where Taylor was on co-hosting duties with Vogue editor-in-chief Anna Wintour.\n\n‌\n\n\n\nView 8 Images Taylor and Tom throw some shapes (Image: Instagram)\n\nView 8 Images Are they Crazy In Love? (Image: Instagram)\n\nVideos from the night - that Calvin was noticeably absent from - show the pair throwing shapes to Beyonce's Crazy In Love and appear oblivious to anyone else around them.\n\n‌\n\n\n\nThe duo are known for loving a turn on the dancefloor - but was there more to it then just an innocent booty shake?\n\nInsiders later admitted there was obvious \"chemistry\" between the couple and it's clear in the video that Taylor and Tom can barely tear their eyes each other as they gyrate along to the music.\n\nTaylor even suggestively brushes past the actor as she carries on the dance session.\n\n‌\n\n\n\nView 8 Images (Image: David Fisher/REX/Shutterstock)\n\nAccording to The Sun Taylor had been \"won over\" by Hiddleston after the flirty dance-off, and while insiders claim he began \"pursuing\" her after they first met, they insisted that there was NO overlap with her romance with Calvin.\n\n‌\n\n\n\n“Tom has been courting Taylor since they met – he sent her flowers. She’s been won over,\" a source told the paper.\n\n“The timing of this looks very bad for Taylor. There was an obvious connection with Tom at the Met Gala – you can see that in the video of them dancing together.\"\n\nThey continued: “Her people are insistent that no one else was involved in the split with Calvin, which is most likely the case.\n\n‌\n\n\n\n“But it feels pretty disrespectful to be moving on to someone so public so quickly.”\n\nView 8 Images Tom Hiddleston at The Metropolitan Museum of Art's Costume Institute Benefit (Image: REX)\n\nThe new couple also spent the night together before the gala event.\n\n‌\n\n\n\nBoth were guests at Anna Wintour's private dinner on the eve of the fashion bash, with Taylor spotted gazing at the actor in the hallway of the New York residence as he headed home with actor Idris Elba.\n\nAnother insider claimed after the Met Gala it was \"no surprise\" these two have got together.\n\n“She wasn't single at the time of the Gala but the chemistry between them was very obvious, so it's not really surprising that he wants to get together with her now,” an insider told Reveal magazine.\n\n‌\n\n\n\nView 8 Images Caylor ended their romance earlier this month (Image: Getty)\n\n“Tom called her right after the news of her break-up came out and they talked for almost an hour,” they continued.\n\n“She barely hung up the phone when a bouquet of flowers arrived at her door – Tom managed to order them while he was on the phone with her.”\n\n‌\n\n\n\nCalvin and Swift's 15-month romance came to an abrupt end at the start of June, just weeks after she had gushed about how amazing Calvin was as she picked up an award at the iHeart Radio Awards in April.\n\nView 8 Images The DJ congratulates his girlfriend at the iHeart Radio Awards (Image: Getty)\n\nView 8 Images The PDA moment came just months before the split (Image: Getty)\n\nArticle continues below\n\nShe said at the time: \"For the first time I had the most amazing person to come home to when the spotlight went out and when the crowds were all gone.\n\n\"So I want to thank my boyfriend Adam for that and I love you guys so much.\"", "images": ["http://www.mirror.co.uk/footer/trust-project.svg", "https://i2-prod.mirror.co.uk/article7895374.ece/ALTERNATES/s615b/Taylor-Swift-Tom-Hiddleston.jpg", "https://i2-prod.mirror.co.uk/article7895375.ece/ALTERNATES/s615b/Taylor-Swift-Tom-Hiddleston.jpg", "https://i2-prod.mirror.co.uk/article7684622.ece/ALTERNATES/s615b/Taylor-Swift-iHeartRadio-awards-2016.jpg", "http://www.mirror.co.uk/nav-web-static/release-v41-14493b7c888038a7d89b99cb3a7937c2b71eaebe/public/logo-reach.png", "https://i2-prod.mirror.co.uk/article6408422.ece/ALTERNATES/s615b/Calvin-Harris-and-Taylor-Swift.jpg", "https://i2-prod.mirror.co.uk/article8203433.ece/ALTERNATES/s1200/TomHiddlestonTaylorSwiftMain.jpg", "https://i2-prod.mirror.co.uk/article7895637.ece/ALTERNATES/s615/Tom Hiddleston and Taylor Swift dance their butts off", "https://i2-prod.mirror.co.uk/article7684616.ece/ALTERNATES/s615b/Taylor-Swift-iHeartRadio-awards-2016.jpg", "http://www.mirror.co.uk/footer/ipso.svg", "https://i2-prod.mirror.co.uk/article7883940.ece/ALTERNATES/s615b/Taylor-Swift-Met-Gala-2016.jpg", "https://i2-prod.mirror.co.uk/article7884581.ece/ALTERNATES/s615b/Tom-Hiddleston-at-The-Metropolitan-Museum-of-Arts-Costume-Institute-Benefit.jpg", "http://www.mirror.co.uk/assets/mirror/logos/masthead-mirror-default.svg"], "top_img": "https://i2-prod.mirror.co.uk/article8203433.ece/ALTERNATES/s1200/TomHiddlestonTaylorSwiftMain.jpg", "keywords": [], "authors": ["Zoe Shenton", "Rebecca Merriman", "Updated"], "canonical_link": "https://www.mirror.co.uk/3am/celebrity-news/taylor-swift-tom-hiddleston-obvious-8205027", "title": "Taylor Swift and Tom Hiddleston had 'obvious chemistry' during flirty Met Ball dance-off BEFORE Calvin Harris split", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"page_id": 6149699161, "app_id": 123792601022133, "pages": 1814357575554395}, "description": "The couple were spotted locking lips just two weeks after the singer's relationship with Calvin Harris came to an end", "author": "Rebecca Merriman", "robots": "noarchive, max-image-preview:large", "Googlebot-News": "noarchive", "referrer": "unsafe-URL", "keywords": "Calvin Harris, Taylor Swift, Tom Hiddleston", "news_keywords": "Calvin Harris, Taylor Swift, Tom Hiddleston", "allowTaboolaDeepDive": "true", "vf": {"00000000-0000-4000-8000-67e599051dc3": "mirror-prod-8205027"}, "og": {"title": "Taylor Swift and Tom Hiddleston's flirty Met Ball dance - before Calvin split", "description": "The couple were spotted locking lips just two weeks after the singer's relationship with Calvin Harris came to an end", "url": "http://www.mirror.co.uk/3am/celebrity-news/taylor-swift-tom-hiddleston-obvious-8205027", "site_name": "Daily Mirror", "locale": "en_GB", "image": "https://i2-prod.mirror.co.uk/article8203433.ece/ALTERNATES/s1200/TomHiddlestonTaylorSwiftMain.jpg", "type": "article"}, "article": {"published_time": "2016-06-16T09:23:16Z", "modified_time": "2016-06-16T12:52:08Z", "author": "Rebecca Merriman", "section": "Celebrity News", "tag": "Tom Hiddleston"}, "twitter": {"card": "summary_large_image", "site": "@DailyMirror", "creator": "@DailyMirror", "title": "Taylor Swift and Tom Hiddleston had 'obvious chemistry' during flirty Met Ball dance-off BEFORE Calvin Harris split - The Mirror", "description": "The couple were spotted locking lips just two weeks after the singer's relationship with Calvin Harris came to an end", "image": "https://i2-prod.mirror.co.uk/article8203433.ece/ALTERNATES/s1200/TomHiddlestonTaylorSwiftMain.jpg"}}, "movies": [], "publish_date": 1466068996.0, "source": "http://www.mirror.co.uk", "summary": ""}