{"url": "https://www.huffingtonpost.com/entry/serena-williams-hbo-documentary-series_us_5ab56841e4b054d118e2c8ae", "text": "Serena Williams will soon show an intimate side of her life to fans.\n\nOn May 2, HBO will premiere “Being Serena,” a five-part documentary series about the tennis superstar that will not only delve into Williams’ career, but will also chronicle her 2017 marriage to Reddit co-founder Alexis Ohanian and the birth of her first child, Alexis Olympia Ohanian Jr.\n\nWilliams has spoken about complications she faced throughout her pregnancy, revealing that she almost died after giving birth to her daughter. The new series takes a deeper dive into what really went on, as well as into Williams’ journey back to the tennis court.\n\nAdvertisement\n\n\"Being Serena,\" a new five-part HBO series about tennis superstar Serena Williams, premieres on May 2. Tim Clayton - Corbis via Getty Images\n\n“When I realized that I was pregnant I was like, ‘Oh my God. How am I going to play?’” Williams says in the “Being Serena” teaser, exclusively premiering on HuffPost. “I put so much pressure on myself. I want to make sure that I’m the best.”\n\nA post shared by Serena Williams (@serenawilliams) on Mar 26, 2018 at 7:55am PDT\n\nAdvertisement\n\n“Being Serena” also touches on Williams’ life as a businesswoman and investor in technology, fashion, fitness and philanthropy.\n\n“HBO is honored to work with Serena Williams on such a personal project,” Peter Nelson, executive vice president, HBO Sports, said in a statement. “Even though she has been in the spotlight since her teenage years, Serena continues to capture the imagination.”\n\nAt 36, Williams has had quite the career, with 39 Grand Slam titles and four Olympic Gold Medals. She’s won the most women’s singles match victories in Grand Slam history.\n\nAdvertisement\n\nWilliams returned to the court last week to compete for one of the first times since her 13-month break. After losing to Naomi Osaka in the first round of the Miami Open on Wednesday, she released a statement saying, “Every tournament is an opportunity for me to better understand the areas I need to improve to be my best. Naomi played a great match and I learn something each time I play. I look forward to continuing my return by progressing every day. I’m so grateful for my fans who continue to support me every step of this incredible journey.”\n\nShe also posted this photo on Instagram with an inspirational caption, alluding to the complications she suffered during ― and after ― the birth of her daughter.\n\nA post shared by Serena Williams (@serenawilliams) on Mar 22, 2018 at 5:45am PDT\n\nAdvertisement\n\nWilliams is clearly committed to staying in the game.\n\n“I don’t know if there’s anything left for me in tennis,” she says in the documentary. “But I’m not done yet.”\n\nThe first episode of “Being Serena,” produced as a partnership with IMG’s Original Content Group, debuts on HBO May 2 at 10 p.m. The remaining installments will air subsequent Wednesdays at the same time.\n\nStories That Inspire You Your Support Fuels Our Mission Your Support Fuels Our Mission Become a Member Today As the year ends, our reporting does not slow down. Support the journalists who continue asking questions and telling stories with depth and care. Your membership today helps ensure we start the new year strong. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. Support HuffPost Already a member? Log in to hide these messages.\n\nWilliams sits on the board of advisers to Oath, HuffPost’s parent company, which is owned by Verizon.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "https://img.huffingtonpost.com/asset/5ab910921e000008087afc47.jpeg?cache=8DXRunOcu3&ops=scalefit_720_noupscale", "https://img.huffingtonpost.com/asset/5ab910921e000008087afc47.jpeg?cache=8DXRunOcu3&ops=1200_630", "https://img.huffingtonpost.com/asset/5d3749602600002900045422.jpg?ops=100_100", "https://img.huffingtonpost.com/asset/691c87541700009d2b9c5f37.jpg?ops=50_50"], "top_img": "https://img.huffingtonpost.com/asset/5ab910921e000008087afc47.jpeg?cache=8DXRunOcu3&ops=1200_630", "keywords": [], "authors": ["Whitney Snyder", "Editor-In-Chief Huffpost"], "canonical_link": "https://www.huffpost.com/entry/serena-williams-hbo-documentary-series_n_5ab56841e4b054d118e2c8ae", "title": "Serena Williams Gets Personal In New HBO Documentary Series", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "“I put so much pressure on myself. I want to make sure that I’m the best.\"", "keywords": "hbo,Serena Williams,Tennis,Sports and Recreation,documentary,Being Serena", "fb": {"app_id": 46744042133}, "og": {"title": "Serena Williams Gets Personal In New HBO Documentary Series", "type": "article", "image": {"identifier": "https://img.huffingtonpost.com/asset/5ab910921e000008087afc47.jpeg?cache=8DXRunOcu3&ops=1200_630", "url": "https://img.huffingtonpost.com/asset/5ab910921e000008087afc47.jpeg?cache=8DXRunOcu3&ops=1200_630", "type": "image/jpeg", "width": 1200, "height": 630}, "url": "https://www.huffpost.com/entry/serena-williams-hbo-documentary-series_n_5ab56841e4b054d118e2c8ae", "site_name": "HuffPost", "locale": "en_US", "description": "“I put so much pressure on myself. I want to make sure that I’m the best.\""}, "article": {"tag": "hbo,Serena Williams,Tennis,Sports and Recreation,documentary,Being Serena", "section": "Entertainment", "published_time": "2018-03-26T16:46:09Z", "modified_time": "2018-03-26T17:25:12Z"}, "twitter": {"card": "summary_large_image", "site": "@HuffPostEnt", "title": "Serena Williams Gets Personal In New HBO Documentary Series", "image": {"identifier": "https://img.huffingtonpost.com/asset/5ab910921e000008087afc47.jpeg?cache=8DXRunOcu3&ops=1200_630", "width": 1200, "height": 630}, "description": "“I put so much pressure on myself. I want to make sure that I’m the best.\""}, "al": {"ios": {"url": "huffpostnews:///?editionID=us&entryID=us_5ab56841e4b054d118e2c8ae", "app_store_id": 306621789, "app_name": "HuffPost"}}, "bingbot": "noarchive", "robots": "max-snippet:-1,max-image-preview:large,max-video-preview:-1", "google-site-verification": "97Mj-wW7u8U1NOnkW1rfH-I1kgO0-a9YsgoesOk41R8"}, "movies": ["https://www.youtube.com/embed/udW7HcmDMJY?rel=0&showinfo=0&enablejsapi=1"], "publish_date": 1522082769.0, "source": "https://www.huffingtonpost.com", "summary": ""}