{"url": "https://web.archive.org/web/20170209201732/http://time.com/4660266/best-grammy-dresses/", "text": "While the Grammys recognize the best of the best in the music industry , the ceremony is also a huge night for fashion, a fact that's not lost on style-savvy artists.\n\nWhile some go for full-on glamour like J. Lo in her infamous green Versace dress in 2000 , others have used red carpet fashion as yet another medium to express themselves. Case in point: Lady Gaga's show-stopping ensembles that could function as performance art.\n\nThroughout the years, there have been some especially unforgettable style moments at the Grammy ceremony — take a look at the most memorable looks of all time below.\n\nAmerican soul singer Aretha Franklin stands backstage wearing an gold embroidered gown and holding a Grammy Award, circa 1970. Tim Boxer—Getty Images Aretha Franklin, 1970 Aretha Franklin picked up her Grammy in 1970 in a regal red and gold gown with a matching scarf.\n\nEntertainer Cher attends the Grammy awards wearing a large butterfly pin in her hair on March 2, 1974 in Los Angeles, California. Michael Ochs Archives—This content is subject to copyright. Cher, 1974 A young Cher showed off her famously toned abs at the 1974 Grammy Awards with a sheer white bandeau top and matching butterfly accessories.\n\nGrace Jones and Rick James Ron Galella—WireImage Grace Jones and Rick James, 1983 If there was ever a duo that embodied the gender-blurring, decadent funk of the '80s, it would be none other than Rick James and Grace Jones who presented an award together in 1983. The supermodel singer wore a structurally ambitious dress and a sweeping hat, while James sported an embellished jacket, leather trousers and his trademark braids.\n\nMichael Jackson Ron Galella—WireImage Michael Jackson, 1984 The King of Pop glittered on the 1984 Grammys red carpet in an ensemble that included all the elements of his now-legendary style: aviator sunglasses, a bedazzled military-inspired jacket resplendent with epaulets and a sash, and of course, his iconic jeweled glove.\n\nCyndi Lauper Ron Galella—WireImage Cyndi Lauper, 1984 Cyndi Lauper's eccentric fashion statement and coordinating eye makeup at the 1984 Grammy Awards proved that she was, indeed, \"so unusual.\"\n\nPrince attending 30th Annual Grammy Awards on March 2, 1988 at Radio City Music Hall in New York City, New York. Ron Galella—WireImage Prince, 1988 The Purple One took his already outrageous style to new heights with his ensemble for the 1988 Grammy Awards, where he wore a low cut, double-breasted, black-and-white polka dotted suit with a pair of matching high heels. The gender-fluid getup was a sign of the times . If there was anyone who had to match the over-the-top looks of the '80s, it was definitely Prince.\n\nGwen Stefani KMazur—WireImage Gwen Stefani, 1997 Stefani's never been one to dress demurely, as evidenced by many of her late '90s outfits. When she showed up to the Grammys in 1997, Stefani wore a slip dress and matching dress with chinoiserie vibes, accessorizing her look with her trademark red lip and a devil-may-care attitude. Stefani also sported a thoroughly un-P.C. bindi, something she's been criticized for more than once .\n\nErykah Badu at the 1999 Grammy Awards held in Los Angeles, CA on February 24, 1999 Frank Micelotta Archive—Getty Images Erykah Badu, 1999 The queen of neo-soul brought funky elegance to the Grammy Awards in 1999 with a leather patchwork column dress and a matching head wrap.\n\nLauryn Hill SGranitz—WireImage Lauryn Hill, 1999 Lauryn Hill opted for a casually chic look of a cropped sweater and a maxi skirt to pick up a record-setting five Grammys for her now-iconic The Miseducation of Lauryn Hill .\n\nJennifer Lopez backstage at the 42nd Annual Grammy Awards at Staples Center in Los Angeles, 2/23/00. Scott Gries—Getty Images Jennifer Lopez, 2000 Has there ever been another dress more memorable than J. Lo's infamous down-to-there-slit-up-here green Versace dress that she wore to the 2000 Grammy Awards? Let's put it this way: Google only let people search for text until this dress. Because of the record number of queries for Jenny's provocative look, the search engine created a way for people to find images .\n\nBritney Spears KMazur—WireImage Britney Spears, 2000 Spears' Grammy debut had the pop princess trading in her girl-next-door appeal for some serious glam: her Oscar de la Renta dress paired with a fur stole and diamond jewelry showed that Brit could clean up nicely.\n\nDestiny's Child poses backstage with their awards at the 43rd annual Grammy Awards February 21, 2001 at Staples Center in Los Angeles, CA. David McNew—Getty Images Destiny's Child, 2001 Destiny's Child collected their Grammys in 2001 in looks by none other than the inimitable Tina Knowles , who created nearly all of their infamous matching outfits during their early years as a girl group.\n\nChristina Aguilera arrives at the 43rd Annual Grammy Awards February 21, 2001 at the Staples Center in Los Angeles, CA. Chris Weeks—Getty Images Christina Aguilera, 2001 This look was Aguilera at the peak of her \"Xtina\" phase; while there were no chaps on the red carpet for this event, Aguilera still commanded the red carpet by wearing a macrame-esque dress.\n\nToni Braxton with Grammy backstage at the 43rd Annual Grammy Awards at Staples Center in Los Angeles Wednesday, Feb. 21, 2001. Scott Gries—Getty Images Toni Braxton, 2001 Toni Braxton left little to the imagination when she wore a breezy dress to pick up her Grammy in 2001.\n\nLil Kim during The 44th Annual Grammy Awards at Staples Center in Los Angeles, California, United States. Jeff Kravitz—FilmMagic, Inc Lil' Kim, 2002 Lil' Kim took her signature racy style literally when she showed up on the Grammy red carpet in 2002 clad in a pair of low-slung, moto-inspired red leather pants and a matching cropped jacket. Rounding out her look? A Chanel belt and motorcycle helmet.\n\nAndre Benjamin and Big Boi of Outkast during The 44th Annual Grammy Awards at Staples Center in Los Angeles, California, United States. Jeff Kravitz—FilmMagic, Inc OutKast, 2002 OutKast looked spottieottiedopaliscious — that is to say, suavely dapper — in pastel colored suits and fly accessories (a fuzzy topper for Big Boi and Adidas superstars for Three Stacks) at the 2002 Grammys.\n\nAvril Lavigne during The 45th Annual GRAMMY Awards - Arrivals at Madison Square Garden in New York, NY, United States. Jeff Kravitz—FilmMagic, Inc Avril Lavigne, 2003 Lavigne channeled her skater girl persona with a punky ensemble that included Chuck Taylor high-top sneakers, a bow tie, and a blazer with a very important message in electrician's tape.\n\nMissy Elliott during The 45th Annual GRAMMY Awards - Arrivals at Madison Square Garden in New York City, New York, United States. Jim Spellman—WireImage Missy Elliott, 2003 Before the term \"athleisure\" was coined, Missy Elliot was rocking Adidas tracksuits with vim on the red carpet. Her pink velour one at the 2003 Grammy (where she collected an award for \"Scream a.k.a. Itchin'\") paired with classic Adidas shell-toe Superstars, chain, and a fluffy hat was not only super duper fly, but a refreshing respite from the usual parade of gowns.\n\nSinger Tina Turner on stage at the 50th Annual GRAMMY Awards at the Staples Center on February 10, 2008 in Los Angeles, California. Michael Caulfield—WireImage Tina Turner, 2008 Tina Turner showed off the most iconic gams in the game when she wore a metallic leather jumpsuit while performing with Beyoncé in 2008.\n\nSinger M.I.A. performs onstage at the 51st Annual GRAMMY Awards held at the Staples Center on February 8, 2009 in Los Angeles, California. Jeff Kravitz—FilmMagic M.I.A., 2009 M.I.A. might have shared the Grammys stage with the most recognized names in hip hop in 2009 during a performance of T.I.'s \"Swagga Like Us\" — appearing with the likes of Jay Z, Lil Wayne, Kanye West, and Tip — but all eyes were on her as she rapped on stage in a sheer mini dress by House of Holland, while nine months pregnant.\n\nLady Gaga arrives at the 52nd Annual GRAMMY Awards held at Staples Center on January 31, 2010 in Los Angeles, California. Jason Merritt—Getty Images Lady Gaga, 2010 When Lady Gaga hit the Grammys' red carpet in a structural, sparkling creation from Armani Privé in 2010, it was clear that the pop star was truly out of this world. While Gaga would show up to other shows in other outlandish looks (including, memorably, an egg at another Grammy ceremony and a meat dress at the MTV Video Music Awards ,) this galactic dress set a precedent for the zany style that became Gaga's default awards show attire.\n\nSinger Nicki Minaj (R) arrives at the 54th Annual GRAMMY Awards held at Staples Center on February 12, 2012 in Los Angeles, California. Jason Merritt—Getty Images Nicki Minaj, 2012 Nicki Minaj got tongues wagging when she showed up at the 2012 Grammy Awards dressed in a dramatic, bright red Versace cape and an unusual accessory — a plus one who was dressed like the Pope.\n\nSinger Pharrell attends the 56th GRAMMY Awards at Staples Center on January 26, 2014 in Los Angeles, California. Lester Cohen—WireImage Pharrell, 2014 Pharrell took home four Grammys in 2014 after having a landmark year. However, it was his tall, Arby's-esque Vivienne Westwood topper that was the talk of the ceremony both on and off the red carpet, inspiring its own parody Twitter account . It later sold for over $40,000 to benefit his educational non-profit, From One Hand to AnOTHER.\n\nRihanna attends The 57th Annual GRAMMY Awards at the STAPLES Center on February 8, 2015 in Los Angeles, California. Jason Merritt—Getty Images Rihanna, 2015 Rihanna's rosy, voluminous Giambattista Valli couture gown wasn't just show-stopping on the Grammy's red carpet — the many layers of silk and tulle made the dress so large that it appeared to take up multiple seats and made Ri Ri visible from even the nosebleeds . In the true spirit of the Internet, the dress inspired comparisons to everything from a cupcake to a loofah .", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://web.archive.org/web/20170209201732im_/https://timedotcom.files.wordpress.com/2017/02/grammys-fashion1.jpg?w=720"], "top_img": "https://web.archive.org/web/20170209201732im_/https://timedotcom.files.wordpress.com/2017/02/grammys-fashion1.jpg?w=720", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20170209201732/http://time.com/4660266/best-grammy-dresses/", "title": "The 25 Most Memorable Grammy Looks of All Time", "meta_data": {"description": "The Grammys recognize the best of the best in the music industry, but the ceremony is also a huge night for fashion.", "keywords": "grammys, grammys fashion, best grammys fashion, best grammy looks of all time, best grammy looks ever, grammy best dressed red carpet, grammy best dressed male, grammy fashion best dressed, best grammy outfits, grammy best dressed of all time, grammys red carpet photos", "news_keywords": "grammys, grammys fashion, best grammys fashion, best grammy looks of all time, best grammy looks ever, grammy best dressed red carpet, grammy best dressed male, grammy fashion best dressed, best grammy outfits, grammy best dressed of all time, grammys red carpet photos", "og": {"site_name": "Time", "type": "article", "locale": "en_US", "url": "https://web.archive.org/web/20170209201732/http://time.com/4660266/best-grammy-dresses/", "title": "The 25 Most Memorable Grammy Looks of All Time", "description": "From Lil' Kim to Lady Gaga", "image": "https://web.archive.org/web/20170209201732im_/https://timedotcom.files.wordpress.com/2017/02/grammys-fashion1.jpg?w=720"}, "author": "Cady Lang", "fb": {"app_id": 53177223193}, "twitter": {"site": "@TIME", "title": "The 25 Most Memorable Grammy Looks of All Time", "description": "The 25 most memorable Grammy looks of all time", "card": "summary_large_image"}, "article": {"author": "http://time.com/author/cady-lang/"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}