{"url": "https://www.thewrap.com/marvel-movies-ranked-worst-best-avengers-infinity-war-ant-man-venom-stan-lee-spider-man-into-the-spider-verse/", "text": "This year will end up bringing us five (5) new Marvel movies, and “Venom: Let There Be Carnage” is the third — “Eternals” and “Spider-Man: No Way Home” are still on the way. How does the only non-MCU Marvel flick on the 2021 docket fare against all the previous Marvel flicks?\n\n62. “Fantastic Four: Rise of the Silver Surfer”\n\nJust a nightmare. A total nightmare. There have been a number of bad superhero movies, but from the talking gas cloud the filmmakers cast as Galactus to Jessica Alba‘s dye job, this one transcends bad.\n\n61. “X-Men Origins: Wolverine”\n\nA totally chaotic stir fry of nonsense that tells the story of how Wolverine got his claws. Features an early version of Deadpool (also played by Ryan Reynolds) whose mouth is stapled shut, which should tell you all you need to know about it.\n\n60. “Elektra”\n\nThat five minutes when they tried to turn Jennifer Garner into an action star went about as well as it should have.\n\n59. “X-Men: The Last Stand”\n\nJust a total mess, incoherent from the word “go.” After losing director of the first two X-Men films Brian Singer to the first Superman reboot attempt, replacement Matthew Vaughn gave way to eventual director Brett Ratner, who might have killed off the superhero genre entirely were “Spider-Man” not blowing up the box office.\n\n58. “Fantastic Four” (2015)\n\nThere could maybe have been a good movie in here somewhere — the cast (Michael B Jordan, Miles Teller, Kate Mara) certainly warranted one. But this Frankenstein of a film is a behind-the-scenes horror story, and you can see it in the totally disjointed final product.\n\n57. “Daredevil”\n\nThis was basically “Early-2000s: The Movie,” with Ben Affleck, Jennifer Garner, Colin Farrell and Michael Clark Duncan as the main players. The cherry on top of this turd sundae was that damn Evanescence song.\n\n56. “Fantastic Four” (2005)\n\nTim Story‘s first “Fantastic Four” is just sort of there, challenging you to remember it exists. With Chris Evans, who played the Human Torch here, going on to embody Captain America in the Marvel Cinematic Universe, that gets tougher every year.\n\n55. “The Punisher” (2004)\n\nThis is the Punisher as a straight revenge thriller, and it’s not bad. Thomas Jane performs admirably, but the whole thing is missing that extra something that would have elevated it beyond standard genre fare. Setting it in Tampa didn’t help.\n\n54. “Spider-Man 3”\n\nMaybe the bad outweighs the good here, but Emo Peter Parker’s dance number remains one of the greatest single moments in any comic book movie, sorry, haters.\n\n53. “Howard the Duck”\n\nA notorious flop at the box office and, yeah, it’s not exactly “good.” But now, 30 years removed from its premiere, “Howard the Duck” is pretty fun as a relic of the ’80s.\n\n52. “The Punisher” (1989)\n\nDolph Lundgren and Louis Gossett Jr. star in a low-rent ’80s grunge C-level classic. This one’s all novelty value.\n\n51. “Ghost Rider”\n\nFor a movie starring Nic Cage about a dude who rides a Harley and turns into a flaming skeleton, this is a surprisingly mundane movie.\n\n50. “The Amazing Spider-Man”\n\nWe may never figure out what went wrong with Marc Webb‘s Spider-Man duology, but his choice of Andrew Garfield to play Peter Parker is still brilliant. It just sucks that this movie doesn’t really make any sense.\n\n49. “X-Men”\n\nThe beginning of the current wave of theatrical superhero movies, “X-Men” was kind of a cheapie and it showed. Novel at the time, now it just comes off as unremarkable mid-budget action fare as Fox was merely sticking its toe in the superhero waters. Timid.\n\n48. “The Incredible Hulk”\n\nEvery time I watch this one I spend the first 45 minutes or so wondering if maybe it’s secretly good. The rest of the movie then demonstrates pretty clearly that no, it is not secretly good.\n\n47. “Thor”\n\nThe fantasy Marvel movie is directed by Kenneth Branagh, who covers the whole movie in canted angle shots and theatrical stylings. It’s pretty boring, also, but at least it looks cool.\n\n46. “The Amazing Spider-Man 2”\n\nMore of the same impossible-to-follow hack-n’-slash plotting from the previous movie, offset by Andrew Garfield continuing to be awesome and Jamie Foxx going way over the top as the big bad.\n\n45. “Thor: The Dark World”\n\n“The Dark World,” in contrast to the first “Thor” movie, is certainly not boring. If anything, it suffers the opposite problem, going so hard and fast that it loses substance.\n\n44. “Blade: Trinity”\n\nStarring a pre-Deadpool Ryan Reynolds basically playing a vampire-slaying Deadpool, throwing out one-liners like his mama’s life depended on it, this may not a “good” movie, but it sure is fun.\n\n43. “X2: X-Men United”\n\nA big step up from the first “X-Men” both in production values and quality, it still lacks much in the way of energy. Which is inexcusable when you’ve got Alan Cumming as the teleporting mutant Nightcrawler all over your movie.\n\n42. “Spider-Man”\n\nSam Raimi assembled the prototypical superhero movie with this first entry in the “Spider-Man” franchise, in 2002. Like “X-Men” before it, “Spider-Man” is a bit underwhelming today, but unlike “X-Men” it was proud of its nerd roots.\n\n41. “X-Men: Apocalypse”\n\nCould have been a bizarre ironic summer classic if it were structured like a real movie and had any character development whatsoever. Instead it’s just a shot of visual adrenaline that I’ll probably want to revisit at some point — but not when I’m sober\n\n40. “Avengers: Age of Ultron” “Ultron” is frustrating for what it lacks — chiefly the feeling that it’s advancing the overall story arc of the Marvel Cinematic Universe. But as with the first “Avengers” movie its weaknesses are overcome by great character work.\n\n39. “The Avengers”\n\nThe story is a total mess, relying heavily on moviegoers’ memories of previous MCU films (if you didn’t remember or know coming in what the Tesseract was, hoo boy). But the novelty of the Marvel’s first big superhero team-up was irresistible, and director Joss Whedon balanced his ensemble expertly, giving everyone plenty to do so none of them ever fades into the background.\n\n38. “Ghost Rider: Spirit of Vengeance”\n\nFor the sequel, they tapped the “Crank” director duo known as Neveldine/Taylor. It was an inspired choice, because “Spirit of Vengeance” was exactly as nutty as you’d hope a PG-13 comic book movie would be. Shame that it was apparently stressful enough to break up the tandem of Mark Neveldine and Brian Taylor.\n\n37. “Captain America: The First Avenger”\n\nA lot of folks like to complain that all superhero movies are the same. But this was actually a pretty good World War II movie, too.\n\n36. “Guardians of the Galaxy”\n\nPlot-wise, it never really adds up to anything, but the strength of the cast and the bizarre world they explore more than make up for it.\n\n35. “The New Mutants” It’s an absolutely serviceable little piece of entertainment, and there’s a lot of novelty in its overall strange vibe. But after years of delays and reshoots you can definitely feel the hand of the focus group a bit too much.\n\n34. “Blade 2”\n\nBeloved nerd Guillermo del Toro took over for this one and ramped everything up to 11. More vampires, more blood, more people getting sliced up — and of course baddies whose jaws can split open and swallow a person’s head whole.\n\n33. “Big Hero 6”\n\nDisney Animation Studios made a Marvel movie, and it’s really sweet. Sure, it’s the kiddie version of Marvel, but that doesn’t prevent it from being a wholly satisfying experience.\n\n32. “Captain Marvel”\n\nIt’s fine, but “Captain Marvel” feels like a movie from before Marvel Studios really hit its stride in Phase 3 of the Marvel Cinematic Universe. Right now it’s a movie that seems very much out of place.\n\n31. “Guardians of the Galaxy vol. 2”\n\nAn improvement on the first film, and an absolute delight from moment to moment — but it never quite coalesces into a coherent whole because so many subplots distract from the core story and rob it of its emotional impact. Would be a top 5 comic book movie if it had just reigned in the plot.\n\n30. “Iron Man”\n\nIt was Robert Downey Jr.‘s reemergence on the big screen, and he’s flawless in this origin story that takes Tony Stark from billionaire playboy weapons manufacturer to billionaire playboy other-things manufacturer.\n\n29. “Avengers: Endgame”\n\nThis movie is, frustratingly, far from perfect. In fact, it’s kind of a huge mess. But it’s also awesome and thrilling and hilarious and contains some individual moments that are perfect. I wish it was better, but with everything required of a movie that exists to wrap up 21 movies’ worth of story arcs, I’m glad it’s as good as it is.\n\n28. “Hulk”\n\nIn 2003 the modern wave of superhero movies was still in its infancy, and Ang Lee — still the best filmmaker to do a comic book movie — got experimental with “Hulk.” And what he made was an incredible melodrama with visual stylings meant to ape comic book panels. It didn’t sit well with audiences, but “Hulk” remains one of the most compelling and interesting Marvel movies to date.\n\n27. “The Wolverine”\n\nThis was, like, just a legitimately enjoyable melodramatic action movie. Sure, it turns into a video game boss battle by the end, but for most of its running time it’s just an actual movie.\n\n26. “Punisher: War Zone”\n\nWhereas the previous “Punisher” movie was melodramatic and contemplative, this one is just murderous. And it’s awesome.\n\n25. “X-Men: Days of Future Past”\n\nIts time travel logic is a bit iffy, but “Days of Future Past” is still tremendously entertaining because, while epic, it’s not overly serious. As “Back to the Future” taught us long ago, you can get away with a lot of logical leaps if you strike the right tone.\n\n24. “Blade”\n\nPure B-movie trash, which is fine because that’s precisely what it aims for: bloody, crass, awesome. It’s tough to imagine an MCU version of the character working this well.\n\n23. “Iron Man 2”\n\nSwaps Terrence Howard for Don Cheadle, while Mickey Rourke breaks cars with laser whips. It’s a huge mess, but the personalities involved — looking at you, Sam Rockwell — make it fun anyway.\n\n22. “Deadpool”\n\nIn the angsty and angry times we live in, “Deadpool” is perfect. Aggressively violent and flippantly meanspirited, it’s the exact emotional release we needed.\n\n21. “X-Men: Dark Phoenix”\n\nThe main series “X-Men” movies have never achieved any sort of greatness, but at least “Dark Phoenix” ends the whole thing with one of the best efforts of the bunch. And that sequence on the train in the third act is easily the best action sequence of these movies.\n\n20. “Spider-Man: Far From Home”\n\nIt’s frustrating that it doesn’t really deal with the immense fallout from “Avengers: Endgame,” but it’s still as visually creative as any movie in the MCU, and Jake Gyllenhaal’s Mysterio is an all-timer of a villain. Dude goes all the way out in this.\n\n19. “X-Men: First Class”\n\nThe first “X-Men” movie that could be described as “fun.” It’s basically two movies crammed into one, story-wise, but director Matthew Vaughn‘s touch is so breezy and enjoyable that it totally works anyway, thanks in large part to a brilliant cast that includes Michael Fassbender, Jennifer Lawrence and James McAvoy.\n\n18. “Shang-Chi” There’s some amount of “bit off more than they could chew” with this one because there is so much stuff we’ve never heard of that needs explaining — the classic origin story problem. But the action is unbelievable, and probably the best and most interesting we’ve seen in the MCU in that regard. If they can hold on to director Destin Daniel Cretton I bet the second movie, unburdened from those standard first movie issues, is gonna rip.\n\n17. “Spider-Man: Homecoming”\n\nNot quite the best “Spider-Man” movie, but still an absolute delight, with a cast full of scene stealers. Michael Keaton as the Vulture makes for one of the best Marvel villains ever.\n\n16. “Deadpool 2” While you may get whiplash from the “Deadpool” sequel’s occasional very serious and emo scenes, the rest of the movie is thoroughly delightful, somehow managing to be even funnier — and more hilariously violent — than the original.\n\n15. “Ant-Man”\n\n“Ant-Man” represented a first for the MCU by being a straight-up comedy. And it’s a very good one, with a cast that’s perfectly suited for it. Aside from Paul Rudd who plays Ant-Man himself, Michael Pena is the true standout as Scott Lang’s best friend and former cellmate.\n\n14. “Ant-Man and the Wasp”\n\nIt’s ever so slightly frustrating that this one doesn’t fully integrate into the “Infinity War” situation, but even so it’s thoroughly a delight. Evangeline Lilly is so good at the Wasp that I’m retroactively irritated that she didn’t don the suit in the previous “Ant-Man” movie.\n\n13. “Venom”\n\nHow can anybody resist the pull of Tom Hardy doing comedy? It’s not completely sure of itself — it feels like there’s a version of this on a hard drive somewhere that’s much more serious — but Venom works so incredibly well as comic foil that it doesn’t matter. Who knew that Venom would be so much more fun without Spider-Man?\n\n12. “Doctor Strange”\n\nIf it weren’t hamstrung with all the requisite elements of an origin story, “Doctor Strange” might have been the best Marvel movie ever. That’s the power of the astonishing visual imagination on display here. People love to talk about the nebulous concept of capturing some long lost childlike sense of wonder though the magic of cinema — “Doctor Strange” is one of the only movies I’ve watched as an adult that really accomplishes that.\n\n11. “Spider-Man 2”\n\nThis is a movie that fully understands its main character and taps into what made him such a captivating figure for so long. Yeah, Peter Parker’s a superhero, but he’s also a college kid working a minimum wage job to make rent while also taking university physics classes. Peter buckles under the pressure, something we can all relate to.\n\n10. “Iron Man 3”\n\nAs far as I’m concerned this is the “Iron Man” movie. Somehow, Shane Black was able to infiltrate the MCU and make a legitimate Shane Black movie with all the wit and raw humanity you’d expect from him.\n\n9. “Thor: Ragnarok” A thorough delight. This might be the most fun we had at the movies in all of 2017, and so we can’t help but love it.\n\n8. “Captain America: Civil War”\n\nMultiply the two previous best Marvel movies by one another and you get “Civil War.” It packs the sort of emotional payoff all the disconnected Marvel movies can’t really provide. And as an action film it’s easily the best of the superhero genre.\n\n7. “Avengers: Infinity War”\n\nYou could certainly make the argument that “Infinity War” does not really hold up on as a complete movie on its own, because it kinda begins with the second act. But I don’t care. The culmination of this ten-year shared universe experiment should stand on the shoulders of the movies that came before it. The fact that it packs such a profound emotional punch, however, is what really makes it work.\n\n6. “Venom: Let There Be Carnage” With a better handle on its tone than the original — this one knows it’s a comedy first — the “Venom” sequel is alarmingly delightful. It’s not just a comedy, though. It’s a romantic comedy. A love story about a real boy and an amoeba. There’s never been anything like this before in the annals of comic book movie history.\n\n5. “Black Widow” Natasha’s long-overdue solo is held back a little by some fully unnecessary trademark Marvel CGI nonsense, but otherwise this film has a vibe that is fully it’s own thing. It does away with the Marvel house style, aside from in two big action sequences, in favor of a low-key indie look that feels so much more intimate than any previous MCU flick.\n\n4. “Black Panther”\n\nIt’s held back a little by being saddled with standard “origin movie” issues — introducing audiences to the world of Wakanda isn’t a quick and easy task, and it could use an extra 15-20 minutes to flesh out the supporting characters — but still manages to be the most substantial superhero movie ever. It’s kind of amazing that Disney let writer/director Ryan Coogler make this overt a political statement — it might be the most openly political mega-budget movie I’ve ever seen. Also, while I’m listing superlatives: Michael B Jordan delivers the best performance ever in a superhero movie. Good lord.\n\n3. “Logan”\n\nJames Mangold’s small-scale western is a game changer for the entire superhero genre, daring to defy pretty much standard by which you expect these movies to operate. It’s just a great movie by any normal standard. Where “Civil War” elevated the genre, “Logan” opts instead to be something else entirely and we’re all the better for it.\n\n2. “Spider-Man: Into the Spider-Verse” The best superhero movies, and movies in general, are the ones that are truly most human. And “Spider-Verse,” despite being animated, despite the wacky cast of Spider-People, despite the outlandish premise, is as real as movies get.", "images": ["https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-blade.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-the-wolverine.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-ghost-rider.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-thor-the-dark-world.jpg?resize=618%2C413&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2025/08/5x4_082025_COVER_B.png?fit=240%2C300&quality=80&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-thor.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-venom.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-ang-lee-hulk.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-thor-ragnarok.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-avengers-infinity-war.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-blade-trinity.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-captain-america-winter-soldier.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2017/03/x-men-origins-wolverine-adamantium-timeline.jpg?resize=615%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-captain-america-civil-war.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-punisher-war-zone.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-fantastic-four-2005.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-blade-2.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-big-hero-6.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-iron-man-2.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-elektra.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-daredevil.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-guardians-of-the-galaxy-vol-2.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-x-men-first-class.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2021/08/shang-chi-bus-fight-simu-liu.jpg?resize=1200%2C675&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/06/dark-phoenix-DF-06600_R_rgb.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-fantastic-four-rise-of-the-silver-surfer.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-ghost-rider-spirit-of-vengeance.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-captain-america-the-first-avenger.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-spider-man-3.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-the-punisher-dolph.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-the-punisher.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2021/08/venom-let-there-be-carnage-carnage-black-symbiote.jpg?resize=1200%2C675&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2021/09/carnage-1.jpg?fit=990%2C557&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2020/07/new-mutants-x-men-disney-heading-to-streaming.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/captain-marvel-every-marvel-movie-ranked.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2021/08/venom-2-let-there-be-carnage.jpg?resize=1200%2C675&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-spider-man-into-the-spider-verse.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-amazing-spider-man-2.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-black-panther.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-logan.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-the-incredible-hulk.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2020/07/howard.gif?resize=618%2C412&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-spider-man.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-fantastic-four-reboot.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-ant-man.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-x-men-the-last-stand.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/avengers-endgame-every-marvel-movie-ranked.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-deadpool.jpg?resize=618%2C413&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-the-avengers.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-guardians-of-the-galaxy.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-spider-man-homcoming.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-x2-x-men-united.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-iron-man-3.jpg?resize=640%2C427&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/07/spider-man-far-from-home-mid-credits-scene-explained-mysterio-j-jonah-jameson.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2025/10/102325-Colleen-Hoover.jpg?fit=300%2C169&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-x-men-days-of-future-past.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-iron-man.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-x-men-apocalypse.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2020/02/BlackWidowScarlettJohansson.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2021/09/carnage-1.jpg?fit=1200%2C675&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-avengers-age-of-ultron.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-ant-man-and-the-wasp.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-deadpool-2.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-spider-man-2.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-doctor-strange.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-x-men.jpg?resize=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/03/every-marvel-movie-ever-ranked-amazing-spider-man.jpg?resize=618%2C412&quality=89&ssl=1"], "top_img": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2021/09/carnage-1.jpg?fit=1200%2C675&quality=89&ssl=1", "keywords": [], "authors": ["Phil Owen", "Phil.Owen Thewrap.Com", "Twitter", ".Wp-Block-Post-Author Box-Sizing Border-Box Display Flex Flex-Wrap Wrap .Wp-Block-Post-Author__Byline Font-Size Margin-Bottom Margin-Top Width", ".Wp-Block-Post-Author__Avatar Margin-Right .Wp-Block-Post-Author__Bio Font-Size Margin-Bottom .Wp-Block-Post-Author__Content Flex-Basis Flex-Grow .Wp-Block-Post-Author__Name Margin", ".Wp-Block-The-Wrap-Author-Bios__Entry Align-Items Center Display Flex Flex-Wrap Wrap Gap .Wp-Block-The-Wrap-Author-Bios__Entry .Wp-Block-The-Wrap-Author-Bios__Entry Margin-Top .Wp-Block-The-Wrap-Author-Bios__Entry-Excerpt Flex-Basis", ".Wp-Block-The-Wrap-Author-Bios Border-Top Solid", "Margin-Block Padding-Top .Wp-Block-The-Wrap-Author-Bios__Entry-Avatar Display Var --Display-No-Mobile", "Block", "Margin-Bottom .Wp-Block-The-Wrap-Author-Bios__Entry-Avatar Img Border Solid"], "canonical_link": "https://www.thewrap.com/all-62-marvel-movies-ranked-venom-2-shang-chi/", "title": "All 62 Marvel Movies Ranked, Including ‘Venom: Let There Be Carnage’", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "All 62 Marvel Movies Ranked, Including 'Venom: Let There Be Carnage'", "description": "Decades of big-screen Marvel adaptations demand a long, ranked list. This is that list", "url": "https://www.thewrap.com/all-62-marvel-movies-ranked-venom-2-shang-chi/", "site_name": "TheWrap", "image": {"identifier": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2021/09/carnage-1.jpg?fit=1200%2C675&quality=89&ssl=1", "width": 1200, "height": 675, "type": "image/jpeg"}}, "article": {"author": "https://www.facebook.com/thewrap/", "published_time": "2021-10-01T19:38:00+00:00", "modified_time": "2021-10-01T19:40:06+00:00"}, "author": "Phil Owen", "twitter": {"card": "summary_large_image", "creator": "@thewrap", "label1": "Written by", "data1": "Phil Owen", "label2": "Est. reading time", "data2": "14 minutes"}, "generator": "WordPress 6.8", "article-tags": "avengers-age-of-ultron, avengers-endgame, avengers-infinity-war, black_widow, captain_america_the_winter_soldier, dark-phoenix, logan, marvel_studios, scarlett_johansson, shang-chi, shang-chi-and-the-legend-of-the-ten-rings, simu-liu, spider-man-into-the-spider-verse, the_avengers, the-new-mutants", "article-section": "movies", "article-categories": "movies, news, channelphoto", "msapplication-TileImage": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2024/05/the_wrap_symbol_black_bkg.png?fit=270%2C270&quality=80&ssl=1"}, "movies": [], "publish_date": 1633117080.0, "source": "https://www.thewrap.com", "summary": ""}