{"url": "https://people.com/music/enrique-iglesias-anna-kournikova-inside-private-relationship/", "text": "While celebrity appearances in music videos are not uncommon, they don't typically result in a long-lasting romance like that of Latin pop star Enrique Iglesias and former professional tennis player Anna Kournikova.\n\nThe pair met in 2001 on the set of the singer's \"Escape\" music video, where they engaged in a few steamy makeout scenes. Their chemistry translated well off-screen and they became an official couple shortly after. They have since welcomed three children together, but have never married.\n\nIglesias and Kournikova have kept their two-decade-long relationship out of the spotlight for the most part, but on occasion, they will share rare glimpses into their family life on social media.\n\nFrom starring in the \"Escape\" music video together to raising three children, here's a complete timeline of Enrique Iglesias and Anna Kournikova's relationship.\n\nDecember 2001: Enrique Iglesias and Anna Kournikova meet on the set of a music video\n\nCarmen Valdes/Ron Galella Collection via Getty\n\nThe pair teamed up for Iglesias' 2001 music video \"Escape,\" which would help seal the deal on their love. The video, which features Kournikova playing coy against advances from Iglesias before ending in a makeout session, was the first time fans caught a glimpse of their chemistry.\n\nAugust 2002: Enrique Iglesias and Anna Kournikova make their red carpet debut\n\nJim Spellman/WireImage\n\nIglesias and Kournikova walked the red carpet together for the first time at the MTV Video Music Awards in August 2002, where Iglesias was nominated for five awards, including best music video. The following year, the couple were seen at the Once Upon A Time In Mexico premiere in New York City.\n\nAugust 2004: Enrique Iglesias and Anna Kournikova spark engagement rumors\n\nJason Squires/WireImage\n\nAfter Kournikova was spotted wearing a large pink diamond ring at a 2004 World Tennis Match, rumors quickly circulated that the pair were engaged. Shortly after, another rumor surfaced that Iglesias and Kournikova had secretly wed in Puerto Vallarta, Mexico, but PEOPLE reported at the time that the rumors were false.\n\nMay 2007: Enrique Iglesias says he is \"single,\" but a source tells PEOPLE he is joking\n\nIglesias led fans to think that he and Kournikova had split when he told Swedish newspaper Aftonbladet, \"We're divorced. I am single now, but that's okay I don't mind being alone.\"\n\nA source close to the couple told PEOPLE he was only joking and assured fans that \"they are still together.\"\n\nThe month prior, Iglesias told PEOPLE en Español that his romance with Kournikova was \"the only serious relationship I've had in my life.\" When asked if he could picture a future with the tennis star, he responded, \"I don't know. The only thing I can say is that, in my opinion, Anna, whether we are together or not, would be an ideal mother.\"\n\nApril 15, 2008: Anna Kournikova says she has no plans to marry Enrique Iglesias\n\nThe couple were still going strong in 2008 after more than five years together, however, they had no plans to marry.\n\nWhen asked if she would wed the \"Hero\" singer, Kournikova told PEOPLE, \"I'm never getting married,\" before giving a relationship update, saying, \"Everything is good.\"\n\nIglesias confirmed her reluctance to tie the knot days later when he told reporters that he'd been trying to convince Kournikova to marry him for years. \"I always try but she pays me no attention,\" he said.\n\nNovember 11, 2011: Anna Kournikova talks about her desire to have children with Enrique Iglesias\n\nBill Davila/FilmMagic\n\nIn an interview with Women's Health, Kournikova opened up about wanting to become a mother. \"I absolutely want to have children, whether I have my own or adopt,\" she said, \"I love taking care of people.\"\n\nShe also discussed why marriage was not part of her and Iglesias' plans for their future. \"[Marriage] isn't important to me. I'm in a happy relationship — that's all that matters,\" she told the outlet. \"I believe in commitment. I believe in being open and trusting each other and respecting each other completely.\"\n\nMarch 3, 2012: Enrique Iglesias explains why he and Anna Kournikova are not getting married\n\nIn an interview with Parade magazine, Iglesias also spoke about why marriage was not a high priority for the couple. \"I've never really thought marriage would make a difference,\" he explained. \"Maybe it's because I come from divorced parents, but I don't think you love somebody more because of a piece of paper. Nowadays, it's not taboo to have kids and not be married. What makes a difference is that you're a good parent, period.\"\n\nJune 9, 2016: Anna Kournikova shares a rare photo of her and Enrique Iglesias\n\nAnna Kournikova Instagram\n\nThe ultra-private couple don't post photos together on social media often, but Iglesias made a rare appearance on Kournikova's Instagram on her little brother's birthday. She posted a photo of the couple alongside her brother Allan and captioned it with a series of emojis.\n\nDecember 16, 2017: Enrique Iglesias and Anna Kournikova welcome twins\n\nAnna Kournikova Instagram\n\nIglesias and Kournikova welcomed twins Nicholas and Lucy on Dec. 16, 2017, in Miami after keeping the pregnancy a secret. Though reps for Iglesias and Kournikova did not initially confirm the news to PEOPLE, the new parents posted shots of the twins on both of their Instagram accounts shortly after the birth.\n\nJanuary 21, 2018: Anna Kournikova dances to Enrique Iglesias' song \"El Baño\"\n\nA month after giving birth, Kournikova posted a video of herself dancing to Iglesias' song \"E Baño\" on the pair's boat, and fans couldn't help but notice how fit she looked after welcoming twins. That same month, the Russian tennis pro gave her followers a sneak peek into her workout regime on Instagram.\n\nMarch 11, 2018: Enrique Iglesias talks about his twins for the first time\n\nEnrique Iglesias Instagram\n\nThough both Iglesias and Kournikova had shared photos of their babies, neither had said much about the experience until Iglesias took the stage in Budapest, Hungary, and discussed his newfound fatherhood with fans.\n\n\"I became a father 12 weeks ago and I can absolutely tell you two things: I love my babies! I love them very much,\" he told the crowd at the Budapest Sports Arena. He also praised Kournikova saying, \"I love my girl\" before dedicating a song to both her and his loyal fans.\n\nMay 3, 2018: Anna Kournikova posts a throwback photo from her pregnancy\n\nAnna Kournikova/Instagram\n\nAfter successfully hiding her pregnancy in 2017, Kournikova shared a throwback photo of her baby bump on Instagram. The picture showed the first-time mom cradling her bump at 37 weeks while wearing tall stiletto heels.\n\nMay 23, 2018: Anna Kournikova dances along to Enrique Iglesias' song \"Move To Miami\" with daughter Lucy\n\nIn May 2018, the tennis star shared an adorable video of herself dancing along to Iglesias' song \"Move To Miami\" with Lucy strapped to her chest. She captioned the post, \"Little one, please don't inherit my dance moves.\"\n\nOctober 8, 2018: Enrique Iglesias says he and Anna Kournikova's love life has improved since becoming parents\n\nIn an interview with The Sun, Iglesias opened up about how the birth of their twins affected their relationship in the bedroom. \"It's probably more sex now than ever. The sex has not diminished,\" he said at the time.\n\nHe also discussed watching Kournikova become a mother for the first time, saying, \"It's incredible to watch her be such a great mother. It's incredible to watch a mum do what she does, when a mother's instinct kicks in.\"\n\nJune 23, 2019: Enrique Iglesias shares a sweet moment with his son\n\nEnrique Iglesias Instagram\n\nMuch like their relationship, Iglesias and Kournikova tend to keep their children out of the public eye and don't post pictures of them often. In June 2019, Iglesias shared a rare video of his son enjoying a boat ride. In the sweet video, Nicholas was wearing a giant straw hat and could be heard saying \"wawa\" as he pointed at the water.\n\nJanuary 30, 2020: Enrique Iglesias and Anna Kournikova welcome their third child\n\nAnna Kournikova Instagram\n\nIn early 2020, Kournivoka and Iglesias welcomed their third child, a daughter named Mary. Her birth was announced by Iglesias, who captioned a sweet photo of himself holding the newborn at the hospital: \"My Sunshine 01.30.2020.\" Kournikova followed suit and posted a photo of herself holding Mary just after giving birth via C-section.\n\nIglesias later opened up about his growing family to PEOPLE and said the twins' transition into their new role as older siblings was going \"very smoothly.\" He also revealed his newborn daughter's Russian nickname, Masha.\n\n\"They actually love it,\" he said, of the twins. \"There's a two-year difference, so I was a little scared. I was like, 'How are they going to react?' And I have two dogs so my house is chaotic. When we first came home with Masha, I was like, 'Oh, how is everybody going to react?' \"\n\nOctober 2021: Enrique Iglesias shares what he and Anna Kournikova's kids think about their 2001 music video\n\nThe \"King of Latin Pop\" appeared on SiriusXM's The Jess Cagle Show and spoke candidly about his kids' reaction to the steamy music video he and Kournikova starred in. \"I think my kids have already seen — well, I think, no, I know my kids have already seen that video,\" Iglesias said. \"And they're putting two and two together. Like, 'Oh, really?' \"\n\nHe continued, \"Whenever they hear one of my songs they can actually recognize my voice, which is pretty cool. But when they watch that video, I think it does throw them off a little bit. 'What is Mom doing there?' you know, 'with Dad' you know? 'When was this?' \"\n\n\"It's actually incredible to watch the expression on their faces. It's pretty cool,\" he added.\n\nMay 8, 2022: Enrique Iglesias and Anna Kournikova celebrate Mother's Day and his birthday\n\nAnna Kournikova Instagram\n\nIn honor of Igesias' 47th birthday, Kournikova posted a rare photo of their whole family with the caption, \"Happy Birthday to the most amazing Dad! We super love you!!! ❤️.\" In the photo, Iglesias is seen leaning over to give his daughter Lucy a kiss while holding her sister, Mary, on his shoulders. The pair's son, Nicholas, sits in his mother's lap.\n\nSince Iglesias' birthday happened to be on Mother's Day, the Iglesias-Kournikova family also celebrated Kournikova that weekend. Iglesias gave his partner a shout-out on Instagram for being a great mother and posted a video of her and daughter Mary rocking out to Joan Jett & the Blackheart's \"I Love Rock 'n' Roll.\"\n\nOctober 25, 2023: Enrique Iglesias recalls meeting Anna Kournikova while filming \"Escape\" music video in 2001\n\nEnrique Iglesias/ YouTube\n\nDuring a conversation with PEOPLE, Iglesias recalled meeting Kournikova for the first time in 2001.\n\n\"[The \"Escape\" music video changed my life] in ways that I didn’t even think about,\" he said. \"When we met — although she came from the sports world — we kind of got each other. We just started connecting little by little and got stronger and stronger and stronger.\"\n\n\n\nMay 8, 2024: Enrique Iglesias shares what Anna Kournikova really thinks about him kissing fans\n\nIglesias is known to kiss and hug his fans at concerts. And according to the singer, Kournikova never gets \"jealous\" while watching from the wings.\n\n\"Anna will be at one of my shows and I'll do that. I do that all the time — I love embracing, kissing and hugging my fans. I like getting close up,\" Iglesias said on SiriusXM's FYI Show. \"And a lot of times she [says], 'Man, I always get this look from some of the girls ... and they'll ask, 'Are you OK with it?' Yeah, I'm totally cool. He's onstage. He's embracing his fans.' \"\n\nJanuary 25, 2025: Anna Kournikova is spotted in a wheelchair\n\nKournikova was seen in public for the first time in two years when she was spotted with a group of people at Miami's Bal Harbour Shops.\n\nIn photos obtained by the New York Post, she can be seen in a wheelchair with an orthopedic boot on. Her daughters Lucy and Mary were also present during the outing.", "images": ["https://people.com/thmb/-ldrMPDgH-BzwADY1Y7nfyzCu5U=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Anna-Kournikova-Enrique-Iglesias-101925-6c75318e91364a9dafa24e06dc43891d.jpg", "https://people.com/thmb/6st_L-XUYHbjg59RSxnPNDkrNt4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/selena-quintanilla-chris-perez-9-7f7ae9ac911b411fa3f7753818d24a9f.jpg", "https://people.com/thmb/3aKepFo0QLFJitm0Y4oVDC7dtsI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(705x439:707x441)/enrique-iglesias-anna-kournikova-2-f35309990e854465b64b5d617a5d644b.jpg", "https://people.com/thmb/LztNjwaQ-ix4eK4edUooLhNiWi4=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/anna-kepner-3-111025-c6a90b2f57474459a89ae04e296ec343.jpg", "https://people.com/thmb/i8KoQ2wGaOPbvDtpcMGiQwA9ZPA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/cynthia-lennon-111225-4-c90bef69b68c427ba703b127562b970c.jpg", "https://people.com/thmb/FEludFBg2QY0qw0KlHWA3OId6WA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Duck-Hodges-Lainey-Wilson-Country-Music-Awards-1-091025-890c2fe7227e4b9a8f82215e781646a6.jpg", "https://people.com/thmb/wdoedI2dnHiQfxB1VAGTB6VnXrc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/vince-gill-amy-grant-kids-111925-f43a58dcc57a4ddcb0967dcea03a946a.jpg", "https://people.com/thmb/V4N8WYWNabqadnm8h_EObtX_lbg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(786x659:788x661)/enrique-iglesias-anna-kournikova-4-deccac54bcbb46009ee205a0a178b032.jpg", "https://people.com/thmb/ifaEyA8zwfYRiGsyjU47pBmCfeg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/kate-gosselin-steve-neild-split-111225-fda1e1effeb44409b9e8750150e25ef0.jpg", "https://people.com/thmb/DdcHbKg4fM3qN5N9PxmFQ3IWmbc=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(779x493:781x495)/enrique-iglesias-anna-kournikova-1-51fef97eb93e429fbaed882f0d5f3c68.jpg", "https://people.com/thmb/SiOhEi40yB1cVDgGXzCHfsJS44I=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(1199x579:1201x581)/enrique-iglesias-c259fed6e5ba451c9a2999f4befadd86.jpg", "https://people.com/thmb/GDCOzkxBCGOp67K4hBAXD1iBSio=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/eddie-murphy-nicole-mitchell-paige-butcher-split-111325-ce081c34ea7b46f884155c23e91c0aef.jpg", "https://people.com/thmb/vyJHKEJ82ooUSWt2SR-CETECkIs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/mcdermott-spelling-1-866b59b7eff1446b8e34775aa6c0ce74.jpg", "https://people.com/thmb/aNvSrhI4TCgCFrsxFOSntrH_urs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/douglas-brunt-megyn-kelly-time100-gala-2025-111725-77c5661300d74393b80602077e1e71f7.jpg", "https://people.com/thmb/w7pV7YvdSrYeRLoaScwY7wN73IU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/enrique-iglesias-anna-kournikova-relationship-main-013025-dc5f5821fc644b61a096d72f1cd95b9c.jpg", "https://people.com/thmb/qZmCsmJ8EleyKqo1ny0CSUhh4VM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(1039x899:1041x901)/enrique-iglesias-anna-kournikova-5-a2e079887a6d4bcf89728089a59ba31e.jpg", "https://people.com/thmb/6TcVvOvJ5frJ8tVo0RhyWVdf81s=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(859x565:861x567)/enrique-iglesias-2-1a285b033d3a49d8a54dcb64f35c458e.jpg", "https://people.com/thmb/latNy6O_DnRNb9RptOuIm_6YNDY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/minka-kelly-dan-reynolds-relationship-ufc-303-event-041625-6a1e0711fb494f76bec8ece05a8d6b49.jpg", "https://people.com/thmb/BB7vYW82d0oBPiFINmr76DIy2dY=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/ben-dreyfuss-richard-dreyfuss-111925-b670f8ab6f994d1d9dfce1fa0726d205.jpg", "https://people.com/thmb/zdFS1n2y9dNM-ndOtRjWY9G0kI4=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/Daniella-Karagach-111925-ls-1ffa54ba0f1749e380cfe98771660e16.jpg", "https://people.com/thmb/R1pvwthMbSuMihTSaUueuAle7fs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/cardi-b-stefon-diggs-knicks-051225-08de9ae9fb8f4bc5a396373f7d253b02.jpg", "https://people.com/thmb/l0TCKkYPL_v0Lwv-U2ynuZrQfcs=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(719x120:721x122)/enrique-iglesias-mag-rollout-1-102423-2066a6dbb5ee4936be2070f93908dfc7.jpg", "https://people.com/thmb/2Brv-b6cOZfKDflo2qWfxsBz9Gk=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/Duck-Hodges-Lainey-Wilson-Country-Music-Awards-1-091025-890c2fe7227e4b9a8f82215e781646a6.jpg", "https://people.com/thmb/08k6goiXCYaIOl00hSAhBlEITCM=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/enrique-iglesias-anna-kournikova-relationship-main-013025-dc5f5821fc644b61a096d72f1cd95b9c.jpg", "https://people.com/thmb/iE5SEijbP8ZwH92dBLnvE8-eJdM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Brandi-Carlile-Catherine-Shepherd-111925-07-9c2d6dfb92b54df9849740af3ee40df8.jpg", "https://people.com/thmb/IL7iZrHSimkw3SsQ3obw5-vIK9A=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(717x0:719x2)/anna-kournikovia-1-2000-17f8c00d050a49a59405bc23d8674782.jpg", "https://people.com/thmb/pwsXaR-vC-Bque6t7XagLWM3Fgw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(960x408:962x410)/enrique-iglesias-anna-kournikova-relationship-main-013025-dc5f5821fc644b61a096d72f1cd95b9c.jpg", "https://people.com/thmb/GwFXLRu6Xcrg6J_kcVOsm190DD0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/billy-bob-thornton-angelina-jolie-connie-angland-split-111925-73d94569a50e4ea2a0963c4f658f9471.jpg", "https://people.com/thmb/aIREmjonJHqGtWfwkqEadKBD8bU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Billy-Bob-Thornton-and-wife-Connie-Angland-arrive-for-the-Los-Angeles-Premiere-of-Landman-111324-7bc83a53fc8541c88f74faa413f7f1c2.jpg", "https://people.com/thmb/c16SMZ5lAbLRqE-w9lpS1pFDFk8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(714x0:716x2)/enrique-iglesias-11-1-2000-bec5bd038f754f5db0c39d769548e8b6.jpg", "https://people.com/thmb/gh4sRl8w_p8yaU_gp_3lslWbKTw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/eddie-murphy-Paige-Butcher-111025-1-8f26b7914db84c569606bc2c88ac32ac.jpg", "https://people.com/thmb/0jKnK8bSyr7Fb41sXsNwd1jtAFM=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/jenna-bush-hager-minka-kelly-today-with-jenna-and-friends-111925-7e3c2b8605fe4a96a1b712c168083adb.jpg", "https://people.com/thmb/IacAI72Ysd3tOwTzetYfnZYDc4Q=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(839x779:841x781)/enrique-iglesias-anna-kournikova-6-abd4306dc99a494a9a7294664d88309e.jpg", "https://people.com/thmb/OE-VO0MH8ZLZj1tylHT2G8DsTqg=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/Anna-Kournikova-Enrique-Iglesias-101925-6c75318e91364a9dafa24e06dc43891d.jpg", "https://people.com/thmb/cqByfzB0T_y6i9Q8e7yt_JYy_lc=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(593x0:595x2)/anna-kournikova-fa6b0c69e6bd42958027a894e90a6f6a.jpg", "https://people.com/thmb/Z8hVRJGFhZAV0gWvs75z7wQYPd8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(859x619:861x621)/anna-kournikova-2e0401ce320249919d26a5f3174d1bc8.jpg"], "top_img": "https://people.com/thmb/pwsXaR-vC-Bque6t7XagLWM3Fgw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(960x408:962x410)/enrique-iglesias-anna-kournikova-relationship-main-013025-dc5f5821fc644b61a096d72f1cd95b9c.jpg", "keywords": [], "authors": ["Iman Milner", "Iman Milner Is A Former Contributor At People. She Left People In", "People Editorial Guidelines", "Kayla Grant", "Linda Marx", "Raven Brunner", "Emily Weaver", "Samantha Stutsman", "Diana Pearl", "Ariana Quihuiz"], "canonical_link": "https://people.com/music/enrique-iglesias-anna-kournikova-relationship-timeline/", "title": "Enrique Iglesias and Anna Kournikova's Relationship Timeline", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Enrique Iglesias and Anna Kournikova first met in 2001 and share three kids. Here is a complete timeline of their relationship.", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "PEOPLE", "sailthru.author": "Iman Milner", "parsely-section": "Celebrity", "parsely-tags": "People.com,Celebrity,Person,Celebrity Relationships,Anna Kournikova,Enrique Iglesias", "article": {"section": "People", "author": "https://www.facebook.com/peoplemag"}, "og": {"type": "article", "site_name": "People.com", "url": "https://people.com/music/enrique-iglesias-anna-kournikova-relationship-timeline/", "title": "Enrique Iglesias and Anna Kournikova's Relationship Timeline", "description": "Enrique Iglesias and Anna Kournikova first met in 2001 and share three kids. Here is a complete timeline of their relationship.", "image": "https://people.com/thmb/pwsXaR-vC-Bque6t7XagLWM3Fgw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(960x408:962x410)/enrique-iglesias-anna-kournikova-relationship-main-013025-dc5f5821fc644b61a096d72f1cd95b9c.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Enrique Iglesias and Anna Kournikova's Relationship Timeline", "description": "Enrique Iglesias and Anna Kournikova first met in 2001 and share three kids. Here is a complete timeline of their relationship.", "image": "https://people.com/thmb/pwsXaR-vC-Bque6t7XagLWM3Fgw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(960x408:962x410)/enrique-iglesias-anna-kournikova-relationship-main-013025-dc5f5821fc644b61a096d72f1cd95b9c.jpg"}, "vf": {"url": "https://people.com/music/enrique-iglesias-anna-kournikova-relationship-timeline/"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.146.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.146.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.146.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.146.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.146.0/icons/favicons/mstile-310x150.png", "fb": {"pages": 95926963131}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}