{"url": "http://abcnews.go.com/ThisWeek/week-transcript-adm-mike-mullen/story?id=12204355&page=2", "text": "November 21, 2010 — -- (BEGIN VIDEO CLIP)\n\nAMANPOUR (voice-over): Welcome to viewers here and around the world. I'm Christiane Amanpour.\n\nAnd at the top of the news this week: nuclear secret, a report of a major advance in North Korea's nuclear program. What new threat does it pose? And how will it impact the president's disarmament agenda and his push to get the Senate to ratify his START nuclear treaty?\n\nOBAMA: This is not about politics. It's about national security.\n\nAMANPOUR: This morning, the nation's top military official, Chairman of the Joint Chiefs of Staff Admiral Mike Mullen. Plus, the escalating war in Afghanistan. His views on night raids, relations with President Karzai, and deadlines for U.S. withdrawal.\n\nThen, hot zone. As Haiti reels from a cholera outbreak, we ask, what happened to the global pledge to rebuild the nation?\n\nAnd G.M.'s new start. Was the bailout good for America after all? Analysis on our roundtable with George Will, Democratic strategist Donna Brazile, Ed Luce of the Financial Times, and former Clinton Labor Secretary Robert Reich.\n\nPlus, the Sunday funnies.\n\nLETTERMAN: The Capitol Hill Christmas tree arrives this week. And as soon as it gets to Washington, it will die in committee. Did you know that?\n\n(END VIDEO CLIP)\n\nANNOUNCER: From all across our world to the heart of our nation's capital, ABC's \"This Week\" with Christiane Amanpour starts now.\n\nAMANPOUR: Hello again. And with reports of a new nuclear facility in North Korea and a new deadline in the Afghanistan war, there's a lot to discuss with our guest, Chairman of the Joint Chiefs of Staff Admiral Mike Mullen.\n\nPresident Obama returned late last night from the NATO summit in Lisbon where the United States and its allies are now talking about another deadline, the end of 2014 to hand over combat operations to Afghan forces. To make that happen, American and NATO forces are escalating the war right now, and so we start with a powerful report from ABC's Mike Boettcher in Afghanistan.\n\n(BEGIN VIDEOTAPE)\n\nBOETTCHER (voice-over): When Lieutenant Colonel Steve Lutsky last saw 10-year-old Sadekela (ph), he was bleeding to death on the side of a road.\n\nLUTSKY: His mom was yelling out that, \"My son is dead. My son is dead.\"\n\nBOETTCHER: Now he is recovering at a U.S. military hospital. The lives of the American officer and the Afghan boy intersected on this stretch of highway in Khost province, when a car bomber trying to kill Lutsky and his men attacked their column.\n\n(on-screen): The American convoy was traveling this direction. The other way, civilian vehicles. They slowed down when the convoy passed. So did a suicide bomber. And inside his car, he had 600 pounds of high explosives.\n\n(voice-over): The soldiers were not hurt, but the explosion killed one child and injured three others, including Sadekela (ph). Now angry at the Taliban, Sadekela's (ph) family is grateful to the Americans for saving his life, a small but important victory in a war where not killing civilians is more important than killing the enemy.\n\nTOWNSEND: It buys us credit, in the sense that there's a little more respect for us and there's a little more trust for us.\n\nBOETTCHER: America's top officers tell Afghans that it's the Taliban who are killing civilians, a message undermined by President Karzai's claims that U.S. special operations night raids are killing innocent people.\n\n(UNKNOWN): Nine out of 10 civilian casualties are caused by the Taliban.\n\nBOETTCHER: At a district center in eastern Afghanistan, not everyone is convinced by that argument. During a visit by the 101st Airborne's deputy commander in Afghanistan, Steve Townsend (ph), a village elder asserted that the Americans were killing more Afghans than the Soviets did a quarter century ago. Townsend pushed back hard.\n\n(UNKNOWN): Look in my eyes right now. You know I'm telling the truth.\n\nBOETTCHER: But as the words fly, so do bombs and bullets. Combat Outpost Firra (ph), situated on the Pakistan border, is often attacked. During one assault, 18 insurgents died, but soldiers know this: You can't kill your way out of Afghanistan.\n\n(UNKNOWN): They can reconstitute faster than we can. We're so close to Pakistan that they just come right across the border.\n\nBOETTCHER: So rather than enemy body counts, real success here is measured in how quickly Afghan feet can fill American-made boots. If the war is to end, Afghan soldiers will have to end it.\n\n(UNKNOWN): We have to make a difference. Coming here and -- and just running around and killing the enemy and then leaving and looking back and saying, \"I didn't make a difference, I didn't make a change,\" will cause us to never leave.\n\nBOETTCHER: Steve Lutsky's son is the same age as young Sadekela (ph), 10. The colonel wants only one thing to come from his service here: confidence that his own son someday will not be fighting his father's war.\n\nFor \"This Week,\" Mike Boettcher, ABC News, Forward Operating Base Clark, Afghanistan.\n\n(END VIDEO CLIP)\n\nAMANPOUR: And joining me now is the chairman of the Joint Chiefs of Staff, Admiral Mike Mullen.\n\nWelcome to \"This Week.\"\n\nMULLEN: Good morning.\n\nAMANPOUR: And we will discuss, of course, Afghanistan, but let me get to the breaking news this morning, the report by the New York Times of the discovery of a new nuclear facility in North Korea. How much of a threat is that to the United States, to the world?\n\nMULLEN: Well, this validates a long-standing concern that we've had with respect to North Korea and -- and its enrichment of uranium. It also continues to validate a country that is led by a dictator who is constantly -- who constantly desires to destabilize the region. And he's done that again, certainly, with this capability, as well.", "images": ["https://i.abcnewsfe.com/a/bf2f8ed5-a320-4d7e-b583-179abe072d92/trump-signs-shutdown-bill-20251112-ap-jh_1763006747268_hpMain_square.jpg?w=208", "https://i.abcnewsfe.com/a/009e3420-a5ae-477a-aeb3-edfa85648814/johnson-2-gty-jef-251118_1763480583977_hpMain_square.jpg?w=208", "https://i.abcnewsfe.com/a/a904a3c1-1e2d-4174-9130-e846e8059dee/carnivaldeath_1762746067738_hpMain_square.jpg?w=208", "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://i.abcnewsfe.com/a/7669390d-d027-4ec7-9673-1d2eccafbbec/comey-gty-er-251117_1763404424377_hpMain_square.jpg?w=208", "https://assets-cdn.abcotvs.net/static/images/DisneyPlus.svg"], "top_img": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "keywords": [], "authors": ["Abc News"], "canonical_link": "https://abcnews.go.com/ThisWeek/week-transcript-adm-mike-mullen/story?id=12204355", "title": "'This Week' Transcript: Adm. Mike Mullen", "meta_data": {"viewport": "initial-scale=1.0, user-scalable=yes", "og": {"locale": "en_US", "site_name": "ABC News", "url": "https://abcnews.go.com/ThisWeek/week-transcript-adm-mike-mullen/story?id=12204355", "title": "'This Week' Transcript: Adm. Mike Mullen", "description": "Transcript of 'This Week' interview with Chairman of the Joint Chiefs of Staff Adm. Mike Mullen.", "image": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "type": "article"}, "description": "Transcript of 'This Week' interview with Chairman of the Joint Chiefs of Staff Adm. Mike Mullen.", "keywords": "this week, christiane amanpour, foreign policy, military, afghanistan, mike mullen, joint chiefs of staff, Article, 12204355", "theme-color": "#fff", "copyright": "2025 ABC News", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "'This Week' Transcript: Adm. Mike Mullen", "lastPublishedDate": "2010-11-22T10:15:47Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/prism-story,12204355", "ipad": "abcnewsipad://link/prism-story,12204355", "googleplay": "https://abcnews.go.com/ThisWeek/week-transcript-adm-mike-mullen/story?id=12204355"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "'This Week' Transcript: Adm. Mike Mullen", "description": "Transcript of 'This Week' interview with Chairman of the Joint Chiefs of Staff Adm. Mike Mullen.", "url": "https://abcnews.go.com/ThisWeek/week-transcript-adm-mike-mullen/story?id=12204355", "image": {"identifier": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/prism-story,12204355", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/prism-story,12204355", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/ThisWeek/week-transcript-adm-mike-mullen/story?id=12204355", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/ThisWeek/week-transcript-adm-mike-mullen/story?id=12204355"}}}, "movies": [], "publish_date": null, "source": "http://abcnews.go.com", "summary": ""}