{"url": "https://www.theringer.com/movies/2017/12/5/16740234/gotti-pulled-john-travolta", "text": "Lionsgate has sold the film back to its producers\n\nBy • -\n\nThis piece was updated after publication with more information.\n\nIn an unexpected last-minute shift, Lionsgate has dropped the John Travolta project Gotti just 10 days before its release.\n\nGotti, a biopic about infamous mobster John Gotti, was sold back to its producers Tuesday, Entertainment Weekly reported. Production company Emmett/Furla/Oasis is expected to seek new distribution, but the movie is unlikely to make its December 15 release date.\n\nFormer Entourage cast member Kevin Connolly directed the mob drama, and the project also features Travolta’s wife Kelly Preston as Victoria Gotti.\n\nWhile the reasons for the sale remain unclear, this isn’t the first obstacle Gotti has encountered throughout its production. A number of actors have been connected to the project throughout its years of development, including Al Pacino, Lindsay Lohan, and Anthony Hopkins. The film began production in July 2016.\n\nUpdate: On Wednesday, John Travolta, Kevin Connolly, and the producers of Gotti spoke out against reports that Lionsgate dropped the film. According to a new report from Deadline, Travolta persuaded Lionsgate to sell back the film in order to give it a wider release.\n\n“All these reports are saying the studio ‘dropped’ Gotti and John Travolta, that’s 100 percent false,” said Keya Morgan, executive producer of the film, via Vulture. “The studio never dropped it! Lionsgate said, ‘We want this movie. It has Oscar buzz.’ We had to beg them for it.”\n\nTravolta reportedly shopped around for distributors who would give the film a larger release than the minimal plans that Lionsgate had for the biopic. “That is the simple explanation for this,” Travolta said. “It wasn’t dropped. It wasn’t easy to get Lionsgate to give it up. They said no, twice, and I literally begged them to reconsider and they finally and generously let it go.”\n\nMorgan vehemently denied claims that Gotti’s delayed release might be for any reason other than an attempt at a wider opening. “This has nothing to do with any sex scandal at all,” he said. “This has nothing to do with Scientology. Or Trump. Or Harvey Weinstein! Get over it! We just got more money, it’s a great film and we’re putting it in more theaters.”", "images": ["https://www.theringer.com/_next/image?url=https%3A%2F%2Fwp.theringer.com%2Fwp-content%2Fuploads%2F2024%2F11%2FHalliwell_Kate.jpg&w=3840&q=75&dpl=406f3adf64ea2410894205e03accb4e416ca97a7", "https://www.theringer.com/_next/image?url=https%3A%2F%2Fwp.theringer.com%2Fwp-content%2Fuploads%2F2024%2F11%2FHalliwell_Kate.jpg&w=128&q=75&dpl=406f3adf64ea2410894205e03accb4e416ca97a7", "https://wp.theringer.com/wp-content/uploads/2017/12/cropped-112069346.jpg.jpg"], "top_img": "https://wp.theringer.com/wp-content/uploads/2017/12/cropped-112069346.jpg.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.theringer.com/2017/12/05/movies/gotti-pulled-john-travolta", "title": "John Travolta’s ‘Gotti’ Biopic Pulled 10 Days Before Release", "meta_data": {"viewport": "width=device-width", "description": "Lionsgate has sold the film back to its producers", "og": {"title": "John Travolta’s ‘Gotti’ Biopic Pulled 10 Days Before Release", "description": "Lionsgate has sold the film back to its producers", "image": "https://wp.theringer.com/wp-content/uploads/2017/12/cropped-112069346.jpg.jpg"}, "twitter": {"card": "summary_large_image"}, "next-head-count": 10}, "movies": [], "publish_date": 1512450000.0, "source": "https://www.theringer.com", "summary": ""}