{"url": "https://www.nydailynews.com/entertainment/gossip/munn-rodgers-estranged-family-dated-article-1.4005924", "text": "Olivia Munn finally shed some light on her ex-boyfriend Aaron Rodgers’ strained relationship with his family.\n\nRumors have long existed that Rodgers’ romance with the actress played a factor in his estrangement from his family. But Munn now says Rodgers had already gone eight months without speaking to his parents or one of his brothers by the time she started dating him.\n\n“I remember my last day on ‘The Newsroom’ … I spent the day in my trailer just encouraging him to have an honest conversation with (his) parents, and we just kind of (did) bullet point stuff,” Munn said Wednesday on Andy Cohen’s SiriusXM radio show.\n\nOlivia Munn says she attempted to help her ex-boyfriend Aaron Rodgers get back on good terms with his parents.\n\n“They had a really nice conversation, and then they started coming out my first year when I was in Green Bay in 2014, and then it just (went downhill),” she said.\n\nMunn, 37, says she only saw Rodgers’ parents a few times during their three-year relationship, which ended last year. She says she also met his brother Jordan, who competed on “The Bachelorette” in 2016 and revealed on the show that his brother wasn’t on good terms with their family.\n\nRodgers’ father Ed later confirmed in early 2017 that he wasn’t on speaking terms with the two-time NFL MVP.\n\n“Fame can change things,” Ed told The New York Times.\n\nMunn is “not really” on speaking terms with Rodgers anymore.\n\nHis father’s comments garnered considerable attention, but Rodgers, 34, and Munn remained mostly tight-lipped on the matter. A source told Us Weekly at the time that Rodgers’ family “didn’t trust” Munn. She and Rodgers broke up several months later.\n\nMunn said Wednesday she believes fame can lead to challenges for families, especially in situations like Rodgers’ where several of his family members are also attempting to have professional success in the sports world. Rodgers’ father is a sports chiropractor, while Jordan played college football and is currently an analyst for ESPN’s SEC Network.\n\n“At the end of the day there is a lot of complications,” Munn said. “I don’t think either side of the road is clean, but I do think it’s not OK when you try to stand on someone’s shoulders and then throw dirt in their face, which is what I think they did with him.”\n\nMunn said she’s “not really” on speaking terms with Rodgers, who has since begun a relationship with Danica Patrick.", "images": ["https://www.nydailynews.com/wp-content/uploads/migration/2018/05/23/CBH7SE7WLZF664N274EUWUPWOA.jpg?w=1024&h=670", "data:image/webp;base64,UklGRiQAAABXRUJQVlA4IBgAAAAwAQCdASoBAAEAAwA0JaQAA3AA/v3AgAA=", "https://www.nydailynews.com/wp-content/uploads/2023/08/New_York_Daily_News_nydredblack-1.svg"], "top_img": "https://www.nydailynews.com/wp-content/uploads/migration/2018/05/23/CBH7SE7WLZF664N274EUWUPWOA.jpg?w=1024&h=670", "keywords": [], "authors": ["Peter Sblendorio"], "canonical_link": "https://www.nydailynews.com/2018/05/23/olivia-munn-says-aaron-rodgers-was-estranged-from-family-before-they-started-dating/", "title": "Olivia Munn says Aaron Rodgers was estranged from family before they started dating", "meta_data": {"application-name": "newyorkdailynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "robots": "max-image-preview:large", "tdm-reservation": 1, "mrf": {"authors": "Peter Sblendorio", "canonical": "https://www.nydailynews.com/2018/05/23/olivia-munn-says-aaron-rodgers-was-estranged-from-family-before-they-started-dating/"}, "description": "The actress finally shed some light on her ex-boyfriend's strained relationship with his family.", "generator": "WordPress 6.8.3", "og": {"type": "article", "title": "Olivia Munn says Aaron Rodgers was estranged from family before they started dating", "url": "https://www.nydailynews.com/2018/05/23/olivia-munn-says-aaron-rodgers-was-estranged-from-family-before-they-started-dating/", "description": "Olivia Munn finally shed some light on her ex-boyfriend Aaron Rodgers’ strained relationship with his family. Rumors have long existed that Rodgers’ romance with the actress played a fa…", "site_name": "New York Daily News", "image": {"identifier": "https://www.nydailynews.com/wp-content/uploads/migration/2018/05/23/CBH7SE7WLZF664N274EUWUPWOA.jpg?w=1024&h=670", "width": 1024, "height": 670}, "locale": "en_US"}, "article": {"published_time": "2018-05-23T16:16:50+00:00", "modified_time": "2018-05-23T21:01:23+00:00"}, "twitter": {"text": {"title": "Olivia Munn says Aaron Rodgers was estranged from family before they started dating"}, "image": "https://www.nydailynews.com/wp-content/uploads/migration/2018/05/23/CBH7SE7WLZF664N274EUWUPWOA.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.nydailynews.com/wp-content/uploads/2023/09/cropped-DailyNewsCamera-7.webp?w=270"}, "movies": [], "publish_date": 1527092210.0, "source": "https://www.nydailynews.com", "summary": ""}