{"url": "https://en.wikipedia.org/wiki/Rey_(Star_Wars)", "text": "Fictional character from Star Wars\n\nFictional character\n\nRey is a fictional character in the Star Wars franchise. She was created by Lawrence Kasdan, J. J. Abrams, and Michael Arndt for The Force Awakens (2015), the first installment of the sequel film trilogy, and is primarily portrayed by Daisy Ridley.[i] Rey also appears in the film's sequels, The Last Jedi (2017) and The Rise of Skywalker (2019), and related Star Wars media.\n\nRey is introduced as a scavenger who was abandoned as a child on the desert planet Jakku. She becomes an ally of the Resistance in its conflict with the First Order. Powerfully Force-sensitive, Rey trains to be a Jedi under the siblings Luke Skywalker and Leia Organa. She faces adversaries such as Kylo Ren, Supreme Leader Snoke and the resurrected Sith Lord, Emperor Palpatine—who is revealed to be her grandfather in The Rise of Skywalker. Despite being enemies, Rey and Ren share a connection called a \"Force dyad\" and eventually join forces.[10] Following Palpatine's defeat, Rey adopts the name Rey Skywalker to honor her mentors.[11]\n\nDevelopment\n\nCreation and casting\n\nIn 2012, Lucasfilm President Kathleen Kennedy invited Michael Arndt to write three screenplays for the Star Wars sequel trilogy. Intimidated by the scale of the project, Arndt at first turned down the offer. He accepted the writing position, however, after Kennedy explained that the films would tell the origin story of a female Jedi.[12] The character Rey was known as \"Kira\" in the early stages of production, and Arndt described her as a \"loner, hothead, gear-head, badass\".[13] Arndt struggled with introducing the young woman as the main character while keeping her from being overshadowed by Luke Skywalker, whose role in the film was eventually minimized.[12]\n\nOn creating a female lead for the new trilogy, Abrams stated that from his initial discussions with writer Lawrence Kasdan, he was excited at the concept of having a woman at the center of the story. He said that \"We always wanted to write Rey as the central character\" and that other female representation in the story was also important.[6] Kennedy stated that, \"Rey is the new generation's Luke Skywalker.\"[14] Rey's background as a scavenger was part of the developers attempting to portray her as \"the ultimate outsider and the ultimate disenfranchised person\", due to their belief that a person of that nature would likely experience a prolonged journey compared to other types of people.[15]\n\nDaisy Ridley was largely unknown before being cast as Rey. She auditioned many times for the role over the course of seven months, and had to keep her casting a secret for three months.[16] She was announced as part of the cast at the end of April 2014. She only had experience with small parts in TV shows. Her inexperience and lack of exposure were a crucial part of what convinced Abrams to give Ridley the role, as the previous installments had featured relatively unknown talent that would not experience heightened degrees of scrutiny.[17] Abrams stated that Ridley \"was so funny and had a great spark\", as well as having her act out an emotional scene, proclaiming that \"she nailed it on the first take.\" Abrams went on to praise Ridley, saying, \"She was born with this gift to be in a moment and make it her own. She simultaneously works from the inside out and the outside in.\"[18] Kennedy proclaimed, \"Daisy had a physicality and a self-confidence that was so important to the character we were looking for. She epitomizes that optimism where anything is possible.\"[18] Director Dusan Lazarevic, who was present at the casting of Ridley for a role in British drama series Silent Witness, in addition to praising her acting range, stated, \"She showed a combination of vulnerability and strength which gave her a complexity, and there was an intelligence in her eyes that was an indicator she could play quite a complicated part.\"[17] Cailey Fleming was additionally cast to portray a young Rey.[1]\n\nAlthough Ridley said she was \"riddled with doubts and insecurities\", she said that Rey's hopefulness is what she related to most: it \"was something driving me through the auditions—even though it felt so insanely out of anything that I could've imagined.\"[19] Ridley recalled her shooting experience as starting off bumpy, with Abrams telling her that her first few takes were \"wooden\".[20] But Ridley and Abrams had an \"incredibly collaborative\" process creating Rey; Ridley recalled that the character \"changed from when we first began, she became softer. And I think that's probably me, because Americans tend not to understand me, so it helped, slowing down the speech and everything just made it softer than I am.\"[19] Ridley has said that Rey will have \"some impact in a girl power-y way\", adding that the character \"doesn't have to be one thing to embody a woman in a film. It just so happens she's a woman but she transcends gender. She's going to speak to men and women.\"[21] In an interview with Elle, Ridley said, \"She's so strong. She's cool and smart and she can look after herself,\" adding, \"Young girls can look at her and know that they can wear trousers if they want to. That they don't have to show off their bodies.\"[18]\n\nComposer John Williams said he loved Ridley's presence in the film, and found composing her musical theme an interesting challenge. He said her mature and thoughtful motif suggests a strong female adventurer infused with the Force.[22] He added that the \"musical grammar\" of her theme is not heroic, but conveys \"an adventurous tone that needs to illustrate empathy.\"[23]\n\nCharacterization\n\nRey is introduced as a 19-year-old woman in The Force Awakens.[24] She is stubborn, headstrong, brave, optimistic, and maintains fierce loyalty to her friends. Matthew Yglesias of Vox wrote, \"Rey is considerably less callow than Luke\".[25] Ridley says of the character, \"It's not because Rey is strong that she's amazing. It's all the complexities of a human. It's because she is a well-drawn person who is struggling with things and you're with her.\"[26]\n\nRey is highly Force-sensitive, which is revealed when she is presented with the lightsaber first owned by Anakin Skywalker, then his son Luke.[27] Without training, she is able to use the Force and defeat the powerful Kylo Ren in a duel.[28]\n\nOn the mirror-invoking vision Rey experiences in The Last Jedi, writer and director Rian Johnson said that it represents the character learning that she has to connect with herself.[29]\n\nIn The Last Jedi, Rey also discovers she has a connection in the Force with Kylo Ren, in which Rian Johnson claims that it was used as a way to make Rey engage with him and get the two characters to talk without fighting each other, to further develop their relationship.[30] Johnson explains that Rey seeing Kylo shirtless during one of these connections shows the increasing intimacy between them during their interactions.[30] In The Rise of Skywalker, it is revealed that this connection makes them two halves of a \"dyad\" in the Force, and the co-writer of the film, Chris Terrio, explains this relationship as being \"sort of soulmate[s] in the Force\"[31] and \"twins of fate, twins of destiny\". Both Johnson and director J.J. Abrams described their relationship as a romance.[30][33][34][35]\n\nAppearances\n\nThe Force Awakens\n\nRey is introduced in the 2015 film The Force Awakens as a young adult who lives on the desert planet Jakku and survives by scavenging machine parts. After rescuing the droid BB-8, she encounters Finn, a former stormtrooper. When Rey and Finn are attacked by the First Order, they steal the Millennium Falcon and escape the planet. The smugglers Han Solo and Chewbacca capture the Falcon in their freighter ship and assert they are its rightful owners. When vengeful mercenaries arrive on the freighter, Rey and the others escape in the Falcon. Impressed by Rey's piloting skills, Han offers her a job on the ship. She declines, saying she must return to Jakku. The group then journeys to Maz Kanata's castle to deliver BB-8 to the Resistance. There, Rey discovers a lightsaber that previously belonged to the Jedi Master Luke Skywalker. Upon touching it, she experiences a powerful vision, which includes an image of her younger self being abandoned on Jakku. Maz tells her that whoever abandoned her will never return, and her only option is to seek out strength in the Force. Feeling overwhelmed, Rey rejects the lightsaber and flees into the forest.\n\nThe First Order arrives and attacks Maz's castle. Kylo Ren—a First Order warlord and the son of Han —captures Rey and takes her to Starkiller Base. There, he uses the Force to probe her mind for a map that BB-8 showed her. Rey discovers she can use the Force to resist his efforts and read his emotions. Ren reports to his master, Supreme Leader Snoke, who commands that Rey be brought before him. Meanwhile, Rey escapes and eventually reunites with Finn, Han, and Chewbacca, who have come to disable the shield protecting the base. Han confronts Ren, and Rey watches in horror as Ren kills him.\n\nAs Rey and Finn try to escape the base, Ren ambushes them. He seriously injures Finn, then engages in a lightsaber duel with Rey. Initially overpowered, she eventually wounds Ren and flees in the Falcon. The Resistance destroys Starkiller Base, and Rey returns to the Resistance headquarters with Chewbacca and Finn, who is unconscious. While the Resistance celebrates their victory, Rey mourns Han's death with General Leia Organa. Rey decides to seek out Luke, using information about his location provided by BB-8 and R2-D2. When she finds him on the planet Ahch-To, she offers the Jedi Master his lightsaber.\n\nThe Last Jedi\n\nThe Last Jedi (2017) begins precisely where the previous film ended. Rey attempts to recruit Luke to the Resistance, but he refuses to help. He eventually agrees to give her a limited amount of training in the Force. Rey demonstrates immense raw strength and a clear temptation toward the dark side of the Force, which reminds Luke of Ren, who was once his student. During this time, Rey feels a connection through the Force with Ren, who tells her that Luke tried to murder him. After one of their conversations, Rey says she can feel conflict within Ren, and becomes determined to bring him back from the dark side. She leaves Ahch-To to meet with him.\n\nWhen she arrives, Ren takes her prisoner and brings her before Snoke. The Supreme Leader informs her that he created the connection between her and Ren as a way to reach Luke. He tortures Rey and eventually orders Ren to kill her, but Ren kills him instead. Ren and Rey then fight Snoke's guards side by side. After they defeat the guards, Ren asks Rey to join him in creating a new order separate from the legacies of Snoke and Luke. During their conversation, Ren gets Rey to admit that her parents abandoned her. Rey ultimately refuses to take Ren's hand, and uses the Force to summon Luke's lightsaber. Ren also uses the Force to pull the weapon towards him, which destroys it. Rey takes the pieces of the lightsaber and flees.\n\nIt is later revealed that Rey returned to the Falcon, then helped the Resistance fight the First Order on Crait. The Resistance loses the battle, and Rey attempts to evacuate the surviving fighters. She uses the Force to remove a barrier of stones, which allows them to escape aboard the Falcon. Rey reunites with Finn and Leia, and meets Poe Dameron for the first time. She senses Luke's death through the Force, and assures Leia that he died with \"peace and purpose\". Rey asks her how they can rebuild the Resistance, and Leia, gesturing towards Rey, says they have all they need.\n\nThe Rise of Skywalker\n\nA wax figure of Rey at the Madame Tussauds museum in London\n\nThe Rise of Skywalker (2019) is set one year after the events of The Last Jedi.[37] Rey is continuing her Jedi training at the Resistance base under the tutelage of Leia. The Resistance discovers that Emperor Palpatine has been resurrected and is manipulating events from the Sith world Exegol. His followers—known as the Sith Eternal—have constructed a massive armada of Sith Star Destroyers called the Final Order. Rey and her companions search for a Sith wayfinder, which can lead them to Exegol. They locate a clue to the location of the wayfinder with the help of Lando Calrissian. Meanwhile, Rey continues communicating with Ren. Through this correspondence, Ren learns where Rey is and pursues her. She confronts him, inadvertently causing Chewbacca to be taken aboard a First Order transport. Attempting to save the Wookiee, Rey accidentally destroys the transport with Force lightning, seemingly killing him. She is stricken, and reveals to Finn that she has seen visions of herself sitting on the Sith throne.\n\nRey and the others travel to Kijimi and meet with the droid-smith Babu Frik, who extracts the location of the wayfinder from C-3PO's memory. Rey senses Chewbacca is alive and aboard a First Order Star Destroyer, and the group mounts a rescue mission. Rey enters Ren's quarters on the ship, and has visions of her parents being killed. Ren informs her that she is Palpatine's granddaughter, and that her parents lived in anonymity to protect her. Palpatine's assassin Ochi murdered her mother and father, but never found Rey. Ren also reveals that the connection he shares with Rey is a dyad in the Force. Ren urges her to join him so they can overthrow Palpatine and rule together. Rey refuses and leaves for Kef Bir, where she obtains the wayfinder.[38] Ren arrives, destroys the wayfinder, and duels with Rey. Leia calls to Ren through the Force, and Rey impales him while he is distracted. Rey then uses the Force to heal Ren and confesses that she wanted to take his hand earlier, but the hand of Ben Solo, not Kylo Ren. Rey leaves Ren and departs aboard his ship. Disturbed by her Sith lineage, she travels to Ahch-To, intending to live in exile. However, Luke appears as a Force spirit and encourages her to face Palpatine. He gives her Leia's lightsaber and his X-wing, and she departs for Exegol using the wayfinder from Ren's ship.\n\nRey transmits her coordinates to the Resistance, allowing them to attack the Sith Eternal forces. She confronts Palpatine, who demands that she kill him out of anger, which will allow him to possess her body. Ren arrives and joins Rey; he has rejected the dark side and has once again become Ben Solo. Palpatine absorbs the life energy of both Rey and Ben, and casts Ren off a high ledge. Weakened, Rey hears the voices of past Jedi, who restore her strength. Palpatine assaults her with Force lightning, but Rey reflects it back at him using Luke and Leia's lightsabers. Palpatine's lightning kills him and Rey collapses, seemingly dead. Ben returns and uses the Force to revive Rey, but the effort drains him; Rey kisses him before he vanishes into the Force. After reuniting with her friends at the Resistance base, Rey travels to Tatooine and buries the Skywalker lightsabers near Luke's childhood home. As she inspects her new yellow lightsaber, a passerby asks for her name. Noticing the Force spirits of Luke and Leia nearby, she responds, \"Rey Skywalker\".\n\nUntitled Rey film\n\nAt Star Wars Celebration 2023, it was announced that Ridley will reprise the role of Rey in an upcoming film directed by Sharmeen Obaid-Chinoy. The film, which is rumored to be titled New Jedi Order, will take place fifteen years after the events of The Rise of Skywalker, and it will focus on Rey rebuilding the Jedi Order. The film's release date has not been announced.[39][40]\n\nLiterature\n\nStar Wars: Before the Awakening (2015) is an anthology book for young readers that focuses on the lives of Rey, Finn and Poe before the events of The Force Awakens.[41] Rey's Survival Guide (2015) is a first-person account from Rey's perspective about herself and Jakku.[42] The novelization of The Rise of Skywalker reveals that Rey's father was a nonidentical clone of Palpatine.[43] The 2019 novel Resistance Reborn follows Rey in events leading up to The Rise of Skywalker, while the comic series Star Wars Adventures features a story in which Rey, Finn and Poe fight remnants of the First Order after Palpatine's defeat.[44][45][46]\n\nTelevision and series\n\nRey is featured in the web series Forces of Destiny (2017–2018),[2] and makes a brief appearance as a disembodied voice in the season four episode \"A World Between Worlds\" of the television series Star Wars Rebels.[3] In the episode, which is set 16 years before Rey's birth and 35 years before The Force Awakens, the young Padawan Ezra Bridger hears Rey's voice in the World Between Worlds, a dimension that exists outside of time and space.[3][47]\n\nRey is featured in the television film The Lego Star Wars Holiday Special (2020), which is set after the events of The Rise of Skywalker.[48][49][50] In the film, Rey finds a crystal that enables her to time travel with BB-8. She encounters Luke, Yoda, Din Djarin and other characters. During her travels, she unwittingly allows Palpatine and Darth Vader to follow her.[51]\n\nVideo games\n\nRey appears in the video games Disney Infinity 3.0 (2015), Lego Star Wars: The Force Awakens (2016), and Star Wars: Battlefront II (2017), all voiced by Ridley,[52][53] as well as in the strategy video game Star Wars: Force Arena (2017).[54] Helen Sadler voiced the character in Lego Star Wars: The Resistance Rises, the alpha version of Star Wars Battlefront II,[55] and Lego Star Wars: The Skywalker Saga.[56] The character was also introduced as an outfit in the game Fortnite.[57]\n\nAbsence from merchandise\n\nWhen The Force Awakens was released, fans noticed a lack of licensed toys featuring Rey, despite her being the film's main protagonist.[58] For example, Hasbro released a version of Monopoly based on The Force Awakens that did not feature Rey. After receiving criticism, Hasbro stated that Rey was withheld to avoid revealing spoilers, and that she would be featured in future toy releases.[59] Paul Southern, the head of Lucasfilm Licensing, said that they wanted to protect the secrets that \"the Force awakens in Rey\" and that her character carries a lightsaber.[60] He said that demand for Rey products was underestimated.[61][62] Abrams said it was \"preposterous and wrong\" that Rey was not well-represented in merchandizing.\"[8] The CBBC presenter and voice actor Christopher Johnson stated: \"It still baffles me to this day that some toy manufacturers don't think that girls want to play with 'superhero' toys and that boys aren't interested in female characters.\"[63]\n\nReception\n\nGeneral\n\nThe character and Ridley's portrayal have received critical acclaim. Joe Morgenstern of The Wall Street Journal proclaims that Rey is \"a woman warrior with the stylish ferocity of a kung-fu star,\" praising \"the verve [Ridley] must have been born with plus the skill she must have acquired as a young actress coming up in England,\" and stating, \"It's hard to imagine what the movie—and the sequels to come—might have been if they'd cast the wrong person, but here Daisy Ridley is in all her unassuming glory, and all's right with the galaxy.\"[64] Adam Howard of MSNBC states that \"one of the most pleasant surprises of the film has been the strength of its lead female character,\" adding that some have likened Rey to a \"new feminist icon\".[65]\n\nMegan Garber of The Atlantic writes that Rey \"proves herself to be, in extremely short order, extremely adept as a fighter\".[66] Emily Rome of HitFix describes Rey as \"more 'strong female character' than strongly written\", saying \"the speed with which Rey mastered Jedi mind tricks and lightsaber fighting with zero training is the stuff of fan fiction. Rey is geek feminist wish-fulfillment\".[67] Rome says Rey is \"everything we wanted in a Star Wars female character,\" praising her for being a character that is \"independent, skilled, scrappy, tough, and doesn't need saving.\"[67]\n\nTwitter users have debated whether Rey is a Mary Sue—an unrealistically perfect, idealized character—on the basis of her seemingly natural skills as a mechanic, a fighter, a pilot, and a user of \"The Force\", which draw admiration from other characters.[68] Screenwriter Max Landis posted a series of tweets in 2015 derisively referring to The Force Awakens as \"a fanfic movie with a Mary Sue as the main character\".[68][69] Tasha Robinson of The Verge writes that Rey \"keeps falling into standard-issue damsel-in-distress situations, then capably rescuing herself [...] She's a fantasy wish-fulfillment character with outsized skills, an inhuman reaction time, and a clever answer to every question — but so are the other major Star Wars heroes.\"[70] Robinson suggests viewers enjoy Rey's \"Mary Sue flawlessness\", saying, \"We wouldn't be worrying about Rey's excessive coolness if she were Ray, standard-issue white male hero\".[68][70]\n\nOther outlets, including Ridley herself, have argued that the term Mary Sue carries an inherent gender bias,[71] and that the male characters from the original trilogy did not face comparable criticism.[72] Media critic Caroline Framke argues that Rey's abilities are not necessarily any more impressive than those of the character of Luke Skywalker, and that fans' instinctive criticism of characters like Rey reflects a double standard in that seemingly perfect male heroes are rarely so criticized.[68] J. J. Abrams stated that \"the people who are getting freaked out are the people who are accustomed to [male] privilege, and this is not oppression, this is about fairness.\" He elaborated, \"You can probably look at the first [Star Wars] movie that George [Lucas] did and say that Leia was too outspoken, or she was too tough. Anyone who wants to find a problem with anything can find the problem. The internet seems to be made for that.\"[73] Adrienne Tyler of Screen Rant argued that Rey's abilities are explained in The Rise of Skywalker as resulting from the pair forming a dyad in the Force, sharing the same fighting capabilities.[74]\n\nRey's unique hairstyle attracted attention before and after The Force Awakens was released,[75] being compared to Leia's hairdo from the original film, with debate over whether it would become as popular.[76] Rey has also been compared to the titular character from the Hayao Miyazaki anime film Nausicaä of the Valley of the Wind (1984).[77]\n\nRichard Roeper described Ridley's portrayal of Rey as \"a breakout performance\", continuing by calling the character \"tough and resourceful and smart and brave\".[78] Ridley was nominated for a 2016 Saturn Award for Best Actress for her portrayal.[79] The first Reel Women in Technology Award for a fictional character was awarded to the character Rey.[80]\n\nSome fans criticized Rey's trilogy-wide character arc as insufficient. Fan fiction author Ricca said that tension that was built in the first two films never gets resolved in the last film. She wanted a moment at the end of The Rise of Skywalker in which Rey reacts to and reflects on everything that has happened to her.[81]\n\nSome critics and fans have noted a visual resemblance between Rey's character design to that of Bastila Shan from the video game Star Wars: Knights of the Old Republic, and that her character arc shares thematic similarities with that of Bastila's.[82][83][84][85]\n\nParentage\n\nThe question of Rey's parentage was a significant point of discussion before The Rise of Skywalker was released.[86][87] Many fan theories arose, such as Rey being the daughter of Luke or Han, or being Obi-Wan Kenobi's granddaughter.[86][88][89] The view that she is Luke's daughter was especially prominent, with fans and critics highlighting their story arc similarities, Star Wars being a Skywalker saga, Rey having a strong attachment to Luke's lightsaber, and being exceptionally strong with the Force without any training.[88][89][90] Some fan theories about Rey's parentage pointed to \"Rey's Theme\" featured in John Williams' score of The Force Awakens, as the theme shared similarities with the themes for Darth Vader and Luke.[91]\n\nAbrams stated that he intentionally withheld Rey's last name and background in The Force Awakens.[92] He said that he felt that the origin of Kylo Ren was the only thing that could be revealed in his film and that he knew \"quite a bit\" about Rey's origin but would give courtesy to The Last Jedi director Rian Johnson by not saying any more.[93][94]\n\nIn The Last Jedi, Rey is coaxed by Ren into admitting that her parents were \"nobodies\". Emily VanDerWerff of Vox equated this scene with Luke finding out that Darth Vader is his father, which was his greatest nightmare.[95] To VanDerWerff, \"Rey's greatest nightmare is being no one.\" She added that while Ren \"has every reason to be lying\" about this, to her mind it is a good thing that \"Rey is the child of nobody of particular importance to the story so far.\"[95] Josh Spiegel of The Hollywood Reporter stated that although some fans might be disappointed by Ren's revelation, it \"fits in perfectly\" with the film's through line that one can be \"both exceptionally gifted in the Force and also not a Skywalker\" because \"the spirit of the Jedi extends ... to anyone with a gift and the power to believe.\"[96]\n\nBefore the release of The Rise of Skywalker, Abrams said that \"there's more to the story than you've seen,\"[97] though, according to Ridley, the facts presented in The Last Jedi would not change.[98] Rey being revealed as a Palpatine in The Rise of Skywalker received a mixed reception. Joanna Robinson of Vanity Fair interprets the twist as a rebuttal to the themes presented in Episode VIII, calling it \"a blow to those fans who eagerly devoured [Rian] Johnson's message that anyone from anywhere can be a Force-wielding hero.\"[99] Contrarily, Ryan Britt of Fatherly wrote that the revelation may be resonant for those with a \"Dark Side-inclined family,\" because Rey decides not to play Palpatine's \"stupid game\", and \"when Palpatine's face melts off and the dark side disappears into the ether, a lot of emotional family bullshit goes with it.\"[100] Inverse similarly argued that the end of the film sees Rey reject \"any power her grandfather held over her\" and \"bury the past\", in a completion of the hero's journey.[101]\n\nFollowing the release of The Rise of Skywalker, Daisy Ridley revealed that the identity of Rey's parents had been in constant flux over the course of the production of the sequel trilogy. According to Ridley, during early production Lucasfilm had been \"toying with an Obi-Wan connection\" before settling on the idea of her character being a nobody.[102] J. J. Abrams then pitched the idea of Palpatine being Rey's grandfather to Ridley during pre-production on Episode IX, although this aspect of her character \"kept changing\" even into production.[102] James Hunt of Screen Rant argued that the idea of an Obi-Wan connection \"would've been an equally bad decision,\" because it would still mean the character \"is powerful because of her lineage, rather than Rey simply being powerful because the Force chose her. It [would have continued] the focus on nostalgia and trying to connect everything, rather than letting Rey be wholly new.\"[103] Kathleen Kennedy later clarified that \"there were a lot of ideas being thrown around\" but that Obi-Wan having offspring \"was pretty much off the table\".[104]\n\nSee also\n\nNotes\n\nReferences\n\nFurther reading", "images": ["https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Rey_Palpatine_at_Madame_Tussauds_London.jpg/250px-Rey_Palpatine_at_Madame_Tussauds_London.jpg", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/20px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/20px-Video-x-generic.svg.png", "https://upload.wikimedia.org/wikipedia/en/a/af/Rey_Star_Wars.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Dragon-149393.svg/20px-Dragon-149393.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/a/af/Rey_Star_Wars.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Rey_(Star_Wars)", "title": "Rey (Star Wars)", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/a/af/Rey_Star_Wars.png", "width": 972, "height": 1200}, "title": "Rey (Star Wars) - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}