{"url": "www.inquisitr.com/3923928/despite-claims-jennifer-aniston-and-justin-theroux-did-not-fight-at-orlando-blooms-birthday-celebration/", "text": "If it isn’t pregnancy rumors Jennifer Aniston is the subject of, the beauty is making tabloid headlines for her apparent troubled relationship with her husband, Justin Theroux. Even an open letter in the Huffington Post pleading that the tabloids stop reporting false stories about her and her marriage has not managed to take tabloid focus off the star.\n\nAlthough the pregnancy rumors have halted since Jen penned the letter in the publication, she remains the subject of falsities about her marriage and has recently admitted that she feels although the essay did make media members more aware of the affects such falsities have on celebrities and the manner that women are discussed in the media, that it did little to halt the fabricated tales from making the front page about she and other female figures in the spotlight.\n\nThe beauty spoke with Variety recently on the topic as Vanity Fair relays.\n\n“I had no idea it would get the response that it did; I was thrilled with that. But sadly, people still buy into it. They are consumers of this trash and they eat it up. It’s definitely in people’s consciousness a lot more. But you’re always going to have the Piers Morgans of the world contradicting something that comes from the heart and saying, ‘You’re a hypocrite.”\n\nAniston’s point is validated by recent rumors that claimed Jen and Justin had a blowout fight at actor Orlando Bloom’s birthday celebration. In Touch has ignited this rumor, as Gossip Cop shares. The tabloid claims that the couple had a “miserable night out” while at Bloom’s 40th in Palm Springs. The gossip policing site shares the claims by the tabloid.\n\n“At one point, Justin was having a blast with Orlando and Leo [DiCaprio]. But Jen obviously didn’t like that they were stealing his attention away from her, so she walked over and took Justin’s hand and pulled him away.”\n\nThe insider adds that Aniston “… would pout and get angry any time Justin started to have fun… Justin’s pals actually felt bad for him.” The insider adds that Jen “is always monitoring Justin’s life, and no one can take it anymore. His friends have told him enough is enough.”\n\nJennifer Aniston, Justin Theroux Not Caught Openly Fighting At Orlando Bloom’s Birthday Party, Despite Report https://t.co/sup8sK42He — Gossip Cop (@GossipCop) January 26, 2017\n\nGC has checked with both stars’ reps. Aniston’s rep assures that the story is “ridiculous,” while Theroux’s rep insists the claim is simply “false.” The site reminds that In Touch has reported false stories about Jen and Justin in the past, including when it alleged that the happy couple were taking a vacation to try to save their marriage.\n\nJennifer Aniston and Justin Theroux join in on the fun at Orlando Bloom’s surprise birthday party https://t.co/aVf3C4PqrO pic.twitter.com/YKEqP7bxZs — People Magazine (@people) January 16, 2017\n\nIt’s clear that those behind the false claims about Jennifer Aniston and Justin Theroux, and those photographers who incessantly hassle the star to snap an image that can be used to begin one of those false claims, have not heeded her words about how frustrated she is with the ludicrous claims made on the daily about she and Justin, in addition to other mainly female celebrities who endure the same treatment. Despite not being fully heeded, Aniston’s words in the Huffington Post letter “For the Record,” are certainly worth revisiting in hopes that they will one day resonate and inspire change.\n\n“If I am some kind of symbol to some people out there, then clearly I am an example of the lens through which we, as a society, view our mothers, daughters, sisters, wives, female friends and colleagues. The objectification and scrutiny we put women through is absurd and disturbing. The way I am portrayed by the media is simply a reflection of how we see and portray women in general, measured against some warped standard of beauty.”\n\n[Featured Image by Mark Davis/Getty Images]", "images": ["https://www.inquisitr.com/wp-content/uploads/2025/10/2421769f-57a4-4bff-913f-cf316747493e.jpg", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20500%20157'%3E%3C/svg%3E", "https://secure.gravatar.com/avatar/7c579880583dd6b39bd9186b37bc2101?s=120&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20492%20142'%3E%3C/svg%3E", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo-white.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/inquisitr-logo.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent-Dark-Mode.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20120%20120'%3E%3C/svg%3E"], "top_img": "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "keywords": [], "authors": ["News Writer"], "canonical_link": "https://www.inquisitr.com/despite-claims-jennifer-aniston-and-justin-theroux-did-not-fight-at-orlando-blooms-birthday-celebration", "title": "Despite Claims, Jennifer Aniston And Justin Theroux Did Not Fight At Orlando Bloom’s Birthday Celebration", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "https://www.inquisitr.com/wp-content/uploads/2024/12/favicon.png", "description": "If it isn’t pregnancy rumors Jennifer Aniston is the subject of, the beauty is making tabloid headlines for her apparent troubled relationship with her", "robots": "follow, index, max-snippet:-1, max-video-preview:-1, max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Despite Claims, Jennifer Aniston And Justin Theroux Did Not Fight At Orlando Bloom’s Birthday Celebration - Inquisitr News", "description": "If it isn’t pregnancy rumors Jennifer Aniston is the subject of, the beauty is making tabloid headlines for her apparent troubled relationship with her", "url": "https://www.inquisitr.com/despite-claims-jennifer-aniston-and-justin-theroux-did-not-fight-at-orlando-blooms-birthday-celebration", "site_name": "Inquisitr News"}, "article": {"tag": "Orlando Bloom", "section": "News", "published_time": "2017-01-26T16:42:00-05:00"}, "twitter": {"card": "summary_large_image", "title": "Despite Claims, Jennifer Aniston And Justin Theroux Did Not Fight At Orlando Bloom’s Birthday Celebration - Inquisitr News", "description": "If it isn’t pregnancy rumors Jennifer Aniston is the subject of, the beauty is making tabloid headlines for her apparent troubled relationship with her", "site": "@theinquisitr", "creator": "@theinquisitr"}, "generator": "WP Rocket 3.18.3"}, "movies": [], "publish_date": 1485466920.0, "source": "http://www.inquisitr.com", "summary": ""}