{"url": "https://en.wikipedia.org/wiki/Ellen_DeGeneres", "text": "American comedian and television host (born 1958)\n\nEllen Lee DeGeneres ( də-JEN-ər-əs; born January 26, 1958)[1][2] is an American retired comedian, actress, television host, writer, and producer. She began her career in stand-up comedy in the early 1980s, gaining national attention with a 1986 appearance on The Tonight Show Starring Johnny Carson. She starred in the television sitcoms Ellen (1994–1998) and The Ellen Show (2001–2002). She also hosted the syndicated television talk show, The Ellen DeGeneres Show (2003–2022), for which she received 33 Daytime Emmy Awards. In 2021, DeGeneres announced the end of The Ellen DeGeneres Show, following multiple allegations of workplace bullying. The controversy led to internal investigations and a sharp decline in public support, culminating in her decision to retire from the talk show in 2022.\n\nIn April 1997, DeGeneres publicly came out as a lesbian on the cover of Time with the words \"Yep, I'm gay\"[3] and became the first openly gay lead character on an American network television show.[4] DeGeneres also had a successful film career, starring in Mr. Wrong (1996), EDtv (1999), The Love Letter (1999), and most notably voicing the character Dory in Finding Nemo (2003) and Finding Dory (2016). Her accolades include the Mark Twain Prize for American Humor, 20 People's Choice Awards—more than any other individual[5]—and the Presidential Medal of Freedom in 2016.[6] In 2020, she became the second-ever recipient of the Carol Burnett Award for her contributions to television.\n\nDeGeneres has also released several stand-up specials, including HBO's The Beginning (2000) and Here and Now (2003), and Netflix's Relatable (2018) and For Your Approval (2024). She is widely recognized for hosting major awards ceremonies, including the Academy Awards, Grammy Awards, and Primetime Emmy Awards.[7][8] Outside of entertainment, DeGeneres has authored four books and founded the record label eleveneleven and the production company A Very Good Production. She also launched the lifestyle brand ED Ellen DeGeneres, offering apparel, home goods, and pet products.[9]\n\nEarly life and education\n\nEllen Lee DeGeneres was born and raised in Metairie, Louisiana, to Elizabeth Jane \"Betty\" (née Pfeffer) (born 1930), a speech therapist, and Elliott Everett DeGeneres (1925–2018), an insurance agent.[10][11] She has one brother, Vance, a musician and producer.[12] She was raised a Christian Scientist.[13] Her parents filed for separation in 1973 and were divorced the following year.[13] Shortly after, her mother married Roy Gruessendorf, a salesman.[14] Betty Jane and Ellen moved with Gruessendorf from the New Orleans area to Atlanta, Texas.[14] Vance stayed with his father.[citation needed]\n\nWhen she was 15 or 16 years old, DeGeneres was molested by her stepfather.[15][16] Gruessendorf used her mother's recent breast cancer diagnosis as an excuse to touch her inappropriately, saying he needed to examine her breasts for lumps. Eventually, he tried to break down her door and sexually assault her, prompting her to run away from home and spend the night in a hospital.[17] DeGeneres told her mother about the abuse a few years later, but Betty did not believe her, and remained married to Gruessendorf for 18 years afterward. She finally realized that DeGeneres had been telling the truth when his accounts of his behavior toward his stepdaughter kept changing.[18] Gruessendorf died in 1997.[citation needed]\n\nDeGeneres graduated from Atlanta High School in May 1976, after completing her first years of high school at Grace King High School in Metairie. She moved back to New Orleans to attend the University of New Orleans, where she majored in communication studies. After one semester, she left school to do clerical work in a law firm with a cousin, Laura Gillen. Her early jobs included a stint at J. C. Penney[19] and waitressing at TGI Fridays and another restaurant. She also worked as a house painter, a hostess and a bartender. She relates much of her childhood and career experiences in her comedic work.[citation needed]\n\nCareer\n\nStand-up comedy\n\nDeGeneres started performing stand-up comedy at small clubs and coffee houses. By 1981, she was the emcee at Clyde's Comedy Club in New Orleans. DeGeneres cites Woody Allen and Steve Martin as her main influences at this time.[20] In the early 1980s she began to tour nationally, and in 1984 she was named Showtime's funniest person in America.[21] DeGeneres lists Lucille Ball, Carol Burnett and Bob Newhart among her comedic influences.[22]\n\nAfter a 15-year hiatus from performing comedy, DeGeneres appeared in a 2018 Netflix stand-up special, Relatable.[23][24] She released another special, For Your Approval, through Netflix in September 2024.[25]\n\nFilm career\n\nEllen's work in the late 1980s and early 1990s included the film Coneheads. DeGeneres starred in a series of films for a show named Ellen's Energy Adventure, which was part of the Universe of Energy attraction and pavilion at Walt Disney World's Epcot. The film also featured Bill Nye, Alex Trebek, Michael Richards, and Jamie Lee Curtis. The show revolved around DeGeneres's falling asleep and finding herself in an energy-themed version of Jeopardy!, playing against an old rival, portrayed by Curtis, and Albert Einstein. The next film had DeGeneres co-hosting an educational look at energy with Nye. The ride first opened on September 15, 1996, as Ellen's Energy Crisis, but was quickly given the more positive-sounding name Ellen's Energy Adventure. The ride closed permanently on August 13, 2017.\n\nDeGeneres provided the voice of Dory, a friendly fish with short-term memory loss, in the 2003 animated Disney/Pixar film Finding Nemo.[26] The film's director, Andrew Stanton, said that he offered the role to DeGeneres because he had seen an episode of her show where she changed the subject five times before one sentence had finished.[27] For her performance as Dory, DeGeneres won a Saturn Award for Best Supporting Actress, Favorite Voice from an Animated Movie from the Nickelodeon Kids' Choice Awards, and the Annie Award from the International Animated Film Association, for Outstanding Voice Acting. She was also nominated for a Chicago Film Critics Association Award for Best Supporting Actress.[citation needed] She also provided the voice of the dog in the prolog of the Eddie Murphy feature film Dr. Dolittle. Her win of the Saturn Award marked the second time the Academy of Science Fiction, Fantasy & Horror Films has given an acting award to a voice performance; Robin Williams had previously won the Saturn Award for Best Supporting Actor for his performance as the Genie in Aladdin.[citation needed] DeGeneres reprised her role in Finding Dory, the 2016 sequel to Finding Nemo.\n\nTelevision career\n\n1989–2002\n\nDeGeneres came out in Time magazine in April 1997.\n\nDeGeneres's first regular TV role was in a short-lived Fox sitcom called Open House in 1989,[28] a spin-off of the show Duet.[29] She played the role of Margo Van Meter, a receptionist at the Juan Verde Real Estate company.[29][30] The show co-starred Alison LaPlaca and Mary Page Keller. In 1992, producers Neal Marlens and Carol Black cast DeGeneres in their sitcom Laurie Hill, in the role of Nurse Nancy MacIntyre.[31] The series was canceled after only four episodes, but Marlens and Black soon cast her in their next ABC pilot, These Friends of Mine, which they co-created with David S. Rosenthal.[32][33]\n\nInspired by her comedy career, These Friends of Mine was renamed Ellen after the first season.[34] The ABC show was popular in its first few seasons due in part to DeGeneres's style of observational humor; it was often referred to as a \"female Seinfeld\".[35]\n\nEllen reached its height of popularity in April 1997, when DeGeneres came out as a lesbian on the cover of Time (with the headline, \"Yep, I'm gay\") and subsequently The Oprah Winfrey Show. Her character on the sitcom also came out of the closet to her therapist, played by Oprah Winfrey.[36] The coming-out episode, titled \"The Puppy Episode\", was one of the highest-rated episodes of the show. The series returned for a fifth season but experienced falling ratings and was canceled.[37][38]\n\nDeGeneres returned to television in 2001 with a new CBS sitcom, The Ellen Show, which was canceled after 13 episodes. In 2007, a former writer said she treated the writers \"like shit\" saying \"Why do you keep writing these unfunny jokes?\"[39][40] After her sitcoms, DeGeneres would later re-establish herself as a successful talk show host.\n\n2003–2017\n\nDeGeneres in Los Angeles, California, in January 2004\n\nDeGeneres launched a daytime television talk show, The Ellen DeGeneres Show, in September 2003.[41] One of several celebrity-hosted talk shows surfacing at the beginning of that season, including those of Sharon Osbourne and Rita Rudner,[42] her show has consistently risen in the Nielsen ratings and received widespread critical praise.[citation needed] It was nominated for 12 Daytime Emmy Awards in its first season,[43] winning four, including Best Talk Show.[44] The show won 25 Emmy Awards for its first three seasons on the air.[45] For much of the duration of the show, DeGeneres was known for dancing with the audience at the beginning of the show and during commercial breaks. She often gave away free prizes and trips to be in her show's studio audience with the help of her sponsors. DeGeneres later stated that she stopped dancing as it became an expectation and too much of a burden.[46]\n\nDeGeneres celebrated her thirty-year class reunion by flying her graduating class to California to be guests on her show in February 2006. She presented Atlanta High School with a surprise gift of a new electronic LED marquee sign. DeGeneres made a surprise appearance at Tulane University's May 2006 commencement in New Orleans. Following George H. W. Bush and Bill Clinton to the podium, she appeared in a bathrobe and furry slippers. \"They told me everyone would be wearing robes,\" she said. Ellen made another commencement speech at Tulane in 2009.[47]\n\nThe show broadcast for a week from Universal Studios Orlando in March 2007. Skits included DeGeneres going on the Hulk Roller Coaster Ride[48] and the Jaws Boat Ride.[49] DeGeneres was placed on bed rest in May 2007 due to a torn ligament in her back. She continued hosting her show from a hospital bed, tended to by a nurse, explaining \"the show must go on, as they say.\" Guests sat in hospital beds as well.[50] On May 1, 2009, DeGeneres celebrated her 1000th episode with celebrity guests such as Oprah Winfrey, Justin Timberlake and Paris Hilton, among others.[51] Jennifer Aniston and Justin Timberlake surprised DeGeneres on her 2,000th show in December 2015.[52]\n\nDeGeneres in 2009\n\nDeGeneres replaced Paula Abdul as a judge on the ninth season of American Idol. Her role started after the contestant auditions, at the beginning of \"Hollywood Week\".[53][54] It is reported that DeGeneres also signed a contract to be a judge on the show for at least five seasons.[55] She made her American Idol debut on February 9, 2010. However, on July 29, 2010, DeGeneres and Fox executives announced that the comedian would be leaving American Idol after one season. In a statement, DeGeneres said that the series \"didn't feel like the right fit for me\".[56]\n\nDeGeneres began hosting the NBC game show Ellen's Game of Games during the 2017–2018 television season. Based on games played on her talk show, the series previewed on December 18, 2017, with regular episodes starting the following January.[57] It would run for four total seasons until May 2021, with its cancellation announced in January 2022.[58]\n\n2018–2022\n\nThe New York Times profiled DeGeneres in 2018 as she faced the decision of renewing her talk-show contract and was exploring other outlets for her creativity, including her Netflix comedy special Relatable, which spoofs her kind image.[46] They noted she felt boxed in with a reputation of always being nice, and the host who danced all the time.[46] DeGeneres—who acknowledges that she has always been overly sensitive—fretted how her audience would react when she no longer wanted to dance.[46] Her Christian Scientist upbringing included her father's psyche, \"He was a very fearful man, he couldn't hear or engage with anything unpleasant.\"[46]\n\nAllegations of on-set bullying and retirement\n\nIn March 2020, comedian and podcaster Kevin T. Porter had published a thread on Twitter in which he called DeGeneres \"notoriously one of the meanest people alive\", and asked other Twitter users to post \"stories you've heard about Ellen being mean\", pledging to donate two dollars to the Los Angeles Food Bank for each post.[59] The thread quickly went viral, with several posts alleging situations where DeGeneres had been unkind (such as for firing people who greeted her or looked her in the eyes).[60]\n\nIn July 2020, ten former employees of The Ellen DeGeneres Show accused DeGeneres of creating a \"toxic\" on-set atmosphere of \"racism, fear, and intimidation\", including failing to address executives sexually harassing female employees and making \"racist micro-aggressions and abuse\" to or about employees of color, firing employees for taking medical and bereavement leave, and replacing her own crew with non-union workers during the early days of the COVID-19 pandemic.[61][62] The allegations, which the employees made anonymously to BuzzFeed News, followed previous reports of hostile and bullying behavior, such as a former employee's allegation that DeGeneres fired him for setting up a GoFundMe page to cover medical costs not covered by their workplace health insurance.[62][63]\n\nLater that month, Telepictures, a unit of Warner Bros. Entertainment, released an interoffice memo that they would launch an internal investigation, employing WarnerMedia's employee relations team and a third-party consultant to conduct confidential interviews with current and former employees about their experiences on The Ellen DeGeneres Show.[64] DeGeneres issued a statement to her staff taking responsibility for the workplace culture on the show and pledging to \"correct the issues\".[65][66] WarnerMedia began an investigation.[67] DeGeneres apologized to her staff, releasing a statement reading, \"On day one of our show, I told everyone in our first meeting that 'The Ellen DeGeneres Show' would be a place of happiness—no one would ever raise their voice, and everyone would be treated with respect. Obviously, something changed, and I am disappointed to learn that this has not been the case. And for that, I am sorry. Anyone who knows me knows it's the opposite of what I believe and what I hoped for our show.\"[65]\n\nFollowing the investigation, three executives left (Kevin A. Leman II, Ed Glavin, and Jonathon Norman), and the show vowed to take steps to change the culture. DeGeneres apologized again during the eighteenth season's September 2020 opening.[68][69]\n\nOn May 12, 2021, DeGeneres announced that she would end her talk show following the conclusion of its nineteenth season in 2022.[70] The show aired its final episode on May 26, 2022, with Jennifer Aniston, Pink and Billie Eilish appearing as guests, while Portia de Rossi and other members of DeGeneres's family sat in the audience.[71]\n\nLooking back on the situation in July 2024, DeGeneres said that she \"got kicked out of show business for being mean.\" She added that after existing contractual obligations ended, she would leave show business for good.[72]\n\nAward shows\n\nDeGeneres received wider exposure on November 4, 2001, when she hosted the televised broadcast of the Emmy Awards. Presented after two cancellations due to network concerns that a lavish ceremony following the September 11 attacks would appear insensitive, the show required a more somber tone that would also allow viewers to temporarily forget the tragedy. DeGeneres received several standing ovations for her performance that evening, which included the line: \"What would bug the Taliban more than seeing a gay woman in a suit surrounded by Jews?\"[73]\n\nDeGeneres hosted the 2005 Primetime Emmy Awards ceremony held on September 18, 2005. This was three weeks after Hurricane Katrina, making it the second time she hosted the Emmys following a national tragedy. She also hosted the Grammy Awards in 1996 and in 1997.\n\nOn September 7, 2006, DeGeneres was selected to host the 79th Academy Awards ceremony, which took place on February 25, 2007.[74] This makes her the first openly gay person to have hosted the event.[75] During the Awards show, DeGeneres said, \"What a wonderful night, such diversity in the room, in a year when there's been so many negative things said about people's race, religion, and sexual orientation. And I want to put this out there: If there weren't blacks, Jews and gays, there would be no Oscars, or anyone named Oscar, when you think about that.\"[76] Reviews of her hosting gig were positive, with one saying, \"DeGeneres rocked, as she never forgot that she wasn't just there to entertain the Oscar nominees but also to tickle the audience at home.\"[77] Regis Philbin said in an interview that \"the only complaint was there's not enough Ellen.\"\n\nDeGeneres was nominated for an Emmy Award as host of the Academy Awards broadcast.[78] On August 2, 2013, it was announced that DeGeneres would host the Academy Awards on March 2, 2014, for the second time.[79]\n\nA selfie orchestrated by 86th Academy Awards host Ellen DeGeneres during the broadcast is the fifth-most retweeted tweet ever.[80][81][82] DeGeneres said she wanted to homage Meryl Streep's record 17 Oscar nominations by setting a new record with her, and invited other Oscar celebrities to join them. The resulting photo of twelve celebrities broke the previous retweet record within forty minutes and was retweeted over 1.8 million times in the first hour.[83][84][85] By the end of the ceremony it had been retweeted over 2 million times, less than 24 hours later, it had been retweeted over 2.8 million times.[81][83] As of May 2017 , it has been retweeted over 3.4 million times.[81] The group selfie effort was parodied by Lego and Matt Groening with The Simpsons.[86][87] It beat the previous record, which was held by Barack Obama, following his victory in the 2012 presidential election.[85][88][89]\n\nOn December 3, 2011, DeGeneres headlined the third annual \"Change Begins Within\" gala for the David Lynch Foundation held at the Los Angeles County Museum of Art.[90][91]\n\nOther ventures\n\nED Ellen DeGeneres\n\nDeGeneres represents a line of products on QVC, a home shopping network. Her line of home products, initialized as E.D., for Ellen DeGeneres, began being offered on QVC on October 24, 2014, under the name E.D. on Air.[92]\n\nDeGeneres launched her lifestyle brand under the name ED by Ellen in the summer of 2015.[93] After her initial collections, the brand name then changed to ED Ellen DeGeneres to incorporate the licensed arm of her brand.[94] The collection includes apparel, shoe, accessory, pet, baby and home items. DeGeneres's dog collection at PetSmart was launched in February 2017,[95] and a cat line was introduced later that year.[96]\n\nIn November 2017, the brand launched a collection to benefit DeGeneres's #BeKindToElephants campaign featuring a tee and baby one piece, donating 100% of the proceeds to the David Sheldrick Wildlife Trust.[97] Then, DeGeneres created a line with her brand to benefit the newly created Ellen DeGeneres Wildlife Fund,[98] a member of the Digit Fund, to launch a line of tees and footwear to help gorillas.[99]\n\nOn August 15, 2018, it was announced that DeGeneres would partner with Walmart to launch a fashion collection under the brand name EV1, a low-cost alternative to her ED Ellen DeGeneres product.[100] The collection officially launched on September 10, 2018.[101]\n\nCommercial spokesperson\n\nIn November 2004, DeGeneres appeared, dancing, in an ad campaign for American Express. Her most recent American Express commercial, a two-minute black-and-white spot in which she works with animals, debuted in November 2006 and was created by Ogilvy & Mather. In 2007, the commercial won the Emmy Award for Outstanding Commercial.\n\nDeGeneres began working with CoverGirl Cosmetics in September 2008, for which she has been criticized, as her animal-friendly values clash with Procter and Gamble's (the maker of CoverGirl Cosmetics) animal testing.[102] Her face became the focus of CoverGirl advertisements starting in January 2009. The beauty campaign was DeGeneres's first.[103]\n\nIn spring 2012, DeGeneres became the spokesperson for J. C. Penney in a tour and advertising campaign.[19]\n\neleveneleven\n\nOn May 26, 2010, DeGeneres announced on her show that she was starting her own record label entitled \"eleveneleven\". She explained her choice of name, claiming that she often sees the number 11:11 when looking at her clocks, that she found singer Greyson Chance on the 11th, and that the singer's soccer jersey has the number 11.[104] She mentioned that she had been looking for videos of performances on YouTube to start her label. The first act she signed to the label was Chance.[105]\n\nPersonal life\n\nWealth and popularity\n\nForbes estimated DeGeneres's 2020 earnings at US$84 million and her net worth at $370 million,[106] making her the 12th-highest-paid entertainer in the world.[107] In 2015, she was named the 50th-most-powerful woman in the world by Forbes[108] and came second on the World Pride Power list.[109] As of November 2023 , she had 75 million followers on Twitter and 139 million followers on Instagram, making her the 14th most-followed user on Twitter and the 32nd most-followed user on Instagram.\n\nIn May 2025, DeGeneres was listed in the Sunday Times Rich List with a net worth of £363 million.[110]\n\nDeGeneres is a fan of the National Football League, but does not follow one team; she has shown support for the New Orleans Saints and the Green Bay Packers,[111][112] and she attended a 2011 Saints practice session dressed as Packers Hall of Famer Don Hutson.[113]\n\nSexual orientation and relationships\n\nPortia (left) and Ellen (right) in September 2012\n\nIn 1997, DeGeneres came out as a lesbian. The disclosure of her sexual orientation sparked intense interest by American tabloids.[114] The contentiousness of the media coverage stunted her professional career and left her \"mired in depression\".[114][115] In her book Love, Ellen, DeGeneres's mother Betty describes being initially shocked when DeGeneres came out, but she has since become one of her strongest supporters; Betty is also an active member of PFLAG and spokesperson for the Human Rights Campaign's Coming Out Project. The same year she came out, DeGeneres started a romantic relationship with actress Anne Heche that lasted until August 2000.[116] From 2000 to 2004, DeGeneres maintained a close relationship with photographer Alexandra Hedison.[117] The couple appeared on the cover of The Advocate after their separation had already been announced to the media.[118]\n\nSince 2004, DeGeneres has been in a relationship with actress Portia de Rossi.[119] After the overturn of the same-sex marriage ban in California, DeGeneres and de Rossi were married in August 2008, at their home in Beverly Hills, California, where they lived with their four dogs and three cats.[120][121] The passage of Proposition 8 in California cast doubt on the legal status of their marriage, but a California Supreme Court judgment validated their marriage because it occurred before November 4, 2008.[122][123][124] A legal petition by de Rossi to change her name to Portia Lee James DeGeneres was granted on September 23, 2010.[125][126]\n\nAnimal rights and veganism\n\nDeGeneres previously described herself as a vegan and \"big animal lover\".[127][128] De Rossi is also a vegan.[128] DeGeneres coordinated a vegan outreach website titled \"Going Vegan with Ellen\".[129] She intended to open a vegan tapas bar, Bokado, in Los Angeles, but plans fell through.[130] In 2012, the website for The Ellen DeGeneres Show contained a section called \"Going Vegan with Ellen\", in which she promoted \"Meatless Mondays\" and featured vegan recipes.[131] In 2016, DeGeneres stated that she had re-introduced fish into her diet,[132] and confirmed that she had stopped following a vegan lifestyle \"in the last year or two for no reason really\" in her 2018 stand-up comedy special Relatable.[133]\n\nDeGeneres has invited Humane Society of the United States CEO Wayne Pacelle to speak on her show several times about the organization's efforts in animal protection legislation. In 2009, People for the Ethical Treatment of Animals named her their \"Woman of the Year\".[134] In April 2013, she donated $25,000 to stop anti-whistleblower agricultural gag legislation in Tennessee, which would prohibit undercover investigators from recording footage of animal abuse on farms.[135] In 2010, DeGeneres served as campaign ambassador to Farm Sanctuary's Adopt-A-Turkey Project, asking people to start \"a new tradition by adopting a turkey instead of eating one\" at Thanksgiving.[136]\n\nHumanitarianism\n\nIn November 2011, Secretary of State Hillary Clinton named DeGeneres a special envoy for Global AIDS Awareness.[137]\n\nOn December 3, 2011, DeGeneres opened the show at the David Lynch Foundation's third annual \"Change Begins Within\" gala at the Los Angeles County Museum of Art to raise funds to bring Transcendental Meditation (TM) to at-risk populations suffering from epidemic levels of chronic stress and stress-related disorders. She says: \"TM is the only time I have that stillness... it gives me this peaceful feeling, and I love it so much. I can't say enough good things about it. All the benefits that you can achieve from sitting still and going within—it really is a beautiful experience. David Lynch is such a wonderful man to start this foundation to help people.\"[138][139]\n\nIn November 2017, it was announced that President Donald Trump would begin allowing the importation of elephant trophies from Africa. In response, DeGeneres created a hashtag campaign in partnership with her brand, ED Ellen DeGeneres, to donate to the David Sheldrick Wildlife Trust. She also created a T-shirt with her brand whose proceeds also go to the organization.[140]\n\nIn January 2018, for DeGeneres's 60th birthday, de Rossi gifted her a permanent gorilla home in Rwanda built in her name for the Digit Fund.[141] This gift was part of a new arm of the Digit Fund called the \"Ellen DeGeneres Wildlife Fund\".[142]\n\nResidency\n\nPrior to 2024, DeGeneres and Portia de Rossi split their time in Southern California, primarily Montecito, and Beverly Hills, where they owned and flipped homes for several years.[143] In August 2024, she and Portia De Rossi sold a property in Carpinteria, California, for $96 million.[144]\n\nIn November 2024, the couple relocated from their home in Montecito, California, to the Cotswolds region of England. The move was reportedly brought on by the re-election of Donald Trump as president, and \"they [did] not have plans to return to the United States\". The couple purchased the home in the Cotswolds before the outcome of the presidential election.[145][146]\n\nDeGeneres in a July 2025 Cheltenham, Gloucestershire appearance ruled out the possibility of resurrecting her former talk show for a British audience but stated that she had been considering future work options: \"'I just don't know what that is yet,' she said. 'I want to have fun, I want to do something. I do like my chickens but I'm a little bit bored.'\"[147]\n\nIn August 2025, DeGeneres and de Rossi announced that they are selling their country home.[148]\n\nFilmography\n\nFilm\n\nTelevision\n\nAs executive producer\n\nVideo games\n\nYear Title Role Notes 1996 9: The Last Resort The Octopus Lady Voice 2003 Finding Nemo Dory 2013 Heads Up! Herself 2016 Disney Infinity 3.0 Dory\n\nMusic videos\n\nDiscography\n\nAlbums\n\nYear Title Formats 1996 Taste This Enhanced CD/Download\n\nAudiobooks\n\nYear Title Formats 2003 The Funny Thing Is... CD/Download 2011 Seriously...I'm Kidding CD/Download\n\nPodcasts\n\nYear Title Formats 2017 Making Gay History Podcast episode; audio recording from 2001\n\nWritten works", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/98/Yep-im-gay-ellen-degeneres-time-magazine-cover.jpg/250px-Yep-im-gay-ellen-degeneres-time-magazine-cover.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Wikinews-logo.svg/40px-Wikinews-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Ellen_DeGeneres_%282004%29.jpg/250px-Ellen_DeGeneres_%282004%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Ellen_DeGeneres_2011.jpg/960px-Ellen_DeGeneres_2011.jpg", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Ellen_DeGeneres_2011.jpg/250px-Ellen_DeGeneres_2011.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Ellen_DeGeneres_Signature.svg/250px-Ellen_DeGeneres_Signature.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/40px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/20px-Lock-green.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/PortiadeRossiEllenDeGeneresHWOFSept2012.jpg/250px-PortiadeRossiEllenDeGeneresHWOFSept2012.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Ellen_DeGeneres-2009.jpg/250px-Ellen_DeGeneres-2009.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Ellen_DeGeneres_2011.jpg/960px-Ellen_DeGeneres_2011.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Ellen_DeGeneres", "title": "Ellen DeGeneres", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Ellen_DeGeneres_2011.jpg/960px-Ellen_DeGeneres_2011.jpg", "width": 804, "height": 1200}, "title": "Ellen DeGeneres - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}