{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/kristen-bell-net-worth/", "text": "What is Kristen Bell's Net Worth and Salary?\n\nKristen Bell is an American actress, dancer, singer, and film producer who has a net worth of $60 million. That is the combined net worth of Bell and her husband since 2013, actor/podcaster Dax Shepard. Kristen Bell is one of the most recognizable faces in Hollywood, and she has amassed an impressive list of credits over the course of her career. She and Dax appear in many commercials together, and they co-founded a baby product company called Hello Bello, which unfortunately filed for bankruptcy in October 2023.\n\nEarly Life\n\nKristen Anne Bell was born on July 18th, 1980, in a Detroit suburb. Her family was somewhat involved in the entertainment industry, as her father worked as a television news director in Las Vegas. Her mother was a nurse. When Bell was just two years old, her parents split up. Because both of her parents remarried, she has a number of half-siblings.\n\nBell attended a private school instead of a public high school, and she graduated from Shrine Catholic School in 1998. Kristen Bell fell in love with drama and acting during her time at this private school, and she took part in a number of its theater productions – often taking the lead role. Her passion for theater led her to New York upon graduation, where she attended the Tisch School of Arts at New York University and majored in musical theater.\n\nCareer\n\nKristen Bell never had a chance to graduate from New York University because she was offered the opportunity of a lifetime during her senior year. She was cast in the Broadway production of The Adventures of Tom Sawyer, and her acting career began with a bang. She had been auditioning since the age of 13, but her Broadway role seems to have kickstarted her career. Soon thereafter, she won a role in the movie Pootie Tang. After appearing in one more Broadway production, she moved to Los Angeles and won a number of guest roles in various television shows. Although Kristen Bell was booked, she had trouble finding a recurring role early in her career.\n\nKristen Bell won widespread fame after appearing in the film Spartan alongside Val Kilmer, playing the president's kidnapped daughter. That year would prove to be a major turning point in Bell's career, as she finally booked the recurring role she'd been looking for when Veronica Mars launched in 2004. Critics were quick to praise Bell's performance, and she soon booked more film roles as a result of her increased fame.\n\nAlthough Veronica Mars was eventually canceled, Kristen Bell was able to make the transition to other roles fairly easily – both on television and in film. Her first major role on Veronica Mars was on Heroes, a series that she had expressed admiration for in the past. She also won a role as the narrator for Gossip Girl, eventually appearing in person during the final episode. During this period, she also starred in the films Forgetting Sarah Marshall and Fanboys.\n\nShe also became involved in the video game industry, voice acting, and performing motion-capture for various games in the Assassin's Creed series. She earned voice acting credits once again when she worked on Astro Boy. Additional roles during this time include those in Scream 4 and Burlesque. In 2013, she landed what was perhaps her biggest-ever voice acting role in the hit film Frozen.\n\nVoice acting roles continued to come Bell's way, and she also played the Sloth in the animated film Zootopia. Further voice acting roles include those in Ralph Breaks the Internet and Frozen II. Although voice acting seems to have become a focus for Bell in the later stages of her career, she continues to take on traditional acting roles as well. The fourth season of Veronica Mars was given the green light in 2018, with Kristen Bell once again playing the lead. She also appeared in the comedy CHiPs.\n\nPersonal Life\n\nAlthough she had been in a relationship with Kevin Mann since 2002, Kristen Bell ended this relationship. The couple had been engaged for a number of years prior to their breakup. That same year, Kristen Bell began a romantic relationship with Dax Shepard, a fellow actor who was also from the Detroit area. The couple went on to star alongside each other in a number of films, including CHiPs When In Rome and Hit and Run. Although they became engaged in 2010, it wasn't until 2013 that they were finally wed. The couple has two daughters together.\n\nKristen Bell is a dedicated vegan and had previously been a vegetarian since the age of 11. She and her husband both switched to being vegan after watching a documentary, and Bell is very active in the animal rights community. She has a number of pets and supports a number of animal welfare organizations.\n\nHello Bello\n\nIn addition to acting, Kristen Bell has also become involved in a number of entrepreneurial ventures. In line with her vegan lifestyle, in 2019, she and Dax founded a plant-based line of baby care products called Hello Bello. They soon landed a deal to exclusively distribute their products at Walmart. Unfortunately, in October 2023, Hello Bello filed for bankruptcy, listing $100 million in liabilities, of which $22 million was owed to a single creditor, a paper supplier.\n\nReal Estate\n\nKristen Bell and Dax Shepard are also real estate investors. They own at least two residential apartment buildings in Los Angeles. The couple made headlines during the 2020 Coronavirus crisis after publicly refusing to accept rent checks during the month of April, giving their tenants a period of financial relief during economically demanding times. Dax's sister manages the buildings.\n\nAs for their own private real estate investments, in August 2017, Kristen and Dax paid $4.3 million for a 4,400-square-foot home in Los Angeles' Los Feliz neighborhood. Today, this home is worth $6-8 million.", "images": ["https://vz.cnwimg.com/thm/1JoH3482haSLevnlEMdqhrz36y0=/132x132/center/top/filters:format(webp)/2009/11/George-Clooney.jpg", "https://vz.cnwimg.com/thm/I4dSiTJhq0kprSuO--deoPCEAmQ=/132x132/center/top/filters:format(webp)/2020/06/taylor.png", "https://vz.cnwimg.com/thm/uRsxoLs7Ymmit5ATgRtN2utad40=/221x5:381x236/132x132/filters:format(webp):strip_exif()/2009/09/P-Diddy.jpg", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "https://vz.cnwimg.com/thm/5MUHqz6jumKHktGC97gjrOmcsKI=/600x300/center/top/filters:format(webp)/2010/01/Kristen-Bell-1.jpg", "https://vz.cnwimg.com/thm/2QZ-dDrLcK4Cg3HUJ9W8DQkExRw=/132x132/center/top/filters:format(webp)/2010/01/Dax-Shepard-1.jpg", "https://vz.cnwimg.com/thm/_hOmdPz8Ht24ZxIeZM7m4mGRouk=/132x132/center/top/filters:format(webp)/2019/11/GettyImages-1094653148.jpg", "https://vz.cnwimg.com/thm/Y14fttV9jls9mxFLuNAHJTnNWTE=/132x132/center/top/filters:format(webp)/2019/10/denzel-washington-1.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/thm/YDvd_JQ8plr5vlTklSBpovHUu38=/132x132/center/top/filters:format(webp)/2021/07/lauren-graham.jpg", "https://vz.cnwimg.com/thm/IoWqGPmFDjvC6iTqcDsspXBuxqo=/132x132/center/top/filters:format(webp)/2018/03/GettyImages-821622848.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/thm/3O8cWnGjcyqT4FZfv-pWnw3ipWY=/132x132/center/top/filters:format(webp)/2025/06/monica.png", "https://vz.cnwimg.com/thm/JROrXFdwNtvHObai-c9cvrEIP70=/132x132/center/top/filters:format(webp)/2021/10/Billy-Baldwin.jpg", "https://vz.cnwimg.com/thm/dXuAPIEBU--L_kRib4u0nSzjUtE=/132x132/center/top/filters:format(webp)/2020/04/Megan-Fox.jpg", "https://vz.cnwimg.com/wp-content/uploads/2010/01/Kristen-Bell-1.jpg?x46379", "https://vz.cnwimg.com/thm/gwiE22jfCLWe3I2EhclyuFId504=/132x132/center/top/filters:format(webp)/2010/11/GettyImages-487452029.jpg", "https://vz.cnwimg.com/thm/lY3-oCS-xIdiqDaOi1qHd6UaTjg=/132x132/center/top/filters:format(webp)/2009/09/Cristiano-Ronaldo.jpg", "https://vz.cnwimg.com/thm/UxnQSql1h0QyX1CgkPqKhTxCTHM=/132x132/center/top/filters:format(webp)/2009/09/Jennifer-Aniston.jpg", "https://vz.cnwimg.com/thm/95i5RI1LWkjHyyoolMeto-z_WeU=/132x132/center/top/filters:format(webp)/2020/01/lopez3.jpg", "https://vz.cnwimg.com/thm/KFAqJ9F4o80l6an2fe78-0jw28s=/132x132/center/top/filters:format(webp)/2019/04/rr.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2010/01/Kristen-Bell-1.jpg?x46379", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/kristen-bell-net-worth/", "title": "Kristen Bell Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Kristen Bell is an American actress, dancer, singer, and film producer who has a net worth of $60 million. That is the combined net worth of Bell and her husband since 2013, actor/podcaster Dax Shepard. Kristen Bell is one of the most recognizable faces", "slick": {"wpversion": "3.0.1", "wppostid": 2866, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2010/01/Kristen-Bell-1.jpg?x46379", "group": "post", "category": "actors:Actors"}, ";": "richest-celebrities:Richest Celebrities", "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "cnw": {"wppostid": 2866}, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Kristen Bell Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/kristen-bell-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/01/Kristen-Bell-1.jpg?x46379", "site_name": "Celebrity Net Worth", "description": "What is Kristen Bell's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2024-07-11T17:38:24+00:00", "published_time": "2020-01-20T03:23:12+00:00", "section": "Actors", "tag": "richest actresses"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/01/Kristen-Bell-1.jpg?x46379", "title": "Kristen Bell Net Worth", "description": "Kristen Bell is an American actress, dancer, singer, and film producer who has a net worth of $60 million. That is the combined net worth of Bell and her husband since 2013, actor/podcaster Dax Shepar"}}, "movies": [], "publish_date": 1579490592.0, "source": "https://www.celebritynetworth.com", "summary": ""}