{"url": "https://www.biography.com/people/jerry-seinfeld-9542107", "text": "We may earn commission from links on this page, but we only recommend products we back.\n\n1954-present\n\nLatest News: Jerry Seinfeld Directs and Stars in Unfrosted\n\nComedian and actor Jerry Seinfeld isn’t holding back his opinions on the state of television comedy while promoting his upcoming Netflix film Unfrosted.\n\nSeinfeld, 70, said that viewers need comedy and “don’t get it” because of political correctness. “It used to be, you would go home at the end of the day, most people would go, ‘Oh, Cheers is on. Oh, M*A*S*H is on. Oh, [The Mary Tyler Moore Show] is on. All in the Family is on.’ You just expected, ‘There’ll be some funny stuff we can watch on TV tonight,’” Seinfeld told the magazine. “Well, guess what—where is it? This is the result of the extreme left and P.C. crap and people worrying so much about offending other people.”\n\nOnly days earlier, the movie business “is over” and “doesn’t occupy the pinnacle in the social, cultural hierarchy” anymore.\n\nDespite these less-than-flattering assessments of current entertainment, Seinfeld hopes there is plenty of enthusiasm for Unfrosted, his feature film directorial debut coming to Netflix on May 3. The movie includes himself, Melissa McCarthy, Amy Schumer, and Hugh Grant among its ensemble cast and tells a (highly) fictional origin tale of Pop-Tarts, the famous breakfast pastry. “We’re going to tell you a story, but if we want to do something funny that doesn’t make any sense, we’re going to do that too,” Seinfeld has said of the movie.\n\nWho Is Jerry Seinfeld?\n\nJerry Seinfeld is an Emmy-winning actor and comedian who made his stand-up debut at an open mic night in 1976 and appeared on The Tonight Show in 1981. After starring in his own television special in 1987, he developed the sitcom Seinfeld for NBC with fellow comedian Larry David. Seinfeld became the first actor to earn $1 million per episode for his starring role in the series, which ran for nine seasons. It was the highest-rated show in the United States when the final episode aired in 1998. Seinfeld later created the Comedians in Cars Getting Coffee interview series, which aired from 2012 to 2019.\n\nQuick Facts\n\nFULL NAME: Jerome Seinfeld\n\nBORN: April 29, 1954\n\nBIRTHPLACE: Brooklyn, New York\n\nSPOUSE: Jessica Seinfeld (1999-present)\n\nCHILDREN: Sascha, Julian, and Shepherd\n\nASTROLOGICAL SIGN: Taurus\n\nEarly Life and Career Start\n\nJerome Seinfeld was born on April 29, 1954, in Brooklyn, New York. Seinfeld’s interest in comedy was sparked at an early age through the influence of his father, a sign maker who was also a closet comedian. By age 8, Seinfeld was putting himself through rigorous comic training, watching television day and night to study the techniques of comedians. Over the years, he developed a unique style of comedy that centered on his wry observations of life’s mundanities.\n\nGetty Images Jerry Seinfeld performs on The Tonight Show Starring Johnny Carson in 1981.\n\nSeinfeld studied communications and theater at Queens College, City University of New York, and shortly after graduation in 1976, he made his stand-up debut at an open mic night in the Catch a Rising Star nightclub. He worked his way up to an appearance on The Tonight Show Starring Johnny Carson in 1981, which gave Seinfeld his first national exposure. By the late 1980s, he was one of the highest-profile stand-up comedians in the United States.\n\n\n\n\n\nSeinfeld\n\nAfter starring in the television special Jerry Seinfeld’s Stand-up Confidential (1987), Seinfeld was asked to develop a sitcom with NBC. He teamed up with friend and fellow comedian Larry David to create Seinfeld, which hit the air in 1989.\n\nProduced and sometimes co-written by Seinfeld, the quirky, widely watched show emphasized loosely structured stories, seemingly insignificant subject matter, and a buddy system of comedy in which the Jerry character often played a straight man to his three tightly wound screwball friends, Elaine Benes (Julia Louis-Dreyfus), George Costanza (Jason Alexander) and Cosmo Kramer (Michael Richards).\n\nGetty Images Michael Richards, Jerry Seinfeld, Julia Louis-Dreyfus, and Jason Alexander attend the 1993 Emmy Awards, where the show and cast members took home three prizes.\n\nThe sitcom reached unprecedented popularity and critical acclaim, and many of its catchphrases and plot elements became part of the cultural lexicon. The show and Seinfeld were nominated for multiple Emmy Awards, and in 1993, it claimed the Outstanding Comedy Series prize. The following year, the comedian took home two Golden Globe Awards for Best Musical/Comedy Series and Best Television Actor in a Musical/Comedy Series.\n\nSeinfeld ran for nine seasons and was the highest-rated show in the United States when its final episode aired in 1998.\n\nMovies, TV Shows, and Books\n\nSeinfeld returned to stand-up comedy in the late 1990s, embarking on multiple national tours of comedy clubs and theaters, one of which was documented in the 2002 film Comedian. Additionally, he co-wrote, co-produced, and starred in the animated (2007).\n\nSeinfeld has written several books, including (1993), a best-selling book of humorous observations; the children’s book (2003); and (2020), another bestseller featuring material from his decades-long career.\n\nReturn to TV: The Marriage Ref and Comedians in Cars Getting Coffee\n\nIn 2010, Seinfeld made a return to television with The Marriage Ref. This reality show featured a panel of comedians who were asked to weigh in on different couples' real-life conflicts and disputes. It was canceled after one season.\n\nSeinfeld fared much better with his Emmy-nominated interview show, Comedians in Cars Getting Coffee, which ran for 11 seasons from 2012 to 2019. Over the years, he has talked with comedy stars such as Chris Rock, Tina Fey, Eddie Murphy, and Amy Schumer. In a 2015 episode, Seinfeld veered from his usual funny guests with an episode featuring President Barack Obama. Netflix acquired the show in 2017 and aired the final two seasons before Seinfeld hung up his keys for good.\n\nThe series’ success wasn’t without some controversy. In early 2018, TMZ reported that a producer named Christian Charles had filed a lawsuit alleging that Seinfeld stole the idea for Comedians in Cars from him. According to the lawsuit, Charles pitched the concept to Seinfeld in 2002 and even directed a pilot episode, but it was cut out after demanding ownership interest. Seinfeld’s attorney filed a motion to dismiss the suit in June 2018, his court brief asserting that the idea of the show was too broad to justify the lawsuit and that Charles only sued after learning how much Seinfeld was getting paid per episode.\n\nIn September 2019, a Manhattan district judge ruled in favor of Seinfeld because the statute of limitations for Charles’ legal claim to ownership of the Comedians in Cars concept had expired.\n\nSeinfeld also made guest appearances on the comedy-drama Louie, starring Louis C.K., and Curb Your Enthusiasm, created by his friend and Seinfeld collaborator Larry David.\n\nNetflix Specials: Jerry Before Seinfeld and 23 Hours to Kill\n\nAs part of Netflix’s deal to acquire Comedians in Cars Getting Coffee, which was reportedly worth $100 million, Seinfeld also agreed to two new comedy specials.\n\nSeptember 2017 brought the Netflix special Jerry Before Seinfeld, which showed the comedy icon revisiting some of his early jokes at Manhattan’s Comic Strip club, where he honed his routine in the 1970s, along with off-stage reflections and little-seen footage of his childhood.\n\nOn May 5, 2020, Netflix aired Seinfeld’s first stand-up special of original material in 22 years with 23 Hours to Kill. Along with featuring his riffs on marriage and the irritating habits of friends, the special showed the senior citizen–aged comedian jumping from a helicopter into the Hudson River. It earned him another Emmy nod for Outstanding Pre-Recorded Variety Special.\n\nSeinfeld and the streaming giant also teamed up for the 2024 film Unfrosted, which tells a fictional origin story of the popular breakfast snack Pop-Tarts. The comedian directed the movie—debuting May 3, 2024—and stars as Bob Cabana, a fictional employee of Kellogg’s loosely based on businessman William Post.\n\nNet Worth\n\nAs of April 2024, Seinfeld has an estimated net worth of $900 million. Until 2016, he repeatedly topped Forbes’ list of the highest-paid comedians.\n\nBy the end of Seinfeld, the comedian was the first actor to earn , and in the years since, he has raked in millions in residual income from syndication and streaming rights as the show’s co-creator. Since 1995, Seinfeld has earned $400 million from syndication deals, CNBC reported in 2015. That year, Hulu inked a six-year contract worth at least $130 million to stream the series exclusively. Netflix then took over exclusively streaming rights in 2021 after reportedly paying more than $500 million for five years.\n\nWife and Kids\n\nGetty Images Jessica and Jerry Seinfeld in November 2022\n\nSeinfeld married public relations executive Jessica Seinfeld (nee Sklar) on December 25, 1999. The couple had met at a gym the previous year, as her first marriage was crumbling. Today, Jessica is a cookbook author and founder of the anti-poverty nonprofit Good+ Foundation (formerly Baby Buggy).\n\nThe Seinfelds have three children: daughter Sascha and sons Julian and Shepherd.\n\nCar Collection\n\nGetty Images Jerry Seinfeld drives a 1963 Chevrolet Corvette while filming an episode of Comedians in Cars Getting Coffee.\n\nSeinfeld, a well-known gearhead, said his first car was a 1973 Fiat 128 Sport L. He is particularly fond of Porsches and has amassed quite a classic car collection over the years. He keeps specifics close to his chest, so it’s unclear how many he owns or all the models. However, he has enough that he purchased a New York City brownstone in 1999 and converted it into a three-floor garage. Some of his cars were featured on episodes of Comedians in Cars Getting Coffee.\n\nIn 2016, he sold 15 Porsches from his collection at auction for $22 million. His 1955 Porsche 550 Spyder (the same model James Dean drove when he was killed) netted the sale’s highest price tag at $5,335,000. A few years later, the buyer of Seinfeld’s 1958 Porsche 356 A 1500 GS/GT Carrera Speedster sued the comedian, claiming the car wasn’t authentic. Seinfeld subsequently sued the classic car dealer he purchased the Porsche from, and both lawsuits were settled in June 2022.\n\nOne of Seinfeld’s most recent acquisitions is a highly customized 1999 Porsche 911 Classic Club Coupe, which he bought for $1.2 million in June 2023.\n\nQuotes\n\nI was the best man at the wedding. If I’m the best man, why is she marrying him?\n\nI’ve never bought a car as an investment. I don’t really even think of myself as a collector. I just love cars.\n\nFact Check: We strive for accuracy and fairness. If you see something that doesn’t look right, contact us!\n\n..", "images": ["https://www.biography.com/_assets/design-tokens/biography/static/images/logos/logo.5ec9b18.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/jerry-seinfeld-on-wednesday-april-24-2024-news-photo-1714486290.jpg?crop=0.877xw:0.659xh;0.114xw,0.0553xh&resize=1200:*", "https://www.biography.com/_assets/design-tokens/biography/static/images/logos/network-logo.04aa008.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/jerry-seinfeld-sits-in-a-1963-chevrolet-corvette-as-he-news-photo-1688586678.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/pictured-malcolm-jamal-warner-as-theo-huxtable-news-photo-1753196351.pjpeg?crop=0.827xw:1.00xh;0.105xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/Kevin-Hart_GettyImages-450909048.jpg?crop=1xw:0.5xh;center,top&resize=300:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://hips.hearstapps.com/hmg-prod/images/stephen-colbert-attends-the-2023-spirit-of-ireland-gala-at-news-photo-1701187639.jpg?crop=0.969xw:0.669xh;0.0277xw,0.0630xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/pictured-eddie-murphy-on-february-15-2015-news-photo-1762808496.pjpeg?crop=0.631xw:0.942xh;0.111xw,0.0577xh&resize=360:*", "https://hips.hearstapps.com/rover/profile_photos/e16c2fd9-2845-4786-ad44-4c0f66c1b12a_1686835835.file?fill=1:1&resize=120:*", "https://hips.hearstapps.com/hmg-prod/images/jimmy-kimmel-live-airs-every-weeknight-at-11-35-p-m-et-and-news-photo-1758574739.pjpeg?crop=0.715xw:0.892xh;0.151xw,0.0200xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/episode-1753-pictured-comedian-jerry-seinfeld-arrives-on-news-photo-1688568161.jpg?crop=0.689xw:0.459xh;0.216xw,0.0967xh&resize=640:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://www.biography.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://hips.hearstapps.com/hmg-prod/images/nate-bargatze-attends-the-los-angeles-premiere-of-netflixs-news-photo-1753714173.pjpeg?crop=0.704xw:0.469xh;0.137xw,0.0966xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1205150941-crop-676628b3974bc.jpg?crop=1.00xw:1.00xh;0,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/martin-short-and-steve-martin-attend-the-season-4-premiere-news-photo-1757363780.pjpeg?crop=0.668xw:1.00xh;0.167xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/jimmy-kimmel-live-airs-every-weeknight-at-11-35-p-m-et-and-news-photo-1758228400.pjpeg?crop=0.771xw:0.616xh;0.117xw,0.0221xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/season-6-november-15-1980-april-11-1981-pictured-eddie-news-photo-1762800394.pjpeg?crop=0.652xw:1.00xh;0.175xw,0&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://www.biography.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1991170024copy-660c0cd9ac55d.jpg?crop=0.272xw:0.200xh;0.588xw,0.230xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/dave-chapelle-attends-the-uk-premiere-of-dave-chappelle-news-photo-1707096741.jpg?crop=1.00xw:0.402xh;0,0.228xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/actor-john-candy-poses-for-a-photo-session-on-april-12-1993-news-photo-1760022606.pjpeg?crop=1.00xw:0.804xh;0,0.0536xh&resize=360:*", "https://hips.hearstapps.com/vidthumb/images/inkt-ep04-thumbnail-682dd7da2d33d.jpg?crop=1xw:1xh;center,top", "https://hips.hearstapps.com/hmg-prod/images/pictured-comedian-jerry-seinfeld-performs-on-november-12-news-photo-1688569633.jpg?crop=0.763xw:0.636xh;0.117xw,0.0783xh&resize=640:*", "https://hips.hearstapps.com/hmg-prod/images/michael-richards-jerry-seinfeld-julia-louis-dreyfus-and-news-photo-1688575110.jpg?crop=1.00xw:0.990xh;0,0.0102xh&resize=980:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/rover/profile_photos/8ebb24a5-6121-4849-a984-bf608cacdd3c_1729282614.file?fill=1:1&resize=120:*", "https://hips.hearstapps.com/hmg-prod/images/eddie-murphy-attends-the-80th-annual-golden-globe-awards-at-news-photo-1762788000.pjpeg?crop=1.00xw:0.669xh;0,0.0791xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://hips.hearstapps.com/hmg-prod/images/creator-executive-producer-director-writer-seth-rogen-news-photo-1757013196.pjpeg?crop=0.663xw:0.442xh;0.177xw,0.0704xh&resize=360:*", "https://hips.hearstapps.com/rover/profile_photos/b50d4909-0f39-4b73-b482-46d0a9078d40_1682363012.file?fill=1:1&resize=120:*", "https://hips.hearstapps.com/hmg-prod/images/jessica-seinfeld-and-jerry-seinfeld-are-seen-in-midtown-on-news-photo-1688586544.jpg?crop=1.00xw:0.668xh;0,0.0392xh&resize=980:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/jerry-seinfeld-on-wednesday-april-24-2024-news-photo-1714486290.jpg?crop=0.877xw:0.659xh;0.114xw,0.0553xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.biography.com/actors/jerry-seinfeld", "title": "Jerry Seinfeld: Biography, Comedian, Actor, Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Jerry Seinfeld: Biography, Comedian, Actor, Net Worth", "description": "Comedian and actor Jerry Seinfeld is best known for his starring role in the hit sitcom “Seinfeld.” Read about his TV shows, movies, wife, net worth, and more.", "keywords": "Profile", "theme-color": "#000000", "og": {"site_name": "Biography", "title": "Jerry Seinfeld Says the 'Extreme Left' and Political Correctness Have Ruined TV Comedy", "description": "The comedian and actor is offering up his own alternative with the release of his Netflix film ‘Unfrosted’ on May 3.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/jerry-seinfeld-on-wednesday-april-24-2024-news-photo-1714486290.jpg?crop=0.877xw:0.659xh;0.114xw,0.0553xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.biography.com/actors/jerry-seinfeld", "type": "article"}, "article": {"publisher": "https://www.facebook.com/Biography", "opinion": "false", "section": "Famous Actors", "modified_time": "2024-04-30T19:54:00Z", "published_time": "2024-04-30T19:54:00Z"}, "parsely-metadata": "{\"socialHeadline\":\"Jerry Seinfeld Says the 'Extreme Left' and Political Correctness Have Ruined TV Comedy\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/jerry-seinfeld-on-wednesday-april-24-2024-news-photo-1714486290.jpg?crop=0.668xw:1.00xh;0.199xw,0&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/jerry-seinfeld-on-wednesday-april-24-2024-news-photo-1714486290.jpg?crop=0.877xw:0.659xh;0.114xw,0.0553xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/jerry-seinfeld-on-wednesday-april-24-2024-news-photo-1714486290.jpg?crop=0.668xw:1.00xh;0.199xw,0", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/jerry-seinfeld-on-wednesday-april-24-2024-news-photo-1714486290.jpg?crop=0.877xw:0.659xh;0.114xw,0.0553xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "evergreen", "sailthru.excerpt": "1954-presentLatest News: Jerry Seinfeld Directs and Stars in UnfrostedComedian and actor Jerry Seinfeld isn’t holding back his opinions on the state of television comedy while promoting his upcoming Netflix film Unfrosted.Seinfeld, 70, said in a recent interview with The New Yorker that viewers need comedy and “don’t get it” because", "sailthru.tags": "actors,Famous Actors,comedians,Comedians,Biography-US", "sailthru.date": "2024-04-30 19:54:00", "sailthru.socialtitle": "Jerry Seinfeld Says the 'Extreme Left' and Political Correctness Have Ruined TV Comedy", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1714506840.0, "source": "https://www.biography.com", "summary": ""}