{"url": "https://www.biography.com/people/jada-pinkett-smith-9542154", "text": "1971-present\n\n\n\nLatest News: Jada Pinkett Smith’s New Memoir Worthy Is Now Out\n\nJada Pinkett Smith’s “no holds barred” memoir of her life released on October 17. In promoting Worthy earlier in the month, the 52-year-old actor shared the shocking news that she and her husband, Will Smith, have lived separately since 2016. Their marriage—and Will’s infamous slap of comedian Chris Rock at the 2022 Oscars—are two of the subjects she writes about in Worthy. She also reflects on her mental health struggles, friendship with Tupac Shakur, and life as a teenage drug dealer in Baltimore. “My hope with my book Worthy is that for any of you who may be stuck, hopeless or confused that my journey can offer you some oxygen, some strength to deepen your willingness to keep stepping towards your greatness,” Jada wrote in an Instagram post days before the release.\n\nWho Is Jada Pinkett Smith?\n\nActor Jada Pinkett Smith is best known for her roles in The Matrix sequels and the Madagascar animated film franchise. She first attracted attention after joining the Bill Cosby television series A Different World in 1991 and was launched to stardom with her role in the Eddie Murphy comedy The Nutty Professor. In addition to her movies and TV shows, Pinkett Smith previously co-hosted the talk show Red Table Talk and has spoken candidly about various aspects of her life, from her marriage with Will Smith to her struggles with alopecia. The actor was involved with an infamous moment during the 2022 Academy Awards ceremony, when her husband slapped comedian Chris Rock onstage after Rock made a joke about Pinkett Smith’s shaved head.\n\nQuick Facts\n\nFULL NAME: Jada Koren Pinkett Smith\n\nBORN: September 18, 1971\n\nBIRTHPLACE: Baltimore, Maryland\n\nSPOUSE: Will Smith (1997-present; separated)\n\nCHILDREN: Jaden, Willow, and Trey\n\nASTROLOGICAL SIGN: Virgo\n\n\n\nEarly Life\n\nJada Koren Pinkett was born on September 18, 1971, in Baltimore, Maryland. The daughter of contractor Robsol Pinkett Jr. and nurse Adrienne Banfield-Norris, she was named after Jada Rowland, her mother’s favorite soap opera star. Jada’s grandmother primarily raised her.\n\nGetty Images Jada Pinkett and rapper Tupac Shakur in 1996\n\nPinkett attended the Baltimore School of the Arts as a teenager, majoring in dance and theater. One of her classmates and friends there was the late rap artist Tupac Shakur. He wrote poems about her, and she later had a cameo in his music video for “Strictly 4 My Niggaz.” Pinkett graduated high school in 1989 then spent a year at the North Carolina School of the Arts.\n\nOf her relationship with Tupac, Pinkett Smith later told reporters that she was a drug dealer when she met Shakur and that she resented the way the movie (2017) later “reimagined” their relationship: “It wasn’t just about, oh, you have this cute girl, and this cool guy, they must have been in this—nah, it wasn’t that at all. It was about survival, and it had always been about survival between us.”\n\n\n\nTV Shows and Early Movies\n\nGetty Images Jada Pinkett as Lena James on the television series A Different World\n\nPinkett began her acting career with an appearance on sitcom True Colors in 1990. She appeared in guest roles on other television shows like Doogie Howser, M.D. and 21 Jump Street before earning her first recurring role on the NBC comedy A Different World, created by Bill Cosby as a spinoff of The Cosby Show. Portraying sassy college student Lena James, Pinkett joined the show during its fifth season in 1992 and remained on the series until its conclusion the following year. Series producer and director Debbie Allen wrote the part specifically for Pinkett, and Allen said the actor “walked in ready” after she was cast.\n\nHer first movie role was portraying a young single mother named Ronnie in Menace II Society (1993). She was cast based upon a suggestion by Tupac, who was originally slated to appear in the film but was fired from the project shortly after Pinkett was cast. She considered quitting the job as as result, but Tupac convinced her to keep the part, and she later said, “I probably wouldn’t have done it without his blessing.” She received critical acclaim for the performance, with film critic Roger Ebert describing her performance as “filled with life and conviction.”\n\nPinkett continued to earn positive reviews for her movie performances in 1994. She appeared in the action comedy A Low Down Dirty Shame alongside Keenen Ivory Wayan, a performance Stephen Holden of The New York Times called “as sassy and sizzling as a Salt-n-Pepa recording,” adding that “she walks away with the movie.” She also starred in a more dramatic leading role alongs ide Allen Payne in the erotic drama Jason’s Lyric. Marc Savlov of The Austin Chronicle wrote that Pinkett had a “powerful screen presence” and said her scenes with Payne “seem like something out of Romeo and Juliet.”\n\nPinkett had additional featured roles in films like 1995’s Demon Knight and Set it Off the next year. Also in 1995, she began directing music videos, including “Keep On, Keepin’ On” by MC Lyte. She conceived the idea for the music video for Tupac’s hit song “California Love,” which features the rapper fighting an evil tribal chief in a desert set in the year 2095. The idea was inspired by the 1985 film Mad Max Beyond Thunderdome, and Pinkett was originally slated to direct it, but she dropped out of the project, according to the book .\n\n\n\nRise to Big-Screen Stardom: Matrix and Madagascar Movies\n\nIn 1996, Pinkett portrayed Eddie Murphy’s love interest in The Nutty Professor; the comedy earned $274 million worldwide. She also appeared in Set It Off (1996), Scream 2 (1997), Return to Paradise (1998), Woo (1998),and Spike Lee’s highly controversial Bamboozled (2000), a satire of racial bias in the television industry. The following year, she joined her husband, Will Smith, in the biopic Ali, in which she played boxing great Muhammad Ali’s first wife, Sonji. She was initially hesitate to appear in the movie because she feared her real-life marriage to Smith would be a distraction to viewers, saying it might “take people out of the movie.” She, nevertheless, auditioned and took the role at the insistence of director Michael Mann.\n\nGetty Images The Matrix Revolutions co-stars Laurence Fishburne, Carrie-Anne Moss, Keanu Reeves, and Jada Pinkett Smith\n\nPinkett Smith established arguably her most well-known role when she portrayed the human rebel Niobe in The Matrix Reloaded and The Matrix Revolutions, directed by the Wachowskis and both released in 2003. Prior to her own role in the science-fiction action franchise, she urged her husband to take the lead role of Neo in the first film from 1999. Will turned it down, and the part ultimately went to Keanu Reeves. Pinkett Smith originally auditioned for the female lead of Trinity, which went to Carrie-Anne Moss, but the Wackowskis wrote the character of Niobe specifically for Pinkett Smith in the sequels. In addition to the movies, Pinkett Smith played a leading role in the popular 2003 video game from the franchise called Enter the Matrix.\n\nContinuing to appear in commercially and critically successful films, Pinkett Smith had a role in Collateral (2004), starring Tom Cruise and Jamie Foxx, and directed by Michael Mann. The next year, she voiced the character of Gloria the hippopotamus for Madagascar (2005), which went on to earn $532 million worldwide. Tom McGrath, one of the directors of the film, said Pinkett Smith had the “confidence and sweetness” they were seeking for the character. She went on to reprise the character in five Madagascar sequels.\n\nShe co-starred in the dramas Reign Over Me (2007), with Adam Sandler and Don Cheadle, and The Women (2008) with Meg Ryan, Annette Bening, Eva Mendes, and Debra Messing. The Women was panned by critics and Pinkett Smith and her three co-stars were collectively nominated for Worst Actress by the Golden Raspberry Awards, better known as the Razzies.\n\nAlso in 2008, Pinkett Smith made her debut as a director and writer in the independent feature The Human Contract, about a successful but unhappy businessman who falls in love with a free-spirited stranger. She co-starred in the film, which also featured Jason Clarke, Paz Vega, and Idris Elba.\n\nReturning to TV, she starred in and co-produced the TNT series Hawthorne, playing the chief nursing officer in a Richmond, Virginia hospital from 2009 to 2011. The role earned her an NAACP Image Award for Outstanding Actress in a Drama Series.\n\nGetty Images Jada Pinkett Smith appearing in the television series Gotham in 2015.\n\nPinkett Smith’s next starred in the first season of Fox’s Batman television series Gotham in 2014, portraying Gotham City crime boss Fish Mooney. A fan of comic books, she called it “one of my favorite characters I’ve ever played.”\n\nFollowing her lengthy absence from the big screen, Pinkett Smith returned for a supporting role in Magic Mike XXL (2015) and joined the ensemble cast of Bad Moms (2016). Continuing down the path of R-rated comedies, she featured prominently in the surprise hit Girls Trip (2017), with Queen Latifah, Tiffany Haddish, and Regina Hall.\n\nRed Table Talk\n\nIn May 2018, Pinkett Smith—along with her daughter, Willow Smith, and her mother, Adrienne Banfield-Norris—launched the talk show Red Table Talk on the Facebook Watch streaming service. The show sought to delve into issues that had affected her family, from differing generational viewpoints. “My mother is old school, Willow is new school, and I find myself right in the middle,” she said.\n\nRed Table Talk proved to be a headline-grabber thanks to Pinkett Smith’s willingness to share all kinds of personal information, including her admissions that she had undergone multiple vaginal rejuvenation treatments and that she was once addicted to using sex toys. The series, which won a Daytime Emmy Award for Outstanding Talk Show Informative, ran five seasons through April 2023, when it was cancelled by Facebook Watch.\n\nMarriage to Will Smith and Affair\n\nGetty Images Jada Pinkett Smith with her family—daughter Willow, husband Will Smith, son Jaden, and stepson Trey—after the 94th Academy Awards in 2022.\n\nJada Pinkett and Will Smith were married on New Year’s Eve in 1997. The two met on the set of Smith’s television series The Fresh Prince of Bel-Air, where Pinkett Smith auditioned for the role of one of Smith’s girlfriends. She lost the part to actor Nia Long because she was considered too short.\n\nTheir son, Jaden Smith, was born in 1998. Their daughter, Willow, was born in October 2000. Pinkett Smith also became stepmother to Trey, a son from his Smith’s previous marriage to Sheree Zampino.\n\nIn July 2020, Pinkett Smith admitted to previously having a romantic relationship with singer August Alsina while she and Smith were on a break. Smith confirmed in 2021 that he and Pinkett Smith have an open marriage. “Jada never believed in conventional marriage,” he told GQ. “We have given each other trust and freedom, with the belief that everybody has to find their own way. And marriage for us can’t be a prison.”\n\nIn October 2023, Pinkett Smith sat for an interview with NBC’s Hoda Kotb to discuss the star’s new memoir Worthy, which includes the groundbreaking news that Jada and Will have lived separately for years. They separated in 2016 but continue to make public appearances together. Jada said many things contributed to the split. “By the time we got to 2016, we were just exhausted with trying,” she said. “I think we were both kind of just still stuck in our fantasy of what we thought the other person should be.” She considered getting a divorce but hasn’t gone through with it. Kotb said on the Today show that the couple has no plans to do so. “I made a promise that there will never be a reason for us to get a divorce,” Jada said. “We will work through whatever. I just haven’t been able to break that promise.”\n\nHair Loss from Alopecia Diagnosis\n\nIn 2018, Pinkett publicly revealed that she has alopecia areata, a condition that results in the loss of hair in some or all parts of the body. “I was in the shower one day and had just handfuls of hair in my hands and I was just like, ‘Oh my god, am I going bald?’” she said on her show Red Table Talk, adding “It was one of those times in my life where I was literally shaking in fear. That’s why I cut my hair and why I continue to cut it.”\n\nPinkett Smith has said stress might be a factor in her illness. She began shaving her head as a result of her alopecia, saying in 2021: “Mama’s gonna have to take it down to the scalp so nobody thinks she got brain surgery or something. Me and this alopecia are going to be friends… period.”\n\nChris Rock Slap Incident\n\nGetty Images Will Smith slapping Chris Rock during the 94th Academy Awards ceremony on March 27, 2022.\n\nIn 2022, Pinkett Smith was involved with what has been described as one of the most infamous moments in pop culture history when her husband, Will Smith, slapped comedian Chris Rock during the 94th Academy Awards ceremony. Rock was presenting the award for Best Documentary Feature when he saw the couple in the audience and ad-libbed a joke about Pinkett Smith starring in a sequel G.I. Jane, due to her shaved head.\n\nPinkett Smith was visibly annoyed by the joke. Despite initially laughing at the joke himself, Smith walked onto the stage, slapped Rock across the face, then sat back down, and yelled at Rock from his seat. Rock appeared stunned, jokingly calling it the “greatest night in the history of television,” before continuing his presentation. The moment, which became known as “The Slap” and “Slapgate,” largely overshadowed the rest of the ceremony, during which Smith later won Best Actor for his role in King Richard.\n\n\n\n\n\nSmith later resigned from the Academy, which condemned his actions and banned him from future ceremonies for 10 years. Smith and Rock were both praised and defended from varying parties, with some criticizing Rock for mocking Pinkett Smith’s medical condition. Pinkett Smith later said of the incident: “My deepest hope is that these two intelligent, capable men have the opportunity to heal, talk this out, and reconcile... The state of the world today? We need ’em both.”\n\nIn her memoir, Pinkett Smith describes initially thinking the slap was a skit, and she told The New York Times she was surprised to hear Will call her his wife. “Even though we hadn’t been calling each other husband and wife in a long time, I said, ‘I’m his wife now. We in this.’ That’s just who I am,” she said. “That’s the gift I have to offer, like, ‘Hey, I’m riding with you.’”\n\nNet Worth\n\nPinkett Smith is reported to have a net worth of $50 million. This is the result of her work as an actor, producer, director, author, and businesswoman, as well as her marriage to Will Smith, who has been one of Hollywood’s highest-paid actors of the last two decades, according to Celebrity Net Worth.\n\nWorthy Memoir\n\nPinkett Smith released , her “no holds barred” recounting of her life on October 17, 2023. The actor gave some insight to her memoir’s name prior to its release in an Instagram post, writing, “My hope is that through the exploration of my own tumultuous situations to the rediscovery of deep love, that we are all reminded that no matter where we may be on our journey, we are all...Worthy.”\n\nLess than a week before the book release, Pinkett Smith gave readers a sneak preview of one of the book’s most titillating topics: her relationship with Will Smith. She reveals in the book for the first time that she and Will have been separated since 2016.\n\nPinkett Smith also opens up about her depression and how she considered suicide, particularly after her 40th birthday. “I’d begun to think about how to have a fatal accident that wouldn’t look intentional—for the sake of my kids,” she writes in the book. Instead, she heard about someone’s experience with the psychedelic drug ayahuasca and found it helped her, too. “It gave me a new intimate relationship with myself that I had never had before,” Pinkett Smith told People. “The suicidal thoughts completely went away.”\n\nEditor’s Note: If you or someone you know is struggling with suicidal thoughts or self-harming behaviors, call or text 988 to get help from the 988 Suicide & Crisis Lifeline.\n\nFact Check: We strive for accuracy and fairness. If you see something that doesn’t look right, contact us!", "images": ["https://hips.hearstapps.com/hmg-prod/images/pictured-jada-pinkett-smith-as-lena-james-news-photo-1692987512.jpg?crop=1.00xw:0.708xh;0,0.114xh&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/actor-will-smith-with-his-award-for-best-actor-in-a-leading-news-photo-1692987093.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://www.biography.com/_assets/design-tokens/biography/static/images/logos/logo.5ec9b18.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/actor-dwayne-johnson-attends-the-black-adam-photocall-at-nh-news-photo-1758907441.pjpeg?crop=0.551xw:0.827xh;0.253xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/fish-mooney-in-the-all-happy-families-are-alike-season-news-photo-1692986989.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://www.biography.com/_assets/design-tokens/biography/static/images/logos/network-logo.04aa008.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/american-actress-jada-pinkett-smith-with-american-rapper-news-photo-1692986731.jpg?crop=1.00xw:0.808xh;0,0.0357xh&resize=640:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-666553.jpg?crop=1xw:0.7631578947368421xh;center,top&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/sydney-sweeney-attends-the-lionsgate-presentation-during-news-photo-1762354205.pjpeg?crop=0.551xw:0.827xh;0.239xw,0.0673xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/in-this-image-released-on-october-17th-jada-pinkett-smith-news-photo-1697553617.jpg?crop=0.958xw:0.586xh;0.0423xw,0.0677xh&resize=1200:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://hips.hearstapps.com/hmg-prod/images/actor-james-dean-poses-for-a-warner-bros-publicity-shot-for-news-photo-1760127578.pjpeg?crop=0.8173xw:1xh;center,top&resize=360:*", "https://hips.hearstapps.com/rover/profile_photos/7b0fd6ec-180e-4db7-98aa-b972ecefdf97_1675802159.file?fill=1:1&resize=120:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://hips.hearstapps.com/hmg-prod/images/pictured-eddie-murphy-on-february-15-2015-news-photo-1762808496.pjpeg?crop=0.631xw:0.942xh;0.111xw,0.0577xh&resize=360:*", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1694445107-91n3r1cxBZL.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://www.biography.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://hips.hearstapps.com/hmg-prod/images/charlie-hunnam-attends-the-2024-met-gala-celebrating-news-photo-1729104230.jpg?crop=1.00xw:0.667xh;0,0.0741xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/cast-members-nona-gaye-laurence-fishburne-carrie-anne-moss-news-photo-1692986825.jpg?crop=0.719xw:0.735xh;0.273xw,0.0852xh&resize=980:*", "https://www.biography.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://hips.hearstapps.com/hmg-prod/images/claire-danes-attends-the-world-premiere-of-downton-abbey-a-news-photo-1762895763.pjpeg?crop=1.00xw:0.744xh;0,0.0842xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/actor-will-smith-slaps-us-actor-chris-rock-onstage-during-news-photo-1687467751.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://www.biography.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/megan-moroney-performs-onstage-during-the-2024-cma-music-news-photo-1762964027.pjpeg?crop=0.495xw:0.743xh;0.332xw,0.0745xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/actor-john-candy-poses-for-a-photo-session-on-april-12-1993-news-photo-1760022606.pjpeg?crop=1.00xw:0.804xh;0,0.0536xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/jada-pinkett-smith-arrives-at-the-apple-original-films-news-photo-1693430893.jpg?crop=1.00xw:0.899xh;0,0.0280xh&resize=640:*", "https://hips.hearstapps.com/vidthumb/images/inkt-ep04-thumbnail-682dd7da2d33d.jpg?crop=1xw:1xh;center,top", "https://hips.hearstapps.com/hmg-prod/images/of-southern-california-torch-of-liberty-dinner-1995-penny-news-photo-1760551191.pjpeg?crop=1xw:0.87783xh;center,top&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/eddie-murphy-attends-the-80th-annual-golden-globe-awards-at-news-photo-1762788000.pjpeg?crop=1.00xw:0.669xh;0,0.0791xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1146827623.jpg?crop=1.00xw:1.00xh;0,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/tupac-jada-pinkett-smith-worthy-memoir-6509f44aaf364.jpg?crop=1.00xw:1.00xh;0,0&resize=300:*", "https://hips.hearstapps.com/rover/profile_photos/b50d4909-0f39-4b73-b482-46d0a9078d40_1682363012.file?fill=1:1&resize=120:*", "https://hips.hearstapps.com/hmg-prod/images/american-actor-rock-hudson-news-photo-1759430887.pjpeg?crop=0.81844xw:1xh;center,top&resize=360:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/in-this-image-released-on-october-17th-jada-pinkett-smith-news-photo-1697553617.jpg?crop=0.958xw:0.586xh;0.0423xw,0.0677xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.biography.com/actors/jada-pinkett-smith", "title": "Jada Pinkett Smith: Biography, Actor, Husband Will Smith", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Jada Pinkett Smith: Biography, Actor, Husband Will Smith", "description": "Actor Jada Pinkett Smith has starred in ’The Matrix’ and ’Madagascar’ movies and is married to Will Smith. Read about her net worth, hair, memoir, and more.", "keywords": "alert, profile", "theme-color": "#000000", "og": {"site_name": "Biography", "title": "Jada Pinkett Smith Opens Up About Will Smith, Depression, and More in Her New Memoir", "description": "Pinkett Smith’s hotly anticipated book, ‘Worthy,’ released Tuesday.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/in-this-image-released-on-october-17th-jada-pinkett-smith-news-photo-1697553617.jpg?crop=0.958xw:0.586xh;0.0423xw,0.0677xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.biography.com/actors/jada-pinkett-smith", "type": "article"}, "article": {"publisher": "https://www.facebook.com/Biography", "opinion": "false", "section": "Famous Actors", "modified_time": "2023-10-17T14:47:00Z", "published_time": "2023-10-17T14:47:00Z"}, "parsely-metadata": "{\"socialHeadline\":\"Jada Pinkett Smith Opens Up About Will Smith, Depression, and More in Her New Memoir\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/in-this-image-released-on-october-17th-jada-pinkett-smith-news-photo-1697553617.jpg?crop=0.798xw:0.976xh;0.0961xw,0.0120xh&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/in-this-image-released-on-october-17th-jada-pinkett-smith-news-photo-1697553617.jpg?crop=0.958xw:0.586xh;0.0423xw,0.0677xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/in-this-image-released-on-october-17th-jada-pinkett-smith-news-photo-1697553617.jpg?crop=0.798xw:0.976xh;0.0961xw,0.0120xh", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/in-this-image-released-on-october-17th-jada-pinkett-smith-news-photo-1697553617.jpg?crop=0.958xw:0.586xh;0.0423xw,0.0677xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "timely", "sailthru.excerpt": "1971-presentLatest News: Jada Pinkett Smith’s New Memoir Worthy Is Now OutJada Pinkett Smith’s “no holds barred” memoir of her life released on October 17. In promoting Worthy earlier in the month, the 52-year-old actor shared the shocking news that she and her husband, Will Smith, have lived separately since 2016.", "sailthru.tags": "actors,Famous Actors,Biography-US", "sailthru.date": "2023-10-17 14:47:00", "sailthru.socialtitle": "Jada Pinkett Smith Opens Up About Will Smith, Depression, and More in Her New Memoir", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1697554020.0, "source": "https://www.biography.com", "summary": ""}