{"url": "https://www.nydailynews.com/entertainment/gossip/blac-chyna-mechie-leaked-sex-tape-article-1.3830906", "text": "Blac Chyna’s ex-boyfriend, Mechie, revealed that he’s the one pictured in the leaked sex tape with the model.\n\nMechie’s rep told TMZ that the video was shot back in July using Chyna’s phone and that he never had a copy of the video, so he’s unsure how it was leaked.\n\nSources close to Mechie also told the gossip site that he plans to go to police and wants the responsible party to be prosecuted.\n\nChyna announced on Monday that she would be filing a police report following the leak of the short video which shows her performing oral sex on Mechie.\n\nMechie and Chyna split in August after about two months together, according to reports.\n\nLisa Bloom and Walter Mosley, attorneys for the 29-year-old, both took to social media to denounce the tape.\n\nBlack Chyna wears a purple sheer dress as she takes a Labor Day yacht trip with Mechie and friends in Miami Beach, Florida.\n\n“Revenge porn — posting explicit images without the consent of everyone in those images — is a crime, a civil wrong, and a form of domestic abuse,” Bloom wrote on Twitter.\n\nMosley wrote on Instagram, along with a photo of him and Chyna, that the “culture of abuse and assault against women” needs to change.\n\nThis is not the first time Chyna, whose real name is Angela Renée White, has been a victim of revenge porn.\n\nHer former fiancé, Rob Kardashian, posted multiple nude photos of her to social media in July, accusing her of infidelity.\n\nHe also shared a video of the reality star making out with Mechie — but it appears to be a different encounter from the recently released tape due to her different hair color.\n\nChyna, who shares 1-year-old daughter Dream with Kardashian, had said she was “devastated” by his actions.\n\n“How could somebody, like, post these pictures of me and I’m like, ‘Wow, OK.’ Like, this is a person that I trusted, I confide in,” Chyna said in in a “Good Morning America” interview.\n\n“I had felt comfortable, you know, with even sending these pictures and even talking to him about certain things, you know. I felt … betrayed.”\n\nThe two reached a co-parenting agreement for Dream last September following a court battle where Chyna claimed Kardashian had turned physically violent toward her.\n\nShe was granted a restraining order against him.", "images": ["data:image/webp;base64,UklGRiQAAABXRUJQVlA4IBgAAAAwAQCdASoBAAEAAwA0JaQAA3AA/v3AgAA=", "https://secure.gravatar.com/avatar/?s=85&d=mm&r=g", "https://www.nydailynews.com/wp-content/uploads/migration/2018/02/20/DCFAYOFZDHKFUU6SCDOSLWTJDI.jpg?w=1024&h=670", "https://www.nydailynews.com/wp-content/uploads/2023/08/New_York_Daily_News_nydredblack-1.svg"], "top_img": "https://www.nydailynews.com/wp-content/uploads/migration/2018/02/20/DCFAYOFZDHKFUU6SCDOSLWTJDI.jpg?w=1024&h=670", "keywords": [], "authors": ["Nicole Bietette"], "canonical_link": "https://www.nydailynews.com/2018/02/20/blac-chynas-ex-mechie-says-its-him-in-the-leaked-sex-tape/", "title": "Blac Chyna’s ex Mechie says it’s him in the leaked sex tape", "meta_data": {"application-name": "newyorkdailynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "robots": "max-image-preview:large", "tdm-reservation": 1, "mrf": {"authors": "Nicole Bietette", "canonical": "https://www.nydailynews.com/2018/02/20/blac-chynas-ex-mechie-says-its-him-in-the-leaked-sex-tape/"}, "description": "Blac Chyna’s ex-boyfriend, Mechie, reveals that he’s the one pictured in the leaked sex tape with the model.", "generator": "WordPress 6.8.3", "og": {"type": "article", "title": "Blac Chyna’s ex Mechie says it’s him in the leaked sex tape", "url": "https://www.nydailynews.com/2018/02/20/blac-chynas-ex-mechie-says-its-him-in-the-leaked-sex-tape/", "description": "Blac Chyna’s ex-boyfriend, Mechie, revealed that he’s the one pictured in the leaked sex tape with the model. Mechie’s rep told TMZ that the video was shot back in July using Chyn…", "site_name": "New York Daily News", "image": {"identifier": "https://www.nydailynews.com/wp-content/uploads/migration/2018/02/20/DCFAYOFZDHKFUU6SCDOSLWTJDI.jpg?w=1024&h=670", "width": 1024, "height": 670}, "locale": "en_US"}, "article": {"published_time": "2018-02-20T08:13:41+00:00", "modified_time": "2018-04-07T05:52:28+00:00"}, "twitter": {"text": {"title": "Blac Chyna’s ex Mechie says it’s him in the leaked sex tape"}, "image": "https://www.nydailynews.com/wp-content/uploads/migration/2018/02/20/DCFAYOFZDHKFUU6SCDOSLWTJDI.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.nydailynews.com/wp-content/uploads/2023/09/cropped-DailyNewsCamera-7.webp?w=270"}, "movies": [], "publish_date": 1519114421.0, "source": "https://www.nydailynews.com", "summary": ""}