{"url": "https://www.harpersbazaar.com/celebrity/latest/a21267316/kylie-jenner-deletes-stormi-webster-photos/", "text": "Kylie Jenner and Timothée Chalamet have been one of Hollywood’s most secretive couples to date.\n\nThough romantic rumors began plaguing the two in April 2023, the cosmetics mogul and the actor did not make a known public appearance together until that September.\n\nSince then, they’ve gone very public with their relationship, often being spotted on date nights, supporting one another at events like award shows, and being there for important family moments.\n\nAhead, a look at their love story.\n\nKarwai Tang // Getty Images Jeff Kravitz // Getty Images\n\nA Closer Look at Kylie & Timothée’s Romance Kylie Jenner Secretly Traveled to Support Timothée Chalamet’s Project Read Now Timothée Chalamet Clarifies Where He and Kylie Jenner Stand With Selena Gomez After Rumors Read Now Kylie Jenner Coyly Reacts to Timothée Chalamet Theories Read Now\n\nThe couple attends the Knicks’s final game against the Indiana Pacers in the Eastern Conference Finals, and they look so in love in their coordinating team merch.\n\nGregory Shamus // Getty Images\n\nGregory Shamus // Getty Images\n\nJenner and Chalamet go see the hit play Oh, Mary! at The Lyceum Theatre while in New York City, and even pose for photos backstage with the cast.\n\nBruce Glikas // Getty Images\n\nBruce Glikas // Getty Images\n\nAnd this time, Jenner wears her own team jacket, and the two cannot stop showing PDA.\n\nSarah Stier // Getty Images\n\nCHARLY TRIBALLEAU // Getty Images\n\nMay 12, 2025: They go see the NY Knicks, with Kendall.\n\nThe sisters coordinate game day looks to sit courtside and watch the Knicks with the actor.\n\nElsa // Getty Images\n\nApril 22, 2025: Timothée's mom talks about Kylie.\n\nNicole Flender, also know as Chalamet’s mom, and a luxury real estate agent for Corcoran, is asked point-blank about Jenner in an interview—and she answers.\n\nSpeaking with Curbed, Flender shares of the makeup mogul: “I have to say she’s lovely. She’s very nice to me.”\n\nShe also reveals that the actor recently bought an $11 million house in Beverly Hills—right where Jenner lives with her two kids, daughter Stormi, seven, and son Aire, three.\n\nMay 7, 2025: They make their red-carpet debut.\n\nFinally, the couple confirms their love on the red carpet. And while it’s not at the Met Gala, like everyone expected, it happens two days later, at a photocall in Rome during the 70th David Di Donatello at Cinecittà Studios.\n\nThe two coordinate in sleek black looks, and look so majorly in love.\n\nDaniele Venturelli // Getty Images\n\nDaniele Venturelli // Getty Images\n\nErnesto Ruscio // Getty Images\n\nApril 15, 2025: They are very serious, a source says.\n\nAfter the couple is spotted smooching all over Coachella, a source tells People that the relationship is “very serious.” Their bliss comes after they faced an “intense” start of the year with a busy awards season. “But they are making it work. Kylie is truly his biggest fan. She would clear her schedule to attend awards and premieres with him. She couldn’t be more supportive of his career,” the insider adds.\n\nA source additionally tells Entertainment Tonight that Jenner and Chalamet “are protective of their relationship, but also not shy about showing their love for one another.” They also prioritize each other, the source says: “They spend as much time as possible together. They try to do sweet things for each other, both small and big, and are both very thoughtful.”\n\nApril 12, 2025: They head to Coachella.\n\nJenner and Chalamet make their couple debut at weekend one of Coachella. Jenner is seen wearing a white cropped T-shirt with baggy white pants, while Chalamet goes nearly incognito in a plum T-shirt, black shorts, a brown backpack, a black-and-white baseball cap, and sunglasses.\n\nBACKGRID\n\nLater, fans post videos of the couple’s PDA-filled appearances at the festival, including clips of the two embracing, dancing, and kissing.\n\nMarch 2, 2025: They make their Oscars debut.\n\nJenner continues her awards season streak by supporting Chalamet at the 97th Academy Awards. They look so in love in photos from the ceremony, tho which the actor wears a butter-yellow suit and Jenner wears a plunging sequined black dress.\n\nJohn Shearer/97th Oscars // Getty Images\n\nFebruary 16, 2025: They look in love at the BAFTAs.\n\nThe Khy founder looks spectacular in a backless black gown with a thin halter strap and sequined petals at the 78th British Academy Film Awards in London. The piece is a one-of-a kind 1995 design by John Galliano. He, meanwhile, wears a slick black suit styled with a matching tee and a two-strand diamond tennis necklace.\n\nGetty Images\n\nFebruary 14, 2025: They spend Valentine’s Day together.\n\nJenner is Chalamet’s biggest fan at a screening of the actor’s Oscar-nominated film during the Berlin Film Festival. Jenner wears another shimmery black dress for the occasion.\n\nFebruary 12, 2025: Kylie supports Timmy at his screening.\n\nJenner unexpectedly joins her boyfriend at his screening of A Complete Unknown at the Santa Barbara Film Festival. She claps for him while in a plunging black gown.\n\nJanuary 30, 2025: The couple is spotted in Beverly Hills.\n\nChalamet and Jenner are spotted arriving at the Beverly Hills Hotel together ahead of the Grammys on Sunday. The couple walked through the parking garage before heading inside.\n\nFor the casual occasion, Jenner slipped into an all-black ensemble, wearing a hoodie and a cropped leather jacket with a pair of flared leggings and boots. Her toned torso peeked out from underneath her layers.\n\nMeanwhile, the Wonka actor coordinated in his own monochromatic look, wearing a black Arc’teryx jacket and matching joggers. He rounded out his comfortable look with a pair of sneakers and a baseball cap.\n\nJanuary 15, 2025: They enjoy a night out in Paris.\n\nAfter Chalamet walks the red carpet for the A Complete Unknown premiere in Paris, he is seen heading out hand-in-hand with Jenner. Jenner wears an all-black ensemble, including a black halter top, black pants, and black pumps. Meanwhile, Chalamet wears a houndstooth puffer jacket, a black leather jacket, a white T-shirt, and black jeans.\n\nJanuary 5, 2025: Kylie supports Timothée at the Golden Globes.\n\nJenner attends the 82nd annual Golden Globes to support Chalamet, who is nominated for his role in A Complete Unknown.\n\nAlthough Jenner skips the red carpet, she is seen sitting inside the Beverly Hilton Hotel at Chalamet’s table. For the occasion, she wears a molten silver gown with a backless silhouette.\n\nThe two look to be having the best time at the ceremony, and photos show them looking incredibly smitten and in love.\n\nCBS Photo Archive // Getty Images\n\nGetty Images\n\nChristopher Polk/GG2025 // Getty Images\n\nCBS Photo Archive // Getty Images\n\nA couple of days later, an insider tells Page Six that it was “really important [to Chalamet] Kylie be there by his side during one of the most meaningful moments of his life.”\n\n“Timothée is used to attending award shows and events, but it was nice having Kylie there to support him,” the insider says. “Kylie really is his best friend and his biggest supporter. They have such a strong connection, and he was so thankful she could be there with him.”\n\nDecember 23, 2024: They celebrate Christmas early.\n\n“The kids had a really magical time, and Kylie and Timothée made some very special memories together,” the insider adds.\n\nJenner and Chalamet with not spend the actual holiday together, as they’ll be with their respective families, which is why they “made sure to celebrate beforehand and even exchanged some gifts.”\n\n“Timothée not only got Kylie gifts, but also got some for the kids, which Kylie thought was so sweet and thoughtful,” the source says.\n\nJenner and Chalamet are spotted leaving the Museum of Modern Art in New York City. She looks chic in a black coat and tight bun, while he keeps it casual in a graphic white tee, dark jeans, and a gray workwear jacket.\n\nDecember 10, 2024: They go to Timothée’s afterparty together.\n\nThe two are seen together at the afterparty for the A Complete Unknown premiere. An eyewitness tells People that Jenner arrived at the event with mom Kris Jenner, and that the couple weren’t afraid to be “pretty affectionate with each other.” The witness notes that Jenner was seen sitting in Chalamet’s lap with her arm wrapped around his shoulders, and that the two shared a kiss. At the end of the night, the couple exited the party while holding hands, the source says.\n\nAugust 12, 2024: They celebrate her birthday in the Bahamas.\n\nJune 28, 2024: Kylie and Timothée appear together for the first time in months.\n\nDespite breakup rumors, the couple is seen looking smitten together in their first joint appearance in months. Paparazzi snap photos of them en route to the TCL Chinese Theatre in Hollywood.\n\nFor the low-key outing, Jenner wears a white tub top with baggy black low-waist pants, black flip-flops, a camo trucker hat, and a black leather tote bag. As for Chalamet, the actor wears a black long-sleeve top, black shorts, a black baseball hat, and black Nike sneakers.\n\nBACKGRID\n\nA source tells People that the couple headed out to dinner with friends at Tatiana by Kwame Onwuachi in New York City, adding that Chalamet in particular was “really chill and so nice.”\n\nAnother source tells the outlet that Jenner and Chalamet are “definitely beyond the ‘just having fun’ point of the relationship” and “everyone on both sides sees definite potential for something real.” They add, “They’re both real with each other and things have been easy and fun. Timothée reminds Kylie to live in a very ‘present’ way, and she really likes that about him. They both push each other to be better people and that’s a constant thing in their relationship.”\n\nMarch 7, 2024: Kylie coyly responds to theories on Timothée influencing her style.\n\nIn an interview with the New York Times, Jenner responds to public speculation that Chalamet inspired her noticeable shift in personal style over the past year, in which she moved from spicy, ultra-sexy pieces to refined minimalist attire.\n\n“I don’t know how I feel about that,” she says. “I just don’t want to talk about personal things.”\n\nShe confirms that she did experience a style transformation one year ago—around the same time her son, Aire, celebrated his first birthday. “It takes me a while after I have a baby to feel like myself again,” she explains. “Then you get your body back, and you’re like, ‘Wait, the trends have changed.’”\n\nJanuary 7, 2024: Kylie and Timothée make their Golden Globes debut.\n\nThe couple arrive at the 81st Golden Globes, and while they skip walking the red carpet together, they are seen showing off their love at the ceremony—and in coordinating sparkly black ensembles, at that.\n\nRelated Story Kylie & Timothée Debut at the 2024 Golden Globes\n\nChristopher Polk/Golden Globes 2024 // Getty Images\n\nClips show the pair chatting, laughing, and even sharing sweet kisses during the show. See here:\n\nDecember 24, 2023: Timothée seemingly attended Kylie’s Christmas Eve bash.\n\nFans made a commotion when they spotted a man who appeared to be Chalamet chatting with Jenner at her family’s Christmas Eve party in the background of a Snapchat story posted by Landon Barker. The pic was reposted to a Jenner-Chalamet Instagram fan account.\n\nRelated Story Timothée Seemingly Attended Kylie’s Christmas Bash\n\nIn an interview with MTV, Chalamet is asked what his favorite concert of the year was, but has trouble remembering if he attended any concerts in 2023. “You went to Beyoncé. That is documented, I will say,” interviewer Josh Horowitz tells him. “Oh, yes, yes, yes. That was great, that was great,” Chalamet says, blushing. “Hard to be present,” he then jokes, seemingly alluding to his viral, very public makeout session with Jenner.\n\nDecember 10, 2023: Kylie sneaks into Timothée's movie premiere.\n\nAt the Los Angeles premiere of Wonka, Chalamet's latest film, Jenner and her mom, Kris Jenner, skip the red carpet and sneak into the Regency Village Theatre after the film's opening credits, according to a source for People.\n\n“Kylie and Timothée have been doing really well,” another insider tells Entertainment Tonight. “Even though Kylie has so many of her own commitments, she is very proud of Timothée and wants to be there for him and support him,” the source adds. “Timothée is equally supportive of Kylie and admires her strong work ethic and how committed she is as a mom.”\n\nThe source adds, “They both make an effort to show up for each other, and it’s very sweet.”\n\nMichael Tran // Getty Images\n\nDecember 4, 2023: Kylie calls Timothée “her boyfriend.”\n\nA source for People reveals the current relationship status between Jenner and Chalamet, saying the mom of two reportedly now calls the actor “her boyfriend.”\n\nThe “incredibly happy” couple are both “supportive” of each other’s careers, the insider explains to the outlet. “They both try to attend important events for each other.”\n\nIn particular, Chalamet is “in awe of everything she is accomplishing” and “especially thinks she is an amazing mom.”\n\n“He is very good for Kylie,” the source continues. “Since dating him, she seems very content, relaxed, and focused. Her family loves him.”\n\nRelated Story Kylie Has a Photo With Timothée As Her Lock Screen\n\nNovember 11, 1023: Kylie supports Timothée as he hosts SNL.\n\nChalamet hosts Saturday Night Live for the second time, breaking the internet with the “baby face” rap portion of his monologue. He and Jenner attend the SNL after-party together. The makeup mogul looks striking in an asymmetrical black minidress, shiny black tights, heels, and shade. Chalamet, meanwhile, is cool in a colorful blue and red hoodie, purple jacket, gray jeans, black sneakers, and a black baseball hat.\n\nGotham // Getty Images Gotham // Getty Images\n\nNovember 1, 2023: Timothée supports Kylie at the 2023 Innovator Awards.\n\nThe actor shows up at New York City’s Museum of Modern Art to support Jenner, who is being honored at WSJ. Magazine’s 2023 Innovator Awards. The two coordinate in sleek dark looks and are photographed smiling and happily chatting while sitting together during the dinner.\n\nIn an interview with , Chalamet speaks about his wish to lead a private life while continuing to have a career in Hollywood and date one of the most famous women on the planet. At one point, GQ’s Daniel Riley jokingly tells Chalamet that if he really wanted to be left alone, he would not necessarily choose to spend time with one of the four most-followed people on Instagram. At that, the actor laughs and says, “This reminds me of that recent South Park episode with the Worldwide Privacy Tour.” The episode parodies Meghan Markle and Prince Harry, with the couple traveling around the world demanding privacy. “Sometimes, people are going to be hella confused when you say you’re trying to live a private life.”\n\nChalamet adds that despite his fame, he works hard to protect his humanity and stay grounded. “You’ve got to have the experiences in your personal life that are usable to you,” he says. “The experiential rush of my career taking off was so new to me that those were the experiences that were feeding my work for a while. But you’ve got to have real experiences. Human experiences. You’ve got to fall in love, you’ve got to be bored.”\n\nSeptember 25, 2023: Kylie and Timothée step out in Paris.\n\nThe pair is seen out in Paris for Fashion Week. In photos, they’re seen holding hands while stepping out of a car—both in all-black outfits.\n\nSeptember 10, 2023: They pack on the PDA at the U.S. Open.\n\nThe couple is out and about. Jenner and Chalamet are seen at Arthur Ashe Stadium on Sunday for the U.S. Open men’s finals. While there, the pair show their affection for one another with sweet PDA.\n\nGotham // Getty Images\n\nGotham // Getty Images\n\nPhotos show Jenner leaning over to kiss Chalamet while the actor wraps his arm around her. Other snaps show Chalamet taking photos of Jenner, and the two eating chicken fingers with ketchup while enjoying the match.\n\nThe U.S. Open even shares a video of them on the tournament’s official Instagram.\n\nGotham // Getty Images\n\nMike Stobe // Getty Images\n\nGotham // Getty Images\n\nSeptember 9, 2023: They attend a NYFW dinner together.\n\nLess than a week after their PDA-filled outing in L.A., Jenner accompanies Chalamet to a New York Fashion Week event. The model was the actor’s plus-one to a dinner celebrating Haider Ackermann’s beauty collaboration with Augustinus Bader, and the couple’s arrival reportedly set the room “abuzz.”\n\nIn a shared on TikTok, Jenner can be seen sitting closely with Chalamet at the long table, with the couple coordinating in black outfits.\n\nSeptember 4, 2023: They go very public with their romance.\n\nJenner and Chalamet step out in public together for the first time—and their destination of choice? Beyoncé’s star-studded birthday concert. The couple are accompanied by Kendall Jenner, and joined the likes of Meghan Markle, Kelly Rowland, and Kerry Washington at the L.A. show.\n\nIn a video shared on X by a concertgoer, Jenner and Chalamet are seen getting cozy and chatting and laughing in their private balcony. And in photos published by TMZ, the two are seen fully making out during the show!\n\nAugust 28, 2023: Kylie and Timothée “don’t hang out often.”\n\nA source for Us Weekly reveals that the couple is still enjoying a private, but low-key, romance.\n\n“Kylie and Timothée haven’t been spending that much time together recently because they both have very busy schedules,” the insider says. “But they’re still communicating on a pretty regular basis and have remained friends despite the fact that they don’t hang out that often.”\n\nThe source adds, “They run in the same circle of friends, and have a great time when they’re together, but it’s not that serious. Kylie is having fun and although she’s open to seeing where things go, they’re not in a committed relationship. Things are very casual.”\n\nAugust 24, 2023: Kylie arrives at Timothée’s home.\n\nJenner is pictured arriving at the actor’s Beverly Hills home in her Mercedes after a shopping spree in the area. She looks cool and casual in a boxy white tee, light-wash blue jeans, black sandals, and a black tote bag.\n\n\n\nAugust 2, 2023: Sources dispel breakup rumors.\n\nLife & Style reports that Jenner and Chalamet had split up, with one source claiming, “She’s telling people that things between them naturally fizzled out because they’re both busy and traveling. But friends are whispering that Kylie got dumped.”\n\nThe source adds, “Kylie is playing it casual, but her friends know this must sting. Timothée was the first guy she really spent time with after splitting from Travis [Scott]. She even introduced him to her family.”\n\nHowever, sources for TMZ speak out against the rumors.\n\nThe outlet notes that, though the couple have yet to make a public appearance together, “everything is cool between the two [and] they're still an item.” One insider says, “Any reports that say otherwise are false,” and further warned fans “not to believe everything they read.”\n\nJune 1, 2023: They’re pictured spending time together.\n\nJenner and Chalamet are photographed together for the first time at the actor’s home in Beverly Hills. In photos published by the Daily Mail from two separate days, the pair is seen walking side by side while holding hot drinks.\n\nSources tell the outlet that Jenner has been spending plenty of time at Chalamet’s house—“for upwards of six days a week.”\n\nMay 2023: They’re reportedly keeping it casual and low-key.\n\nJenner and Chalamet are reportedly enjoying a casual relationship away from the spotlight. A source tells Entertainment Tonight on that the two are “casually seeing each other” and that they’ve been “trying to keep it low-key.” Meanwhile, a People insider adds that Jenner is still prioritizing parenting above all else. “Kylie enjoys dating, but her main focus is being a mom. [Their relationship is] not serious,” the insider adds.\n\n“They are becoming more comfortable with each other, but Kylie wants to take things day by day and see where it goes,” says the ET source. “Her family thinks it’s great that Kylie is doing her thing and they are supportive.”\n\n“Timothée loves that Kylie is such a hands-on mom and a boss,” the insider continues. “He appreciates her confidence and thinks she’s incredibly beautiful.”\n\nThe source adds that Jenner’s ex, Travis Scott, hasn’t been happy with the new relationship but is putting co-parenting first. “Travis is not thrilled about Kylie moving on, but they are still cordial and focused on co-parenting and being the best parents they can be.”\n\nApril 17, 2023: Dating Timothée feels “different than [Kylie’s] past relationships.”\n\nAn insider for Entertainment Tonight reveals that Jenner’s romance with Chalamet is “new and exciting.”\n\n“They are keeping things casual at this point. It’s not serious, but Kylie is enjoying hanging out with Timothée and seeing where it goes,” the source added. “It’s been really fun for her because it feels a lot different than her past relationships. It’s new and exciting for Kylie and she’s having a lot of fun.”\n\nThough some fans speculated that the two would go public during Coachella, the insider explained why that didn’t happen: “Kylie decided she didn’t want to make things public with Timothée this past weekend at Coachella and really just wanted to chill and have fun with her friends.”\n\n\n\nThe source additionally noted that big sister Kendall Jenner might have helped orchestrate their relationship. “Timothée is also friends with Kendall, so it’s been easy for Kylie to integrate him into her life,” the source said.\n\nApril 2023: Romance rumors emerge.\n\nWhile neither Jenner nor Chalamet have publicly commented on their relationship, dating rumors began to spread in early April. An anonymous tipster first claimed to Deuxmoi that the two had been seeing each other since January. Other tipsters also wrote that the stars were likely to attend Coachella together.\n\nThe rumors hit a fever pitch when one of Jenner’s luxury cars, a black Range Rover, was photographed outside of Chalamet’s Beverly Hills home, though the pictures don’t show Jenner or Chalamet. (Chalamet’s home is about an hour away from Jenner'’s lavish Holmby Hills estate, per the outlet.)\n\nThere have also been reports that the pair had a low-key date night at Tito’s Tacos in Santa Monica a week before Jenner’s Range Rover was spotted at Chalamet’s house. Per DailyMail.com, Chalamet was seen getting into another of Jenner’s cars, with his own following behind as they reportedly drove to the L.A. taco stand and ate in the back seat.\n\nThat same week, a source later confirmed to People that the pair “are hanging out and getting to know each other.”\n\nAnother insider told Us Weekly that the rumored couple are still in the early stages of their romance. “Kylie has only hung out with Timothée a couple of times, so things aren’t that serious. However, she’s enjoying getting to know him better and is open to seeing where things go,” the source told the outlet. “Things are very new so it’s hard to tell, but so far she likes what she sees.”\n\nThe insider added, “Timothée is a total gentleman and treats [Kylie] with respect. He’s very charming and he makes her laugh, and he’s easy to talk to. He’s not like any of the other guys she’s dated before and although he may not seem like her type, they have really good chemistry.”\n\nJanuary 2023: Kylie and Timothée reportedly meet for the first time.\n\nThe two met in-person for the first time when they attended the same Jean Paul Gaultier fashion show in January during Paris Couture Week. A video of them laughing together at the show was published by celebrity gossip Instagram account Deuxmoi.\n\nThey also both attended Vanity Fair’s 2023 Oscars after-party in March, but were not seen or photographed together.\n\nJanuary 2023: Kylie splits from her longtime on-and-off boyfriend.\n\nOutlets reported that Jenner broke up with Travis Scott after the holidays in late 2022 or early 2023. The two began dating in 2017 and share two children: daughter Stormi, five, and son Aire Webster, one.\n\nMeanwhile, Don’t Look Up star Chalamet was previously linked to actresses Eiza González, Lily-Rose Depp, and Lourdes Leon.", "images": ["https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/x-regular.e414d97.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1838652614-6578aa8fdf215.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/caret-left-regular.5546078.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1672963790-64ff1322acdc5.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/harpersbazaar/static/images/logos/logo.823d7af.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2217026459-683f31e487b36.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2213949153-681bbd5350c23.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2192590814-677be7c36f0fe.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2213946646-681bbd2f1a280.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1908165827-659b5f2b4371e.jpg?crop=1.00xw:0.753xh;0,0.0216xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/bgus-2963179-001-6682b4d9ed696.jpg?crop=0.638xw:1.00xh;0.128xw,0&resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1908405356-65eb24f8426a0.jpg?crop=0.668xw:1.00xh;0.199xw,0&resize=640:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/harpersbazaar/static/images/logos/network-logo.6416a85.svg?primary=%2523ffffff", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=currentColor&id=link-out-embed", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/envelope-simple-regular.91a0134.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2218018344-683f32772a0ce.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/kylie-jenner-and-timoth-c3-a9e-chalamet-are-seen-at-the-final-news-photo-1695314821.jpg?crop=1.00xw:0.770xh;0,0.0293xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2192046152-677be7e285dda.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1788873349-65524f3f9395d.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2202919905-67c4f5a48d0ea.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2217976228-683f30f592485.jpg?crop=1xw:0.46529296875xh;0,0.0544xh", "https://hips.hearstapps.com/hmg-prod/images/kylie-jenner-and-timoth-c3-a9e-chalamet-are-seen-at-the-final-news-photo-1695314821.jpg?crop=0.658xw:1.00xh;0.201xw,0&resize=640:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2218018341-683f32883a822.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1672875787-64ff133073050.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1672973356-64ff13060dbcf.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg?primary=%2523ffffff", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2217976228-683f30aa62d37.jpg?resize=980:*", "https://hips.hearstapps.com/rover/profile_photos/21445446-1bde-4290-a24e-2bdd274be027_1521573573.jpg?fill=1:1&resize=160:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1908165827-659b790d3ba3e.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2217976206-683f30de25ec1.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2192590815-677be7f24da63.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1788865555-65524f1e52591.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2217976228-683f30f592485.jpg?crop=0.970xw:0.402xh;0,0.0544xh&resize=1200:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg", "https://hips.hearstapps.com/hmg-prod/images/kylie-jenner-timothee-chalamet-643942d75ae58.jpg?crop=0.425xw:0.850xh;0.510xw,0&resize=640:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1474604743-643d6ff544301.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2217736148-683f31b9011d3.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2214788105-1-683f2f2cbcaa1.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/bookmark-simple-regular.9d9d56b.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2192004953-677b36c7ada8f.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/kylie-jenner-and-timoth-c3-a9e-chalamet-attend-the-wsj-magazine-news-photo-1701274256.jpg?crop=1.00xw:0.755xh;0,0.123xh&resize=300:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/globe-simple-regular.e7f303c.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/saved.ad81f1a.svg?primary=%2523000000", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1388058563-643d6fff697e5.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/bgus-3208509-003-67fd13990cd82.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1672988702-64ff1312853d0.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/screenshot-2025-03-02-at-7-26-04-pm-67c4f7288d8ab.png?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2213948074-681bbd41b6e53.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1672960669-64ff148345521.jpg?resize=980:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2217976228-683f30f592485.jpg?crop=0.970xw:0.402xh;0,0.0544xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.harpersbazaar.com/celebrity/latest/a43600106/kylie-jenner-timothee-chalamet-relationship-timeline-photos/", "title": "Kylie Jenner and Timothée Chalamet’s Full Relationship Timeline", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Kylie Jenner and Timothée Chalamet's Full Relationship Timeline", "description": "Here's all we know about their romance—from the first time they met to their recent joint outings.", "theme-color": "#000000", "og": {"site_name": "Harper's BAZAAR", "title": "Kylie Jenner and Timothée Chalamet Go Casual for a Broadway Date", "description": "From the basketball court to the theater", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2217976228-683f30f592485.jpg?crop=0.970xw:0.402xh;0,0.0544xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.harpersbazaar.com/celebrity/latest/a43600106/kylie-jenner-timothee-chalamet-relationship-timeline-photos/", "type": "article"}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "opinion": "false", "section": "Celebrity News", "modified_time": "2025-06-03T17:36:00Z", "published_time": "2025-06-03T17:36:00Z"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "parsely-metadata": "{\"socialHeadline\":\"Kylie Jenner and Timothée Chalamet Go Casual for a Broadway Date\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2217976228-683f30f592485.jpg?crop=1.00xw:0.829xh;0,0.0411xh&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2217976228-683f30f592485.jpg?crop=0.970xw:0.402xh;0,0.0544xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2217976228-683f30f592485.jpg?crop=1.00xw:0.829xh;0,0.0411xh", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2217976228-683f30f592485.jpg?crop=0.970xw:0.402xh;0,0.0544xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "timely", "sailthru.excerpt": "Kylie Jenner and Timothée Chalamet have been one of Hollywood’s most secretive couples to date.Though romantic rumors began plaguing the two in April 2023, the cosmetics mogul and the actor did not make a known public appearance together until that September.Since then, they’ve gone very public with their relationship, often", "sailthru.tags": "celebrity,Celebrity,latest,Celebrity News,Harper's BAZAAR-US", "sailthru.date": "2025-06-03 17:36:00", "sailthru.socialtitle": "Kylie Jenner and Timothée Chalamet Go Casual for a Broadway Date", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1748972160.0, "source": "https://www.harpersbazaar.com", "summary": ""}