{"url": "https://ew.com/movies/2017/12/20/love-actually-story-ranking/", "text": "Do you feel it in your fingers? Do you feel it in your toes?\n\nAs you may or may not have noticed, Christmas is all around us. ‘Tis the season for novelty pop singles, for children’s nativity plays, for office holiday parties, for happy reunions at airports, for Mariah Carey — in short, for Love Actually.\n\nRichard Curtis’ “ultimate romantic comedy” has been charming viewers every holiday season (and a lot of other seasons, too, if we’re being honest) since it first hit theaters in 2003. In the layered collection of loosely-connected love stories taking place over the weeks leading up to one Christmas in London, everybody has their own favorite Love Actually moment — from a politician’s personal dance party to a controversial cue-card confession to “Are you from England?” But which of the film’s nine narrative threads reigns supreme?\n\nWe’ve put them all in order from worst to best, just because it’s Christmas (and at Christmas you tell the truth). Check out our ranking, actually, below!\n\n9. Juliet, Peter, and Mark\n\nIt’s cool that Keira Knightley, Andrew Lincoln, and Chiwetel Ejiofor all went on to be insanely famous and beloved. You know what’s not cool? Every single thing about their storyline, especially those unforgivably creepy cue cards. The whole thing leaves a worse taste in my mouth than Juliet’s “terrible taste in pie.” How can Juliet and Mark never tell Peter about their weird little moment? How did Mark even fall in love with Juliet if he never deigned to have a conversation with her… because he was already in love with her?! All the love that exists between this trio is built on secrets and lies. How do we all stand for it every Christmas? To me, this is not perfect.\n\n8. Harry and Karen (and Mia, I guess)\n\nHarry and Karen’s love gone wrong has got to be the most crushing story in the movie because while there’s still hope for Sarah’s heart to mend, Karen knows that “life will always be a little bit worse” following the discovery of her husband’s confirmed infidelity (and their subdued airport reunion at the end reinforces that realization). And if the image of Emma Thompson crying while listening to Joni Mitchell doesn’t absolutely shatter your heart, I honestly have no idea what will.\n\n7. Sarah, Karl, and Michael\n\nThe attraction between Sarah and Karl is very underdeveloped, but I guess the gist is that Laura Linney’s radiant goodness and Rodrigo Santoro’s unreasonable handsomeness just inexorably drew them to each other until Karl finally asked Sarah to dance. Alas, while Sarah has probably the biggest heart of anyone in this whole movie filled with great big stupid hearts, there just isn’t enough room in it for her to be both devoted to her brother Michael and to begin a relationship with beautiful, beautiful Karl. Don’t worry, Sarah! Patrick Dempsey will be yours in 14 short years.\n\n6. Colin and the American girls\n\nWhen we first hear self-proclaimed “God of Sex” Colin tell his friend Tony that he plans to cross the Atlantic to find a girlfriend — based on the infallible logic that no American girl will be able to resist his British accent — we accept it as a dumb cliché and brace ourselves for Colin’s inevitable humiliation at the hands of all the smart American girls who will reject him. But no! It’s got to be Love Actually’s cleverest joke (if one of its rather shallower love stories) that Colin was absolutely right. Good thing that suitcase was chock-a-block full of condoms!\n\n5. John and Judy\n\nThe simplest, and one of the sweetest, love stories in Love Actually is that of John and “Just Judy,” who feel no awkwardness whatsoever as they nakedly simulate sex in their work together as body doubles, but blush and giggle and stutter their way through their shy flirtations. When Judy finally admits, “all I want for Christmas… is you!” it lacks the flash of some of the other romantic climaxes, but is no less filled with feeling.\n\n4. Jamie and Aurélia\n\nYes, their (sort of) bilingual proposal scene is adorable, but it’s also pretty schmaltzy, capitalizing on that cheapest of rom-com setups, the declaration of love before an audience of strangers. (Really, was it necessary for Jamie to attract a whole parade of Aurélia’s neighbors on his way to propose to her?) But it’s hard to resist Colin Firth’s broken Portuguese — or that soaring Love Actually score, played to greatest effect here.\n\n3. David and Natalie\n\nPrime Minister David and his household staffer Natalie first bond, in a quiet unspoken British way, over her tendency to curse and his taste for chocolate biscuits. His door-to-door search of her in “the dodgy end” of Wandsworth is very charming, of course, but his greatest moment as a romantic hero is when he stands up to Billy Bob Thornton’s sleazy American president (we get it, Love Actually, Americans have no class) at a press conference. Yes, he was talking about politics, but there’s no way he would have spoken with such passion if he hadn’t come to really hate POTUS for harassing Natalie.\n\n2. Billy Mack and Joe\n\nLove Actually knew that not all love stories had to be romantic a solid decade before Frozen hit us over the head with it! When rock & roll sellout Billy Mack figures out that his decades-old friendship with “my fat manager” Joe means more to him than anything else, he delivers perhaps the movie’s greatest confession of love: “It’s a terrible, terrible mistake, Chubs, but you turned out to be the f—ing love of my life.”\n\n1. Daniel, Sam, and Joanna\n\nThe Christmas concert! The airport sprint! Love Actually’s two greatest set pieces both belong to little Sam and his crush Joanna, and the movie’s youngest heroes would probably earn the top spot on the merit of those scenes alone. But what makes their sweet love story really soar above the rest is how it’s colored by the loss of Sam’s mother at the beginning of the film, and how much Sam’s pursuit of Joanna, assisted by his also-grieving stepfather Daniel, is about embracing and overcoming the “total agony” of love of all kinds. Finally, as additional confirmation that this storyline has been sprinkled with magic Christmas dust, Claudia Schiffer shows up at the end to date Daniel! Love actually is all around.", "images": ["https://ew.com/thmb/4Yng7P-Em4Vlv7FA1nXfY9KA8n4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/jennifer-lawrence-robert-pattinson-die-my-love-101725-1-c12aba74bccd4a25993351e6b3869c28.jpg", "https://ew.com/thmb/k3zkOqYyJpLfx2DPVscElm50t7g=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/best-classic-movies-on-Netflix-111025-17117aab25af49a88371894223a8bd9b.jpg", "https://ew.com/thmb/LUw9IPBfltx24ob5Xi1GOzWaFMg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Joanna-Bacon-00-071625-1a3d54f4ad474ae0be1d0580695f5e28.jpg", "https://ew.com/thmb/omFZsRW04adJ2THwcWKpJzMdfks=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Leonardo-DiCaprio-Birthday-111124-07-6e819e987b474799b69f6822b7e7013e.jpg", "https://ew.com/thmb/gzGpKNZ4ynQ1YiKryODpE5Fokiw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/love-actualy-2000-ef94bfb040564bca92a55bd523d5de0b.jpg", "https://ew.com/thmb/pv3mu2azfeVKbg1k4e4tzqb5_pk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/it-ends-with-us-Blake-Lively-Justin-Baldoni-Jenny-Slate-Hasan-Minhaj-11725-576bbd2e608b4cc58b52913889a3ff3f.jpg", "https://ew.com/thmb/DL0u1HHIO1lSQGXf1uIS0WVFy7s=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/rosamund-pike-pierce-brosnan-Bond-20-2002-111325-a8f218e8be444d4d9efff402b4e2e857.jpg", "https://ew.com/thmb/UBVFSKC_-9k7H6kS4eUHAKQxyio=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Taylor-Swift-100125-3118c7eee30640b8a002a735b36d9b24.jpg", "https://ew.com/thmb/F7OJNUuX_F_YZMizc2pqNpoCYnM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/tsitp-091825-9546b833b2c44737b55b5c2ace7cf2c8.jpg", "https://ew.com/thmb/L-_bFrAVv70397YZZ-ggpS3qdR4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Finding-Mr-Christmas-Season-2-101725-2-67a8d35f08eb4e81b74475e914c49a3d.jpg", "https://ew.com/thmb/P_0hNxz4-ZIK_rySpapVD44pKWE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/tsitp-belly-conrad-091725-fab38826f9744b628d827a0ff1af2299.jpg", "https://ew.com/thmb/y_xgKpxOVV0TGrMBDYlYymI0A-o=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/sci-fi-hulu-090424-18f1f090981f41b7ae7860275ef46dcd.jpg", "https://ew.com/thmb/8PRRRPceu4hppatOl6OmXYZcoNM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/glenn-powell-brisket-071724-75f8fec736024ccb8156ca6a9064763d.jpg", "https://ew.com/thmb/jSQcErg6_NMNuHVirNe0xxCjQmo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Reindeer_3x2-22d667b5cbb449a6a1b69e123637f15f.jpg", "https://ew.com/thmb/1pOz4YAtIk8TqBTU99G988eZdMI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Everybody-Loves-Raymond-100125-1-9bd5ecec072a4ae4a7e60406b8774a3c.jpg", "https://ew.com/thmb/KznLnONStkZzb5a-sfec2vdsncc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/jude-law-the-holiday-091725-2e4b6e947b724d209be5b05d738cad8f.jpg", "https://ew.com/thmb/dgQ_4gkUXJm6clgTEPUPNvVgOq8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/The-Notebook-ryan-gosling-rachel-mcadams-020625-74474a6391fb4a7082f6b8b3e3bef260.jpg"], "top_img": "https://ew.com/thmb/gzGpKNZ4ynQ1YiKryODpE5Fokiw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/love-actualy-2000-ef94bfb040564bca92a55bd523d5de0b.jpg", "keywords": [], "authors": ["Mary Sollosi Is The Former Assistant Features Editor At", "Ew'S Editorial Guidelines", "Mike Miller", "Ryan Coleman", "Kristen Baldwin", "Raechal Shewfelt", "Janey Tracey", "Sydney Bucksbaum", "Debbie Day", "Emlyn Travis"], "canonical_link": "https://ew.com/movies/2017/12/20/love-actually-story-ranking/", "title": "A definitive ranking of all the love stories in Love Actually", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "From worst to best, actually", "parsely-section": "Movies", "parsely-tags": "Movie Genres,Movie Reviews,Romance,Entertainment Weekly,Movies,Love Actually,Blockbuster Films & Major Movie Releases", "article": {"section": "EW", "author": "https://www.facebook.com/entertainmentweekly"}, "og": {"type": "article", "site_name": "EW.com", "url": "https://ew.com/movies/2017/12/20/love-actually-story-ranking/", "title": "A definitive ranking of all the love stories in 'Love Actually'", "description": "From worst to best, actually", "image": "https://ew.com/thmb/gzGpKNZ4ynQ1YiKryODpE5Fokiw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/love-actualy-2000-ef94bfb040564bca92a55bd523d5de0b.jpg"}, "twitter": {"card": "summary_large_image", "site": "@EW", "title": "A definitive ranking of all the love stories in 'Love Actually'", "description": "From worst to best, actually", "image": "https://ew.com/thmb/gzGpKNZ4ynQ1YiKryODpE5Fokiw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/love-actualy-2000-ef94bfb040564bca92a55bd523d5de0b.jpg"}, "vf": {"url": "https://ew.com/movies/2017/12/20/love-actually-story-ranking/"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.102.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.102.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.102.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.102.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.102.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": 1513746000.0, "source": "https://ew.com", "summary": ""}