{"url": "https://en.wikipedia.org/wiki/A_Christmas_Prince", "text": "2017 film by Alex Zamm\n\nA Christmas Prince is a 2017 Christmas romantic comedy film directed by Alex Zamm, written by Karen Schaler and Nathan Atkins, and stars Rose McIver, Ben Lamb, Tom Knight, Sarah Douglas, Daniel Fathers, Alice Krige, and Tahirah Sharif.\n\nThe film was released on Netflix on November 17, 2017.[1][2] Two sequels, A Christmas Prince: The Royal Wedding, &, A Christmas Prince: The Royal Baby came out a year apart.\n\nPlot [ edit ]\n\nJust before Christmas, aspiring young American magazine journalist Amber Moore gets sent to the country of Aldovia for a press conference given by Prince Richard, who got set to take the throne following his father's recent death. He is famed as an irresponsible playboy and may also abdicate.\n\nAmber hopes this will finally be her big break as she heads to the royal family's palace for the press conference. Amber refuses to leave with the press pack when the prince fails to appear. Deciding to snoop around, she is mistaken for young Princess Emily's new American tutor, Martha Anderson. Amber plays along and assumes Martha's identity to investigate the rumors of abdication.\n\nEmily, who has spina bifida, tries to prank Amber into quitting but warms up to her after she does not treat her like an invalid. As Emily's tutor, Amber meets the royal family, including Richard, who she realizes is the man she fought with earlier at the Aldovian airport over a taxi.\n\nAmber becomes attracted to Richard after discovering he is compassionate and responsible, although reluctant to take the throne. During this time, Emily tells her Richard's envious cousin Simon is next in line for the throne, which he desperately wants. Emily herself is ineligible to ascend, being a female. Amber also encounters Richard's beautiful, seductive ex-girlfriend, Sofia, who Richard suspects is only interested in him for his future title.\n\nEmily discovers Amber's identity, but promises not to expose her if she writes a story showing how excellent Prince Richard is. She follows him on horseback through the woods in pursuit of her story. When Amber's horse throws her and a wolf nearly attacks her, Richard saves her.\n\nRichard takes Amber to Richard's father's old hunting cabin, where Richard reveals that they argued about his desire to renounce the throne the last time he saw his father alive. Richard then shows Amber a mysterious poem written by his father, and they almost kiss, but are interrupted by the horses neighing.\n\nAfter Richard leaves to check on the animals, Amber searches the late king's desk and discovers a hidden compartment holding documents proving that the Prince was secretly adopted. She hides the documents and takes them back to the palace.\n\nAmber is reluctant to reveal the truth as it would deeply hurt Richard, but decides to tell him during a walk. He interrupts her confession with a kiss, and she realizes she is in love with him. Simultaneously, a suspicious Sofia and Simon search Amber's room and discover her true identity and Richard's adoption certificate.\n\nAt the Christmas Eve Ball, as Richard prepares to be crowned, Sofia reveals his adoption certificate and Amber's true identity. Simon asserts himself as next in line for the throne as Richard storms off and rebuffs Amber's apologies, and she tearfully leaves the palace.\n\nLater, Helena reveals to Richard that she adopted him once told she could not have children. Apologizing for not telling him sooner, she insists she and the king consider him their son. Richard asks about Emily, and Helena tells him that she is, in fact, their biological child, their \"miracle\". Richard forgives his mother for her deception and promises not to let Simon win the throne so easily.\n\nSimon marries Sofia, but learns Helena must preside over the crowning ceremony. Meanwhile, Amber suspects that she can prove that Richard is the rightful king based on clues from his father's poem. Allowed back into the palace, Amber finds a secret proclamation declaring Richard the rightful heir hidden in a Christmas ornament made by the late king. Amber takes the document to the official chamber where Simon is crowned and arrives in time for Richard to be crowned instead; she quietly leaves Aldovia afterward.\n\nBack in NYC, Amber's magazine refuses to publish her story on Richard, calling it a \"puff piece\". In anger, she quits, deciding to blog about the faithful Richard instead. It becomes popular and eventually gains his attention. Amber is spending New Year's Eve at her father's diner when Richard surprises her. He professes his love to Amber and proposes, which she happily accepts.\n\nCast [ edit ]\n\nProduction [ edit ]\n\nFilming [ edit ]\n\nThe trilogy was filmed at Peleș Castle, Sinaia, Romania. Other filming locations in Romania included Bragadiru Palace, the Cotroceni National Museum, the Carol Davila Medicine, and Pharmacy University, all of which are located in Bucharest, the Romanian capital, which is about two hours from Sinaia.[3]\n\nRelease [ edit ]\n\nThe film was released on Netflix on November 17, 2017.[4]\n\nReception [ edit ]\n\nA Christmas Prince received generally mixed reviews from critics and audiences. On review aggregator website Rotten Tomatoes, the film holds an approval rating of 73% based on 11 reviews, and an average rating of 6/10. The site's critical consensus reads, \"Predictable but sweet, A Christmas Prince is pleasant enough to pass the time during the holiday season.\"[5]\n\nBridget Read of Vogue reviewed the film, writing that the film's story is \"a grab bag of various made-for-TV plot elements.\" She noted that the writers \"bots is that it very clearly derives its narrative from a few romantic comedies and royal-theme movies,\" and that \"basically different scripts ripped up and stapled together.\"[6] Kathryn VanArendonk of Vulture called the film \"unnecessarily cruel.\"[7] Renee Schonfeld of Common Sense Media gave the film a rate of three stars out of five, calling it \"sumptuous movie with gorgeous sets, costumes, and cinematography, and lovely holiday music.\"[8]\n\nSequels [ edit ]\n\nOn May 18, 2018, a sequel was announced, titled A Christmas Prince: The Royal Wedding. It was released on Netflix on November 30, 2018.[9]\n\nA third film, titled A Christmas Prince: The Royal Baby, was announced by Netflix on March 11, 2019, for a December 5, 2019, release.[10]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/en/9/91/A_Christmas_Prince.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/9/91/A_Christmas_Prince.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/A_Christmas_Prince", "title": "A Christmas Prince", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/9/91/A_Christmas_Prince.png", "width": 825, "height": 1200}, "title": "A Christmas Prince - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}