{"url": "https://en.wikipedia.org/wiki/Richard_Simmons", "text": "American fitness personality (1948–2024)\n\nMilton Teagle \"Richard\" Simmons (July 12, 1948 – July 13, 2024) was an American fitness instructor and television personality. He was a promoter of weight-loss programs, most prominently through his television show, The Richard Simmons Show and later the Sweatin' to the Oldies line of aerobics videos.\n\nSimmons began his weight-loss career by opening his gym Slimmons in Beverly Hills, California, catering to the overweight in a supportive atmosphere, and he became widely known through exposure on television and through the popularity of his consumer products. He was often parodied and was a frequent guest on late-night television and radio talk shows, such as the Late Show with David Letterman and The Howard Stern Show.\n\nHe continued to promote health and exercise through a decades-long career, and later broadened his activities to include political activism, such as in 2008 in support of a bill mandating non-competitive physical education in public schools as a part of the No Child Left Behind Act.[1][2]\n\nBy March 2016, after his not having made any major public appearances since February 2014, speculation and expressions of concern about his well-being began to surface in the media.[3][4] Both Simmons and his publicist have said the concerns were unwarranted and that he simply chose to be less publicly visible.[5]\n\nDuring the 2020 COVID-19 pandemic, Simmons began uploading archive content to his YouTube channel (recorded before his decision to withdraw from public life) to help people stay fit at home.[6]\n\nEarly life [ edit ]\n\nMilton Teagle Simmons was born in New Orleans, Louisiana, on July 12, 1948, to Leonard Douglas Simmons Sr. and Shirley May (née Satin). He was born to \"show-business parents\" and raised in the French Quarter of New Orleans.[7] Simmons had an older brother.[8] Their father was raised Methodist and worked as a master of ceremonies and later in thrift stores while their mother was Russian Jewish and was a traveling fan dancer and later a store cosmetics saleswoman.[9]\n\nSimmons became a practicing Catholic in adolescence and attended Cor Jesu High School.[10][11][12] He attended the University of Louisiana at Lafayette before graduating from Florida State University with a Bachelor of Arts in art.[13]\n\nHe became obese during his early childhood and adolescence.[14] He began to overeat and became overweight as early as the age of 4 and by the age of 5, he knew it was perceived negatively.[14] At the age of 15, he weighed 182 pounds (83 kg). As a young man, he considered being a priest.[15][16] As a young art student, he appeared among the \"freak show\" characters in the Fellini films Satyricon (1968) and The Clowns (1970) and he eventually reached a peak of 268 lb (122 kg).[17][14][18]\n\nIn an interview with the Tampa Bay Times, Simmons explained he adopted the name Richard after an uncle who paid for his college tuition.[16] His first job in New Orleans was as a child, selling pralines at Leah's Pralines.[15]\n\nCareer [ edit ]\n\nFitness career [ edit ]\n\nSimmons in 1982\n\nUpon moving to Los Angeles in the 1970s, Simmons worked as the maître d'hôtel at Derek's, a restaurant in Beverly Hills.[9]: 157 He developed an interest in fitness. Exercise studios of the day favored the already fit customer, so little help was available for those who needed to gain fitness from an otherwise unhealthy state. He established gyms and his interest in fitness helped him lose 123 lb (56 kg).[19][20]\n\nHe opened his own exercise studio, originally called The Anatomy Asylum, where emphasis was placed on healthy eating in proper portions and enjoyable exercise in a supportive atmosphere. The business originally included a salad bar restaurant called Ruffage, a pun on the word roughage (dietary fiber); though it was eventually removed as the focus of The Anatomy Asylum shifted solely to exercise.[21] Later renamed Slimmons, the establishment continued operations in Beverly Hills and Simmons taught motivational classes and aerobics throughout the week.[22] His success led to a recurring role in General Hospital portraying himself over a four-year period and then to his own television series The Richard Simmons Show, which aired from 1980 to 1984 and earned him multiple Emmy awards.[23] Rising interest in aerobics during the 1980s led to the popularization of Simmons' line of fitness videos, particularly his Sweatin' to the Oldies series, which became one of the most popular videos during the decade.[24]\n\nSimmons in 2009\n\nIn 2010, Simmons stated he had maintained his own 100+ pound (45 kg) weight loss for 42 years, had been helping others lose weight for 35 years, and that in the course of his fitness career, had helped humanity lose approximately 12 million pounds (5.5 million kg).[25]\n\nIn media [ edit ]\n\nSimmons began to receive media attention due to the success of his health club that started with him on Real People (where he was shown at work).[26] He introduced customers whom he had helped to lose weight. He later had guest roles on Battlestars, Super Password, Win, Lose or Draw,[27] Body Language,[28] Match Game (ABC), Hollywood Squares (syndicated),[29] and Nickelodeon's Figure It Out.[30] Positive viewer reactions landed Simmons a recurring role as himself in General Hospital over a four-year period.[31] This, as well as being in shopping malls (where he taught exercise classes), led to further media attention. In the early 1980s, Simmons hosted two shows — Slim Cookin and the Emmy Award-winning talk show The Richard Simmons Show,[23][32] in which he focused on personal health, fitness, exercise, and healthy cooking.\n\nSimmons in 2011\n\nSimmons portrayed himself in the Amazing Stories episode \"Remote Control Man\".[33] Simmons was a guest on The Rosie O'Donnell Show on November 18, 1997, together with Celine Dion.[34] He was a frequent guest on The Howard Stern Show, his last appearance coming in 2013.[35]\n\nSimmons was also a guest on Late Night with David Letterman (NBC)[26] and the Late Show with David Letterman (CBS), but on November 22, 2000, they had a falling-out after an incident on that night's show. Simmons (while dressed as a turkey) grabbed Letterman as if to hug or kiss him, to which Letterman responded by spraying Simmons with a fire extinguisher, which made Simmons have a severe asthma attack.[36] Simmons did not appear on the Letterman show for six years, finally returning on November 29, 2006. During that time, Letterman once again set Simmons up for a prank; while Simmons was demonstrating a steamer branded with his name, Letterman insisted on placing a tray under the steamer which Simmons did not believe belonged there. When Simmons turned the steamer on, something in the tray exploded and caught fire, sending Simmons running for his life. Despite the scare, Simmons took the incident in fairly good nature, even joking that he \"felt like Michael Jackson\" (referring to a mishap where Jackson's hair was accidentally set on fire by pyrotechnics while filming a Pepsi commercial).[37]\n\nIn 1998, Simmons provided the voice of Boone in Rudolph the Red-Nosed Reindeer: The Movie.[38] He featured as himself on numerous television series, including Whose Line Is It Anyway?, CHiPs, Saturday Night Live, The Larry Sanders Show, and in the Arrested Development episode \"Bringing Up Buster\". In 1999, he hosted the short-lived television series DreamMaker.[39] On January 14, 2000, Simmons and Tribune Entertainment parted ways, following low ratings.[40] In 2007, he filmed the PBS pledge-drive special Love Yourself and Win.[41]\n\nHe also featured in television advertisements for Sprint, Yoplait, and Herbal Essence shampoos. In late 2007, he was in a This is SportsCenter commercial on ESPN as the show's \"conditioning coach\".[42] In the Rocko's Modern Life episode \"No Pain, No Gain\", Simmons voiced an exercise trainer bearing his animated likeness, leading a class filled with large, anthropomorphic animals.[43]\n\nSimmons appeared multiple times on The Glenn Beck Program on HLN.[44] From 2006 to 2008, he hosted a radio show on Sirius Stars (Sirius Satellite Radio channel 102) titled Lighten Up with Richard Simmons.[45][46] He provided the voice of Coach Salmons, a recurring character modeled after his own likeness, for Fish Hooks.[19] In 2011, Simmons starred in \"Fit to Fly with Richard Simmons\", an Air New Zealand inflight safety briefing video modeled after his aerobic workouts.[47] He is featured heavily in the film clip of \"Hawker Boat\" by Tobacco, taken from the album Fucked Up Friends.[48]\n\nDuring the COVID-19 pandemic in 2020, Simmons' YouTube channel was updated with archival exercise videos (recorded before his decision to withdraw from public life) to help people stay fit at home. A spokesperson said the move was motivated by an \"overwhelming request for Richard to return in some way as a comfort\" and added that Simmons was \"very touched by the outreach\".[49]\n\nIn January 2024, an as-yet untitled biopic about Simmons, starring Pauly Shore, was announced, titled The Court Jester. Simmons stated on Facebook, \"I have never given my permission for this movie.\"[50] In April, he said he was discussing giving his approval for a different biopic.[51]\n\nPersonal life [ edit ]\n\nReligion [ edit ]\n\nSimmons became Catholic as a teenager, having first asked his parents if he could convert as a younger child. He attended church with his brother Lenny for years until being baptized and confirmed on the same day.[52] He considered the priesthood for a time, but decided against it.\n\nHe lapsed as an older adult, but returned to the faith in his later years.[53]\n\nPersonality [ edit ]\n\nSimmons in 2007\n\nSimmons used his energetic, loud, and motivational demeanor to encourage people to lose weight. His high energy level was always featured in his workout videos. His trademark attire was tank tops decorated with Swarovski crystals and candy-striped Dolphin shorts.[16][54]\n\nSimmons interacted at a personal level with fans and people using his products. This began by personally answering fan mail he received as a cast member of General Hospital. As late as 2008, he personally answered emails and letters and made hundreds of phone calls each week to those who would seek his help.[55]\n\nHe claimed to have few friends, saying, \"I don't have a lot to offer to one person. I have a lot to offer to a lot of people.\" Aside from his six Dalmatians and two maids, Simmons lived alone in Beverly Hills, California.[55] Although his persona inspired speculation about his sexual orientation, he never publicly addressed the subject.[56][57][58][59][60] After his death in 2024, Jane Fonda stated she had last seen him for lunch at the Polo Lounge, when he was accompanied by his new boyfriend.[61]\n\nIn a 2012 interview with Men's Health, he was quoted:\n\nWhen the king gets depressed, he doesn't call for his wife or the cook. He turns to the little man with the pointed hat and says to the court jester \"make me laugh\". And I am that court jester.\n\n— Richard Simmons, Men's Health[62]\n\nAssault charge [ edit ]\n\nIn March 2004, Simmons was cited for misdemeanor assault after he slapped Christopher Farney in the face at the Phoenix Sky Harbor International Airport. The slap was in response to Farney making a remark poking fun at Simmons’ exercise videos. In May 2004, a judge dismissed the assault charge after Simmons reached a private settlement with Farney.[63]\n\nHurricane Katrina response [ edit ]\n\nIn September 2005, Simmons appeared on Entertainment Tonight[64] to discuss the effects of Hurricane Katrina on his family in his hometown of New Orleans, and his involvement in aiding those affected by the hurricane. On August 29, 2006, Simmons was on Your World with Neil Cavuto while making a return visit to New Orleans one year after the flooding, a visit he repeated on March 2, 2007, now talking about his recent trip to Washington, D.C., to promote and raise awareness about the Strengthening Physical Education Act of 2007 (H.R. 1224).[65][66][67]\n\nRetirement [ edit ]\n\nAfter 2014, Simmons did not make any major public appearances. He stopped appearing in public altogether on February 15 of that year. In March 2016, speculation began that he was being held hostage by his housekeeper.[3][4] In response, on March 14, Simmons gave an audio interview on The Today Show, denying the rumors and assuring the public that he is fine.[5] In November 2016, the Simmons fitness gym closed without any public announcement from Simmons.[68] In February 2017, the podcast Missing Richard Simmons launched, investigating why Simmons left public life so suddenly.[69]\n\nIn March the same year, Los Angeles Police Department detectives visited Simmons' home to conduct a welfare check, issuing a statement that Simmons is \"perfectly fine\" and that \"right now he is doing what he wants to do and it is his business\".[70] On April 19, following a hospitalization for severe indigestion, Simmons made his first public comment in over a year, posting on Facebook a photo of himself and the message \"I'm not 'missing', just a little under the weather\".[71] However, the picture that was included in the post was from as far back as 2013, leading to speculation that the person who posted the message might not actually have been Simmons.[72][73][74]\n\nIn May 2017, he sued the National Enquirer, Radar Online, and American Media, Inc. for libel and false claims that he was undergoing gender reassignment.[75] In September 2017, Simmons lost the lawsuit and was ordered to pay the defendants' attorney's fees. The judge ruled, \"because courts have long held that a misidentification of certain immutable characteristics do not naturally tend to injure one's reputation, even if there is sizeable portion of the population who hold prejudices against those characteristics, misidentification of a person as transgender is not actionable defamation absent special damages\".[76]\n\nIn June 2018, he sued a Los Angeles private investigator, claiming that more than a year earlier, the investigator had placed a tracking device on the only vehicle Simmons used for transportation, noting that such tracking is in violation of California law.[77] In July 2018, Simmons amended the suit, alleging the investigator had been hired by In Touch Weekly and prosecutors filed a criminal complaint.[78] In May 2020, a California appellate court upheld a trial judge's decision allowing Simmons' lawsuit to move forward.[79]\n\nIn August 2022, in response to continued rumors and a TMZ documentary What Really Happened to Richard Simmons claiming that knee problems forced Simmons out of public life, Simmons issued a statement to the New York Post that he is \"happy, healthy, and living the life he has chosen to live\".[80]\n\nTeresa Reveles, who worked as Simmons' house manager and was often erroneously referred to as his housekeeper in news reports, said that Simmons retired due to failing knees which required surgery and made him unable to have the flexibility necessary to teach his fitness classes. He did not want to continue working if he was not able to fully perform up to expectations. Simmons was also nervous about aging, claiming to her that he did not \"look that beautiful anymore\". Even after he retreated from the public spotlight, he still frequently traveled outside of his house locally in disguises and continued to motivate fans by calling and emailing them as much as he could.[81] He also would donate money to charities he supported, including the Kiwanis Children's Fund.[82]\n\nTwo days before his death, Simmons had conducted his first interview in a significant amount of time with People. On his birthday, Simmons stated that he is grateful to be alive for another day and would spend his birthday helping people. Instead of cake, he stated he would have a candle on a zucchini, stating he is a vegetarian. He added, \"Okay, fine. Maybe one Pepperidge Farm Milano cookie. But just one. Sure, once in a while, have dessert.\"[83] He was also calling and motivating people again and writing a Broadway musical about his life in collaboration with composer Patrick Leonard, as well as planning for a longer comeback interview with Diane Sawyer.[81]\n\nIllness and death [ edit ]\n\nHealth [ edit ]\n\nIn March 2024, Simmons issued a statement clarifying that he was not dying after a Facebook post he wrote encouraging people to \"embrace every day\" drew public concern. He also stated that he no longer had a manager or publicist, and that he had not given permission for a biopic of him.[84] That same month, Simmons revealed that he had been diagnosed with skin cancer, located underneath his right eye. Simmons later stated on his Twitter account that the cancer diagnosis occurred \"so many years ago\" and he decided to speak out about it to encourage people to go to the doctor if they see anything unusual on their body.[85][86]\n\nDeath [ edit ]\n\nOn July 13, 2024, Simmons died at his home in Los Angeles at the age of 76.[87] He had suffered a fall at his home in his bathroom two days prior and refused to seek medical attention until the following morning out of a desire to spend his 76th birthday at home.[81] He went to bed and the next day, he posted on social media that he never got so many birthday wishes. He was found by his long-time house manager Teresa Reveles the next day.[88][89] Police said that his death appeared to be from natural causes, though the investigation is ongoing;[90][91] Reveles suspected that Simmons had suffered a heart attack in his sleep.[81] He was buried at Pierce Brothers Westwood Village Memorial Park and Mortuary, dressed in his trademark fitness outfit.[92] On August 21, in a report given to Simmons' brother, the Los Angeles County Coroner's office confirmed that Simmons had died of complications of the previous day's fall, among others, and that heart disease was a contributing factor; no unprescribed drugs had been in his system when he died.[93]\n\nOn July 20, one week after his death, Simmons' team shared what would be his final social media post, a paraphrase of lyrics from the song \"Fly Me to the Moon\".[94] On October 5, a memorial mass for Simmons was held at St. Louis Cathedral in New Orleans, Louisiana.[95]\n\nPrint and other media [ edit ]\n\nBooks [ edit ]\n\nAudio [ edit ]\n\nAnalog compact cassette [ edit ]\n\nCompact disc [ edit ]\n\nRichard Picks the Hits, Volume 1\n\nRichard Picks the Hits, Volume 2\n\nCountry Cardio\n\nOh Happy Day [ 116 ]\n\nFitness Fiesta\n\nWicked Workout [ 117 ]\n\nBig Screen Burn\n\nShimmy into Shape\n\nIn the Mood to Lose\n\nClassical Chillout\n\nVinyl record [ edit ]\n\nSingles [ edit ]\n\nThis Time (Elektra Records, 45 rpm 1983)\n\nDigital compact cassette [ edit ]\n\nColors of Your Life (single tape) (Goodtimes Entertainment, BASF 90 Min. 1998)\n\nVisual media [ edit ]\n\nDVD [ edit ]\n\nVideo cassette [ edit ]\n\nEveryday with Richard Simmons\n\nThe Stomach Formula\n\nGet Started\n\nReach for Fitness – A Special Video of Exercises for the Physically Challenged [ 126 ]\n\nDeal Your Way to Health\n\nRichard Simmons and the Silver Foxes\n\nSweatin' to the Oldies\n\nSweatin' to the Oldies 2\n\nSweatin' to the Oldies 3 [ 127 ]\n\nSweatin' to the Oldies 4\n\nDay By Day (Volumes 1–12)\n\n(Volumes 1–12) Pump and Sweat\n\nStep and Sweat\n\nTone and Sweat\n\nStretchin' to the Classics\n\nDance Your Pants Off!\n\nTonin' Uptown\n\nTonin' Downtown\n\nGroovin' In The House\n\nThe Ab Formula\n\nNo Ifs Ands or Butts\n\nLove to Stretch\n\nBlast Off\n\nBroadway Sweat [ 128 ]\n\nTone Up On Broadway\n\nBroadway Blast Off\n\nPlatinum Sweat\n\nSit Tight\n\nLatin Blast Off\n\nMega Mix Blast Off\n\nMega Mix 2 Blast Off\n\nDisco Blast Off\n\n60's Blast Off\n\n80's Blast Off\n\nBlast and Tone\n\nFarewell to Fat [ 129 ]\n\nDisco Sweat\n\nSudar Mucho\n\nYouTube [ edit ]\n\nFit to Fly\n\nHair Do (Official Music Video) [ 130 ]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/60px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Richard_talking_with_a_fan_April_2009.jpg/250px-Richard_talking_with_a_fan_April_2009.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Richard_Simmons_%281982_Elektra_Press_photo%29.jpg/250px-Richard_Simmons_%281982_Elektra_Press_photo%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Richard_Simmons_1998.jpg/250px-Richard_Simmons_1998.jpg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Richard_Simmons_2007-08-15.jpg/250px-Richard_Simmons_2007-08-15.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/d/dd/Richard_Simmons_1998.jpg", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/62/Richard_Simmons_signature.svg/250px-Richard_Simmons_signature.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/RichardSimmonsSept2011.jpg/250px-RichardSimmonsSept2011.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Richard_Simmons_1998.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Richard_Simmons", "title": "Richard Simmons", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Richard_Simmons_1998.jpg", "width": 1022, "height": 1200}, "title": "Richard Simmons - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}