{"url": "https://www.cosmopolitan.com/entertainment/a10365189/botched-lip-injections-cant-close-mouth/", "text": "7 min read\n\nThe Cosmopolitan office is buzzing over Lindsay Lohan. From her adorable new romcom Our Little Secret to filming Freakier Friday, Lindsay’s been busy. Yet somehow despite doing all the things, she looks legit better than ever. In November, I hopped on a Zoom call with Lindsay to chat about her partnership with Nexxus and I haven’t stopped thinking about how warm and lovely she was...and how freaking incredible her skin looked ever since.\n\nAs a skin-obsessed beauty editor, I need to know exactly what she has done and what she’s using on her face. Lindsay has staunchly claimed that her ~glow-up~ is thanks to a combo of skincare and noninvasive treatments. In her Cosmo cover story from 2022, she did share that she’s a big fan of IPL facial lasers for clearer, brighter skin and Morpheus8, a microneedling and radiofrequency treatment that can help tighten and firm your skin by encouraging collagen production. She recently told Allure that she simply takes good care of her skin with and .\n\nLast month, Michael Lohan, Lindsay’s father, denied that she had any plastic surgery but confirmed that she’s done Botox, chemical peels, and fillers. Then this week, Lindsay shared a snap to her IG Stories with her dermatologist Radmila Lukian, MD, founder of Lucia Clinic in Dubai, seemingly doubling down on the ~it’s just the light stuff~ vibes.\n\nI know the types of results you can get from microneedling, lasers, and Botox. I’ve done them myself. But in Lindsay’s case I know, deep in my soul, there's gotta be more to the story, and I had to get to the bottom of it. Ya know, so I can hopefully, one day, look as good as her. So I asked experts, specifically plastic surgeons, to weigh in on what they think Lindsay has done (and hasn’t done) to get her face and skin looking this damn good. Here’s what they had to say.\n\nGetty Images\n\nLifestyle habits\n\nThis feels kinda basic, but its importance can’t be understated: Many of the changes in Lindsay’s appearance can be attributed to changes in her life. “Sobriety, a healthy lifestyle, and fluctuations in weight can all have significant effects on the appearance of your skin and face,” says plastic surgeon David Shafer, MD, owner of the Shafer Clinic in New York, NY. For starters, “a sober lifestyle can mean skin that’s less puffy and inflamed and more hydrated and clear,” he explains, because alcohol can cause dryness, dullness, dark circles, and inflammation. Similarly, a change in your eating habits—that is, swapping for a high-antioxidant diet with lots of fruits and vegetables and protein—plus an increase in physical activity and better sleep hygiene can all improve your skin’s appearance, Dr. Shafer adds. Another thing: Losing weight can, obviously, make your face appear slimmer, resulting in a stronger, more pronounced jawline, which many have noticed on Lindsay.\n\nAnother huge impact on her skin potentially? Pregnancy. Smoking, alcohol, and excess sun exposure would also stop during pregnancy, which would not only limit potential skin damage but also possibly even improve any existing spots and signs of dullness. There’s also the fact that “you can’t get Botox while pregnant, and it’s not recommended to have fillers or many other treatments except for facials,” says plastic surgeon Gabriel Chiu, MD. “Prior to pregnancy, her face showed signs of filler fatigue as well as filler migration in her cheeks, which started to go away and then really improved from July to September of this year,\" he adds. He theorizes she dissolved excess fillers, then utilized thermal treatments like RF microneedling (like Morpheus8, Vivace, Secret, and Genius) or Thermage to help tighten and firm her skin instead.\n\nPlastic surgery\n\nLindsay hasn’t confirmed she’s gone under the knife, but many surgeons believe she’s had a few surgical things done based on their expertise. “Her results cannot be achieved by any singular treatment,” Dr. Chiu says. Based on the photos he’s seen, Dr. Chiu believes Lindsay “likely had upper and lower blepharoplasty with fat transfer to her under-eyes to account for the changes around her eyes.” For the uninitiated, an upper and lower blepharoplasty is eyelid surgery that can help sagging and/or puffy under-eyes and lids.\n\n“Prior, she had puffiness and heaviness from excess fat pads of her upper eyelids and lower eyelid skin excess causing creases, along with a depression in the inner corner of her eyes,” he adds. “This could also have been improved with platelet-rich fibrin injections or under-eye filler and resurfacing—along with sobriety—but correction of the excess medial fat pads of the upper eyes is likely surgical in nature,” he explains. Iiiiiinteresting.\n\nA rhinoplasty could also be the reason for the lift in the tip of her nose, says Dr. Chiu. Filler and makeup can potentially help do this, but this wouldn’t be a permanent option, unlike a surgical rhinoplasty. “There is a technique that I use in rhinoplasty that will will shorten the nose, lift the central portion between the nostrils, and shorten the space between your nose and lips to provide more upper lip show, all of which are in Lindsay’s improved look,” he adds.\n\nAs much as we talk about traditional plastic surgery, though, part of Lindsay’s look could also point to a change in her teeth. Dr. Chiu says that veneers can actually help push out your lips a bit and make them look fuller. The more ya know!\n\nGetty Images\n\nBotox and fillers\n\nContrary to Dr. Chiu (and pretty much the entirely of the internet at this point), plastic surgeon Ari Hoschander, MD, doesn’t believe Lindsay’s had any facial plastic surgery done. “I have looked at older photos of her throughout the years, and I don’t see much actual structural change in her face,” he notes. Instead, he points to some cheek filler and neuromodulators, like Botox, Jeuveau, Daxxify, or Xeomin. “What is very clear to me is that she did not have surgery—a rhinoplasty, brow lift, eyelid surgery, or facelift— which everyone else seems to think she had,” he says. Instead, he thinks people are speculating based on paparazzi photos in unflattering lights. (Relatable—if you compared my thirst traps to the rogue front-camera selfies I accidentally took, you’d think I had $300,000 worth of plastic surgery too.)\n\nSome people assume Lindsay’s had a facelift, but plastic surgeon Dhivya Srinivasa , MD, believes she had a lot of her previous filler dissolved instead. Then she potentially used RF microneedling to lift and tighten her skin before restarting with fillers. This could help create a much more seamless look—and potentially even mimic the look of a facelift depending on where the new fillers were placed.\n\n“There appears to be very slight differences in her eyebrows and eyelids,” says Dr. Hoschander, “but these are extremely minor and likely due to either Botox or how she grooms her eyebrows now versus then.”\n\nNoninvasive cosmetic treatments\n\nDr. Hoschander, however, does credit the improvement in Lindsay’s skin to in-office skin treatments, like Fraxel, Erbium, and/or CO2, as well as RF microneedling. “When it is hard to place a finger on exactly what someone has done, the results are likely from having well-planned treatment combinations in an appropriate sequence that allows for proper healing and recovery for maximal benefits,” Dr. Chiu says.\n\nHer jawline also could be a result of a skin-tightening treatment, like Renuvion, which uses “plasma energy applied to the tissues under the skin along the jawline to improve definition and create slimness,” says Dr. Chiu. But she never really had any face sagging or jowls, though, says Dr. Hoschander. “She definitely lost a little weight and that could contribute to the slimmer, more structured appearance of her face,” he says.\n\nMakeup and hair\n\nThis one also feels kinda basic, but it’s true: Seemingly simple changes can have a strong effect on your appearance, says plastic surgeon Samuel Lin, MD. “It is amazing what a makeup artist can do with subtle changes,” he says. Plastic surgeon Gabriel Chiu, MD, explains that lightening her hair color and changing her part to the center “has shortened the appearance of her forehead as well as help brighten her look to make her appear more youthful and vibrant,” he says. Her lip color is also slightly overlined, which shortens the distance from the bottom of her nose to her lips.\n\n“There are some who think she may have had a lip lift, which would accomplish the same look, but I don’t believe she did,” he adds. “Her makeup has generally been applied more professionally with lighter tones, which brightens up her face and has helped to give her a smoother, even texture,” he notes.\n\n\n\nFinal thoughts:\n\nObviously, we won’t know exactly what Lindsay’s done until she tells us herself. (Hi, Linds, I will gladly write this exposé.) But for now, I can tell you that really good skincare, unfortunately, doesn’t yield results like this. If that were the case, every beauty editor would be aging in reverse too.\n\n“I always say my biggest goal when working with patients is for people to notice how good and refreshed they look but have a hard time putting a finger on why,” says Dr. Shafer. “Tweaks that have subtle yet impactful results are how you know it’s good work done by a professional,” he adds. This is how you get a natural look—“enhancing your features rather than altering them drastically,” he adds. And that, folks, is exactly what we’re all after.\n\nMeet the experts:", "images": ["https://hips.hearstapps.com/hmg-prod/images/gifts-for-men-6915098585eb3.jpg?crop=0.5023255813953489xw:1xh;center,top&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=currentColor&id=link-out-embed", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/rover/profile_photos/8d38ce26-d6c7-4224-99cd-d611f71a5dab_1742417637.file?fill=1:1&resize=120:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523ffffff&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523000000&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/cosmopolitan/static/images/logos/network-logo.722abed.svg?primary=%2523ffffff", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/globe-simple-regular.e7f303c.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523ffffff&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/cosmopolitan/static/images/logos/logo.eca17dd.svg?primary=%2523000000", "https://hips.hearstapps.com/hmg-prod/images/emily-in-paris-n-s4-e7-00-01-58-23r-68ff9a9255f36.jpg?crop=0.619xw:0.929xh;0.0255xw,0.0485xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/lift-brows-botox-011-1-6584c0b203ee9.jpg?crop=0.502xw:1.00xh;0.286xw,0&resize=300:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/cos120125madelineargy-2-68ffa7277b3cf.jpg?crop=1.00xw:0.738xh;0,0.110xh&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/bookmark-simple-regular.9d9d56b.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523000000&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/clock-regular.b2f2888.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2185479136-675b0fd1280d2.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/chin-filler-660e9cc726ae1.png?crop=0.495xw:1.00xh;0.505xw,0&resize=300:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/teenage-girl-gifts-691508e0c20bd.jpg?crop=0.5023255813953489xw:1xh;center,top&resize=360:*", "https://hips.hearstapps.com/vidthumb/images/llfinal-1666714500.jpg?crop=1.00xw:1.00xh;0,0", "https://hips.hearstapps.com/hmg-prod/images/ultherapy-review-lb-6759e5334684d.jpg?crop=0.505xw:1.00xh;0,0&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1618294960-6802a668c5f91.png?crop=0.502xw:1.00xh;0.301xw,0&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/envelope-simple-regular.91a0134.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2185536596-675a18f523562.jpg?crop=1.00xw:0.764xh;0,0.129xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2185538962-675b100b2d9f5.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/ultherapy-review-lb-6759e5334684d.jpg?crop=0.505xw:1.00xh;0,0&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/untitled-design-2024-09-18t103848-899-66eae66b47c2d.png?crop=0.330xw:0.660xh;0.335xw,0.0929xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2185536596-675a18f523562.jpg?crop=0.6555xw:1xh;center,top&resize=640:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg", "https://hips.hearstapps.com/hmg-prod/images/bader-shammas-and-lindsay-lohan-attend-the-los-angeles-news-photo-1753798039.pjpeg?crop=1.00xw:0.752xh;0,0.0325xh&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/bader-shammas-and-lindsay-lohan-attend-the-premiere-of-news-photo-1753800225.pjpeg?crop=0.627xw:0.940xh;0.208xw,0.0601xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/salmon-sperm-injections-68cc34f74b78b.jpg?crop=0.495xw:1.00xh;0.505xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/my-life-with-the-walter-boys-season-2-688a37caea3bd.png?crop=0.668xw:1.00xh;0.332xw,0&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/cosmopolitan/static/images/logos/logo.eca17dd.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/568669905-1390146615809557-6973902315575227966-n-68fa6145198d0.jpg?crop=1xw:0.6417100694444444xh;center,top&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/headphones-regular.117021e.svg?primary=%2523ffffff", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523000000&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/caret-left-regular.5546078.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523000000&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/x-regular.e414d97.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/saved.ad81f1a.svg?primary=%2523ffffff"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2185536596-675a18f523562.jpg?crop=1.00xw:0.764xh;0,0.129xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.cosmopolitan.com/style-beauty/beauty/a63162072/lindsay-lohan-plastic-surgery/", "title": "Why Does Lindsay Lohan Look So Good? We Asked Plastic Surgeons", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Why Does Lindsay Lohan Look So Good? We Asked Plastic Surgeons", "description": "Lindsay Lohan is seemingly aging in reverse. Is it Botox and fillers, or a host of plastic surgery? We asked plastic surgeons their thoughts on her glow-up.", "theme-color": "#000000", "og": {"site_name": "Cosmopolitan", "title": "Lindsay Lohan Looks Amazing—We Asked Plastic Surgeons the Likely Reasons Why", "description": "Asking for (not) a friend.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2185536596-675a18f523562.jpg?crop=1.00xw:0.764xh;0,0.129xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.cosmopolitan.com/style-beauty/beauty/a63162072/lindsay-lohan-plastic-surgery/", "type": "article"}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "opinion": "false", "section": "Beauty", "modified_time": "2024-12-13T15:23:00Z", "published_time": "2024-12-13T15:23:00Z"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "parsely-metadata": "{\"socialHeadline\":\"Lindsay Lohan Looks Amazing—We Asked Plastic Surgeons the Likely Reasons Why\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2185536596-675a18f523562.jpg?crop=0.657xw:1.00xh;0.172xw,0&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2185536596-675a18f523562.jpg?crop=1.00xw:0.764xh;0,0.129xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2185536596-675a18f523562.jpg?crop=0.657xw:1.00xh;0.172xw,0", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2185536596-675a18f523562.jpg?crop=1.00xw:0.764xh;0,0.129xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "timely", "sailthru.excerpt": "The Cosmopolitan office is buzzing over Lindsay Lohan. From her adorable new romcom Our Little Secret to filming Freakier Friday, Lindsay’s been busy. Yet somehow despite doing all the things, she looks legit better than ever. In November, I hopped on a Zoom call with Lindsay to chat about her", "sailthru.tags": "style-beauty,Beauty & Style,beauty,Beauty,cosmetic-procedures,Cosmetic Procedures,skin-care,Your Best Skin Ever: Skin Care Treatments and Products,Cosmopolitan-US", "sailthru.date": "2024-12-13 15:23:00", "sailthru.socialtitle": "Lindsay Lohan Looks Amazing—We Asked Plastic Surgeons the Likely Reasons Why", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1734103380.0, "source": "https://www.cosmopolitan.com", "summary": ""}