{"url": "www.thehollywoodgossip.com/2018/03/gwen-stefani-and-blake-shelton-is-it-over/", "text": "Reading Time: 4 minutes\n\nJust weeks ago, fans were wondering if and when Gwen Stefani and Blake Shelton would have a baby.\n\nNow, they’re wondering if the two will ever see each other again.\n\nA grim report now says that Gwen and Blake have broken up.\n\nThe idea of Blake Shelton being the one to break up with Gwen sounds absurd, but that’s what InTouch Weekly‘s report says.\n\nEven though she’s more famous and more successful outside of the Country music crowd, she fell for her The Voice costar.\n\nUntil recently, it had looked like he was just as crazy about her.\n\n\"Gwen doesn’t know what hit her,\" a source reveals. \"She’s heartbroken.\"\n\nOf course she is — Blake is only, what, her third serious relationship that she’s ever had in her life? This is a woman who loves with her whole heart.\n\n\"She continues to send him loving social media support from LA while he’s been out on the road.\"\n\nWhich explains her continued social media posts about missing him while he’s on his tour.\n\n\"But Blake has drastically slowed regular communication with her.\"\n\nThe report goes on to claim Blake’s motives for breaking up with his better half, which really drives home the rumor that Blake is high on fame and money after his time on The Voice.\n\n\"Blake’s through with Gwen’s neediness and all the drama: her demanding, critical ex-husband and her jealousy of him and other women.\"\n\nRemember, it was rumored that Blake was cheating with Chloe Kohanski.\n\nOf course she couldn’t resist People’s \"Sexiest Man Alive.\" (I’m kidding)\n\n\"She told him she didn’t want to spend her life in fear of her famous partner cheating on her.\"\n\nAfter what Gwen went through with Gavin, that’s a very understandable fear. Especially since it was rumored that Blake cheated on Miranda just as much as she did on him.\n\nHere is how the split allegedly went down.\n\n\"Blake told Gwen that he was going to be doing the latter part of the monthlong Country Freaks Tour without her.\"\n\nThat’s not a good sign.\n\n\"Gwen was so used to accompanying him on tour, she was upended.\"\n\nPlenty of partners would enjoy a break like that, but not Gwen and not under these circumstances.\n\n\"After their nastiest argument ever, Blake took off without even saying goodbye.\"\n\nThat sounds really grim.\n\n\"It was a real breaking point in the relationship.\"\n\nTo top it all off, this same report claims that Blake is connecting with his ex.\n\n\"Miranda reached out to Blake via text.\"\n\nA couple of weeks ago, the world heard a report that Miranda Lambert and Anderson East have broken up.\n\nWhich would mean that Miranda is now single and ready to mingle … or fall back on old habits.\n\n\"Ultimately, they buried the hatchet and have been supporting each other through their latest troubled relationships.\"\n\nThat doesn’t mean that things are necessarily turning intimate again, though.\n\n\"They’ve become close friends and allies over the past month or so.\"\n\nSo, despite their nasty breakup a few years back, now they’re becoming friends again.\n\n\"They have developed into close confidantes and are sharing intimate details of their lives.\"\n\n(Getty)\n\nTo be clear, it isn’t 100% certain that Miranda Lambert and Anderson East have split … though they haven’t exactly jumped at the chance to shout from the rooftops that the report of their breakup is false.\n\nSimilarly, right now, we just have speculation from social media and this illuminating report on Gwen and Blake.\n\nBut until anything is announced, reports that the two had a fight aren’t the same thing as confirmation of a breakup.\n\nPerhaps, as they go their separate ways, cooler heads will prevail.\n\nIt is nice to imagine the kind of music that Gwen Stefani might make if she’s inspired by a split from Blake Shelton, whom many have seen as little more than a bloated parasite clinging to Gwen’s underbelly to siphon away a bit of her fame.\n\nBut the two may reconcile as if they never had a fight in the first place, folks. It happens all of the time.", "images": ["https://cdn.thehollywoodgossip.com/uploads/2025/11/2552_D085_00216R-H-2025-80x80.webp", "http://cdn.thehollywoodgossip.com/uploads/2017/06/gwen-stefani-in-black-with-blake-shelton-672x1024.jpg", "https://cdn.thehollywoodgossip.com/uploads/2025/11/GettyImages-1154615733-80x80.jpg", "https://cdn.thehollywoodgossip.com/uploads/2022/02/thg-logo.png", "http://www.thehollywoodgossip.com/wp-content/uploads/2018/03/gwen-stefani-and-blake-shelton-well-wishes.png", "https://cdn.thehollywoodgossip.com/uploads/2025/11/GettyImages-2159895990-6-80x80.jpg", "https://cdn.thehollywoodgossip.com/uploads/2025/11/GettyImages-2247300883-80x80.jpg", "https://cdn.thehollywoodgossip.com/uploads/2024/12/1206_annaduggar_header-80x80.png", "https://cdn.thehollywoodgossip.com/uploads/2025/11/1119_janellebrown_angelamoody_header-80x80.png", "https://cdn.thehollywoodgossip.com/uploads/2025/11/69023040a27d084abe99b818-80x80.webp", "https://cdn.thehollywoodgossip.com/uploads/2025/11/1119_tekashi6ix9ine_header-80x80.jpg"], "top_img": "http://www.thehollywoodgossip.com/wp-content/uploads/2018/03/gwen-stefani-and-blake-shelton-well-wishes.png", "keywords": [], "authors": ["Simon Delott"], "canonical_link": "https://www.thehollywoodgossip.com/2018/03/gwen-stefani-and-blake-shelton-is-it-over/", "title": "Gwen Stefani: Dumped By Blake Shelton! Blindsided and Heartbroken!", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Gwen Stefani: Dumped By Blake Shelton! Blindsided and Heartbroken!", "description": "Just weeks ago, fans were wondering if and when Gwen Stefani and Blake Shelton would have a baby. Now, they're wondering if the two will ever see each other ag", "url": "https://www.thehollywoodgossip.com/2018/03/gwen-stefani-and-blake-shelton-is-it-over/", "site_name": "The Hollywood Gossip", "updated_time": "2022-04-26T17:28:21+00:00", "image": "http://www.thehollywoodgossip.com/wp-content/uploads/2018/03/gwen-stefani-and-blake-shelton-well-wishes.png", "article": {"published_time": "2018-03-15 14:40:31", "modified_time": "2022-04-26 17:28:21"}}, "article": {"published_time": "2018-03-15T14:40:31+00:00", "modified_time": "2022-04-26T17:28:21+00:00"}, "twitter": {"card": "summary", "title": "Gwen Stefani: Dumped By Blake Shelton! Blindsided and Heartbroken!", "description": "Just weeks ago, fans were wondering if and when Gwen Stefani and Blake Shelton would have a baby. Now, they're wondering if the two will ever see each other ag", "image": "http://www.thehollywoodgossip.com/wp-content/uploads/2018/03/gwen-stefani-and-blake-shelton-well-wishes.png", "label1": "Written by", "data1": "Simon Delott", "label2": "Est. reading time", "data2": "4 minutes"}, "author": "Simon Delott", "generator": "WordPress 6.8.3", "theme-color": "#000000", "msapplication-TileImage": "https://cdn.thehollywoodgossip.com/uploads/2024/07/cropped-THG-LOGO-270x270.jpg"}, "movies": [], "publish_date": 1521124831.0, "source": "http://www.thehollywoodgossip.com", "summary": ""}