{"url": "https://www.dga.org/News/PressReleases/2018/180109-70th-DGA-Awards-Host-and-Chair.aspx", "text": "January 09, 2018\n\nLos Angeles – Directors Guild of America President Thomas Schlamme today announced that Judd Apatow will host the 70th Annual DGA Awards, and Don Mischer has been appointed Awards Chair for the event, which will take place on February 3, 2018 at the Beverly Hilton in Beverly Hills.\n\n“What makes the DGA Awards so special for directors is the opportunity to connect with, and be recognized by, their peers – and this year, we’ll have two powerhouse directors tailoring the evening’s celebration of filmmaking with that in mind,” said Schlamme. “We are thrilled to welcome Judd as our host. Beyond his impact as a multi-hyphenate force in our industry, Judd’s comedic chops, social consciousness, and lifelong love of film and television underlie his unique ability to entertain with heart – whether behind the scenes or in front of a live audience. And when it comes to expertise in live events, specials, and awards, nothing compares to the great Don Mischer. To our Guild’s fortune, Don has graciously agreed to add Awards Chair to his growing list of service and contributions to our Guild.”\n\nJudd Apatow\n\nJudd Apatow is considered one of the most sought-after comedy minds in the business. He has been closely associated with many of the biggest comedy films and hit television shows over the last decade and a half.\n\nApatow recently filmed his upcoming Netflix standup special, The Return, at the Just for Laughs Comedy Festival in Montreal. The Return premiered on December 12 and marks Judd’s first solo standup special and literal return to his first love of performing standup which is how he began his career 25 years ago when he performed on HBO’s Young Comedians special in 1992.\n\nApatow made his documentary directorial debut with the 2016 Emmy Award-nominated ESPN Films 30 for 30 feature, Doc & Darryl, which chronicled the successes and scandals of New York Mets legends Dwight “Doc” Gooden and Darryl Strawberry. He followed that up with the forthcoming co-directed HBO documentary, May It Last, about folk rock icons the Avett Brothers premiering on HBO later this month.\n\nContinuing down the documentarian path, Apatow is in post-production on a documentary on Garry Shandling who served as Judd’s mentor and father figure. The two-part documentary will air over two nights in late March on HBO.\n\nAdditionally, Apatow currently serves as co-executive producer of the television series Crashing, which returns to HBO for its second season in January 2018. He is also the co-executive producer of Netflix’s Love which returns for its third season in March 2018. Lastly, Apatow co-executive produced the multi-award-winning HBO series Girls which wrapped its final season earlier this year.\n\nOn the film side, Apatow recently produced the 2017 romantic comedy, The Big Sick, starring Kumail Nanjiani, Holly Hunter and Ray Romano. The dark horse box office success earned a 97% on Rotten Tomatoes which was the highest rated film of the summer.\n\nApatow has written and directed such films as The 40-Year-Old Virgin, Knocked Up, and Trainwreck. He has also produced Superbad, Bridesmaids, Pineapple Express, and both Anchorman films, to name but a few.\n\nApatow has been a DGA member for two decades.\n\nDon Mischer\n\nDon Mischer is an internationally acclaimed producer and director of television and live events. He has been honored with fifteen Emmy Awards, a record 10 Directors Guild of America Awards for Outstanding Directorial Achievement, two NAACP Image Awards, a Peabody Award for excellence in broadcasting, and the 2012 Norman Lear Achievement Award in Television from the Producers Guild of America.\n\nAs President of Don Mischer Productions, his credits (as producer/director) include the Opening Ceremonies of the XIX Winter Olympic Games (Salt Lake City) and the Centennial Olympic Games (Atlanta), We Are One: The Obama Inaugural Celebration at the Lincoln Memorial, The Kennedy Center Honors, the 100th Anniversary of Carnegie Hall, the 2004 Democratic National Convention, and Hong Kong’s handover to the People’s Republic of China.\n\nMischer produced and directed Super Bowl Halftime shows with Michael Jackson, Paul McCartney, The Rolling Stones, Prince, Tom Petty, and Bruce Springsteen. Other recent projects include producing and/or directing the 83rd, 84th, and 85th Academy Awards, multiple Emmy Awards, and on the occasion of the historic opening of the Smithsonian’s National Museum of African American History and Culture, the highly acclaimed ABC special Taking the Stage: African American Music and Stories That Changed America.\n\nThe many performers with whom Mischer has worked include: Beyoncé, Bono, Prince, Rihanna, Bruce Springsteen, James Taylor, Taylor Swift, Stevie Wonder, Adele, Justin Timberlake, Barbra Streisand, Willie Nelson, and Will Smith.\n\nHe has served two terms on the Directors Guild of America National Board, two terms on the Board of Governors of the National Academy of Television Arts and Sciences, received the Governors Award from the National Association of Choreographers, and is a member of the Event Industry Hall of Fame and the Producers Guild of America.\n\nMischer holds a Master of Arts degree from the University of Texas in Austin.\n\nThe Feature Film and First-Time Feature Film nominees for the 70th Annual DGA Awards will be announced on Thursday, January 11, 2018. All Television, Commercial and Documentary\n\nnominees will be announced on Wednesday, January 10, 2018.\n\n\n\nTo apply for a press credential to cover the DGA Awards,\n\nplease go to DGA.org/Awards to download an application.\n\n\n\nBMW is the Exclusive Automotive Sponsor of the 70th Annual DGA Awards.", "images": ["https://edge.sitecorecloud.io/directorsguf4d4-dga2c79-dgaprod1615-f6e3/media/Images/Landscape-Images/Awards/70thAwards2018/DGA70thAwardsHeroV02.jpg?h=450&iar=0&w=800", "https://edge.sitecorecloud.io/directorsguf4d4-dga2c79-dgaprod1615-f6e3/media/Images/ADS-300x600/2020/200917MPTF300x600.png?h=600&iar=0&w=300", "https://edge.sitecorecloud.io/directorsguf4d4-dga2c79-dgaprod1615-f6e3/media/Images/Social-Media-Logos/iconTwitter.png?h=21&iar=0&w=57", "https://edge.sitecorecloud.io/directorsguf4d4-dga2c79-dgaprod1615-f6e3/media/Images/ADS-300x600/2025/251118NetflixAHouseofDynamite300x600.jpg?h=600&iar=0&w=300", "https://edge.sitecorecloud.io/directorsguf4d4-dga2c79-dgaprod1615-f6e3/media/Images/Landscape-Images/Events-Images/2018/Feb2018/Feb2018Awardspix/JuddApatow.jpg", "https://edge.sitecorecloud.io/directorsguf4d4-dga2c79-dgaprod1615-f6e3/media/Images/Landscape-Images/Awards/70thAwards2018/DGA70thAwardsHeroSpecialAwardsWilliamsTanker.jpg?h=450&iar=0&w=800", "https://edge.sitecorecloud.io/directorsguf4d4-dga2c79-dgaprod1615-f6e3/media/Images/Social-Media-Logos/iconFacebook.png?h=21&iar=0&w=57", "https://edge.sitecorecloud.io/directorsguf4d4-dga2c79-dgaprod1615-f6e3/media/Images/Landscape-Images/Awards/70thAwards2018/DGA70thAwardsApatowMischer.jpg?h=450&iar=0&w=800", "https://edge.sitecorecloud.io/directorsguf4d4-dga2c79-dgaprod1615-f6e3/media/Images/Landscape-Images/Press/2017-Releases/MichaelApted2017hero.jpg?h=450&iar=0&w=800", "https://edge.sitecorecloud.io/directorsguf4d4-dga2c79-dgaprod1615-f6e3/media/Images/Landscape-Images/Events-Images/2018/Feb2018/Feb2018Awardspix/Mischer.jpg", "https://edge.sitecorecloud.io/directorsguf4d4-dga2c79-dgaprod1615-f6e3/media/Project/DGA/Images/dga_emblem_cp_xsm.png"], "top_img": "https://edge.sitecorecloud.io/directorsguf4d4-dga2c79-dgaprod1615-f6e3/media/Images/Landscape-Images/Awards/70thAwards2018/DGA70thAwardsApatowMischer.jpg?h=450&iar=0&w=800", "keywords": [], "authors": [], "canonical_link": "", "title": "70th Annual DGA Awards: Judd Apatow to Host, Don Mischer to Chair", "meta_data": {"viewport": "width=device-width", "title": "70th Annual DGA Awards: Judd Apatow to Host, Don Mischer to Chair", "og": {"title": "70th Annual DGA Awards: Judd Apatow to Host, Don Mischer to Chair", "description": "DGA President Thomas Schlamme announces that Judd Apatow will host the 70th Annual DGA Awards and Don Mischer has been appointed Awards Chair for the event.", "image": "https://edge.sitecorecloud.io/directorsguf4d4-dga2c79-dgaprod1615-f6e3/media/Images/Landscape-Images/Awards/70thAwards2018/DGA70thAwardsApatowMischer.jpg?h=450&iar=0&w=800", "type": "website", "Url": "/News/PressReleases/2018/180109-70th-DGA-Awards-Host-and-Chair"}, "description": "DGA President Thomas Schlamme announces that Judd Apatow will host the 70th Annual DGA Awards and Don Mischer has been appointed Awards Chair for the event.", "article": {"published_time": "2018-01-09T15:00:00Z"}, "page_type": "Press Release", "facets": "[{\"facetName\":\"pagetype\",\"facetValues\":[\"Press Release\"],\"indexable\":true}]", "geo.position": "undefined, undefined", "next-head-count": 17}, "movies": [], "publish_date": null, "source": "https://www.dga.org", "summary": ""}