{"url": "http://abcnews.go.com/ThisWeek/week-transcript-hillary-clinton/story?id=12959396&page=2", "text": "CAIRO, Feb 20, 2011 — -- (BEGIN VIDEO CLIP)\n\nAMANPOUR (voice-over): This week, people power making history, arevolt in the Midwest and a revolution sweeping across the MiddleEast. State of siege. We take you to Wisconsin, where firefightersand teachers have stormed the capitol, lawmakers are in hiding, andthe Tea Party is fighting back. Bob Woodruff with the real story,inside the battle in the heartland.\n\n(UNKNOWN): We won in November. Elections have consequences.\n\nAMANPOUR: Our roundtable will ask, will this spread around therest of the country? As cuts get deep, who should bear the pain?\n\nAnd freedom fever, the very latest from the Middle East, wherebloody protests force another key ally to do the unthinkable. Myexclusive with Secretary of State Hillary Clinton and the youngInternet revolutionaries who tell us how they engineered the fall ofAmerica's staunchest ally with American tech, not tanks. \"This Week,\"\"People Power,\" starts right now.\n\n(END VIDEO CLIP)\n\nAMANPOUR: Good morning.\n\nPopulist frustration is boiling over this week, as we said, notjust in the Middle East, but in the middle of this country, as well.A budget war threatens to shut down the federal government, and nowunion workers fighting back are tying state and local governments inknots. Ground zero: Madison, Wisconsin.\n\nABC's Bob Woodruff is there, and he joins me now with the verylatest. Good morning, Bob.\n\nWOODRUFF: Good morning, Christiane.\n\nAMANPOUR: So there have been six days of protests there so far,state employees fighting the proposed cuts to their benefits and theirunion's right to bargain, Democratic legislators hiding in order tostop a vote. Bob, what's driving the people that you've met there?Does it look like there's an end in sight?\n\nWOODRUFF: Well, that's a good question. You know, this has beenjust a huge event. The weather is now starting to change today. Theythink there might be about six inches of snow today. Hopefully that'sgoing to come to an end, as well.\n\nBut, really, the numbers are really impressive. You know, theynow estimate that about 68,000 people were here yesterday. Most ofthem were teacher union members. But also then, for the first timeyesterday, the Tea Party supporters.\n\n(BEGIN VIDEOTAPE)\n\nWOODRUFF (voice-over): Is this what the future of Americanpolitics looks like?\n\n(UNKNOWN): I don't think we've ever had anything like this.\n\n(UNKNOWN): This is unprecedented for -- for our times. WOODRUFF: In Madison, the capitol building is still swellingwith protesters, a near total takeover. Tens of thousands in thestreets, too, determined to thwart a bill they see as a frontalassault on public labor unions.\n\n(UNKNOWN): What's disgusting?\n\n(UNKNOWN): Union busting.\n\n(UNKNOWN): What's disgusting?\n\n(UNKNOWN): Union busting.\n\n(UNKNOWN): How do you get better teachable moments than this?If you don't like what somebody's doing, we don't just sit back and --and watch. We don't wait four years for the next budget or electioncycle. We tell them right away we don't like it.\n\nWOODRUFF: The protesters are furious with Governor ScottWalker's plan to drastically curtail the bargaining power of theirunions. Outraged public workers and their allies have dominated thescene here since last Monday. But for the first time this weekend,they had company.\n\n(on-screen): Really what this is, is a tale of two rallies.You've got the one side, the union on this side, and then you come onover here to the Tea Party. So on one side, you've got kill the bill.On the other side, you've got pass the bill.\n\n(voice-over): The crowd supporting the governor, smaller in sizebut not in conviction, came from around the state to deliver a clearmessage.\n\n(UNKNOWN): But we're not going to negotiate. Why would wenegotiate? We won -- we won in November. Elections haveconsequences. That's -- it's as simple as that. I can't make it anyplainer. We won; they lost. That's what's going to happen. The billis going to be passed.\n\nWOODRUFF: We met Lou Debraccio (ph) early in the morning, 110miles away from the capitol, as he and a clutch of fellow Tea Partysupporters boarded a bus bound for Madison. Debraccio (ph) is a smallgovernment conservative, eager for his voice to be heard in thedebate.\n\nDEBRACCIO (ph): I want to -- I want to see the state moveforward. And in order to do that, many of us in the private sectorhave had to sacrifice and I think necessary that -- that we all sharethat sacrifice. It does hit home for me. My wife is a teacher. It'sgoing to cost our family money. But it's the right thing to do, so Isupport it.\n\nWOODRUFF: While Debraccio (ph) was heading to town, chemistryteacher Anthony Schnell (ph) and his family were deep in their morningroutine. J. SCHNELL: The immediate effect to our family is that we willmake about $500 a month less on Anthony's paycheck. And we are justhanging on by our fingernails right now. My husband loves being ateacher. He's tried other things, and he loves education, he loveskids, he loves working with families. And for him to say I think Imight have to leave this again is just heart-breaking, because it'shis passion.\n\nA. SCHNELL: This isn't about the money. It's not about thebenefits. Of course, that's going to hit us, and we don't like that.But it's really about having input in the classes, you know, havinginput with the school board, having input with what happens.\n\nWOODRUFF: Anthony's been coming to the protests all week, butthe Tea Party's presence weighed on his mind as he approached thecapitol.\n\nA. SCHNELL: I'm a little nervous about today. I just don't knowwhat's going happen.\n\nWOODRUFF: Once inside the rotunda, he lost the butterflies andbegan working the crowd.\n\nA. SCHNELL: Is this a budget fight?\n\nCROWD: No.\n\nA. SCHNELL: Is this just about money?\n\nCROWD: No.\n\nA. SCHNELL: Is this about us doing the best in our classrooms?\n\nCROWD: Yes.\n\nWOODRUFF (on-screen): They're all saying this is huge. And ifit happens here, it's going to happen everywhere in the rest of thecountry.\n\n(voice-over): In the rotunda, there is now a flavor of a '60s-era sit-in. In fact, some told us it's the biggest demonstrationthey've seen here since the Vietnam War.\n\n(on-screen): You doing this every day until this thing -- thisbill is killed?\n\nOWEN: I think this is going to happen every day until this billis killed. I don't think there's any way that the people in thisbuilding are going to give up the right to collective bargaining.\n\n(UNKNOWN): I'm here because this is wrong, that this sort ofshotgun legislation, ramming it through, it's the wrong way to dealwith problems. This isn't about me. It's about trying to do the bestwe can for society and communities.\n\nWOODRUFF: Do you think it's going to be peaceful? (UNKNOWN): I think so. I think the tensions are going to behigh, but I think it's going to stay civil.\n\nWOODRUFF: But what if this...\n\n(UNKNOWN): Well, wait. Not civil, it's going to stay peaceful.\n\nWOODRUFF: Lou Debraccio (ph) got an earful from the pro-laborcrowd as he made his way to the Tea Party demonstration.\n\nDEBRACCIO (ph): I'm not going to change any of their minds.They're committed enough to drive here and make signs, just likethey're not going to change my mind. It's not about that. So there'slimited return in talking to them.\n\nWOODRUFF: Even some families are divided. Julie Hansen (ph)supports the governor. Her 13-year-old daughter does not.\n\nHANSEN (ph): My 13-year-old is for collective bargaining. Shewent to school yesterday, and the teachers spoke to her about it.\n\nWOODRUFF: Think she believes it and -- or just because of theone lesson from the teacher?\n\nHANSEN (ph): We had a pretty adamant discussion.\n\nWOODRUFF (voice-over): Jeff Strobel (ph) is here with the TeaParty. His brother-in-law is on the other side.\n\nSTROBEL (ph): And my brother-in-law is a union worker. We had abig e-mail exchange on Facebook last night. The best thing is, it wascivil, it was, you know, courteous. But we kind of tried to educateeach other, but we're never going to agree. He's on this side; I'm onthis side. But we can talk about it.\n\nWOODRUFF (on-screen): Still going to have a peaceful Christmasdinner together?\n\nSTROBEL (ph): As long as there's beer there, we'll be peaceful.\n\nWOODRUFF (voice-over): Late Saturday, the governor issued astatement, turning down a compromise offer from the unions. And sohere in Wisconsin, the standoff continues, for now.\n\nFor \"This Week,\" I'm Bob Woodruff in Madison, Wisconsin.\n\n(END VIDEOTAPE)\n\nAMANPOUR: And so is Wisconsin just the beginning? States fromcoast to coast are grappling with this fundamental question: Indesperate economic times, which Americans should sacrifice the most?I'll put that to the roundtable coming up next.\n\nAnd later, revolt in the Middle East engulfs more of America'sstrongest allies, with the Obama administration struggling to stayahead of events. I'll get an exclusive progress report from Secretaryof State Hillary Clinton.\n\n(COMMERCIAL BREAK)\n\n(BEGIN VIDEO CLIP)\n\nOBAMA: Some of what I've heard coming out of Wisconsin, whereyou're just making it harder for public employees to collectivelybargain generally, seems like more of an assault on unions. And Ithink it's very important for us to understand that public employees,they're our neighbors, they're our friends. They make a lot ofsacrifices and make a big contribution. And I think it's importantnot to vilify them or to suggest that somehow all these budgetproblems are due to public employees.\n\n(END VIDEO CLIP)\n\nAMANPOUR: President Obama igniting a national conversation aboutwhich Americans should feel the pain of the budget axe. With pitchedbattles going on right now here in Washington and in statehouses fromFlorida to Wisconsin to California, with me now, our roundtable,George Will, Congressman Steve Southerland, a Republican freshman fromFlorida, he was elected to public office for the very first time lastNovember and sent here to Washington on a mission to cut spending.Also with us, ABC senior political correspondent Jonathan Karl andpolitical strategist Donna Brazile, who calls herself a laborDemocrat.\n\nThank you all for being here. So, George, Wisconsin. Is thisthe sort of battle that we're going to see shaping up around thecountry? Is this really the sort of political and philosophicaldebate that's going on right now about what these cuts are going tomean?\n\nWILL: It would have been even if the president hadn'tintervened. But in the span of three days, Christiane, he firstsubmits a budget that would increase the federal deficit and, two dayslater, he mobilizes his party, his own political machine, andorganized labor, which is an appendage to his party, to sabotageWisconsin's attempt to do what he will not do, which is deal with theinsolvency of their government. In doing so, he has set the stage for2012 by saying the Democratic Party is the party of government, notjust in having an exaggerated view of the scope and competence ofgovernment, but because its base is in public employees.\n\nAMANPOUR: So, Donna, mobilizing his troops, sabotaging theeffort to cut the budget, he did use the word \"assault,\" thepresident. Is that too much? I mean, what is going on here? BRAZILE: Well, first of all, they're entering day seven of theprotests. And my recollection is that President Obama commented on itin day four of the protest. So the fact is, is that this is agrassroots movement that had nothing to do with people or politiciansin Washington, D.C. This has everything to do with the workers therein Wisconsin and all across the country who are feeling the effects ofthese draconian budget cuts.\n\nLook, state and local workers have taken the brunt of a lot ofthese cuts. And they're willing to come to the table to talk to thegovernor to put forward more wage cuts, more pension -- pay up moremoney for their pension, more for their health care. Why won't thegovernment sit down with them? That's all they want. They want thegovernor to sit down with them, to talk about these items, but theywant their collective bargaining right, their voice at the tableremoved from the discussion.", "images": ["https://i.abcnewsfe.com/a/bf2f8ed5-a320-4d7e-b583-179abe072d92/trump-signs-shutdown-bill-20251112-ap-jh_1763006747268_hpMain_square.jpg?w=208", "https://i.abcnewsfe.com/a/009e3420-a5ae-477a-aeb3-edfa85648814/johnson-2-gty-jef-251118_1763480583977_hpMain_square.jpg?w=208", "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "https://i.abcnewsfe.com/a/7d51fd8a-8615-481e-95a7-21c498bffbd1/big-sur-missing-ht-jt-251115_1763226115730_hpMain_square.jpg?w=208", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://i.abcnewsfe.com/a/7669390d-d027-4ec7-9673-1d2eccafbbec/comey-gty-er-251117_1763404424377_hpMain_square.jpg?w=208", "https://assets-cdn.abcotvs.net/static/images/DisneyPlus.svg"], "top_img": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "keywords": [], "authors": ["Abc News"], "canonical_link": "https://abcnews.go.com/ThisWeek/week-transcript-hillary-clinton/story?id=12959396", "title": "'This Week' Transcript: Hillary Clinton", "meta_data": {"viewport": "initial-scale=1.0, user-scalable=yes", "og": {"locale": "en_US", "site_name": "ABC News", "url": "https://abcnews.go.com/ThisWeek/week-transcript-hillary-clinton/story?id=12959396", "title": "'This Week' Transcript: Hillary Clinton", "description": "Transcript of 'This Week' interview with Secretary of State Hillary Clinton", "image": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "type": "article"}, "description": "Transcript of 'This Week' interview with Secretary of State Hillary Clinton", "keywords": "this week, christiane amanpour, egypt, revolution, mideast, hillary clinton, Article, 12959396", "theme-color": "#fff", "copyright": "2025 ABC News", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "'This Week' Transcript: Hillary Clinton", "lastPublishedDate": "2011-02-20T16:30:32Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/prism-story,12959396", "ipad": "abcnewsipad://link/prism-story,12959396", "googleplay": "https://abcnews.go.com/ThisWeek/week-transcript-hillary-clinton/story?id=12959396"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "'This Week' Transcript: Hillary Clinton", "description": "Transcript of 'This Week' interview with Secretary of State Hillary Clinton", "url": "https://abcnews.go.com/ThisWeek/week-transcript-hillary-clinton/story?id=12959396", "image": {"identifier": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/prism-story,12959396", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/prism-story,12959396", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/ThisWeek/week-transcript-hillary-clinton/story?id=12959396", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/ThisWeek/week-transcript-hillary-clinton/story?id=12959396"}}}, "movies": [], "publish_date": null, "source": "http://abcnews.go.com", "summary": ""}