{"url": "https://people.com/tv/kendall-jenner-blake-griffin-everything-we-know-about-their-relationship/", "text": "It's been seven months since Kendall Jenner and Blake Griffin first stepped out together, but the A-list couple continues to keep their romance largely out of the spotlight.\n\n\"I like my private life,\" Jenner, 22, told Vogue writer Jonathan Van Meter for the magazine's April 2018 cover interview.\n\nStill, she refused in the interview to confirm that she's dating the Detroit Pistons power forward, who turned 29 on Friday. Neither commemorated the special day on social media, but that's typical for the stars, who've long preferred a low-key relationship.\n\n\"I'm happy. He's very nice,\" she told Vogue. \"I have someone being very nice to me.\"\n\nHere's a look back at their relationship, from its beginning to the present.\n\nSummer 2017\n\nIn early August, Jenner was spotted leaving the Travis Scott concert afterparty at Avenue nightclub in Los Angeles followed by Griffin. Earlier in the evening, Jenner and Griffin attended the Kendrick Lamar concert at the Staples Center, where Scott also performed. They were joined by Kris and Kylie Jenner as well as Memphis Grizzlies player Chandler Parsons and Jenner's BFF Hailey Baldwin.\n\nWeeks later, Jenner was spotted on a double date with Griffin, Baldwin and Parsons. The foursome enjoyed dinner at Craig's in Los Angeles. After the meal, Jenner and Griffin and Parsons all hopped into the same car and left together. The following evening, they were spotted at Nobu with a group of friends, and the next night the two reunited again at Soho House in Malibu.\n\nAfter stepping out with Griffin three nights in a row, a source told PEOPLE at the time that the two were having fun together, but it was still very casual.\n\n\"She's seeing Blake romantically,\" says the source. \"It's nothing serious. She has been in L.A. a lot lately, and is having fun.\"\n\n\"Work will soon take over her life again, so who knows what will happen will Blake then,\" added the source. \"She is having fun right now and that's all that matters to her. She takes her career very seriously and that's her number one priority right now.\"\n\nThough the duo began spending time with each other, Jenner was still keeping her options open, including staying in touch with rapper A$AP Rocky. \"Kendall and Blake have been hanging out quite a bit and are having a good time,\" a source told PEOPLE. \"They met in passing a few times and hit it off.\"\n\n\"She's still talking to Rocky as well,\" the source added. \"But he isn't the type to settle down or be a good boyfriend, so she's playing the field too.\"\n\nWATCH: Kendall Jenner Talks Her Sexuality, Stormi and Sitting Out Fashion Month\n\nFall 2017\n\nIn mid-October, the pair stepped out with Kylie and Scott for a special double date at Universal Studios' Halloween Horror Nights in Hollywood, an onlooker confirmed to PEOPLE. They were joined by Jordyn Woods, 20, and Baldwin.\n\n\"Kylie and Kendall were both extremely loving and cuddly with their boyfriends,\" the onlooker said. \"Both couples had their arms around each other, and the girls were really sweet with their guys. Travis and Kylie were especially cute and lovey-dovey. Kendall and Blake had a blast going through the mazes together.\"\n\nDays later, Jenner showed her public support for Griffin when she was spotted at the Los Angeles Staples Center where she watched him and the L.A. Clippers take on cross-city rivals, the L.A. Lakers. She was all smiles as she watched the game, appearing supportive as Griffin commanded the court with blocks, shots and one of his famous slam dunks. (The Clippers beat the Lakers 108-92.)\n\nThe following month, the NBA star joined Jenner's family — including parents Kris Jenner and Caitlyn Jenner and sisters Kourtney Kardashian and Kim Kardashian West — at her birthday dinner at Petit Taqueria in Los Angeles.\n\n\"Kendall was in a great mood,\" an onlooker told PEOPLE of the supermodel, who rocked $10,000 Saint Laurent boots at the bash, sponsored by Tequila Avión. \"She and Blake hung out, but they also mingled separately.\"\n\nAnother source added: \"Kendall is very happy with Blake. They started out more like friends, and then it was very casual. But it seems more serious lately. When they are not together, they keep in touch over the phone. Her family has accepted Blake. They are spending time getting to know him.\"\n\nFollowing her 22nd birthday celebration, Jenner once again cheered on Griffin courtside in early November at the Staple Center in Los Angeles, where she rocked a baggy white turtleneck, distressed denim jeans and a pair of $10,000 Saint Laurent knee-high boots.\n\nA week later, the cute couple was spotted grabbing a bite to eat at Sugarfish Sushi in Beverly Hills, and they were dressed in nearly identical outfits, according to The Daily Mail. Jenner wore a black sweatshirt with black leggings and white sneakers, while Griffin opted for a black hoodie, black pants and white sneakers. Following their meal, the couple exited the restaurant to find what appeared to be a parking ticket on the windshield of the Range Rover they arrived in earlier.\n\nAt the end of November, the pair made their red carpet debut when they both attended the premiere of The 5th Quarter in Beverly Hills, California, each posing for photographers separately. She showed off some skin with a mesh leotard — which she paired with ripped jeans, a beige blazer and peach-colored bra. The Keeping Up with the Kardashians star accessorized her look with black boots and a gold cross necklace, wearing her hair back in a loose bun to show off her smiling face and natural-looking makeup.\n\nGriffin, who wasn't by her side (she threw her arm around CEO of OBB Pictures Michael Ratner), dressed down his fitted royal blue suit with a grey crewneck sweater and white sneakers.\n\nBy early December, Jenner was cozying up in Griffin's jacket after she supported the Los Angeles Clippers power forward's stand-up comedy show for his Team Griffin Foundation in Hollywood. She joined a crew of Griffin's NBA friends for her boyfriend's performance and went for a business casual look in a lightweight Tom Ford long sleeve turtleneck, Tom Ford check wide-leg trousers and slouchy Tom Ford over-the-knee boots.\n\nJenner seemed to get a little chilly by the time she slipped out of the venue with Griffin close behind and threw her boyfriend's Ermenegildo Zegna coat (which has his name inscribed on the inside) over her shoulders. After posing for a few photos right before the show was set to start, Jenner took her seat with a group of basketball players to see Griffin take the stage. According to an onlooker at the event, \"Kendall was enthusiastic throughout Griffin's opening performance, but in the middle of a set by John Mulaney, she and several of the other basketball players went backstage.\"\n\nMichael Stewart/Getty Images; Donato Sardella/Getty Image\n\nWinter 2018\n\nFollowing the holiday season and New Year, \"Blake and Kendall have been cooling off recently, but they're not officially broken up,\" a source told PEOPLE exclusively after Griffin was spotted out and about in Los Angeles over a weekend in January with a mystery woman.\n\n\"They were definitely giving off couple vibes,\" an onlooker said of Griffin and the woman, with whom he was seen at Soho Malibu enjoying dinner and drinks with another couple. \"At one point, she put her hand in his lap, where he held her hand there for about five to 10 minutes or so.\"\n\nAdded the eyewitness, \"It was so subtle. They seemed very low-key together, and their holding hands looked entirely natural. They looked like they were really comfortable with each other, and they were definitely not calling any attention to themselves and the little bit of PDA that they shared.\"\n\nTowards the end of January, Jenner returned to her courtside seats at the Staples Center, where she appeared to be in good spirits at the event — smiling and encouraging Griffin as his team took on the Boston Celtics.\n\nHer appearance at the game came days before Griffin was traded to the Detroit Pistons — which may have taken a toll on their relationship.\n\nOn Valentine's Day, Griffin was sued for palimony by his former girlfriend Brynn Cameron — and Jenner was named in the lawsuit.\n\nIn the documents obtained by The Blast, Cameron, 31, slammed Griffin — with whom she shares two young children: son Ford Wilson and daughter Finley Elaine — alleging he \"had no problem\" trading her, \"his former fiancée and mother of his two children, for reality television star Kendall Jenner.\" Cameron, a former basketball player at the University of Southern California, said Griffin \"cared more about the glamour of dating a Hollywood celebrity than the day-to-day responsibilities of being a father and a family man,\" according to the docs.\n\nDespite the suit, a source told PEOPLE at the end of February that \"they've definitely cooled off and are taking things at a slower pace, but not because of any particular drama.\"\n\n\"He got traded and isn't local anymore, so they've grown apart a bit just because of distance,\" said the source. \"They're still involved.\"", "images": ["https://people.com/thmb/rMGlY-LRozK8jyL7w1pi7H_O7nc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/kendall-jenner9-d5dfb836f0ac4e49bcf2aa47f0d7a163.jpg", "https://people.com/thmb/6UIRVs8M7vPGvO1ErgwQpN4RsJQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/kristin-cavallari-tout-6c06282a8e794cce8a0f3a5e5ba8bb11.jpg", "https://people.com/thmb/lJHXyZKed61mgH67L8MMZHixWZs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/kendall-jenner-hailey-justin-bieber-111125-99cbc858adcb42f8af97cc593a0801e5.jpg", "https://people.com/thmb/CnnGOYzk0tFWm4Tg2kNMnHbU-wk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Gigi-Hadid-Bradley-Cooper-Eagles-111825-01-6878aecbf8794d1b8e88c36ea8ed865a.jpg", "https://people.com/thmb/JdDtMMRJJqIFYiRgVYaypBKxb6Y=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/diplo-katy-perry-justin-trudeau-110325-2070f21d8543497886ea6b27932f259e.jpg", "https://people.com/thmb/OiL6ok9Qdm81qnUljjlinh8bzxk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Eiza-Gonzalez-Grigor-Dimitrov-1-111225-ff065151eb4f4c47a86f5cb17344481d.jpg", "https://people.com/thmb/QCw54LXjZl8AUjV1bumcIgN0IBQ=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/Gigi-Hadid-Bradley-Cooper-Eagles-111825-01-6878aecbf8794d1b8e88c36ea8ed865a.jpg", "https://people.com/thmb/5mxazIgmXwF9PoYAXRtZhEWL4GM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Big-Sean-Jhene-Aiko-110625-53b45d05c1dc493bb5d9dfc8b954a674.jpg", "https://people.com/thmb/l1heBQe1jhrtwJjca13fVum5wTk=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/ekaterina-gordeeva-sergei-grinkov-ice-skating-111925-43f6a37ba62840c685a1b57f3a2569ac.jpg", "https://people.com/thmb/IhqysVBtvUOb0KqnONBe6-L6bPw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Katy-Perry-Justin-Trudeau-080225-eb3295e5a109456c884c62bb65f9ee59.jpg", "https://people.com/thmb/XGKy6h_fuvbuTE9HF1a3rx9Sfns=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Hailey-Bieber---Kendall-and-Kylie-Jenner-384-110725-d987361412f949cab010204c704c0bdc.jpg", "https://people.com/thmb/0OBPJHXyzj8tZQSSjWvzEs2nhvw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/jenna-bush-hager-minka-kelly-today-with-jenna-and-friends-111925-7e3c2b8605fe4a96a1b712c168083adb.jpg", "https://people.com/thmb/piz61bOvoDk4o_qGpauwESn_6Mo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/kendall-jenner9-d5dfb836f0ac4e49bcf2aa47f0d7a163.jpg", "https://people.com/thmb/W7pR5Ab5uQ2xdjO8WSlfEinulo0=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/Vencent-Hickerson-111925-6-f70136ab95854fed905274e761d98e0f.jpg", "https://people.com/thmb/THhvOr3hMvKGC0mIyG4UCuB9OM4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/kendall-jenner-khloe-kardashian-110525-b0c33360ee6142419bc7536bafbcbc04.jpg", "https://people.com/thmb/BVfzOJpxQ5GMICuF77ZhBvbkCug=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/jenna-bush-hager-minka-kelly-today-with-jenna-and-friends-111925-7e3c2b8605fe4a96a1b712c168083adb.jpg", "https://people.com/thmb/H1naRjoBjCQy6Owro2CtNV8Bgso=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/jason-momoa-Adria-Arjona-1-111925-c25514c5409b4afbbc56c2b16abb1f3d.jpg", "https://people.com/thmb/yuf3noyqUkJrvMFv1LJus6cJrDE=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/Big-Sean-Jhene-Aiko-110625-53b45d05c1dc493bb5d9dfc8b954a674.jpg", "https://people.com/thmb/jPdQrq4SYEJWwQlBb7zU9jpejns=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/jennifer-aniston-76th-Primetime-Emmy-Awards-2024-jim-curtis-new-york-2025-090325-19548ab6a78747f1932edf2f1e11fd25.jpg", "https://people.com/thmb/6IyhFgQT3wu0NWP0Aphz5wDFs4s=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/Kelsey-Zach-Top-Riley-Green-111925-f36976ca5eb14ae792f092060f209f93.jpg", "https://people.com/thmb/SLX76p4w-rfRc_Kk1N7oqdNk8qw=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/meghan-king-5th-Annual-Vanderpump-Dog-Foundation-Gala-2023-jim-edmonds-Busch-Stadium-2024-092425-66f95d42ed374e038155e8e43fc99358.jpg", "https://people.com/thmb/zBVVOlza9PTv8kKPXrCJSerh4BM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Fraser-Olender-matt-rogers-111725-333fdc3142e44d99b0c0cf97fd6cd8a7.jpg", "https://people.com/thmb/LoXVzEJor2Hcu-4OZxcEIeCLt3Y=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/gerry-turner-kris-jenner-110325-7b2802882e1a42f194e6e7e327d6a07b.jpg", "https://people.com/thmb/-07Pui9YVz9X2rxrwSkY6q9Qp3k=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Kendall-Jenner-30th-birthday-110325-1f321030b456428190ce567c34d1237e.jpg", "https://people.com/thmb/w5ntx7w_DIKekWNvWlraNXjeNa8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Steven-McBee-Allison-Bailey-Eklund-1-110325-b1daab2215894e9e80920464c2993a0d.jpg"], "top_img": "https://people.com/thmb/rMGlY-LRozK8jyL7w1pi7H_O7nc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/kendall-jenner9-d5dfb836f0ac4e49bcf2aa47f0d7a163.jpg", "keywords": [], "authors": ["Natalie Stone", "Natalie Stone Is A Former Staff Editor At People. She Left People In", "People Editorial Guidelines", "Skyler Caruso", "Angel Saunders", "Julia Moore", "Charna Flam", "Ingrid Vasquez", "Rachel Mcrady", "Daniela Avila"], "canonical_link": "https://people.com/tv/kendall-jenner-blake-griffin-everything-we-know-about-their-relationship/", "title": "Kendall Jenner & Blake Griffin: Inside Their Relationship", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Blake Griffin and Kendall Jenner have been dating since summer 2017", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "PEOPLE", "sailthru.author": "Natalie Stone", "sailthru.tags": "celebrity-dating", "parsely-section": "Celebrity", "parsely-tags": "People.com,Person,Entertainment,Celebrity Dating,Sports,Kendall Jenner,Blake Griffin,Celebrity,Celebrity Relationships,The Scoop", "article": {"section": "People", "author": "https://www.facebook.com/peoplemag"}, "og": {"type": "article", "site_name": "People.com", "url": "https://people.com/tv/kendall-jenner-blake-griffin-everything-we-know-about-their-relationship/", "title": "Happy 29th Birthday, Blake Griffin! Everything We Know About His Super Private Relationship with Kendall Jenner", "description": "Blake Griffin and Kendall Jenner have been dating since summer 2017", "image": "https://people.com/thmb/rMGlY-LRozK8jyL7w1pi7H_O7nc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/kendall-jenner9-d5dfb836f0ac4e49bcf2aa47f0d7a163.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Happy 29th Birthday, Blake Griffin! Everything We Know About His Super Private Relationship with Kendall Jenner", "description": "Blake Griffin and Kendall Jenner have been dating since summer 2017", "image": "https://people.com/thmb/rMGlY-LRozK8jyL7w1pi7H_O7nc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/kendall-jenner9-d5dfb836f0ac4e49bcf2aa47f0d7a163.jpg"}, "vf": {"url": "https://people.com/tv/kendall-jenner-blake-griffin-everything-we-know-about-their-relationship/"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.147.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.147.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.147.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.147.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.147.0/icons/favicons/mstile-310x150.png", "fb": {"pages": 95926963131}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}