{"url": "https://www.thewrap.com/heres-how-house-of-cards-wrote-out-kevin-spaceys-frank-underwood/", "text": "(Spoilers ahead for the final season of Netflix’s “House of Cards”)\n\n“House of Cards’” final season is here and now we know how the show wrote out Kevin Spacey’s Frank Underwood.\n\nThe short story is: He’s dead, which we’ve known for a while without knowing any other meaningful details. When the season begins, its mentioned that he died in his sleep and we see photos of Robin Wright’s Claire Underwood, now president, looking at her dead husband’s casket. But here’s what happened, as far as we know:\n\nAfter Claire declined Frank’s phone call in the Oval Office (when Season 5 ended, she was supposed to pardon him for, well, all that stuff he did over the course of the series), she mentions to the camera it was the last time they spoke. Two months later, Frank storms into the White House, furious at Claire for not giving him the pardon she promises she would. Scared, Claire locked herself in her room and found Frank dead in his bed the next morning. She told the public they were both in that bed. And, privately, she believes he was murdered.\n\nAn autopsy revealed he died from an overdose from his liver medication, which Doug Stamper (Michael Kelly) claims is something he wouldn’t do by accident.\n\nAnd, of course, it wasn’t an accident, though what exactly happened isn’t revealed until the very last scene of the series. It turned out that Frank was murdered by Doug, who mixed up the medication. Doug says that he killed Frank because Frank was going to murder Claire for not following through on her promise. As Doug explains it, “I had to protect the legacy from the man.”\n\nThe idea here throughout the season is that Doug Stamper is obsessed with protecting Frank’s reputation above all else. While everybody else is scheming nonstop and jockeying for power, Doug is constantly switching sides as he tries to figure out which side will actually prevent Frank’s name from being dragged through the mud.\n\nAnd he murdered Frank for exactly that reason. If Frank were to murder Claire there’s almost no way he would have been able to get away with it, and would thus would be remembered almost entirely for having done that. So Doug had to kill him.\n\nSpacey was fired from the Netflix series last December, following multiple accusations of sexual assault. Netflix also dropped Spacey’s film “Gore,” on famous writer Gore Vidal, in the wake of the accusations. Though he’s obviously never seen — even the photos of Clair looking at his casket don’t show his face, and Frank made audio diaries that are mentioned often but never heard — Frank Underwood’s presence as the show’s lead for the first five seasons is felt throughout the final season.\n\nIn fact, much of what Claire has to deal with as president is weathering the fallout from all the political deals Frank made while president. This is especially apparent with the Shepherds (Greg Kinnear and Diane Lane), who serve as the season’s main antagonists after Claire won’t honor deals they made with Frank.\n\nThe sixth and final season of “House of Cards” is now available on Netflix.", "images": ["https://i0.wp.com/www.thewrap.com/wp-content/uploads/2017/06/Kevin-Spacey-House-of-Cards-1-1.jpg?fit=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/07/Tim-Baysinger.png?fit=53%2C58&quality=80&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2025/10/5x4_082025_COVER.jpg?fit=240%2C300&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2019/07/Tim-Baysinger.png?resize=150%2C150&quality=80&ssl=1"], "top_img": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2017/06/Kevin-Spacey-House-of-Cards-1-1.jpg?fit=618%2C412&quality=89&ssl=1", "keywords": [], "authors": ["Tim Baysinger", "Phil Owen", "Tv Reporter", "Tim.Baysinger Thewrap.Com", "Twitter", "Phil.Owen Thewrap.Com", ".Wp-Block-Post-Author Box-Sizing Border-Box Display Flex Flex-Wrap Wrap .Wp-Block-Post-Author__Byline Font-Size Margin-Bottom Margin-Top Width", ".Wp-Block-Post-Author__Avatar Margin-Right .Wp-Block-Post-Author__Bio Font-Size Margin-Bottom .Wp-Block-Post-Author__Content Flex-Basis Flex-Grow .Wp-Block-Post-Author__Name Margin", ".Wp-Block-The-Wrap-Author-Bios__Entry Align-Items Center Display Flex Flex-Wrap Wrap Gap .Wp-Block-The-Wrap-Author-Bios__Entry .Wp-Block-The-Wrap-Author-Bios__Entry Margin-Top .Wp-Block-The-Wrap-Author-Bios__Entry-Excerpt Flex-Basis", ".Wp-Block-The-Wrap-Author-Bios Border-Top Solid"], "canonical_link": "https://www.thewrap.com/heres-how-house-of-cards-wrote-out-kevin-spaceys-frank-underwood/", "title": "Here’s How ‘House of Cards’ Wrote Out Kevin Spacey’s Frank Underwood", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Here's How 'House of Cards' Wrote Out Kevin Spacey's Frank Underwood", "description": "The final season of Netflix's first original series keeps the secret of how Frank died until the very end", "url": "https://www.thewrap.com/heres-how-house-of-cards-wrote-out-kevin-spaceys-frank-underwood/", "site_name": "TheWrap", "image": {"identifier": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2017/06/Kevin-Spacey-House-of-Cards-1-1.jpg?fit=618%2C412&quality=89&ssl=1", "width": 618, "height": 412, "type": "image/jpeg"}}, "article": {"author": "https://www.facebook.com/thewrap/", "published_time": "2018-11-02T11:51:05+00:00", "modified_time": "2018-11-02T13:58:35+00:00"}, "author": "Tim Baysinger and Phil Owen", "twitter": {"card": "summary_large_image", "creator": "@thewrap", "label1": "Written by", "data1": "Tim Baysinger and Phil Owen", "label2": "Est. reading time", "data2": "3 minutes"}, "generator": "WordPress 6.8", "article-tags": "claire-underwood, frank_underwood, house_of_cards, kevin_spacey, netflix, robin_wright", "article-section": "tv", "article-categories": "news, tv", "msapplication-TileImage": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2024/05/the_wrap_symbol_black_bkg.png?fit=270%2C270&quality=80&ssl=1"}, "movies": [], "publish_date": 1541159465.0, "source": "https://www.thewrap.com", "summary": ""}