{"url": "www.harpersbazaar.com/celebrity/latest/a19692741/ryan-reynolds-blake-lively-split-rumors-response/", "text": "Every product on this page was chosen by a Harper's BAZAAR editor. We may earn commission on some of the items you choose to buy.\n\nName a more glamorous and solid Hollywood couple than Blake Lively and Ryan Reynolds—we’ll wait.\n\nThe two first met on the set of 2011’s Green Lantern, and realized their love for one another during a double date sometime later. The friendship turned romance quickly led to marriage, and over a decade later, the couple is raising four children.\n\nBelow, look back at Lively and Reynolds’s complete relationship timeline—from their superheroic costarring gig onward.\n\nDecember 13, 2024: Ryan gives rare insight on parenting his kids with Blake.\n\nIn an interview with The Hollywood Reporter, the Deadpool star opens up about how he and Lively approach parenting to their four kids: James, Inez, Betty, and Olin.\n\n“We try to give them as normal a life as possible. I try not to impose upon them the difference in their childhood to my childhood or my wife’s childhood,” he tells the outlet. “We both grew up very working class, and I remember when they were very young, I used to say or think, like, ‘Oh God, I would never have had a gift like this when I was a kid,’ or, ‘I never would’ve had this luxury of getting takeout,’ or whatever.”\n\nHe continues, “Then I realized that that’s not really their bag of rocks to carry. They’re already very much in touch with gratitude and understanding the world enough to have a strong sense of empathy. Those are the things that I would think [would indicate] we’re doing an OK job — if our kids can empathize with other people and other kids. But yes, it’s different. When I was a kid, you would just suck it up, get out of the house and be back by sundown, which I just can’t even imagine now.”\n\nLively and Reynolds join their longtime friend Taylor Swift, as well as her beau Travis Kelce, for dinner at The Corner Store in New York City.\n\nLively, who famously styles herself , wears a sheer maroon dress with cutouts and thigh-high slits on each side, revealing the matching fishnet tights she wears underneath. She styles her look with pair of purple Valentino Soul Rockstud boots, a multicolor quilted bag, and an avant-garde silver choker. For the occasion, she wears her blonde hair in bouncy waves, pulling her hair to one side for an added dramatic effect.\n\nXNY/Star Max\n\nReynolds, for his part, wears a white button-up shirt from Bode. His top features a contrasting yellow trim, as well as a navy collar embellished with yellow stars, and he styles the shirt with a pair of matching blue trousers. On foot, he wears striped white-and-navy socks and a pair of tan suede dress shoes. Reynolds clasps his wife’s hand as they enter the restaurant, and perhaps in a nod to Swift, he finishes off his look with a handful of beaded bracelets.\n\nAugust 6, 2024: They look incredible at a NY premiere.\n\nThe couple—who robbed us of our annual dose of Blake-and-Ryan-red-carpet PDA by not attending this year’s Met Gala—finally give us what we want at the New York premiere of It Ends With Us.\n\nLively looks incredible in a vintage Versace gown: a shimmery rainbow piece. And Reynolds looks dashing in a light gray suit and white top adorned with a baby pink rose in his pocket square.\n\nGotham // Getty Images\n\nOn the carpet, the couple looks in love as ever.\n\nJuly 22, 2024: Ryan reveals the name of his and Blake’s fourth child.\n\nGotham // Getty Images\n\nFor a year and a half, Lively and Reynolds keep the name of their fourth child a secret—until Reynolds ends up spilling the beans when he thanks his family at the New York City premiere of Deadpool & Wolverine.\n\nOn the red carpet, Reynolds shows his love for Lively, as well as daughters James, nine, Inez, seven, Betty, four, and their fourth child, whose name is revealed to be Olin.\n\nAccording to the Bump, the name Olin is of Nordic origin, and means “ancestor’s heir” or “to inherit.” While the moniker is typically used for boys, Lively and Reynolds have yet to reveal the gender of their youngest. (And as evidenced by their eldest’s name, they aren’t afraid to challenge conventions.)\n\nThe entire family attends the premiere event, where Reynolds thanks them with a characteristically funny speech. “I hope that, if I’m lucky, this moment will be the most traumatic thing—that is, the contents of this movie—that happens in your wondrous lives,” he says.\n\nJuly 21, 2024: Ryan says he wants all the kids with Blake.\n\nIn an interview with E! News, the Deadpool & Wolverine star admits that he’ll take all the kids he can get with Lively. “The more the merrier,” he says. “As many as possible. As many little heartbeats as possible, just running around, wrecking stuff in the house. I love it. Let’s have more!”\n\nThe two are already parents to daughters James, nine, Inez, seven, and Betty, four, as well as a fourth child born in 2023.\n\n\n\nMay 13, 2024: Ryan jokes about the name of their fourth baby.\n\nDuring an appearance on the Today show, the IF star is asked by hosts Savannah Guthrie and Hoda Kotb about the name of his and Lively’s fourth child, whom the couple recently welcomed. “Taylor Swift keeps dropping [their names] into lyrics!” Guthrie said, referring the pop star’s song “Betty,” from 2020, in which she includes the names of Lively and Reynolds’ three daughters: Inez, James, and course, Betty.\n\nAfter Guthrie asks Reynolds whether the fourth baby’s name is anywhere on Swift’s new album, The Tortured Poets Department, he jokes, “We always wait for Taylor to tell us what the child’s name is … and I will say this: We’re still waiting.” He does not end up revealing the name.\n\nDustin Satloff // Getty Images\n\nApril 19, 2023: They coordinate street-style looks.\n\nWhile out in New York City, Lively and Reynolds dress in matching beige-and-blue outfits. The Gossip Girl alum goes casual in a beige sweater paired with her favorite black sweatpants from , a cozy navy blue faux-fur coat, and brown and blue sneakers from New Balance. Her husband wears a white button-down with a beige print, beige pants, a navy jacket, and white sneakers. His accessories include a bright blue beanie, black framed glasses, and layers of beaded bracelets.\n\nPhotos show them holding hands while walking through the city.\n\nApril 7, 2023: Blake and Ryan enjoy a beach getaway.\n\nThe pair enjoys a post-baby holiday somewhere sunny and beachy. On her Instagram, Lively shares photos from the family trip, including selfies with Reynolds, and photos of her in a patterned bikini with layers of seashell necklaces.\n\nMarch 27, 2023: They visit Wrexham as a family.\n\nLively, Reynolds, and their four kids travel to Wrexham, Wales, to watch the actor’s team, Wrexham FC, play York City. (Wrexham wins, 3–0.) Reynolds shares photos from the fun trip on Instagram.\n\nFebruary 12, 2023: They welcome their fourth child.\n\nLively indirectly confirms she has already welcomed baby number four after sharing a post on Instagram featuring a photo of herself without a visible baby bump.\n\n“Puppy Bowl Sunday 2023🥘 🍲 🥧 been busy,’ she captions a photo of herself with Reynolds and mother-in-law Tammy from Super Bowl Sunday.\n\nThe newborn—whose name and gender the parents have yet to announce—joins sisters James, seven, Inez, six, and Betty, three.\n\nThe following Monday, Reynolds reports that the baby is doing fantastic and that he and Lively have been sleeping well through it all. “We’re very excited,” the actor says during an appearance on CNBC’s Power Lunch. “Look, we wouldn’t do this four times if we didn’t love it.”\n\nHe continues: “Everybody’s doing great. Everybody’s actually doing fantastic. I think if we hadn’t figured [our sleep patterns] out by now, I think we’d be in deep, deep trouble.”\n\nSeptember 15 2022: Blake Lively is pregnant with baby number four.\n\nThe star and her new baby bump steal the spotlight at the 10th annual Forbes Power Women’s Summit at Jazz, held at Lincoln Center in New York City.\n\nLively is glowing in a long-sleeved sheer minidress with a gold sequined chevron pattern, which shows off her growing belly, as People reports she is expecting her fourth child with Reynolds.\n\nMarch 17, 2022: They are confirmed as co-chairs of the Met Gala.\n\nLively and Reynolds are announced as the co-chairs of the 2022 edition of fashion’s biggest night alongside Regina King and Lin-Manuel Miranda.\n\nFebruary 14, 2021: They share this adorable moment on Instagram.\n\nIn just one of the couple’s romantic bits on social media, Reynolds takes the reins on Lively’s hair for Valentine’s Day, per a sweet video she shares to her Instagram. ‘“That time I f*d my hairdresser,” the actress writes in the caption.\n\nMay 2, 2019: Blake reveals her third pregnancy.\n\nLively showcases her third baby bump at the red-carpet premiere of Reynolds’s film Pokémon: Detective Pikachu. The pair will welcome third daughter Betty in October 2019.\n\nANGELA WEISS // Getty Images\n\nDecember 15, 2016: They celebrate Ryan’s induction into the Hollywood Walk of Fame.\n\nReynolds is honored with a star on the Hollywood Walk of Fame, and the two celebrate in a rare outing alongside their two daughters. The occasion also marks newborn Inez’s red-carpet debut.\n\nMatt Winkelmeyer // Getty Images\n\nNovember 2016: Ryan talks about the moment he knew Blake was “the one.”\n\nIn an interview with GQ, the actor reveals the magical turning point in his friendship turned romance with Lively. “We were hanging out at this little restaurant in TriBeCa that’s open really late, and this song came on and I was just like, ‘Want to dance?’ ” Reynolds recalls. “No one was in there, so it was just totally empty. And it was just one of those moments where halfway through the dance, it was like, ‘Oh, I think I just crossed a line.’ ”\n\nHe adds, “And then I walked her home. And, uh, you know, I don’t really need to go into what happened after that.”\n\nApril 14, 2016: Blake and Ryan are expecting again.\n\nUs Weekly confirms Lively is pregnant with their second child, daughter Inez, who will be born in September.\n\nOctober 6, 2014: Blake is pregnant.\n\nIt is confirmed that Lively and Reynolds are expecting their first child together, daughter James, who will be born in December.\n\nJuly 18, 2014: Blake boasts about Ryan.\n\nLively expresses her contentment with Reynolds as both a husband and soon-to-be father in a new interview. “He’s going to be a great father and leader and patriarch—he’s so meant to be all of those things. The fact that he lived so much before we got together, he’s the exact realized person that he should be,” she says.\n\nShe adds that she and Reynolds make a great team. “He’s a part of it because everything we do in life, we do together,” she says. “If I’m working on a movie, he helps me with my character; I do the same with him. Picking out a coffee table. What we’re going to eat. He’s a beautiful writer—he’s written a lot of stuff for us. And he’s got a great barometer and he knows me, so he will tell me if it’s not as good as it can be.”\n\nMay 5, 2014: They make their red-carpet debut.\n\nThe two dazzle on the red carpet for the first time as a married couple at the 2014 Met Gala. Lively wears a silk chiffon blush Gucci Première gown, while Reynolds looks sharp beside her in a suit, also from the Italian fashion house.\n\nKevin Mazur // Getty Images\n\nSeptember 9, 2012: They secretly wed.\n\nThe ultra-private couple gets married in a secret ceremony in South Carolina. For the reception, Lively wears a custom-made Marchesa wedding gown, which she reveals she accidentally burned a hole through while playing around with sparklers.\n\nThough that moment was “heartbreaking” for Lively, the actress says Reynolds helped turn the incident into an endearing memory. In a 2014 interview, she shares, “Later, my dress was hanging up and Ryan said, ‘Isn’t that beautiful?’ I said, ‘What?’ And he pointed to the burn. My heart just stopped, because it was such a sensitive little subject. And he said, ‘You’ll always remember that moment with Florence singing and the sparklers. You have that forever, right there, preserved.’ Now that’s my favorite part of the dress.”\n\nLively and Reynolds, now split from their previous significant others, meet up again for a double date—though with different partners. Reynolds later jokes on SiriusXM’s Entertainment Weekly Radio that it was “the most awkward date” for the people they were with, because “fireworks” were going on between him and Lively.\n\nThey begin going on casual dates—without anyone else—after that, and the rest is history.\n\n“Next thing you know, she was going to Boston, I was going to Boston, and I said, ‘Well, I’ll ride with you.’ We got on the train and rode together,” Reynolds tells SmartLess cohost Jason Bateman in July 2021. He adds jokingly, “I was just begging her to sleep with me.”\n\nHe continues: “A week later, I was like, ‘We should buy a house together.’ And we did.”\n\nJuly 2010: They meet on the set of Green Lantern.\n\nLively and Reynolds first meet as costars—whose characters are romantic interests—in the DC Comics film. “I met Blake on the darkest crease in the anus of the universe called Green Lantern,” he says on an episode of the SmartLess podcast 11 years later. (The 2011 superhero movie was famously a bomb, and Reynolds would lampoon its failure a few years later, in the much more successful Deadpool.)\n\nNothing happens between the two, as the they are both with other people at the time—Lively with Gossip Girl costar Penn Badgley, and Reynolds with then-wife Scarlett Johansson—but they do become “buddies,” according to the actor.", "images": ["https://hips.hearstapps.com/hmg-prod/images/gettyimages-1910714113-65d75b965864a.jpg?crop=1.00xw:0.670xh;0,0.101xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/actor-ryan-reynolds-and-his-wife-actress-blake-lively-news-photo-1651261615.jpg?resize=980:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg?primary=%2523ffffff", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523000000&id=social-button-icon", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/bookmark-simple-regular.9d9d56b.svg", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1775781039-68d4422ae0941.jpg?crop=0.700xw:1.00xh;0.157xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1716063998-66423ecc25476.jpg?resize=980:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/saved.ad81f1a.svg?primary=%2523000000", "https://hips.hearstapps.com/hmg-prod/images/actors-blake-lively-and-ryan-reynolds-pose-with-their-news-photo-1651262024.jpg?resize=980:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2177276232-670a9e69ad858.jpg?crop=1xw:0.46990384615384617xh;0,0.0415xh", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2177276232-670a9e69ad858.jpg?crop=1.00xw:0.419xh;0,0.0415xh&resize=1200:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523000000&id=social-button-icon", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg", "https://hips.hearstapps.com/hmg-prod/images/blake-lively-and-ryan-reynolds-attend-the-charles-james-news-photo-1651259581.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/megan-fox-and-machine-gun-kelly-attend-universal-music-news-photo-1684514141.jpg?crop=1.00xw:0.670xh;0,0.129xh&resize=360:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523000000&id=social-button-icon", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2188545144-6758a033a4374.jpg?crop=1.00xw:0.791xh;0,0.0456xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1489056535-645d20bc23bd1.jpg?crop=0.723xw:1.00xh;0.143xw,0&resize=360:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/envelope-simple-regular.91a0134.svg", "https://hips.hearstapps.com/rover/profile_photos/21445446-1bde-4290-a24e-2bdd274be027_1521573573.jpg?fill=1:1&resize=160:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1259015499-6632470007f66.jpg?crop=0.720xw:1.00xh;0.147xw,0&resize=360:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2165636611-66b383011619f.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/blake-lively-and-ryan-reynolds-attend-the-deadpool-news-photo-1721741103.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1463278313-64ee2146ab638.jpg?crop=0.679xw:1.00xh;0.188xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1191508186.jpg?crop=0.676xw:0.998xh;0.200xw,0.00240xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/jake-bongiovi-and-millie-bobby-brown-attend-netflixs-news-photo-1763046330.pjpeg?crop=0.793xw:0.529xh;0.0635xw,0.202xh&resize=360:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523000000&id=social-button-icon", "http://www.harpersbazaar.com/_assets/design-tokens/harpersbazaar/static/images/logos/logo.823d7af.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/david-harbour-and-lily-allen-attend-the-26th-annual-screen-news-photo-1762971918.pjpeg?crop=0.738xw:1.00xh;0.132xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2177276232-670a9db4ba92c.jpg?resize=980:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523ffffff&id=social-button-icon", "http://www.harpersbazaar.com/_assets/design-tokens/harpersbazaar/static/images/logos/network-logo.6416a85.svg?primary=%2523ffffff", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523000000&id=social-button-icon", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523ffffff&id=social-button-icon", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/globe-simple-regular.e7f303c.svg", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/taylor-swit-matt-healy-2-645e910541bf8.jpg?crop=0.503xw:1.00xh;0,0&resize=360:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/x-regular.e414d97.svg", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/caret-left-regular.5546078.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2151728037-67d33e4679c52.jpg?crop=0.550xw:0.825xh;0.175xw,0&resize=360:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2177276232-670a9e69ad858.jpg?crop=1.00xw:0.419xh;0,0.0415xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.harpersbazaar.com/celebrity/latest/a39854270/blake-lively-ryan-reynolds-relationship-timeline/", "title": "Blake Lively and Ryan Reynolds Full Relationship Timeline", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Blake Lively and Ryan Reynolds Full Relationship Timeline", "description": "Look back on the Hollywood couple's decade-long romance—from their \"Green Lantern\" gig to now.", "theme-color": "#000000", "og": {"site_name": "Harper's BAZAAR", "title": "Ryan Reynolds Gives Rare Insight Into How He and Blake Lively Approach Parenting", "description": "The couple share four kids: James, Inez, Betty, and Olin", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2177276232-670a9e69ad858.jpg?crop=1.00xw:0.419xh;0,0.0415xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.harpersbazaar.com/celebrity/latest/a39854270/blake-lively-ryan-reynolds-relationship-timeline/", "type": "article"}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "opinion": "false", "section": "Celebrity News", "modified_time": "2024-12-16T14:26:00Z", "published_time": "2024-12-16T14:26:00Z"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "parsely-metadata": "{\"socialHeadline\":\"Ryan Reynolds Gives Rare Insight Into How He and Blake Lively Approach Parenting\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2177276232-670a9e69ad858.jpg?crop=1.00xw:0.837xh;0,0&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2177276232-670a9e69ad858.jpg?crop=1.00xw:0.419xh;0,0.0415xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2177276232-670a9e69ad858.jpg?crop=1.00xw:0.837xh;0,0", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2177276232-670a9e69ad858.jpg?crop=1.00xw:0.419xh;0,0.0415xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "timely", "sailthru.excerpt": "Name a more glamorous and solid Hollywood couple than Blake Lively and Ryan Reynolds—we’ll wait.The two first met on the set of 2011’s Green Lantern, and realized their love for one another during a double date sometime later. The friendship turned romance quickly led to marriage, and over a decade", "sailthru.tags": "celebrity,Celebrity,latest,Celebrity News,celebrity-relationships,Celebrity Relationship News,Harper's BAZAAR-US", "sailthru.date": "2024-12-16 14:26:00", "sailthru.socialtitle": "Ryan Reynolds Gives Rare Insight Into How He and Blake Lively Approach Parenting", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1734359160.0, "source": "http://www.harpersbazaar.com", "summary": ""}