{"url": "https://ew.com/tv/2018-new-christmas-tv-movies-airdates/", "text": "01 of 80 Here's when every new Christmas TV movie will air Lifetime; Gabriel Hennessey/Netflix; Steven Ackerman/Crown Media Ryan Plummer/Crown Media; Erik Asla/Freeform And you thought holiday-shopping season was intense. Over the next two months, a handful of networks (and streaming services) paint the town red with Christmas spirit, offering up about 80 new original Yuletide TV movies. Familiar faces such as Lacey Chabert, Tyra Banks, Vanessa Hudgens, Candace Cameron Bure, Melissa Joan Hart, Tia Mowry-Hardrict, and Chad Michael Murray will find unlikely romance, get trapped in a department store, save a quaint business, or triumph over challenge on their way to the perfect Christmas. Hallmark leads the field with 37 movies across its two networks, but Lifetime is stocking up with 18 films, and Netflix, Freeform, ION, and UPtv are full of holiday cheer as well. Start scrolling to schedule your busiest holiday season ever.\n\n02 of 80 Last Vermont Christmas (Nov. 19, 9 p.m. ET/PT on Hallmark Movies & Mysteries) Hallmark STARS: Erin Cahill, Justin Bruening CONTAINS: Sibling reunion, Vermont, guy who weirdly wants to buy his ex-girlfriend's family home OFFICIAL SYNOPSIS: Every year the three Marvin sisters, Megan (Cahill), Bethany and Mary, gather from across the country to spend Christmas together under the same roof in their beloved childhood home. And while they couldn’t be any more different from one another, they all agree on one thing: there’s nothing more magical than spending Christmas together with their parents. Unfortunately, this legacy is coming to an end as their parents have decided to sell the house, and their buyer is Megan’s former high-school sweetheart Nash (Bruening). As she returns home this Christmas, Megan works to keep her beloved childhood home that is being bought by her high-school sweetheart.\"\n\n03 of 80 Christmas at Graceland (Nov. 30, 10 p.m. ET on Hallmark Channel) Katherine Bomboy/Crown Media STARS: Kellie Pickler, Wes Brown CONTAINS: Reignition of old flames, bank acquisition, Memphis blues OFFICIAL SYNOPSIS: \"Laurel (Pickler), a Chicago-based business executive travels to Memphis to secure one of the city’s oldest family-owned banks. While in Memphis, Laurel reunites with old flame Clay (Brown), a local music promoter with loftier aspirations. Though Laurel tries to keep her eye on the prize of the business acquisition, Clay is very persuasive reminding her of the days when they were a performing duo on the brink of stardom. Now Laurel’s focus turns to the home of the Blues and dreams of making music again.\"\n\n04 of 80 Christmas in Love (Dec. 1, 10 a.m. ET on Hallmark Channel) Crown Media STARS: Brooke D’Orsay, Daniel Lissing, Mary-Margaret Humes CONTAINS: Quaint bakery, threat of layoffs and automation OFFICIAL SYNOPSIS: \"Ellie Hartman (D’Orsay) is an aspiring crafter working in her small town’s bakery making famous Christmas Kringles. When the new, big-city CEO Nick Carlingson (Lissing) visits the bakery, he arrives filled with modernization ideas destined to lay off many employees. During his visit, Ellie is to teach Nick how to make a Kringle, and determined to show him it’s the people who make the business a success, not machines. Nick meets more of the employees and townspeople, visits the food bank and begins to see all the kindness that is shared, and he begins to soften — though not convinced automation isn’t better. Struggling with chasing her own entrepreneurial dreams, Ellie begins to fall for Nick but not before feeling betrayed when she inadvertently sees Nick’s laptop filled with automation plans. When Nick finally tells the employees his future ideas for the company, Ellie must decide if she should trust him, but more importantly, whether to take a leap of faith in making her own dreams come true.\"\n\n05 of 80 It’s Christmas, Eve (Dec. 1, 4 p.m. ET on Hallmark Channel) Ryan Plummer/Crown Media STARS: LeAnn Rimes, Tyler Hines CONTAINS: Multiple Rimes performances, school budget trims, internet crowdfunding OFFICIAL SYNOPSIS: \"As interim school superintendent, Eve (Rimes) trims budgets and now she’s in her hometown where it’s personal. Her handsome neighbor Liam (Hines) is a music teacher and Eve feels his program must be cut. But luckily her friend is married to an IT guy, who’s created a website for donations directly to save the arts program. Launched during the tree-lighting ceremony where Liam’s students will perform, the website could provide the Christmas miracle the town needs. Already the universe is cooperating. Eve is back home and she, Liam, and his daughter look like they might be celebrating many a future Christmas.\"\n\n06 of 80 Mingle All the Way (Dec. 1, 8 p.m. ET/PT on Hallmark Channel) Ricardo Hubbs/2018 Crown Media United States, LLC STARS: Jen Lilley, Brant Daugherty, Lindsay Wagner CONTAINS: Dating app, super-busy professionals, unexpected romance OFFICIAL SYNOPSIS: \"Mingle All the Way is a new networking app designed to pair busy professionals together for upcoming events, without long-term romance. Molly (Lilley), founder of the app, is determined to prove to her family that it is a success. Therefore, she joins the app, and meets another busy professional, Jeff (Daugherty). When Molly and Jeff are matched, they are both horrified to realize they’ve already had not one, but two disastrous previous encounters. Nevertheless, they agree to stay matched for all their respective upcoming holiday engagements. As the pair gets closer, perhaps their business arrangement might turn into something more this holiday season.\"\n\n07 of 80 Christmas Wonderland (Dec. 1, 9 p.m. ET/PT on Hallmark Movies & Mysteries) Brett Colvin/Crown Media STARS: Emily Osment, Ryan Rottman CONTAINS: Holiday homecoming, reiginition of old flames, artist rediscovering her passion in more ways than one, Christmas dance OFFICIAL SYNOPSIS: \"Heidi (Osment), who initially left her small town of Pleasant Valley with the dream of one day becoming a successful painter, has put her own art on hold to excel as an art gallery curator. Now, a week before the gallery’s big Christmas party, she must return home to watch her niece and nephew. She comes face to face with her high school love, Chris, now a teacher, who is in over his head after he must find a new last-minute location for the Christmas dance. Heidi offers to help him and together they discover a beautiful place for the dance, perfectly capturing the Christmas spirit, called Wonderland Farms. The more time Heidi spends in Pleasant Valley decorating for the Christmas SnowBall, the more she finds herself inspired to start painting again. With Christmas fast approaching, Heidi soon becomes torn between the life she built in the city and the life she is surprisingly charmed by back in Pleasant Valley, embracing her true passion.\"\n\n08 of 80 Pride, Prejudice, and Mistletoe (Nov. 23, 8 p.m., ET/PT on Hallmark Channel) Shane Mahood/Crown Media STARS: Lacey Chabert, Brendan Penny CONTAINS: Holiday homecoming, reconciliation with parent, old rivalry blossoming into romance OFFICIAL SYNOPSIS: \"Darcy (Chabert) has always worked hard to prove herself and be successful on her own terms, even choosing to start her own company, rather than work with her father. Returning to her hometown for Christmas, Darcy reconnects with an old rival, restaurant owner Luke (Penny), and they are forced to plan a charity event together. As Darcy spends time with her family and Luke, she starts to realize what matters most in life and sets out to mend her relationship with her father, and possibly fall in love. Based on the book of the same title by Melissa de la Cruz.\"\n\n09 of 80 Road to Christmas (Nov. 18, 12 p.m. ET on Hallmark Channel) Ryan Plummer/Crown Media STARS: Jessy Schram, Chad Michael Murray, Teryl Rothery CONTAINS: Secret plan, family reunion, Vermont OFFICIAL SYNOPSIS: \"Los Angeles television producer Maggie Baker (Schram) unwittingly falls for Danny Wise (Murray), the son and former producer of his mother’s (Rothery) popular annual Christmas special Julia Wise Lifestyle. When Maggie’s secret plan to reunite Danny and his two brothers with Julia during the live broadcast in Vermont goes awry, Maggie is reminded that above all, it is the love for family and friends that makes the merriest of Christmas.\"\n\n10 of 80 A Godwink Christmas (Nov. 18, 9 p.m. ET/PT on Hallmark Movies & Mysteries) Crown Media Stars: Kimberley Sustad, Paul Campbell, Kathie Lee Gifford Contains: Multiple trips to Nantucket, an engagement that doesn't feel right, a Hoda-less Kathie Lee Gifford OFFICIAL SYNOPSIS: \"As Christmas approaches, Paula (Sustad), a St. Louis antique appraiser, reluctantly accepts a marriage proposal from her boyfriend, Daniel (Giles Panton, Chesapeake Shores), a career-focused attorney. When her Aunt Jane (Gifford) senses she has mixed emotions over the engagement, she invites Paula to her Nantucket home. Upon her arrival, Paula plans a trip to the nearby island of Martha’s Vineyard where she meets Gery (Campbell), a charming inn owner. When bad weather prevents her from departing, Paula winds up staying at Gery’s inn and enjoying local holiday festivities alongside him. They begin to have feelings for each other but when the weather clears up, they part ways and Paula returns to Nantucket. Sensing she’s fallen for Gery, Aunt Jane shares with Paula her belief that their meeting was God’s way of “winking” at her to help determine which direction her life should take. When Daniel surprises her by spontaneously arriving in Nantucket, Paula decides to move forward with their marriage plans. But back in St. Louis, Daniel soon returns to his all-business ways and a fed-up Paula finally realizes they’re not compatible. When Jane invites her back to Nantucket for Christmas, Paula accepts, unaware that Jane has devised a plan to bring her and Gery together. From author, SQuire Rushnell of the God Winks book series.\"\n\n11 of 80 Christmas at the Palace (Nov. 22, 8 p.m. ET/PT on Hallmark Channel) Ricardo Hubbs/Crown Media STARS: Merritt Patterson, Brittany Bristow CONTAINS: Lots of ice skating, a king who's skating on thin ice by falling for his daughter's instructor OFFICIAL SYNOPSIS: \"Katie, a former professional ice skater (Patterson), is hired by the king of San Senova, Alexander, to help his daughter in a Christmas ice skating performance. As Katie spends time in the castle and with the king, she and Alex begin to develop feelings for each other and ultimately fall in love. But will the tradition-loving people of San Senova allow their king to make a foreigner their queen?\"\n\n12 of 80 Return to Christmas Creek (Nov. 17, 9 p.m. ET on Hallmark Movies & Mysteries) Crown Media United States, LLC STARS: Tori Anderson, Stephen Huszar, Steven Weber, Kari Matchett CONTAINS: Holiday homecoming, romance with childhood friend, family feud, unconventional toy deliveries OFFICIAL SYNOPSIS: \"As Christmas approaches, Amelia Hughes (Anderson), a career-focused Chicago app developer lacking in holiday spirit, returns to her small hometown of Christmas Creek to rediscover the meaning of Christmas. There, she reunites with her childhood best friend Mike (Huszar) and her estranged uncle Harry (Weber), whose mysterious rift with Amelia’s father divided her family during the holiday season when she was a child. As she engages in local holiday festivities — and begins falling for Mike — Amelia finds herself feeling the Christmas spirit and looking forward to Harry’s Christmas Eve tradition of delivering toys to needy children in his small, private airplane. Meanwhile, Harry begins repairing his damaged relationship with his ex-girlfriend Pamela (Kari Matchett). But as she helps prep Harry’s airplane for the toy delivery, a shocked Amelia learns her parents have unexpectedly shown up in town for the holiday and is crushed when her father and Harry resume their longstanding feud. On Christmas Eve, disappointed by her family’s continued fighting, Amelia prepares to return to Chicago and leave behind Christmas Creek and her budding romance with Mike along with it. But just as she’s about to leave, she feels a burst of inspiration that just might turn things around and help her finally restore family peace and embrace romance as love prepares to take flight for Christmas.\"\n\n13 of 80 Hope at Christmas (Nov. 20, 9 p.m. ET/PT on Hallmark Movies & Mysteries) Ryan Plummer/2018 Crown Media United States, LLC STARS: Ryan Paevey, Scottie Thompson CONTAINS: Inheritance, bookstore, town Santa OFFICIAL SYNOPSIS: \"Sydney Ragsdale (Thompson), recently divorced, decides to spend Christmas in a house she inherited with her young daughter. As Sydney begins to spend more time at the local bookstore, she meets a teacher, Mac (Paevey), who also fills in for the town Santa. Mac tries to make Christmas wishes come true, and this year Sydney is at the top of his 'nice' list. As a new opportunity with the bookstore unfolds, Mac helps Sydney open herself up to life, love, and believing in the spirit of Christmas again.\"\n\n14 of 80 Christmas in Evergreen: Letters to Santa (Nov. 18, 8 p.m. ET/PT on Hallmark Channel) Ryan Plummer/Crown Media STARS: Jill Wagner, Mark Deklin, Holly Robinson-Peete, Barbara Niven, Andrew Francis, Ashley Williams CONTAINS: Save-the-general-store campaign, undelivered letter to Santa, hot contractor OFFICIAL SYNOPSIS: \"When Lisa (Wagner) takes a last-minute Christmas trip to her hometown of Evergreen, she finds that the historic general store has been closed. Using her skills as a professional retail designer, Lisa decides to keep local tradition alive and help the good people of Evergreen bring the store back to life. As Lisa charms a local contractor named Kevin (Deklin) into working with her, the pair find themselves facing one surprise after another as they restore the store to its former glory. When the staff at the Kringle Kitchen temporarily accept the store's beloved 'Mailbox to Santa' for safekeeping, the townspeople find and rally around a mysterious 25-year-old letter that never made it to the North Pole. As old traditions are made new again, Lisa finds herself falling for Kevin, the traditions, and the town of Evergreen.\"\n\n15 of 80 A Veteran's Christmas (Nov. 29, 11 p.m. ET on Hallmark Movies & Mysteries) Shane Mahood/2018 Crown Media United States LLC STARS: Eloise Mumford, Sean Faris CONTAINS: Small-town stranding, possible reunion with a canine, likely romance between decorated war vet and judge OFFICIAL SYNOPSIS: \"Captain Grace Garland (Mumford), a decorated U.S. veteran, returns home after two tours of Search and Rescue in Afghanistan. After being separated from her beloved K9 partner, Grace must rediscover the magic of Christmas. When she finds herself stranded in the town of River’s Crossing a couple weeks before Christmas, the local judge, Joe Peterson (Faris), offers her a place to stay on his property and takes it upon himself to show Grace everything she has been missing; Christmas, family, community, and love.\"\n\n16 of 80 Christmas Joy (Nov. 20, 8 p.m. ET/PT on Hallmark Channel) Eike Schroter/Crown Media STARS: Danielle Panabaker, Matt Long CONTAINS: Homecoming, reignition of old flames, intense baking competition OFFICIAL SYNOPSIS: \"Joy Holbrook (Panabaker) is a keenly intelligent market researcher with an eye on her company’s top account and garnering a sweet promotion just in time for the holidays. Just as Joy is capturing the attention of the account’s CEO, she receives a call from her Aunt Ruby’s best friend back home in Crystal Falls. Ruby has broken her ankle and needs surgery. Though the timing couldn’t be worse, Joy immediately comes to her aunt’s bedside only to be reunited with former crush, now hospital administrator, Ben Andrew (Long), son of Ruby’s best friend Shirley. Joy also must reconcile Ruby’s stubborn determination to be in control of everything, including the town’s legendary baking competition known as the Cookie Crawl. To keep Ruby focused on healing, Joy volunteers to take Ruby’s place much to the amusement of Ben who knows Joy has no idea of the Herculean task before her. Though Joy initially refuses Ben’s attempts to 'co-captain,' she begins to soften and let him in, all the while remembering that there truly is no place like home. Based on the best-selling novel by Nancy Naigle.\"\n\n17 of 80 Christmas Everlasting (Hallmark Hall of Fame) (Nov. 24, 8 p.m. ET/PT on Hallmark Channel) Brian Douglas/2018 Crown Media United States, LLC STARS: Tatyana Ali, Dondre T. Whitfield, Patti LaBelle, Dennis Haysbert CONTAINS: Family funeral, surprise inheritance, reignition of old flames OFFICIAL SYNOPSIS: \"Christmas is fast approaching and years of long workdays employed at New York’s top corporate law firm are about to pay off now that Lucy Toomey (Ali) will be made partner after the New Year. However, when Alice, her older sister with special needs, unexpectedly passes away, Lucy returns back to Nilson's Bay, Wis., to attend the funeral and handle her estate. While Lucy dreads returning to her childhood home, she also feels real sorrow that she was too busy to take her sister’s last call. Once back in Nilson’s Bay, Lucy meets Peter (Whitfield), her old high school sweetheart and Alice’s former attorney, who informs her of the terms of Alice’s eccentric will that states in order for Lucy to inherit the family home, she must live there for 30 days through the holidays.\"\n\n18 of 80 Christmas on Honeysuckle Lane (Nov. 24, 9 p.m. ET/PT on Hallmark Movies & Mysteries) Crown Media United States, LLC STARS: Alicia Witt, Colin Ferguson CONTAINS: Sibling reunion, bittersweet sifting through dead parents' belongings OFFICIAL SYNOPSIS: \"Emma (Witt) returns home to celebrate Christmas for the last time with her siblings in the house they grew up in. After their parents' recent passing, the siblings reluctantly agree to sell the family home on Honeysuckle Lane, leaving Emma in charge of its belongings. While Emma’s mother’s collection is being appraised, they find a hidden surprise that takes them on a journey to discover the power of love and family during the holidays. Based on the book by Mary Elizabeth McDonough.\"\n\n19 of 80 A Shoe Addict’s Christmas (Nov. 25, 8 p.m. ET/PT on Hallmark Channel) Steven Ackerman/Crown Media STARS: Candace Cameron Bure, Luke Macfarlane CONTAINS: Department-store stranding, guardian angel, department store, hot firefighter neighbor OFFICIAL SYNOPSIS: \"As Christmas approaches, Noelle (Bure) is at a crossroads in her life when it seems that love, a connection with her father, and her dream career are out of reach. When she stays late at her job in a department store on a snowy Christmas Eve, she accidentally gets locked in after closing. She isn’t too concerned about the prospect of spending the night in the store… until a quirky woman appears out of nowhere in the shoe department and tells Noelle that she’s her guardian angel. Soon, Noelle finds herself revisiting Christmases past, present, and future as she must work with her new neighbor, a handsome, Christmas-loving firefighter, to plan the annual Christmas Charity Gala. Will visiting the holidays of yesterday and tomorrow help Noelle take new chances and discover the true spirit of Christmas? And in realizing that the only thing standing in her way of leading a fulfilling life is herself, will the love she has longed for all her life be the best surprise gift of all?\"\n\n20 of 80 Reunited at Christmas (Nov. 21, 8 p.m. ET/PT on Hallmark Channel) Ryan Plummer/2018 Crown Media United States, LLC STARS: Nikki Deloach, Mike Faiola CONTAINS: Writer's block, holiday homecoming, wise deceased grandmother OFFICIAL SYNOPSIS: \"Frazzled and struggling with writer’s block, novelist Samantha (Deloach), along with her boyfriend, heads home to her late grandmother's home to spend Christmas. While at home with family, her grandmother’s wise words reveal the true meaning of Christmas with Samantha at a time when she most needs encouragement.\"\n\n21 of 80 Christmas at Pemberley Manor (Nov. 22, 6 p.m. ET/PT on Hallmark Channel) Robert Clark/Crown Media STARS: Jessica Lowndes, Michael Rady CONTAINS: Attractive billionaire, estate in jeopardy OFFICIAL SYNOPSIS: \"As Christmas approaches, Elizabeth Bennett (Lowndes), a New York event planner, is sent to a quaint, small town to organize their holiday festival. When she arrives, she finds William Darcy (Rady), a high-profile billionaire lacking in holiday spirit, in the process of selling the charming estate she hoped to use as a venue. Determined to make her event a success, Elizabeth persuades the reluctant Darcy to let her hold the festival on the historical estate once known for its holiday cheer. When they wind up working together to arrange the festivities, the unlikely pair begins falling for each other. But when complications arise and the festival is unexpectedly shut down, the couple parts ways and Darcy moves forward with his plans to sell the estate. On the night before Christmas, a wistful Elizabeth hopes for a Christmas miracle to revive the festival, save the estate, and rekindle her holiday romance.\"\n\n22 of 80 Marrying Father Christmas (Nov. 20, 11 a.m. ET on Hallmark Movies & Mysteries) KAILEY SCHWERMAN/Crown Media STARS: Erin Krakow, Niall Matter, Wendie Malick CONTAINS: Search for biological father, mysterious visitor, wedding drama OFFICIAL SYNOPSIS: \"When Miranda Chester (Krakow) sets off to find information on her biological father two Christmases ago, she never imagined her investigation would lead her to both the love of her life, Ian McAndrick (Matter), and the family she had always longed for, including Margaret Whitcomb (Malick) and step-brother Peter Whitcomb (Jim Thorburn). After her romantic engagement last Christmas, Miranda prepares for a Christmas wedding surrounded by this new family. While Miranda finalizes the details of her big day, Margaret forges a surprising romance with a friend from the past. Miranda’s wedding plans are quickly complicated when a mysterious visitor who claims to have ties to her late parents reaches out to her just days before her wedding. As Miranda’s wedding approaches, she must decide if she wants to spend one of the most momentous days of her life with this new family connection, and must carefully navigate the first steps into the next chapter of her life with Ian.\"\n\n23 of 80 The Holiday Calendar (Debuted Nov. 2 on Netflix) Netflix STARS: Kat Graham, Ron Cephas Jones, Quincy Brown, Ethan Peck CONTAINS: Supernatural calendar, photographer, the future OFFICIAL SYNOPSIS: “A struggling but talented photographer inherits an antique holiday advent calendar, the contents of which seem to predict the future. Will this magical calendar lead her to love this holiday season?”\n\n24 of 80 The Princess Switch (Debuted Nov. 16 on Netflix) Gabriel Hennessey/Netflix STARS: Vanessa Hudgens, Sam Palladio CONTAINS: Vanessa Hudgens playing two roles, royal romance, a “commoner” named Stacy OFFICIAL SYNOPSIS: “One week before Christmas, Margaret, the gorgeous Duchess of Montenaro, switches places with Stacy, a ‘commoner’ from Chicago, who looks exactly like her. With the assistance of a magical Santa's helper, Margaret falls in love with Stacy’s handsome co-worker, while Stacy falls in love with Margaret's fiance, the dashing Prince.”\n\n25 of 80 Christmas on the Coast (Nov. 18, 7 p.m. ET/4 p.m. PT on UPtv) Ben Roberts/UPTV STARS: Julia Ann Emery, Burgess Jenkins, Bonnie Bedelia CONTAINS: Creatively-blocked author, dashing widower, holiday homecoming OFFICIAL SYNOPSIS: “Hard-hearted New York novelist Dru Cassadine, who is known for her holiday romance stories, is desperate to get her mojo back after a string of flops. Deciding that a change of scenery will get her creative juices flowing, she heads home for Christmas to Harbor Point, South Carolina, where she uses the quirky small-town characters as inspiration for her new book. But when she meets handsome widower Brysen Flynn, she finds that she just may be writing her own love story.”\n\n26 of 80 My Christmas Inn (Nov. 21, 8 p.m. ET/PT on Lifetime) Heather Sten/Lifetime STARS: Tia Mowry-Hardict, Rob Mayes, Jackée Harry, Tim Reid, Erin Gray CONTAINS: Surprise inheritance, executive romance, drama set outside the 48 contiguous U.S. states OFFICIAL SYNOPSIS: \"With the holiday season in full swing, Jen Taylor (Mowry-Hardict) is about to score a big promotion at the San Francisco ad agency where she works. But her life is unexpectedly turned upside down when she inherits a cozy inn in Alaska from her aunt. When she goes to inspect the property and meets handsome town attorney Steve Anderson (Mayes), she’s surprised to find that nothing is what she expected. The small town community is full of fun and festive Christmas traditions and soon, Jen starts wondering if the inn might just be the place she belongs, and if Steve could be the Mr. Right she has been waiting for.\"\n\n27 of 80 A Christmas Arrangement (Nov. 21, 10 p.m. ET/PT on Lifetime) Ashly Covington/Lifetime STARS: Nicky Whelan, Daphne Zuniga, Miles Fisher CONTAINS: Fierce botany competition, blossoming of unexpected romance OFFICIAL SYNOPSIS: “Flower shop owner Poppy (Whelan), enters the annual holiday floral show for a chance to win the grand prize but standing in her way of victory is Garrett (Fisher), the underappreciated protégé of florist extraordinaire, Blair (Zuniga). While Poppy and Garrett’s rivalry heats up on the flower show floor, an undeniable romance begins amidst a whimsical holiday backdrop.”\n\n28 of 80 The Christmas Contract (Nov. 22, 8 p.m. ET/PT on Lifetime) Caroline Tompkins/Lifetime STARS: Hilarie Burton, Robert Buckley, Danneel Ackles, Antwon Tanner, Jordan Ladd, Cheryl Ladd, Bruce Boxleitner, Jason London, Hunter Burke, Teri Wyble, Ritchie Montgomery, musical appearance by Tyler Hilton CONTAINS: One Tree Hill reunion (Burton, Buckley, Ackles, Tanner), holiday homecoming, business arrangement that turns romantic, web design OFFICIAL SYNOPSIS: “It’s Jolie’s (Burton) first time going back home to Louisiana since her devastating break-up with Foster Burke). Seeing him is inevitable as their parents run the town’s annual Christmas Market together, but when she discovers Foster is bringing home a new girlfriend, Jolie cannot bear the thought of going home alone and seeing them together. Her best friend Naomi (Ackles) suggests that Jolie bring her flaky brother, Jack (Buckley), home for Christmas as he has no plans this year. Jolie, a professional web designer, is hesitant; so, Naomi, a lawyer, creates a Christmas contract to give them both something they want—a buffer for those awkward moments around Jolie’s ex and a website to help sell Jack’s upcoming novel. Unbeknownst to them, the Christmas contract proves to be so much more than what they signed up for.”\n\n29 of 80 The Christmas Chronicles (Nov. 22 on Netflix) Netflix STARS: Kurt Russell, Oliver Hudson, Kimberly Williams-Paisely CONTAINS: Jake Plissken as Santa, sleigh crash OFFICIAL SYNOPSIS: \"The Christmas Chronicles, a holiday adventure from producer Chris Columbus and director Clay Kaytis, tells the story of sister and brother, Kate (Darby Camp) and Teddy Pierce (Judah Lewis), whose Christmas Eve plan to catch Santa Claus (Kurt Russell) on camera turns into an unexpected journey that most kids could only dream about. After staking out Santa’s arrival, they sneak into his sleigh, cause it to crash and nearly derail Christmas. As their wild night unfolds, Kate and Teddy work together with Santa - as you've never seen him before - and his loyal Elves to save Christmas before it's too late.\"\n\n30 of 80 Poinsettias for Christmas (Nov. 23, 8 p.m. ET/PT on Lifetime) Luba Popovic/Lifetime STARS: Bethany Joy Lenz, Marcus Rosner, Lauren London, Sharon Lawrence, John Schneider CONTAINS: Holiday homecoming, family farm, blossoming romance over botany OFFICIAL SYNOPSIS: “It's just weeks before Christmas when Ellie (Bethany Joy Lenz) gets a call to return home to help her father (John Schneider) on the family’s poinsettia farm. The family business is on the line to deliver tens of thousands of plants for the town's annual parade. The problem is — the poinsettias have yet to turn red! As Ellie searches for the solution, she is reminded of where her heart truly lies as she falls in love with both her roots and a local botanist (Marcus Rosner).\"\n\n31 of 80 Every Other Holiday (Nov. 23, 10 p.m. ET/PT on Lifetime) Lifetime STARS: Schulyer Fisk, David Clayton Rogers, Dee Wallace, Glenn Morshower, Abby James Witherspoon CONTAINS: Children hoping to bring back together their stranged parents, memory-filled family farmhouse OFFICIAL SYNOPSIS: “Recently separated parents Tracie (Fisk) and Rick (Rogers) spend every other holiday with their young daughters Harper and Ava. But this Christmas, the girls have only one thing on their wish lists — to spend Christmas with both Mom and Dad at Tracie’s family farmhouse. The temporary reunion will be no walk in the park for Tracie and Rick, but perhaps this Christmas gathering can help rekindle the lost romance between the two and make their daughters’ greatest wish come true.”\n\n32 of 80 Every Day is Christmas (Nov. 24, 8 p.m. ET/PT on Lifetime) Bettina Strauss/Lifetime STARS: Toni Braxton, Gloria Reuben, Towanda Braxton, Michael Jai White CONTAINS: Toni Braxton working like the Dickens, unexpected romance OFFICIAL SYNOPSIS: \"Inspired by the Charles Dickens classic A Christmas Carol, shrewd money manager Alexis Taylor (Braxton) gets the holiday visit of a lifetime. A self-proclaimed workaholic who ‘humbugs’ love, Alexis ends up embracing the spirit of Christmas when her past, present, and future collide, forcing her to risk the one thing money can’t buy: her heart.\"\n\n33 of 80 Christmas Harmony (Nov. 24, 10 p.m. ET/PT on Lifetime) Lifetime STARS: Kelley Jakle, Chandra Wilson, Adam Mayfield, Sally Struthers CONTAINS: Freshly-broken-up-with heroine, holiday homecoming OFFICIAL SYNOPSIS: “Soft-spoken Harmony (Jakle) is used to living in the shadow of her pop star boyfriend, but when he breaks up with her right before the holiday season, she returns to her quaint hometown to discover the heart and music that her big city life has been missing.”\n\n34 of 80 Jingle Belle (Nov. 25, 8 p.m. ET/PT on Lifetime) Lifetime STARS: Tatyana Ali, Cornelius Smith Jr., Loretta Devine, Valarie Pettiford, Obba Babatunde, Keshia Knight Pulliam, Tempestt Bledsoe CONTAINS: Holiday homecoming, Christmas pageant, romantic duets OFFICIAL SYNOPSIS: \"Every year, Isabelle (Tatyana Ali) and her high school sweetheart Mike (Cornelius Smith Jr.), rocked their small town’s annual Christmas Eve Pageant with a sweet Christmas duet. But after graduation, Isabelle left to study at Juilliard in New York – leaving Mike behind. Years later, when Isabelle returns to her hometown to write music for the annual Christmas Eve Pageant, she is shocked to learn that Mike is the one directing the show. Can Isabelle and Mike put the past behind them and reunite on stage for another show-stopping duet?\"\n\n35 of 80 The Truth About Christmas (Nov. 25, 9 p.m. ET/PT on Freeform) Albert Camicioli/Freeform STARS: Kali Hawk, Damon Dayoub, Ali Ghandour CONTAINS: Confrontation with Santa, a Liar Liar-esque premise, politics OFFICIAL SYNOPSIS: \"Hawk stars as Jillian, a successful political consultant, confident in her ability to put a spin on anything whose next big project is the upcoming mayoral campaign for her boyfriend, George (Dayoub). On the way to meet George’s family for the first time during the holidays, an unusual confrontation with a toy store Santa results in a drastic change in Jillian where she can’t stop herself from wildly spilling the truth. Ghandour costars as George’s brother Blake, who believes you should always be true to yourself but thinks Jillian just might be losing it. Jillian must find a way to make it stop before her holidays, her job and her relationship are ruined.\"\n\n36 of 80 A Wedding for Christmas (Nov. 25, 9 p.m. ET/P, ION Television) ION STARS: Vivica A. Fox, Cristine Prosperi, Colton Little, Curtis McGann, Lesli Kay, William McNamara CONTAINS: Holiday homecoming, Christmas wedding, conflicted event planner OFFICIAL SYNOPSIS: “Haley Foster built a big city life in Los Angeles as a top wedding planner at an elite and powerful company run by Ms. Reynolds. When her sister, Angela, insists on getting married Christmas Day on the tree farm in their old hometown of Truxton, Haley is resigned to make her sister’s dreams come true and her parents happy. Returning to her hometown not only brings back fond memories, but also reunites Haley with Angela’s childhood pal, Carter. Soon sparks begin to fly. Will Haley head back to the city where her new life lies, or will she tumble in love again with her old town and Carter?\n\n37 of 80 Christmas Perfection (Nov. 25, 10 p.m. ET/PT on Lifetime) Picture Perfect/REX/Shutterstock STARS: Caitlin Thompson, James Henri-Thomas, Robbie Silverman CONTAINS: Control freak learning to let go and embrace spirit of holidays OFFICIAL SYNOPSIS: “As a kid, Darcy (Thompson) had no control over her family’s holidays and thus, has grown up to be a Christmas control freak — so much so that she loses sight of what the holidays actually mean. Suddenly, she finds herself magically transported into her idea of the perfect Christmas Village and learns that 'perfection' isn’t all it’s cracked up to be.\"\n\n38 of 80 A Very Nutty Christmas (Nov. 30, 8 p.m. ET/PT on Lifetime) Lifetime STARS: Melissa Joan Hart, Barry Watson, Marissa Winokur, Conchata Ferrell, Rizwan Manji CONTAINS: Heartbroken baker, magical ornament, unexpected romance OFFICIAL SYNOPSIS: “Hard-working bakery owner Kate Holiday (Hart), has more cookie orders than she has time to fill this holiday season, and when her boyfriend suddenly breaks up with her, any shred of Christmas joy she was hanging onto, immediately disappears. After Kate hangs the last ornament on the tree and goes to bed, she awakens the next morning to a little bit of Christmas magic. She gets the surprise of her life when Chip (Watson), a handsome soldier who may or may not be the Nutcracker Prince from Tchaikovsky's “The Nutcracker,” appears in her living room.”\n\n39 of 80 A Christmas Prince: The Royal Wedding (Nov. 30 on Netflix) Netflix STARS: Rose McIver, Ben Lamb, Alice Krige, Honor Kneafsey, Sarah Douglas, Emma Saunders, Daniel Fathers, Tahirah Sharif, Joel McVeagh CONTAINS: Christmas wedding, kingdom in jeopardy OFFICIAL SYNOPSIS: “A year after Amber helped Richard secure the crown, the two are set to tie the knot in a royal Christmas wedding - but their plans are jeopardized when Amber finds herself second-guessing whether or not she's cut out to be queen, and Richard is faced with a political crisis that threatens to tarnish not only the holiday season, but the future of the kingdom.”\n\n40 of 80 A Twist of Christmas (Dec. 1, 8 p.m. ET/PT on Lifetime) Bettina Strauss/Lifetime STARS: Vanessa Lachey, Brendon Zub CONTAINS: Department store confusion, unexpected single-parent romance OFFICIAL SYNOPSIS: “In the frenzy before Christmas, two single parents — busy working mom Abby (Lachey) and her son, and overwhelmed lawyer Ryan (Zub) and his daughter — accidentally mix up their toys at a crowded department store. As a result, both of their Christmases appear to be ruined. Although the two can’t stand each other, the only way to get things back on track is to help each other salvage their holiday plans – not realizing they're falling for each other in the process.\"\n\n41 of 80 Chandler Christmas Getaway (Dec. 1, 11 p.m. ET/8 p.m. PT on UPtv) Derek White/UPTV STARS: Malinda Williams, Victoria Rowell, GregAllen Williams, DeEtta West CONTAINS: Familial feuds, cabin chaos OFFICIAL SYNOPSIS: “The Chandler family is back for another family Christmas adventure! Not finding any Christmas spirit during a hot December, the Chandlers to pack up and head to a cabin for maximum holiday fun. But with old feuds, new feuds and a heap of holiday stress, the Chandler family will have to pull together to make this the best Christmas ever.”\n\n42 of 80 The Christmas Switch (Dec. 2, 5 p.m. ET/2 p.m. PT on UPtv) UPTV STARS: Jackie Seiden, Ashley Wood, Oana Gregory, Houston Rhines, John Patrick Jordan CONTAINS: Mall collision, body swapping mothers, music business OFFICIAL SYNOPSIS: “Christmas works its magic in this body-switching holiday tale about two very different moms who find that help is where you least expect it and most need it. When struggling singer Audrey and wealthy record executive Julia collide at the mall, they wake up in each other’s lives the next morning. Audrey finds that, though Julia’s life is full of luxury, she’s missing the chance to connect with her family in any real way. Julia finds that though she gets plenty of family time, Audrey can’t say no to anyone, which gives her no time for herself. As Christmas looms closer, the two women rush to figure out how to both help each other and switch back before they miss Christmas morning with their own families!”\n\n43 of 80 Christmas Catch (Dec. 2, 7 p.m. ET/4 p.m. PT on UPtv) UPTV STARS: Emily Alatalo, Franco Lo Presti, Yanic Truesdale CONTAINS: Hot suspect in diamond heist, detective whose romantic life has run cold OFFICIAL SYNOPSIS: “Detective Mackenzie Bennett loves Christmas. But her plans to spend the holidays with her family, friends – not to mention a handsome new stranger who just moved to town – are put on hold when the F.B.I. tells her that her gorgeous new friend is a suspect in a diamond heist. Now, under cover (and under tight supervision), Mack finds herself getting close to a man who might be a criminal, but who also might be the man of her dreams!”\n\n44 of 80 Merry Wish-mas (Dec. 2, 7 p.m. ET/PT on TV One) TV One STARS: Tamela Mann, David Mann, Kim Fields, Towanda Braxton, Chrystale Wilson, Elizabeth Omilami CONTAINS: Single businesswoman, wellness facility, reunion of high school friends OFFICIAL SYNOPSIS: \"Merry Wish-mas revolves around single, successful businesswoman Kenni (Tamela Mann) who hasn’t returned home to the quaint town of Columbia, South Carolina in years. When she finally does, she’s reacquainted with Jessie (David Mann), an old high school friend with a fledgling wellness facility – The Beverly Living Center. She’s instantly thrown into the lives of the center’s residents and is reminded of the transformational power of love, hope and faith, amplified by the spirit of the holidays.\"\n\n45 of 80 The Christmas Pact (Dec. 2, 8 p.m. ET/PT on Lifetime) Sean Cox/Lifetime STARS: Kyla Pratt, Jarod Joseph, Kadeem Hardison, Jasmine Guy CONTAINS: Decades-old Christmas tree, friendship blossoming into love OFFICIAL SYNOPSIS: Can best friends fall in love? That's the question next door neighbors Sadie (Pratt) and Ben (Joseph) will answer as they keep the spirit of Christmas and the magic of their childhood pact alive! When they were eight years old, they planted a scrawny 3-foot tall Christmas tree behind their church and the Christmas Pact began. But as life gets in the way the pact is threatened to be broken. Ben and Sadie need some Christmas Magic to recommit to each other and promise to keep their special holiday traditions. With each Christmas that passes by, Ben and Sadie's Christmas tree grows taller and stronger; and so does their love. The pact bearing fruit to the magic of Christmas and the undeniable answer. Yes, friends can fall in love!”\n\n46 of 80 A Majestic Christmas (Dec. 2, 8 p.m. ET/PT on Hallmark Channel) Daniel Haber/Crown Media STARS: Jerrika Hinton, Christian Vincent CONTAINS: Holiday homecoming, job-promotion stress, a plan to save the town's playhouse OFFICIAL SYNOPSIS: \"Christmas in the charming town of Briar Falls will be bittersweet this year when architect Nell (Hinton) goes back to her hometown having been given the job of turning the historic Majestic Playhouse into a modern multiplex, much to the town’s objections. The Playhouse has been home to their annual Christmas tableaux, which will now have to end after a long and historic tradition to the town. This job is Nell’s first promotion, and one she wishes she hadn’t been chosen for, especially when she meets the new owner of the theater, Connor (Vincent), whose vision and ideas clash with Nell’s. Since Connor hasn’t had much experience celebrating Christmas, Nell hopes that if she can give him a crash course in Christmas during the town’s Twelve Day Festival, that he might just change his mind about modernizing the Majestic.\"\n\n47 of 80 Christmas Cupid’s Arrow (Dec. 2, 9 p.m. ET/PT on ION Television) ION STARS: Elisabeth Harnois, Jonathan Togo, Chad Michael Collins, Sasha Jackson CONTAINS: Dating website, Cyrano-esque deception, academic love OFFICIAL SYNOPSIS: “Holly, a professor at a small college, has had a long history of finding the wrong guy. She’s accomplished quite a bit in her life, but after her younger sister announces she is pregnant, Holly decides she is going to make an effort to meet Mr. Right. Meanwhile, David, another professor, is a single father, very smart and kind, but not the type that Holly takes notice of when the two are assigned to plan the Christmas Formal. At the insistence of her best friend, Holly signs up for the dating website ‘Cupid’s Arrow’ where she meets Josh, an attorney just hired by the school. He’s everything she wants on the surface, but has little to say beyond his work and good looks. Josh and David were roommates in college, so Josh recruits David to write poetic messages in an attempt to win Holly over. Eventually, Holly notices that Josh’s spoken words don’t match the glowing, beautifully written texts and emails she’s grown to adore. After confronting Josh, she begins to realize that the man she fell in love with may just be the one who wrote those words to her.”\n\n48 of 80 Once Upon a Christmas Miracle (Dec. 2, 9 p.m. ET/PT on Hallmark Movies & Mysteries) Allen Fraser/Crown Media STARS: Aimee Teegarden, Brett Dalton CONTAINS: One organ transplant, not one but three Christmases OFFICIAL SYNOPSIS: \"Told she would have less than a few months to live without a liver transplant, Heather Krueger’s time was running out when a kind stranger, Chris Dempsey, heard of her plight and discovered he was a perfect match. The two met and before long a friendship developed into romance. The movie follows Heather and Chris’ journey over three Christmases as his selfless gesture leads to a Christmas miracle for everyone involved. Based on a true story.\"\n\n49 of 80 Life-Size 2 (Dec. 2, 9 p.m. ET/PT on Freeform) Guy D'Alema/Disney Channel STARS: Tyra Banks, Francia Raisa CONTAINS:A CEO in crisis, a magical doll, and no Lindsay Lohan OFFICIAL SYNOPSIS: \"Grace Manning (Raisa) is the confident and funny CEO of Marathon Toys, a huge toy company started by her mother that is most famous for manufacturing the iconic Eve doll. Grace is also in the middle of her quarter-life crisis and realizing that she is in over her head as CEO. To make matters worse, her wild-child ways are causing the company’s stock to plummet. With the help of her young next-door neighbor, Grace’s old Eve doll (Banks) magically awakes to help get Grace back on track and give her the confidence to be the woman and leader Eve knows Grace can be.\"\n\n50 of 80 Shoelaces for Christmas (Dec. 2, 9 p.m. ET/6 p.m. PT on BYUtv) BYUtv STARS: Mia Topalian, Bailey Chase, Yolanda Stange, Jessica Morris as Jan Miller CONTAINS: Fight with mom, mandatory volunteering OFFICIAL SYNPOSIS: “After an altercation with her ailing mother, Jennifer, a self-absorbed teenager inadvertently stumbles into a local homeless shelter late one evening. Upset with his daughter’s selfish attitude, Jennifer’s father offers an ultimatum which includes her volunteering at the shelter in the hope she will learn to be responsible and compassionate toward others. Through this new experience Jennifer creates an unlikely bond with both the staff and one very special young guest which lead her to a deeper understanding of the true meaning of Christmas is love and family.”\n\n51 of 80 Christmas Lost and Found (Dec. 7, 8 p.m. ET/PT on Lifetime) Lifetime STARS: Tiya Sircar, Ed Ruttle, Diane Ladd CONTAINS: Lost family Christmas ornaments, Scavenger hunt, wise grandmother OFFICIAL SYNOPSIS: \"After years of missing family gatherings, New York City event planner Whitney Kennison (Sircar) is off to Chicago to spend Christmas with Grandma Frances (Ladd). Excited that her granddaughter is finally home for the holidays, Frances decides to bestow Whitney with the precious Kennison family Christmas ornaments. But when Whitney mistakenly throws out the box of ornaments, Grandma Frances must stealthily devise a fun Christmas scavenger hunt to remind Whitney what the holiday is all about. It's a race against time as Whitney reclaims the family ornaments, finds romance and learns the lesson Grandma Frances imparts.\"\n\n52 of 80 Pooka! (Dec. 7, streaming on Hulu) Richard Foreman, Jr. SMPSP/Hulu STARS: Nyasha Hatendi, Latarsha Rose, Jon Daly, Dale Dickey, Jonny Berryman, Diane Sellers CONTAINS: Struggling actor, plush suit, murder OFFICIAL SYNOPSIS: “A struggling actor gets a holiday season job as a Christmas character in a plush suit to promote the hottest toy of the year, Pooka. At first it’s a fun and friendly distraction, but he slowly develops two personalities--one when he’s in the suit, and one that’s outside it--as Pooka slowly starts to take possession of him.”\n\n53 of 80 Homegrown Christmas (Dec. 8, 8 p.m. ET/PT on Hallmark Channel) Kailey Schwermann/Crown Media STARS: Lori Loughlin, Victor Webster CONTAINS: Holiday homecoming, reignition of old flames, Christmas dance OFFICIAL SYNOPSIS: \"After stepping down as CEO of her dream job, Maddie (Loughlin) heads home for the holidays to gain perspective. She finds herself running into her old high school sweetheart Carter (Webster), and tensions quickly arise. When forced to put together a Christmas dance for the local high school, Carter and Maddie find themselves putting their differences aside and rediscover what made them fall in love all those years ago.\"\n\n54 of 80 Santa's Boots (Dec. 8, 8 p.m. ET/PT on Lifetime) Lifetime STARS: Megan Hilty, Noah Mills, June Squibb CONTAINS: Holiday homecoming, family business in jeopardy, disappearing Santa OFFICIAL SYNOPSIS: \"When Holly (Hilty) returns home for Christmas expecting the same as any other year, she's blindsided to learn her family’s department store is on the brink of foreclosure. To keep the business going, Holly fills in as Santa’s Helper and meets the surprisingly young and handsome Nick (Mills), who has been hired to play Santa at the store this year. Their undeniable chemistry and charisma draw in big crowds, until suddenly, Nick disappears. As Christmas day inches closer, Holly scrambles to find Nick with only one clue – his misplaced black boot.\"\n\n55 of 80 Memories of Christmas (Dec. 8, 9 p.m. ET/PT on Hallmark Movies & Mysteries) Bettina Strauss/Crown Media STARS: Christina Milian, Mark Taylor CONTAINS: Inheritance, the pressure to carry on the traditions of a late mother, lots of house decorating OFFICIAL SYNOPSIS: \"Noelle (Milian) was raised by the queen of Christmas. When she inherits her late mother's house, she finds out that her mother had been hiring someone to decorate it — Dave (Taylor). The deal is off, but Dave convinces Noelle to let him carry on the tradition. As the display goes up, Noelle’s defenses start to come down. She embraces the town’s Christmas gala that was her mother’s legacy, finds unexpected love, and develops a joy for the holidays that she never thought possible.\"\n\n56 of 80 Rent-an-Elf (Dec. 8, 9 p.m. ET/PT on ION Television) ION STARS: Kim Shaw, Sean Patrick Thomas, Nicholle Tom, Yohance & Zakei Biagas-Bey, Debbi Morgan, Luke Jones CONTAINS: Single dad, ex-wife, conflicted entrepreneur OFFICIAL SYNOPSIS: “Type-A personality, Ava, owns ‘Rent-an-Elf,’ a business in which she sets up a memorable Christmas for busy families. This year, she's hired by the newly-single Liam and falls for him and his adorable son, Nathan. But, just as Ava thinks she’s found her match, Liam’s ex-wife returns, wanting to patch things up. Even though Ava decides to put Liam and Nathan's happiness above her own, she's still determined to give them the best Christmas ever, and maybe even hope for a Christmas miracle or two.”\n\n57 of 80 Christmas with a Prince (Dec. 9, 7 p.m. ET/4 p.m. PT on UPtv) UPTV STARS: Kaitlyn Leeb, Nick Hounslow, Charles Shaughnessy CONTAINS: Reignition of old flames, a royal pain in the leg, pediatric ward OFFICIAL SYNOPSIS: “Pediatric specialist Tasha Miller is focused on one thing; keeping the kids in her ward as healthy and happy as possible. So when her high-school crush, who just happens to be handsome Prince Alexander Cavalieri, breaks his leg on a nearby ski-slope, Tasha is forced to allow him to secretly get well on her floor, and she’s furious that a spoiled Royal is interrupting the precious healing time her kids so badly need. Soon, however, Tasha learns that some tough love and a lot of Christmas spirt, could turn this royal pain into a knight in shining armor. Based on the best-selling Harlequin book St. Piran's: Prince On The Children's Ward.”\n\n58 of 80 Welcome to Christmas (Dec. 9, 9 p.m. ET/PT on Hallmark Channel) Marcel Williams/Crown Media STARS: Jennifer Finnigan, Eric Mabius CONTAINS: Car accident, small-town charm in jeopardy OFFICIAL SYNOPSIS: \"Resort developer Madison Lane (Finnigan) is tasked with finding a location for a new ski resort. While she’s prepared to recommend the resort be placed in Mountain Park, her boss tells her to take a trip to Christmas, Colo., to consider the location and the incentive package they’re offering. On her way into town to meet with the mayor, Madison has a minor fender-bender with the town’s welcome sign. Town Sheriff Gage McBride (Mabius) gives Madison a ride into town so she can attend the meeting while the car is towed and repaired. Little does Madison know that the town is on a mission to convince Madison that Christmas is the best place for the new ski resort. While stranded, Madison grows to love the community and the spirit of Christmas that runs throughout. Is a resort really the right move for Christmas? Or would the town be better off keeping its charm and traditions intact?\"\n\n59 of 80 A Christmas in Tennessee (Dec. 9, 8 p.m. ET/PT on Lifetime) Lifetime STARS: Rachel Boston, Andrew Walker, Patricia Richardson, Caroline Rhea CONTAINS: Earnest baker, attempted corporatization of a small-town OFFICIAL SYNOPSIS: \"Allison Bennet (Boston), along with her daughter Olivia and mother Martha (Richardson), run a bakery in the small mountain town of White Pines, Tennessee. When Matthew (Walker), a charming real estate developer, tries to buy the town for a corporate ski resort, Allison and the townspeople must work together to prevent that from happening. And just when the Bennet ladies seem out of luck, an unexpected visitor — with a well-known sweet tooth for cookies and milk — comes to the bakery and may in fact be the key to solving everything.”\n\n60 of 80 Time for Me to Come Home for Christmas (Dec. 15, 9 p.m. ET/PT on Hallmark Movies & Mysteries) Ryan Plummer/2018 Crown Media United States, LLC STARS: Josh Henderson, Megan Park CONTAINS: Canceled flight due to snowstorm, alternate forms of transit, travel companions ultimately bonding over their professional struggles related to their dead parents OFFICIAL SYNOPSIS: \"Based on the song by Blake Shelton and the book by Dorothy Shakleford and Travis Thrasher. It’s the last Friday before Christmas in New York City and a massive storm is brewing. Small-town business woman Cara Hill is meeting with her banker while country music star Heath Sawyer is playing Madison Square Garden. When the flight to Tulsa they’re both booked on is canceled, this unlikely pair of strangers winds up traveling together. Each has a secret — Heath hasn’t written a song since his father died, and Cara’s mother recently passed and her family’s jam business is failing. Will Christmas provide a miracle — and a chance at love? Time for Me to Come Home for Christmas is a touching story about finding a way home after a loss — to your family and to your own true self.\"\n\n61 of 80 A Snow White Christmas (Dec. 9, 9 p.m. ET/PT on ION Television ION STARS: Carolyn Hennesy, Michelle Randolph, Liam McNeill, Colt Prattes, Richard Barnes CONTAINS: Inheritance in jeopardy, wicked step mom, amnesia, the seven dwarfs reimagined as the Holy Jollies OFFICIAL SYNOPSIS: “When Blanca Snow is faced with spending Christmas with her dastardly stepmother, Victoria, she attempts to fulfill her late father’s wishes and create new memories as a family. However, Victoria plots to edge Blanca out of her father's inheritance and keep the money and his mansion, for herself. She plans to renovate the house by hiring a talented designer, Lucas Prince, but when he falls in love with Blanca, Victoria is jealous and outraged. With the help of her assistant, Zane, Victoria has Blanca hypnotized, so she will forget everyone and everything about her father’s will. When Blanca wakes up in a quaint motor lodge out of town with severe amnesia, she receives the help of seven quirky friends, the Holly Jollies, to help her figure out her life. While attempting to regain her memory, she finds herself the object of affection to both house painter Hunter, and Lucas Prince. But, who can she trust? And will she finally remember her past, and stop Victoria from stealing everything her father built?”\n\n62 of 80 No Sleep 'Til Christmas (Dec. 10, 9 p.m. ET/PT on Freeform) John Medland/Freeform STARS: Odette Annable, Dave Annable, Charles Michael Davis CONTAINS: Stressed-out wedding planner, sleep issues, real-life couple playing potential love interests OFFICIAL SYNOPSIS: \"An unexpected and whimsical holiday romantic comedy about two insomniac strangers plagued by exhaustion. Lizzie (Annable) is a high-end event planner preparing for her own life’s biggest event -- her wedding. She lies awake nightly while her devoted fiancé, Josh (Davis), rests peacefully, unaware of how to solve her issue. When a sleep-deprived incident causes her to run into Billy (Annable), a low-key bartender who is just as sleepless and frustrated as she is, they discover that they can only fall asleep while next to each other. What seems like an odd coincidence, and frankly a disruption to their lives, might be more meaningful than they’d like to admit.\"\n\n63 of 80 Christmas Around the Corner (Dec. 14, 8 p.m. ET/PT on Lifetime) Albert Camicioli/Lifetime STARS: Alexandra Breckenridge, Jamie Spilchuk, Jane Alexander CONTAINS: Big Apple businesswoman heading to Vermont for the holidays, unfortunate flood, plan to save the book store OFFICIAL SYNOPSIS: \"Claire (Breckenridge), a savvy venture capitalist from New York City, escapes to a quaint town in Vermont for the holidays and becomes a guest of the Fortenbury Bookstore. Upon arrival, Claire finds Christmas celebrations have been canceled by the town after a flood and the bookstore is in a dire state of disrepair. She immediately takes on the challenge to revitalize the store, but clashes with the owner, Andrew (Spilchuk), who initially rejects all her proposed improvements. Eventually, sparks fly as the two begin a budding romance, and Claire’s infectious optimism inspires Andrew to join her in reviving the yuletide spirit. But everything comes to a screeching halt when Claire discovers that Andrew is planning to sell the bookstore in the New Year. Will the spirit of Christmas be enough to change Andrew’s mind and encourage him to follow his heart?\"\n\n64 of 80 Entertaining Christmas (Dec. 15, 8 p.m. ET/PT on Hallmark Channel) Ryan Plummer/Crown Media STARS: Jodie Sweetin, Brendan Fehr CONTAINS: Talk of the family \"brand,\" journalist falling in love with his story, Vermont OFFICIAL SYNOPSIS: \"Claire is a cookbook author, crafting expert, and television personality whose name is synonymous with perfection. As she contemplates retirement, her daughter Kara (Sweetin) is poised to become the new face of the Livingston brand. The only trouble is, Kara can’t cook. Or sew. Or do any of the signature things her mother is known for. When a young girl posts a video online requesting Claire help welcome her deployed father home for Christmas, Kara is sent in her place in an effort to prove herself a worthy successor to the board of directors and win the job. As Kara does her best to make a good impression, she gets more than she bargained for when the young girl’s uncle Joe turns out to be a reporter for the local paper, looking for his next story.\"\n\n65 of 80 Northern Lights of Christmas (Dec. 15, 9 p.m. ET/PT on Hallmark Movies & Mysteries) Iden Ford/Crown Media STARS: Ashley Williams, Corey Sevier CONTAINS: Aspiring pilot, surprise inheritance, reindeer, handsome ranch hand OFFICIAL SYNOPSIS: \"Zoey Hathaway (Williams) has been working towards her lifelong goal of being a pilot for years, but everything is thrown off-course when she unexpectedly inherits a reindeer farm, along with the dangerously handsome ranch hand Alec Wynn (Sevier). Now buried in taking care of reindeer and all the Christmas responsibilities, Zoey thinks life has delivered her a strange and cumbersome blow, and she isn’t sure about Alec, who has his own ideas how best to run things. Alec, who has never had many people have faith in him, opens up when Zoey invests trust in him, and the two find themselves falling for each other. Could they both find happiness in the most unlikely of circumstances right before Christmas?\"\n\n66 of 80 Christmas Pen Pals (Dec. 15, 8 p.m. ET/PT on Lifetime) Allister Foster/Lifetime STARS: Sarah Drew, Niall Matter, Michael Gross CONTAINS: Freshly single person, dating app, secret pen pals, reconnecting with high school sweetheart OFFICIAL SYNOPSIS: “Following an unexpected breakup weeks before Christmas, Hannah (Drew), tech wiz and creator of the dating app, Perfect One, heads home for the holidays, challenged to save her failing business by re-conceiving a new romantic dating model. Upon her return she runs into her high school boyfriend, Sam (Matter) who she has carefully avoided for years and reluctantly makes a deal with her dad, Ted (Gross) to sign up for the town’s Christmas Cupid, an anonymous holiday pen pal service. As the season progresses, Hannah is smitten by each beautifully written letter she receives and starts to believe that her Christmas pen pal could be her soul mate. It’s not until Christmas Eve that everyone must reveal their true identities to their pen pals, even if it means coming face to face with the last person they ever expected.”\n\n67 of 80 A Gingerbread Romance (Dec. 16, 8 p.m. ET/PT on Hallmark Channel) Kailey Schwerman/Crown Media STARS: Tia Mowry-Hardrict, Duane Henry CONTAINS: Gingerbread house contest, single-dad baker OFFICIAL SYNOPSIS: \"With Christmas just weeks away, the architecture firm Taylor works for enters her in a contest in which the teams will design and build life-sized gingerbread houses. After the contest, Taylor will likely be getting a promotion to a position in another city. The firm teams her up with Isabelle, a renowned French pastry chef with whom Taylor instantly locks horns. When Isabelle backs out, Taylor stumbles into a local bakery and meets Adam, a baker and single dad. In an act of desperation, Taylor convinces Adam to partner with her for the contest, arguing that winning would give the bakery and his designs much-needed exposure. For years Taylor has been resistant to call anywhere 'home' for fear it will only be temporary. But the time she spends with Adam and his daughter in their cozy home, decorating for the holidays and exploring the town at Christmas, fills her with a longing for a place to call home.\"\n\n68 of 80 Country Christmas Album (Dec. 15, 9 p.m. ET/PT on ION Television) ION STARS: Hannah Barefoot, Evan Gamble, Taylor Bedford, Alexander Kane, Kevin Crowley, Will Blagrove CONTAINS: Down-and-out country star, romantically charged recording sessions OFFICIAL SYNOPSIS: “After country music starlet Tess Stapleton’s album sales keep dropping, her label forces her to record a Christmas album with ex-teen heartthrob and pop-star, Derek Copeland, in an attempt to resurrect each’s career. Reluctantly, Tess agrees. At first, they appear to be polar opposites; clashing over song styles and irritated that they were forced together. However, to their combined surprise, as the album shapes up, they find themselves growing closer over their shared love of music. As they finish the album sparks begin to fly and love blooms just in time for Christmas.”\n\n69 of 80 A Christmas in Royal Fashion (Dec. 16, 9 p.m. ET/PT on ION Television) ION STARS: Cindy Busby, Diarmaid Murtagh, Michael Paré CONTAINS: Fashion show, hot prince, precocious assistant, mistaken identity OFFICIAL SYNOPOSIS: “Kristin Cooper, a talented assistant for a global PR firm, is put in charge of the annual Christmas fashion show and auction for clothing entrepreneur, Mr. Carson. A handsome young royal, Prince Patrick, is dispatched by his father, the King of Edgemoor, to be the face of the family co-sponsored event. Upon his arrival to Beverly Hills, Patrick meets Kristin and is instantly smitten with her, mistakenly thinking she is actually her boss, Melanie. While Patrick and Kristin spend the Christmas season together in California, she wonders if Patrick would have still fallen for her if he knew she was an assistant, and not the boss.”\n\n70 of 80 Christmas on Holly Lane (Dec. 16, 7 p.m. ET/4 p.m. PT on UPtv) UPTV STARS: Sarah Lancaster, Karen Holness, Gina Holden CONTAINS: House in jeopardy, reunion of childhood friends OFFICIAL SYNOPSIS: “The house on Holly Lane has always held a special place in the hearts of life-long best friends Sarah, Cat and Riley. It’s the magical home where they spent many happy Christmases. Now, the girls are all grown-up and the house they hold dear is in danger of being sold. With each friend at a different crossroad, they will all have to come together to call upon that special Christmas magic that can only happen on Holly Lane.”\n\n71 of 80 Coins for Christmas (Dec. 16, 7 p.m. ET/PT on TV One) TV One STARS: Stephen Bishop, Essence Atkins, TC Carson, Kelly Price, Karlie Redd CONTAINS: Single mom in financial distress, tax-delinquent ex-husband, financially strapped ex-pr football player OFFICIAL SYNOPSIS: \"Coins for Christmas chronicles single mom Madison (Atkins) who’s saved all year to make sure her teenage kids have the best Christmas ever. That is until she gets fired from the bookstore she manages and comes home to find that the IRS has frozen her bank account due to delinquent taxes her ex-husband failed to pay. Desperate to pay bills and buy gifts for her children, Madison jumps into the ever-popular “gig economy.” That’s when she meets and eventually gets hired by arrogant, sidelined former professional football player Alec Darby (Bishop), who is also secretly on the verge of going broke. This odd couple butts heads time and time again, but they eventually forge a friendship. And, to their surprise, they learn a lot about themselves and teach one another how to be better people.\"\n\n72 of 80 Christmas at Grand Valley (Dec. 22, 9 p.m. ET/PT on Hallmark Movies & Mysteries) Ben Mark Holzberg/Crown Media STARS: Danica McKellar, Brennan Elliott, Dan Lauria CONTAINS: Holiday homecoming, artist rediscovering her passion in more ways than one OFFICIAL SYNOPSIS: \"Burned out from the hubbub of the Chicago gallery world, artist Kelly (McKellar) returns home to the picturesque Grand Valley just in time for Christmas. Maybe her favorite town’s shining season will reinvigorate her love of art and guide her down her next path. Leo (Elliott), businessman and all-star dad to his children, struggles to balance his time this holiday season. When he is assigned to review a hotel in Grand Valley for its value, he sees this as the perfect opportunity for a Christmas family vacation. It isn’t long until Kelly and Leo’s worlds collide. As Kelly re-experiences her favorite Grand Valley traditions with Leo and his children, she begins to find her way back to her passion for art.\"\n\n73 of 80 Hometown Christmas (Dec. 16, 8 p.m. ET/PT on Lifetime) James Billeaudeau/Lifetime STARS: Beverley Mitchell, Stephen Colletti, Melissa Gilbert, Danny Boaz CONTAINS: Holiday homecoming,reconnecting with high school sweetheart, nativity scene OFFICIAL SYNOPSIS: \"Back in Louisiana for Christmas, Noelle Collins (Mitchell) has big plans to resurrect the town's live nativity, a beloved tradition that her late mother used to put on. Things become complicated, however, when Noelle runs into her high school sweetheart, Nick Russell (Colletti), a rising baseball star also back home due to a recent injury. Still feeling the burn from their senior year break-up, their lives are pushed together even further when they learn their parents share an attraction and want to be more than just friends. When things begin to fall apart with the live nativity, Nick and Noelle reluctantly team up to pull off the show and find themselves growing close, uncovering a hometown love for each other and the joy of Christmas that both never really faded away.\"\n\n74 of 80 Hometown Holiday (Dec. 23, 7 p.m. ET/4 p.m. PT on UPtv) UPTV STARS: Sarah Troyer, Bradley Hamilton CONTAINS: Big-city/small-town romance, “the latest internet sensation” OFFICIAL SYNOPSIS: “High-powered music executive Ryan is so desperate to sign the latest internet sensation to his label that he agrees to accompany his sister to a country wedding just to get the chance to meet him, but he also meets a beautiful small-town girl and falls head-over-heels for her. Now, through a year of mistaken identities, misunderstandings and masquerades, the two will need to hope that a lot of love and some Christmas magic can bring them together. Based on the best-selling Harlequin book The Maverick's Holiday Masquerade.”\n\n75 of 80 Jingle Around the Clock (formerly Christmas Copy) (Dec. 22, 8 p.m. ET/PT on Hallmark Channel) Bettina Strauss/Crown Media STARS: Brooke Nevin, Michael Cassidy CONTAINS: College reunion, unlike romance with corporate rival OFFICIAL SYNOPSIS: \"When Elle Bennet decides to reunite her college friends for a special Christmas celebration, her plans are thwarted by an opportunity at work she can’t pass up — spearheading a Christmas campaign relaunch to prove she’s ready for a career-altering promotion. Much to her surprise, she’s forced to team up with advertising campaign 'fixer' Max, who has a completely different take on the holidays. But as Elle and Max work together and learn more about each other’s Christmas traditions, they unexpectedly find themselves falling for each other. Despite being pulled in so many directions, with the help of a little Christmas magic, will Elle pull off the perfect Christmas reunion, earn the promotion of her dreams, and ultimately find the love she’s been searching for?\"\n\n76 of 80 Small Town Christmas (Dec. 16, 9 p.m. ET/PT on Hallmark Movies & Mysteries) Kailey Schwerman/Crown Media STARS: Kristoffer Polaha, Ashley Newbrough CONTAINS: Book tour, resolution of five-year-old ghosting OFFICIAL SYNOPSIS: \"Author Nell Phillips’ first book has become a surprise best-seller of the Christmas season. Nell’s last stop on a nationwide book tour takes her to the town of Springdale, the hometown of Emmett Turner, a young man she met over five years ago while both were junior copy editors at a New York publishing company. Nell was hurt when Emmett stood her up for a dinner date and then disappeared from New York without any explanation. As Nell is quick to admit, Emmett’s colorful, nostalgic anecdotes about Springdale inspired her to write this book that is shaping her life and especially this holiday season.\"\n\n77 of 80 Christmas Made to Order (Dec. 23, 8 p.m. ET/PT on Hallmark Channel) Fred Hayes/Crown Media STARS: Alexa PenaVega CONTAINS: Family reunion, holiday coordinator falling for client OFFICIAL SYNOPSIS: \"When architect and Christmas amateur Steven finds himself hosting his family for Christmas, he recruits holiday coordinator Gretchen (PenaVega) to bring holiday joy to his home. Gretchen’s expert Christmas spirit brings Steven’s family together, but neither expected it to bring them closer to each other. After a great opportunity presents itself to Gretchen, she and Steven must decide what’s really important in life.\"\n\n78 of 80 Christmas Bells are Ringing (Dec. 23, 9 p.m. ET/PT on Hallmark Movies & Mysteries) Ryan Plummer/Crown Media STARS: Emilie Ullerup, Josh Kelly CONTAINS: Holiday homecoming, Christmas wedding, romantic reunion with childhood friend OFFICIAL SYNOPSIS: \"Samantha, a freelance photographer, is returning to Cape Cod for the first time since the death of her mother years earlier. She’s going to celebrate her father’s Christmas Eve wedding to the lovely Helen but is anxious to revisit past memories. However, having never been to the Cape during winter, she finds that it is a whole new experience. On deadline for a big Christmas spread that could ignite her career, she enlists the help of her childhood friend, Mike, to show her around. In the time she spends in Cape Cod with her dad, Helen, and Mike, she finds meaning in her creative pursuits, falls in love, and realizes that Christmas is wherever your family is.\"\n\n79 of 80 When Calls the Heart Christmas (Dec. 25, 8 p.m. ET/PT on Hallmark Channel) Bettina Strauss/Crown Media STARS: Erin Krakow, Lori Loughlin, Jack Wagner, Pascale Hutton, Kavan Smith, Paul Greene CONTAINS: Holiday stranding, plan to save orphange, baby on way OFFICIAL SYNOPSIS: \"When a group of orphans become stranded in Hope Valley for Christmas, their caretakers — sisters who have a mysterious backstory — lead Bill (Wagner) to investigate the circumstances of their arrival. He discovers the sisters and their orphanage are in jeopardy, so Abigail (Loughlin) and the other residents rally to make it a Christmas to remember for the orphans. Elizabeth (Krakow), who is preparing for the birth of her child, organizes her students to engage in selfless gift-giving. That, along with a Christmas miracle, help bring wonder, hope, joy, and love to all this Christmas season.\"", "images": ["https://ew.com/thmb/agW9FFWo0VpksrIgDBGkJ2nFZ40=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/day09_christmasinlove_0194_cb-2000-0c002700ac4a4407a3daed372185cf9a.jpg", "https://ew.com/thmb/cKZy6VJZ3pAO7682t9QbsQO-emw=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/poinsettians-for-christmaass-day-9-525-2000-370e21cdcf084031b9e0bee17407390a.jpg", "https://ew.com/thmb/IrC2N_k_6KNkMNbKFn8DhD3W38A=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/chirstmas-lost-found-20-2000-9ae3d88032e54057ad6b7f43d01ace2e.jpg", "https://ew.com/thmb/wc0NjAqwVaSRtwPY3OeQ83_LCLc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/sam-elliott-landman-111725-1-8e595d731f4642f59db1837f3ebfa30c.jpg", "https://ew.com/thmb/QLBhKNno1GGG-5SOQWAjV2zb_ac=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/homegrownchristmas_0453_rt-2000-4d320e3e059c49398aa3c86664537ef7.jpg", "https://ew.com/thmb/i5UlgStZ05tTEysOFg8n7HsM25M=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/the-christmas-pact-2000-deca1c7d0021465c8f9ad3e8bd80c037.jpg", "https://ew.com/thmb/2q1dh9-lQJCqpJAu8B6ed62BAdg=/200x200/filters:no_upscale():max_bytes(150000):strip_icc()/dan-snierson-image-e8eafc84ad414cf6a624df2bc2a24ab2.png", "https://ew.com/thmb/R_-5pTWXSMAAjheAJ9-tJqZbFcA=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/ashoeaddictschristmas-1129_rt-2000-bf2bb845110a40a3a6003766f176cd7a.jpg", "https://ew.com/thmb/6A57-wX516w759Hrdttg-aBiD_A=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/roadtochristmas_0638_rt-2000-0d8754fe3076426fb26d5382ccae7a85.jpg", "https://ew.com/thmb/H_evck41kuEU4emTVXDWg7Qy_CA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/landman-season-2-111425-2-1fed28170c33436f8003b3bc77d4eace.jpg", "https://ew.com/thmb/iZr46yOVOduMYIxo3FdbSF7ugNY=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/jingle-belle-2000-8d5ca0020db2405e8313676ed8c648cf.jpg", "https://ew.com/thmb/S2WYb3CvU034PZllykGbpcoWRts=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/marryingfatherchristmas_0536_cb-2000-47985ae666b64e97957a6bdb1628ae3c.jpg", "https://ew.com/thmb/ah7LD9zh9Hyz4aiiGf9bhhmJbJg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/THEBEASTINME-111425-02-8b04d5e1d91e40da8406a17c8cc3a887.jpg", "https://ew.com/thmb/i-rPGolglOzOQ_mGE4DKZgrXhPc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Christmas-Movie-Gallery-102225-ab45aa1da1d3423ebe9989d8f6fb3224.jpg", "https://ew.com/thmb/b7Cd8PmmtMTBVt-zLQqAjodpE04=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/itschristmaseve_0571_rt1-2000-ffff280b78c541cd8ad295d457732715.jpg", "https://ew.com/thmb/rIsOiOZmfsmH7Gdvziodij7Lajs=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/christmas-around-the-corner-2000-93bf7efe1185433cba1d9fc92bf9fa73.jpg", "https://ew.com/thmb/fdg38ucGqN2BM7GSK1zAIX-blBc=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/christmasbellsareringing_0134-2000-eae487224c3a4e998857fceba8dc2509.jpg", "https://ew.com/thmb/kTVGX1lzMu5ssa7hCs-7nlyXz48=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/uptv-christmas-1-2000-815b5172d3464e639bd678fe6e81e1fc.jpg", "https://ew.com/thmb/EN7be1rESJbM9CWWgU8TojTofPw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/911Nashvillemidseasonfinale-111325-01-1c807f4e295d4624992adf8deb1ceed1.jpg", "https://ew.com/thmb/5c3PXfdVVGwtxZvg1IWV1CUVglk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/no-reservations-anthony-bourdain-this-is-life-with-lisa-ling-worst-cooks-in-america-anne-burrell-022025-64c9f9478c8848ea910cce4cdfd8e174.jpg", "https://ew.com/thmb/7lC2CXdbQ5zMh7qwdjx_NaB1qv0=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/onceuponachristmasmiracle_0304_cb-2000-c0575c4ca7404ab5bf7b05f5b76e8c5f.jpg", "https://ew.com/thmb/2mOtxtDMkUz5SkSEgYYPpANXx-o=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/amajesticchristmas_-451_cb_rt-2000-b683806cc8f04dae8281efaa2c4238c4.jpg", "https://ew.com/thmb/cIHU0hYdd-M4GQxih1F4wkQXn_8=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/a-christmas-arrangement-2000-18bf705744e64937b7dbe609045cfa13.jpg", "https://ew.com/thmb/NTkAOucLYq7nbhjgBERjZjJadHk=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/wcth5-ep5001-2_1174_cb-2000-3ca29004a3254c73b4c59ad8f7d37386.jpg", "https://ew.com/thmb/gLFOgjoIIyFaFeHNDp9sO0B0GVE=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/agingerbreadromance_0171_cb_rt-2000-669c61e63869487b8749529b394e67b3.jpg", "https://ew.com/thmb/lYosvatnChI89HJZnSgNYY72Wy4=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/enchantedchristmas_0102_cb-2000-27eebe22983945c1bca8bdff32bd3483.jpg", "https://ew.com/thmb/OJxkBtO1sLytscLCvAAEikXhdds=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Jennifer-Garner-and-Judy-Greer-13-going-on-30-110425-a6943112b0974c508900a99d08c1ccd3.jpg", "https://ew.com/thmb/eLQBG6wXGRU5JHkP2Y1Vmq_I6nc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/LandmanSeason2cast-111325-3ff187e5a04c49f0aa139bf9628bd0b9.jpg", "https://ew.com/thmb/ROvV8mhHW9eGSsZy_W_llqQf8NU=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/christmas-on-honeysuckle-lane-1-2000-bb2c0522d3cf4309abe7c62a20f01302.jpg", "https://ew.com/thmb/gEGd8hp-1y-eNIvKI8GKG1eZgwA=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/ion-christmas-1-2000-b980d85889924a1997a2e0e1cb68dda3.jpg", "https://ew.com/thmb/NHtd3IDo5j2WAjhZ9iyUbPIYCwQ=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/christmasinevergreen_0756_cb-2000-bbf7f652ba8b46f5a9b4707d568d242e.jpg", "https://ew.com/thmb/9iu6AYimUUatX40DNCW5XUzLlHE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Apple-TV-Best--30412ebc8e6f444c94330ef79fd752f3.jpg", "https://ew.com/thmb/OVWxMBAHs5hyQgWzVtyP1dJgAp0=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/northernlightsofchristmas_0242_cb_rt-2000-4755a8de3481422991a2adaf3a0c38f2.jpg", "https://ew.com/thmb/zIM8qXa4J0EDgMM2bGMRwUoPeck=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/White-Christmas-Emmett-Otter-and-The-Holdovers-328-110525-52d5f77a35fa4d05b2cb5f31f9ca666e.jpg", "https://ew.com/thmb/aKSS9iue-Ye5fPVYy3YTIqi0g6I=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/mingle-all-the-way-1-2000-c6b132230fe34e1ab3b6b63d27616ebd.jpg", "https://ew.com/thmb/o3E9oYzSIWnIfF15YXvN7qi8jEM=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/no-sleep-til-christmas-freeform-2000-033b5c84f4ff47529e608da9ad27463c.jpg", "https://ew.com/thmb/PaICEdoQIjME4SyIqVSYYwrsEHs=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/christmas-pen-pals-day15_0166-079eb5aab6f84821aed735367069757c.jpg", "https://ew.com/thmb/_tDr50ml6JG46rNbx3FrSLReRUM=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/hallmark-movies-1-2000-5c752956ac9c4cab99729876009e63fa.jpg", "https://ew.com/thmb/rMgeFOVM3Yvu_YAo6E32xL-iJlU=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/holidaycalendar_katgraham_001-2000-6a11acc5e8ca4b988a348f677c80fdbb.jpg", "https://ew.com/thmb/Gl361hSGU32HLEw59UKNdsvdu6Y=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/thechristmascottage-0090_rt-2000-752042ec8fd04f2e8e407b00458c98b3.jpg", "https://ew.com/thmb/SjBZCoPcVHu4g6cbrbGfqXntWAg=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/christmas-everlasting-1-2000-d663526abf184116b7cc08f3988d49bd.jpg", "https://ew.com/thmb/YvBYiEXVaLtQVKRGT3Y7hA00yy0=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/christmasjoy_467_rt-2000-9f6637f4a35d486d814cfcd9c2c06b16.jpg", "https://ew.com/thmb/0vyKskitKPLG_XsryR1MO-Jnj5c=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/santas-boots-2000-5888850cab8c4748afd54d018c59ff7d.jpg", "https://ew.com/thmb/eVgfFo_dIkjGOAvIPzRNQTNHdjE=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/christmasatgraceland_0933_cb-2000-e6332a2994e64a48bc52530f95a1c2f6.jpg", "https://ew.com/thmb/LClCSXgX4kd5YAqJByNew8VY7YQ=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/christmas-wonderland-1425_cb_rt-2000-c49fe9832cea4d9caa43a0c32e7ed733.jpg", "https://ew.com/thmb/WJ0cjhObHKZ-CFXDW7hCkiiCVgA=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/everyday-is-christmas-2000-27be6530cd094ce8a74b708257724ba2.jpg", "https://ew.com/thmb/27uRwJOlOohJ_kVZhv9xCg0NKsA=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/uptv-christmas-4-2000-3911c0c8867345b5a7ee96b2c4a6e090.jpg", "https://ew.com/thmb/aYQiqYjGd1p4t8_g_ztTXg9WsPg=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/the-christmas-chronicles-2000-e46db044cfc242e5a7202490cc321858.jpg", "https://ew.com/thmb/ftUiGSTyApgFzWrk07-gv0goAcM=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/holiday-movies1-2000-8b0985c1091e44889b3da28f6a5acd29.jpg", "https://ew.com/thmb/MKsL9v2fACsk_z1Mcf5F9Bq2vhU=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/reunited-at-christmas-1-2000-9f38e20c269d4427b07b46a0c70d0161.jpg", "https://ew.com/thmb/jGFXTyvfrL943v1T_11w9rWG0KQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Billy-Bob-Thornton-Landman-season-2-110325-9ea88739629247b78b68183e86ff34d2.jpg", "https://ew.com/thmb/c6LuyxHm95NeebftmgmAEL34Bl4=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/memoriesofchristmas_0148_cb_rt-2000-af4b250b4e3f482599cb0880ac143fa5.jpg", "https://ew.com/thmb/FTCLmj3WOUWESN3LCibRzoO8qPM=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/a-veterans-christmas-1-2000-a1e126ed30ac43b0a2e3e3f4f69849d9.jpg", "https://ew.com/thmb/_urfhH1iLYZCl-IagDNR3-rEucU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/chicago-fire-taylor-kinney-111225-a0f4a99b27764b63940dcb1a37f6fe41.jpg", "https://ew.com/thmb/-fij6v6BjJTDVN5JTy5E7B5nu6U=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/prideprejudiceand-mistletoe_0197-2000-ee6c6a1f5404483ca96771d895b8295e.jpg", "https://ew.com/thmb/wG_Ht4S2_lXHe6tfe2idZPWixJM=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/ion-christmas-4-2000-869a16cc6f9a4c369182d08c301c5f34.jpg", "https://ew.com/thmb/QkQn8z9NI6oRYOiWcfOZzqlqRgI=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/cprw_unit_11034-2000-8f7826d092044adf9894b70f64855edb.jpg", "https://ew.com/thmb/TrnmbNd1HFKKTMxd8Ow3VTeIyTg=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/hometown-christmas-2000-7a90b604202f4c939a7a76432bbedc5c.jpg", "https://ew.com/thmb/3QA1Rvy-7E3qlJ94ETTZBfPXXzc=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/angelofchristmas1504-2000-6f212a632a4644a18d0fe585b5138c5c.jpg", "https://ew.com/thmb/u3WawbpT2PutyiCtPqGLV9sJglE=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/coins-for-christmas-tv-one-2000-c26906228f6f4bf995c4af66fc0c8535.jpg", "https://ew.com/thmb/vrDtEypmf2mjV9zr3ejWdmz6tm4=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/lifesize2-freeform-2000-01a8d179c230498a80cf2aa8d81f8384.jpg", "https://ew.com/thmb/eXRO7PnAY5JvZBOuwiOE9OSI8Zw=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/uptv-christmas-7-2000-55e4af44f7654cbaaac49d50838adf8a.jpg", "https://ew.com/thmb/7u-EuBX-JGURrn5Ir6ALngTMbEQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Apple-shows-031523-bb6dce38b19c4acb9e1a9fdae1a57860.jpg", "https://ew.com/thmb/CmgvdUg4hGa045ZZ6nBsKhIYGA4=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/christmas-at-grand-valley_0183-2000-b95eb7e96f75494f9f6a2d83d19fbfba.jpg", "https://ew.com/thmb/DpRFjrTNJmVqoIzM_J41sJ-5lXc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/holiday-movies1-2000-8b0985c1091e44889b3da28f6a5acd29.jpg", "https://ew.com/thmb/xu5LqglaKvIn_xL1US2-j-DFkTI=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/hallmark-movies-2-2000-ac34eb84eb314b559b936269f716b190.jpg", "https://ew.com/thmb/iuTZHSYyUU8EQPODqh7StmA6l6w=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/a-very-nutty-christmas-2-2000-0806c2f8e51a4b22ba145e2eaa57c388.jpg", "https://ew.com/thmb/EeM_hQwMUFnVlhI4PKyszjYcglI=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/enchantedchristmas_0048_cb-2000-62e91c2b7bf74f19ab7de5cdd59aa1b1.jpg", "https://ew.com/thmb/uBcI4q6qpsPzllRJViSpnXeHez4=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/shutterstock_editorial_1688331e_huge-2000-5f04a21a870e49909c5c4b549f590912.jpg", "https://ew.com/thmb/ghisAoQx6wG3XLiKF_niaNN6Sms=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/ion-christmas-6-2000-361e966382e247559e4138ff6317183c.jpg", "https://ew.com/thmb/oNrQJm3PvCe9Uh3KkaAeXcfxZvM=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/xps_unit_05229-2000-594b1a460536417a8b1afa5e8988f9cb.jpg", "https://ew.com/thmb/3u-qX7k4oVPYPfb0GZoTClUq3o8=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/hope-at-christmas-1-2000-74f8358b195344ebb81ddf6ec7c2bd6f.jpg", "https://ew.com/thmb/jSQcErg6_NMNuHVirNe0xxCjQmo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Reindeer_3x2-22d667b5cbb449a6a1b69e123637f15f.jpg", "https://ew.com/thmb/bJum5Fzy3gG2AVw35Xvxx_VmMNc=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/time-for-me-to-come-home-for-christmas-1-2000-7e74b011e64a433d9df395e7b704d8f6.jpg", "https://ew.com/thmb/uMeyIIO7n-97KmGq-QZsAWD-o3I=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/uptv-christmas-6-2000-8e05a8ac83b241129ec8aa4ca52e0d19.jpg", "https://ew.com/thmb/5ItXW3HiB3ZVrE6Ctjbq7fmZ064=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/a-christmas-in-tennessee-2000-174865406b824b728ca495294d1746be.jpg", "https://ew.com/thmb/ifXOe3w7K-v7UEY7AqkxW8dUA3Y=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/the-truth-about-christmas-freeform-2000-cdb6d6c110104a1aa8d60fc273b2b44c.jpg", "https://ew.com/thmb/UGdj5ucdt8KP68L1jQl2H4EJcsE=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/uptv-christmas-2-2000-bdafb21a59ea44dbb25c566eb1d53839.jpg", "https://ew.com/thmb/sGgcuOZaLWaCABQTfuFMHw-fKto=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/A-Keller-Christmas-Vacation-091625-9d66ebacfa934724b01406c24356beae.jpg", "https://ew.com/thmb/plc0vk32VziKw4FZHfLXtYcwU-o=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/return-to-christmas-creek-1-2000-98b7c1fa8e504d2899e7891d85ba3dfc.jpg", "https://ew.com/thmb/KCLaT-N50skXTZ_EAligh31wDrE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Jingle-Bell-Heist-Olivia-Holt-A-MADEA-CHRISTMAS-Tyler-Perry-A-Merry-Little-Ex-Mas-Pierson-Fode-Alicia-Silverstone-111225-b072376ccda848078dcf9059c2060427.jpg", "https://ew.com/thmb/pQsLHDmuG1eS6OywXZe5Eo0akRw=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/day02-raw-christmasatpemberleymanor_-342_cb-2000-ffbd6c12e839426f9a33fbed32e6e1c1.jpg", "https://ew.com/thmb/x5ZSMNzsEBLBULfuvcY4mvvlbnE=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/the-christmas-contract-2-2000-ea85a52f5db149c7964559e5529bf4d8.jpg", "https://ew.com/thmb/e5skuGBgKQTvCcjWyyeuf34RC0Q=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/every-other-holiday-lifetime-2000-efbfc9b5e7de485899e276633ec54ece.jpg", "https://ew.com/thmb/Fc4JeRJat8kQFEMKVfdGcGZ4bQk=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/ion-christmas-3-2000-0f71d373c4ea4ac8bbaa4dd98ecfd1b1.jpg", "https://ew.com/thmb/CJgiu101TVlmZEbEWp9QEGVMyDQ=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/christmas-harmony-2000-a9a369272a1f44f69be77e32535f5885.jpg", "https://ew.com/thmb/8bogZ7v1GjcvPq5PnveL8TNtMHE=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/pooka-2000-4d528ea0423a4a3986d9b9c913a6a804.jpg", "https://ew.com/thmb/hC6_5Mhoqc7WVxnyQIo_0z_h3mk=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/agodwinkchristmas_0648_rt_rev1-2000-9c912f8277294a2fb5eab124d31f47fc.jpg", "https://ew.com/thmb/4sANSzGAezY2wRW8PlmlfV3OCns=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/uptv-christmas-5-2000-7714349a59d54240a7962547bcffbe81.jpg", "https://ew.com/thmb/aIhdOSLFAlkz8tZudt64WGdmhrg=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/uptv-christmas-3-2000-323b982fbd764138b2b2e9a10172aafa.jpg", "https://ew.com/thmb/3N8DlgbJzDetl4wrR38fjAjMcrU=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/jinglearoundtheclock_0754_cb_rt-2000-66f40ff2cfcb4e27a3c16d9d5e140316.jpg", "https://ew.com/thmb/DKAF66mViv2OPU5zql0Emmh-6m4=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/ion-christmas-2-2000-f3907267a5934ad38e0eb4d4203c4df5.jpg", "https://ew.com/thmb/dXosYPr-DhrqX3WP3gGZO3zsj7o=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/my-christmas-inn-lifetime-2000-23652d6574b84d639c9c9fc315893761.jpg", "https://ew.com/thmb/4_mv8AdZSb48YjphL8dW9qdBmF8=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/uptv-christmas-8-2000-f281a0e855ac45f3ab699e707999b254.jpg", "https://ew.com/thmb/a-0TBMuMAdmXcizZuQxczv0MWVk=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/a-twist-of-christmas-2-2000-b775543e48c24d99911aec7404c9eeff.jpg", "https://ew.com/thmb/pyK3fnnHpCazqIINmbEo3Vguuts=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/ion-christmas-5-2000-a7a663bd96a54c4bbf0e95039c052c82.jpg", "https://ew.com/thmb/72SDkTDPM_9kFL0vmi_lyUx3pWo=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/findingsanta_0480_cb-2000-4bd081753b5b426eb7c6a8a284c12ecf.jpg", "https://ew.com/thmb/zzNV4Pydv-oEiSPdqlUNt4Y2KA0=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/merry-wishmas-tv-one-2000-87037cbe6ae64b949cab08e73d75e96a.jpg"], "top_img": "https://ew.com/thmb/DpRFjrTNJmVqoIzM_J41sJ-5lXc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/holiday-movies1-2000-8b0985c1091e44889b3da28f6a5acd29.jpg", "keywords": [], "authors": ["Dan Snierson Is A Former Senior Writer At", "Ew'S Editorial Guidelines", "Kristen Baldwin", "Allison Degrushe", "Emlyn Travis", "Randall Colburn", "Samantha Highfill", "Lauren Huff", "Ilana Gordon", "Briana Richert"], "canonical_link": "https://ew.com/tv/2018-new-christmas-tv-movies-airdates/", "title": "Here's when all 79 new Christmas TV movies will air", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Candace Cameron Bure, Melissa Joan Hart, Tyra Banks, Vanessa Hudgens, Chad Michael Murray, and many more are here with holiday cheer.", "parsely-section": "TV", "parsely-tags": "TV Industry,Entertainment Weekly,TV Genres,TV,Drama Shows,Fall TV,Hallmark,TV Reviews", "article": {"section": "EW", "author": "https://www.facebook.com/entertainmentweekly"}, "og": {"type": "article", "site_name": "EW.com", "url": "https://ew.com/tv/2018-new-christmas-tv-movies-airdates/", "title": "Here's when all 79 new Christmas TV movies will air", "description": "Candace Cameron Bure, Melissa Joan Hart, Tyra Banks, Vanessa Hudgens, Chad Michael Murray, and many more are here with holiday cheer.", "image": "https://ew.com/thmb/DpRFjrTNJmVqoIzM_J41sJ-5lXc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/holiday-movies1-2000-8b0985c1091e44889b3da28f6a5acd29.jpg"}, "twitter": {"card": "summary_large_image", "site": "@EW", "title": "Here's when all 79 new Christmas TV movies will air", "description": "Candace Cameron Bure, Melissa Joan Hart, Tyra Banks, Vanessa Hudgens, Chad Michael Murray, and many more are here with holiday cheer.", "image": "https://ew.com/thmb/DpRFjrTNJmVqoIzM_J41sJ-5lXc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/holiday-movies1-2000-8b0985c1091e44889b3da28f6a5acd29.jpg"}, "vf": {"url": "https://ew.com/tv/2018-new-christmas-tv-movies-airdates/"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.104.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.104.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.104.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.104.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.104.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://ew.com", "summary": ""}