{"url": "https://www.sbs.com.au/guide/article/2017/10/30/no-tv-show-did-crazy-melrose-place", "text": "If Twitter had been around in the '90s, TV sensation Melrose Place would have crashed it. It really was that big, up there with Seinfeld , Dawson’s Creek , Friends , Buffy the Vampire Slayer , The X-Files and ER . The decade was a purple patch for iconic network TV, as chronicled in new SBS documentary The Nineties .\n\n\n\n\n\nFrom soap supremo Aaron Spelling and creator Darren Star, Melrose Place was the guilty pleasure that went from ratings stinker to zeitgeist sensation. After a lacklustre first season, which followed the lesson-of the-week format of its predecessor, Beverly Hills, 90210 , creator Darren Star and his team changed tack for the spin-off's second season. Queen bitch Amanda Woodward was elevated to series regular (although actress Heather Locklear continued to be billed as \"special guest star\" until she left in season seven) and bonkers-soap convention was thoroughly embraced.\n\n\n\n\n\nRatings skyrocketed, and all of a sudden, the 4616 Melrose Place, West Hollywood apartment complex became a hotbed of murder, sex, blackmail, betrayal, fights, and enough weddings and divorces to spin the revolving door of an LA courthouse off its axis. Not to mention cheesy dialogue, over-the-top acting and questionable production values. In short, it was craptacular TV.\n\n\n\n\n\nThe scope of Melrose Place ’s pop cultural cache was evident when it became a plot point in other '90s hits Seinfeld and Reality Bites , Judge Lance Ito requested videotapes of the show for jurors during OJ Simpson’s murder trial and Melrose Place viewing parties became a thing. Even Woody Allen apparently liked it.\n\n\n\n\n\nThe show’s scheming, bed-hopping residents became household names, most notably seedy Dr Michael Mancini (Thomas Calabro), his put-upon ex-wife, Jane (Josie Bissett), her devious sister, Sydney (Laura Leighton), all-round wet fish Billy (Andrew Shue), advertising exec Alison (Courtney Thorne-Smith), hunky mechanic Jake (Grant Show), and, of course, Amanda. The show’s other main villain, Dr Kimberley Shaw (Marcia Cross), didn’t reside at Melrose, but (spoiler alert) she did blow it up.\n\n\n\n\n\nIt was Kimberly who was responsible for many of the now-iconic plot shockers that had up to 14 million viewers in the US tuning in at the show’s peak. While it eventually outstayed its welcome after seven seasons and 220 episodes, in its heyday, the more the show jumped the shark, the more audiences seemed to like it. The only storyline the audiences wouldn’t tackle? “We wouldn’t have done alien abduction,” says Star. “The show was slightly grounded.”\n\n\n\n\n\n“Slightly” being the operative word, as you’ll see in our top five of Melrose ’s craziest moments.\n\nKimberly wigs out\n\nIn true soapie tradition, everyone thought Kimberly had been killed in a car accident caused by her drink-driving lover, Michael, but she never actually died at all. Turns out, she’d been stashed away in a coma for some 17 episodes, returning in the season two episode \"The Bitch Is Back\" with a new unhinged drive to cause havoc. That wasn’t the only type of damage-baggage she was carrying post-accident.\n\n\n\n\n\nIn arguably the series’ most iconic moment – one that caught viewers completely off guard – Kimberly held her head in pain in front of a bathroom mirror only to suddenly rip off a wig to reveal close-cropped hair and a massive head scar worthy of Frankenstein’s monster.\n\nJane and Sydney bury Jane’s ex alive\n\nWhen Jane was involved in a violent confrontation with business partner and ex Richard (Patrick Muldoon), who'd raped her, Sydney saved the day by hitting him over the head with a shovel. Thinking him dead, Jane and Sydney donned their best cat burglar wear to bury Richard in the woods. “It’s OK, Jane. The nightmare’s over,” said Sydney as they drive off.\n\n\n\n\n\nExcept it wasn't. As the camera panned to what must have been a very shallow grave, a hilariously clawing hand rose through the rubble in what appeared to be an impression of Thing from The Addams Family . Skip ahead to the 9:05 mark in the video above to relive the action.\n\nKimberly blows up Melrose Place\n\nIn her descent into madness, Kimberly was possessed by Henry the Hobo Demon (Zitto Kazann), who told her to kill everyone who'd wronged her by blowing up the apartment complex. It was the series’ biggest (but admittedly quite cruddy) set piece, and viewers were left hanging as the season three finale closed with a deranged Kimberly pressing the detonator. The first episode of season four revealed who survived (it was all of them except a forgettable, one-episode guest star) but the tantalising cliffhanger had made it all worth it.\n\n\n\n\n\n“If there was a shark, we were jumping it. And it didn’t matter,” Show reminisced to The Hollywood Reporter this year for Melrose Place ’s 25th anniversary.\n\nJane, who is really Kimberly, runs over Michael\n\nKimberly (Marcia Cross) disguised as Jane (Josie Bissett) mowed down Michael (Thomas Calabro) for revenge. Source: Fox In the two-hour season two finale, Kimberly donned a blonde wig, stole Jane’s car and ran over Michael in the Wilshire Memorial Hospital car park to make it look like Jane did it.\n\n\n\n\n\nTurns out Jane had conveniently threatened to kill Michael for being the general douche he is. Kimberly also wanted to kill him for the same reason and joined forces with Sydney to frame Jane, even though Jane saved Michael from Kimberly and Sydney’s previous car-related attempted murder. Phew!\n\n\n\n\n\nPoor Jane then found herself in the slammer, while cockroach Michael survived, but with amnesia.\n\nKimberly kidnaps and breastfeeds Jo’s baby\n\nIn a disturbing moment, Kimberly (Marcia Cross) breastfeeds Jo’s (Daphne Zuniga) baby, who she kidnapped. Source: Fox Poor Jo (Daphne Zuniga). Not only was she forced to kill her drug-running lover, to whom she later found out she was pregnant, but his parents shot her in the back and also kidnapped her baby boy. But in soap world, one kidnapping of a baby isn’t enough, so Kimberly kidnapped him too AND breastfed said baby just as Jo walked in to witness it.\n\n\n\n\n\n\n\n\n\n", "images": ["https://images.sbs.com.au/drupal/guide/public/kim_jane_michael.jpg?imwidth=1280", "https://www.sbs.com.au/_next/static/img/common/on-demand-dark-icon-22f32af.svg", "https://www.sbs.com.au/_next/static/img/common/app-icon-on-demand-0a7cc43.png", "https://www.sbs.com.au/_next/static/img/common/podcast-seen-b007e88.png", "https://images.sbs.com.au/dims4/default/a333f13/2147483647/strip/true/crop/1300x731+0+68/resize/1280x720!/quality/90/?url=http%3A%2F%2Fsbs-au-brightspot.s3.amazonaws.com%2Fdrupal%2Fguide%2Fpublic%2Fmelrose_place.jpg&imwidth=1280", "https://images.sbs.com.au/dims4/default/8c16fb1/2147483647/strip/true/crop/1600x900+0+0/resize/1280x720!/quality/90/?url=http%3A%2F%2Fsbs-au-brightspot.s3.amazonaws.com%2Fdrupal%2Fguide%2Fpublic%2Fdaria_0.jpg&imwidth=1280", "https://images.sbs.com.au/dims4/default/ffbdeba/2147483647/strip/true/crop/1200x675+0+111/resize/1280x720!/quality/90/?url=http%3A%2F%2Fsbs-au-brightspot.s3.amazonaws.com%2Fdrupal%2Fguide%2Fpublic%2Fhorsin.jpg&imwidth=1280", "https://www.sbs.com.au/_next/static/img/common/app-icon-news-33003a8.svg", "https://www.sbs.com.au/_next/static/img/common/app-icon-audio-975d5ac.svg", "https://www.sbs.com.au/_next/static/img/common/podcast-gilead-c1d02b4.png", "https://www.sbs.com.au/_next/static/img/logo_ondemand-c6efd37.svg", "https://images.sbs.com.au/dims4/default/a333f13/2147483647/strip/true/crop/1300x731+0+68/resize/1280x720!/quality/90/?url=http%3A%2F%2Fsbs-au-brightspot.s3.amazonaws.com%2Fdrupal%2Fguide%2Fpublic%2Fmelrose_place.jpg", "https://images.sbs.com.au/drupal/guide/public/kimberly-breastfeeds.jpg?imwidth=1280"], "top_img": "https://images.sbs.com.au/dims4/default/a333f13/2147483647/strip/true/crop/1300x731+0+68/resize/1280x720!/quality/90/?url=http%3A%2F%2Fsbs-au-brightspot.s3.amazonaws.com%2Fdrupal%2Fguide%2Fpublic%2Fmelrose_place.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.sbs.com.au/whats-on/article/no-tv-show-did-crazy-like-melrose-place/aowgw93f1", "title": "No TV show did crazy like 'Melrose Place'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "'Melrose Place' was the height of water-cooler TV in the '90s with its bonkers plot twists, bed-hopping and backstabbing. And audiences couldn’t get enough.", "robots": "index,follow", "msvalidate.01": "0E549D3DACFFE4CFCA34DDAAA0180F04", "msapplication-TileImage": "/_next/static/img/common/app-icon_144x144-3d61e68.png", "apple-mobile-web-app-title": "SBS What's On", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black", "twitter": {"url": "https://www.sbs.com.au/whats-on/article/no-tv-show-did-crazy-like-melrose-place/aowgw93f1", "card": "summary_large_image", "site": "@SBS", "title": "No TV show did crazy like 'Melrose Place'", "description": "'Melrose Place' was the height of water-cooler TV in the '90s with its bonkers plot twists, bed-hopping and backstabbing. And audiences couldn’t get enough.", "image": "https://images.sbs.com.au/dims4/default/a333f13/2147483647/strip/true/crop/1300x731+0+68/resize/1280x720!/quality/90/?url=http%3A%2F%2Fsbs-au-brightspot.s3.amazonaws.com%2Fdrupal%2Fguide%2Fpublic%2Fmelrose_place.jpg"}, "language_code": "en", "updated_date": "2017-12-01T02:27:31Z", "article": {"reading_time": 308, "author": "https://www.facebook.com/SBSAustralia/"}, "mobile-web-app-capable": "yes", "og": {"title": "No TV show did crazy like 'Melrose Place'", "description": "'Melrose Place' was the height of water-cooler TV in the '90s with its bonkers plot twists, bed-hopping and backstabbing. And audiences couldn’t get enough.", "url": "https://www.sbs.com.au/whats-on/article/no-tv-show-did-crazy-like-melrose-place/aowgw93f1", "site_name": "SBS What's On", "locale": "en_AU", "image": {"identifier": "https://images.sbs.com.au/dims4/default/a333f13/2147483647/strip/true/crop/1300x731+0+68/resize/1280x720!/quality/90/?url=http%3A%2F%2Fsbs-au-brightspot.s3.amazonaws.com%2Fdrupal%2Fguide%2Fpublic%2Fmelrose_place.jpg", "type": "image/jpeg", "width": 1280, "height": 720, "alt": "'Melrose Place' was the height of water-cooler TV in the '90s with its bonkers plot twists, bed-hopping and backstabbing. And audiences couldn’t get enough."}, "type": "article"}}, "movies": [], "publish_date": 1509336000.0, "source": "https://www.sbs.com.au", "summary": ""}