{"url": "https://www.chicagotribune.com/entertainment/ct-nicole-eggert-details-alleged-scott-baio-sexual-abuse-20180130-story.html", "text": "Actress Nicole Eggert, who has accused her former co-star Scott Baio of molesting her when she was a minor, revealed more details of her alleged harassment and abuse during her first television interview on Tuesday morning.\n\nSpeaking on “Megyn Kelly Today,” Eggert said Baio began to sexually harass and abuse her on the set of their hit ’80s sitcom “Charles in Charge” when the show started in 1986 and she was 14 years old. Eggert was a minor, and Baio is more than 11 years older than her.\n\n“He started expressing his love for me and talking about marriage and the future,” Eggert said of when she was 14 years old. According to Eggert, the sexual abuse started before her 15th birthday when “we were at his house in his car in his garage, and he reached over and penetrated me with his finger.”\n\n“I was very young. It was shocking,” Eggert recalled. “He was playing not only on my emotions, but my hormones and all of those things.”\n\nEggert pointed out the imbalanced power dynamic, noting that Baio was the boss, as the star of the show.\n\nEggert says the abuse continued from the ages of 14 to 17, which is when she and Baio — who, at the time, were often rumored to be a couple — first had sexual intercourse. Eggert admits she was a willing participant, but felt uncomfortable because she was so young.\n\n“My truth is I wasn’t ready to tell my story. For me it was always protecting the show,” Eggert said, defending herself from those who say she was consensually involved with Baio, and has spoken positively about him in previous interviews.\n\nBaio has insisted that Eggert was 18 years old when they first had sex, and Eggert says she was 17 years old, which would legally make her a minor in the state of California.\n\n“There’s no doubt in my mind,” Eggert said when Kelly asked her if she was in fact a minor when she first had sexual intercourse with Baio, which she said he initiated. “It wasn’t a hold-me-down rape me situation, but I was 17. … I just wasn’t ready to tell my story. … It was upsetting. It wasn’t a good experience at all. … It was at my house in my spare bedroom, he laid down a towel and it happened there.”\n\nEggert says after she and Baio had sex, his treatment of her noticeably changed. “He didn’t treat me well on set after it happened. He was quite mean to me,” she explained.\n\nPrior to Eggert’s “Megyn Kelly Today” interview, the actress first accused Baio on Twitter, posting, “Ask Scott Baio what happened in his garage at his house when I was a minor. Creep.”\n\nSoon after, Baio defended himself on Facebook Live, saying Eggert’s accusations have damaged his reputation and are impacting his family. He called Eggert’s allegations “lies,” and recalled back to the garage incident — though his side of the story is that Eggert “seduced” him. “If you have a real claim, you go to the real people, not social media, where people like me get beat up,” Baio said in his Facebook Live video.\n\nOn “Megyn Kelly Today,” Eggert, seated next to her attorney Lisa Bloom, said she is exploring all legal options and is considering filing a police report.\n\nEggert’s “Charles in Charge” castmates, Alexander Polinsky and Adam Carl, have supported the actress and have come to her defense, recalling witnessing Baio’s inappropriate behavior on set.\n\nRELATED STORIES:\n\nActor Scott Baio denies misconduct claims by former co-star\n\nDiane Keaton and Alec Baldwin are Woody Allen’s loudest defenders\n\nDylan Farrow describes alleged Woody Allen assault in first TV interview\n\n.galleries:after {\n\ncontent: ”;\n\ndisplay: block;\n\nbackground-color: #144A7C;\n\nmargin: 16px auto 0;\n\nheight: 5px;\n\nwidth: 100px;\n\n}\n\n.galleries:before {\n\ncontent: “Entertainment Photos and Video”;\n\ndisplay: block;\n\nfont: 700 20px Georgia,serif;\n\ntext-align: center;\n\ncolor: #1e1e1e;\n\nvar playlist = ‘chi_ent_movie_trailers’,\n\nlayout = ‘autoblurb’,\n\niu = ‘%2F4011%2Ftrb.chicagotribune%2Fent’;\n\nWatch the latest movie trailers.", "images": ["data:image/webp;base64,UklGRiQAAABXRUJQVlA4IBgAAAAwAQCdASoBAAEAAwA0JaQAA3AA/v3AgAA=", "https://www.chicagotribune.com/wp-content/uploads/2023/12/2560px-Chicago_Tribune_Logo.svg-1.png", "https://www.chicagotribune.com/wp-content/uploads/migration/2018/01/30/2M5VNZTFGZFHPHID34WVXAOYMI.jpg?w=1024&h=670", "https://secure.gravatar.com/avatar/?s=85&d=mm&r=g"], "top_img": "https://www.chicagotribune.com/wp-content/uploads/migration/2018/01/30/2M5VNZTFGZFHPHID34WVXAOYMI.jpg?w=1024&h=670", "keywords": [], "authors": ["Elizabeth Wagmeister"], "canonical_link": "https://www.chicagotribune.com/2018/01/30/nicole-eggert-details-alleged-scott-baio-sexual-abuse-with-megyn-kelly/", "title": "Nicole Eggert details alleged Scott Baio sexual abuse with Megyn Kelly", "meta_data": {"application-name": "chicagotribune", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "robots": "max-image-preview:large", "tdm-reservation": 1, "mrf": {"authors": "Elizabeth Wagmeister", "canonical": "https://www.chicagotribune.com/2018/01/30/nicole-eggert-details-alleged-scott-baio-sexual-abuse-with-megyn-kelly/"}, "description": "Actress Nicole Eggert, who has accused her former co-star Scott Baio of molesting her when she was a minor, revealed more details of her alleged harassment and abuse during her first television interview on Tuesday morning. Speaking on “Megyn Kelly Today,” Eggert said Baio began to sexually harass and abuse her on the set of […]", "generator": "WordPress 6.8.3", "og": {"type": "article", "title": "Nicole Eggert details alleged Scott Baio sexual abuse with Megyn Kelly", "url": "https://www.chicagotribune.com/2018/01/30/nicole-eggert-details-alleged-scott-baio-sexual-abuse-with-megyn-kelly/", "description": "Actress Nicole Eggert, who has accused her former co-star Scott Baio of molesting her when she was a minor, revealed more details of her alleged harassment and abuse during her first television int…", "site_name": "Chicago Tribune", "image": {"identifier": "https://www.chicagotribune.com/wp-content/uploads/migration/2018/01/30/2M5VNZTFGZFHPHID34WVXAOYMI.jpg?w=1024&h=670", "width": 1024, "height": 670}, "locale": "en_US"}, "article": {"published_time": "2018-01-30T13:18:00+00:00", "modified_time": "2019-03-29T22:36:49+00:00"}, "twitter": {"text": {"title": "Nicole Eggert details alleged Scott Baio sexual abuse with Megyn Kelly"}, "image": "https://www.chicagotribune.com/wp-content/uploads/migration/2018/01/30/2M5VNZTFGZFHPHID34WVXAOYMI.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.chicagotribune.com/wp-content/uploads/2024/02/favicon.png?w=16"}, "movies": [], "publish_date": 1517288400.0, "source": "https://www.chicagotribune.com", "summary": ""}