{"url": "https://people.com/style/best-new-fashion-launches-editors-love/", "text": "Bumblebella by Jill Martin\n\nWhen Jill Martin launched her Bumblebella collection on QVC, she said the goal was to create pieces that are \"comfy and cozy.\" And her latest addition to the line — an oversize hooded cape made out of a lightweight, yet incredibly soft material she calls \"cotton candy plush\" — is exactly that. Martin says she wears it everywhere and with everything (including out to dinner with a slip dress!).\n\nBuy It!\n\nBumblebella by Jill Martin Cape, $47; qvc.com\n\nSummersalt x Markarian\n\nMarkarian x Summersalt\n\nThe sporty confidence of the beloved swimsuit line meets the flirty femininity of the celeb-loved fashion brand's well-known prints, making this a summer swimwear collaboration you'll want to play and pose in.\n\nBuy It! Summersalt x Markarian wrap swimsuit, $135; summersalt.com\n\nJurassic World x Accompany Collection\n\nIf you're one of the millions who headed to the movie theater this weekend to see Jurassic World Dominion, you're now probably looking to get some merch inspired by the summer's top blockbuster.\n\nEnter the Jurassic World x Accompany collection which takes inspiration from the film's theme with a mission-driven product line that gives back. The collection features fair trade homewares and accessories for adults and children, all handcrafted by artisan non-profits in India and Nepal. Accompany makes being a conscious shopper rewarding, easy — and chic.\n\nThe collection ranges from $12.99 to $100 and will be sold at at AccompanyUs.com and at exclusive retail launch partner Ten Thousand Villages, a nonprofit fair trade organization that sells and markets ethically made, handcrafted products made by artisans in countries that experience economic disempowerment and marginalization.\n\nBuy It! Keep It Wild Blanket, $100; accompanyus.com\n\nBuy It! Evolution Carryall, $49.99; accompanyus.com\n\nBuy It! Primal Pillow, $44.99; accompanyus.com\n\nDagne Dover Puff Collection\n\nThere's a reason Dagne Dover launches keep topping our \"love it\" list — the brand is sustainable, stylish and practical for everyday use. The latest Dagne drop is no different. Enter PUFF, a capsule collection featuring four new, summer-ready styles made using the 100% recycled material (each bag reuses 13 to 29 plastic bottles!).\n\n\"We've created four new silhouettes that are meant to carry all of your daily essentials smartly, and fold up to fit easily into any compact space (luggage, closet shelf, car trunk),\" said Jessy Dover, CCO & co-founder of Dagne Dover.\n\nOur summer suitcases just got a whole lot cooler!\n\nBuy It! Dagne Dover Kitty Crossbody. $115; dagnedover.com\n\nBuy It! Dagne Dover Jemi Cargo Tote, $175; dagnedover.com\n\nBuy It! Dagne Dover Rider Shoulder Bag, $125; dagnedover.com\n\nThe Great x Eddie Bauer\n\nThe Great x Eddie Bauer\n\nEddie Bauer's first collab with The Great (the line helmed by celeb stylists Emily Current and Meritt Elliott) was beloved by stars including Reese Witherspoon, Jessica Alba and Mandy Moore, so you better go snag some of their cute spring-ready rain gear before all the celebs snap this collection up!\n\nBuy It! The Great x Eddie Bauer raingear, starting at $30; eddiebauer.com\n\nLeatherology Handbags\n\nleatherology/instagram\n\nGear up for the RTO (or just look like you have your life together) with the celeb-loved brand's new Kress collection, which is stylish, structured and can include an embossed monogram. (Naomie Harris has already been spotted with one!)\n\nBuy It! Leatherology Kress handbags, starting at $225; leatherology.com\n\nFor Two\n\nWhile they wait for their maternity line to launch, New York-based pals Gabby and Anna have created a line of ridiculously cozy sweatshirts to raise awareness of postpartum depression, and funds for Postpartum Support International.\n\nJamie Chung, who recently opened up about her experience with postpartum depression after welcoming twins, modeled the brand's sweatshirt in cream while shouting out the team behind the design.\n\nStrut This x Happily Grey\n\nMary Lawless Lee, the influencer behind Happily Grey, brings her sweet-chic aesthetic to a line of activewear for Strut This, including cool printed sets, cozy cropped sweatshirts and comfy joggers, all in pretty pastels and retro motifs.\n\nBuy It! Strut This x Happily Grey leggings in \"Pistachio,\" $95; strut-this.com\n\nJoe's Jeans 20th Anniversary Collection\n\nThe Los Angeles-based fit-focused brand is celebrating two decades of denim. To pay tribute to its major milestone, the company is launching a Limited Edition 20th Anniversary Collection consisting of its most iconic signature jeans, featuring styles from 2001, 2003, 2004, 2008, 2013 and 2020.\n\nBuy It! 20th Anniversary Pullover, $138; joesjeans.com, The \"Callie\" High Rise Cropped Bootcut Jeans (2008), $228; joesjeans.com, The Shirt Brushed Red Unisex Flannel, $168; joesjeans.com, The \"Charlie\" High Rise Skinny Ankle Jeans (2013), $198; joesjeans.com\n\nJoe's Jeans 20th Anniversary Collection\n\nBuy It! The \"Hi Honey\" Curvy Boot Cut Jeans (2004), $198; joesjeans.com, The \"Honor\" High Rise Vintage Straight (2003), $228; joesjeans.com, The \"Luna\" High Rise Cigarette Ankle Jeans (2008), $228; joesjeans.com, The \"Niki\" Mid Rise Boyfriend Jeans (2020); joesjeans.com, Similar: The \"Charlie\" High Rise Skinny Ankle Jeans (2013), $198; joesjeans.com\n\nKoolaburra by UGG Outerwear Collection\n\nBuy It! Shearling Moto Jacket, (orig. $200) $100; kohls.com, Shearling Hooded Jacket, (orig, $200) $100; kohls.com\n\nKoolaburra by UGG Outerwear Collection\n\nThe cozy cool footwear brand known for its shearling slippers and boots is now launching outerwear. Priced between $140-$200, the collection will be available at select Kohl's stores, kohls.com and QVC.com. Featuring 14 styles in an array of earth tones and cozy fabrications such as micro fleeces and faux shearlings, this outerwear collection is perfect for the chilly temps ahead.\n\nBuy It! Shirt Jacket, (orig. $160) $80; kohl's.com, Similar: Hooded and Quilted Long Coat, (orig. $180) $90; kohl's.com\n\nAqua x Pendleton\n\nThe limited-edition collaboration between Bloomingdale's exclusive brand, Aqua, and the American heritage brand, Pendleton, features must-have pieces in new interpretations of classic Pendleton patterns. There are statement jackets like the Pilot Rock Coat (a reversible style in a quilted sherpa design), along with hooded puffer coat and a quilted cropped jacket. Plus, there are also ready-to-wear styles such as jacquard belted cardigans, French terry hooded sweatshirts, and more ranging from $68 - $198.\n\nBuy It! Pilot Rock Jacquard Belted Cardigan, $148; bloomingdales.com, Pilot Rock Cropped Jacket, $148; bloomingdales.com\n\nAqua x Pendleton\n\nBuy It! Cocoon Puffer Coat, $198; bloomingdales.com, Patterned Long Sleeve Hoodie, $88; bloomingdales.com\n\nAqua x Pendleton\n\nBuy It! Smocked Waist V Neck Mini Dress, $98; bloomingdales.com, Smocked V Neck Blouse, $68; bloomingdales.com\n\nPangaia Denim\n\nThe celeb-favorite sustainable loungewear brand is now launching denim. Under new direction of designer Jonathan Cheung (formerly of Levi's) the collection consists of two jean styles ($225) and one jacket ($275) all available in two different washes. Plus, it's made from Wild Himalayan Nettle fabric and organic cotton, which is extremely strong and durable yet still soft to the touch.\n\nBuy It! Nettle Denim Jacket in Rinse Wash, $275; thepangaia.com, Nettle Denim High-Rise Jeans in Rinse Wash, $225; thepangaia.com\n\nPangaia Denim\n\nBuy It! Nettle Denim High-Rise Jeans in Mid wash, $225; thepangaia.com, Nettle Denim Jacket in Mid Wash, $275; thepangaia.com, Nettle Denim Straight Leg in Rinse Wash, $225; thepangaia.com\n\nRifle Paper Co. x Summersalt Sleepwear\n\nRifle Paper Co. will release its first-ever sleepwear collection with Summersalt. The line-up consists of best-selling Summersalt silhouettes like the Cloud 9 PJ Set, Cloud 9 Cami Slip Dress, Cloud 9 Sleep Shirt and the new Cloud 9 Midi-Length Robe in signature Rifle Paper Co. prints such as Emerald Peacock, Garden Party and Menagerie. All nine styles are crafted from Summersalt's soft recycled charmeuse fabric and come in sizes XS-2X (the brand's sizing is informed by 1.5 million measurements from 10,000 women!). Find the collection (priced from $80.00 to $135.00) at both riflepaper.co and summersalt.com.\n\nBuy It! Menagerie Cloud 9 Pajama Set, $125; riflepaperco.com, summersalt.com\n\nRifle Paper Co. x Summersalt\n\nStrawberry Fields Cloud 9 Pajama Set, $125; riflepaperco.com, summersalt.com, Garden Party Cloud 9 Sleep Shirt, $95; riflepaperco.com, Emerald Peacock Cloud 9 Cami Slip Dress, $80; riflepaperco.com, summersalt.com, Emerald Peacock Cloud 9 Midi Robe, $135; riflepaperco.com, summersalt.com\n\nMy Beachy Side x Emily in Paris\n\nChannel everyone's favorite marketing exec in pieces from this collaboration between luxury resort wear brand My Beachy Side and the Netflix hit series. The Emily in Paris collection is inspired by season 2 of the show, which is set in St. Tropez and will launch in December. From nautical-themed lace cover-ups to terrycloth swimwear, this line screams chic 1920s French Riviera.\n\nBuy It! My Beachy Side L'eau Mini Skirt, $199; mybeachyside.com\n\nMy Beachy Side x Emily in Paris\n\nBuy It! My Beachy Side Bimini Bralette, $69; mybeachyside.com\n\nToms x Wildfang\n\nThe mission-focused brands combined their shared socially conscious goals on a capsule collection that gives back. Featuring everything from coveralls to crew length socks to Toms' iconic shoe styles in updated fabrics, all purchases benefit LA-based nonprofit ProjectQ, which provides resources to LGBTQIA+ youth.\n\nBuy It! Toms x Wildfang Socks, $14.95; toms.com, Toms x Wildfang Blue Coveralls, $188; toms.com\n\nToms x Wildfang\n\nBuy It! Toms x Wildfang Alpargata Mallow Sneakers, $79.95; toms.com, Toms x Wildfang Alpargata Sneakers, $54.95; toms.com\n\nKeds Chunky Sneakers\n\nThe American heritage sneaker brand is getting in on the '90s fashion comeback with its latest collection, including five new sneaker styles featuring a built-in wedge platform. The capsule will not only add a little edge to your fall wardrobe, but thanks to the on-trend, thick chunky soles your look will be TikTok-approved.\n\nBuy It! Keds Demi Mid TRX Sneakers, $84.95; keds.com\n\nDetre Everyday Denim Jacket\n\ncourtesy detre\n\nFrom Dede Raad (the influencer behind style blog Dress Up Buttercup), comes the next drop from her Detre jacket collection. The sustainably conscious line includes this fall essential, which is slightly cropped and features balloon sleeves and raw hems. The collection also touts seeded hangtags that can be planted and will eventually bloom into wildflowers, inspired by Raad's mom and her love of gardening.\n\nBuy It! Detre Everyday Denim Jacket, $88; shopdetre.com\n\nAE77\n\nAmerican Eagle Outfitters just launched its newest fashion line — and it's shaking up the sustainable denim market.\n\nAE77 is a new premium denim brand, consisting of nine core classic jean styles (ranging from $168-$188) designed and sustainability made in N.Y.C., all crafted with a \"planet-first mindset.\"\n\nThat means sustainable raw materials (sourced through the Better Cotton Initiative) are used whenever possible and Green Chemistry is used in jean production to \"reduce or eliminate hazardous substances commonly used in washing.\"\n\n\"AE77 denim is meant to be lived in, repaired, and recycled — paired with clothing, and accessories for an iconic wardrobe,\" the press release states.\n\nBuy It! AE77 Classic Denim, $188; ae77denim.com\n\nAE77\n\nAE77 also features an assortment of \"timeless tops\" featuring recycled cashmere, knits made in L.A., Japanese flannel shirts and vintage fleece.\n\nBuy It! AE77 Eyelet Top, $198; ae77denim.com\n\nAE77\n\nAE77 styles are available to shop online at ae77denim.com or at the brand's first storefront in N.Y.C.\n\nBuy It! AE77 Cashmere Sweatshirt, $248; ae77denim.com\n\nMonica Rose x Sarah Chloe\n\nCourtesy of Sarah Chloe\n\nCelebrity stylist Monica Rose (the mastermind behind Shay Mitchell and Chrissy Teigen's Instagram-friendly ensembles) just launched a collection of jewelry in collaboration with the brand Sarah Chloe. The line features everyday pieces like stackable rings, pendant necklaces and hoop earrings, plus trendier styles like a body chain and ankle bracelet.\n\nBuy It! MRXSC Edit \"Liliana\" XL Hoop Earrings, $145; sarahchloe.com\n\nAndie Intimates\n\nCourtesy Andie\n\nPeople (including Demi Moore!) go nuts for the brand's well-cut and comfy swimwear — now they're bringing that \"simple perfection\" idea to comfy undies.\n\nBuy It! Andie plunge bralette, $28, andieswim.com and brief, $12, andieswim.com\n\nAndie Intimates\n\nCourtesy Andie\n\nBuy It! Andie tank bralette, $28, bikini and brief, $12 each, andieswim.com\n\nRails Denim\n\nCourtesy Rails\n\nCelebrities are obsessed with this brand's supersoft button-downs and feminine dresses, so we expect a similar A-list adoration for the brand's classic and cool denim line.\n\nBuy It! Rails \"Melrose\" jeans, $188; railsclothing.com\n\nRails Denim\n\nCourtesy Rails\n\nBuy It! Rails \"Canyon\" skirt, $138; railsclothing.com\n\nAlo Stunner Sunglasses\n\nAlo\n\nThe brand beloved for their flattering, on-trend activewear just launched eyewear — and that's an expansion we can get behind! Available in three colorways, the oversized, mirror-reflective wraparound frames feature durable, scratch-resistant nylon and anti-fog treatment.\n\nBuy It! Alo Stunner Sunglasses, $150; aloyoga.com\n\nPop-In@Nordstrom x Levi's\n\nLevi's\n\nNordstrom shoppers will see some extra-special Levi's pieces in stores and online this fall, thanks to Pop-In@Nordstrom's new partnership with the denim giant, featuring special collections from three cool, female-founded brands: Collina Strada, Thompson Street Studio and Melody Ehsani.\n\nThe embellished, colorful pieces from Collina Strada focus on sustainability and are made from garments already in circulation. Thompson Street Studio's Kiva Motnyk used denim scraps to create her signature patchwork pieces. While designer Melody Eshani was inspired by none other than her rocker husband Flea, and printed his contagious smile on denim truckers and jeans [pictured].\n\nBuy It! Pop-In@Nordstrom x Levi's, $80-$650; Nordstrom.com/pop\n\nPeroni x M.Gemi\n\nCourtesy M.Gemi\n\nThe premium Italian beer brand (Peroni) just teamed with Italy's premier leather accessories brand (M.Gemi) on a sneaker design that just begs to be worn at a summer outdoor happy hour.\n\nThe limited-edition collection features a classic white lace-up shoe made by hand (in both men's and women's styles) containing subtle Peroni design elements throughout, including a blue heel stitched with the alcohol brand's red tag and a \"Made in Italy\" sticker stamped on the side of the sole.\n\n\"We're proud of our Italian heritage and thrilled to partner with a fashion brand that puts the same level of craftsmanship into their shoes as we do our birra,\" Cara Lauritzen, Senior Marketing Manager for Peroni at Molson Coors Beverage Company said in a statement.\n\nBuy It! The Palestra x Peroni women's sneaker, $228; mgemi.com\n\nPeroni x M.Gemi\n\nCourtesy M.Gemi\n\nBuy It! The Lucente x Peroni men's sneaker, $228; mgemi.com\n\nAbercrombie x The Knot Wedding Guest Capsule\n\nAbercrombie and Fitch\n\nWe're about to see an estimated 2.5 million weddings in 2022 (the most in the U.S. since 1984!), according to The Wedding Report, so the hunt for perfect wedding guest outfits is on. Luckily, Abercrombie & Fitch is making shopping a little bit easier. The retailer teamed with The Knot to design 52 women's and men's pieces perfect for every type of wedding event, from the rehearsal dinner to the actual nuptials. The Abercrombie x The Knot \"Best Dressed\" capsule is already starting to sell out, so make sure to snag your favorite style while you still can.\n\nBuy It! Abercrombie x The Knot Wedding Guest Capsule Collection; abercrombie.com\n\nCarbon38 x EleVen by Venus Williams\n\nVenus Williams x Carbon\n\nCarbon38 just debuted its first-ever tennis collaboration with one of the sport's most iconic faces and her lifestyle brand, EleVen by Venus Williams. The collection includes a mix of performance wear and transitional pieces, as well as a variety of silhouettes in the activewear brand's popular Cloud Compression and Micro Terry fabrics.\n\nBuy It! Carbon38 x EleVen by Venus Williams Split Strap Corset Tank In Sky Aqua, $88; carbon38.com\n\nKOI x Vans\n\nKOI x Vans\n\nThe cult favorite Los Angeles-based brand Kids of Immigrants debuted a shoe in partnership with Vans and Greenhouse that honors \"collective upbringings and our parents whose own sacrifices and journeys gave us the opportunity to dream of the unimaginable,\" according to a press release. Available Aug. 18 and Aug. 20 on projectgreenhouse.com, the \"Anything Is Possible\" collab (named after KOI's slogan) is inspired by the classic Vans sneaker and features corduroy, shearling, velvet, paisley and patent leather.\n\nBuy It! KOI x Vans Anything Is Possible; projectgreenhouse.com\n\nNational Geographic x tentree\n\nNat Geo x tentree\n\nNational Geographic teamed up with sustainable apparel line tentree to launch a capsule inspired by trees and the brands' mutual passion for protecting the planet. The 16-piece Plant, Protect, Repeat collection offers women's, men's, unisex and kids products that feature signature tentree styles reimagined with the magazine's gold frame and images of Redwoods, Baobabs and Dragon's Blood trees. For every item purchased from the collection, tentree and National Geographic will plant 10 trees to \"not only reforest our planet, but to lift up impoverished communities, supply clean air for all, restore natural habitats and create a sustainable future for generations to come,\" the press release states.\n\nBuy It! National Geographic Logo Hoodie, $68; tentree.com\n\nCole Haan's 4.ZERØGRAND Loafer\n\nCole Haan\n\nCole Haan is getting into the comfy-cool movement brought on from work-from-home fashions amid the pandemic with its latest shoe launch. The 4.ZERØGRAND All-Day Loafer transforms the classic penny loafer style into a lightweight easy-to-wear shoe that combines a springy cushion with a practical design — perfect for your commute back to the office following a long WFH routine.\n\nBuy It! Cole Haan 4.ZERØGRAND All-Day Loafer, $65; colehaan.com\n\nAmerican Express \"Let's Go Shop Small\" Campaign\n\nCourtesy American Express\n\nAmerican Express is putting the spotlight on small business through its latest campaign. Together with the mobile-first video shopping platform NTWRK, creatives and designers are teaming with their favorite small businesses on special limited-edition product drops.\n\nL.A.-based streetwear designer Melody Ehsani and Bloom & Plume, a L.A.-based floral studio & coffee shop, partnered on the \"Rec set\" comprised of a tote bag, silk bandana, fleece set and socks (launching August 21). Creative Director and designer, Rhuigi Villaseñor, and the L.A.-based restaurant Petit Trois le Valley create a limited edition hat (August 22). While N.Y.C. boutique owner and designer, Telsha Anderson of t.a teamed with the Philly home goods store Yowie on a resin sculpture (on sale Aug. 20).\n\nEach drop will be exclusively available on NTWRK for 24 hours ahead of public sales at each small business, which will be available throughout the weekend of August 20.\n\nBuy It! American Express \"Let's Go Shop Small\" Rhuigi Villaseñor x Petit Trois le Valley hat, $150; NTWRK.com\n\nAmerican Express \"Let's Go Shop Small\" Campaign\n\nCourtesy American Express\n\nBuy It! American Express \"Let's Go Shop Small\" Melody Ehsani x Bloom & Plume \"Rec\" set, $175; NTWRK.com\n\nPhenomenal Woman x Bridgerton\n\nCourtesy Phenomenal\n\nPhenomenal, the brand behind countless viral T-shirts and celeb-loved apparel teamed up with the women-owned lifestyle brand Hill House Home, Netflix and Shonda Rhimes' production company Shondaland to design a collection inspired by the binge-worthy period drama, Bridgerton.\n\nThe launch features Phenomenal's signature crewnecks and hoodies embossed with memorable lines from the Netflix series like \"I burn for you\" and \"dear reader.\" It also includes limited-edition colors of Hill House Home's viral nap dress — thanks to the comfy frock, the brand experienced a 275% increase in revenue growth in 2020, according to WWD — and a hair pin quintessential of the Bridgerton aesthetic.\n\nBuy It! Phenomenal x Bridgerton Collab I Burn For You Crewneck Sweatshirt, $60; phenomenalwoman.us\n\nPhenomenal Woman x Bridgerton\n\nCourtesy Phenomenal\n\n\"Hill House Home is thrilled to be partnering with Phenomenal and Netflix. We are huge fans of Bridgerton, [Phenomenal founder] Meena [Harris], and the amazing business she has built with Phenomenal, so this is our dream collaboration,\" Nell Diamond, founder and CEO of Hill House Home, said in a press release. \"Through this partnership, we're excited to bring visibility to our shared mission of highlighting phenomenal women...We are so excited for fans around the world to own this wearable piece of art.\"\n\nBuy It! Phenomenal x Bridgerton x Hill House Home Collab Jeweled Hair Slide, $40; phenomenalwoman.us\n\nLindsi Lane\n\nCourtesy Lindsi Lane\n\nFashion industry vet and Instagram influencer Lindsi Lane designed her own collection of pieces that span the divide between comfy and fancy.\n\nBuy It! Marni knot top, $110, lindsilane.com\n\nFarm Rio Swimwear\n\nCourtesy Farm Rio\n\nThose irresistibly bright dresses you swipe up on every time they hit your Instagram stories (we know it's not just us) have now been translated into a joyful, tropical swimwear collection.\n\nBuy It! Striped scarf bikini top, $65, farmrio.com and bottom, $50, farmrio.com\n\nFarm Rio Swimwear\n\nCourtesy Farm Rio\n\nBuy It! Ancient Garden one-piece, $165; farmrio.com\n\nFarm Rio Swimwear\n\nCourtesy Farm Rio\n\nBuy It! Mix Picnic cover up, $170, farmrio.com; bikini top, $60, farmrio.com; and bikini bottom, $60, farmrio.com\n\nDL1961 Athleisure\n\nChris Colls\n\nThe denim brand known for its sustainable processes is bringing that same attention to athleisure, as modeled by Irina Shayk in their latest campaign.\n\nBuy It! DL 1961 crop sweatshirt, $139; dl1961.com\n\nCalypso St. Barth\n\nCalypso St. Barth\n\nVacation vibes are back in a big way, and nowhere is that more apparent than the relaunch of the celeb-loved resort line Calypso St. Barth. It's back with a direct-to-consumer format, updating the look but keeping the same breezy DNA that made celebrities including Jenna Dewan and Jennifer Aniston big fans.\n\nBuy It! Abigail dress, $375; calypsostbarth.com\n\nSET Active x OUAI\n\nSET Active\n\nThe activewear brand all over your Instagram feed (thanks to the help of Kylie Jenner and Hailey Baldwin) is teaming with Jen Atkin's OUAI on a collection in colors inspired by the beauty brand's most iconic products. Even better: each purchase comes with a travel-sized pouch stocked with bestsellers from OUAI.\n\n\"OUAI's products are such beautiful tones and we naturally gravitate towards them. So the color and naming process happened very effortlessly. It's such an iconic trio,\" says SET Active's founder and CEO Lindsey Carter.\n\nWith a sky blue, muted peach and pale taupe, there's something for everyone among the line of sports bras, leggings and socks. \"My favorite color from the collab is Mercer Street, the medium taupe with cool grayish undertones. But let's be real, I'll be wearing every single one of the colors this summer,\" Carter says.\n\nAtkin adds: \"If I had to choose one favorite it would have to be Mercer Street [too]. I cannot stop wearing the one-shoulder tops and leggings!\"\n\nSET Active x OUAI\n\nSET Active\n\nBuy It! From top left: SET Active x Ouai Sculptflex Box Cut in North Bondi, $45; theouai.com\n\nSET Active x Ouai Sculptflex Ribbed One Shoulder in Melrose Place; $45; theouai.com\n\nSET Active x Ouai Sculptflex Bike Shorts in North Bondi; $52; theouai.com\n\nSET Active x Ouai Sculptflex Leggings in Mercer Street, $65; theouai.com\n\nFor full collection, visit setactive.co.\n\nAdidas x Ivy Park\n\nCourtesy adidas\n\nBeyoncé has truly outdone herself with the fourth Adidas x Ivy Park collection, which marks the label's first foray into swimwear. Launching July 22 at adidas.com and in select stores globally on July 23, the \"Flex Park\" capsule includes women's one-pieces, bikinis, cover-ups, and more in a neon orange colorway. The size-inclusive line, which celebrates self-expression and individuality, also includes men's matching shirt and short sets, slides, bucket hat and bag, perfect for mixing and matching all summer long.\n\nBuy It! Adidas x Ivy Park Flex Park; adidas.com on July 22\n\nSanuk x Airstream\n\nSanuk x Airstream\n\nIf summer wanderlust has you wanting to pack up and drive cross-country, Sanuk's supercomfy collab with the legendary camper brand is for you. Look for fun travel-friendly details in the whole collection, like imprinted maps on the soles or hidden pockets in the slides.\n\nBuy It! Sanuk x Airstream women's \"Glamper\" flip-flops, $55, sanuk.com\n\nLoveShackFancy x Hurley\n\nCourtesy LoveShackFancy x Hurley\n\nLoveShackFancy is bringing its relaxed silhouettes and feminine prints to the sporty surf brand Hurley, in a new collection of swimwear for women, men and children. From reversible bikinis and a head-to-toe floral wetsuit, to a super soft beach towel and even a printed surfboard, this collab has everything you need for summer beach days.\n\nBuy It! LoveShackFancy x Hurley Reversible Cheeky One Piece Swimsuit, $150; loveshackfancy.com\n\nLoveShackFancy x Hurley\n\nCourtesy LoveShackFancy x Hurley\n\nBuy It! LoveShackFancy x Hurley One Piece Swimsuit, $150; loveshackfancy.com\n\nAllbirds Summer Collection\n\nCourtesy Allbirds\n\nThe beloved footwear brand is introducing two mini apparel collections of pieces that are easy breezy and perfect for summer, thanks to its lightweight and durable hemp fiber. The TreeBD collection features a versatile button-down shirt and short set for men and women, while the Ribbed Collection includes a classic tank and an adorable daytime dress.\n\nBuy It! Allbirds Women's Camp Shirt, $78 and Short, $58; allbirds.com\n\nAllbirds Summer Collection\n\nCourtesy Allbirds\n\nBuy It! Allbirds Women's Ribbed Tank, $48; allbirds.com\n\nMadhappy x Vault by Vans\n\nCourtesy Vans\n\nSneakerheads, rejoice! Madhappy, the chic brand that's all about optimism, lends a peppy primary palette to the crazy-comfy footwear favorite. And you'll need optimism to snag a pair, because they're sure to sell out fast.\n\nBuy It! Madhappy x Vault by Vans sneakers, $125; madhappy.com\n\nTOMS New 'Mallow' Style\n\nCourtesy TOMS\n\nJust when you thought TOMS couldn't get comfier, the brand launches a new slip-on style dubbed, the Mallow. Its plush, squishy, supersized sole brings extra cushion and height to the beloved original design.\n\nBuy It! TOMS Alpargata Mallow, $59.95; toms.com\n\nTOMS New 'Mallow' Style\n\nCourtesy TOMS\n\nBuy It! TOMS Alpargata Mallow, $59.95; toms.com\n\nAdidas TechFit Period Proof Tights\n\nCourtesy adidas\n\nAdidas' latest launch is a game changer.\n\nThe TechFit Period Proof Tights — part of Adidas' new Stay in Play campaign, which aims to give athletes the confidence and tools they need to compete — features an absorbent layer to help protect against leaks when worn with a tampon or pad.\n\nAccording to a press release, one in four girls around the world quit sports during adolescence and often cite fear of leakage while on their period as the reason why. These new tights and bike shorts are designed to eliminate that statistic.\n\nBuy It! Adidas TechFit Period Proof Biker Short Tights, $45; adidas.com (available starting June 17)\n\nRifle Paper Co. x Summersalt\n\nSummersalt x Rifle Paper Co.\n\nThe celeb-love brand known for ultra-flattering and inclusive swimwear teamed up with Rifle Paper Co. to create a limited-edition collection of summer essentials. The collaboration includes all your favorite Summersalt silhouettes (more than 15 swim and cover up styles for both women and children!) in three signature Rifle Paper Co. floral prints: Garden Party, Menagerie and Marguerite.\n\nBuy It! The Sidestroke, $125; summersalt.com\n\nRifle Paper Co. x Summersalt\n\nSummersalt x Rifle Paper Co.\n\nBuy It! The Palazzo Pant With Ties, $95; summersalt.com\n\nAqua x Mary Katrantzou\n\nAQUA x Mary Katrantzou\n\nMary Katrantzou, widely considered \"the Queen of Print,\" is bringing her signature aesthetic to Bloomingdales through a collaboration with AQUA, one of the department store's premiere private labels. The limited-edition 18-piece Aqua x Mary Katrantzou capsule collection features dresses and separates ranging from $78 to $378 in four new prints: butterflies, leopards, rainbow parrots and pink florals.\n\n\"I am excited for the launch of our capsule collection for AQUA that was designed with the intention to create a joyful and feel-good collection that will appeal to women of all ages,\" Katrantzou said in a statement. \"For the first time we also had the opportunity to delve into girl's sizing, which was a great creative challenge. The idea was to bring nature's forms into the prints: from monarch butterflies to punchy florals, and from leopard prints to tropical bird prints, giving the wearer the option to mix and match the styles and patterns.\"\n\nBuy It! AQUA x Mary Katrantzou Parrot Print Off The Shoulder Romper, $118; bloomingdales.com\n\nAQUA x Mary Katrantzou\n\nAQUA x Mary Katrantzou\n\nBuy It! AQUA x Mary Katrantzou Floral Off The Shoulder Top, $88, and Smocked Skirt, $88; bloomingdales.com\n\nCUUP Swimwear\n\nCourtesy CUUP\n\nThis brand's supportive, comfortable and cute bras earn raves - so their just-launched swimwear definitely has been much anticipated. And there truly is something for everyone: the collection has 53 bra sizes from 30A to 42F and seven bottom sizes from XS to XXXL.\n\nBuy It! CUUP balconette top, $98, and tap bottom, $68; shopcuup.com\n\nCUUP Swimwear\n\nCourtesy CUUP\n\nBuy It! CUUP plunge top, $98, and tap bottom, $68; shopcuup.com\n\nCUUP Swimwear\n\nCourtesy CUUP\n\nBuy It! CUUP balconette top, $98, and bikini bottom, $68; shopcuup.com\n\nStitch Fix x The Label\n\nStitch Fix x The Label\n\nThe personal styling service partnered with The Label to help the Black-owned and female-founded minimalist apparel brand launch its first line of size-inclusive loungewear. The five-piece capsule is available in four colorways and products range from $50-$60. It marks a continuation of Stitch Fix's commitment to enable popular brands like The Label (including Beyond Yoga, LNA and Glyder) refine and elevate their plus size assortments. To shop the collaboration, Stitch Fix members can simply request The Label from their personal stylist.\n\nBuy It! Stitch Fix x The Label; stitchfix.com\n\nStitch Fix x The Label\n\nStitch Fix x The Label\n\nBuy It! Stitch Fix x The Label; stitchfix.com\n\nSouthern Tide x Rheos Sunglasses\n\ncourtesy Southern Tide\n\nAnyone who has ever watched a beloved pair of sunglasses sink to the bottom of the lake will be thrilled to snag a pair of the preppy retailer's stylish and functional floating sunglasses, a collaboration with nautical eyewear brand Rheos.\n\nBuy It! Southern Tide x Rheos \"Faris\" sunglasses, $78; southerntide.com\n\nSouthern Tide x Rheos Sunglasses\n\ncourtesy Southern Tide\n\nBuy It! Southern Tide x Rheos \"Edistos\" sunglasses, $78; southerntide.com\n\nSouthern Tide x Rheos Sunglasses\n\ncourtesy Southern Tide\n\nBuy It! Southern Tide x Rheos \"Ellis\" sunglasses, $78; southerntide.com\n\nAE x The Jeans Redesign\n\ncourrtesy American Eagle\n\nThe trendy retailer released a take on their megapopular jeans designed with the environment in mind (using less water, easily removable hardware for recycling, organic cotton and longer-lasting construction).\n\nBuy It! AE x The Jeans Redesign women's mom jeans, $59.95; ae.com\n\nAE x The Jeans Redesign\n\ncourtesy American Eagle\n\nBuy It! AE x The Jeans Redesign mens' slim-fit jeans, $59.95; ae.com\n\nPSK Collective\n\nWorld Rugby Hall of Famer Phaidra Knight launched her own line of activewear, PSK Collective, which is now being carried by Kohl's - and it looks as cute off the field as on it. (Even better: 15% of net proceeds go to the Women's Sports Foundation.)\n\nBuy It! PSK Collective, starting at $29; kohls.com\n\nAlison Lou x LoveShackFancy\n\nCourtesy LoveShackFancy\n\nYou've seen Alison Lou's \"Loucite\" hoops and LoveShackFancy's romantic prints on celebs and influencers alike. Now the two female-run brands have combined their superpowers into one Instagram-irresistible hoop earring design.\n\nBuy It! Alison Lou x LoveShackFancy small jelly hoops, $145; alisonlou.com\n\nAlison Lou x LoveShackFancy\n\nCourtesy LoveShackFancy\n\nBuy It! Alison Lou x LoveShackFancy hoops, $145 for small and $165 for medium; alisonlou.com\n\nDraper James ❤ Lands' End\n\nDraper James x Lands' End\n\nReese Witherspoon's fashion label teamed up with lifestyle brand Lands' End on a collection that combines timeless silhouettes with Americana prints and bright colors true to the Draper James aesthetic. Launching just in time for summer, the 25-piece collaboration features swimwear, apparel and accessories in sizes ranging from 2-3X. Additionally, a percentage of proceeds will be donated to Girls Inc, a nonprofit that encourages girls to be \"Strong, Smart, and Bold\" through service and advocacy.\n\nBuy It! Draper James ❤ Lands' End Square Neck Bralette Bikini Top, $54.95-$64.95; draperjames.com\n\nDraper James ❤ Lands' End\n\nDraper James x Lands' End\n\nBuy It! Draper James ❤ Lands' End Long Sleeve Utility Tunic, $59.95-$69.95; draperjames.com\n\nMOTHER Activewear\n\nCourtesy MOTHER\n\nThe brand you know and love for on-trend jeans that fit like a glove just announced an exciting expansion. MOTHER made its first foray into the activewear space with the launch of the Move It collection. The 33-piece line includes soft, heavyweight sweatshirts, sweatpants, gym shorts, cropped tees and tanks in wearable earth tones.\n\n\"This collection is all about celebrating movement,\" Tim Kaeding, creative director and co-founder of MOTHER, said in a statement. \"Whether subtle or fervent, there is beauty in each change of state.\"\n\nBuy It! MOTHER The Bender Short Fray, $128; motherdenim.com\n\nMOTHER Activewear\n\nCourtesy MOTHER\n\nBuy It! MOTHER The Chin Ups Tank, $98; motherdenim.com\n\nBananya x Gucci\n\nThe collaboration we didn't know we needed: luxury fashion and anime!\n\nIn May, Gucci teamed up with global streaming service Crunchyroll to launch a mini collection of men's and women's apparel and accessories embossed with adorable characters from the Japanese anime series Bananya, which follows a cat that lives inside a banana. From T-shirts and sweatshirts, to trainers, slides and jewelry, the entire capsule embodies the playful nature of the show.\n\nBuy It! Bananya x Gucci Hooded Sweatshirt, $1,250; gucci.com\n\nBananya x Gucci\n\nBuy It! Bananya x Gucci Hooded Ace Sneakers, $690; gucci.com\n\nAVIEW\n\nA/J Jackson, the lead singer of Saint Motel, just launched a customizable sunglass label that makes it easier than ever to change up your style. AVIEW allows customers to choose from a variety of Andy Warhol-inspired frames (clear, brown, tortoise or black) and thin, interchangeable lenses (yellow, rose, blue, black, brown, and green). The first drop also includes a chic leather carrying case to safely store the slip-in lenses. So whether you want to transition your glasses to sunglasses or switch your sunglass color without purchasing a new pair of frames, this new brand has got you covered. \"You will never need a separate pair of glasses again,\" a press release states.\n\nBuy It! AVIEW Círculo in Black, $99; aview.com\n\nAVIEW\n\nBuy It! AVIEW Multi-Lens Carrying Case, $10; aview.com\n\nKeds x Hatch\n\nKeds x Hatch\n\nFor most moms, the combo of \"cute,\" \"functional\" and \"comfortable\" can be something of a holy grail. Hatch (the maternity-and-beyond line loved by Meghan Markle and Natalie Portman) teamed up with Keds to make a Mother's Day collection of shoes that's all those things and more - with details so sweet, they're irresistible even to those not chasing after kiddos.\n\nBuy It! Hatch x Keds, starting at $64.95; hatchcollection.com\n\nSavage x Fenty Bridal Capsule\n\nSavage x Fenty\n\nMega-influencer Jackie Aina designed a collection of bridal-inspired undergarments with Savage x Fenty ahead of her wedding. The sexy capsule includes embroidered and floral lace bras, corsets, thongs, thigh-high tights and more in white and lilac shades and inclusive sizing (32A-42H, XS-3X).\n\n\"Save The Date! We're gettin' ready for @jackieaina's big day! That's right, our girl is gettin' married so who better to show off our new #SavageXBridal collection?! Cause everyone knows: #HappyWifeSavageLife 💍,\" the brand wrote on Instagram alongside a video of Aina, who got engaged to boyfriend Denis Asamoah in August 2019.\n\nBuy It! Savage x Fenty Floral Lace Unlined Bra, $44.95; savagex.com\n\nSavage x Fenty Bridal Capsule\n\nSavage x Fenty\n\nBuy It! Savage x Fenty Semi-Precious Bridal Thigh Highs, $32.95; savagex.com\n\nSarah Flint Wedding Flats\n\nSarah Flint\n\nThe New York-based shoe label launched an elegant wedding version of its best-selling (and Meghan Markle-approved!) Natalie Flat. Now available in white lace, the ultra-comfortable pointed style, which features extra padding and a wide toe box, is perfect for large celebrations, intimate ceremonies, courthouse weddings, bridal showers and more!\n\nBuy It! Natalie Flat in White Lace, $435; sarahflint.com\n\nFreedom Moses x Jonathan Simkhai\n\nFreedom Moses x Jonathan Simkhai\n\nThe brand known for creating comfy waterproof slides in every colorway you can think of partnered with Jonathan Simkhai to launch a line of tie-dye and floral print slides inspired by the luxury ready-to-wear label's spring apparel and swimwear collections. Each pair is recyclable, cruelty-free and 100% vegan\n\n\"I couldn't be more excited about this partnership with Sarah Gurt of Freedom Moses, a brand that is filled and founded with so much love and optimism. We both have a strong appreciation for unconventional, eccentric-looking, and California inspired items and prints, so designing this collaboration with Freedom Moses was so much fun and so seamless,\" Simkhai said. \"I have an enormous appreciation for what Sarah represents as a sustainable and Earth-friendly footwear designer. Her stance on putting the planet first with everything she does while sourcing materials is a similar stance to what we're doing at Jonathan Simkhai. I am hoping that this collaboration is the first of many with Freedom Moses.\"\n\nBuy It! Freedom Moses x Jonathan Simkhai Two Banded Slides, $65; shopbop.com\n\nMacy's Icons of Style\n\ncourtesy macy's\n\nThe retail giant tapped five mega-talented Black designers and artists (Zerina Akers, Misa Hylton, Aminah Abdul Jillil, Allen Onyia and Ouigi Theodore) to partner with on clothes, shoes and accessories for some of their in house lines, including Bar III, Sun + Stone and INC. The result: Showstopping pieces at attainable prices.\n\nBuy It! Macy's Icons of Style collection, starting at $35; macys.com\n\nLeatherology Canvas Collection\n\ncourtesy Leatherology\n\nThe celeb-loved one-stop shop for personalized basics just released a line of lightweight organic canvas bags in some of their most practical silhouettes - which all can sport the handpainted or gilded monograms the brand is known for.\n\nBuy It! Leatherology canvas collection, starting at $50; leatherology.com\n\nBandier Housewears\n\nCourtesy Bandier\n\nWorkout wear site Bandier applied its sexy-trendy aesthetic to Housewears, a curated line of clothes you wear just to lounge (because, let's face it, your go-to grey sweats are giving you Seasonal Affective Disorder). They tapped Jordyn Rolling (pictured) and Bianca Valle (next slide) to model the styles.\n\nBuy It! Bandier Housewears bra, $68; bandier.com\n\nBandier Housewears\n\nCourtesy Bandier\n\nBuy It! Morgan Lane top, $268, bandier.com and pants, $258, bandier.com\n\nCaitlin Covington x Pink Lily\n\ncourtesy pink lily\n\nInfluencer Caitlin Covington teamed up with Pink Lily to design an affordable travel and stay-cation inspired-collection of dresses, swimwear, separates and accessories. The flirty and feminine line features spring and summer staples, including gingham prints, off-the-shoulder designs and lightweight swimsuit coverups in sizes XS-2XL. The best part? Everything is under $100!\n\n\"Every year I go on at least one big trip in the spring and the reaction from my fans and followers has always been that they love my outfits, but can't necessarily afford the price point of some of the designers that I feature on my blog,\" Covington said in a statement. \"My goal with this collaboration was to create something for everyone at an affordable price point. Especially right now with so much happening in the world, it shouldn't cost a fortune to look and to feel great about your outfit. Pink Lily has been the perfect partner for me - I love that they are female-founded, family run and operated, and I have just been amazed to watch their growth.\"\n\nBuy It! Caitlin Covington x Pink Lily The Charleston Gingham Blue Mini Dress, $48; pinklily.com\n\nCaitlin Covington x Pink Lily\n\ncourtesy pink lily\n\nBuy It! Caitlin Covington x Pink Lily Miami Square Neck Polka Dot Belted Blush Swimsuit, $48; pinklily.com\n\nBecket + Quill Jewelry\n\nB+Q Studio\n\nDrybar Founder, Alli Webb and accessories designer Meredith Quill teamed up to create a line of \"high end, not high spend\" jewelry called Becket + Quill. The demi-fine collection, inspired by Quill's grandmother, ranges roughly from $30-$300. The 25-piece debut line-up consists of rings, bracelets, necklaces and earrings, made in Los Angeles and crafted from alternative materials that bridge the gap between fashion and fine jewelry.\n\nBuy It! Disc Necklace, $250; becketandquill.com, Black Enamel Heart Necklace, $60; becketandquill.com, Onyx Heart Necklace, $150-$250; becketandquill.com\n\nBecket + Quill\n\nB+Q Studio\n\nBuy It! Small Link Chain Bracelet, $40; becketandquill.com, Onyx Heart Bracelet, $200; becketandquill.com, Open Cuff Bracelet, $150; becketandquill.com, Cigar Band Ring, $150; becketandquill.com, Onyx Ring, $300; becketandquill.com, Bead Band Ring, $100; becketandquill.com, Flat Top Ring, $90; becketandquill.com, Heart Ring, $35; becketandquill.com\n\nBecket + Quill\n\nB+Q Studio\n\nBuy It! Star Earrings, $30-$50; becketandquill.com, Hoops With Floating Hearts, $150-$300; becketandquill.com\n\nCuyana Expands Its Most Popular Bag Style\n\nThe sustainability driven (and Meghan Markle-approved!) fashion brand is announcing the expansion of its extremely popular Double Loop bag line with two new chic designs. Fans of the brand will remember that the Oversized Double Loop Bag quickly became a top-selling item, so these new additions are sure to sell out fast. Shop the Double Loop Bag, available on the site now, and sign up early to pre-shop the Mini Double Loop Bag, which officially launches in May. Here's to more sunny - and stylish - days ahead!\n\nBuy It! Double Loop Bag, $295; cuyana.com\n\nCuyana Expands Its Most Popular Bag Style\n\nBuy It! The Mini, $195; cuyana.com\n\n60% Mother\n\nCeleb-loved brand Mother Denim has introduced a limited-edition capsule collection with sustainability at its forefront. The 21-piece line consists of jeans, denim jackets, a jumpsuit and a dress, plus comfy WFH basics like tees and sweatshirts and even accessories including oversize totes and vintage bandanas. Each piece is hand-made in Los Angeles of pre- and post- consumer waste, such as excess fabric, damages and overstock from past MOTHER collections initially intended for landfills.\n\nBuy It! Similar: The Drawn In Sweatshirt, $140; motherdenim.com, The Four Corners Scarf, $175; motherdenim.com, The Money Bags Tote, $125; motherdenim.com, Cut And Sew Stunner Ankle Fray, $320; motherdenim.com\n\nLacoste x Ricky Regal\n\nLACOSTE x RICKY REGAL\n\nBruno Mars collaborated with Lacoste on his first-ever fashion line. Named after Mars' design alter ego Ricky Regal, Lacoste creative director Louise Trotter said the new line bridges \"Lacoste sportswear heritage\" and the pop star's \"seductive\" personal style. Think \"24K Magic\" meets \"Chucks on with Saint Laurent.\"\n\n\"I've been very fortunate to have been asked to do collaborations in the past, but it always came with guidelines,\" Mars said in a statement. \"Lacoste was the first and only brand that said, 'Bruno we want you to make this truly yours.' The respect of such creative freedom coming from a heritage fashion house was an honor.\"\n\nThe first Lacoste x Ricky Regal collection, featuring luxurious fabrics like velvet and silk in rich hues like eggplant and mustard yellow, launches in a select few retail stores on March 5 and will be available globally and on lacoste.com on March 8.\n\nBuy It! Lacoste x Ricky Regal; lacoste.com\n\nLacoste x Ricky Regal\n\nLACOSTE x RICKY REGAL\n\nBuy It! Lacoste x Ricky Regal Fit Flowy Checkerboard Shirt, $195; lacoste.com\n\nBombas Launches Underwear\n\nThe sock and T-shirt brand known for its philanthropic give-back model and comfort-first gear just launched underwear made with the same high-quality materials as its beloved basics. The collection is available in two fabrications -cotton modal and seamless - and three silhouettes. The best part? For every item purchased, one is donated to someone affected by homelessness.\n\nWomen's Cotton Modal: available in thong, bikini and hipster silhouettes across 14 colors, including nude options, in straight and plus sizing (XS-2X).\n\nBuy It! Thong, $20 ; bombas.com, Bikini, $22; bombas.com, Hipster, $22; bombas.com\n\nBombas Launches Underwear\n\nWomen's Seamless: available in thong, bikini and hipster silhouettes across 14 colors, including nude options, in straight and plus sizing (XS-2X).\n\nBuy It! Thong, $18; bombas.com, Bikini, $20; bombas.com, Hipster, $20; bombas.com\n\nBombas Launches Underwear\n\nMen's Cotton Modal: available in brief, trunk and boxer-brief silhouettes across four colors in straight and plus sizing (S-3XL).\n\nBuy It! Brief, $22; bombas.com, Trunk, $26; bombas.com, Boxer Brief, $28; bombas.com\n\nAtoms x Tan France\n\nAtoms, the sustainably made, innovative and seriously comfy sneaker brand (which you might have seen breaking the Internet with its founders' Humans of New York story) has paired up with Queer Eye's style guru Tan France to design a pair of perfect white sneaks with a surprise twist: striped shoelaces and soles. Hurry, though! It's available for a one-week limited run and each pair will be produced to order to reduce waste.\n\nBuy It! Atoms x Tan France sneakers, $129; atoms.com\n\nDockers' 35th Anniversary Collection\n\ndockers\n\nTo celebrate 35 years in business, Dockers is honoring its California roots with its most casual collection yet.\n\nThe latest line is focused on wear-everywhere pieces that aren't just for the office anymore. From pocket tees to signature chinos in an array of light colors, the collection celebrates laid back coastal vibes with items ready to be worn on outdoor adventures.\n\nSo who better to front the campaign than surf industry veterans and founders of 1 Planet One People, Selema Masekela and Ryan Harris who \"perfectly embody the diverse, sustainability-minded, and stylish vibe of the Golden State,\" Dockers said in a press release.\n\nBuy It! Dockers Pocket Tee, $16.99; dockers.com\n\nDockers' 35th Anniversary Collection\n\ndockers\n\nMasekela (host, entrepreneur, philanthropist and Surfrider Foundation ambassador) teamed with Harris (founder of Earth Technologies, an eco-conscious surfboard manufacturer using renewable and recycled materials) and two other surfers, Danielle Black Lyons and Hunter Jones, to create 1 Planet One People. It's a collective designed to support \"diversity, inclusivity and eco-conscious practices in surfing and throughout the world.\"\n\n\"It's the perfect blend of joy, style, and social and environmental responsibility that are pillars of Dockers brand, and represents the best of the California lifestyle,\" the release says.\n\nBuy It! Dockers Linen Sweater, $64.99; dockers.com\n\nDockers' 35th Anniversary Collection\n\ndockers\n\n\"Thirty-five years ago, Dockers brought Casual Friday into the world,\" the brand states. \"Today, it provides stylish, innovative, sustainable casual-wear for all lifestyles - no matter who you are and where you live, everyday.\"\n\nBuy It! Dockers 35th Anniversary Collection; dockers.com\n\nCoach x Champion\n\nCoach x Champion\n\nCoach and Champion teamed up to launch a collection of leather bags, leather jogger pants, sweaters and shearling jackets embossed with a new branding that combines Coach's storypatch symbol and Champion's C-logo. Model Paloma Elsesser and TikTok stars Wisdom Kaye, Maha Gondal and Jeffrey Tung front the Coach x Champion (which was photographed and directed by Alessandro Simonetti).\n\n\"I'm excited to introduce Coach x Champion, a collection grounded in the authentic American heritage we share,\" Coach Creative Director Stuart Vevers said in a press release. \"I was inspired by the idea of elevating sportswear silhouettes in an unmistakably Coach way using leather, shearling and by combining our iconic symbols in a way that feels fresh, youthful and immediate.\"\n\nChampion Chief Global Design Officer Ned Munroe added: \"The opportunity to partner with Stuart and the Coach team and merge the design expertise, as well as the great heritage of these two iconic American brands, is what was so inspiring. To be able to pair Champion's roots in sport with Coach's exceptional craftsmanship creates the opportunity for Champion's iconic styles to come to life through a new and elevated lens.\"\n\nBuy It! Coach x Champion Coaches Jacket, $795; coach.com\n\nCoach x Champion\n\nCoach x Champion\n\nBuy It! Coach X Champion; coach.com\n\nCoach x Champion\n\nCoach x Champion\n\nBuy It! Coach X Champion Sweatshirt, $225; coach.com\n\nQuay Australia Jewelry\n\nCourtesy Quay\n\nAfter a successful long-term partnership with beauty guru and vlogger Desi Perkins, Quay Australia is collaborating with another mega-influencer to launch its first-ever jewelry collection, which features necklaces, charms and earrings ranging from $25 -$65. Camila Coelho - who boasts 8.8 million followers on Instagram - is the face of the campaign, marking her second collaboration with the celeb-loved sunglass label. Coelho says she's a \"longtime fan of the brand,\" adding, \"I love all of the styles Quay releases and the jewelry is no exception.\"\n\nThe new collection was designed to be mixed, matched or fully staked, and all 20 pieces are plated in 14k gold.\n\n\"We wanted to innovate and design a collection that would add something extra to our customer's snapshot style in a time when people are spending more time at home, on zoom, and dressing from the waist up,\" Quay CEO Jodi Bricker says. \"It was a natural next progression for the brand to expand our category offering into jewelry and provide our customer with another fun fashion accessory to express their own personal style.\"\n\nBuy It! Quay Australia Clipped Link Necklace, $65, and Quay Australia Essential Large Hoops, $40; quayaustralia.com\n\nQuay Australia Jewelry\n\nCourtesy Quay\n\nBuy It! Quay Australia Coin Huggies, $40; quayaustralia.com\n\nQuay Australia Jewelry\n\nCourtesy Quay\n\nBuy It! Quay Australia All Love Charm, $25; quayaustralia.com\n\nSkechers x James Goldcrown\n\nCourtesy Skechers\n\nFamed artist James Goldcrown, best known for his iconic Love Wall heart designs, brings his flair to Skechers footwear just in time for Valentine's Day. The new retro line of sneakers and slides feature a rainbow of overlapping hearts guaranteed to put a smile on anyone's face. \"\n\n\"We started on canvas originally, and then digitized the art to move it around the shoe for the perfect look. I think it's a great time for this collaboration with everything that is going on in the world,\" Goldcrown said. \"Something as simple as a heart can really touch people - so hopefully we will spread some love.\"\n\nBuy It! Skechers x James Goldcrown Collection, $32-$80; skechers.com\n\nAmerican Eagle x NAITO\n\nCourtesy NAITO x AE\n\nAmerican Eagle is continuing its commitment to inspiring self-expression with an exclusive collection in collaboration with futuristic artist Shinpei Naito, of NAITO. NAITO x AE is a dual gender launch that includes oversized T-shirts, shorts, swimwear and more for her, as well as a button-down shirt, board shorts, graphic T-shirts and bucket hats for him.\n\nThe collection features Shinpei's use of bright colors and unique prints - and each one holds significance. Prints like flower garden (which is meant to inspire happiness) and dragon and fenix (imagery animals that are symbols of power in Japanese the culture) bring the collaboration to life.\n\nBuy It! AE x Naito Cropped Tank Top, $24.95, and AE x Naito The Everything Highest Waist Leggings, $44.95; ae.com\n\nAmerican Eagle x NAITO\n\nCourtesy NAITO x AE\n\nBuy It! AE x Naito Cropped Tank Top, $24.95; ae.com\n\nFrankies Bikinis Spring 2021\n\nFrankie's Bikinis\n\nSince debuting with ultra-flattering swimsuits in 2012 (which soon became a staple for celebs like Bella Hadid, Hailey Bieber and Kendall Jenner), Frankies Bikinis has launched loungewear, knits, matching sets, accessories and more. The label's latest venture? Vegan leather.\n\nOn Jan. 14, Frankie's Bikinis unveiled the first drop of its Spring 2021 collection featuring \"soft and luxurious\" vegan leather in beige and pink color ways. With five different silhouettes, the line includes trousers, an oversized blazer, a button-down collared shirt, a high-waisted short and a bra top. According to a press release, the vegan leather apparel was designed to be styled with \"other pieces in the collection or paired with your favorite pair of jeans, oversized tee and sneakers.\"\n\nBuy It! Frankies Bikinis Spring 2021; frankiesbikinis.com\n\nFrankies Bikinis Spring 2021\n\nFrankie's Bikinis\n\nBuy It! Caroline Kennedy Pants, $250, and Claudia Vegan Leather Bra Top, $135; frankiesbikinis.com\n\nFrankies Bikinis Spring 2021\n\nFrankie's Bikinis\n\nBuy It! Rusty Vegan Leather Shorts, $165, and Rusty Vegan Leather Button Up, $185; frankiesbikinis.com\n\n#BeTheOne Essentials Kit\n\nState Bags\n\nThis Saves Lives, the snack brand on a mission to end severe acute malnutrition in children (co-founded by Kristen Bell and other actors) teamed up with STATE Bags to launch a limited-edition #BeTheOne Essentials Kit. Inside the nylon Lorimer Fanny Pack, you'll find one box of This Saves Lives' Dark Chocolate Sea Salt Bars, a black face mask and two #BeTheOne branded pins. In light of the devastating effects of the coronavirus (COVID-19) pandemic on child hunger, each purchase of the limited-edition kit will \"help impact the lives of children suffering from severe acute malnutrition worldwide, while also providing virtual tutoring to children in underfunded neighborhoods across the United States,\" according to a press release.\n\n\"It's incredibly heartbreaking to see the impact the pandemic is having on children throughout the world. Kids are dying of severe acute malnutrition at an even higher rate due to COVID-19,\" Bell said in the release. \"I'm so happy This Saves Lives has partnered with STATE Bags for the #BeTheOne campaign which helps combat injustices in our country and worldwide.\"\n\nBuy It! This Saves Lives x STATE Bags #BeTheOne Essentials Kit, $105; statebags.com\n\nMint Swim for PacSun\n\nPacSun\n\nSocial media influencer and actress Draya Michele is bringing her affordable and inclusive swimwear brand to PacSun! Mint Swim just dropped five new silhouettes - a bikini with gold hardware details, a high-waisted bikini, a plunging one-piece and two cutout one-pieces - available exclusively at pacsun.com. Mint Swim joins several Black-owned brands available through PacSun, including Phenomenal Woman, Riot Swim and Fear of God.\n\n\"I'm excited to partner with PacSun and expand Mint Swim into the wholesale market for the first time, and to give our customers the ability to touch, feel and experience our garments like never before.\" Michele said in a PacSun press release. \"PacSun sets the standard for California style and I'm proud for the opportunity to collaborate with them on this exclusive collection, while also introducing Mint Swim to a broader audience.\"\n\nBuy It! Mint Swim Sam One-Piece, $81; pacsun.com\n\nMint Swim for PacSun\n\nPacSun\n\nBuy It! Mint Swim Serena High-Waisted Bikini Bottom, $31; pacsun.com\n\nMint Swim for PacSun\n\nPacSun\n\nBuy It! Mint Swim Trina One-Piece, $88; pacsun.com\n\nba&sh Jewelry\n\nThe Parisian label you know and love for its Bohemian-meets-rocker-chic aesthetic is venturing into the world of fine jewelry with a sustainable collection made of recycled silver. Featuring necklaces, rings, bracelets and earrings ranging from $70-$535, ba&sh jewelry aims to \"celebrates femininity, style and freedom,\" according to a press release.\n\n\"Infused with oriental, Indian, African or South African influences, the jewelry brings a taste of elsewhere and a stylish finish to any look, from the simplest to the most sophisticated,\" the brand said.\n\nBut It! ba&sh Jewelry; ba-sh.com\n\nba&sh Jewelry\n\nBuy It! ba&sh Jewelry Naman Necklace, $130; ba-sh.com\n\nba&sh Jewelry\n\nBuy It! ba&sh Jewelry Olga Earrings, $265; ba-sh.com\n\nLunair Wellness LA Scarf\n\nTired of your protective face masks throwing off a great outfit? Yeah, us too. Luckily, Lunair Wellness came up with a way to safely enhance your outfits with the launch of these face coverings. Available in black, navy, apricot, lavender and rose, the LA Scarf features a pleated two-layer 100% OEKO-TEX certified cotton face mask underneath a luxe silk draping. A mask that combines safety and style? We're buying one in every color!\n\nBuy It! Lunair Wellness LA Scarf, $22; lunairwellness.com\n\nBFC and CFDA Face Coverings\n\nCourtesy Bag of Ethics\n\nThe British Fashion Council (BFC) and the Council of Fashion Designers of America (CFDA) - two of the industry's most influential non-profit organizations - teamed up with eco-friendly label Bag of Ethics (BOE) to launch sustainable and reusable non-medical face coverings. Created by three British designers (Ahluwalia, Preen by Thornton Bregazzi and Marques'Almeida) and three American designers (Mara Hoffman, lemlem by Liya Kebede and Kim Shui) the washable masks feature colorful prints on the outside and uplifting messages like \"radical empathy\" and \"strength in unity\" on the inside. The face coverings are available now ($18 for a 3-pack) at various retailers including bagofethics.org and Amazon. For every bundle sold, $1 goes towards the BFC Foundation Fashion Fund, which launched in March to support fashion creatives during the pandemic, and $1 goes towards the CFDA's Diversity, Equity, and Inclusivity programming.\n\n\"This is a powerful time for collaboration across all sectors and the fashion industry has demonstrated strength in unity over the last number of months,\" Caroline Rush, Chief Executive of BFC, said in a statement. \"We are excited to work alongside our American counterparts to promote local designers while encouraging sustainable practices in the fight against the spread of coronavirus. We are also delighted to continue working with Bag of Ethics, a longstanding supporter of the BFC, after the success of our first round of Great British Face Coverings in raising money to support British designers in surviving this challenging time.\"\n\nBuy It! Face Coverings, $18; bagofethics.com\n\nBFC and CFDA Face Coverings\n\nCourtesy Bag of Ethics\n\nBuy It! Face Coverings, $18 (for a 3-pack); bagofethics.com\n\nBFC and CFDA Face Coverings\n\nCourtesy Bag of Ethics\n\nBuy It! Face Coverings, $18 (for a 3-pack); bagofethics.com\n\nPnina Tornai's Bridal Ring Collection for Jared\n\nJared\n\nThe couture wedding dress brand we all know and love from seeing its dreamy designs on Say Yes to the Dress just unveiled its first-ever jewelry collection designed for soon-to-be brides in mind. Inspired by the countless love stories she has heard over the years, designer Pnina Tornai teamed with Jared on a 31-piece engagement ring collection, with each design featuring three diamonds in the band to symbolize two individuals creating a life together.\n\n\"It has always been a dream for me to create an engagement jewelry collection, and with Jared, I have found the perfect partner to bring these dream rings to life, to celebrate the magic of two becoming one - a whole greater together than apart,\" Tornai says in a press release.\n\nJared Chief Marketing Officer and Executive General Manager, Bill Brace, said the brand expects this holiday season to be \"like no other\" with couples getting engaged after quarantining together throughout the year. \"We're thrilled to launch Pnina Tornai's first-ever ring collection - One by Pnina Tornai - exclusively at Jared, showcasing her unique designs inspired by her years of experience making brides feel special. We're confident that uniting two of the most trusted names in bridal will help our customers love brilliantly.\"\n\nBuy It! One by Pnina Tornai collection, $699 to $19,999; jared.com\n\nPnina Tornai's Bridal Ring Collection for Jared\n\nJared\n\nThe collection is available to shop now, and features some standout styles, like a black diamond ring, a 1920s-inspired emerald-cut stone flanked by baguettes and a \"toi-et-moi\" style featuring one round and one princess-cut diamond.\n\nBuy It! One by Pnina Tornai collection, $699 to $19,999; jared.com\n\nNeutral by Narbeh\n\nNailah Barcelona Houston\n\nCreated by 19-year-old entrepeneur Narbeh Babakhani (who famously took Khloé Kardashian to prom!), Neutral by Narbeh's streetwear styles were designed to inspire everyone who wears them. \"Butterflies are a symbol of new beginnings, peace and strength,\" Babakhani tells PEOPLE. \"I have dealt with depression and anxiety most of my life. So I thought showing a blue butterfly on the sweatshirts and sweatpants was so perfect and sentimental.\"\n\nHe admits that launching a brand - especially during a pandemic - isn't easy. But Babakhani feels thankful that he can turn to the Kardashian family as his \"huge symbol of strength.\"\n\n\"I have turned to Khloé specially for some advice. I even ranted to her sometimes when I see things have gone wrong in the process and she's always been there to give me words of encouragement,\" Babakhani says. \"Their support means the world to me. Who can say they have the Kardashians supporting their first business at 19? Grateful is an understatement.\"\n\nNeutral by Narbeh Hoodie\n\nNailah Barcelona Houston\n\nBuy It! Neutral by Narbeh Hoodie, $45; neutralbynarbeh.com\n\nNeutral by Narbeh Sweatpants\n\nNailah Barcelona Houston\n\nBuy It! Neutral by Narbeh Sweatpants, $42; neutralbynarbeh.com\n\nCasper Rest Stop\n\ncourtesy Casper\n\nGood news! With many companies and schools still operating remotely, and winter weather right around the corner, the loungewear trend is here to stay. The latest company to get in on the action? Casper. Yes, you heard that right - the one-stop-shop for all things sleep and comfort launched a digital pop-up shop with a limited-edition collection of loungewear and accessories to keep you cozy while stuck inside amid the coronavirus pandemic. Entitled Casper Rest Stop, the 12-piece line includes graphic tees and sweatshirts, socks, a onesie, a coffee mug, a ball cap and more, with prices ranging from $10-$48. And because Casper knows that rest is essential to our health and well-being, the company is donating 20% of every Casper Rest Stop purchase to Win, an organization that provides family shelter and supportive housing in New York City.\n\nBuy It! Casper Rest Stop Bedtime Sweatshirt, $48; reststop.casper.com\n\nCasper Rest Stop\n\nCourtesy Casper\n\nBuy It! Casper Rest Stop California King Sweatshirt, $48; reststop.casper.com\n\nLevi's SecondHand\n\nAmber Asaly for Levi's\n\nSometimes it can take years for a pair of jeans or a denim jacket to fully feel worn-in. But now, in its new sustainable initiative, Levi's is bringing that vintage-feel to every piece in its new SecondHand collection.\n\nThe iconic brand just launched a first-of-its-kind buy-back program and is now selling secondhand jeans and jackets on Levi.com (with pieces ranging from $30 - $100) and allowing customers to turn in worn jeans and jackets in Levi's stores for a gift card towards a future purchase.\n\nFor denim that can be resold, customers can get between $15-$25. For vintage denim, $30 - $35. And if denim is too worn to be resold, $5 will be credited toward a future purchase.\n\nBuy It! Levi's Secondhand denim and jackets; secondhand.levi.com\n\nLevi's SecondHand\n\nAmber Asaly for Levi's\n\nTo help spread the word - and style expertise - Hailey Baldwin teamed with her stylist Meave Reilly to put together 10 different outfits with vintage pieces from the new collection (which you can see here!).\n\nBuy It! Levi's Secondhand denim and jackets; secondhand.levi.com\n\nLevi's SecondHand\n\nAmber Asaly for Levi's\n\n\"Repurposing and repairing clothes requires minimal additional energy input, no water, and no dyes to make more jeans. Buying a used pair of Levi's through SecondHand saves approximately 80% of the CO2 emissions and 700 grams of waste compared to buying a new pair of Levi's,\" says Jennifer Sey, Levi's Chief Marketing Officer.\n\nBuy It! Levi's Secondhand denim and jackets; secondhand.levi.com\n\nUGG's First Ready-to-Wear Collection\n\nUgg\n\nUGG just put all the comfy-cozy qualities you know and love in their boots and slippers into loungewear form in its first-ever ready-to-wear collection! Staying true to what they do best, the line is full of hoodies, crews, sweatpants, shorts, pullovers, zip-up jackets and robes made from faux fur, teddy Sherpa, even cashmere. It's available in both men's and women's styles ranging from $58-$298.\n\nBuy It! Left to right: \"Augusta\" Sherpa Baseball Jacket, $298; ugg.com, \"Hattie\" Long Oversized Coat, $325; ugg.com, Similar: \"Mandy\" Faux Fur Hoodie, $195; ugg.com\n\nUGG's First Ready-to-Wear Collection\n\nBuy It! \"Asala\" Hoodie, $98; ugg.com, \"Iggy\" Sherpa Half Zip Pullover, $198; ugg.com, \"Renata\" Cashmere Crewneck, $298; ugg.com, \"Simone\" Boyfriend Hoodie, $98; ugg.com\n\nUGG's First Ready-to-Wear Collection\n\nUgg\n\nBuy It! \"Aida\" Cashmere Pant, $298; ugg.com, \"Noreen\" Short, $68; ugg.com. \"Zahara\" Biker Short, $58; ugg.com, \"Gabi\" Wide Legged Pant, $88; ugg.com\n\nStoney Clover Lane x Hanky Panky\n\nIf you love Hanky Panky's comfy and colorful underwear and Stoney Clover's whimsical aesthetic, then you will love this new special-edition collaboration. Three different sets of Hanky Pankys' cult-favorite thongs are packaged in Stoney Clover Lane's signature pouches each designed to keep your thongs organized, whether you're at home or traveling. The smallest assortment consists of seven thongs and retails for $210, the second consists of 12 thongs and retails for $350 and the largest, consists of 25 thongs and retails for $660.\n\nBuy It! Hanky Panky x Stoney Clover Lane; hankypanky.com\n\nClub Monaco's 35th Anniversary Collection\n\nClub Monaco\n\nThe beloved brand is celebrating its 35th anniversary with a special collection of its most classic pieces - think modern essentials like a white oxford, tailored trouser, cashmere sweater and black blazer. The looks are featured in a new campaign (shot by photographer Alessio Boni) that pays homage to its ads from the late '90s and early '00s and show the clear, confident aesthetic the brand was founded on. The capsule ranges from $39-$349 and also marks the first collection that includes ingrain sustainable practices and materials such as responsible wool, responsible silk and recycled cashmere.\n\nClub Monaco's 35th Anniversary Collection\n\nClub Monaco\n\nBuy It! Single-Breasted Blazer, $359; clubmonaco.com, Similar: High-Rise Skinny Jeans, $129; clubmonaco.com\n\nClub Monaco's 35th Anniversary Collection\n\nBuy It! \"Leary\" Tee, $29.50; clubmonaco.com, Similar: \"Marnee\" Shirt, $129.50; clubmonaco.com, \"Kora\" Cami, $98.50\n\nAPL's New TechLoom Tracer\n\nThe luxury performance sneaker brand known for its innovative fabrics just launched its new \"TechLoom Tracer\" and marks the company's foray into the training category. The Tracer is the first low-top style designed by the brand and contains performance-driven features like its non-stretch construction to keep the foot centered on the footbed to provide maximum lateral stability and its advanced lace designs minimize loosening during workouts. The sneaker comes in six different colors and retails for $230.\n\nBuy It! TechLoom Tracer Sneaker, $230; athletic propulsionlabs.com\n\nMasks by Jill and Ally\n\nCourtesy Jill Zarin\n\nThe Real Housewives of New York alum, Jill Zarin teamed with her daughter, Ally Shapiro, to bring face masks to the masses.\n\nWith her years of experience working in the fabric business (RHONY fans remember Zarin Fabrics), Jill designed washable masks in an assortment of fun tie-dye prints that she and Ally hand-dye themselves (with nontoxic materials, of course).\n\nMost recently, they partnered with Charlotte Alden of Summer Strings to create one-of-a-kind \"mask candy\" accessories, which are made of glass beads, freshwater pearls and a lobster claw that clip easily onto your mask to comfortably wear around your neck or show off while your mask is on your face.\n\nBuy It! Mask Candy, $22-$75; jillzarin.com\n\nMasks by Jill and Ally\n\nCourtesy Jill Zarin\n\nFor every mask purchased, the brand also donates one to healthcare providers and essential workers on the front lines across the country.\n\nBuy It! \"Lisa\" mask necklace, $75; jillzarin.com\n\nMasks by Jill and Ally\n\nCourtesy Jill Zarin\n\nBuy It! Mask Candy, $22-$75; jillzarin.com\n\nDr. Martens x Marc Jacobs\n\nDr Martens\n\nTwo brands known for their punk and rebellious ways are joining forces again, 27 years after their first collab.\n\n\"Inspired by the years of customization and DIY attitude that has shaped both brands, our latest 1460 Remastered boot is completely vegan with all the same disruptive DNA,\" read a statement from Dr. Martens.\n\nThe maroon boot is decked out with vintage-inspired trinkets including dice, whistles and keys, which take cues from Jacob's own collection. Shop the boots Sept. 26.\n\nBuy It! Dr. Martens 1460 Marc Jacobs, $210; drmartens.com\n\nKBH Jewels\n\nBen Watts\n\nThe jewelry brand, known for its socially conscious diamonds, recently launched two new limited-edition necklaces and is giving 100% of proceeds from each to very worth causes.\n\nThe \"Calling All Mothers\" necklace (modeled by Molly Sims) supports The Loveland Foundation, which is committed to showing up for communities of color in unique and powerful ways, with a particular focus on black women and girls.\n\nIt's second new design, \"We Will Rise\" supports Together Rising, an organization that transforms collective heartbreak into effective action.\n\nBoth pieces are handcrafted in New York City with 100% recycled solid 14K gold.\n\nKBH Jewels\n\nBen Watts\n\nBuy It! KBH Jewels \"We Will Rise\" necklace, $750; kbhjewels.com\n\nKBH Jewels\n\nBen Watts\n\nBuy It! KBH Jewels \"Calling All Mothers\" necklace, $750; kbhjewels.com\n\nThe Nines Collection\n\nBeloved denim and apparel brand Paige is paying tribute to the superpowers of modern women with this capsule collection, named after the nine bars delicately stitched into the back pocket of every pair of Paige jeans. According to a press release, the signature detail represents nine lives and serves as \"a reminder to always grow, reinvent yourself and evolve for the better.\" The Nines features statement pieces like a sleek wide-leg called the Leenah, as well as elevated basics like a classic black skinny jean with a slim leg opening called the Constance. The entire collection was designed to make women feel \"confident, empowered and dressed to the nines,\" the Los Angeles-based brand states.\n\nBuy It! Paige Constance jeans, $259; paige.com\n\nThe Nines Collection\n\nBuy It! The Nines Collection Pleated Leenah, $269; paige.com\n\nDKNY Fall 2020\n\nDKNY introduced its Fall 2020 #DKNYSTATEOFMIND campaign, which evokes the power of speech, connection and positivity in the midst of an unprecedented year marked by the coronavirus pandemic, protests and political unrest. Photographed by Brianna Capozzi, the new collection is inspired by the grit and grind of New York City. It features three limited-edition unisex hoodies (the Risk Taker's Hoodie, the Hustle Hoodie and the Work Ethic Hoodie) embossed with the DKNYSTATEOFMIND logo that retail for $69 each.\n\nBuy It! #DKNYSTATEOFMIND; dkny.com\n\nDKNY Fall 2020\n\nBuy It! #DKNYSTATEOFMIND; dkny.com\n\nKappa x Juicy Couture Capsule\n\nAmber Asaly\n\nItalian sportswear label Kappa is teaming up with Juicy Couture on a nostalgic capsule that will transport you right back to the early '00s. Everything from pastel velour tracksuits to tube tops round out the girly Simple Life-inspired collection, dropping Sept. 15, which is fronted by Sofia Richie. \"Kappa and Juicy are synonymous with sport and style and the collection does an amazing job paying tribute to such a fun time in fashion and pop culture,\" Richie exclusively tells PEOPLE.\n\nBuy It! Kappa x Juicy Couture Capsule, $40 to $225; kappa.com\n\nFred Segal x COTTON CITIZEN\n\nCourtesy COTTON CITIZEN\n\nThese two Los Angeles-based brands teamed up for the ultimate shopping experience. Fred Segal's Sunset Boulevard and Malibu locations will feature COTTON CITIZEN pop-up collections, featuring a curated line of COTTON CITIZEN's signature basics, as well as the brand's Pre-Fall 2020 collection (which was created using wash treatments from its family-owned and operated dye house and factory in L.A.).\n\n\"Fred Segal and COTTON CITIZEN have a natural synergy being from L.A. and sharing a dedication for inclusivity by way of supporting the local community,\" Ashley Petrie, vice president of women's merchandising at Fred Segal, said in a press release. \"Our customers will love COTTON CITIZEN's luxury basics, with the space going beyond their signature T-shirts and sweatpants.\"\n\nBuy It! Fred Segal x COTTON CITIZEN; in stores and at fredsegal.com\n\nFred Segal x COTTON CITIZEN\n\nCourtesy COTTON CITIZEN\n\nBuy It! COTTON CITIZEN Brisbane Turtleneck Bodysuit, $135; fredsegal.com\n\nFred Segal x COTTON CITIZEN\n\nCourtesy COTTON CITIZEN\n\nBuy It! Cotton Citizen Milan Zip Jogger, $225; fredsegal.com\n\nFred Segal x COTTON CITIZEN\n\nCourtesy COTTON CITIZEN\n\nBuy It! Cotton Citizen Standard Tank, $65; fredsegal.com\n\nBoden's New Loungewear Collection\n\nThe British-based (Royals-favorite) clothing brand known for its polished pieces is expanding into loungewear. Keeping true to its core, the collection consists of clean lines and simple silhouettes in poppy prints and brightly-colored designs. There are a lot of cute matching sweatshirt and sweatpants and shorts sets as well as more trendy pieces, including a fun and feminine puff-sleeve sweatshirt. Ranging from $42 - $130, there's a little something for everyone - whether you're looking to spice up your workout wear or lounge-from-home wardrobe.\n\nBuy It! From left to right: \"Morton\" Knitted Hoodie, $130; \"Thelma\" Jersey Shorts, $55; Favourite Leggins, $42; \"Jessica\" Active Bra, $60; Puff Sleeve Sweatshirt, $80; \"Jessica\" Active Leggings, $90; bodenusa.com\n\nBirdies Swan Collection\n\nThe chic slipper brand is introducing a new style to its lineup called the \"Swan.\" The pointy-toe design come in metallic gold and silver leather, as well as two calf-hair animal prints (zebra and cheetah) and two suede options (black and a colorblock fuchsia and orange). The slides retail for $120 and are available to shop now.\n\nBuy It! Birdies \"The Swan\" Flats, $120; birdies.com\n\nSHARKCHASER\n\nSharkchaser\n\nSHARKCHASER is a new direct-to-consumer luxury handbag company that combines minimalistic designs with a unique radiation-shielding fabric to protect the body from the electrical fields and radio frequencies that our cell phones emit. Each bag is handcrafted in Italy and comes in three different styles: tote, bucket and crossbody. (And if you're wondering where the name SHARKCHASER came from, it was inspired by the \"Shark Chaser\" repellent, a survival kit first issued during World War II made of copper salts that deterred potential shark attacks.)\n\n\n\nBuy It! Similar: Medium Triangle Tote Bag, $590; sharkchaser.com, Triangle Shoulder Bag, $720; sharkcaser.com\n\nTVF for DVF Summer 2020 Collection\n\nJean Pigozzi, courtesy of DVF\n\nDiane von Furstenberg's granddaughter Talita is building her own fashion empire one collection at a time! The 21-year-old's latest capsule for DVF, entitled A Sweet Escape, has everything you need to soak up the last days of summer and enjoy a socially-distanced Labor Day celebration. Inspired by dessert (each piece was named after Talita's favorite sweet treats), the launch includes baby doll mini-dresses, tea-length frocks, flowy rompers and effortless bodysuits in sorbet-inspired pastel tones and flirty prints.\n\nTalita (who appears in the campaign, which was shot on film by legendary photographer Jean Pigozzi in St. Tropez) said in a press release: \"The collection brings the taste of summer into your closet, and hopefully offers some much-needed romance and escapism into our lives.\"\n\nBuy It! TVF Eclair Crepe De Chine Halter Mini Dress, $245; dvf.com\n\nTVF for DVF Summer 2020 Collection\n\nJean Pigozzi, courtesy of DVF\n\nBuy It! TVF Souffle Chiffon-Blend Midi Dress, $295; dvf.com\n\nTVF for DVF Summer 2020 Collection\n\nJean Pigozzi, courtesy of DVF\n\nBuy It! TVF Brownie Knit Bodysuit, $195; dvf.com\n\nTVF for DVF Summer 2020 Collection\n\nJean Pigozzi, courtesy of DVF\n\nBuy It! TVF Eclair Crepe De Chine Halter Mini Dress, $245; dvf.com\n\nNeil Lane by Nine West\n\nRichard Pierce\n\nNeil Lane is bringing his bridal expertise to Nine West! The famed jewelry designer - who has created show-stopping rings for celebs like Nicole Richie and Jennifer Hudson, as well as your favorite Bachelor nation stars - collaborated with the lifestyle brand on a limited-edition footwear capsule, perfect for engagements, weddings and everything in between. The Neil Lane by Nine West collection includes four heels and one sandal in an array of whites, soft blues, golds, silvers and pearl, ranging from $69 to $109. All five styles (appropriately named \"ENGAGED,\" \"TRUELOVE,\" \"ALWAYS,\" \"PASSION\" and \"PERFECT\") reflect Lane's luxury aesthetic, and are embellished with metallic leathers, satins and shimmery fabrics.\n\n\"I've been sketching shoes for years and I'm thrilled to partner with Nine West to debut my first footwear line,\" Lane said in a press release. \"Together, we've translated the designs I've dreamt up over the years and my most dazzling jewelry creations into beautiful, modern styles. I'm honored to help brides, their loved ones and women everywhere feel beautiful and confident as they celebrate life's special moments.\"\n\nBuy It! Neil Lane by Nine West; ninewest.com\n\nNeil Lane by Nine West\n\nRichard Pierce\n\nBuy It! Neil Lane by Nine West \"Passion\" Sandal, $89; ninewest.com\n\nNeil Lane by Nine West\n\nRichard Pierce\n\nBuy It! Neil Lane by Nine West \"Always\" Pointy-Toe Pumps, $89; ninewest.com\n\nNeil Lane by Nine West\n\nRichard Pierce\n\nBuy It! Neil Lane by Nine West \"Always\" Pointy-Toe Pumps, $89; ninewest.com\n\nShades of Rose\n\nMcCall Ryan\n\nBachelor nation's Lauren Burnham-Luyendyk is breaking into the fashion world! The former reality star and wife of season 22 star Arie Luyendyk Jr. announced Shades of Rose, a brand inspired by the free spirit lifestyle.\n\nThe first launch is a 12-piece collection of casual pieces elevated with feminine details - including blazers, blouses, bodysuits, dresses, and more - ranging from $40-$150 and available exclusively on theshadesofrose.com.\n\n\"I have always been drawn to fashion and styling,\" Burnahm-Luyendyk said. \"I started modeling for local designers during high school and was introduced to a swimwear designer who let me design a suit with her and that's when I fell in love! I've been wanting to create my own line ever since! I've spent the last two years working on this and despite the obstacles like COVID that we've had to overcome, we're finally ready!\"\n\nShe continued: \"I was conscious of the current state of the world while creating the pieces for launch. I designed pieces that could be dressed up or down to fit our customer's needs. Many of them are inspired by my favorite casual 'stay at home' staples, elevated with feminine details.\"\n\nBuy It! Shades of Rose Monroe Bodysuit, $55; theshadesofrose.com\n\nShades of Rose\n\nMcCall Ryan\n\nBuy It! Shades of Rose; theshadesofrose.com\n\nShades of Rose\n\nMcCall Ryan\n\nBuy It! Shades of Rose Lourdes Blouse; theshadesofrose.com\n\nShades of Rose\n\nMcCall Ryan\n\nBuy It! Shades of Rose; theshadesofrose.com\n\nEverlane Sneakers\n\nEverlane\n\nEverlane just launched a sustainable sneaker, and it feature the same timeless aesthetic you know and love from this brand of must-have basics. The Forever Sneaker is comfortable, lightweight and made from responsibly-sourced materials. Since billions of shoes end up in landfills every year, Everlane partnered with Debrand to ensure that this new design is 100% recyclable.\n\nBuy It! The Forever Sneaker, $58; everlane.com\n\nEverlane Sneakers\n\nEverlane\n\nBuy It! The Forever Sneaker, $58; everlane.com\n\nGap Kids' Be the Future Campaign\n\nGAP Kids\n\nAs a new school year begins, Gap Kids is recognizing the kids who are shaping the way forward by featuring young leaders in its new Be the Future campaign. It tapped Earth Uprising founder, Alexandria Villaseñor, 15; \"Little Miss Flint\" Mari Copeny, 13; One Million of Us founder, Jerome Foster II, 18; and #youthvgov plaintiff, Levi Draheim, 13, to bring the collection (and their respective causes) to the forefront.\n\nGap Kids' Be the Future Campaign\n\nTristan Eaton/ Gap Kids\n\nThe campaign will also unite these leaders on Friday, August 14 for a global virtual climate rally to fight for a more inclusive and sustainable world. Gap is encouraging participants to tune into the rally and post a sign with #BeTheFutureThatWill___, filling in the blank on how you plan to take on the future. (To join, visit @gapkids social channels.)\n\nGap Kids' Be the Future Campaign\n\nTristan Eaton/ Gap Kids\n\nIn addition, Gap is also partnering with the nonprofits, When We All Vote and Rock the Vote, \"to inspire our community to register to vote this election year and help ensure a better future for all generations.\" To spread the message, Gap created reusable non-medical grade face masks with the words \"Vote\" and \"Be the Future\" featured on them to benefit the organizations.\n\nThe Kaia Pant\n\nKaia Gerber/Instagram\n\nThe 18-year-old supermodel teamed up with Malibu-based sustainable brand Bleusalt to launch her signature pair of leggings. The $130 Kaia Pant flares into a bell bottom and comes in five colorways: black, navy, white, camel and heather gray.\n\nOn Monday, Gerber modeled the ultra-flattering style on Instagram, revealing in the caption that 20 percent of proceeds from each pair will be donated to an organization called A Sense of Home, which \"works to prevent homelessness by creating homes for people who have aged out of the foster care system.\"\n\nThe launch comes after Gerber's famous mom, Cindy Crawford, asked Bleusalt CEO and founder Lyndie Benson to \"elevate her favorite pants\" in the label's signature fabric a few years ago.\n\nThe Cindy Pant quickly became a staple in the Bleusalt collection, Benson said in a press release. Adding, \"Now, I am so excited to design a pair of pants for her daughter Kaia Gerber, a fashion icon in her own right.\"\n\nBuy It! The Kaia Pant, $130; bleusalt.com\n\nMotherhood Rental\n\nCaastle\n\nTo save moms-to-be the hassle of revamping their entire wardrobe when they're expecting, Motherhood Maternity now provides a convenient (and fun!) solution. For $69 a month, shoppers can subscribe to its rental service and get to select three items, from baby shower dresses to maternity denim, with each order throughout their pregnancy. And with no long term commitment required, members can cancel their subscription at any time once they welcome their new babies.\n\nBuy It! Motherhood Rental, $69/month; motherhoodrental.com\n\nvineyard vines x JAWS\n\nVineyard Vines\n\nThis might seem like an unlikely collaboration at first, but the preppy All-American brand and the iconic horror film have one major thing in common: Martha's Vineyard. The Massachusetts resort town is where the 1975 blockbuster hit about fatal shark attacks was filmed, and it marks the place where brothers Shep and Ian Murray founded vineyard vines over 20 years later in 1999.\n\n\"Our favorite movie filmed on our favorite island. This limited-edition collection brings us back to Martha's Vineyard and that unforgettable summer of '74,\" vineyard vines said of the limited-edition collection, which features one polo shirt and several JAWS logo t-shirts.\n\nBuy It! The vineyard vines x JAWS collection; vineyardvines.com\n\nMichael Costello x REVOLVE\n\nCourtesy Revolve\n\nMichael Costello is bringing the heat this summer! The celeb-favorite designer expanded his Michael Costello x REVOLE collaboration to include a swimwear line of sheer cover-ups, asymmetrical tops, high cut bottoms and sexy one-pieces that can be worn as bodysuits. Whether you're planning a staycation or just lounging in your backyard during these unprecedented times, this 14-piece launch has something you'll love.\n\n\"I hope everyone can have a little fun in the sun this summer and look cute while practicing social distancing,\" Costello said in a press release for the collection.\n\nBuy It! Michael Costello x REVOLVE Seneca One Piece, $138; revolve.com\n\nMichael Costello x REVOLVE\n\nCourtesy Revolve\n\nBuy It! Michael Costello x REVOLVE Amari Top, $135 and Amari Skirt, $140; revolve.com\n\nMichael Costello x REVOLVE\n\nCourtesy Revolve\n\nBuy It! Michael Costello x REVOLVE Dominco Top, $118; revolve.com\n\nRent the Runway x Whitney Port\n\nCourtesy Rent the Runway\n\nEntrepreneur and former star of The Hills Whitney Port - who founded her own label Whitney Eve in 2009 - proved she has a still got a knack for fashion design with this 19-piece Rent the Runway capsule collection. Inspired by her busy lifestyle as a working mom, Love, Whit includes flowy dresses, easy mix-and-match pieces and one-and-done outfit-makers. Select styles from the collaboration are made from sustainable materials, and a portion of proceeds will be donated to Until We Do It (a non-profit currently focused on disturbing face masks amid the coronavirus pandemic).\n\nBuy It! Love, Whit by Whitney Port White Puff Sleeve Wrap Dress, $45 (for a one-time rental); renttherunway.com\n\nRent the Runway x Whitney Port\n\nCourtesy Rent the Runway\n\nBuy It! Love, Whit by Whitney Port Citron Ruffle Blouse, $30 (for a one-time rental); renttherunway.com\n\nRent the Runway x Whitney Port\n\nCourtesy Rent the Runway\n\nBuy It! Love, Whit by Whitney Port Red Floral Printed Dress, $30-40 (for a one-time rental); renttherunway.com\n\nRent the Runway x Whitney Port\n\nCourtesy Rent the Runway\n\nBuy It! Love, Whit by Whitney Port Ivory Jumpsuit, $30-40 (for a one-time rental); renttherunway.com\n\nFRAME Shoes\n\nFrame\n\nPSA: Your favorite denim brand just made its footwear debut with a line of strappy sandals, ballet flats, wedges, comfortable heels and more, perfect for everyday wear all summer long. Available now on frame-store.com, each shoe embodies FRAME's signature cool girl aesthetic and \"completes the look of the FRAME woman,\"co-founder and co-creative director Erik Torstensson said in a statement.\n\n\"The shoes capture the essence of the brand's style and will take our customer through life at times when she is already in her FRAME wardrobe,\" he added.\n\nBuy It! FRAME Le Carbon Sandal, $375; frame-store.com\n\nFRAME Shoes\n\nFrame\n\nBuy It! Le Doheny Sandal, $395; frame-store.com\n\nMorgan Stewart Sport\n\nMorgan Stewart Sport. Courtesy Morgan Stewart Sport\n\nThe Nightly Pop host's summer activewear collection just arrived, full of pastels inspired by '70s and '80s tennis clubs (but they'll look just as at-home at, well, home). Complete with sports bras, bike shorts and leggings, the range has everything you need to hit the court - or Zoom workout - in style. Plus, each piece helps absorb sweat, and has UV protection.\n\nStill leaning toward the \"leisure\" side of \"athleisure\"? The collection also has soft sweats featuring a tennis racket insignia. (Plus, face masks!)\n\nBuy it! Morgan Stewart Sport sports bra, $78; lacollective.com\n\nMorgan Stewart Sport\n\nMorgan Stewart Sport. Courtesy Morgan Stewart Sport\n\nBuy it! Morgan Stewart Sport sweatshirt, $98, and joggers, $108\n\nFRAME Shoes\n\nFrame\n\nBuy It! Le Venice Wedge, $395; frame-store.com\n\nUnderclub's \"Underwear for All\" Box\n\nUnderclub\n\nIn honor of Pride month, leading underwear subscription service Underclub dropped a curated collection of gender-inclusive styles from brands including Hanky Panky, Free People and Ongossamer. Here's how it works: you'll take a five-minute online quiz to determine your personal style and undergarment preferences, then an in-house team of stylists will select your most figure-flattering pieces based on the results. With their guidance, along with a diverse line-up of everything from briefs and thongs, to low-waisted and high-waisted undies, the new \"Underwear for All\" line has something you'll love no matter how you identify.\n\nBuy It! Underclub Signature Plan (1 pair at a $18-$25 value), $12.95/month; underclub.com\n\nUnderclub For All Pack\n\nUnderclub\n\nBuy It! Underclub For All 3-Pack, $39 ($62 value); underclub.com\n\nUnderclub For All Pack\n\ndiscount.wine/ Instagram\n\nBuy It! Underclub For All 3-Pack, $39 ($62 value); underclub.com\n\nUnderclub For All Pack\n\nfomo.sexual/ Instagram\n\nBuy It! Underclub For All 3-Pack, $39 ($62 value); underclub.com\n\nAway's New Partner Minis Gift Sets\n\nAway\n\nLuggage brand Away has partnered with the CBD subscription service Feals as well as beauty brands Summer Fridays and Patchology on a collaboration that promotes self-care while also giving back. The three themed sets-the Mindfulness Set, the Rejuvenation Set, and the Relaxation Set-target a specific brand of wellness that you can do on the go - and feature travel-size selections from each brand all housed in miniature Away suitcases. All proceeds from these sets will go to Global Giving's Coronavirus Relief Fund.\n\nBuy It! Away x Feals Partner Mini Kits, $75 each; awaytravel.com\n\nUniqlo x Marimekko SS20\n\nUniqlo\n\nUniqlo and Finnish design house Marimekko have teamed up once again on a collection that celebrates summer, while also paying homage to Finnish culture. The capsule collection features an array of colorful pieces boasting Marimekko's signature bright prints that come in womenswear, girls sizes and baby clothes. The collection will be available on Thursday, April 23rd.\n\nBuy It! Uniqlo x Marimekko SS20 Dress, $50; uniqlo.com\n\nFair Trade USA's New Look Book\n\nChristelle de Castro\n\nTo raise awareness of the growing collection of Fair Trade Certified apparel available at stores including J.Crew, Madewell, REI, Obey Clothing and Patagonia among others, Fair Trade USA created its second annual We Wear Fair Trade campaign celebrating its latest styles. It tapped big-names like Rachael Wang to style the campaign and model and sustainable fashion activist Cameron Russell to star in it - as well as garment workers in Fair Trade Certified factories to model the products they had a hand in making.\n\nWatch the video campaign here, then shop the looks at FairTradeCertified.org/we-wear-fair-trade.\n\nFair Trade USA's New Look Book\n\nChristelle de Castro\n\nShop the looks at FairTradeCertified.org/we-wear-fair-trade.\n\nRothy's Sandals\n\nCourtesy Rothy's\n\nThe comfortable, sustainable and (best of all) washable shoes beloved by Meghan Markle have launched a must-have sandal for summer, whether your vibe is more neutral or you're looking for a pretty pop of color.\n\nBuy It! Rothy's sandals (the Knot in Candy Apple and the Triple Band in Sangria), $115; rothys.com\n\nRothy's Sandals\n\nrothys. Courtesy Rothy's\n\nBuy It! Rothy's Triple Band sandals in hot pink basket stitch, $115; rothys.com\n\nRothy's Sandals\n\nrothys. Courtesy Rothy's\n\nBuy It! Rothy's Knot in black, $115; rothys.com\n\nShades of Rose\n\nMcCall Ryan\n\nBuy It! Shades of Rose Faye Shirtdress, $100; theshadesofrose.com\n\nNordstrom\n\nUniversal Standard x Erdem\n\nUniversal Standard x Erdem", "images": ["https://people.com/thmb/Hln1zM0wZ5k2wo67Qg8JJtzdKR0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(539x0:541x2)/Sanuk-x-Airstream-Lifestyle-5-d4a02a9a6a56438398985b057291962b.jpg", "https://people.com/thmb/7fQMQv_a6wuYbK3P2KNz_UZSXig=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(689x429:691x431)/launches-3-6df58413b896446cae028f8cd20fd444.jpg", "https://people.com/thmb/kYcIUOwQVQzFWZ4QjF3NNIMXiKk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(586x179:588x181)/launches-2-18b76994e15f438e81e6643bd1a8d0f1.jpg", "https://people.com/thmb/5qL27rG5Bhfr3bHw7KJUadmggyA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(779x0:781x2)/NATIO-x-AE-13-2000-bf9d8514f3444f7e85729b0312172165.jpg", "https://people.com/thmb/LztNjwaQ-ix4eK4edUooLhNiWi4=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/anna-kepner-3-111025-c6a90b2f57474459a89ae04e296ec343.jpg", "https://people.com/thmb/pOurApZBl_DiLLm-4DT3xHv1FMo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(511x0:513x2)/mother-1-7d0bc7a2ba8c42bfacecd78ac40a2e2e.jpg", "https://people.com/thmb/wJ2RcAAOqZXVJxpU3jQPMJ098vI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/allbirds-01-291852b80b19484aabcb471cc6716004.jpg", "https://people.com/thmb/w76Ep2NYHWIGmy99vvbIT4G8Gx0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/AW20_1460-RX_MJ_HERO_LANDSCAPE_2-2000-7667120aead4455891d6592a88037ebc.jpg", "https://people.com/thmb/77UQH9Qjw0I3WhAp7oIESPJ98gI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/launches-we-love-2-6b778b87ce6940b094174eaae69af97a.jpg", "https://people.com/thmb/AaUYcmcRVXySHWI2MhlrDTpN2Yo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/Michael-Costello-for-Revolve-2-7a150bf33dfe49748d7ba58f721ade49.jpg", "https://people.com/thmb/HE9Vi9uw1C0duK0oHjnTtSAzsoQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/launches-we-love-2-1-59008a5c18444fd2aa105da28c49244b.jpg", "https://people.com/thmb/b6mJuZvehGe2Qr8oE8KYlMeWQ_U=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/joes-jeans-246b32dcea9f4c289de52b85986ecc64.jpg", "https://people.com/thmb/Qm7O2WOeyV58o1Wm4iM0PiTsM2E=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(416x0:418x2)/lacoste-17513f4246fb44d4891c368931192c9c.jpg", "https://people.com/thmb/--QqxTBm2QmAwhPpLnXFeqGvA6w=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(925x0:927x2)/hailey-bieber-1-2f20aa3f80d54f6cb5bc6d35a7640578.jpg", "https://people.com/thmb/hcNH4-aWaOJhhZXRcZlo4tzAHfw=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(492x0:494x2)/ugg-03-79f57f3479c54cfaad5bdf2a5c9dbaea.jpg", "https://people.com/thmb/BgTHgak5hwvpxZV_yBJXtcYC794=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/peo-oprahs-favorite-things-tout-1f44a584f6e94620a709d131d57de6d3.jpg", "https://people.com/thmb/mc_ZQM6q4dW27lJ7PUcbK-FxoxE=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/bash-earrings-00a0705cc1ae43fe9ab238a4cc0c2119.jpg", "https://people.com/thmb/strLQcdaK2JsftnjeGh-d8XUZ98=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/boden-2fc8cdbb523941b48858a70bf41a0960.jpg", "https://people.com/thmb/DNOWVGA8WqlXVegoK80lJHiqMFg=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/AlexaForMadewell11-e8a38df26d7649bcb41e5967b4d7878d.jpeg", "https://people.com/thmb/7j8QfpeaetM5WGkxe7yHtnskI6w=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/farm-rio02-ed464a033e7f42ddb5a3e8aa0299a347.jpg", "https://people.com/thmb/u-UIHGT62BvHQgVBQsyz-ox9RO4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/2116-210-2-957ac9986e004bf091b5110bbb7631de.jpg", "https://people.com/thmb/1m55Ipkhg7QpuhXFOocOPBCtsjg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(598x0:600x2)/tvf-4-0215de388ea9414496a7602ff6e29f4f.jpg", "https://people.com/thmb/SAb9YyOT6cXue-qGTLUBoQyoXIA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/bracelets-rings-db57e1487a4443a780460fe8dd320346.jpg", "https://people.com/thmb/pqDH6P9nnIKPZ1XuIVquxsB3kUg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/fashion-launches-1-06090285319b45b88a08471e61065277.jpg", "https://people.com/thmb/qrvmBnRGLxf46-Thkw8Zapdg8co=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/frame-shoes-2-f4853999d8f340929022e02b4b8611da.jpg", "https://people.com/thmb/Wcdx90Wawz4lC6tSjJlQsBVBgwg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Underclub_Editiorial_-36-0ef3931007c445f394aba6b08c4847d3.jpg", "https://people.com/thmb/zZZHr5ersfXX3OdHFdXxlaZzMAo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/J5-Front--0846dff15a304dbfa1b757c0fc745f9b.jpg", "https://people.com/thmb/DXN3AtrLBTC1EYqPpyr99fn7YIo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/november-best-beauty-launches-103125-c75dff41b78843b490515639a562fdc8.jpg", "https://people.com/thmb/TSzFgKztwu90dLpxNwfejApH0LY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/model-falls-on-runway-vietname-fashion-week-111425-8d2389b014f24083b056b69520ecfe41.jpg", "https://people.com/thmb/GKDGX77h_zngx8g5uC7vCmeoxf0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(687x0:689x2)/aqua-mary-katrantzou-2-f7d36573843d4267b8d2f777412bd1da.jpg", "https://people.com/thmb/p_3r8RI-P-MJAUpbef_WQipZWds=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/Pnina-Torna-jared-ee7a4257cda744cb9053090486e9a52e.jpg", "https://people.com/thmb/fQ-Tt6AA3K_knGylP-zHekMbkYI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(779x0:781x2)/NATIO-x-AE-8-2000-2af41e21e4b64e45974228fdb4fa79eb.jpg", "https://people.com/thmb/2jGo1tzKhMclTB64zpOHQw-WCxU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/frankies-bikini-3-3c97a6432ae64b4492e4948455c0c509.jpg", "https://people.com/thmb/YsCVNqM9EBzG9ljyLvOVh9m2qWo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/PopInLevis_PR_Melody2-5addd339a8584c9caeabad4098800cdf.jpg", "https://people.com/thmb/rEFz4Cang_7Q-haVKDQcgjlUedA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/nine-west594-0475d66058fd4f16aed066a4da2c71f2.jpg", "https://people.com/thmb/6errM_kzeAWvXfZNARA_-1gNAJg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/camila-coelho03-017df39da06346e79caba24893c2648c.jpg", "https://people.com/thmb/iUuCxMUG2aQafT900_391ZgBOco=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/peo-week-of-11-10-50-best-early-black-friday-deals-tout-60612332a9a5452cb8a0b40703a00054.jpg", "https://people.com/thmb/YgXnPO5z76DD8Iu525lKvgcyAVM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/KBH-We-Will-Rise-Necklace-YG-2000-44ae7c6760b64554938b976af8179efb.jpg", "https://people.com/thmb/xJ_Sljih25IEikfTxL4bPmK8g7k=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/CLUB-MONACO-3-1e3bcd0ce37f418b91eec9d056d00e5b.jpg", "https://people.com/thmb/t-mVbNchp_zAwJoXVDlYAsLtiIE=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Wildfang2F-6aba884062794ff295fce26d23413e9f.jpg", "https://people.com/thmb/e70aCAiyfnckgDaAfpqzLHkbLIM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(5712x4802:5714x4804)/kaia-gerber-569aab655bf942e2aec0520d1c79e528.jpg", "https://people.com/thmb/xLpbEWm_17NBRBEGu6kkgNP5ooA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Lauren-Burnham-5-c463e6ee59ea4353807f2d12648c0243.jpg", "https://people.com/thmb/yi-VYu6CaX44e2KDKGNNkHoCbgI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(914x0:916x2)/rails-2-2c9937cff2cb4ebba9ad8cdc3bf5ad83.jpg", "https://people.com/thmb/nrtNRlzOrF6Nvytpw1sY_E4zJ0k=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Casper-Rest-Stop-73-34ae455a37ec411f96f181af73dcdba9.jpg", "https://people.com/thmb/GqUgU7dIqiqRHbwFCEASjgwDIoQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/PeronixM.Gemi_2_-d2c58a8fa3b44ec2a55252c04d340535.jpg", "https://people.com/thmb/QoqQd8EO031vRBhCX1PNKr7z_9I=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/launches-we-love-4-dd35ddc6ccc0433aa216e9ca8bc994d9.jpg", "https://people.com/thmb/YPvhyX85Q8UgvYw_V83plBH5APo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Lauren-Burnham-4-3feb42e30b0f4eb0b4b140487d87fb63.jpg", "https://people.com/thmb/-eXae7kPtr3Dmv_-EUO6Swa9lY8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(689x198:691x200)/toms-shoes-1-15f2ccc2ddc34435b87c73ac29166b0c.jpg", "https://people.com/thmb/EfHsoL1DzfwedMG-55SezqwoXL8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/20200218_Tastemaker_WhitneyPort_01_042_RETOUCHED-2000-32dacccfc24041289c1d2b777ce84fc0.jpg", "https://people.com/thmb/mDm8_kmjGK3L4XA3gZQSUnzP8cI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(539x0:541x2)/Molly-Sims-wearing-Call-All-Mothers-Necklace-f00bd35267db48c5ac942c196d0ca4f0.jpg", "https://people.com/thmb/6_nrnN7qKhKT_V73_i77sQJkRVM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/toms-shoes-2-200872bc05c2483bb538013f4e9cc534.jpg", "https://people.com/thmb/Q4k74lzrGT4tKbhNXoWm-C7cRvQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Image-from-iOS-4-2000-00856bbdf4174de6864e0705f6e11ca2.jpg", "https://people.com/thmb/JgB8c9h2aktZPaXIy3vgk5hTjIg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/necklaces-6e87e6f43b1b41dcbd964d17ea8e51bf.jpg", "https://people.com/thmb/ulEWYA_fp4BZuuiS0HONzDDf46A=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/CLUB-MONACO-2-b3a3c08d9ea6425d8f8f6accc40303a0.jpg", "https://people.com/thmb/GTLEyjqIi-POWj7VglZ8zFb5Ou8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/MOTHER-02-c1a10d9b14d9447c8488e490997c5dd6.jpg", "https://people.com/thmb/w12MdnwPNQACArv4iX14adL_GUg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/frame-shoes-0241fe7c406d40df84084562a0e41ea8.jpg", "https://people.com/thmb/um4BmgwNYrk3jqN3EXQY0h1q7k4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/bruno-mars-4a9dff666fba498cad6dddf1f8b5c74a.jpg", "https://people.com/thmb/_4i5hjivGZ9_7rrWVNTjP5Ebj3s=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/frankies-bikini-2-2e17145562c34d9989b82c33a4a6ae5a.jpg", "https://people.com/thmb/zq46YMBAKvseoW3zd0fiT6r1gVw=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/AQUA-3-e46d3f127af347648254cde9ebb4b44c.jpg", "https://people.com/thmb/0sqttEX4yI7AZCBzZYjh-PS8YwY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/cuyana02-6df18a00fcb348f6b19a7531d51d02d2.jpg", "https://people.com/thmb/5LPfh_99b9MEP1T5Xs5xCPLZ4zw=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(507x0:509x2)/aview-bb1466c20c2b41c19cb8865334dbbe7f.jpg", "https://people.com/thmb/VnCmwDPmI1DJp1FpJl1n4KDdlWo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/jill-zarin-d6a0ddecdab545dc8f2888f00e0f5e20.jpg", "https://people.com/thmb/9QxyyH12WGw0rW2GQ4_66A98w0w=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(453x0:455x2)/joggers-b779ab0f5a7340b6bd213b89c94a48a4.jpg", "https://people.com/thmb/h-dq3nobAwHCNSaj9bk4z6XC0zg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/Lauren-Burnham-1-06ec9f4b97874a45b60e3e525a90ba96.jpg", "https://people.com/thmb/ONniRyrEModrA67O7emuv3uSlqI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/puff-1ded97a3e0154ddabd6348850a0f8906.jpg", "https://people.com/thmb/gPM9RubhrmhOlkCH2y1O9P0VuGw=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/sketchers-4c88d17a48844d8eaf8aa562bd24b246.jpg", "https://people.com/thmb/Q0kEwlYT43-ZXwMZBebeswkVfcg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/rothys-2-7f55792b319b417bb82f454f385c92fa.jpg", "https://people.com/thmb/-zb0d0r8e1gnVG9ufgqstHAe0_E=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(666x0:668x2)/naman-2000-bf07503af22645358368ab80550522f0.jpg", "https://people.com/thmb/JDKYT3oNjmRy53wKYwix4S5xq2s=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(374x0:376x2)/beayside-80a20fdb359343c2a015f8c4fe3e8e90.jpg", "https://people.com/thmb/v8XjbmAfZAzg4SWoPI25IhqZu18=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(527x269:529x271)/launches-4-4f36cf3654b24bedabd6b573b475178d.jpg", "https://people.com/thmb/bVIeFPEQgNz09PHPXlW92PnWkmk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/adidas-32b057d0931f41a88fd1a9e931a45ad6.jpg", "https://people.com/thmb/bkONnYtU4t2rN8Um57R_p8SY-68=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/be-the-one-2000-23a54043b013415e8b11a0b8c1a352c1.jpg", "https://people.com/thmb/BqHS3_2tDY9aB-Ay2D3IVW89sRY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/SU20_JAWS_SK_SO3_0002_2-2-680b078792564a1d8b8536f93de7d8ca.jpg", "https://people.com/thmb/efEhKNlVHeqxkMOGy-wpUDboQ4U=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/irina-dl1961-1-a0102eaa71884766abb38058d305fbbc.jpg", "https://people.com/thmb/7ulol8xirF2bK-HWzq7hvDrO268=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(539x0:541x2)/LOWH4-0483e4c9d34445a299f8b62e05e2833c.jpg", "https://people.com/thmb/1IRaQMMLjwAtKlFqpZuZu3vxFjs=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/Caastle_149-a7759eb6a5b848cea65344fd962aca02.jpg", "https://people.com/thmb/cvWhxoqbGQ6yew7nkFInV1xyQmk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/discount.wine4-1-d35d0ba2c9f04644a7398a2f98c8dec9.jpg", "https://people.com/thmb/f9mn2ffYK2YcmYo-sYRDZ4k6zYQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/camila-coelho02-29181dde463d483794561f1697464d3c.jpg", "https://people.com/thmb/h1VezrUcIc13LwzmTg9ILji2nBQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/farm-rio01-fe93ce61e96941fc9d7ecec1608fef6d.jpg", "https://people.com/thmb/su_rVlhCRzixz78yODEJ92lPtkM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(377x0:379x2)/aview-1-4e3b6c54cbe6499f8263919f79220a72.jpg", "https://people.com/thmb/xnYo_ECR-6ba68eZUO1lGJlEtb0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(604x0:606x2)/tvf-1-73e2c03545a24fed92f22cd97788505c.jpg", "https://people.com/thmb/eueDmAK4Hu4evEYawmfauTlk3eI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/calypso-st-barth-6-02ace6235b5d4ea7b8a0d1499ff9a167.jpg", "https://people.com/thmb/aXLZkIAYMcmqLsUuZnaGWZ6gJDA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(779x199:781x201)/launches-6-2b25a9229da54a649f776af5b6607319.jpg", "https://people.com/thmb/O0CbhKRtN8rhFa9ygT_j2olxubE=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Casper-Rest-Stop-74-5d4b8f7d119642e0b31e51cfa16233d0.jpg", "https://people.com/thmb/BSD4nHtByE9BVjLNBqCUXHmfwA8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/Southern-Curls-and-Pearls-18-32ccf437768b48958a29bac64ca465ec.jpg", "https://people.com/thmb/1YFK9sbmHMb6bVIe_oP7UoMdCF8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(525x0:527x2)/ugg-02-33c719e56f964491837d695383e612be.jpg", "https://people.com/thmb/es_ZauiupfuNZPVV8JThNbeNNSg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(715x0:717x2)/jill-zarin-masks-5d645b6f77e3449294b0356a996e8aea.jpg", "https://people.com/thmb/trg0Lr-U8wv0GwnnlLVPTwkrBaQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/apl-2b4418b48ab1462aa63e5f231d1c19bb.jpg", "https://people.com/thmb/oEmcm_a2L4VHJbZFXSD4kJ0QGQ4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/D20953-ddac38d011ec4335a32cfde9445730d6.jpg", "https://people.com/thmb/zmptVFwARb0lMTxIOvbwCwgSH0A=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/earrings-1f8ece378cc94973bdc8ac09eb0dccf4.jpg", "https://people.com/thmb/T3KN07PGHQ7qWFBzCz4hyE3ynG8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/ugg-bcb48b960ba447c8a11a763f62e92980.jpg", "https://people.com/thmb/MVvQhbIxykKtQX2YabBDodYmzug=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/tank-2000-4e7ad701d8bb41af81b8a45c73cb7257.jpg", "https://people.com/thmb/bxwkPw5DSzejbqGh7iFgCw7jqRQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/hailey-bieber-2-2000-ff59691102694b42b69c907ff0b12c1e.jpg", "https://people.com/thmb/ACSPPKhQB_lHk1yIbirH_kJTbys=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(863x0:865x2)/hailey-bieber-3-2000-c9ef878c3bcc45e18e709148c1b822f0.jpg", "https://people.com/thmb/BB7vYW82d0oBPiFINmr76DIy2dY=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/ben-dreyfuss-richard-dreyfuss-111925-b670f8ab6f994d1d9dfce1fa0726d205.jpg", "https://people.com/thmb/Pz4AEJ6xQlYj9q9M_hQO3TItdtk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(799x0:801x2)/Z5A1950-2000-a9bb25432c194b87a93995c709191032.jpg", "https://people.com/thmb/Jsy_mQYVM3ea7HVTwZFqZYOCfdk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(449x0:451x2)/Lauren-Burnham-2-a556f8ba62c344289b27ed2396e4e175.jpg", "https://people.com/thmb/BYIialyyzEdv-eolCdHpA805FIg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/away-ed7ca3f7ca884d7d96d105dce58bfab9.jpg", "https://people.com/thmb/MNWA3uHK6_JajCv_YY-hJ692HEw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/peo-quince-editor-picks-roundup-tout-5fa3ca033fca46c982ff99b86a6ef5ea.jpg", "https://people.com/thmb/W99kSBluvENPF0zIE4hxRbQKI1U=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/rails-1-0f5907c5c0144b0d8bee75fcde5b2d8d.jpg", "https://people.com/thmb/NRx8sAnjmODZDwCy54CjbGaQt9s=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/love-shack-fancy-4b4b1e5eba184eaf9e4fb39041b9f7a3.jpg", "https://people.com/thmb/mKOBsDcFP8dqda6woy05Pwlo7ig=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/bombas-2-c6732be97a6b43eaab397085d4962a79.jpg", "https://people.com/thmb/84Rcoo7Bmr4iF_GsHjqz6xNShg0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/tvf-3-2000-480e8f7345204b36a1023549588f1417.jpg", "https://people.com/thmb/IKC111KzvW5XnqUUZgZ2MH__mwk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/PANGAIA_2-4b99f38c588f488c80347a4eb1ef5658.jpg", "https://people.com/thmb/Bsk70xacOX68q1mUIamEGnF_JTQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(548x298:550x300)/ivy-park-swim-9d1fc349ff274a04bff5104e98f6e104.jpg", "https://people.com/thmb/ygzzpVPnvCjA2_RN0KdhsJnC6zM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/KBH-Calling-All-Mothers-Necklace-YG-2000-2c1bc2e5044f46ff9d5debc6dc000156.jpg", "https://people.com/thmb/26OyP1pvU2lvpDbUesdy2OlxyWQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(707x420:709x422)/Jurassic-Collection-Evolution-Carryall--47d181abe18447c19fbeb454cc03ce9e.jpg", "https://people.com/thmb/J7gmOKMd6nWCGq4FuiIfB1UyNxM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(734x429:736x431)/sunglasses-4088222ab615415dbd1c751c6afa9e2f.jpg", "https://people.com/thmb/q-4hQy9hchMAoovZaf59k9ZN-jU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(539x0:541x2)/dockers-campaign1-a946eec8dc6b435faeed6b517ed42a8f.jpg", "https://people.com/thmb/3KBlQCuEY4sf25Ekz1NLlDXwOD8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(511x0:513x2)/CUUP-3-bd01b831f999499db1965783278eff33.jpg", "https://people.com/thmb/CvArmXtJUnOzAzcHvCFDtKhuLNM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/CLUB-MONACO-1-c48e5b32d761497bbf2af379c7cd5524.jpg", "https://people.com/thmb/BUgrbaOq_1GZxQa4xEWe3Ss1vrc=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(776x0:778x2)/KB_20_FA_GG_VIDEO_20200723_GAP_01_0680_4x5_lockup-968e214faad149068c066a6d28cf8195.jpg", "https://people.com/thmb/MtK-f9__JZXfbADFPK9B728mMzY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(778x0:780x2)/farm-rio-2000-28b483d4cafa4e67b8547d158af9984b.jpg", "https://people.com/thmb/QHliqfdImcqyXbHR7xMrLXxrDCU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Canvas-Collection-Intro-99be36153dab41d7b8acb2f827862485.jpg", "https://people.com/thmb/g230TqqfdEngI_2ieZl92EKuxfU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(247x0:249x2)/neutral-02-f27d2e09c310493898195b6d0641925f.jpg", "https://people.com/thmb/fhX3zznFvA4EfCekY4DhLKD6Duw=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(446x0:448x2)/paige-97521ff420f34762ae1d787c1a88a277.jpg", "https://people.com/thmb/sAxCrzqKHCgZ4kqLBivjIeeeFHA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/launches-1-4188460ac04a44bbb8b096ffedb5f57c.jpg", "https://people.com/thmb/eem0DARkDf6vP0PPjrkithkms8U=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(686x0:688x2)/cotton-citizen-2000-906ad93b4a0d4bd68f446b4be560650e.jpg", "https://people.com/thmb/2DEor2jr23lfk-YmHKeho_tvEEE=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/Lauren-Burnham-3-ac9617d33ee44ddcb68c49a9f0ec8d9f.jpg", "https://people.com/thmb/QTJzVKMH0QisQqK0NrbMBC9KoTQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(671x0:673x2)/rothys-ada51273bc69481cb3363811869b3ac9.jpg", "https://people.com/thmb/e6RuReG7FiXLyQxxyrG7ozmeauo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/whitney_domonique_046-1-a2fe528f315e4bb0af487699b3a23917.jpg", "https://people.com/thmb/bd-1iTB9rcFBFpDLa-wa7uu3LfI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/Look_01_Constance-31in-Inseam_Premier-b7cd988b1be84a4f9630eb9999fa15b9.jpg", "https://people.com/thmb/zdFS1n2y9dNM-ndOtRjWY9G0kI4=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/Daniella-Karagach-111925-ls-1ffa54ba0f1749e380cfe98771660e16.jpg", "https://people.com/thmb/784GHuvARlXx_NaxClXwQlqFvZ4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/PANGAIA_-ab2d316217e94a039906b5c55d56f936.jpg", "https://people.com/thmb/YN30M9gK4lDAjc3VuvXOH7055ik=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/cameron_003-v2-1-a69e70d472444517b065bf67d54cc3b4.jpg", "https://people.com/thmb/1Tlx0oYRS-GePTlkk2VMcWSTpB8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/beckham-family-feud-brooklyn-beckham-nicola-peltz-1-060225-a09186f877bb4b29ad5def76d8dd3043.jpg", "https://people.com/thmb/qaGn2_IbOq2G3NSLT70wCal_TzM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Cloud9SilkyPJ2-2e55ef0e87ec43c8856cbe3c2cd3f790.jpg", "https://people.com/thmb/lfytfBPDNe4t-cs9WjxDbDr3JfU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(737x0:739x2)/JEROME-TristanEatonArtwork-2000-96a9877498924e7093497b7f77499330.jpg", "https://people.com/thmb/NF-ALCIVcxJPdXuBiZKRGv5k0tE=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/LILIAN-XL-HOOP-70MM-X-6MM-2000-66786e59668546e8bb703d2a482b5069.jpg", "https://people.com/thmb/HKt7-5iKV5xoBHNppZ9zMDpWHVU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(799x0:801x2)/Vans-Shoe-Layflat-Feed-07-94c95f0330174b1ca81a073b85d69ff4.jpg", "https://people.com/thmb/sVT84OfDl1j9JDH35ptw8_2i6LY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/birdies-ac21568482994a79ae189c6244ecf623.jpg", "https://people.com/thmb/DOBm66YScmz6sI_ybF48YlxhPEY=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/beckham-family-feud-brooklyn-beckham-nicola-peltz-1-060225-a09186f877bb4b29ad5def76d8dd3043.jpg", "https://people.com/thmb/Y4hShuS_RH-duhUgw-s6_BapCBU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/gucci-f6120b65d9154e0293ae51e545019990.jpg", "https://people.com/thmb/E9E_4FiF9NrydiM3Q9WprFWpseQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/PeronixM.Gemi_1_-ccc40e9637d84f659b6a07b0f286eb7d.jpg", "https://people.com/thmb/n9kB0pciVHwuV0zbCENQeZdWFLk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/frame-shoes-1-a434b5f01d0e4d68bdd1ef5ca7319dcf.jpg", "https://people.com/thmb/AyQhdK-QKFJSWj9lGk0u85l7peo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/loveshackfancy-02-70ba3fa1ab89471c8172d56b4bdcf26b.jpg", "https://people.com/thmb/NRrysy5GVckB4CI8oEpkbSzoLZs=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/draper-james-lands-end-2-75df5b24e9bc4ddd9d1afc3e3cae9880.jpg", "https://people.com/thmb/BVULjsiloylTMdHY0xE-02llrFA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/Kim_Shui-2000-f34b087c659d48dea27e7e11bba0522e.jpg", "https://people.com/thmb/4WxCpRDO4bnTdaEAMMgggFA2gUU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/coach-7e18bb6f6f40419e8d3a1373984fc3b0.jpg", "https://people.com/thmb/8w8iK-dBKqqdANoGPIAcRTrx1qE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/AlexaForMadewell11-e8a38df26d7649bcb41e5967b4d7878d.jpeg", "https://people.com/thmb/OBBYee_l0oa92IQBMWzCzz_jlcA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/koolabura-2-0058dbfb17694ce49425c0b3e6058279.jpg", "https://people.com/thmb/85ulTGzNoL5Kgg60jRdrSU9Cyf0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(788x0:790x2)/ALEXANDRIA-TristanEatonArtwork-2000-87bafb274e014330828f492d94b2ca73.jpg", "https://people.com/thmb/vvZkk_t_OGVuTFttDR9UcURJrxw=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/jill-martin-cd147f4455754f0b9ceedcc386a0fd09.jpg", "https://people.com/thmb/6ydXFYSFvOZ8xZAwsEjfXbp9QHw=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/MA-2000-a4ff69372bdd4ae190f56ae6031c2b69.jpg", "https://people.com/thmb/pQf1VxiXjdXfTixsbXh5xMrDDfc=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/AE-x-The-Jeans-Redesign-Collection_59.95_ae.com3_-2000-7059704d27844b1eaa9c092785e92bc9.jpg", "https://people.com/thmb/J1WEH232Srwx0wY0FC56MEEduJg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(719x419:721x421)/abercrombie-1b99c70c52444c009901b0276f2058a3.jpg", "https://people.com/thmb/7BHZ2tBAVu2KCRbYqr0zkygu8II=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(706x0:708x2)/CUUP-2-ade4057f1a9b4873a1d5eef0eb038ec1.jpg", "https://people.com/thmb/zTl4eqfV61BC_CSIZr-lbehXyC8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/ErdemxUniversal-Standard_InaLekiewicz11-2000-39338eae990b4233ba1d1c258ead996b.jpg", "https://people.com/thmb/SoEYF777SNXiJSmKgACns0V-Qw0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/PNINA_PORTRAIT-2000-d74a9318bf06410790c36de28ac1cc00.jpg", "https://people.com/thmb/XpLsBnzP5u2T4q8m6O55PtpYiF8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/AQUA-55345918399d41b89a3f0814f5de3dae.jpg", "https://people.com/thmb/meKal5wDZKpPFGSnQwc-WIScRHc=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/2118-520-2-c8959298068f4f61b352bfbe24fc3d15.jpg", "https://people.com/thmb/9jr0e3ImhwLrrBpFNsocTHANqJ4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(561x0:563x2)/stitch-fix-the-label-1-65bd9db83aaf44e680f61939ed992aa3.jpg", "https://people.com/thmb/vcP3jfYFeQ61anv3OyhxwpsEJZo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/cuyana01-59ca306ba0594a27907f5cfd8139d667.jpg", "https://people.com/thmb/Kuy2iIkk_R6gO4fJuv5Z_i4VTpA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/Everlane-Plimsoll-1-e6f5fec359d7455f89f2a6921708df34.jpg", "https://people.com/thmb/ieVw1y0CpGPtSXU15M_cSGeEqg0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/Hanky-Panky-x-SCL-Group-Shot-3D-2000-96a09cfe471044cb8a6c7397184aa99f.jpg", "https://people.com/thmb/OasPdsWWVJMNWZZT66NVj6hoATY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/nine-west595-45d5c518f02f4514a7f074fe5e8742e0.jpg", "https://people.com/thmb/PgXKi_tsxv4KZJf9vROo2E5ZhXM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/peo-oprah-loved-bags-tout-e29cf3e205b5412e827acb1de93c2a05.jpg", "https://people.com/thmb/rC27YiXozXhJVGlLUi52AQq5ybw=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/dockers-campaign3-148517189e0545a3be68e3448152e258.jpg", "https://people.com/thmb/lt1EREyec_ZDNMXnGR3sBGmB4og=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/peo-people-picks-oprahs-favorite-things-tout-2f1d58f28b5a4d97ac3dbd6903c4163b.jpg", "https://people.com/thmb/gt-sI43SHV8qPkGwJwoJUdBHYkU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(764x219:766x221)/launches-5-18d203495f714579b1932528d5a98fd9.jpg", "https://people.com/thmb/vk2DIMwS4X1glmyLxyKnS6c6e24=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/love-shack-fancy-02-8ae63e8265284bb08debc0ceb2b1fbc1.jpg", "https://people.com/thmb/dJ2D73zfaadqr1VTGOQDidncUMc=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/bombas-1-7de6a5abaf6a4b00850ce308fed041c9.jpg", "https://people.com/thmb/jxvCW1lzJHm66YIo2zkvFG6fyvo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/camila-coelho-1-14d335e0fa4c4355bfc0b1a30191051e.jpg", "https://people.com/thmb/_nXazl_zqtrOCXzclpuPx8XHiWc=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(282x239:284x241)/leauskirt1-92c7bd8070a64ac5a67736b3aac6fa1f.jpg", "https://people.com/thmb/9tIuRCQKAkGYpQouf5aA3FpDNp4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/wisdom-d30f6b72435745e9b83ce54defa8879b.jpg", "https://people.com/thmb/NWjHQbvEc1eQNXZOLKu_ja-NYa8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(561x0:563x2)/JA_SAVAGEXFENTY_PHOTOSET_6-f2823a9683a24a629d496d5f61d07db1.jpg", "https://people.com/thmb/H8GZ3IGp8uF6EBAY4hT4RFrzrS0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/koolabura-5201dcfd2c664e5695bf0c088e7a299d.jpg", "https://people.com/thmb/m3IfaSdcKBkWtdyBhffMtK_eNjA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/WildfangTanOiledNubuckWomensAlpMallow_F-eb31146559c7448a8286c48983f0d3c0.jpg", "https://people.com/thmb/iIYcXa94_jp3Wsw9zfFDvXZN7Rk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(799x0:801x2)/Z5A1939-2000-1cc2db6f0edd43f7807ba308b8941de2.jpg", "https://people.com/thmb/2a0x5q7OAlIafw_trYVmijrIT4w=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(787x0:789x2)/olga-2000-a1b0eff0a69e4c25a5e32108cd92820e.jpg", "https://people.com/thmb/r081taO7cn5BmxEkMl8kRc4P8YA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(863x619:865x621)/andie-3-4859dffd96414e318dbf9e3860d2717f.jpg", "https://people.com/thmb/aOatQy3vz_XrMoSmWXA2NR0RWr4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(344x0:346x2)/gucci-12-26770facadab4c95a844b52ffca7e41d.jpg", "https://people.com/thmb/k1wIJmiyInInTaiaKrfkUuWzJRQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Group-Photo-b16e5ffe63fa40b7a3c2d764eb46abe8.jpg", "https://people.com/thmb/RM6qCk55hA7Jvqc0SPsQyuDc9Hk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/lunar-la-scarf-2000-c8be5e33321d40c0b80453e08f925637.jpg", "https://people.com/thmb/WbuXX7_Jto-mw06-UpbOQXTEc3Y=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(794x0:796x2)/paloma-2000-8d05ea3c9b0041598ca058248c277bce.jpg", "https://people.com/thmb/HgknxFSJVhpS5G6p9LuCNfooSgo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/Michael-Costello-for-Revolve-3-7da9d16f449d40ce9f3e8e210db389dc.jpg", "https://people.com/thmb/Jebr3uSV-OAPXrkcFfmTVQRVTvg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/bodysuit-2000-f9308ea7f66445328afed8601c64c98b.jpg", "https://people.com/thmb/NtbE9Xcu3SFihtu-7tb8jNyG0rc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/peo-nordstrom-best-early-black-friday-deals-tout-d858d4e2273743dc98cbedf59082d550.jpg", "https://people.com/thmb/9L50JKnNBbyL3yW7otcxq_kuVfQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/Southern-Curls-and-Pearls-19-0ba184b1d7884f4f956c032b6c7f5e61.jpg", "https://people.com/thmb/zvfiI4N5L9T9BhcdcOoUVjoRCu4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(359x0:361x2)/Phenomenal-2af2167e99454356a25417602d3c6c21.jpg", "https://people.com/thmb/hFroxwtfkAugE4xVsU5dYaRrApE=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/fashion-launches-2-d3fa7a36b0614bd8aad354b7eb2b8e1c.jpg", "https://people.com/thmb/mv9PWBUsx0SgjbpWai9AT5e95Ts=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(698x0:700x2)/dkny-2-7a820e00cdb54eaea4b1cb4419dd2b02.jpg", "https://people.com/thmb/S-7RiBy0xm_WWPQOUMbvWT95-hw=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(539x0:541x2)/LOWH19-27a6ca8ccd1e4af3abe15a97dfeb827f.jpg", "https://people.com/thmb/0d47GQUgDxLfZ12ZBvE2Yf4HHA8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(605x0:607x2)/tvf-2-76512ca60c454633973eca68792515af.jpg", "https://people.com/thmb/f1pamX8CdVtNr_i6lXub-uJIoTY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(511x0:513x2)/keds-02-9759a1bac8744ac9a76f2a92765d3739.jpg", "https://people.com/thmb/cUY874Lk5BsvVqnR3EXZH35sZOg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/peoamazon-black-friday-outlet-deals-tout-d663b6f3bc314e17a1f95fd5bd9fcc40.jpg", "https://people.com/thmb/m4CSGEkxhBf7zGCHJAPnUn5ga2M=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/draper-james-lands-end-1-7b3050465b9a40ceac26cfef1f5161c3.jpg", "https://people.com/thmb/so0RlGGNVpt6y_LRmpIkDwUy5mE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/peo-k-carroll-accessories-riva-reversible-nylon-tote-oprahs-favorite-things-2025-tout-dcfac7e6bfe44cff83908bdd9f93c14c.jpg", "https://people.com/thmb/CDV0xDr_X7Rg9Hl9dbdD8EV93a0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/CUUP-33e6e95127a14c268e3ad792d32c9344.jpg", "https://people.com/thmb/U7-_Xx4Ehp3HUH8asp1OODMHHvU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/Michael-Costello-for-Revolve-4-2867718fb3f0472fbb7ec74517d6d7a0.jpg", "https://people.com/thmb/zub1fKiBAT4OQ7q9joEGkMP3cCI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(561x0:563x2)/jacket-24a8354149ae41d18fa0fe1a94686b47.jpg", "https://people.com/thmb/djp7H9GJYbPals1LFYVloX1CxFE=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/Banner-3-2000-be49258d303047a680f416a02b32c1ce.jpg", "https://people.com/thmb/-OGpr1sVwr8KGbBo9DRgAKHJ3X8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/bombas-3-907d6f41518a4426bc9c11ce1be62550.jpg", "https://people.com/thmb/hNcV_qCNzHqsg4F-JdZwL3XEYJI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/peo-50-best-early-black-friday-deals-tout-c364b23ebda74b938f66a64c1c2011d7.jpg", "https://people.com/thmb/acX9-ePugpbKjsW1AIUQzqYyWM4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/allbirds-cc5e635ddf5a4275bde52c6253811ab3.jpg", "https://people.com/thmb/Ek8SUl9xgdH-S9lsbJXd6hEISjQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/nine-west593-a364fb737fc44ceb82abf4e233e2785a.jpg", "https://people.com/thmb/9IcK8TF6UKWHDyOn664VR6tZYsM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Everlane-Plimsoll-2-5822551264be48448a61813a8a81459e.jpg", "https://people.com/thmb/Ca7InLVGkqNrboYgzL7bpi7Hspk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(609x0:611x2)/frankies-bikini-1-f938440a3ad546e88a40f23f7b25df53.jpg", "https://people.com/thmb/2KhGZjbxEs7GNN0vSOVkEN7L7kw=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(699x0:701x2)/draya-mitchell-2-7bebc98c91fa4713a4ca6654aa0ed4c0.jpg", "https://people.com/thmb/5P5KBNXL0tRYT05ItAKLwNWtvXs=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/All_6_patterns-05c1be87f99148c9987036cf1a5a0b89.jpg", "https://people.com/thmb/HUJo2yAJSDKw7fpvZue7QfA02cQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/Keds-x-HATCH-2000-4c716d93edb640189685e49e9923d326.jpg", "https://people.com/thmb/VxvxTgk6acZ2mDHgeA7lMkqw718=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(808x0:810x2)/draya-mitchell-3-d26e6e3c5ddf4a73a8bdf04735d89b76.jpg", "https://people.com/thmb/ZZjuxO-db0XADl3PiTyvIQKHsDI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/MOTHER-92377faa687749149479785389a2305d.jpg", "https://people.com/thmb/rpzGvXFWOojIbfTaUHQd2kYf9vk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/peo-ent-team-multiretailer-roundup-best-black-friday-deals-this-week-tout-da1168f998ef42c0aa22283d83e97e9f.jpg", "https://people.com/thmb/11WPXj7zK7n42VpwzRa_kQ3Qen0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/set-active-2a-ec5c1ef22552463c8ac65c3816fae825.jpg", "https://people.com/thmb/xFwYBah0W__2xiI05RVSCalN4HI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(359x0:361x2)/ganni-1e9f5ddfce3a4715806d291f23a20480.jpg", "https://people.com/thmb/LysY4U2l3svbjU3pLCD8dw3U9YI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/loveshackfancy-f731a1e9bb7a42ca8644225a2cea3359.jpg", "https://people.com/thmb/_S8WS9827dNx8H6OXCCLu-bP_-Q=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/rothys-3-636dfde29845417987ede05e896643eb.jpg", "https://people.com/thmb/cWNYoSiloIeWg55CZ2Rsv8XLBXQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/stitch-fix-the-label-2-d159279ce30c45d9b11dff1b0df8b7dc.jpg", "https://people.com/thmb/mNWXMKjvr0YuPidMMPY1bCSKGO4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(255x0:257x2)/neutral-03-715b98f1541f4a789ea3537e4ab5f14c.jpg", "https://people.com/thmb/0o3l8adyyWXXLSe0FzCkuIAizHg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/AE-x-The-Jeans-Redesign-Collection_59.95_ae.com2-1-4be5d766f5ff433ba141aff4f20decfd.jpg", "https://people.com/thmb/rMOpwlaZ2bsCs8THOz9JPJ8cweo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(374x0:376x2)/Image-from-iOS-3-e49115b4f908480b83d50312c6835e79.jpg", "https://people.com/thmb/n8T11_oMDyt-DPFlWtkeKkqh3wU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/neutral-37681f541ea648689f7d52628f150074.jpg", "https://people.com/thmb/Kq8qZ7DMGub9Hozpb9zMI_iJmQ4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(704x239:706x241)/The-Great-x-Eddie-Bauer-ca35afd0d9fa46cf9bdf954ae3108573.jpg", "https://people.com/thmb/zbKRjqZokU1WCkebd_UkJte_l2k=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(511x0:513x2)/american-eagle-02-d673190f84a34ceea6241f52c696b8f2.jpg", "https://people.com/thmb/wK3XqDW03ipY4HzP6RSWL_wnF3c=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/set-active-1-d77d1b015ca443ae86245240635bb2cc.jpg", "https://people.com/thmb/OZNKW4JibRW51zHSIO0xLam1L-E=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(666x0:668x2)/DSC_9165-2000-c44e9b63d0994040ac7054d1b68e5c20.jpg", "https://people.com/thmb/QgWiwb1EDNrHFOrmrURLLv0afe4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/jill-zarin-2-2000-aa3ea27edc2a43ba944301e35551775a.jpg", "https://people.com/thmb/993VGfGNU5OVPmB-8OOeHXKez88=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(899x0:901x2)/dkny-87cb4d37ab8c453191c0dd0468623739.jpg", "https://people.com/thmb/WbGYHu80I3yfQMObKR4_VgBMzek=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/peo-best-bf-early-deals-tout-4035314226f14ff0810372f438390389.jpg", "https://people.com/thmb/ChgP2xLs-0l_n51o29JVHbfs-Pw=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(4499x5624:4501x5626)/summersalt-rifle-paper-co-2-224910ce922f4c2696fb50050686c3f4.jpg", "https://people.com/thmb/obOaJspIxi1lqfR1IGb1WcCVGRw=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(509x344:511x346)/launches-f55bbfaec3a74b3fa9296abd78d88f84.jpg", "https://people.com/thmb/ckUT5bRfKfBDUdVTX7BkttKq_24=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(325x525:327x527)/leatherology-2946b07b89be4beb849a613bc9baebac.jpg", "https://people.com/thmb/DHaTTYAEBMNXStH1HIxdLbDncFk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(511x0:513x2)/american-eagle-c52c053016434ef0b794a900ad3dddcf.jpg", "https://people.com/thmb/hTuqKXrEKeyNGTHn95Y-4rkIaJU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(511x0:513x2)/Joe_s_20th-Anniversary-Campaign-e3e70c1a3b214a86a40c587cf13d12d0.jpg", "https://people.com/thmb/o13alTbQX5q5DN_N49NRvmGAIlU=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(574x0:576x2)/summersalt-rifle-paper-co-1-9da24d3ec3c946c6a8e17010a80a236d.jpg", "https://people.com/thmb/xE2fR6CzVBiHDdmF2iL4ihPScNs=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(602x0:604x2)/aqua-mary-katrantzou-1-864dd014413148869391aeed6b58145e.jpg", "https://people.com/thmb/iK0lUQxEzmw_m-jsWf7ek8majwg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/jill-martin-cd147f4455754f0b9ceedcc386a0fd09.jpg", "https://people.com/thmb/8bWPJHWz_gBb138mtOpv9K0HB60=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(511x0:513x2)/american-eagle-03-16827bbbf8d04e50bb80f0bead9ad921.jpg", "https://people.com/thmb/0KJ2aR6JAMSBYY2JepLV2TKvSgs=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(337x330:339x332)/bridgerton-sweatshirt-e0b6d9f7b29548f0a00ebb8414de17a8.jpg", "https://people.com/thmb/cpH7Xpa_zmmMDhrbvQFQrBkwAsk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(764x239:766x241)/Markarian-5a5707585a4f4a408f3c9fd776ade1b5.jpg", "https://people.com/thmb/IPtEAw9Og3NQN3E6b0jtJ8CPuI0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/launches-we-love-1-c0b453fda5f14072a819012a8e293e3c.jpg", "https://people.com/thmb/j-jqO_aGZE8PPXmIIv5lYD_IGW4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/nine-west596-a437716f499e47adb6a3a1a11951feba.jpg", "https://people.com/thmb/ds3cQdu_uc75TSyLyk-BrVe3Kzs=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/peo-best-bf-early-deals-tout-4035314226f14ff0810372f438390389.jpg", "https://people.com/thmb/2ntBVKq803YCM2o7MZinFhZGfvY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/peo-week-of-9-8-editor-loved-budget-friendly-fall-fashion-tout-d6bc44106e38492d9acee2e5d21da383.jpg", "https://people.com/thmb/c8G8Rk_sq-aEA9bG9PuFm96oBFI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(501x0:503x2)/sofia-richie-3eb95bc15e25460c89d2940e69ac2496.jpg", "https://people.com/thmb/cAXijz9EfYBS7e4z3b5Ki0vlIbQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/Cloud9SilkyPJSet_Rifle_HolidayMenagerie_0319-da9345202c6042cca41040ee31a25635.jpg", "https://people.com/thmb/TfwdKdDLIpO43nTUAPsAWMycPVY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(728x0:730x2)/draya-mitchell-1-583470c0394d44a1b2fb45322d4ff37d.jpg", "https://people.com/thmb/3JuJ25nLHH0c6TLUZWknhNhaCeY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/sharkchaser-7137dbfa439542828eb290e86a5695db.jpg", "https://people.com/thmb/0jKnK8bSyr7Fb41sXsNwd1jtAFM=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/jenna-bush-hager-minka-kelly-today-with-jenna-and-friends-111925-7e3c2b8605fe4a96a1b712c168083adb.jpg", "https://people.com/thmb/pIDoG2BVDLsnvuySR0iskEGE3wA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/dockers-campaign2-2000-d59c073980e344dab352c29be5f0067a.jpg", "https://people.com/thmb/WZvS2LE9JXg2GpogXIXO4DH11Mg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(821x0:823x2)/andie-2-023a7f4eda43414db531174db2e841e4.jpg", "https://people.com/thmb/J-8o6v-5HMN4sBOFTQZbsJ_ZqqI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(539x0:541x2)/LOWH10-e68ca742a2f34c9fa83dba13c4610d93.jpg", "https://people.com/thmb/1Y-tG1Pw1JxzDV7OGmSacrcviS8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/AQUA-2-08a9692067d149ecab2c083e91bbe75e.jpg"], "top_img": "https://people.com/thmb/iK0lUQxEzmw_m-jsWf7ek8majwg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/jill-martin-cd147f4455754f0b9ceedcc386a0fd09.jpg", "keywords": [], "authors": ["People Staff", "Michelle Lee", "Angel Saunders", "Clara Mcmahon", "Rachel Trujillo", "Isabel Garcia", "Alyssa Grabinski", "Skyler Caruso", "Izzy Baskette", "Jackie Fields"], "canonical_link": "https://people.com/style/the-best-new-fashion-launches-to-shop-right-now/", "title": "The Best New Fashion Launches to Shop Right Now", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Fashion launches to buy right now from your favorite stores. Shop them and more at PEOPLE", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "PEOPLE", "sailthru.author": "People Staff", "sailthru.tags": "from-the-magazine,stylewatch", "parsely-section": "From the Magazine", "parsely-tags": "From the Magazine,People.com,StyleWatch,Fashion,Shopping", "article": {"section": "People", "author": "https://www.facebook.com/peoplemag"}, "og": {"type": "article", "site_name": "People.com", "url": "https://people.com/style/the-best-new-fashion-launches-to-shop-right-now/", "title": "The Best New Fashion Launches to Shop Right Now", "description": "Fashion launches to buy right now from your favorite stores. Shop them and more at PEOPLE", "image": "https://people.com/thmb/iK0lUQxEzmw_m-jsWf7ek8majwg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/jill-martin-cd147f4455754f0b9ceedcc386a0fd09.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "The Best New Fashion Launches to Shop Right Now", "description": "Fashion launches to buy right now from your favorite stores. Shop them and more at PEOPLE", "image": "https://people.com/thmb/iK0lUQxEzmw_m-jsWf7ek8majwg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/jill-martin-cd147f4455754f0b9ceedcc386a0fd09.jpg"}, "vf": {"url": "https://people.com/style/the-best-new-fashion-launches-to-shop-right-now/"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.146.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.146.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.146.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.146.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.146.0/icons/favicons/mstile-310x150.png", "fb": {"pages": 95926963131}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}