{"url": "https://en.wikipedia.org/wiki/Coca-Cola_Vanilla", "text": "Vanilla-flavored cola\n\nCoca-Cola Vanilla, originally marketed (and still commonly known) as Vanilla Coke, is a vanilla-flavored version of Coca-Cola, a cola soft drink, produced by The Coca-Cola Company since 2002. A no-calorie version also exists, Coca-Cola Vanilla Zero Sugar, based on Coca-Cola Zero Sugar. The drink is also distributed using a Coca-Cola Freestyle machine, which injects vanilla syrup into regular Coca-Cola.\n\nFormer logo (2021–24) before the gradient effect\n\nAt launch, Vanilla Coke was at the time the Coca-Cola Company's biggest product launch since Diet Coke.[1] In the United States, it was the fourth brand extension in Coca-Cola's history, following Diet Coke (1982), Cherry Coke (1985), and Lemon Diet Coke (2001); in many other countries which did not receive the latter two, Vanilla Coke became the first flavored Coca-Cola product.[2][3] Coca-Cola Vanilla has been variously marketed around the world since, and in the United States it was initially discontinued in cans and bottles in 2005 before relaunching two years later. The company have also released other combo varieties of Vanilla: Coca-Cola Black Cherry Vanilla in 2006, Coca-Cola Orange Vanilla in 2019, and Coca-Cola Cherry Vanilla in 2020.[4]\n\nDevelopment [ edit ]\n\nOriginal Coca-Cola already contains small amounts of vanilla. The history of adding additional vanilla flavoring to Coca-Cola, at least in the US, dates back at least to the 1940s when local soda fountain workers (soda jerks) would upon request add a \"shot\" (roughly two tablespoons) of vanilla syrup to a (12-16 oz) Coca-Cola fountain soda. For decades, this remained common practice in ice cream shops where vanilla syrup and Coca-Cola were both available.\n\nThe Coca-Cola Company first tested a Coca-Cola blend with extra vanilla flavoring at the 1982 World's Fair in Knoxville, Tennessee, along with Cherry Coke.[5] After the introduction of Cherry Coke and the failure of New Coke in 1985, the company was hesitant to introduce anything radically new. It was not until April, 2002 that rumors began to circulate that the company was planning a new variation on their classic soft drink. The Coca-Cola Company was tight-lipped regarding the details of the new beverage, commenting to a London based newspaper, \"We've always got a number of things in development,\" leaving open speculation for what was to develop.[6] It was later revealed that testing for a vanilla flavor had been completed and that the new beverage would be available in months. However, in late April, 2002, the company announced that Vanilla Coke would begin production as early as May.[7]\n\nMarketing campaign [ edit ]\n\nThe marketing campaign for Vanilla Coke during its 2002 launch aimed to appeal across all generations. Yolanda Ball, brand manager for Coca-Cola Classic, said, \"We had to learn how to balance the newness of vanilla with the established qualities of Coca-Cola\".[8] The diet variety would be directed primarily at women.The first public tasting of Vanilla Coke took place in the Buckhead district of Atlanta at the Three Dollar Cafe with Atlanta radio station Q100 and their morning hosts from The Bert Show.[citation needed] The first batch of Vanilla Cokes debuted at the Vanilla Bean Café, locally known as \"the Bean,\" in Pomfret, Connecticut.[9]\n\nOne of the first notable advertisements was a television ad created by The Martin Agency which was based upon the product's original campaign line of \"Reward Your Curiosity\". The ad featured actor Chazz Palminteri, in which he and another man pull a teenager (played by a young Aaron Paul) into an alley after catching him peering into a hole. Palminteri gives the boy a Vanilla Coke, as a reward for his curiosity. Their former website rewardyourcuriosity.com went along with the campaign and drew a large interest at the time. (In the Philippine version of the ad, Palminteri's role was taken by actor Johnny Delgado.) Ms. Ball described the ad: \"We were trying to create something new and intriguing. Half of it was about new, different and change of pace, and the rest of it was about how people love and trust Coca-Cola. But we didn't have to say New from Coca-Cola. We didn't have to hit them over the head with it.\"[8]\n\nOverseas launch [ edit ]\n\nThe introduction of vanilla flavor was hailed by The Coca-Cola Company as \"the greatest innovation since Diet Coke in 1983\".[10][11] Later in 2002, it was introduced to Australia, Norway and Sweden.[12] As of 2003 , Vanilla Coke was marketed in several European countries including France,[13] Germany,[14] Britain,[15] as well as Mexico, Thailand,[16] Australia and New Zealand, and South Africa.[17] In 2003, PepsiCo introduced Pepsi Vanilla to compete with Vanilla Coke.[18]\n\nDistribution [ edit ]\n\nVanilla Coke can from 2002\n\nCoca-Cola Vanilla can after 2007 American relaunch\n\nBy late 2003, the company had marketed Vanilla Coke in over 30 countries around the globe. The \"Vanilla Coke\" name was originally used in the United States and Canada as well as many other countries around the world such as Germany and Asian territories, whereas \"Coca-Cola Vanilla\" was the brand used in some places such as the Netherlands, France (translated to \"Coca-Cola Vanille\") and Mexico (translated to \"Coca-Cola Vainilla\").[19]\n\nCustomer and commercial reception was mixed: in markets such as Hong Kong and Thailand, Vanilla Coke had a positive impact. However, the product struggled in North America and some other regions, including India.[20] North American sales peaked in its inaugural year in 2002. It is estimated that the product was purchased by about 29% of all United States households that year.[21] Doubt was cast over the future of Vanilla Coke and its diet version when the company announced the 2004 sales figures: 35 million unit cases in North America compared to 90 million in 2002; Vanilla Diet Coke dropped from 23 million unit cases in its inaugural year (2003) to 13 million in 2004.[22] Because of declining sales, the Coca-Cola Company announced in November 2005 that Vanilla Coke would be discontinued in North America and Great Britain by the end of the year.[22][23] Vanilla Coke production had already ended in Sweden earlier in 2005.[24][25] Coca-Cola introduced Black Cherry Vanilla Coke and Diet Black Cherry Vanilla Coke for the North American market in January 2006 as a replacement.[22][26]\n\nThe beverage continued to be produced and sold in many other markets where it performed better, such as Australia, France, Russia, Malaysia, and Germany, but was also grey imported to some places. The drink started being officially introduced into new markets in China and other European and Asian countries in 2007, including being re-introduced into New Zealand on February 19, 2007.[27] Soon afterwards, Coca-Cola announced that the drink, now as Coca-Cola Vanilla, will be officially brought back to the United States after a year and a half hiatus.[28] It relaunched on May 25, 2007 at the World of Coca-Cola Museum in Atlanta, Georgia, in a partnership with Edy's Ice Cream to co-advertise with Coke on the launch, and featured a 10-ton Vanilla Coke float, which was certified by the Guinness World Records as the largest ice cream float in the world.[29] A Coca-Cola Vanilla Zero, based on Coca-Cola Zero, was also introduced. The advertising campaign for the revival used an instrumental cover of \"Welcome Back\".[citation needed]\n\nAdvert celebrating the re-launch of Coca-Cola Vanilla on the side of a bus in London\n\nVanilla Coke (now as Coca-Cola Vanilla) was officially re-introduced to Sweden in February 2013.[30][31] Soon after, the drink also returned to stores in Great Britain in April 2013 after a seven year absence.[32] Originally released limited, it became a permanent Coca-Cola product in the country later on. The same year the drink started appearing in Romania, Belgium, the Netherlands, the Czech Republic, Slovakia and Denmark.[citation needed] Coca-Cola Vanilla was introduced in Lithuania and Poland in 2015.[citation needed] During the 2016 Summer Olympics the vanilla and cherry version was presented to selected markets in Brazil.[33] The drink returned in bottled and canned form in Canada in 2016, more than a decade after it was withdrawn.[34]\n\nIn July 2018, Coca-Cola Vanilla re-appeared in Russia as limited edition in Magnit supermarkets,[35] but due to high sales, it became available in all retail chains as a permanent product.[36] In the same year, Coca-Cola confirmed the product's discontinuation in Britain, in favour of the Vanilla Zero Sugar variant.[citation needed]\n\nPackaging [ edit ]\n\nCoca-Cola Vanilla bottle sold in 2013\n\nVanilla Coke was initially packaged in standard bottles in accordance with appropriate Coca-Cola packaging. For a brief period of time in mid-2003, the bottles that Vanilla Coke came in, which had before said Vanilla Coke, were changed simply to V (which matched Cherry Coke's new labeling showing a picture of a cherry).\n\nCans of Coca-Cola Vanilla as sold in Malaysia in 2019 (during the company's \"One Brand\" branding era)\n\nAs part of Coca-Cola's ongoing \"One Brand\" marketing campaign, a new U.S. packaging design for Coca-Cola Vanilla was introduced in January 2019. The new packaging follows the design principles already employed in the United States for Coca-Cola, Coca-Cola Zero Sugar, and Coca-Cola Life. The word \"Coca-Cola\" is superimposed upon a red disc with a light beige drop (representing a drop of vanilla syrup) below the text. The background color of the can or bottle is light beige in color.\n\nNon-sugar variants [ edit ]\n\nDiet Coke Vanilla [ edit ]\n\nIn addition to Coca-Cola Vanilla, the company also launched Diet Coke Vanilla as a low-calorie variant based on the Diet Coke formula. This drink was first introduced as \"Diet Vanilla Coke\" in the fall of 2002 in the United States, shortly after the launch of the regular Vanilla Coke.[37] It was released in 2003 in Australia as \"Diet Coke with Vanilla\".[38] In some other countries it was known as \"Diet Coke Vanilla\", with emphasis on the Diet Coke label, as well as \"Coca-Cola Light Vanilla\" or \"Vanilla Coke Light\" in some markets like Hong Kong.[39] It was discontinued along with the normal Vanilla Coke in North America at the end of 2005.[23] Diet Coke Vanilla continues to be available as a mixer on Coca-Cola Freestyle machines.[40]\n\nZero Sugar Vanilla [ edit ]\n\nCoca-Cola Vanilla Zero can\n\nCoca-Cola Zero Sugar Vanilla is a low-calorie variant of vanilla based on the Coca-Cola Zero Sugar formula. It was introduced as \"Vanilla Coke Zero\" in 2007, initially sold in the United States, and relaunched under its current name in 2016.[41] The drink was launched in Britain in 2017[42][43] but has been discontinued in supermarkets in 2025.[44] It launched in Finland in 2021 (as Vanilja), seven years after the discontinuation of regular Vanilla there.[45] Coca-Cola Zero Sugar Vanilla has been introduced in Thailand in 2025.[46] It is also available in Sweden, New Zealand, the Philippines and France.[citation needed]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Vanilla_Coca-Cola.jpg/960px-Vanilla_Coca-Cola.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Coca_Cola_Vanilla_Zero.jpg/250px-Coca_Cola_Vanilla_Zero.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Vanilla_Coke.png/250px-Vanilla_Coke.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Vanila_Coke_Malaysia.jpg/250px-Vanila_Coke_Malaysia.jpg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/Coca-cola_vanilla_logo_2024.svg/250px-Coca-cola_vanilla_logo_2024.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/CreativeTools.se_-_PackshotCreator_-_Coca_Cola_Vanilla_%284306184928%29.jpg/250px-CreativeTools.se_-_PackshotCreator_-_Coca_Cola_Vanilla_%284306184928%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Coca_cola_vanilla.jpg/250px-Coca_cola_vanilla.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Coca-Cola_logo.svg/120px-Coca-Cola_logo.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Vanilla_Coke_is_back_advert.jpg/250px-Vanilla_Coke_is_back_advert.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Vanilla_Coca-Cola.jpg/250px-Vanilla_Coca-Cola.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Vanilla_Coke.jpg/250px-Vanilla_Coke.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Vanilla_Coca-Cola.jpg/960px-Vanilla_Coca-Cola.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Coca-Cola_Vanilla", "title": "Coca-Cola Vanilla", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Vanilla_Coca-Cola.jpg/960px-Vanilla_Coca-Cola.jpg", "width": 819, "height": 1200}, "title": "Coca-Cola Vanilla - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}