{"url": "https://www.royal.uk/wedding-charity-donations", "text": "Prince Harry and Ms. Meghan Markle are incredibly grateful for the goodwill shown to them since the announcement of their engagement and are keen that as many people as possible benefit from this generosity of spirit. The couple have therefore asked that anyone who might wish to mark the occasion considers making a donation to charity, rather than sending a wedding gift.\n\nPrince Harry and Ms. Markle have personally selected seven organisations they would like to support, reflecting their shared values.\n\nPrince Harry and Ms. Markle do not have any formal relationships with the charities chosen. The couple have chosen charities which represent a range of issues that they are passionate about, including sport for social change, women's empowerment, conservation, the environment, homelessness, HIV and the Armed Forces. Many of these are small charities, and the couple are pleased to be able to amplify and shine a light on their work.\n\nThe charities chosen by Prince Harry and Ms. Markle are:\n\nCHIVA (Children's HIV Association)\n\nThe Children’s HIV Association (CHIVA) supports children growing up with HIV and their families, across the UK and Ireland. The charity aims to enhance the wellbeing of children and young people with HIV and to create a more hopeful and optimistic future for them, ensuring they achieve their greatest potential.\n\nDr Amanda Williams, Chair of CHIVA, said: \"We are delighted and honoured that Prince Harry and Ms. Meghan Markle have chosen to recognise our work supporting the health and wellbeing of children and young people living with HIV in the UK and Ireland. We are grateful for the opportunity to raise awareness of the complex issues for young people growing up with HIV. We are a very small charity and through our work we support over 1,000 young people living with HIV. All donations will make a significant difference to our programmes of work and lead to direct improvements in the lives of these young people.\"\n\nCrisis is the national charity for homeless people. The charity helps people directly out of homelessness, working side by side with thousands of people each year to help them rebuild their lives and leave homelessness behind for good.\n\nJon Sparkes, Chief Executive of Crisis, said: “We are hugely grateful that Prince Harry and Ms. Markle are asking the public to support Crisis as they celebrate their wedding. Homelessness is one of the most urgent issues of our time, but at Crisis we know what it takes to end it. Donations will help us to support more people to leave homelessness behind through our housing, employment, education and advice services across the country, and to campaign for the changes needed to solve the homelessness crisis once and for all.”\n\nMyna Mahila Foundation is a charity which empowers women in Mumbai’s urban slums, by providing them with a trusted network, where they are supported professionally and personally to help them grow as individuals and businesswomen. Myna offers women from these communities stable employment close to their homes, and breaks taboos around menstrual hygiene by offering women access to low cost sanitary pads and accurate information at their doorstep. Providing mothers in the community with these products helps them equip their daughters to stay in school. The pads are manufactured and distributed by women from these communities. The charity also empowers its staff through training in women's health, English, Math, and life skills such as self-defence.\n\nMs. Markle saw the work of the Foundation first hand when she visited the charity last year, and wrote about it in Time Magazine.\n\nSuhani Jalota, who founded Myna Mahila in 2015, said: \"Myna Mahila Foundation is delighted to be a part of this special occasion for Ms. Meghan Markle and Prince Harry. This support will enable us to expand our reach into more urban slums in Mumbai, empowering local women through access to menstrual hygiene products and employment opportunities.\"\n\nScotty’s Little Soldiers is the charity for bereaved Armed Forces children. Inspired by the experience of war widow Nikki Scott, the charity offers vital support to children who have lost a parent while serving in the British Armed Forces.\n\nScotty’s Little Soldiers Founder, Nikki Scott, said: “To have been personally chosen by Prince Harry and Meghan Markle is an incredible honour for Scotty’s Little Soldiers and we are extremely grateful for the opportunity. Having met Prince Harry at Buckingham Palace last year, I know that the Armed Forces and looking after the children our heroes have left behind is close to his heart.\n\n\"Scotty’s Little Soldiers offers a vital support network for children, who at such a young age, have already gone through so much. Just having the opportunity to spend time with other children who have gone through something similar or receiving a gift on the anniversary of their parent’s death can help reassure them that they are not alone.”\n\nStreetGames uses sport to change lives across the UK, helping people and communities to become healthier, safer and more successful. StreetGames uses sport to empower young people to kick-start a cycle of positive change in their own lives that resonates across their communities.\n\nJane Ashworth OBE, CEO of StreetGames, said: \"All of us at StreetGames are absolutely thrilled to have been personally chosen by Prince Harry and Ms. Markle. It’s a great honour to have our work using sport to change lives and communities recognised in this way.\"\n\nSurfers Against Sewage is a national marine conservation and campaigning charity, which inspires, unites and empowers communities to take action to protect oceans, beaches, waves and wildlife.\n\nHugo Tagholm, Chief Executive of Surfers Against Sewage, said: “Surfers Against Sewage is thrilled to be one of the charities chosen to benefit from donations marking the wedding of Prince Harry and Ms. Meghan Markle. Our work as a national marine conservation charity empowers tens of thousands of volunteers annually to protect beaches for everyone. We are currently focused on tackling plastic pollution and this support will help us move towards our vision of Plastic Free Coastlines.”\n\nThe Wilderness Foundation UK promotes the benefits and enjoyment of wild nature. Through the great outdoors, the charity helps build resilience in vulnerable teenagers, introduces rural employment to urban youth, and brings science to life.\n\nJo Roberts, CEO of The Wilderness Foundation UK, said: \"We are deeply touched and honoured that Prince Harry and Ms Markle have chosen to support The Wilderness Foundation and its beneficiaries. As the world’s population grows exponentially the planet’s remaining wild places and resources are coming under increasing threat. It has never been more important for us as humans to protect the planet that gives us life. Whilst teaching conservation values, we in turn use the positive power of nature to support and recharge the lives of challenged and vulnerable young people and adults.\"", "images": ["https://www.royal.uk/sites/default/files/styles/grid_3x2/public/images/news/4_0.jpg?itok=24kbz7R8", "https://www.royal.uk/sites/default/files/styles/920xh/public/media/wilderness_foundation_-_ph_visit.jpg?itok=cBFyA23c", "https://www.royal.uk/sites/default/files/styles/grid_3x2/public/images/news/ph_banner.jpg?itok=noYobc-R", "https://www.royal.uk/sites/default/files/styles/460x460/public/images/feature-chapters/pa-41395620.jpg?itok=7IzSZfun", "https://www.royal.uk/sites/default/files/styles/grid_3x2/public/images/news/pa-44300621_1.jpg?itok=xYOBpJ-K", "https://www.royal.uk/sites/default/files/styles/grid_3x2/public/images/news/the_queen_2.jpg?itok=PCspcbWJ", "https://www.royal.uk/sites/default/files/styles/grid_3x2/public/images/news/christmas-card-feature-the-royal-family.jpg?itok=XG9HitV1", "https://www.royal.uk/themes/custom/kpp/dist/images/crest-blue.svg", "https://www.royal.uk/sites/default/files/styles/920xh/public/media/street_games_-_couple.jpg?itok=DPRWB-lQ", "https://www.royal.uk/sites/default/files/styles/920xh/public/media/chiva.jpg?itok=mF_1MlhD", "https://www.royal.uk/sites/default/files/styles/920xh/public/media/crisis1.jpeg?itok=K2PMFMzV", "https://www.royal.uk/sites/default/files/styles/460x460/public/images/feature/dsc_0269_cropped_website.jpg?itok=qW70A9E7", "https://www.royal.uk/themes/custom/kpp/dist/images/social-royal-family-2023.jpg", "https://www.royal.uk/sites/default/files/styles/grid_3x2/public/images/news/pa-26551070_1.jpg?itok=9UrOrSqM", "https://www.royal.uk/sites/default/files/styles/920xh/public/media/scottys_little_soldiers_-_brookescott1.jpeg?itok=4O36wifF", "https://www.royal.uk/sites/default/files/styles/grid_3x2/public/images/news/imageedit_2_2096524544.jpg?itok=9MyDXsjc", "https://www.royal.uk/sites/default/files/styles/460x460/public/images/feature/remembrance_news_story_splash.jpg?itok=7oV8OmNL", "https://www.royal.uk/sites/default/files/styles/grid_3x2/public/images/news/photo_14-01-2019_16_22_58.jpg?itok=Obf2rPHC", "https://www.royal.uk/sites/default/files/styles/grid_3x2/public/images/news/we_day.jpg?itok=LuHLfulk", "https://www.royal.uk/sites/default/files/styles/grid_3x2/public/images/news/pa-40188021.jpg?itok=XCCQM7dH", "https://www.royal.uk/sites/default/files/styles/social_media_share/public/images/feature/pa_-_smiling_-_cardiff.jpeg?itok=Qbuqn-xq", "https://www.royal.uk/sites/default/files/styles/grid_3x2/public/images/news/cwlth_day.jpg?itok=wPpPsMRZ", "https://www.royal.uk/sites/default/files/styles/460x460/public/images/feature-chapters/website5.jpg?itok=_GYgWagw", "https://www.royal.uk/sites/default/files/styles/920xh/public/media/myna_mahila_-_mm.jpg?itok=ERU-DMkI", "https://www.royal.uk/sites/default/files/styles/460x460/public/images/feature/pa_-_smiling_-_cardiff.jpeg?itok=YbAu6sLR", "https://www.royal.uk/themes/custom/kpp/dist/images/social-prince-and-princess-of-wales.jpeg", "https://www.royal.uk/sites/default/files/styles/grid_2x2/public/images/speech/pa_onside.jpg?itok=MfPi7DFg", "https://www.royal.uk/sites/default/files/styles/920xh/public/media/surfers_against_sewage1.jpeg?itok=_QU0-UX6", "https://www.royal.uk/sites/default/files/styles/grid_3x2/public/images/news/hero_travalyst.jpg?itok=3hqL4NjR", "https://www.royal.uk/sites/default/files/styles/grid_3x2/public/images/news/the_duke_and_duchess_of_sussex_visit_bristol_2019.jpg?itok=K3lAPrma", "https://www.royal.uk/sites/default/files/styles/grid_3x2/public/images/news/news_banner_jenny.jpg?itok=RbqNoF-e", "https://www.royal.uk/sites/default/files/styles/grid_3x2/public/images/news/ph-roundtable.jpg?itok=ow6C1z8E", "https://www.royal.uk/sites/default/files/styles/grid_3x2/public/images/2024-03/PA-39199345.jpg?h=11173e4d&itok=xOQlX1Gp"], "top_img": "https://www.royal.uk/sites/default/files/styles/social_media_share/public/images/feature/pa_-_smiling_-_cardiff.jpeg?itok=Qbuqn-xq", "keywords": [], "authors": [], "canonical_link": "https://www.royal.uk/wedding-charity-donations", "title": "Royal Wedding Charitable Donations", "meta_data": {"description": "Prince Harry and Ms. Meghan Markle are incredibly grateful for the goodwill shown to them since the announcement of their engagement and are keen that as many...", "og": {"site_name": "The Royal Family", "url": "https://www.royal.uk/wedding-charity-donations", "title": "Royal Wedding Charitable Donations", "description": "Prince Harry and Ms. Meghan Markle are incredibly grateful for the goodwill shown to them since the announcement of their engagement and are keen that as many...", "image": "https://www.royal.uk/sites/default/files/styles/social_media_share/public/images/feature/pa_-_smiling_-_cardiff.jpeg?itok=Qbuqn-xq"}, "dcterms.title": "Royal Wedding Charitable Donations", "dcterms.description": "Prince Harry and Ms. Meghan Markle are incredibly grateful for the goodwill shown to them since the announcement of their engagement and are keen that as many...", "twitter": {"card": "summary_large_image", "site": {"identifier": "@RoyalFamily", "id": 36042554}, "title": "Royal Wedding Charitable Donations", "description": "Prince Harry and Ms. Meghan Markle are incredibly grateful for the goodwill shown to them since the announcement of their engagement and are keen that as many...", "image": "https://www.royal.uk/sites/default/files/styles/social_media_share/public/images/feature/pa_-_smiling_-_cardiff.jpeg?itok=Qbuqn-xq"}, "Generator": "Drupal 10 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.royal.uk", "summary": ""}