{"url": "https://www.mirror.co.uk/3am/style/celebrity-fashion/kate-middleton-sweden-norway-outfits-11935107", "text": "Kate Middleton's royal tour 2018 in outfits: What the Duchess of Cambridge wore in Sweden and Norway\n\nSee the Duchess of Cambridge's dresses, coats, casual wear, jewellery and accessories from some of her favourite British designers such as Burberry and Catherine Walker and some new Scandi fashions\n\nThe Duke and Duchess of Cambridge are on a four day tour of Sweden and Norway, where they'll be visiting landmarks, mingling with locals and spending time with the respective royal families of each country.\n\n‌\n\n\n\nKate, who is around six months pregnant with her third child, has been wowing us with maternity outfits old and new over the past few months.\n\n‌\n\n\n\nAs usual, Kate likes to display sartorial diplomacy, whether that be through her choice in colours or designers, so expect her to add some Scandinavian wears to her wardrobe.\n\n‌\n\n\n\nAnd of course, she'll fly the flag for British fashion and her stylist Natasha Archer is likely to have packed pieces from favourites such as Catherine Walker, Erdem and Alexander McQueen.\n\nTake a look at all of her outfits from the royal tour 2018.\n\n‌\n\n\n\nOutfit 9: KJUS orange and white ski jacket to tour Holmenkollen Ski Jump in Oslo\n\nView 48 Images The royal couples arrive (Image: PA)\n\nKate Middleton and Prince William look cute in snow jackets and bobble hats for ski slopes in Norway READ MORE :\n\nFor their final engagement of the tour, the Duke and Duchess toured Holmenkollen Ski Jump to watch juniors from Norway's national team and to see a group of local nursery children take part in a lesson.\n\nView 48 Images The couple gave a nod to Norway's national colours (Image: PA)\n\n‌\n\n\n\nKate and William looked very cosy in ski jackets and bobble hats. The Duchess wore a white and orange stripe 'Duana' jacket, £650, by Norwegian brand KJUS, while William complemented her in blue - a subtle nod to the host's national colours.\n\nView 48 Images Kate wrapped up in the snowy conditions (Image: Rex)\n\nKate teamed her outerwear with black jeans, gloves and her waterproof 'Torino' snow boots (£120) from Sorel. She topped off her look with a white hand-knitted beanie, £26, by Barts - a Scandi-based brand.\n\n‌\n\n\n\nView 48 Images Cosy (Image: WireImage)\n\nPrince William also sported another beanie hat by charity brand Gandys.\n\nOutfit 8: Dolce & Gabbana coat and TiMo dress to visit Hartvig Nissen School in Oslo\n\nView 48 Images Kate wore a Dolce and Gabbana coat (Image: Getty)\n\n‌\n\n\n\nPregnant Kate Middleton looks chic in Dolce & Gabbana coat for last day of royal tour READ MORE :\n\nFor the fourth and final day of the tour, Kate and William visited Hartvig Nissen School in Oslo, which was the location for the hugely successful Norwegian TV programme 'Skam.'\n\nView 48 Images Kate chatted to the crowds (Image: Daily Mirror)\n\nThe Duchess looked cosy and chic in a burgundy double-breasted coat by Dolce & Gabbana. It's a new addition to her arsenal of outerwear but perfect for the Nordic conditions.\n\n‌\n\n\n\nView 48 Images A tour staple (Image: Rex)\n\nHer Tod's suede block heels have clearly become a staple for the Duchess and we dare say, are more more comfortable than stiletto heels when you're pregnant.\n\nView 48 Images Kate has had her Mulberry clutch for years (Image: Rex)\n\n‌\n\n\n\nShe teamed it with matching black accessories, her trusty Mulberry Bayswater clutch, which she has owned for years.\n\nView 48 Images Kate wore her Mappin & Webb earrings (Image: Rex)\n\nKate kept her jewellery simple by choosing her Mappin & Webb 'Empress' earrings.\n\n‌\n\n\n\nView 48 Images The Duchess wore a dress by Ti Mo underneath (Image: Getty)\n\nWe also got a glimpse of her dress underneath her coat, believed to be by Oslo brand TiMo, which is also a favourite of Crown Princess Mette-Marit.\n\nOutfit 7: Alexander McQueen dress for dinner at Royal Palace in Oslo\n\nView 48 Images The Duchess of Cambridge is escorted into dinner by King Harald V of Norway (Image: Getty Images Europe)\n\n‌\n\n\n\nFor an evening dinner at the Royal Palace in Oslo, Kate wore a blush pink floor-length gown by Alexander McQueen.\n\nView 48 Images Kate is escorted into dinner by King Harald V (Image: REUTERS)\n\nThe flowing dress featured crystal embellishment detailing, a sleeveless bodice and a cape overlay. The empire line flattered Kate's baby bump and made her look very regal.\n\n‌\n\n\n\nView 48 Images Kate wore the Queen's earrings (Image: REUTERS)\n\nThe Duchess borrowed jewels from the royal jewellery box - the Queen's diamond drop pendant earrings.\n\nView 48 Images Kate's bag and bracelet (Image: REUTERS)\n\n‌\n\n\n\nShe also wore the Queen's wedding gift bracelet and completed her look with her blush Jimmy Choo 'Celeste' clutch, which has pave rhinstones on the frame.\n\nOutfit 6: Catherine Walker blue coat and Seraphine navy dress to arrive in Norway\n\nView 48 Images Kate and William are met by Crown Prince Haakon and Crown Princess Mette-Marit of Norway (Image: Daily Mirror)\n\nWilliam and Kate given warm welcome by Norway's royals as private jet lands in winter wonderland in Oslo READ MORE :\n\nWilliam and Kate arrived to snow in Norway, as they were greeted by Crown Prince Haakon and Crown Princess Mette-Marit. They were forced to abandon their final stop in Sweden, due to the weather.\n\n‌\n\n\n\nView 48 Images (Image: Getty)\n\nKate stepped off the plane in a blue funnel neck coat by Catherine Walker (for the third time on this tour).\n\nView 48 Images Kate wore her block heel Tod's again (Image: Rex)\n\n‌\n\n\n\nShe very bravely opted for nude hosiery and her Tod's suede block heels - not exactly snow-friendly, but she did step straight into a car after arriving. She teamed it with a matching clutch - her Mulberry Bayswater bag.\n\nView 48 Images Kate's sapphire and diamond drop earrings (Image: Rex)\n\nHer hair was styled into an elegant chignon, like previously for her evening engagement in Stockholm and she was once again wearing her sapphire diamond drop earrings to match the blue ensemble.\n\n‌\n\n\n\nView 48 Images (L-R) Crown Princess Mette Marit and Crown Prince Haakon, Kate and William, King Harald and Queen Sonja (Image: Getty)\n\nThe couple met the rest of the Norwegian royal family at the Royal Palace. Kate removed her coat to reveal her her £169 Seraphine 'Marlene' dress. The navy-blush frock features a lace bodice, high neck and subtle bell sleeves - a style Kate seems to be fond of on this trip.\n\nView 48 Images Kate added chocolate brown accessories to her look to explore the gardens (Image: Getty)\n\n‌\n\n\n\nOutfit 5: Erdem blue velvet dress for evening reception at at the Fotografiska Gallery in Stockholm\n\nView 48 Images Kate's dress is very on trend for AW17 (Image: PA)\n\nKate attended her second evening reception in Sweden and again opted for a dress by favourite Erdem.\n\nView 48 Images Erdem's Christina dress on the AW17 catwalk (Image: Getty)\n\n‌\n\n\n\nThe blue velvet Christina dress features a floral print, a high neckline and bell sleeves. Unsurprisingly the midi-frock, which originally cost £2,690, has already sold out.\n\nView 48 Images Kate Middleton's Gianvito Rossi shoes (Image: Getty)\n\nThe Duchess teamed it with her Gianvito Rossi d'Orsay ankle-strap heels, first seen in Paris last year.\n\n‌\n\n\n\nView 48 Images The Duchess greets Crown Princess Victoria (Image: PA)\n\nShe wore her hair in an elegant updo, which showed off a new pair of earrings - Robinson Pelham's 18ct white gold Aspen hoops from their Oxygen collection, which cost £4,900.\n\nView 48 Images The Duchess arrives at the gallery (Image: Splash)\n\n‌\n\n\n\nPregnant Kate Middleton viciously trolled for unusual and expensive outfit choice - but others love bold choice READ MORE :\n\nKate arrived at the event wearing a new coat by Ida Sjöstedt - one of the Swedish royals' favourite native designers. She teamed it with her Troy London faux fur collar and cuffs.\n\nOutfit 4: Catherine Walker red and white houndstooth coat and Alexander McQueen boucle dress to visit the Karolinska Institute, Matteusskolan School and the NK exhibition\n\nView 48 Images Kate wore a bold Catherine Walker coat (Image: WireImage)\n\nKate Middleton wears Catherine Walker red and white houndstooth coat to talk mental health in Stockholm READ MORE :\n\nOn day two, Kate stepped out in a red and white houndstooth coat by Catherine Walker, with double-breasted button detailing, which flattered her baby bump.\n\n‌\n\n\n\nView 48 Images The couple were joined again by Crown Princess Victoria of Sweden and Prince Daniel of Sweden (Image: WireImage)\n\nIt was another busy day for her and William as they visited the Karolinska Institute and Matteusskolan School to hear about Sweden's approach to managing mental health challenges.\n\nView 48 Images Chatting to school pupils (Image: Getty Images Europe)\n\n‌\n\n\n\nThey then opened an interactive exhibition of UK design, fashion and brands within one of Sweden's leading department stores NK, followed by high tea with Crown Princess Victoria and Prince Daniel.\n\nView 48 Images Kate teamed her coat with burgundy accessories (Image: Getty )\n\nAfter wearing Princess Diana's earrings to the black-tie dinner, Kate paid another subtle tribute to her late mother-in-law by donning a similar outfit to a striking two-piece Diana wore in 1990.\n\n‌\n\n\n\nView 48 Images Kate's fringed Tod's pumps (Image: WireImage)\n\nKate appears to have ditched her favourite LK Bennett nude courts of late, opting for another chunky heeled pair of Tod's. The £135 burgundy fringed pumps made their debut on the royal tour of Canada in 2016.\n\nView 48 Images Kate's Chanel handbag (Image: Getty)\n\n‌\n\n\n\nThe Duchess also toted her burgundy Chanel quilted calfskin bag with enamel handle, which is believed to have originally retailed for around £3,762. Kate has a penchant for clutch bags, but appears to be taking a leaf out of her future sister-in-law Meghan Markle's book and carrying more practical accessories.\n\nView 48 Images (Image: Splash)\n\nPearl accessories completed her look, but it's a new pair for the Duchess. The £106 Baroque pearl drop earrings are by Swedish jewellery company in2Design.\n\n‌\n\n\n\nView 48 Images Kate in McQueen (Image: PA)\n\nLater Kate removed her coat to reveal she was wearing a bespoke Alexander McQueen boucle-tweed dress underneath, with an empire line, which was perfect for her growing baby bump.\n\nOutfit 3: Erdem floral dress for black tie dinner at the Residence of the British Ambassador in Stockholm\n\nView 48 Images Kate and William joined Crown Princess Victoria and Prince Daniel (Image: REUTERS)\n\n‌\n\n\n\nOn Tuesday night (day one) Kate and William joined the Swedish royal family for a black tie dinner at the Residence of the British Ambassador in Stockholm.\n\nView 48 Images Erdem's Stephanie dress\n\nKate wowed in a bold floral Erdem dress in mustard gold - a subtle tribute to one of Sweden's national colours - which appears to be a modified version of the brand's silk-crepe de Chine 'Stephanie' gown, from the AW17 collection, and costs £1,945.\n\n‌\n\n\n\nView 48 Images Kate carried a burgundy clutch and Diana's pearl bracelet (Image: Getty)\n\nShe teamed it with a new burgundy-red suede clutch.\n\nView 48 Images Kate's hair was styled into a low chignon (Image: Getty)\n\n‌\n\n\n\nHer chic updo showed that she was wearing Princess Diana's Collingwood pearl and diamond earrings and matching bracelet.\n\nOutfit 2: Catherine Walker dress and matching coat to attend lunch and walkabout with Sweden's royal family\n\nView 48 Images A warm welcome (Image: PA)\n\nKate Middleton swaps bobble hat for green Catherine Walker dress for lunch with King and Queen of Sweden READ MORE :\n\nThere was time for a quick change after the bandy hockey game, for a lunch with Sweden's royal family - King Carl XVI Gustaf, Queen Silvia, Prince Daniel and Victoria, Crown Princess of Sweden.\n\n‌\n\n\n\nView 48 Images Kate chose a dress by favourite Catherine Walker (Image: DAILY MIRROR)\n\nKate wore a bespoke design by tour favourite Catherine Walker, which looked to be a modification of their funnel-neck 'Bea' coatdress. The Duchess teamed it with semi-sheer tights and her trusty Tod's suede block heel pumps.\n\nView 48 Images The Duchess wore faux fur cuffs and collar (Image: PA)\n\n‌\n\n\n\nThe Swedish royals accompanied the Duke and Duchess on a walk around Stockholm, where Kate decided to swap her heels for her Russell & Bromley/Stuart Weitzman HALFNHALF knee-high boots.\n\nView 48 Images Pregnant Kate glowed, despite the chill (Image: PA)\n\nShe also covered up in a matching forest green coat, also by Catherine Walker, which was midi-length and featured oversized buttons.\n\n‌\n\n\n\nView 48 Images Wandering through Stockholm (Image: PA)\n\nShe donned another piece of headwear - the black furry hat we saw her wearing for the church service at Sandringham on Christmas Day. She added an extra layer of warmth with a faux fur collar, £65, and matching cuffs, £40, by Troy London.\n\nView 48 Images Kate's Mulberry handbag (Image: Getty)\n\n‌\n\n\n\nWe also saw the Duchess toting a new handbag - Mulberry 's £895 Mini Seaton style, which has a signature Rider's Lock.\n\nView 48 Images Kate wore her Kiki McDonough earrings (Image: PA)\n\nAnd finally, Kate completed her look with her her Kiki McDonough 'special edition' drop earrings with green amethyst, green tourmaline and diamond gems, which are believed to have been made for Kate after Princess Charlotte's birth. She first debuted them on the royal tour of India and Bhutan in 2016.\n\n‌\n\n\n\nOutfit 1: Burberry coat to watch bandy hockey game at Vasparken public park in Stockholm, Sweden\n\nKate and William braved Nordic temperatures for their first engagement of the royal tour and watched a bandy hockey game at Vasparken public park, in Stockholm.\n\nView 48 Images It's a chilly start to the day (Image: PA)\n\n‌\n\n\n\nKate wrapped up in Burberry's £2,495 'Tolladine' double-breasted coat with plush shearling and black jeans, likely to be one of her trusty Zara skinnies. She championed both British and Swedish fashions on day one, wearing a £139 Ovik Folk Knit Sweater by Fjallraven.\n\nView 48 Images Fjallraven Sweater\n\nIn order not to slip on the ice, Kate opted to wear waterproof 'Torino' snow boots (£120) by Canadian label Sorel and suede faux fur trim thermal gloves, £21, from John Lewis.\n\n‌\n\n\n\nView 48 Images Kate's rubber-soled snow boots (Image: WireImage)\n\nThe Duchess looked adorable in a £103 Eugenia Kim pom pom hat, with her hair cascading around her shoulders in loose waves.\n\nView 48 Images Cosy Kate (Image: PA)\n\nArticle continues below\n\nThere was some controversy around this choice, as social media users believed she was wearing a version of the beanie, which contains fox fur. However Kensington Palace stressed that Kate was wearing the faux fur style.\n\nShe finished off her look with a £89 cashmere fine cable snood in bordeaux from Brora, which matched Prince William's hat, and her Asprey button earrings.", "images": ["https://i2-prod.mirror.co.uk/article11940060.ece/ALTERNATES/s615b/Royal-visit-to-Scandinavia-Day-One.jpg", "https://i2-prod.mirror.co.uk/article11941254.ece/ALTERNATES/s615b/Fjallraven-Sweater.jpg", "https://www.mirror.co.uk/nav-web-static/release-v41-14493b7c888038a7d89b99cb3a7937c2b71eaebe/public/logo-reach.png", "https://i2-prod.mirror.co.uk/article11938604.ece/ALTERNATES/s615b/Royal-visit-to-Scandinavia-Day-One.jpg", "https://i2-prod.mirror.co.uk/article11953030.ece/ALTERNATES/s615b/The-Duke-And-Duchess-Of-Cambridge-Visit-Sweden-And-Norway-Day-3.jpg", "https://i2-prod.mirror.co.uk/article11941593.ece/ALTERNATES/s615b/Prince-William-R-Duke-of-Cambridge-an.jpg", "https://i2-prod.mirror.co.uk/article11956642.ece/ALTERNATES/s615b/The-Duke-And-Duchess-Of-Cambridge-Visit-Sweden-And-Norway-Day-4.jpg", "https://i2-prod.mirror.co.uk/article11861574.ece/ALTERNATES/s810/THP_CHP_160118SLUG_1535JPG.jpg", "https://i2-prod.mirror.co.uk/article11946118.ece/ALTERNATES/s615b/The-Duke-And-Duchess-Of-Cambridge-Visit-Sweden-And-Norway-Day-2.jpg", "https://i2-prod.mirror.co.uk/article11958451.ece/ALTERNATES/s615b/Royal-visit-to-Scandinavia-Day-Four.jpg", "https://i2-prod.mirror.co.uk/article11944619.ece/ALTERNATES/s615b/The-Duke-And-Duchess-Of-Cambridge-Visit-Sweden-And-Norway-Day-2.jpg", "https://i2-prod.mirror.co.uk/article11951596.ece/ALTERNATES/s615b/The-Duke-and-Duchess-of-Cambridge-Visit-Sweden-Day-2.jpg", "https://i2-prod.mirror.co.uk/article11948113.ece/ALTERNATES/s615b/Royal-visit-to-Scandinavia-Day-Two.jpg", "https://i2-prod.mirror.co.uk/article11938086.ece/ALTERNATES/s615b/Royal-visit-to-Scandinavia-Day-One.jpg", "https://i2-prod.mirror.co.uk/article11948193.ece/ALTERNATES/s615b/Royal-visit-to-Scandinavia-Day-Two.jpg", "https://i2-prod.mirror.co.uk/article11941021.ece/ALTERNATES/s615b/Erdem-Stephanie-Dress.jpg", "https://i2-prod.mirror.co.uk/article11946442.ece/ALTERNATES/s615b/The-Duke-And-Duchess-Of-Cambridge-Visit-Sweden-And-Norway-Day-2.jpg", "https://i2-prod.mirror.co.uk/article11959449.ece/ALTERNATES/s615b/Prince-William-and-Catherine-Duchess-of-Cambridge-visit-to-Norway-02-Feb-2018.jpg", "https://i2-prod.mirror.co.uk/article11941584.ece/ALTERNATES/s615b/Prince-William-2nd-L-Duke-of-Cambridg.jpg", "https://www.mirror.co.uk/footer/trust-project.svg", "https://i2-prod.mirror.co.uk/article11959416.ece/ALTERNATES/s615b/Britains-Prince-William-and-Catherine-Duchess-of-Cambridge-pose-for-a-formal-photo-with-members-o.jpg", "https://i2-prod.mirror.co.uk/article11959490.ece/ALTERNATES/s615b/Prince-William-and-Catherine-Duchess-of-Cambridge-visit-to-Norway-02-Feb-2018.jpg", "https://i2-prod.mirror.co.uk/article11956610.ece/ALTERNATES/s615b/Duchess-of-Cambridge.jpg", "https://i2-prod.mirror.co.uk/article11945828.ece/ALTERNATES/s615b/The-Duke-And-Duchess-Of-Cambridge-Visit-Sweden-And-Norway-Day-2.jpg", "https://i2-prod.mirror.co.uk/article11951593.ece/ALTERNATES/s615b/The-Duke-And-Duchess-Of-Cambridge-Visit-Sweden-And-Norway-Day-2.jpg", "https://i2-prod.mirror.co.uk/article11945830.ece/ALTERNATES/s615b/The-Duke-And-Duchess-Of-Cambridge-Visit-Sweden-And-Norway-Day-2.jpg", "https://i2-prod.mirror.co.uk/article11959609.ece/ALTERNATES/s810/Kate-Middleton-Fashion-Tour-MAIN.jpg", "https://i2-prod.mirror.co.uk/article11958595.ece/ALTERNATES/s1200/Prince-William-and-Catherine-Duchess-of-Cambridge-visit-to-Norway-02-Feb-2018.jpg", "https://i2-prod.mirror.co.uk/article11958214.ece/ALTERNATES/s615b/Britains-Catherine-Duchess-of-Cambridge-is-escorted-into-dinner-by-King-Harald-V-of-Norway-at-the.jpg", "https://i2-prod.mirror.co.uk/article11952306.ece/ALTERNATES/s615b/Duchess-of-Cambridge.jpg", "https://i2-prod.mirror.co.uk/article11956917.ece/ALTERNATES/s615b/The-Duke-And-Duchess-Of-Cambridge-Visit-Sweden-And-Norway-Day-3.jpg", "https://i2-prod.mirror.co.uk/article11948108.ece/ALTERNATES/s615b/Erdem-AW17.jpg", "https://i2-prod.mirror.co.uk/article11953561.ece/ALTERNATES/s615b/Prince-William-and-Catherine-Duchess-of-Cambridge-visit-to-Norway-01-Feb-2018.jpg", "https://i2-prod.mirror.co.uk/article11938671.ece/ALTERNATES/s615b/Royal-visit-to-Scandinavia-Day-One.jpg", "https://i2-prod.mirror.co.uk/article11958507.ece/ALTERNATES/s615b/The-Duke-And-Duchess-Of-Cambridge-Visit-Sweden-And-Norway-Day-4.jpg", "https://i2-prod.mirror.co.uk/article11958433.ece/ALTERNATES/s615b/Royal-visit-to-Scandinavia-Day-Four.jpg", "https://i2-prod.mirror.co.uk/article11946356.ece/ALTERNATES/s615b/Royal-visit-to-Scandinavia-Day-Two.jpg", "https://i2-prod.mirror.co.uk/article11941187.ece/ALTERNATES/s615b/The-Duke-And-Duchess-Of-Cambridge-Visit-Sweden-And-Norway-Day-1.jpg", "https://i2-prod.mirror.co.uk/article11958595.ece/ALTERNATES/s615b/Prince-William-and-Catherine-Duchess-of-Cambridge-visit-to-Norway-02-Feb-2018.jpg", "https://i2-prod.mirror.co.uk/article13219959.ece/ALTERNATES/s810/2_Members-Of-The-Royal-Family-Attend-Events-To-Mark-The-Centenary-Of-The-RAF.jpg", "https://i2-prod.mirror.co.uk/article11939938.ece/ALTERNATES/s615b/IVM_MD30012018_Vogler63JPG.jpg", "https://i2-prod.mirror.co.uk/article11937373.ece/ALTERNATES/s615b/Royal-visit-to-Scandinavia-Day-One.jpg", "https://i2-prod.mirror.co.uk/article11953554.ece/ALTERNATES/s615b/Prince-William-and-Catherine-Duchess-of-Cambridge-visit-to-Norway-01-Feb-2018.jpg", "https://i2-prod.mirror.co.uk/article11959485.ece/ALTERNATES/s615b/Prince-William-and-Catherine-Duchess-of-Cambridge-visit-to-Norway-02-Feb-2018.jpg", "https://i2-prod.mirror.co.uk/article11953048.ece/ALTERNATES/s615b/L-R-Norways-Crown-Princess-Mette-Mari.jpg", "https://i2-prod.mirror.co.uk/article11953531.ece/ALTERNATES/s615b/The-Duke-And-Duchess-Of-Cambridge-Visit-Sweden-And-Norway-Day-3.jpg", "https://i2-prod.mirror.co.uk/article11939243.ece/ALTERNATES/s615b/Royal-visit-to-Scandinavia-Day-One.jpg", "https://www.mirror.co.uk/footer/ipso.svg", "https://i2-prod.mirror.co.uk/article11939817.ece/ALTERNATES/s615b/The-Duke-And-Duchess-Of-Cambridge-Visit-Sweden-And-Norway-Day-1.jpg", "https://i2-prod.mirror.co.uk/article11940542.ece/ALTERNATES/s810/Roayltourmain.jpg", "https://i2-prod.mirror.co.uk/article11944608.ece/ALTERNATES/s615b/The-Duke-And-Duchess-Of-Cambridge-Visit-Sweden.jpg", "https://i2-prod.mirror.co.uk/article11946434.ece/ALTERNATES/s615b/1_The-Duke-and-Duchess-of-Cambridge-Visit-Sweden-Day-2.jpg", "https://i2-prod.mirror.co.uk/article11941280.ece/ALTERNATES/s615b/Britains-Prince-William-Catherine-Duchess-of-Cambridge-Crown-Princess-Victoria-and-Prince-Daniel.jpg", "https://i2-prod.mirror.co.uk/article11940329.ece/ALTERNATES/s615b/Royal-visit-to-Scandinavia-Day-One.jpg", "https://i2-prod.mirror.co.uk/article11958064.ece/ALTERNATES/s615b/The-Duke-And-Duchess-Of-Cambridge-Visit-Sweden-And-Norway-Day-4.jpg", "https://www.mirror.co.uk/assets/mirror/logos/masthead-mirror-default.svg", "https://i2-prod.mirror.co.uk/article11958216.ece/ALTERNATES/s615b/Britains-Catherine-Duchess-of-Cambridge-poses-for-a-formal-photo-with-members-of-the-Norwegian-ro.jpg"], "top_img": "https://i2-prod.mirror.co.uk/article11958595.ece/ALTERNATES/s1200/Prince-William-and-Catherine-Duchess-of-Cambridge-visit-to-Norway-02-Feb-2018.jpg", "keywords": [], "authors": ["Danielle Stacey", "Updated"], "canonical_link": "https://www.mirror.co.uk/3am/style/celebrity-fashion/kate-middleton-sweden-norway-outfits-11935107", "title": "Kate Middleton's royal tour 2018 in outfits: What the Duchess of Cambridge wore in Sweden and Norway", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"page_id": 6149699161, "app_id": 123792601022133, "pages": 1814357575554395}, "description": "See the Duchess of Cambridge's dresses, coats, casual wear, jewellery and accessories from some of her favourite British designers such as Burberry and Catherine Walker and some new Scandi fashions", "author": "Danielle Stacey", "robots": "noarchive, max-image-preview:large", "Googlebot-News": "noarchive", "referrer": "unsafe-URL", "keywords": "Kate Middleton, Royal Family, Royal tours, William and Kate, William and Kate in Norway, William and Kate in Sweden, William and Kate tour 2018, Maternity clothing", "news_keywords": "Kate Middleton, Royal Family, Royal tours, William and Kate, William and Kate in Norway, William and Kate in Sweden, William and Kate tour 2018, Maternity clothing", "allowTaboolaDeepDive": "true", "vf": {"00000000-0000-4000-8000-67e599051dc3": "mirror-prod-11935107"}, "og": {"title": "All of Kate Middleton's outfits from her royal tour of Sweden and Norway", "description": "See the Duchess of Cambridge's dresses, coats, casual wear, jewellery and accessories from some of her favourite British designers such as Burberry and Catherine Walker and some new Scandi fashions", "url": "https://www.mirror.co.uk/3am/style/celebrity-fashion/kate-middleton-outfits-tour-2018-11935107", "site_name": "Daily Mirror", "locale": "en_GB", "image": "https://i2-prod.mirror.co.uk/article11958595.ece/ALTERNATES/s1200/Prince-William-and-Catherine-Duchess-of-Cambridge-visit-to-Norway-02-Feb-2018.jpg", "type": "article"}, "article": {"published_time": "2018-01-30T19:03:42Z", "modified_time": "2018-02-02T16:22:06Z", "author": "https://www.mirror.co.uk/authors/danielle-stacey/", "section": "Celebrity Fashion", "tag": "Maternity clothing"}, "twitter": {"card": "summary_large_image", "site": "@DailyMirror", "creator": "@daniellestacey1", "title": "Kate Middleton's royal tour 2018 in outfits: What the Duchess of Cambridge wore in Sweden and Norway - The Mirror", "description": "See the Duchess of Cambridge's dresses, coats, casual wear, jewellery and accessories from some of her favourite British designers such as Burberry and Catherine Walker and some new Scandi fashions", "image": "https://i2-prod.mirror.co.uk/article11958595.ece/ALTERNATES/s1200/Prince-William-and-Catherine-Duchess-of-Cambridge-visit-to-Norway-02-Feb-2018.jpg"}}, "movies": [], "publish_date": 1517339022.0, "source": "https://www.mirror.co.uk", "summary": ""}