{"url": "en.wikipedia.org/wiki/Emma_Stone", "text": "American actress (born 1988)\n\nEmily Jean Stone (born November 6, 1988), known professionally as Emma Stone, is an American actress and film producer.[1] Her accolades include two Academy Awards, two British Academy Film Awards, and two Golden Globe Awards. In 2017, she was the world's highest-paid actress and named by Time magazine as one of the 100 most influential people in the world.\n\nStone began acting as a child in a theater production of The Wind in the Willows in 2000. As a teenager, she relocated to Los Angeles and made her television debut in In Search of the New Partridge Family (2004), a reality show that produced only an unsold pilot. After small television roles, she appeared in a series of well-received comedy films, such as Superbad (2007), Zombieland (2009), and Easy A (2010), which was Stone's first leading role. Following this breakthrough, she starred in the romantic comedy Crazy, Stupid, Love (2011) and the period drama The Help (2011), and gained wider recognition as Gwen Stacy in the 2012 superhero film The Amazing Spider-Man and its 2014 sequel. She received her first Academy Award nomination for Best Supporting Actress for portraying a recovering drug addict in Alejandro González Iñárritu's comedy-drama Birdman (2014).\n\nIn 2016, Stone starred as an aspiring actress in Damien Chazelle's romantic musical La La Land, winning the Academy Award for Best Actress for her performance. She followed this by portraying tennis player Billie Jean King in Battle of the Sexes (2017) and later the titular role in Cruella (2021). She garnered significant recognition for her collaborations with filmmaker Yorgos Lanthimos, having starred in four of his films. She received her second nomination for the Academy Award for Best Supporting Actress for portraying Abigail Hill in the period dark comedy The Favourite (2018), won a second Academy Award for Best Actress for her performance in the absurdist comedy Poor Things (2023), as well as her first Best Picture nomination for producing the latter. She subsequently starred in Lanthimos's anthology Kinds of Kindness (2024) and dark comedy Bugonia (2025). On television, she has starred in the dark comedy miniseries Maniac (2018) and The Curse (2023).\n\nOn Broadway, Stone starred as Sally Bowles in a revival of the musical Cabaret (2014–2015). She and her husband, Dave McCary, founded the production company Fruit Tree in 2020.\n\nEarly life\n\nEmily Jean Stone was born on November 6, 1988, in Scottsdale, Arizona,[2][3] to Jeffrey Charles Stone, the founder and CEO of a general-contracting company, and Krista Jean Stone (née Yeager), a homemaker.[4][5] She lived on the grounds of the Camelback Inn resort from ages 12 to 15.[6][7] She has a younger brother, Spencer.[8] Her paternal grandfather, Conrad Ostberg Sten, was from a Swedish family that anglicized their surname to \"Stone\". She also has German, English, Scottish, and Irish ancestry.[9] She was raised Lutheran.[10]\n\nAs an infant, Stone had baby colic and cried frequently. She consequently developed nodules and calluses on her vocal cords while she was a child.[11] Stone has described herself as \"loud\" and \"bossy\" while growing up.[12] She was educated at Sequoya Elementary School and attended Cocopah Middle School for sixth grade. Stone did not like school, though once said that her controlling nature meant that \"I made sure I got all A's\". She suffered panic attacks and anxiety as a child,[14] and said they caused a decline in her social skills.[15] Stone underwent therapy but said it was her participation in local theater plays that helped cure the attacks, recalling:\n\nThe first time I had a panic attack I was sitting in my friend's house, and I thought the house was burning down. I called my mom and she brought me home, and for the next three years it just would not stop. I would go to the nurse at lunch most days and just wring my hands. I would ask my mom to tell me exactly how the day was going to be, then ask again 30 seconds later. I just needed to know that no one was going to die and nothing was going to change.[14]\n\nStone wanted to act since age four;[7] she wanted a career in sketch comedy initially, but shifted her focus to musical theater, and took vocal lessons for several years.[16] Her acting debut, at age 11, came in a stage production of The Wind in the Willows, playing Otter.[17] Stone was homeschooled for two years, during which time she appeared in 16 productions at Phoenix's Valley Youth Theatre—including The Princess and the Pea, Alice's Adventures in Wonderland, and Joseph and the Amazing Technicolor Dreamcoat[4]—and performed with the theater's improvisational comedy troupe.[18] Around this time, she traveled to Los Angeles and auditioned unsuccessfully for a role on Nickelodeon's All That. Her parents later sent her for private acting lessons with a local acting coach, who had worked at the William Morris Agency in the 1970s.[5]\n\nStone attended Xavier College Preparatory—an all-girl Catholic high school—as a freshman, but dropped out after one semester to become an actress.[4] She prepared a PowerPoint presentation for her parents titled \"Project Hollywood\" (featuring Madonna's 2003 song \"Hollywood\") to convince them to let her move to California to pursue an acting career.[16] In January 2004, she moved with her mother to an apartment in Los Angeles. She recalled, \"I went up for every single show on the Disney Channel and auditioned to play the daughter on every single sitcom\", adding, \"I ended up getting none.\"[7] Between auditions for roles, she enrolled in online high-school classes and worked part-time at a dog-treat bakery.[5][14]\n\nCareer\n\nCareer beginnings (2004–2009)\n\nWhen Stone registered for the Screen Actors Guild at age 16, the name \"Emily Stone\" was already taken, and she briefly went by \"Riley Stone\".[20] She made her television debut as Laurie Partridge on the VH1 talent competition reality show In Search of the New Partridge Family (2004). The resulting show, retitled The New Partridge Family (2004), remained an unsold pilot.[21] After guest-starring in the television shows Medium (2005) and Malcolm in the Middle (2006), she decided to change her stage name to \"Emma\"—chosen in honor of Emma Bunton of the Spice Girls—as she struggled to adapt to the name Riley.[a][20][24] She next appeared in Louis C.K.'s HBO series Lucky Louie (2006),[14] and unsuccessfully auditioned to star as Claire Bennet in the NBC science fiction drama Heroes (2007), later calling this her \"rock bottom\" experience.[5] In April 2007, she played Violet Trimble in the Fox action drama Drive, but the show was canceled after seven episodes.[4]\n\nStone made her feature film debut in Greg Mottola's comedy Superbad (2007), co-starring Michael Cera and Jonah Hill. The film tells the story of two high school students who go through a series of comic misadventures after they plan to buy alcohol for a party. To play Hill's romantic interest, she dyed her hair red.[25] Stone has described the experience of acting in her first film as \"amazing ... [but] very different than other experiences I've had since then\".[26] The film was a commercial success, and earned her the Young Hollywood Award for Exciting New Face.[27][28]\n\nStone in 2009\n\nThe next year, Stone starred in the comedy The Rocker (2008) as Amelia Stone, the \"straight face\" bass guitarist in a band; she learned to play the bass for the role.[29] The actress, who has called herself \"a big smiler and laugher\", said she found it difficult to play a character whose personality was so different from her own. The film and her performance received negative reviews from critics and was a commercial failure.[30][31] Her next release, the romantic comedy The House Bunny, performed better at the box office, becoming a moderate commercial success.[32] The film saw her play the president of a sorority, and perform a cover version of the Waitresses' 1982 song \"I Know What Boys Like\".[33] Reviews were generally negative,[34] but Stone was praised,[35] with TV Guide's Ken Fox writing that she \"is well on her way to becoming a star\".[36]\n\nStone appeared in three films released in 2009. The first of these was opposite Matthew McConaughey, Jennifer Garner and Michael Douglas in Mark Waters's Ghosts of Girlfriends Past. Loosely based on Charles Dickens's 1843 novella A Christmas Carol, the romantic comedy has her playing a ghost who haunts her former boyfriend. Critical reaction to the film was negative, but it was a modest commercial success.[37][38] Her most financially profitable venture that year was Ruben Fleischer's $102.3 million-grossing horror comedy film Zombieland,[39] in which she featured alongside Jesse Eisenberg, Woody Harrelson and Abigail Breslin. In the film, she appeared as a con artist and survivor of a zombie apocalypse, in a role which Chris Hewitt of Empire magazine thought was \"somewhat underwritten\".[40] In a more positive review, Tim Robey of The Daily Telegraph called \"the hugely promising Stone […] a tough cookie who projects the aura of being wiser than her years\".[41] Stone's third release in 2009 was Kieran and Michelle Mulroney's Paper Man, a comedy-drama which disappointed critics.[42]\n\nRise to prominence (2010–2013)\n\nStone voiced an Australian Shepherd in Marmaduke (2010), a comedy from director Tom Dey based on Brad Anderson's long-running comic strip of the same name.[43] Her breakthrough came the same year with a starring role in Easy A, a teen comedy directed by Will Gluck.[44][45] Partially based on Nathaniel Hawthorne's 1850 novel The Scarlet Letter, the film tells the story of Olive Penderghast (Stone), a high school student who becomes embroiled in a comic sex scandal after a false rumor circulates that she is sexually promiscuous. Stone read the script before the project was optioned for production, and pursued it with her manager while production details were being finalized. She found the script \"so different and unique from anything I'd read before\", calling it \"funny and sweet\".[46] When Stone discovered that the film had begun production, she met with Gluck, expressing her enthusiasm for the project. A few months later, the audition process started and she met again with Gluck, becoming one of the first actresses to audition.[47] The film received positive critical reviews, and Stone's performance was considered its prime asset.[48] Anna Smith of Time Out wrote, \"Stone gives a terrific performance, her knowing drawl implying intellect and indifference with underlying warmth.\"[49] The film was a commercial success, grossing $75 million against its $8 million budget.[50] Stone was nominated for a BAFTA Rising Star Award and a Golden Globe Award for Best Actress in a Musical or Comedy, and won the MTV Movie Award for Best Comedic Performance.[51]\n\nIn October 2010, Stone hosted an episode of NBC's sketch comedy Saturday Night Live; her appearances included a sketch playing off her resemblance to Lindsay Lohan.[52] Stone called it \"the greatest week of my life\".[7][53] She hosted again in 2011, appeared in an episode in 2014, and in its 40th anniversary special in 2015.[54] A brief appearance in the sex comedy Friends with Benefits (2011) reunited her with Gluck.[55] She followed this with a supporting role in Glenn Ficarra and John Requa's romantic comedy Crazy, Stupid, Love (2011) alongside Steve Carell, Ryan Gosling and Julianne Moore. The film featured her as a law school graduate, and the love interest of Gosling's character. Despite finding \"some inevitable collapses into convention\" in the film, Drew McWeeny of HitFix wrote that Stone \"ties the whole film together\".[56] At the 2012 Teen Choice Awards, she won the Choice Movie Actress – Comedy award for her performance in the film.[57] Crazy, Stupid, Love was a box office success, grossing $142.9 million worldwide against a production budget of $50 million.[58]\n\nDismayed at being typecast as \"the sarcastic interest of the guy\", Stone co-starred with Viola Davis in Tate Taylor's period drama The Help (2011), a film she found challenging.[59] The film is based on Kathryn Stockett's 2009 novel of the same name and is set in 1960s Jackson, Mississippi. She met with Taylor to express a desire to work on the film. The director said, \"[Stone] was completely awkward and dorky, with her raspy voice, and she sat down and we got a little intoxicated and had a blast, and I just thought, 'God! God! This is Skeeter.\"[60] She was cast as Eugenia \"Skeeter\" Phelan, an aspiring writer learning about the lives of the African-American maids. In preparation for the part, she learned to speak in a Southern accent and educated herself on the Civil Rights Movement through literature and film.[61] With a worldwide gross of $216 million against a $25 million budget, The Help became Stone's highest-grossing film to that point.[62] The film, and her performance, received positive reviews from critics. Writing for Empire, Anna Smith thought Stone was \"well-meaning and hugely likable\" despite finding flaws in the character.[63] The film was nominated for an Academy Award for Best Picture,[64] and won Best Ensemble Cast from the Women Film Critics Circle and the Broadcast Film Critics Association.[65][66]\n\nStone turned down a role in the action comedy 21 Jump Street after signing on to Marc Webb's 2012 film The Amazing Spider-Man, a reboot of Sam Raimi's Spider-Man series.[67][68] She portrayed Gwen Stacy, the love interest of the titular superhero (played by Andrew Garfield).[69] Stone returned to her natural blonde hair color for the role, having dyed it red previously.[70][71] She admitted to having never read the comics, and therefore felt responsible to educate herself about Spider-Man: \"My experience was with the Sam Raimi movies ... I always assumed that Mary Jane was his first love\",[72] adding that she was only familiar with Stacy's character as portrayed by Bryce Dallas Howard in Spider-Man 3.[73][74] The Amazing Spider-Man was a commercial success and was the seventh highest-grossing film of the year with global revenues of $757.9 million.[75] Entertainment Weekly's Lisa Schwarzbaum found Stone to be \"irresistible\",[76] and Ian Freer of Empire was particularly impressed with Stone's and Garfield's performances.[77] At the annual People's Choice Awards ceremony, she was nominated for three awards, including Favorite Movie Actress.[78] Later that year, Stone voiced a role in the crime-based video game Sleeping Dogs, which earned her a Spike Video Game Award.[79]\n\nStone began 2013 with a voice role in the DreamWorks Animation film The Croods, which was nominated for the Academy Award for Best Animated Feature.[80] This followed with an appearance in Movie 43, an anthology film which consists of 16 short stories—she played the title role in the segment entitled \"Veronica\".[81] She next starred alongside Ryan Gosling and Sean Penn in Ruben Fleischer's Gangster Squad (2013), a crime thriller set in Los Angeles during the 1940s.[82] A. O. Scott of The New York Times dismissed the film as \"a hectic jumble of fedoras and zoot suits\", but praised Stone's pairing with Gosling.[83]\n\nEstablished actress (2014–2017)\n\nIn 2014, Stone reprised the role of Gwen Stacy in The Amazing Spider-Man 2. She believed that her character did not depend on the film's protagonist, asserting: \"She saves him more than he saves her. She's incredibly helpful to Spider-Man ... He's the muscle, she's the brains.\"[84] Her performance was well received by critics;[85] an Empire reviewer commended her for standing out in the film, writing, \"Stone is the Heath Ledger of this series, doing something unexpected with an easily dismissed supporting character.\"[86] The role won her the Favorite Movie Actress award at the 2015 Kids' Choice Awards.[87] Later that year, Stone took on a role in Woody Allen's romantic comedy Magic in the Moonlight, a modest commercial success.[88] A. O. Scott criticized her role, and pairing with Colin Firth, describing it as \"the kind of pedantic nonsense that is meant to signify superior intellect\".[89]\n\nThe black comedy Birdman, directed by Alejandro González Iñárritu, was Stone's final film release of 2014. Co-starring Michael Keaton and Edward Norton, it featured her as Sam Thomson, the recovering-addict daughter of actor Riggan Thomson (Keaton), who becomes his assistant. Iñárritu created the character based on his experience with his daughter.[90] Birdman was critically acclaimed,[91] and was the most successful film at the 87th Academy Awards; it was nominated for nine awards, winning four, including Best Picture.[92] The Movie Network deemed it one of Stone's best performances to date, and Robbie Collin of The Daily Telegraph found her to be \"superb\" and \"tremendous\" in her role, while also highlighting her monologue in the film which he believed to have been \"delivered like a knitting needle to the gut\".[93][94] She received Academy, BAFTA, Golden Globe, and SAG Award nominations.[95]\n\nFrom November 2014 to February 2015, Stone starred in a revival of the Broadway musical Cabaret as Sally Bowles, taking over the role from Michelle Williams.[96] Deeming it \"the most nerve-racking thing ever\", Stone listened to a French radio station to mentally prepare herself for the role.[97][98] Marilyn Stasio of Variety was critical of her singing abilities and found her performance to be \"a bit narrow as an emotional platform, but a smart choice for her acting skills, the perfect fit for her sharp intelligence and kinetic energy.\"[99] Stone's 2015 film, the romantic comedy Aloha by Cameron Crowe, was a critical and commercial failure. Her portrayal of an air force pilot, alongside Bradley Cooper, was panned by critics for its controversial whitewashing of the cast, as Stone's character was meant to be of Asian, Hawaiian, and Swedish descent. She later regretted taking part in the project, acknowledging whitewashing as a widespread problem in Hollywood.[100][101][102] Despite the backlash, Stone was nominated for Choice Movie Actress – Comedy at the 2015 Teen Choice Awards.[103] Also in 2015, Stone starred opposite Joaquin Phoenix as his character's love interest in Woody Allen's Irrational Man, which received mixed reviews.[88][104] She also appeared in the music video for Will Butler's single \"Anna\".[105]\n\nDuring her run on Cabaret, Stone met filmmaker Damien Chazelle, who, impressed with her performance, cast her in his musical comedy-drama La La Land.[106] The project, which marked her third collaboration with Gosling, starred Stone as Mia Dolan, an aspiring actress living in Los Angeles.[107] Stone borrowed several real-life experiences for her character, and in preparation, watched The Umbrellas of Cherbourg and films of Fred Astaire and Ginger Rogers.[108][109] For the film's soundtrack, she recorded six songs.[b] La La Land served as the opening film at the 2016 Venice Film Festival, where it generated critical acclaim and earned Stone the Volpi Cup for Best Actress.[111] It emerged as a commercial success, with a worldwide gross of over $440 million against a production budget of $30 million.[112] Peter Bradshaw of The Guardian wrote that \"Stone has never been better: superbly smart, witty, vulnerable, her huge doe eyes radiating intelligence even, or especially, when they are filling with tears.\"[113] For her performance, Stone won the Academy, Golden Globe, SAG, and BAFTA Award for Best Actress.[114]\n\nStone's sole release of 2017 was Battle of the Sexes, based on the 1973 eponymous match between tennis players Billie Jean King (Stone) and Bobby Riggs (Steve Carell). In preparation, Stone met with King, watched old footage and interviews of her, worked with a dialect coach to speak in King's accent, and drank high-calorie protein shakes to gain 15 pounds (6.8 kg).[115][116] The film premiered to positive reviews at the 2017 Toronto International Film Festival, and certain critics considered Stone's performance to be the finest of her career.[117] Benjamin Lee of The Guardian praised her for playing against type, and for being \"strong\" and \"convincing\" in the part.[118] Even so, the film earned less than its $25 million budget.[119] Stone received her fourth Golden Globe nomination for it, and attended the ceremony with King.[120]\n\nFilms with Yorgos Lanthimos and professional expansion (2018–present)\n\nIn 2018, Stone and Rachel Weisz played Abigail Masham and Sarah Churchill, respectively; two cousins fighting for the affection of Queen Anne (Olivia Colman), in Yorgos Lanthimos's historical comedy-drama The Favourite. She found it challenging to be an American among an all-British cast, and struggled with mastering her character's accent.[121] The film premiered at the 75th Venice International Film Festival to critical acclaim.[122] Michael Nordine of IndieWire praised Stone for taking on such a bold role following the success of La La Land, and termed the three lead actresses \"a majestic triumvirate in a period piece that's as tragic as it is hilarious.\"[123] Stone then executive-produced and starred in the Netflix dark comedy miniseries Maniac (2018), directed by Cary Joji Fukunaga. It featured Stone and Jonah Hill as two strangers whose lives are transformed due to a mysterious pharmaceutical trial. An admirer of Fukunaga's work, she agreed to the project without reading the script.[124] Judy Berman of Time magazine was impressed with Stone and Hill for their growth as actors since Superbad and noted the complexity in their performances.[125] Stone received her fifth Golden Globe nomination and third Oscar nomination for The Favourite, and additionally earned SAG nominations for both Maniac and The Favourite.[126][127][128] That same year, Stone appeared in Paul McCartney's music video for his song \"Who Cares\".[129]\n\nStone reprised her role as Wichita in Zombieland: Double Tap (2019), the sequel to 2009's Zombieland, which received mixed reviews and grossed $125 million worldwide.[130][131] She narrated the Netflix documentary series The Mind, Explained (2019) and reprised the voice role of Eep in The Croods: A New Age (2020), the sequel to 2013's The Croods.[132][133][134] In 2021, Stone played Cruella de Vil (originated by Glenn Close in the previous live-action adaptations) in Craig Gillespie's crime comedy Cruella, a Disney live-action based on the 1961 animation One Hundred and One Dalmatians. Starring opposite Emma Thompson, Stone also served as an executive producer of the film alongside Close.[135][136] The film was released in US theaters and on Disney+ Premier Access to positive reviews and grossed $233 million worldwide against its $100 million budget.[137][138] Justin Chang of Los Angeles Times wrote that despite the film's flawed screenplay, Stone was \"wholly committed, glammed-to-the-nines\"; Chang favorably compared it with her performance in The Favourite, adding that she \"nailed every nuance as another lowly young woman turned ambitious schemer\".[139] For Cruella, Stone garnered another Golden Globe nomination.[140]\n\nIn 2020, Stone and her husband, Dave McCary, launched the production company Fruit Tree.[141] Their first project was the independent film When You Finish Saving the World, which marked Jesse Eisenberg's feature directorial debut.[142] The film premiered at the 2022 Sundance Film Festival, and had modest reviews.[143][144] The company's next release was the comedy Problemista, directed by Julio Torres.[145] It premiered at the 2023 South by Southwest, and was initially scheduled to be released that year, but was delayed due to the 2023 SAG-AFTRA strike.[146][147] Both films were produced in collaboration with A24.[148]\n\nContinuing her collaboration with Lanthimos, Stone starred in his short film Bleat (2022) and feature film Poor Things (2023).[150] The latter, a fantasy coming-of-age film, is based on the novel of the same name by Alasdair Gray.[151] Stone also produced the film, in which she starred as Bella, a young Victorian woman who is crudely resurrected after her suicide. She found the experience of playing a character liberated of societal pressures to be \"extremely freeing\",[152] and she performed nudity and several sex scenes in it.[153] David Rooney of The Hollywood Reporter wrote that Stone \"gorges on it in a fearless performance that traces an expansive arc most actors could only dream about\", and particularly praised her ability to perform physical comedy.[154] Stephanie Zacharek of Time termed her performance \"wonderful—vital, exploratory, almost lunar in its perfect oddness\".[155] Stone next executive produced and starred in the Showtime satirical comedy series The Curse.[156] She played Whitney, an influencer who hosts an HGTV show with her husband.[157] Commenting on her achievements of the year, BBC Culture's Caryn James opined that \"Stone has quickly moved past Hollywood stardom to claim serious artistic credentials\".[158] She received two more Golden Globe nominations for Best Actress for her performances in Poor Things and The Curse, winning for the former.[159][160] Also for Poor Things, she won her second Academy Award and BAFTA for Best Actress in addition to a Best Picture nomination.[161][162]\n\nThe 2024 Sundance Film Festival marked the release of two films produced by Stone for Fruit Tree — the horror film I Saw the TV Glow and Eisenberg's second directorial, A Real Pain.[163] The latter, a comedy-drama about two mismatched Jewish American cousins, received critical acclaim and several accolades.[164] In her fourth collaboration with Lanthimos, Stone played three characters in his absurdist anthology film Kinds of Kindness, which premiered at the 2024 Cannes Film Festival.[165] Mashable's Robert Daniels considered it to be the weakest among their collaborations, and labeled her as \"miscast\".[166]\n\nIn 2025, Stone first appeared in Ari Aster's contemporary Western film Eddington, which premiered at the Cannes Film Festival, and also starred Joaquin Phoenix, Pedro Pascal, and Austin Butler.[167][168] Ben Croll of The Wrap felt that while Stone and Pascal were \"no doubt game and ready to let loose\", their characters \"aren’t given an awful lot to actually do – with both set up less as fully fledged characters than as images for [Phoenix] to pine-for or run against.\"[169] Stone reunited with Lanthimos in Bugonia, a remake of the South Korean film Save the Green Planet!.[170] She shaved her head for her role in the film and wore wigs in public in the months that followed to disguise the look, wanting to keep it a surprise for the audience.[149]\n\nReception and acting style\n\nCommenting on her performance in The Help, Kirk Honeycutt of The Hollywood Reporter called her \"one of our very best young actresses\".[173] Time's Daniel D'Addario stated in 2015 that Stone \"appears to have fairly limited options\" and choosing roles in independent films by \"less established directors would represent a substantive risk\".[174] Analyzing her on-screen persona, Jessica Kiang of IndieWire noted that Stone \"usually [plays] the approachable, down-to-earth, girl-next-door type, [and] in person she demonstrates many of those qualities too, along with an absolute refusal to take herself too seriously.\"[175] Biographer Karen Hollinger wrote that at the beginning of her career, Stone was often labeled a \"star ingénue\", a perceived limitation she escaped despite not being a classically trained actress as she \"crafted a brilliant career based on performative skills, careful choice of roles and distinctive personality\". In a 2024 analysis of Stone's career trajectory, IndieWire suggested that from breakout roles to acclaimed performances in indie films, Stone is positioned as a potential new movie star in Hollywood's evolving landscape.[177]\n\nIn 2008, Stone topped Saturday Night Magazine's Top 20 Rising Stars Under 30 and was included in a similar list compiled by Moviefone.[178][179] LoveFilm placed her on their list of 2010 Top 20 Actresses Under 30, and her performance in Easy A was included in Time's Top 10 Everything of 2010.[180][181] She appeared in the 2013 Celebrity 100 list, a compilation of the 100 most powerful people in the world, as selected annually by Forbes. The magazine reported that she had earned $16 million from June 2012 to June 2013.[182] That same year, she was ranked first in the magazine's Top 10 Best Value Stars.[183] In 2015, Forbes published that she had become one of the world's highest-paid actresses with earnings of $6.5 million.[184] The magazine ranked her the world's highest-paid actress two years later with annual earnings of $26 million.[185] In 2017, she was included on Time's annual list of the 100 most influential people in the world.[186]\n\nStone has been described as a style icon, with her hair, eyes, and husky voice listed as her trademark features.[171][172] Vogue credits the actress for her \"sophisticated, perfectly put-together looks\", writing that \"her charisma, both on-screen and off-, has charmed many\" and for her embrace of \"Old Hollywood Glamour\".[187][188] Bee Shapiro of The New York Times called Stone a \"likable ... spunky, talented, self-deprecating and slightly goofy\" actress who is diverse in her fashion choices.[189] In 2009, she was featured on FHM's 100 Sexiest Women in the World and Maxim's Hot 100;[190][191] the latter also placed her on the list on three other occasions—2010, 2011, and 2014.[192] In 2011, she featured on Victoria's Secret's list of \"What is Sexy?\" as the Sexiest Actress.[193] She was mentioned in other media outlet listings that year, including People's 100 Most Beautiful Women, each of FHM's and FHM Australia's 100 Sexiest Women in the World, and Men's Health's 100 Hottest Women.[194] She was ranked sixth on Empire's list of the 100 Sexiest Movie Stars in 2013.[195] Stone was named the best-dressed woman of 2012 by Vogue and was included on similar listings by Glamour in 2013 and 2015, and People in 2014.[196][197]\n\nPersonal life\n\nStone and Andrew Garfield in 2014\n\nStone moved from Los Angeles to Greenwich Village, New York, in 2009.[16] In 2016, she moved back to Los Angeles.[14] Despite significant media attention, she refuses to publicly discuss her personal life. Concerned with living a normal life, Stone has said she dislikes receiving paparazzi attention outside her home.[198] She has expressed her fondness for her profession,[14] and has cited Diane Keaton as an acting influence, calling her \"one of the most covered-up actresses of all time\". Stone has a close relationship with her family.[5] She says, \"I am blessed with a great family and great people around me that would be able to kick me in the shins if I ever for one minute got lost up in the clouds. I've been really lucky in that sense.\"[190]\n\nStone dated her Paper Man co-star Kieran Culkin for two years. In 2011, she started dating her Amazing Spider-Man co-star Andrew Garfield for four years.[199][200] Their relationship was reported in the media with various speculations; the pair refused to speak publicly about it, though they made several appearances together. In 2014, on an occasion in New York City, Stone and Garfield encouraged paparazzi to visit websites that spread awareness of causes such as autism.[201] In 2015, they were reported to have broken up.[202][203]\n\nStone met Saturday Night Live segment director Dave McCary on December 3, 2016, while hosting the show. They began dating the following year. On December 4, 2019, they announced their engagement. They married in a private ceremony in September 2020.[204] In March 2021, Stone gave birth to their daughter named Louise Jean.[205][206][207] As of 2021, the family lives in Austin, Texas.[208] In 2022, Stone sold her house in Malibu, California for $4.425 million,[209] and in 2024, she sold her Los Angeles home for $4 million.[210]\n\nStone has said she suffers from asthma, which she discovered after having difficulty breathing while filming Easy A.[211] Her mother was diagnosed with triple-negative breast cancer and cured in 2008.[212] Stone and her mother celebrated by getting tattoos of birds' feet, designed by Paul McCartney, a reference to the Beatles song \"Blackbird\", which she and her mother love.[213] Stone is a supporter of Planned Parenthood, and attended the 2017 Academy Awards wearing a Planned Parenthood pin on her dress.[214][215]\n\nIn an interview with Terry Gross of NPR, Stone said of her Lutheran upbringing: \"I have great respect for religion...but I very early on realized that religion didn't resonate for me. And so I guess the sort of relationship I had to it was a more of a guilt and a sort of self-judgment rather than, you know, focusing on the wonderful things that it can teach you...there's guilt around sexuality. There's guilt around your body. There's, you know, different stories about womanhood and what it means to be a woman and to be of service to a man or to not ever be jealous or not covet and, you know, all these things that are just sort of human and live in the shadow side. I went from religion into Jungian therapy, obviously. So learning that being complex and complicated and female was OK, you know, that took me a while, I think, to unpack in myself.\"[10]\n\nPhilanthropy\n\nStone appeared in a Revlon campaign that promoted breast cancer awareness.[216] In 2011, she appeared in a collaborative video between Star Wars and Stand Up to Cancer to raise funds for cancer research.[217] From 2012 to 2014, she hosted the Entertainment Industry Foundation's Revlon Run/Walk, which helps fight women's cancer.[218]\n\nStone and three other celebrities were present at the 2012 Nickelodeon HALO Awards, a TV special that profiled four teenagers who are \"Helping And Leading Others\" (HALO).[219] She attended the 2014 Earth Hour, a worldwide movement for the planet organized by the World Wide Fund for Nature.[220] In 2015, she was part of a fundraising event in support of the Motion Picture & Television Fund, which helps people in the film and television industries with limited or no resources.[221] A feminist,[222] she collaborated with 300 women in Hollywood to set up the Time's Up initiative to protect women from sexual harassment and discrimination in 2018.[223] In 2025, Stone signed the Film Workers for Palestine letter pledging that she would not to work with Israeli film institutions implicated in \"genocide and apartheid\" against Palestinians.[224]\n\nActing credits and awards\n\nAccording to the review aggregator site Rotten Tomatoes and the box-office site Box Office Mojo, Stone's most critically acclaimed and commercially successful films are Superbad (2007), Zombieland (2009), Easy A (2010), Crazy, Stupid, Love (2011), The Help (2011), The Amazing Spider-Man (2012), The Amazing Spider-Man 2 (2014), Birdman (2014), La La Land (2016), Battle of the Sexes (2017), The Favourite (2018), Cruella (2021), and Poor Things (2023).[225][226]\n\nStone has been recognized by the Academy of Motion Picture Arts and Sciences for the following:\n\nShe has also been nominated for five British Academy Film Awards: BAFTA Rising Star Award, Best Supporting Actress for Birdman and The Favourite, and Best Actress in a Leading Role for La La Land and Poor Things, winning for the last two.[51][95][114] Her other awards include two Golden Globe Awards for Best Actress in a Comedy or Musical for La La Land and Poor Things,[114][160] the Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Leading Role and the Volpi Cup for Best Actress at Venice Film Festival, both for La La Land.[227][228]\n\nSee also\n\nNotes\n\nReferences", "images": ["http://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Cscr-featured.svg/20px-Cscr-featured.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Emma_Stone_2011_2.jpg/250px-Emma_Stone_2011_2.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Emma_Stone%2C_Andrew_Garfield_2014_%28cropped%29.jpg/250px-Emma_Stone%2C_Andrew_Garfield_2014_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/e/e0/WPVG_icon_2016.svg/20px-WPVG_icon_2016.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/Emma_Stone_at_the_2025_Cannes_Film_Festival_03_%28cropped%29.jpg/250px-Emma_Stone_at_the_2025_Cannes_Film_Festival_03_%28cropped%29.jpg", "http://en.wikipedia.org/static/images/footer/wikimedia.svg", "http://en.wikipedia.org/static/images/icons/wikipedia.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Ballerina-icon.jpg/20px-Ballerina-icon.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/20px-P_vip.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/20px-Video-x-generic.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Emma_Stone_at_the_2024_New_York_Film_Festival_1_%28cropped%29.jpg/250px-Emma_Stone_at_the_2024_New_York_Film_Festival_1_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/40px-Blank_television_set.svg.png", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Emma_Stone_Signature.svg/120px-Emma_Stone_Signature.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Emma_Stone_at_the_39th_Mill_Valley_Film_Festival_%28cropped%29.jpg/250px-Emma_Stone_at_the_39th_Mill_Valley_Film_Festival_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/20px-Symbol_category_class.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/Emma_Stone_at_the_2025_Cannes_Film_Festival_03_%28cropped%29.jpg/960px-Emma_Stone_at_the_2025_Cannes_Film_Festival_03_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/40px-Flag_of_the_United_States.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Emma_Stone_by_Gage_Skidmore.jpg/250px-Emma_Stone_by_Gage_Skidmore.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/ValleyYouthTheatre.jpg/250px-ValleyYouthTheatre.jpg", "http://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/39/EmmaStoneSept09.jpg/250px-EmmaStoneSept09.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Flag_of_New_York_City.svg/40px-Flag_of_New_York_City.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Emma_Stone_and_Yorgos_Lanthimos%2C_Cannes_Film_Festival_2024.jpg/250px-Emma_Stone_and_Yorgos_Lanthimos%2C_Cannes_Film_Festival_2024.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/Emma_Stone_at_the_2025_Cannes_Film_Festival_03_%28cropped%29.jpg/960px-Emma_Stone_at_the_2025_Cannes_Film_Festival_03_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Emma_Stone", "title": "Emma Stone", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/Emma_Stone_at_the_2025_Cannes_Film_Festival_03_%28cropped%29.jpg/960px-Emma_Stone_at_the_2025_Cannes_Film_Festival_03_%28cropped%29.jpg", "width": 834, "height": 1200}, "title": "Emma Stone - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}