{"url": "www.biography.com/people/beyonce-knowles-39230", "text": "We may earn commission from links on this page, but we only recommend products we back.\n\n1981–present\n\nWho Is Beyoncé?\n\nBeyoncé Knowles-Carter first captured the public’s eye as lead vocalist of the R&B group Destiny’s Child. She later established a solo career with her debut album Dangerously in Love, becoming one of music’s top-selling artists with sold-out tours and a slew of awards. Beyoncé has also starred in several movies, including Dream Girls. She married hip-hop recording artist Jay-Z in 2008, and the couple has three children. She also holds the record for most Grammy wins in history with 35.\n\nKeep Reading How to Buy Beyoncé Tickets for Cowboy Carter\n\nQuick Facts\n\nFULL NAME: Beyoncé Giselle Knowles-Carter\n\nBORN: September 4, 1981\n\nBIRTHPLACE: Houston, Texas\n\nSPOUSE: Jay-Z (2008–present)\n\nCHILDREN: Blue Ivy, Rumi, and Sir\n\nASTROLOGICAL SIGN: Virgo\n\nWhere Is Beyoncé From?\n\nBorn Beyoncé Giselle Knowles on September 4, 1981, Beyoncé is from Houston. Her earliest years were spent in the Texas city’s Third Ward. The Knowles family lived on Rosedale Street in the MacGregor Way neighborhood then Parkwood Drive in nearby Riverside Terrace. In 2000, they moved to a gated community in Missouri City, a southwest suburb of Houston. Beyoncé lived in the Houston area until she was 21.\n\nFamily: Parents and Sister\n\nBeyoncé’s parents are Tina Knowles, a fashion designer, and Mathew Knowles, an entertainment executive who managed Beyoncé for more than a decade. Tina and Mathew got married the year before they had Beyoncé, who is named after her mother’s maiden name. The couple welcomed Beyoncé’s sister, Solange, in 1986.\n\nFor many years, Beyoncé’s mother worked as a hairstylist and ran her own salon called Headliners. Beyoncé’s father was a successful Xerox sales executive. Tina and Mathew both had modest childhoods in Galveston, Texas, and Alabama, respectively, but their prosperous careers provided a comfortable lifestyle for their daughters. Their work ethics didn’t go unnoticed by young Beyoncé.\n\n“My parents taught me how to work hard and smart. Both were entrepreneurs; I watched them struggle working 18-hour days,” she told Elle in 2016. “They taught me that nothing worth having comes easily. My father stressed discipline and was tough with me. He pushed me to be a leader and an independent thinker. My mother loved me unconditionally, so I felt safe enough to dream.”\n\nGetty Images Mathew and Tina Knowles helped Beyoncé find her passion for performing by enrolling their daughter in dance class when she was young.\n\nAs Beyoncé was chasing her dream of having a music career with Destiny’s Child, her parents supported her every step of the way. “It never mattered to me if my kids did music,” Mathew said in a 2004 Rolling Stone article. “If Beyoncé came to me and said, ‘Dad, I wanna be a doctor,’ I would find a way of buying a hospital.” Mathew didn’t need to take that drastic step but opted for another one: quitting his corporate job to become his daughter’s manager. He even took a music business class at Houston Community College. The gamble paid off.\n\nWhen Destiny’s Child began finding traction, Tina acted as the group’s stylist and eventually costume designer. , and Tina had learned the tricks of the trade in her youth, making outfits for a singing group she was in as a high schooler. Tina continues to work in fashion design today.\n\nMathew was Beyoncé’s manager during her Destiny’s Child tenure and through the first years of her solo career. However, in March 2011, the father and daughter announced they would no longer work together. “We both knew it was time, maybe a few years before, but I love my father so much, and he has taught me so many things. So [choosing to part ways] was something that was hard,” Beyoncé later told Oprah Winfrey. “I had to tell myself, ‘At some point, you have to be the adult that your father has raised.’” At the time, Mathew said, “Business is business and family is family. I love my daughter and am very proud of who she is and all that she has achieved.” They continue to be a part of each other’s personal lives, including during Mathew’s breast cancer diagnosis and successful treatment in 2019.\n\nAnother major split in the Knowles family became official in 2011. That year, Mathew and Tina finalized their divorce after separating two years prior. Both of Beyoncé’s parents have since remarried. Mathew wed Gena Avery in 2013. Two years later, Tina married actor Richard Lawson, whom she had known for many years. However, in July 2023, Tina filed for a divorce, citing irreconcilable differences, that was finalized the following August.\n\nBeyoncé isn’t the only star in her family of origin. Her sister, Solange, is a Grammy-winning singer in her own right. She began her career as a backup dancer and occasional singer for Destiny’s Child. In 2016, Solange and Beyoncé became the first sisters to have chart-topping albums on the Billboard 200 in the same year.\n\nChildhood\n\nGetty Images Beyoncé and her younger sister, Solange, had commonplace childhoods before becoming famous Grammy-winning singers.\n\nBeyoncé had a commonplace childhood before finding fame as a teen. She was raised in a religious household and attended Sunday service at St. John’s Downtown Church, a United Methodist church in Houston. She spent her free time seeing movies, visiting AstroWorld amusement park, and going to the Houston rodeo annually.\n\nBecause she was a shy child, Beyoncé’s parents enrolled her in a dance class, hoping it’d help her make friends. Performing unlocked an unexpected confidence in the future star. By the time she won her school’s talent show as a first grader with a rendition of John Lennon’s “Imagine,” her fate was sealed. “I was like, ‘Oh, Lord, this is amazing,’” she told Rolling Stone. “So I knew I wanted to be a singer. I think I knew before that, but I’d never been on a stage before that.”\n\nShe started performing regularly and won 35 local talent shows in a row. At age 9, she began taking voice lessons from an opera singer. Next came an endurance exercise orchestrated by her father: 10-year-old Beyoncé ran 1 mile in the morning while singing so she’d be able to sing and dance simultaneously.\n\n“I have very, very early-on memories of her rehearsing on her own in her room,” her sister, Solange, told . “I specifically remember her taking a line out of a song or a routine and just doing it over and over and over again until it was perfect and it was strong. At age 10, when everybody else was ready to say, ‘Okay, I’m tired, let’s take a break,’ she wanted to continue—to ace it and overcome it.”\n\nBeyoncé credits her mother for helping her maintain a sense of normalcy. “She always kept me a normal kid; she made sure I had slumber parties, made sure we hung out with our friends—even after eighth grade, when we started being home-schooled,” Beyonce said in 2005. Before that, Beyoncé attended St. Mary, a private Catholic school; Parker Elementary School; and Welch Middle School. She was also a student at High School for the Performing and Visual Arts.\n\nAlong with Solange, Beyoncé grew up alongside her cousin Angie and friend Kelly Rowland. Both lived with the Knowles family for a time. Rowland was also a talented singer, and soon, she and Beyoncé began performing together in the girl group that became Destiny’s Child.\n\nDestiny’s Child\n\nGetty Images Kelly Rowland, Beyoncé Knowles and Michelle Williams performing at Super Bowl XLVII in February 2013.\n\nIn the early 1990s, 9-year-old Beyoncé and Kelly Rowland formed a singing group with some classmates. Girls Tyme found early traction by booking an appearance on the TV talent competition show Star Search in 1992. The group impressed the judges but not enough to win. The loss propelled Mathew Knowles, Beyoncé’s father, to leave his corporate job to become the group’s full-time manager. The group went through some name and line-up changes before landing a record deal in 1997 with Columbia Records as Destiny’s Child. Joining Beyoncé and Rowland to round out the group were LeToya Luckett and Latavia Roberson.\n\nDestiny’s Child soon became one of the most popular R&B acts with the release of its first, self-titled album in February 1998 and its biggest hit “No, No, No.” Gaining momentum, the group scored its first Grammy nomination and No. 1 single on the Billboard Hot 100 with “Bills, Bills, Bills” from their second album, The Writing’s On The Wall (1999). The record, on which Beyoncé began to flex her songwriting muscle, featured a second chart-topper, the Grammy-winning “Say My Name,” and another hit in “Jumpin’ Jumpin.’” Within two months of its release, The Writing’s On The Wall was certified platinum, and it has now sold more than 8 million copies.\n\nDespite emerging as mainstream stars, Destiny’s Child experienced some internal turmoil with the departure of Luckett and Roberson in December 1999. The women, who say they were kicked out, later sued and settled out of court. Farrah Franklin briefly joined the group, but ultimately, the lineup solidified with Beyoncé, Rowland, and Michelle Williams. As a trio, Destiny’s Child soon reached new heights.\n\nSurvivor (2001), the group’s third album, debuted at No. 1 on the Billboard 200 and produced two more smash hits. “Independent Women Part I” led Billboard’s mainstream songs chart for 11 weeks, and “Bootylicious” spent two weeks at No. 1. The latter song held special meaning for Beyoncé. “I was feeling a bit insecure from hearing some of the comments [about my weight], and I woke up one day and refused to feel sorry for myself, so I wrote ‘Bootylicious,’” she recalled to Harper’s Bazaar . “It was the beginning of me using whatever life handed me and turning it into something empowering to other women and men who were struggling with the same thing.” Survivor’s title track won the Grammy for Best R&B Performance By A Duo Or Group With Vocal, marking the group’s third trophy.\n\nDuring the three-year hiatus that followed the release of a 2001 Christmas album, the trio each worked on independent projects. For Beyoncé, this included her acting debut and her first solo album. Destiny’s Child returned in 2004 with Destiny Fulfilled, which featured the hit songs “Lose My Breath,” “Soldier” with T.I. and Lil Wayne , and “Cater 2 U.” Yet, their days were numbered.\n\nIn June 2005, the group announced they would disband after the final concert on their Destiny Fulfilled… and Lovin’ It tour that September. ​​“After a lot of discussion and some deep soul-searching, we realized that our current tour has given us the opportunity to leave Destiny’s Child on a high note, united in our friendship and filled with an overwhelming gratitude for our music, our fans, and each other,” they shared in a statement. “After all these wonderful years working together, we realized that now is the time to pursue our personal goals and solo efforts in earnest.”\n\nAll of Destiny’s Child’s albums are platinum- or multiplatinum-certified, having sold 1 million copies or more. After The Chicks and TLC, Destiny’s Child has sold more albums in the United States than any other female musical group in history. Beyoncé, Rowland, and Williams gave a surprise performance for a brief Destiny’s Child reunion during the 2013 Super Bowl halftime show. “Kelly and Michelle are still my best friends,” Beyoncé told Harper’s Bazaar in 2021.\n\nSolo Albums\n\nAs a solo artist, Beyoncé has released eight studio albums to enormous commercial and critical success. All eight debuted as No. 1 albums on the Billboard 200 and have sold the equivalent of 37 million copies combined. Five records have won Grammy Awards as the Best Contemporary R&B Album, Best Urban Contemporary Album, or Best Dance/Electronic Music Album. I Am… Sasha Fierce was the singer’s first Album of the Year nominee, but that trophy proved elusive despite four more nods in the category (including as a contributor to Lady Gaga’s 2009 album The Fame Monster). Finally, Beyoncé won Album of the Year for Cowboy Carter in 2025.\n\nBeyoncé’s latest album, Cowboy Carter, released on March 29, 2024. Her albums, in order, are:\n\nDangerously In Love (2003) Beyoncé’s solo debut sounded much like her days as part of Destiny’s Child. Many songs, such as “Crazy In Love” and “Me, Myself and I,” touched on romance and relationships. The record resulted in five Grammy Awards, including Best Contemporary R&B Album. Dangerously In Love remains one of Beyoncé’s best-selling albums; the multiplatinum-certified project has sold the equivalent of 7 million copies. B’Day (2006) Anchored by “Irrepplaceable” and “Deva Vu,” B’Day mimicked much of the success of Dangerously In Love. Beyoncé’s sophomore album garnered four Grammy nominations and won Best Contemporary R&B Album. I Am… Sasha Fierce (2008) Beyoncé put her alter ego, Sasha Fierce, on full display with her 2008 record. The double-album incorporated emotional ballads like “If I Were a Boy” and “Halo” as well as catchy female-empowerment tunes such as “Single Ladies (Put a Ring on It)” and “Diva.” At the 2010 Grammy Awards, the singer collected her third consecutive Contemporary R&B Album trophy. 4 (2011) The singer’s fourth album was aptly titled 4. A largely upbeat collection, 4 was Beyoncé’s first album to lead the Billboard 200 for multiple weeks (in this case, two weeks). Its bigger hits included the Grammy-winning “Love On Top” and “Run the World (Girls).” Beyoncé (2013) On December 13, 2013, the triple-threat delivered a self-titled, surprise album and music videos to accompany all 14 tracks. Beyoncé was released exclusively on iTunes initially before CD sales began one week later. The record-breaking album became the fastest-selling collection ever distributed by iTunes, having sold more than 80,000 copies in three hours, and sold more than 800,000 physical copies throughout that first weekend alone. “Drunk In Love,” a sensual track featuring husband Jay-Z, became a Grammy-winning standout song followed by the equally suggestive “Partition” and feminist anthem “***Flawless” featuring author Chimamanda Ngozi Adichie. Beyoncé’s three weeks atop the Billboard 200 marked a personal best for the singer that still stands. Lemonade (2016) In April 2016, the groundbreaking artist dropped an hour-long conceptual film on HBO that incorporated tracks from her sixth album, Lemonade, which was released immediately afterward. The cable special showcased the singer reeling from the romantic betrayal of her partner while acknowledging the strength found in communities of Black women. Tennis star Serena Williams and young actor Quvenzhané Wallis also made appearances in the New Orleans–based project, which was helmed by a variety of directors and featured poetry from Warsan Shire. Lemonade the album was only initially available via Tidal, the online streaming service backed by Beyoncé’s husband, Jay-Z, before its wider release. Musical contributors to the project included Jack White, The Weeknd, James Blake, and Kendrick Lamar. Lemonade debuted at No. 1, making Beyoncé the only artist in history to have all of her first six studio albums reach the top of Billboard’s albums chart. The acclaimed work won two Grammys—Best Urban Contemporary Album and Best Music Video for “Formation”—but lost Album of the Year in a much-remembered snub. Renaissance (2022) After a six-year break, during which time the COVID-19 pandemic began, Beyoncé returned with act I of a three-part project: Renaissance. Infused in her signature anthems and powerhouse vocals were sounds and beats from the dance music scene. “Creating this album allowed me a place to dream and to find escape during a scary time for the world,” the artist shared on Instagram. “It allowed me to feel free and adventurous in a time when little else was moving.” The lead single “Break My Soul” teased to the full album release in July 2022 and became her seventh No. 1 song. “Cuff It” was another popular hit among fans and critics. Renaissance resulted in four out of eight possible Grammy trophies, including for both aforementioned songs and Best Dance/Electronic Music Album. Cowboy Carter (2024) Beyoncé’s most recent record is Cowboy Carter. As the name implies, the singer embraced country music and collaborated with some of the genre’s biggest names like Willie Nelson, Dolly Parton, and Linda Martell. Beyoncé combined original songs like the No. 1 hit “Texas Hold ’Em” with covers such as The Beatles’ “Blackbird” and Parton’s “Jolene.” Cowboy Carter resulted in 11 Grammy nominations and won three of those, including Album of the Year and Best Country Album.\n\nHow Many Grammys Does Beyoncé Have?\n\nThe most decorated and most nominated artist in Grammy history, Beyoncé has won 35 Grammys out of 99 career nominations. Among her trophies are Album of the Year for Cowboy Carter, Song of the Year for her smash hit “Single Ladies (Put A Ring On It),” and five awards for Best R&B Song.\n\nBeyoncé’s first three Grammys came during her tenure with Destiny’s Child. The trio earned back-to-back trophies for Best R&B Performance By A Duo or Group With Vocals for “Say My Name” and “Survivor” in 2001 and 2002. “Say My Name” was also named Best R&B Song.\n\nThat award has proven to be the most fruitful for the singer, who has won Best R&B Song more times than any other Grammy category in her career. Since “Say My Name,” she collected the trophy for “Crazy In Love,” “Single Ladies (Put A Ring On It),” “Drunk In Love,” and “Cuff It.”\n\nBeyoncé again won Best R&B Performance By A Duo or Group With Vocals for the duets “The Closer I Get To You” with Luther Vandross and “So Amazing” with Stevie Wonder. Elsewhere, Beyoncé has three Contemporary R&B Album awards for Dangerously In Love, B’Day, and I Am… Sasha Fierce. She also has twice won the Grammy for Urban Contemporary Album with Lemonade and Everything Is Love, her joint album with husband Jay-Z.\n\nThe 52nd Grammy Awards in January 2010 were a monumental success for Beyoncé. She took home six trophies that night, setting the record for most Grammy wins by a female artist in a single ceremony. (Adele matched the record in 2012.) Moreover, the singer saw a career milestone when she accepted Song of the Year for “Single Ladies (Put A Ring On It).” The award is one of the most coveted at the annual ceremony.\n\nMore than a decade later, in 2023, the singer made history when she became the top Grammy Award winner of all time. Her four trophies that night broke her tie, at 28, with producer Quincy Jones and allowed her to leapfrog conductor Georg Solti, who won 31 Grammys. “I’m trying not to be too emotional. I’m trying to just receive this night,” she said during her acceptance speech for her record-breaking win. “Thank you so much to the Grammys.” Beyoncé’s 99 Grammy nominations are also the most in history.\n\nDespite her records, detractors long criticized the Recording Academy for the fact that Beyoncé has been largely shut out of the top Grammy categories. The singer has received six nods for Album of the Year and multiple others for Song and Record of the Year with just one trophies to show for it. Pointing to her lack of Album titles, in particular, critics cited this as an example of the industry’s bias against Black artists. Even Jay-Z joined the fray when accepting the Dr. Dre Global Impact Award at the 2024 ceremony. “I don’t want to embarrass this young lady, but she has more Grammys than everyone and never won Album of the Year,” he said referring to Beyoncé. But that changed in 2025 when Cowboy Carter won Album of the Year.\n\nMarriage to Jay-Z\n\nIn 2008, Beyoncé married rapper and music mogul Jay-Z in a small, private ceremony in New York City. Among the guests sighted at the wedding were Knowles’ mother, Tina Knowles; father, Mathew; sister, Solange; Destiny’s Child members Kelly Rowland and Michelle Williams; and friend Gwyneth Paltrow.\n\nPhoto: Lester Cohen/Getty Images for NARAS Beyoncé Knowles and Jay-Z at the 2017 Grammy Awards\n\nIn June 2018, Beyoncé and Jay-Z embarked on the European leg of their 48-date tour. While they lived up to expectations with their theatrics and swagger, the couple also surprised fans with the release of their joint album, Everything Is Love, following a London show on June 16. Initially available for streaming only on the Jay-Z-owned Tidal, the nine-track album was accompanied by a video for the track “Apesh––,” which featured the couple and their dancers gallivanting around some of the world’s most famous artworks at the Louvre in Paris.\n\nChildren\n\nFollowing years of pregnancy rumors, Beyoncé and Jay-Z went public with the news of their impending new arrival in 2011, the mom-to-be showing off her growing baby bump at the MTV Video Music Awards that August.\n\nShe and Jay-Z welcomed a baby daughter, Blue Ivy Carter, in early January 2012. The couple spared no expense to maintain their privacy during this special time, renting out a floor of New York’s Lenox Hill Hospital.\n\nIn February 2017, the “Irreplaceable” singer announced on Instagram that she and Jay-Z were expecting twins. Later, the iconic shot was revealed to be the year’s most-liked Instagram post, with 11.1 million fans offering their approval.\n\nThey welcomed twins, a boy and a girl, in June 2017. Although the couple didn’t immediately confirm the twins’ birth or their names, People magazine reported that they had filed trademark documents at the United States Patent and Trademark Office for the names Sir and Rumi. In the early morning hours of July 14, Knowles made it official, posting a photo in which she’s holding her one-month-old twins.\n\nQuotes\n\nWhenever I’m out in public, I have to be put together. When I get home, I rebel against it, and I don’t want to take care of anything. I drop it. I’m relaxed. I don’t have any shoes on. No makeup.\n\nI feel that, especially now, with the internet and paparazzi and camera phones, it’s so difficult to maintain mystery.\n\nOne of the reasons I connect to the Super Bowl is that I approach my shows like an athlete.\n\nI think people have an idea in their heads about entertainers [and] celebrities. I think they feel like their lives are so perfect, and it’s really hard to go through painful experiences when you are in the public eye because it’s hard to have closure.\n\nThe best thing is looking back and realizing how good life is. If you don’t take the time to think about it, analyze it, you’ll never realize all the dots that are connected.\n\nWe’re all going through our problems, but we all have the same insecurities and we all have the same abilities, and we all need each other.\n\nIn my hardest moments, where I thought, “What am I doing? I’m not strong enough for this, I can’t get through this, I’m not ready.” I just have to say, “Jump!” because I know I’m gonna land in that water and swim back on the boat, and I’m going to jump again and land in the water and swim back to the boat. I have to trust myself.\n\nMy life is a journey. It seems like I set a goal and, some kind of way, I accomplish it, and then I set another one. And my goal was trusting myself, and my goal was growth.\n\nWomen have to work much harder to make it in this world. It really pisses me off that women don’t get the same opportunities as men do. Because, let’s face it, money gives men the power to run the show. It gives men the power to define our values and to define what’s sexy and what’s feminine and that’s bullsh–t. At the end of the day, it’s not about equal rights, it’s about how we think. We have to reshape our own perception of how we view ourselves.\n\nI didn’t want to release my music the way I’ve done it. I am bored with that. I feel like I am able to speak directly to my fans. There’s so much that gets between the music, the artist and the fans. I felt like I didn’t want anybody to give the message when my record is coming out. I just want this to come out when it’s ready and from me to my fans.\n\nIt’s difficult being a woman. It’s so much pressure, and we need that support sometimes.\n\nFact Check: We strive for accuracy and fairness. If you see something that doesn’t look right, contact us!", "images": ["https://hips.hearstapps.com/hmg-prod/images/gettyimages-2189275794-crop-675c4d3701992.jpg?crop=0.646xw:0.646xh;0.165xw,0.0144xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/beyonce-cowboy-carter-tour-tickets-68371699cb502.jpg?crop=1xw:0.7500712859994297xh;center,top&resize=300:*", "http://www.biography.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/beyonce_jay_z_2016_grammy_awards_photo_lester_cohen_getty_images_resized_635003128.jpg?resize=980:*", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1757007122-renaissance-poster-68b9cd06d29af.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/zach-bryan-attends-the-58th-academy-of-country-music-awards-news-photo-1698437227.jpg?crop=1.00xw:0.681xh;0,0.116xh&resize=360:*", "http://www.biography.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1309300538-67d08c4768498.jpg?crop=1.00xw:0.673xh;0,0.0398xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/bad-bunny-performs-during-his-most-wanted-tour-at-barclays-news-photo-1757017718.pjpeg?crop=0.735xw:1.00xh;0.198xw,0&resize=360:*", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1757006481-becoming-beyonce-the-untold-story-68b9ca82c7ca2.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1757005699-71vPwoOtb7L.jpg?crop=1xw:1.00xh;center,top&resize=980:*", "http://www.biography.com/_assets/design-tokens/biography/static/images/logos/network-logo.04aa008.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/lainey-wilson-attends-charlize-therons-africa-outreach-news-photo-1746804440.pjpeg?crop=1.00xw:0.668xh;0,0.0684xh&resize=360:*", "http://www.biography.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://hips.hearstapps.com/hmg-prod/images/rihanna-attends-the-savage-x-fenty-celebration-of-lavish-news-photo-1758829666.pjpeg?crop=0.516xw:0.344xh;0.283xw,0.0645xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/beyonc-c3-a9-performs-during-the-halftime-show-for-the-game-news-photo-1751300155.pjpeg?crop=1.00xw:0.755xh;0,0.108xh&resize=1200:*", "http://www.biography.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://hips.hearstapps.com/rover/profile_photos/e16c2fd9-2845-4786-ad44-4c0f66c1b12a_1686835835.file?fill=1:1&resize=120:*", "http://www.biography.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/singer-beyonce-knowles-poses-with-her-father-and-manager-news-photo-1751305669.pjpeg?crop=1.00xw:0.985xh;0,0.0150xh&resize=980:*", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1757005562-cowboy-carter-68b9c6e95e1db.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/keith-urban-attends-the-2024-cmt-music-awards-at-moody-news-photo-1742328453.pjpeg?crop=1.00xw:0.668xh;0,0&resize=360:*", "http://www.biography.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1757005842-51Y6R1hkZL._SL500_.jpg?crop=1xw:1.00xh;center,top&resize=980:*", "https://hips.hearstapps.com/rover/profile_photos/5fcff581-7d28-4053-b059-6459ddbfb3bf_1723555868.file?fill=1:1&resize=120:*", "https://hips.hearstapps.com/hmg-prod/images/family-christmas-traditions-tina-matthew-knowles-with-their-news-photo-1751305935.pjpeg?crop=0.940xw:1.00xh;0,0&resize=980:*", "http://www.biography.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/81st-golden-globe-awards-taylor-swift-on-the-red-carpet-of-news-photo-1719260997.jpg?crop=0.361xw:0.461xh;0.558xw,0.0847xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/sean-diddy-combs-on-friday-september-15-2023-news-photo-1711468298.jpg?crop=0.674xw:1.00xh;0.137xw,0&resize=360:*", "https://hips.hearstapps.com/vidthumb/images/inkt-ep04-thumbnail-682dd7da2d33d.jpg?crop=1xw:1xh;center,top", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-160616989.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/puerto-rican-singer-bad-bunny-attends-the-premiere-of-news-photo-1757619516.pjpeg?crop=0.668xw:1.00xh;0.119xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/beyonc-c3-a9-performs-onstage-during-the-renaissance-world-news-photo-1707759399.jpg?crop=0.520xw:0.758xh;0.157xw,0&resize=640:*", "http://www.biography.com/_assets/design-tokens/biography/static/images/logos/logo.5ec9b18.svg?primary=%2523ffffff", "http://www.biography.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/bruce-springsteen-attends-the-road-diary-bruce-springsteen-news-photo-1743790328.pjpeg?crop=0.668xw:1.00xh;0.167xw,0&resize=360:*", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1757006729-81pEWA3dN5L.jpg?crop=1xw:1.00xh;center,top&resize=980:*", "http://www.biography.com/_assets/design-tokens/fre/static/icons/arrow-right-regular.e879c19.svg", "https://hips.hearstapps.com/hmg-prod/images/justin-bieber-attends-the-64th-annual-grammy-awards-at-mgm-news-photo-1724175564.jpg?crop=0.522xw:0.785xh;0.288xw,0&resize=360:*", "https://hips.hearstapps.com/rover/profile_photos/b50d4909-0f39-4b73-b482-46d0a9078d40_1682363012.file?fill=1:1&resize=120:*", "http://www.biography.com/_assets/design-tokens/fre/static/icons/headphones-regular.117021e.svg?primary=%2523000000"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/beyonc-c3-a9-performs-during-the-halftime-show-for-the-game-news-photo-1751300155.pjpeg?crop=1.00xw:0.755xh;0,0.108xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.biography.com/musicians/beyonce-knowles", "title": "Beyoncé: Biography, Musician, Singer, 2025 Grammy Winner", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Beyoncé: Biography, Musician, Singer, 2025 Grammy Winner", "description": "Beyoncé is a multiplatinum, Grammy Award–winning singer. Read about her tour, Grammy Awards, kids, husband Jay-Z, movies, songs, albums, and more.", "keywords": "alert, list", "theme-color": "#000000", "og": {"site_name": "Biography", "title": "Beyoncé Stopped Her Houston Concert After a Mid-Show Mishap. Here’s How She Recovered", "description": "Queen Bey was calm and collected as always.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/beyonc-c3-a9-performs-during-the-halftime-show-for-the-game-news-photo-1751300155.pjpeg?crop=1.00xw:0.755xh;0,0.108xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.biography.com/musicians/beyonce-knowles", "type": "article"}, "article": {"publisher": "https://www.facebook.com/Biography", "opinion": "false", "section": "Famous Musicians", "modified_time": "2025-06-30T18:38:00Z", "published_time": "2025-06-30T18:38:00Z"}, "parsely-metadata": "{\"socialHeadline\":\"Beyoncé Stopped Her Houston Concert After a Mid-Show Mishap. Here’s How She Recovered\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/beyonc-c3-a9-performs-during-the-halftime-show-for-the-game-news-photo-1751300155.pjpeg?crop=0.514xw:0.772xh;0.272xw,0.0913xh&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/beyonc-c3-a9-performs-during-the-halftime-show-for-the-game-news-photo-1751300155.pjpeg?crop=1.00xw:0.755xh;0,0.108xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/beyonc-c3-a9-performs-during-the-halftime-show-for-the-game-news-photo-1751300155.pjpeg?crop=0.514xw:0.772xh;0.272xw,0.0913xh", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/beyonc-c3-a9-performs-during-the-halftime-show-for-the-game-news-photo-1751300155.pjpeg?crop=1.00xw:0.755xh;0,0.108xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "never", "sailthru.excerpt": "1981–presentWho Is Beyoncé?Beyoncé Knowles-Carter first captured the public’s eye as lead vocalist of the RB group Destiny’s Child. She later established a solo career with her debut album Dangerously in Love, becoming one of music’s top-selling artists with sold-out tours and a slew of awards. Beyoncé has also starred in", "sailthru.tags": "musicians,Famous Musicians,grammy-awards,Grammy Awards,Biography-US", "sailthru.date": "2025-06-30 18:38:00", "sailthru.socialtitle": "Beyoncé Stopped Her Houston Concert After a Mid-Show Mishap. Here’s How She Recovered", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1751308680.0, "source": "http://www.biography.com", "summary": ""}