{"url": "https://www.latingrammy.com/en/news/j-balvin-leads-latin-grammy-nominations-with-eight-followed-by-rosal-a-with-five-el-david", "text": "The Program Empowers the Next Generation of Latin Music Creators, Further Advancing the Latin GRAMMY Cultural Foundation’s Mission to Preserve Latin Music and Its Legacy\n\nFor additional images, please click here\n\nCredit: David Becker/Getty Images for the Latin GRAMMY Cultural Foundation\n\nLAS VEGAS (NOVEMBER 10, 2025) — The Latin GRAMMY Cultural Foundation®, in partnership with Latin GRAMMY® and GRAMMY® winning producer and composer, Edgar Barrera, Latin GRAMMY nominated artist, Luis Ángel “El Flaco” and Música Mexicana recording artist, Oscar Maydon students hosted an educational experience that included a musical instrument donation to Las Vegas High School and SLAM Nevada. The session featured student performances as well as a Q&A among students and the artists in attendance, moderated by renowned journalist Grecia Lopez.\n\nCelebrating its centennial anniversary, Las Vegas High School in Sunrise Manor, Nevada, is recognized as the longest-standing high school in the state. The school boasts a rich arts program centered on showcasing the diversity of storytelling through various mediums including the music program featuring an internationally recognized mariachi band. The investment will further enable the school to develop its music program and acquire new instruments, offering more students the opportunity to pursue the arts.\n\nSLAM Nevada is a tuition-free, public charter school for K-12 students. The investment will allow the music program, launched five years ago, to continue flourishing, with the vision of introducing novice elementary students to music education and building enthusiasm through the curriculum as they approach middle and high school. The program will further enable the school to acquire more instruments, allowing students to take them home during the season for continued practice, thus generating added opportunities for performances.\n\nThe program was presented in partnership with the Dr. Simi Foundation and Sony Music Group, as part of the company’s Beyond The Instrument initiative. In addition, Dollar Tree joined the celebration as an Official Sponsor, with additional support from Gibson Gives and Sweetwater.\n\n“It’s so important to give back to the next generation of music makers and encourage them to follow their dreams the same way I followed mine,” said Barrera. “That’s why I’m truly honored to partner with The Latin Recording Academy on initiatives like this, which help inspire, educate, and empower the future of Latin music.”\n\n“Being here with these students feels special because I see myself in them. I also started dreaming just like they are, without knowing where I could go, but with a strong desire to sing and tell real stories,” said “El Flaco.” “Music taught me that the most important thing is to sing from the heart and never forget where you’re from. If there’s one thing I want them to take away from today, it’s that dreams can come true when you pursue them with passion, discipline, and humility.”\n\n“Estar aquí con estos estudiantes es algo muy especial porque me veo reflejado en ellos. Yo también empecé soñando al igual que ellos, sin saber hasta dónde podía llegar, pero con muchas ganas de cantar y de contar historias reales”, dijo “El Flaco”. “La música me enseñó que lo más importante es cantar con el corazón y nunca olvidar de dónde vienes. Si algo quiero que se lleven hoy, es que los sueños sí se cumplen cuando los trabajas con pasión, disciplina y humildad”.\n\n“It’s an honor to be at Latin GRAMMY In The Schools representing Mexican music,” said Maydon. “Music has given me everything, and being here in front of these students reminds me of my beginnings and the importance of never giving up. Seeing their passion inspires me to keep working and to open more doors for future generations.”\n\n“Las Vegas High School greatly appreciates the support of the Latin GRAMMY Cultural Foundation and the instruments the Foundation provided for our students. Without this help, it would be a struggle to provide instruments and equipment for our 700 performing arts students,” said Stephen Blanco, Mariachi Director at Las Vegas High School.\n\n“At SLAM Nevada, we are incredibly honored to receive this generous gift from the Latin GRAMMY Cultural Foundation and its partners. Our community is deeply grateful for this opportunity, which will allow our students to grow musically, find their voices, and express themselves through the power of music. This investment inspires our mission to open doors for every student to discover their talent, creativity, and confidence both inside and outside the classroom,” said the SLAM Nevada Administration Team.\n\n“We’re grateful to all our partners for allowing us to offer this unique opportunity to the students of Las Vegas High School and SLAM Nevada,” said Raquel “Rocky” Egusquiza, Executive Director of the Latin GRAMMY Cultural Foundation. “It’s inspiring to see both institutions’ work in fostering music education at all levels, from elementary through high school. This support not only fuels their passion for the arts but also prepares them for a future in the industry.”\n\nSince its inception, the Latin GRAMMY In The Schools program has benefited educational institutions in various cities across the United States, including Aransas Pass, Dallas, Detroit, Kansas City, Las Vegas, Los Angeles, Chicago, Miami, New York, and San Antonio, as well as internationally in Buenos Aires, Argentina; Mexico City, Mexico; Panama City, Panama, Arecibo, Humacao, Yauco, and San Juan in Puerto Rico; and Sevilla, Spain.\n\nLatin GRAMMY In The Schools is an educational program that informs and connects music students with professionals in the Latin music industry, supporting educational music departments that face financial limitations. The Foundation invites professional musicians, artists, and sound engineers to visit middle and high schools, universities, or music education institutions and share their personal stories and experiences with students, highlighting the effort it takes to overcome career obstacles. The goal is for students to learn to optimize the educational opportunities presented to them, giving them an advantage and strong academic preparation to be able to compete in the music industry.\n\nAmong the artists who have participated in this program are: Ángela Aguilar, David Bisbal, Marilina Bertoldi, Miguel Bosé, Calle 13, Pedro Capó, Camilo, Chino & Nacho, Chiquis, Luis Coronel, Silvestre Dangond, Erika Ender, Joss Favela, Fonseca, Luis Fonsi, El Fantasma, Becky G, Karol G, Kany García, Gente de Zona, Leslie Grace, Carlos Jean, Jesse & Joy, Natalia Lafourcade, Poncho Lizárraga, Lin-Manuel Miranda, Mau y Ricky, Claudia Montero, Ednita Nazario, Christian Nodal, Laura Pausini, Ángel \"Cucco\" Peña, Mireya Ramos, Prince Royce, Gilberto Santa Rosa, Noel Scharjris, Olga Tañón, Thalía, Christian Serratos, Diego Torres, Carlos Vives, Wisin, and Sebastián Yatra.\n\n###\n\nABOUT EDGAR BARRERA:\n\nAs a producer, songwriter, and overall creative force, Edgar Barrera has helped push Latin music into the mainstream. For his work with acts like Bad Bunny, Peso Pluma, Grupo Frontera, Jennifer Lopez, Shakira, and Karol G, the Mexican hit-maker has won 26 Latin GRAMMYs®, including the awards for Songwriter of the Year and Producer of the Year. In addition, to collaborating with Anglo artists like Madonna, Ariana Grande, and Shawn Mendes, Barrera has also won a GRAMMY® Award. Though Barrera has crafted hits in many different genres, he has especially been instrumental in the recent explosion of regional Mexican music on a global level.\n\nABOUT LUIS ÁNGEL “EL FLACO”:\n\nLuis Ángel Franco, who is known by his stage name \"El Flaco,\" is a pioneer and powerhouse in the regional Mexican music scene. The Mexican superstar first rose to prominence as a singer for the group Banda Los Recoditos in 2003. Following sixteen years with the band, Franco successfully launched his solo career. With his albums like Yo Te Extrañaré and 25 Aniversario, he has established himself as a leading and defining artist of the Mexican banda genre. With the former LP, Franco received his first Latin GRAMMY® nomination last year for Best Banda Album. Throughout his career, he has collaborated with fellow Mexican acts like Grupo Firme, Luis Alfonso, Tony Aguirre, and Majo Aguilar.\n\nABOUT OSCAR MAYDON:\n\nÓscar Maydon is one of today's leading regional Mexican artists. The Mexican superstar has helped reimagine the age-old corrido for a younger generation. In 2021, Maydon signed with top corridos record label Rancho Humilde. Since then, he has scored multiple hits like \"Madonna\" and \"Fin De Semana\" with his labelmates Natanael Cano and Junior H. Last year, Maydon broke through the mainstream with his global smash \"Tu Boda\" featuring Fuerza Regida. The collaboration added to his 7.5 billion total streams on Spotify. In June, Maydon released latest album Rico o Muerte, Vol. 1, which showed off a more romantic side to his spin on regional Mexican music. He also recently wrapped up his first headlining tour across the US.\n\nABOUT THE LATIN GRAMMY CULTURAL FOUNDATION:\n\nThe Latin GRAMMY Cultural Foundation is a 501(c)(3) charitable organization established by The Latin Recording Academy® with the vision of becoming a global champion of music education and empowering communities through Latin music and culture. In 2024, the Foundation celebrated its 10-year anniversary, and during the last decade, it has fostered the next generation of Latin music creators through scholarships, education programs and grants that advance Latin music and celebrate its rich cultural heritage. To date, the Foundation has donated more than $13.9 million with the support of The Latin Recording Academy’s members, artists, corporate sponsors and other generous donors. For additional information or to donate, please visit latingrammyculturalfoundation.org or our Facebook page. And follow us @latingrammyfdn on Instagram, and at Latin GRAMMY Cultural Foundation on Facebook and LinkedIn.\n\nMEDIA CONTACT:\n\nThe Latin Recording Academy\n\nNathalie Alberto\n\nNathalie.alberto@grammy.com", "images": ["https://i8.amplience.net/i/naras/ICE_1600x1100_LOGO.jpg?w=821&sm=c", "https://naras.a.bigcontent.io/v1/static/LRA_GRA", "https://cdn.media.amplience.net/i/naras/LRA_Logo_2022", "https://naras.a.bigcontent.io/v1/static/default_latin_og_img", "https://naras.a.bigcontent.io/v1/static/connected", "https://i8.amplience.net/i/naras/Screenshot 2025-11-13 at 12.14.30 AM.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/BNA.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/lgits.jpg?w=821&sm=c", "https://naras.a.bigcontent.io/v1/static/search", "https://cdn.media.amplience.net/i/naras/LRA_Logo_2022.webp", "https://i8.amplience.net/i/naras/930x580_2018-nominees-day-english.png.jpg?w=821&sm=c"], "top_img": "https://i8.amplience.net/i/naras/930x580_2018-nominees-day-english.png.jpg?w=821&sm=c", "keywords": [], "authors": [], "canonical_link": "https://www.latingrammy.com/news/j-balvin-leads-latin-grammy-nominations-with-eight--followed-by-rosalia-with-five--el-david-aguilar-jorge-drexler-kany-garcia-natalia-", "title": "J Balvin leads Latin GRAMMY® nominations with eight, followed by Rosalía with five; El David Aguilar, Jorge Drexler, Kany García, Natalia Lafourcade, and producers Mauricio Rengifo and Andrés Torres g", "meta_data": {"viewport": "width=device-width", "google-site-verification": "mjYJq7vX2IJfypeIqe00aJUZ98j7fzgMwjkIC_eBGto", "robots": "max-image-preview:large", "googlebot": "index,follow", "description": "Pablo Alborán (Prometo), J Balvin (Vibras), Chico Buarque (Caravanas),", "twitter": {"card": "summary_large_image", "site": {"identifier": "@LatinGRAMMYs", "id": 41221076}, "domain": "https://www.latingrammy.com", "title": "J Balvin leads Latin GRAMMY® nominations with eight,  followed by Rosalía with five;  El David Aguilar, Jorge Drexler, Kany García, Natalia Lafourcade, and producers Mauricio Rengifo and Andrés Torres garnered four nominations each | LatinGRAMMY.com", "description": "Pablo Alborán (Prometo), J Balvin (Vibras), Chico Buarque (Caravanas),", "url": "https://www.latingrammy.com/news/j-balvin-leads-latin-grammy-nominations-with-eight--followed-by-rosalia-with-five--el-david-aguilar-jorge-drexler-kany-garcia-natalia-"}, "og": {"title": "J Balvin leads Latin GRAMMY® nominations with eight,  followed by Rosalía with five;  El David Aguilar, Jorge Drexler, Kany García, Natalia Lafourcade, and producers Mauricio Rengifo and Andrés Torres garnered four nominations each | LatinGRAMMY.com", "description": "Pablo Alborán (Prometo), J Balvin (Vibras), Chico Buarque (Caravanas),", "url": "https://www.latingrammy.com/news/j-balvin-leads-latin-grammy-nominations-with-eight--followed-by-rosalia-with-five--el-david-aguilar-jorge-drexler-kany-garcia-natalia-", "type": "article", "image": {"identifier": "https://i8.amplience.net/i/naras/930x580_2018-nominees-day-english.png.jpg?w=821&sm=c", "alt": "Latin Grammy OG:Image", "width": 1200, "height": 630, "type": "image/jpeg"}}, "fb": {"app_id": 717227321625984}, "keywords": "latingrammy", "googlebot-news": "index", "next-head-count": 37}, "movies": [], "publish_date": null, "source": "https://www.latingrammy.com", "summary": ""}