{"url": "https://www.independent.co.uk/arts-entertainment/tv/news/the-walking-dead-season-9-episode-5-rick-grimes-leaving-andrew-lincoln-why-quit-a8612766.html", "text": "Your support helps us to tell the story Read more Support Now From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it's investigating the financials of Elon Musk's pro-Trump PAC or producing our latest documentary, 'The A Word', which shines a light on the American women fighting for reproductive rights, we know how important it is to parse out the facts from the messaging. At such a critical moment in US history, we need reporters on the ground. Your donation allows us to keep sending journalists to speak to both sides of the story. The Independent is trusted by Americans across the entire political spectrum. And unlike many other quality news outlets, we choose not to lock Americans out of our reporting and analysis with paywalls. We believe quality journalism should be available to everyone, paid for by those who can afford it. Your support makes all the difference. Read more\n\nAndrew Lincoln has officially left The Walking Dead – but will return as Rick Grimes in a trilogy of films.\n\nThe actor finally called time on the series’ long-time leader Rick Grimes, having played the hero since the very first episode aired in 2010, in an episode that was just as emotional as fans were expecting.\n\nWhile it may be considered an ensemble piece, there’s no denying that The Walking Dead without Rick is going to be a very different show – and whether he’ll die or walk off into the sunset remains to be seen.\n\nWhile it’s been known for months now that Grimes is going, the furore surrounding his exit has overshadowed one of the most important questions of all: why exactly is Andrew Lincoln leaving?\n\nNews first surfaced of Lincoln’s departure in May, with Collider reporting that his character - along with Lauren Cohan’s Maggie Rhee - was to be phased out of the show during its current ninth season.\n\nLincoln confirmed the news three months later, showing up to Comic-Con in San Diego to say goodbye to the show’s most dedicated fans. This is what he had to say:\n\n“This will be my last season playing the role of Rick Grimes. It means everything to me. I love the people who make this show. I’m particularly fond of the people who watch this show. My relationship with Mr Rick Grimes is far from over.”\n\nThe British actor explained that his decision stemmed from wanting to spend more time with his family back in the UK, having been forced to continually relocate to Georgia for filming since the show began.\n\nSpeaking to EW Radio, he said: “I have two young children, and I live in a different country, and they become less portable as they get older. It was that simple. It was time for me to come home.”\n\nOther sources, however, have suggested that Lincoln’s decision to leave runs deeper – and may have been a consequence of former showrunner Scott Gimple unexpectedly writing his on-screen son Chandler Riggs out of the show during its eighth season.\n\nTom Payne, who plays Jesus, told Digital Spy: “I think when Carl died last year and Chandler left, I think that was a moment for him of: ‘OK, where does this leave Rick? And how does he move forward?’ I think that was a pause for thought.”\n\nRiggs refuted this, however, while speaking to Metro, revealing that Lincoln had been planning to quit for some time.\n\nHe said: “When I heard [the news], I honestly wasn’t too surprised because we talked about him leaving for a while. He had brainstormed a lot of really cool ideas behind it.\n\n“He misses his family,” Riggs continued. “He leaves every single year for like seven months to go do this show. After a while, you want to raise your kids and spend time with your wife. It was definitely really hard on him and I’m super, super happy for him to be able to raise his family, and do more cool things that he’d always talked about doing that he was never really able to do.”\n\nRick’s faced his fair share of trauma over the past nine seasons (AMC)\n\nPayne stated he wouldn’t be surprised if Lincoln was simply tired of being put through the emotional ringer. Across its nine seasons, the character has lost his closest friends and family in traumatic ways and has faced constant distress.\n\n“If you look at all of the work that Andy’s done – [he] has been in floods of tears, with snot hanging out of his nose, and he’s exhausted and covered in blood. Psychologically and physically, that’s got to take its toll on you.”\n\nThe ending of last week’s episode saw Rick impaled on a spike and surrounded by walkers. Any concerns that this was Rick’s demise, however, were dispelled when AMC released a new trailer showing Rick out of his terrifying predicament.\n\nAndrew Lincoln can stride away from The Walking Dead knowing he’s left his imprint on television. As Rick Grimes, he’s portrayed one of the small screen’s most interesting heroes who, like Walter White and Don Draper, toed the line between hero and villainy with an intrigue most actors would struggle to convey.\n\nThe good news is that the character will return in three feature-length TV movies that have been announced by franchise overseer Scott Gimple - the first project heralding a series of new scripted projects that’ll focus on other characters within the universe\n\nThe Walking Dead continues in the US on AMC every Sunday with the simulcast airing in the UK at 2am. The episode is also available to watch on NOW TV ahead of its repeat on FOX at 9pm the following evening", "images": ["https://www.independent.co.uk/img/logo-white-out.svg", "https://static.the-independent.com/s3fs-public/thumbnails/image/2017/10/08/10/the-walking-dead-rick-negan.jpg", "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/11/01/15/the-walking-dead-andrew-lincoln-rick.jpg?width=1200&height=800&crop=1200:800"], "top_img": "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/11/01/15/the-walking-dead-andrew-lincoln-rick.jpg?width=1200&height=800&crop=1200:800", "keywords": [], "authors": [], "canonical_link": "https://www.independent.co.uk/arts-entertainment/tv/news/the-walking-dead-season-9-episode-5-rick-grimes-leaving-andrew-lincoln-why-quit-a8612766.html", "title": "The Walking Dead season 9: The reason why Rick Grimes actor Andrew Lincoln quit the series", "meta_data": {"robots": "max-image-preview:large,max-video-preview:-1", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "News", "sitename": "The Independent", "page path": "/arts-entertainment/tv/news", "page type": "Article", "adPageType": "Article Page", "description": "The actor has played the lead character since its first episode 2010 – but what inspired his decision to leave?", "og": {"updated_time": "2018-11-06T09:13:23.000Z", "site_name": "The Independent", "title": "The reason why Andrew Lincoln quit The Walking Dead", "url": "https://www.the-independent.com/arts-entertainment/tv/news/the-walking-dead-season-9-episode-5-rick-grimes-leaving-andrew-lincoln-why-quit-a8612766.html", "type": "article", "description": "The actor has played the lead character since its first episode 2010 – but what inspired his decision to leave?", "image": {"identifier": "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/11/01/15/the-walking-dead-andrew-lincoln-rick.jpg?width=1200&height=800&crop=1200:800", "secure_url": "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/11/01/15/the-walking-dead-andrew-lincoln-rick.jpg?width=1200&height=800&crop=1200:800"}, "locale": "en_GB"}, "article": {"published_time": "2018-11-06T09:13:23.000Z", "modified_time": "2018-11-06T09:13:23.000Z", "section": "Culture", "subsection": "TV & Radio", "author_name": "Jacob Stolworthy", "content_type": "story", "word_count": 1211, "image_count": 2, "embed_count": 3, "video_count": 2, "internal_link_count": 2, "external_link_count": 10}, "date": "2018-11-06T09:13:23.000Z", "viewport": "width=device-width,initial-scale=1,minimum-scale=1", "theme-color": "#919191", "indy-test-internal-article-helmet": "indy", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "vf": {"owner": "viafoura-id:11000176299319"}, "twitter": {"title": "The reason why Andrew Lincoln quit The Walking Dead", "site": "@Independent", "card": "summary_large_image", "description": "The actor has played the lead character since its first episode 2010 – but what inspired his decision to leave?", "image": "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/11/01/15/the-walking-dead-andrew-lincoln-rick.jpg?width=1200&height=800&crop=1200:800"}, "keywords": "[\"The Walking Dead\",\"Andrew Lincoln\",\"Rick Grimes\",\"Internal\"]"}, "movies": [], "publish_date": 1541495603.0, "source": "https://www.independent.co.uk", "summary": ""}