{"url": "https://www.nytimes.com/2018/01/24/magazine/is-rupauls-drag-race-the-most-radical-show-on-tv.html", "text": "Each season is imbued with a sense of optimism in the face of relentless adversity; Charles believes that is central to the gay and queer experience. “There is a sisterhood here,” he told me. “It has to do with the shared experience of being outsiders and making a path for ourselves.” The camaraderie Charles describes is evident: Even after their season ends, “Drag Race” contestants work together, live together, travel together. Their Instagrams are full of photos of one another. The kinship feels real, and it’s what initially caught my attention and endeared the show to me.\n\nAmid the glitz and glamour of drag, the show doesn’t obscure the violence and terror that accompanies the life of the marginalized. On the first season, a contestant named Porkchop described being shot at while standing outside a gay bar. In Season 8, Kim Chi, a shy Korean-American queen known for elaborate outfits, talked about hiding her colorful drag persona from her parents out of fear of shaming them. Trinity K Bonet talked about living with H.I.V. Last season, Cynthia Lee Fontaine revealed that if not for a last-minute change in her schedule, she would have performed at the Pulse nightclub in Orlando the night of the mass shooting there; one of her friends, Martin Benitez Torres, unaware of the change, came to see her and was killed in the massacre. When I asked Charles if there was a deliberate decision to infuse the show with overt political messaging, he shook his head. “It’s inherent in our experience. We don’t have to do much to infuse a consciousness into the show. It is such a part of our story, and we walk with it.”\n\nAs “Drag Race” matures, it continues to find a broader and younger audience. Charles told me that some of the most dedicated viewers are women, especially teenagers and women in their 20s and 30s. “There is so much programming by social media, and how you have to construct your sense of self in line with how everyone else is constructing their sense of self. I think they see our show as a handbook for a navigation, and think, How can I rig this conveyor belt where I don’t have to go down that thing?” That awakening feels familiar to him because he went through it himself at 13. He looked like a girl, with sharp cheekbones, a soft brow and a red Afro that he let grow so big that it flopped down. “When I first started doing drag in clubs, it was like the blurry picture that people had of me became clear,” he told me. “Some of the queens were kicked out of their homes, bullied or ostracized from society, and here they are looking gorgeous and confident. I know that’s what kids are relating to. They’re having a great time, but they’ve overcome the pain too.”\n\nCharles thinks these new fans who follow him and the queens on Instagram or who show up at live events for the show are embracing the spirit of drag and the freedom it offers. “They are shifting the balance of masculinity and femininity. And that makes me so optimistic.” I was slightly skeptical that so many young people were watching the show, but as we sat over breakfast at Palihouse in West Hollywood, I noticed a middle-aged woman hovering with a nervous grin, waiting for her moment to approach. As Charles stood up, unfolding his lanky frame — sheathed in a slightly iridescent emerald-green suit — and leaned down to pick up his brown leather handbag, the woman rushed over. She wanted a photograph. “It’s not for me, but for my kids,” she explained. Her children were 9 and 5, she told Charles. “They watch you every week,” she gushed. “They love you.”\n\nThe story of Charles’s name goes like this: His mother, Ernestine — friends called her Toni — was thumbing through the July 1960 issue of Ebony Magazine, where there was a spread of the singer and piano player Fats Domino’s new $200,000 home in New Orleans. A photograph of Domino enjoying a cocktail with the architect who designed his new home, Albert J. Saputo, as well as his wife and Domino’s friends Louis Diamond and Ripoll Roberts, caught Toni’s eye. She drew an arrow to Ripoll’s name and wrote “boy” underneath. Ernestine was Creole, and she wanted her next child’s name to reflect her heritage. She changed “Ri” to “Ru” to symbolize roux, the base of Louisiana dishes like gumbo. A psychic had told her that her unborn child would be famous, and she was determined to give the baby a name meant for a marquee.", "images": ["https://static01.nyt.com/images/2018/01/28/magazine/28mag-rupaul4-cover/28mag-rupaul4-cover-articleLarge-v4.jpg?quality=75&auto=webp&disable=upscale", "https://static01.nyt.com/images/2018/01/28/magazine/28mag-rupaul2/28mag-28rupaul-t_CA2-articleLarge.jpg?quality=75&auto=webp&disable=upscale", "https://static01.nyt.com/images/2018/01/28/magazine/28mag-rupaul4-cover/28mag-rupaul4-cover-facebookJumbo.jpg?year=2018&h=550&w=1050&s=a96cb55b8eed8c1181a62b6bdc2b160067eecb197f3a8810e2cb3c29f7271649&k=ZQJBKqZ0VN"], "top_img": "https://static01.nyt.com/images/2018/01/28/magazine/28mag-rupaul4-cover/28mag-rupaul4-cover-facebookJumbo.jpg?year=2018&h=550&w=1050&s=a96cb55b8eed8c1181a62b6bdc2b160067eecb197f3a8810e2cb3c29f7271649&k=ZQJBKqZ0VN", "keywords": [], "authors": ["Jenna Wortham"], "canonical_link": "https://www.nytimes.com/2018/01/24/magazine/is-rupauls-drag-race-the-most-radical-show-on-tv.html", "title": "Is ‘RuPaul’s Drag Race’ the Most Radical Show on TV?", "meta_data": {"robots": "noarchive, max-image-preview:large", "description": "The reality-television competition that began nine years ago has evolved to reflect an era fixated on gender and identity — and the boundary-pushing spirit of its star.", "twitter": {"url": "https://www.nytimes.com/2018/01/24/magazine/is-rupauls-drag-race-the-most-radical-show-on-tv.html", "title": "Is ‘RuPaul’s Drag Race’ the Most Radical Show on TV? (Published 2018)", "description": "The reality-television competition that began nine years ago has evolved to reflect an era fixated on gender and identity — and the boundary-pushing spirit of its star.", "image": {"identifier": "https://static01.nyt.com/images/2018/01/28/magazine/28mag-rupaul4-cover/28mag-rupaul4-cover-videoSixteenByNineJumbo1600.jpg?year=2018&h=899&w=1600&s=e360ba7b744e49e783fcd79d6a888bc155d427d10b70bc1740d51c4ccc6124a1&k=ZQJBKqZ0VN&tw=1", "alt": "RuPaul Charles."}, "card": "summary_large_image", "app": {"name": {"googleplay": "NYTimes"}, "id": {"googleplay": "com.nytimes.android"}, "url": {"googleplay": "nyt://article/efb2d9b0-935a-53f5-abb6-fe052e394e58"}}, "site": "@nytimes"}, "og": {"url": "https://www.nytimes.com/2018/01/24/magazine/is-rupauls-drag-race-the-most-radical-show-on-tv.html", "type": "article", "title": "Is ‘RuPaul’s Drag Race’ the Most Radical Show on TV? (Published 2018)", "image": {"identifier": "https://static01.nyt.com/images/2018/01/28/magazine/28mag-rupaul4-cover/28mag-rupaul4-cover-facebookJumbo.jpg?year=2018&h=550&w=1050&s=a96cb55b8eed8c1181a62b6bdc2b160067eecb197f3a8810e2cb3c29f7271649&k=ZQJBKqZ0VN", "alt": "RuPaul Charles."}, "description": "The reality-television competition that began nine years ago has evolved to reflect an era fixated on gender and identity — and the boundary-pushing spirit of its star."}, "article": {"published_time": "2018-01-24T10:00:03.000Z", "modified_time": "2018-01-24T05:00:02.000Z", "section": "Magazine", "tag": "Television", "opinion": "false", "content_tier": "metered"}, "articleid": 100000005688823, "nyt_uri": "nyt://article/efb2d9b0-935a-53f5-abb6-fe052e394e58", "pubp_event_id": "pubp://event/f87f28aa271348ddb7e3a2510236a40a", "image": "https://static01.nyt.com/images/2018/01/28/magazine/28mag-rupaul4-cover/28mag-rupaul4-cover-facebookJumbo.jpg?year=2018&h=550&w=1050&s=a96cb55b8eed8c1181a62b6bdc2b160067eecb197f3a8810e2cb3c29f7271649&k=ZQJBKqZ0VN", "byl": "By Jenna Wortham", "news_keywords": "RuPaul Charles,RuPaul's Drag Race,cross-dressing;drag;drag performers,TV", "pdate": 20180124, "CG": "magazine", "PT": "article", "PST": "News", "url": "https://www.nytimes.com/2018/01/24/magazine/is-rupauls-drag-race-the-most-radical-show-on-tv.html", "msapplication-starturl": "https://www.nytimes.com", "al": {"android": {"url": "nyt://article/efb2d9b0-935a-53f5-abb6-fe052e394e58", "package": "com.nytimes.android", "app_name": "NYTimes"}, "iphone": {"url": "nytimes://www.nytimes.com/2018/01/24/magazine/is-rupauls-drag-race-the-most-radical-show-on-tv.html", "app_store_id": 284862083, "app_name": "NYTimes"}, "ipad": {"url": "nytimes://www.nytimes.com/2018/01/24/magazine/is-rupauls-drag-race-the-most-radical-show-on-tv.html", "app_store_id": 357066198, "app_name": "NYTimes"}}, "viewport": "width=device-width, initial-scale=1", "fb": {"app_id": 9869919170}, "slack-app-id": "A0121HXPPTQ"}, "movies": [], "publish_date": 1516770000.0, "source": "https://www.nytimes.com", "summary": ""}