{"url": "https://www.reddit.com/r/riverdale/comments/9kq8nb/its_oct_2_happy_17th_birthday_jughead_jones_have/", "text": "Most shocking plot twists in Riverdale\n\nRiverdale is known for its wild and often unbelievable plot twists, which have kept viewers both entertained and bewildered. Here are some of the most shocking plot twists in Riverdale, as highlighted by Redditors:\n\nOrgan Harvesting Plot\n\nThe Organ Harvesting Plot: This storyline involved characters having their organs harvested with surprising ease. \"The organ harvesting plot. They literally treated removing someone's kidney like a dentist appointment.\"\n\nRivervale\n\nRivervale: A parallel universe where the characters' lives were even more absurd. \"everything that happened in riverVale\"\n\nTickle Porn\n\nTickle Porn: A bizarre subplot involving tickle porn. \"I’m sorry the tickle porn plot was just so obviously them not knowing what to do with Toni and Reggie\"\n\nAlice as an FBI Informant\n\nAlice Undercover: The revelation that Alice Cooper was a FBI informant all along. \"I hate that they made Alice an FBI informant instead of giving Alice a journey...\"\n\nBlack Hood Identity\n\nBlack Hood Identity: The reveal of Hal Cooper as the Black Hood, despite inconsistencies. \"The most obvious: Hal was the Black Hood. However, close-up shots of the Black Hood's eyes shows that they were green, while Hal had blue eyes.\"\n\nQuad Relationship\n\nQuad Relationship: The main four characters—Archie, Betty, Jughead, and Veronica—entering a polyamorous relationship. \"Revealing betty, archie, jughead and veronica are in a quad relationship in the finale to get out of choosing final endgames is the stupidest thing riverdale has ever done imo\"\n\nSuperpowers\n\nSuperpowers: The characters suddenly developing superpowers. \"In all seriousness though, probably the plot line where they all get superpowers...\"\n\nJingle Jangle\n\nJingle Jangle: A serious drug storyline named after a whimsical term. \"Having a serious story about a dangerous drug and naming it jingle jangle\"\n\nVeronica's Speakeasy\n\nVeronica's Speakeasy: A teenager owning a speakeasy and casino. \"Veronica owning a speakeasy and casino as a teenager.\"\n\nThe Farm's Rocket\n\nThe Farm's Rocket: The cult known as \"The Farm\" building a rocket. \"The endgame of The Farm - building a rocket. That just felt dumb.\"\n\nTabitha's Time Travel\n\nTabitha's Time Travel: Tabitha discovering she can time travel and using it to address historical issues. \"They had Tabitha campaigning with the Till family, tried to stop the assassination of Martin Luther King Jr, and had the gang solve racism and homophobia from the 1960s.\"\n\nArchie's Character Changes\n\nArchie's Character Changes: Archie's sudden shift from wanting to save Riverdale to moving away. \"Archie’s ending felt really strange and a bit of a 180 for him.\"\n\nThe Sweet Hereafter\n\nThe Sweet Hereafter: The theory that the final season is set in the afterlife. \"The theory that changes everything. 'What if I told you that the entire final season of Riverdale isn't set in the past… but in the afterlife?'\"\n\nConclusion\n\nRiverdale has certainly kept its audience on their toes with these shocking plot twists. If you want to dive deeper into discussions about the show, consider visiting these subreddits:", "images": ["https://preview.redd.it/t7z2acl5prp11.jpg?width=640&crop=smart&auto=webp&s=49fa146b2b7efd2dd44e7628b97a422369c13ab5", "https://b.thumbs.redditmedia.com/bZGs8gstiDkF-F7IrU9-uya5De0KA28q0X6BR9VgjlA.png", "https://i.redd.it/t7z2acl5prp11.jpg", "https://id.rlcdn.com/472486.gif", "https://styles.redditmedia.com/t5_2u05c/styles/bannerBackgroundImage_ic336f1mi3f11.jpg?format=pjpg&s=466cf213984f8584e6c90e83bea10ca8bfb6c1d0", "https://www.redditstatic.com/shreddit/assets/favicon/64x64.png"], "top_img": "https://www.redditstatic.com/shreddit/assets/favicon/64x64.png", "keywords": [], "authors": [], "canonical_link": "", "title": "The heart of the internet", "meta_data": {"viewport": "width=device-width, initial-scale=1, viewport-fit=cover", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black", "msapplication-navbutton-color": "#000000", "theme-color": "#000000"}, "movies": [], "publish_date": null, "source": "https://www.reddit.com", "summary": ""}