{"url": "https://web.archive.org/web/20140112054306/http://connecticutlifestyles.com:80/pottery-barn-decorating-tips-on-a-walmart-budget/", "text": "Follow us on Twitter, Pinterest, Facebook, or Instagram. Submit Connecticut News or Connecticut Event for inclusion on our site. Please add connecticutlifestyles@gmail.com to your media list.\n\nby\n\nPottery Barn is one of my favorite stores for home decor and if I could afford it, my house would look like it jumped off the pages of a Pottery Barn catalog. I order the catalogs and sit for hours looking at the photos and dreaming up ways of finding similar items I can afford that will give my house that Pottery Barn look and feel. I fell in love with Pottery Barn when the show, Friends, made one of their coffee tables famous and I’ve been hooked ever since.\n\nWe can’t always get what we want but we can improvise and come up with alternatives and that is just what I have done below.\n\nOn a recent visit to a Pottery Barn store I saw a great lantern I’d love to have but at $49 for the 7″ lantern I had to walk away. Instead, I found this super neat battery powered lantern at Walmart back in the garden area on clearance for $9.99. I bought two. They even have timers. Okay, so they are plastic and not wood or glass but I’m happy with them for now and they look similar to the ones in the Pottery Barn store.\n\nPottery Barn lanterns – yes, they are definitely pretty and very good quality and I would love to own them.\n\nMy Walmart faux lantern alternative is plastic but they give the same basic look at the Pottery Barn lanterns. If you are going for quality then yes, buy the Pottery Barn lanterns but if you don’t mind a substitute these or others you find that give you the desired effect.\n\nI also found these metal European-style lanterns that are half the price of the Pottery Barn lanterns on Amazon.com The cost was around $24 to $30 each\n\nI love baskets and wanted something for the sideboard in the hallway. I didn’t want to spend $100 to $150 on a basket at a Pottery Barn store but I still wanted the look. Lucky me! The old owners of the house we bought left a large basket on the front porch with a dead plant in it. I dusted it off real good and went to Walmart and spend $15 for colored plastic Christmas balls and filled it to the brim. When Christmas is over, I replace the balls with pine cones and wicker-type balls. I even put the Christmas balls in the bottom of the basket for storage and just bring them out to the top again next year.\n\nI also saw a beautiful sectional couch at Pottery Barn and thought it would be perfect in our new house. The cost? $5,000! Say what? That’s not in my budget. I found a Broyhill sectional for $2,000 instead. This couch is beautiful and is made in the USA in North Carolina!\n\nOur Broyhill sectional is also cat approved lol\n\nI have been wanting a sideboard for a long time. It wasn’t for the dining room, it was more just for decorating. Some call it a buffet. We looked at Pottery Barn and found a beautiful one for $1,299 but went to a local furniture outlet store and bought this beautiful, solid wood, sideboard with slots for wine bottles for $299. We had to pick it up ourselves but it was a huge savings. You can find really good bargains at furniture outlet and clearance centers. Many pieces are just there because the line is being discounted, like in this case. It was not damaged in anyway.\n\nThe knobs that came on it were actually silver but everything in our house is gold-tone so we went to Lowes and bought gold-tone knobs and it looks perfect in our house. Other things in the photo include a gold scarf with tassels from HomeGoods that cost $15, a goldtone lamp from Lowes that could $16, and a eggshell ceramic umbrella vase that was purchased at a consignment shop for $40. The rug is a runner piece from Lowes as well.\n\nWhen we moved into our new house we wanted something to go into the eat-in area in the kitchen. We looked for a different buffet for that area and also something to put on the wall. Nothing we tried worked on that wall – picture, shelves, plates – so we opted for mirrors.\n\nI saw these, Ballard Designs (another favorite home decor company) “Garden District” Mirrors, in their catalog for $229 for two mirrors. Once again, a bit too expense. To get four mirrors to fill that large wall it would have cost $458 plus over-sized shipping costs, so around $550 for a set of four mirrors. And, reading the description closer, they weren’t even made out of wood, they are a poly-type material made to look like wood.\n\nWe scoured the local Home Goods stores here in Connecticut for weeks and finally found a set of two mirrors that were almost the same size as the four Ballard Designs mirrors. They were a similar design and the cost was just $49.95 for both! I think they look fantastic and make a great alternative! I love how the center design makes a circle when you put the two together.\n\nOh and by the way, the green buffet shown above in the Ballard Designs photo above is $1,299 versus the one we purchased at a local furniture store that is hand painted and cost $599. You can often find these hand-painted pieces at TJMaxx, Marshalls and Home Goods.\n\nIf you’re looking for similar mirrors I found a good option online from Esschert Designs USA. These gothic-style wooden mirrors come in white-washed grey or white and measure 33-1/2-inch high by 1.6-inch long by 26-inch wide.\n\nThis just goes to show you that you can have expensive taste but shop locally at yard sales, thrift shops, and other stores like HomeGoods, TJMaxx, Marshalls, Target and even Walmart to get that “look for less”. Since the goal is to make our home look like it all came from Pottery Barn, I just use their catalogs and ideas in the stores to understand what I am looking for them and shop elsewhere to get that look\n\nHave you found some home decor items you really wanted cheaper by shopping around or getting “look alike” pieces instead?", "images": ["https://web.archive.org/web/20140112054306im_/http://connecticutlifestyles.com/wp-content/uploads/2014/01/broyhill-couch.jpg", "https://web.archive.org/web/20140112054306im_/http://www.burstnet.com/cgi-bin/ads/ad19864p.cgi/ns/v=2.3S/sz=300x250A/", "https://web.archive.org/web/20140112054306im_/http://connecticutlifestyles.com/wp-content/uploads/2014/01/instagram-follow.jpg", "https://web.archive.org/web/20140112054306im_/http://in.getclicky.com/100669037ns.gif", "https://web.archive.org/web/20140112054306im_/http://connecticutlifestyles.com/wp-content/uploads/2014/01/lantern.jpg", "https://web.archive.org/web/20140112054306im_/http://connecticutlifestyles.com/wp-content/uploads/2014/01/gothic-wooden-mirrors-580x356.jpg", "https://web.archive.org/web/20140112054306im_/http://connecticutlifestyles.com/wp-content/uploads/2014/01/pottery-barn-budget-decorat-580x290.jpg", "https://web.archive.org/web/20140112054306im_/http://connecticutlifestyles.com/wp-content/uploads/2014/01/metal-european-lanterns-580x488.jpg", "https://web.archive.org/web/20140112054306im_/http://connecticutlifestyles.com/wp-content/uploads/2014/01/homegoods-mirrors1.jpg", "https://web.archive.org/web/20140112054306im_/http://connecticutlifestyles.com/wp-content/uploads/2014/01/pottery-barn-lanterns-580x520.jpg", "https://web.archive.org/web/20140112054306im_/http://connecticutlifestyles.com/wp-content/uploads/2014/01/pottery-barn-decorating.jpg", "https://web.archive.org/web/20140112054306im_/http://connecticutlifestyles.com/wp-content/uploads/2014/01/garden-district-mirrors.jpg"], "top_img": "https://web.archive.org/web/20140112054306im_/http://connecticutlifestyles.com/wp-content/uploads/2014/01/lantern.jpg", "keywords": [], "authors": ["Connecticut Lifestyles"], "canonical_link": "https://web.archive.org/web/20140112054306/http://connecticutlifestyles.com/pottery-barn-decorating-tips-on-a-walmart-budget/", "title": "Pottery Barn Decorating Tips on a Walmart Budget", "meta_data": {"og": {"locale": "en_us", "type": "article", "title": "Pottery Barn Decorating Tips on a Walmart Budget", "description": "Pottery Barn is one of my favorite stores for home decor and if I could afford it, my house would look like it jumped off the pages of a Pottery Barn catalog. I order the catalogs and sit for hours looking at the photos and dreaming up ways of finding similar items I can afford that will give my", "url": "https://web.archive.org/web/20140112054306/http://connecticutlifestyles.com/pottery-barn-decorating-tips-on-a-walmart-budget/", "site_name": "Connecticut Lifestyles", "image": "https://web.archive.org/web/20140112054306im_/http://connecticutlifestyles.com/wp-content/uploads/2014/01/lantern.jpg"}, "article": {"section": "Home", "published_time": "2014-01-10T03:38:37+00:00", "modified_time": "2014-01-11T19:59:09+00:00"}, "generator": "WordPress 3.7.1"}, "movies": [], "publish_date": 1389325117.0, "source": "https://web.archive.org", "summary": ""}