{"url": "https://www.independent.co.uk/news/people/june-steenkamp-oscar-pistorius-terrorised-my-daughter-reeva-before-he-shot-her-dead-9877958.html", "text": "Your support helps us to tell the story Read more Support Now From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it's investigating the financials of Elon Musk's pro-Trump PAC or producing our latest documentary, 'The A Word', which shines a light on the American women fighting for reproductive rights, we know how important it is to parse out the facts from the messaging. At such a critical moment in US history, we need reporters on the ground. Your donation allows us to keep sending journalists to speak to both sides of the story. The Independent is trusted by Americans across the entire political spectrum. And unlike many other quality news outlets, we choose not to lock Americans out of our reporting and analysis with paywalls. We believe quality journalism should be available to everyone, paid for by those who can afford it. Your support makes all the difference. Read more\n\nThe mother of Reeva Steenkamp - who was shot dead by her paralympian boyfriend Oscar Pistorius - said that he terrorised her daughter during the controlling relationship.\n\nJune Steenkamp, speaking to the BBC World Service, said that Pistorius treated Reeva like \"his arm candy\" and tried to dictate what she wore, how she behaved and how she spoke prior to killing her on Valentine's Day in 2013.\n\nSteenkamp described the time when Reeva, 29, called her during their three-month relationship to say that Pistorius was driving dangerously at 161mph with her in the car.\n\nShe said: \"One day she phoned me and said, 'Mummy, Oscar's driving like a lunatic.' And I said, 'Well, you just put him on the phone.'\n\n\"And I said to him, 'if you hurt my baby, I will have you wiped out' - just trying to scare him. And apparently he slowed down straightaway.\"\n\nPistorius, a double-amputee Olympic sprinter, was convicted of culpable homicide on 12 September for which he received a maximum prison sentence of five years, with the possibility of serving the rest under correctional supervision after 10 months.\n\nopen image in gallery June and Barry Steenkamp, parents of Reeva, during the sentencing hearing of Oscar Pistorius at the North Gauteng High Court in Pretoria\n\nSteenkamp said about sitting near him in the trial: \"That was scary. Because he was the one who killed her, and he hurt her and he terrorised her.\n\n\"We all love our children and we adored Reeva. And to sit next to the person who killed her - and she didn't do anything and she had no protection - horrible.\"\n\nPistorius, 28, pleaded not guilty to murder and said that he mistook Reeva for an intruder in his bathroom before he shot four times through the door, with three bullets hitting his girlfriend.\n\nSteenkamp, whose book Reeva: A Mother's Story is out in the UK, also said that her only child Reeva kept quiet about their relationship at the beginning as \"she wasn't sure if they were compatible\" and she told her mother that she could not understand why they were fighting so early on.\n\nShe said: \"She didn't tell me about Oscar - the first time I saw them together was on the red carpet at a sports award. And I thought: \"Now, who is this man?\" Because I'd never heard of him.\"\n\nReeva moved from her parents' home in Port Elizabeth aged 22 to the bigger and more dangerous South African city of Johannesburg to continue a successful career in modelling - which she had done since the age of 14 - after graduating with a law degree and working as a paralegal.\n\nAlso a reality television star, Reeva was due to be shown in Tropika Island of Treasure two days after she was shot by Pistorius. Her parents gave SABC 1 permission to air the show.\n\nSteenkamp said: \"I said I would just love to see her alive, happy and laughing. Lots of people couldn't understand that but to me it was like bringing her back, seeing her laughing and enjoying herself.\"", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2014/02/11/16/v2-pistorius-31.jpg?width=1200&height=800&crop=1200:800", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2014/02/11/16/v2-pistorius-31.jpg", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2014/10/15/15/pistorius-4.jpg"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2014/02/11/16/v2-pistorius-31.jpg?width=1200&height=800&crop=1200:800", "keywords": [], "authors": [], "canonical_link": "https://www.independent.co.uk/news/people/june-steenkamp-oscar-pistorius-terrorised-my-daughter-reeva-before-he-shot-her-dead-9877958.html", "title": "Oscar Pistorius terrorised Reeva before he shot her dead, says June Steenkamp", "meta_data": {"robots": "max-image-preview:large,max-video-preview:-1", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "People", "sitename": "The Independent", "page path": "/news/people", "page type": "Article", "adPageType": "Article Page", "description": "Reeva and Oscar were together for three months before he shot her dead", "og": {"updated_time": "2014-11-24T06:32:54.000Z", "site_name": "The Independent", "title": "June Steenkamp: 'Pistorius terrorised my daughter  before he shot her", "url": "https://www.independent.co.uk/news/people/june-steenkamp-oscar-pistorius-terrorised-my-daughter-reeva-before-he-shot-her-dead-9877958.html", "type": "article", "description": "Reeva and Oscar were together for three months before he shot her dead", "image": {"identifier": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2014/02/11/16/v2-pistorius-31.jpg?width=1200&height=800&crop=1200:800", "secure_url": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2014/02/11/16/v2-pistorius-31.jpg?width=1200&height=800&crop=1200:800"}, "locale": "en_GB"}, "article": {"published_time": "2014-11-24T06:32:54.000Z", "modified_time": "2014-11-24T06:32:54.000Z", "section": "News", "subsection": "People", "author_name": "Lamiat Sabin", "content_type": "story", "word_count": 569, "image_count": 2, "embed_count": 2, "video_count": 0, "internal_link_count": 0, "external_link_count": 2}, "date": "2014-11-24T06:32:54.000Z", "viewport": "width=device-width,initial-scale=1,minimum-scale=1", "theme-color": "#919191", "indy-test-internal-article-helmet": "indy", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "twitter": {"title": "June Steenkamp: 'Pistorius terrorised my daughter  before he shot her", "site": "@Independent", "card": "summary_large_image", "description": "Reeva and Oscar were together for three months before he shot her dead", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2014/02/11/16/v2-pistorius-31.jpg?width=1200&height=800&crop=1200:800"}, "keywords": "[\"Internal\"]"}, "movies": [], "publish_date": 1416810774.0, "source": "https://www.independent.co.uk", "summary": ""}