{"url": "en.wikipedia.org/wiki/Margot_Robbie", "text": "Australian actress and producer (born 1990)\n\nMargot Elise Robbie ( MAR-goh ROB-ee; born 2 July 1990) is an Australian actress and producer. Known for her work in both blockbuster and independent films, her accolades include nominations for three Academy Awards, four Golden Globe Awards and six BAFTA Awards. Time named Robbie one of the 100 most influential people in the world in 2017, and Forbes named her the world's highest-paid actress in 2023.\n\nBorn and raised in Queensland, Robbie began her career in 2008 on the television series Neighbours, on which she was a regular until 2011. After moving to the United States, she led the television series Pan Am (2011–2012) and had her breakthrough in 2013 with Martin Scorsese's black comedy film The Wolf of Wall Street. She achieved wider recognition with starring roles as Jane Porter in The Legend of Tarzan (2016), and as Harley Quinn in the DC Extended Universe (2016–2021).\n\nRobbie received critical acclaim and a nomination for the Academy Award for Best Actress for her portrayal of figure skater Tonya Harding in the biopic I, Tonya (2017). This acclaim continued for her performances as Queen Elizabeth I in Mary Queen of Scots (2018), Sharon Tate in Once Upon a Time in Hollywood (2019), and a Fox News employee in Bombshell (2019). The last of these earned her a nomination for the Academy Award for Best Supporting Actress. Robbie has since starred as an aspiring actress in the period film Babylon (2022) and the titular fashion doll in the fantasy comedy Barbie (2023), which emerged as her highest-grossing release and, as its producer, earned her a nomination for the Academy Award for Best Picture.\n\nRobbie and her husband, filmmaker Tom Ackerley, co-founded the production company LuckyChap Entertainment in 2014, under which they have produced several films, including I, Tonya, Promising Young Woman (2020), Barbie, and Saltburn (2023), as well as the Hulu series Dollface (2019–2022) and the Netflix miniseries Maid (2021).\n\nEarly life and education\n\nMargot Elise Robbie was born on 2 July 1990 in Dalby, Queensland, to Doug Robbie, a former farm-owner and sugarcane tycoon, and Sarie Kessler, a physiotherapist.[1][2][3] She is the second youngest of four; older siblings Anya and Lachlan and younger brother Cameron.[4][5] Her parents separated when she was five.[6] Robbie and her siblings were raised by their single mother and had minimal contact with their father. The family spent the majority of Robbie's upbringing on her grandparents' Currumbin Valley farm[7] in the Gold Coast hinterland.[8][9] As a child, Robbie often put on shows at home.[10]\n\nHer mother enrolled her in a circus school, where she excelled in trapeze, in which she received a certificate at age eight.[11] In high school, Robbie studied drama at Somerset College.[12] As a teenager, she worked three jobs: she tended a bar, cleaned houses, and worked at Subway.[13][14] After graduation, with a few commercials and independent thriller films on her résumé, Robbie relocated to Melbourne to begin acting professionally.[15]\n\nCareer\n\n2008–2012: Early work and Neighbours\n\nRobbie's first acting roles came when she was in high school. She starred in two low-budget independent thriller films, called Vigilante and I.C.U., both released years later. She described the experience of being on a film set as \"a dream come true\".[16] She made her television debut in a 2008 guest role as Caitlin Brentford in the drama series City Homicide and followed this with a two-episode arc in the children's television series The Elephant Princess, in which she starred alongside Liam Hemsworth.[17]\n\nWith agent encouragement at the time and as Robbie recalled on The Graham Norton Show,[18] she called FremantleMedia on a daily basis. \"One day, I got put through by accident to the casting director for Neighbours,\" and she said, \"I'm in town working on something.\" The casting director asked how old she was, and she responded \"seventeen\". She was told, \"We're looking for exactly that, come in and audition\"[18] for the television soap opera Neighbours. In June 2008, she began playing Donna Freedman, a role that was meant to be a guest character, but Robbie was promoted to the regular cast after she made her debut.[19] In her three-year stint on the soap, she received two Logie Award nominations.[20]\n\nShortly after arriving in America, Robbie landed the role of Laura Cameron, a newly trained flight attendant in the period drama series Pan Am (2011). The series premiered to high ratings and positive reviews but was cancelled after one season due to falling ratings.[21][22]\n\n2013–2015: Breakthrough\n\nRobbie next appeared in Richard Curtis' romantic comedy About Time (2013), co-starring Domhnall Gleeson and Rachel McAdams. It tells the story of a young man with the ability to time travel who tries to change his past in hopes of improving his future. To play Gleeson's unattainable teenage love interest, she adopted a British accent.[23] The film was a modest commercial success.[24] Robbie's breakthrough came the same year with the role of Naomi Lapaglia, the wife of protagonist Jordan Belfort, in Martin Scorsese's biographical black comedy The Wolf of Wall Street. In her audition for the role, Robbie improvised a slap on co-star Leonardo DiCaprio during a fight scene which ultimately won her the part.[25] The film and her performance received positive reviews; she was particularly praised for her on-screen Brooklyn accent.[26] Critic Sasha Stone wrote of Robbie's performance, \"She's Scorsese's best blonde bombshell discovery since Cathy Moriarty in Raging Bull. Robbie is funny, hard and kills every scene she's in.\"[27] The Wolf of Wall Street was a box office success, grossing $392 million worldwide, making it Scorsese's highest-grossing film to date.[28] Robbie was nominated for the MTV Movie Award for Best Breakthrough Performance and won the Empire Award for Best Newcomer.[29]\n\nShe later said that the fame and attention the movie brought her led her to consider quitting acting, but her mother was philosophical about her profession and explained to her that it was probably too late to quit. She fully understood and stuck with it.[30] With the aim to produce more female-driven projects, Robbie and her future husband, Tom Ackerley, and their respective longtime friends Sophia Kerr and Josey McNamara, started their own production company LuckyChap Entertainment. The company was founded in 2014, and its name was inspired by Charlie Chaplin.[6]\n\nRobbie appeared in four films released in 2015. The first of these was opposite Will Smith in Glenn Ficarra and John Requa's $158.8 million-grossing romantic comedy-drama film Focus. In the film, she played an inexperienced grifter learning the craft from Smith's character; she learned how to pickpocket from Apollo Robbins for the role.[31][32] Reviews of the film were generally mixed, but Robbie's performance was praised; Peter Travers of Rolling Stone wrote, \"Robbie is wow and then some. Even when Focus fumbles, [she] deals a winning hand.\"[33] She was nominated for the Rising Star Award at the 68th British Academy Film Awards.[34] Her next appearance was alongside Michelle Williams and Kristin Scott Thomas in Saul Dibb's war romantic drama Suite Française, a film based on the second part of Irène Némirovsky's 2004 novel of the same name. In the film, she played a woman falling for a German soldier during the German occupation of France during World War II, a role which Leslie Felperin of The Hollywood Reporter found \"underwritten\".[35]\n\nShe followed this with Craig Zobel's post-apocalyptic drama Z for Zachariah opposite Chris Pine and Chiwetel Ejiofor, in her first leading role. Partially based on Robert C. O'Brien's book of the same name, the film follows Ann Burden (Robbie) as she finds herself in an emotionally charged love triangle with the last known survivors of a nuclear disaster that wipes out most of civilisation. In preparation for the film, Robbie dyed her hair brown and learned to speak in an Appalachian accent.[36] The film received positive reviews, and Robbie's performance was widely praised, with Drew McWeeny of HitFix asserting that \"Robbie's work here establishes her as one of the very best actresses in her age range today.\"[37][38] Her fourth release of 2015 was a cameo appearance in Adam McKay's comedy-drama The Big Short, in which she breaks the fourth wall to explain subprime mortgages while in a bathtub. The Big Short was a commercial and critical success and Robbie's cameo became a trending topic six years later, in the wake of the GameStop short squeeze, as her explanation provided reference points for what was happening with the GameStop and related stocks.[39]\n\n2016–2018: Worldwide recognition\n\nIn 2016, Robbie reunited with Ficarra and Requa, playing a British war correspondent in the film adaptation of The Taliban Shuffle, called Whiskey Tango Foxtrot, co-starring Tina Fey and Martin Freeman.[40][41] Later that year, Robbie took on the part of Jane Porter in David Yates's adventure film The Legend of Tarzan. She was adamant about not losing weight and ensuring the role was not a damsel in distress like in previous Tarzan adaptations.[42] Reviews of the film were generally unfavourable,[43] but Manohla Dargis of The New York Times credited Robbie for \"holding her own\" in her supporting role alongside the all-male cast with Alexander Skarsgård and Samuel L. Jackson.[44]\n\nRobbie in 2016\n\nRobbie became the first person to portray DC Comics villain Harley Quinn in live-action when she signed on to David Ayer's 2016 superhero film Suicide Squad alongside an ensemble cast that included Will Smith, Jared Leto and Viola Davis. She admitted to having never read the comics, but felt a huge responsibility to do the character justice and satisfy the fans.[45] Robbie began preparing for the role of the supervillainess six months prior to the film shoot; her schedule consisted of gymnastics, boxing, aerial silk training and learning how to hold her breath underwater for five minutes. She performed the majority of her own stunts in the film.[46] Suicide Squad was a commercial success and was tenth-highest-grossing film of 2016 with global revenues of $746.8 million, and Robbie's performance was considered its prime asset.[47] Writing for Time, Stephanie Zacharek found Robbie to be \"a criminally appealing actress, likable in just about every way\" despite finding flaws in the character[48] and Christopher Orr of The Atlantic called her performance \"genuinely terrific\".[49] At the annual People's Choice Awards ceremony, she won the Favourite Action Movie Actress award and was also awarded the Critics' Choice Movie Award for Best Actress in an Action Movie.[50][51] In October 2016, Robbie hosted the season 42 premiere of NBC's late-night sketch comedy Saturday Night Live; her appearances included a parody of Ivanka Trump.[52] The series logged its strongest season premiere ratings in eight years.[53] Robbie collaborated with Domhnall Gleeson in Simon Curtis' Goodbye Christopher Robin (2017), a biographical drama about the lives of Winnie-the-Pooh creator A. A. Milne and his family. The film, and her performance, received modest reviews and was a commercial failure.[54][55]\n\nHer final release of 2017 and LuckyChap Entertainment's first release was Craig Gillespie's sports black comedy I, Tonya, based on the life of American figure skater Tonya Harding (Robbie) and her connection to the 1994 assault on rival Nancy Kerrigan. In preparation, Robbie met with Harding, watched old footage and interviews of her, worked with a voice coach to speak in Harding's Pacific Northwest accent and vocal timbre at different ages, and underwent several months of rigorous skating instruction with choreographer Sarah Kawahara.[56][57] I, Tonya premiered at the 2017 Toronto International Film Festival to critical acclaim.[58] James Luxford of Metro deemed it Robbie's best performance to date, and Mark Kermode of The Observer wrote, \"Margot Robbie's performance in this satirical, postmodern tale of the disgraced star is a tour-de-force tornado that balances finely nuanced character development with impressively punchy physicality\".[59][60] She received numerous accolades for her performance, including nominations for an Academy Award, a BAFTA Award, a Golden Globe Award, a Screen Actors Guild Award and a Critics' Choice Movie Award, all for Best Actress.[61]\n\nRobbie began 2018 with the voice role of Flopsy Rabbit in Peter Rabbit, an animated comedy from director Will Gluck, which is based on the Beatrix Potter book series. The animated feature was a box office success, grossing $351.3 million worldwide against a production budget of $50 million.[62] Her next two 2018 films—the neo-noir thriller Terminal and comedy-horror Slaughterhouse Rulez—were critical and commercial failures. The historical drama Mary Queen of Scots, directed by Josie Rourke, was her final release of 2018. The film featured Saoirse Ronan as the titular character and Robbie as her cousin Queen Elizabeth I, and it chronicles the 1569 conflict between their two countries. Robbie had initially turned down the role for being \"terrified\" of not living up to the history of portrayals of the Queen.[63] Before each day of shooting, she spent three hours in the make-up chair while a prosthetic nose, painted on boils and blisters were applied.[64] Critics dismissed the film for its screenplay and several historical inaccuracies, but praised the performances of Robbie and Ronan.[65] Yolanda Machado of TheWrap wrote, \"[B]ow down to Ronan and Robbie for taking two legendarily complex characters, [...] and completely owning both roles. Ronan's fiery Mary and Robbie's emotionally complex Elizabeth truly reign divine on screen.\"[66] For her portrayal, Robbie received nominations for a BAFTA Award and for a Screen Actors Guild Award.[67]\n\n2019–present: Established actress and producer\n\nRobbie at the premiere of Once Upon a Time in Hollywood in 2019\n\nRobbie's first release of 2019 was the LuckyChap Entertainment production Dreamland, a poorly received period crime thriller set during the 1930s Dust Bowl.[68] She began executive producing the comedy series Dollface, which streamed on Hulu from 2019 to 2022.[69] Robbie was filmmaker Quentin Tarantino's only choice to portray the late actress Sharon Tate in his period film Once Upon a Time in Hollywood, starring Leonardo DiCaprio and Brad Pitt.[70] With the Tate–LaBianca murders serving as a backdrop, the film tells the story of a fading character actor (DiCaprio) and his stunt double (Pitt) as they navigate New Hollywood in 1969 Los Angeles.[71] Feeling \"an enormous sense of responsibility\", Robbie prepared for the role by meeting Tate's family members and friends, watching all of her films and reading the autobiography by Tate's then-husband, Roman Polanski.[72] Once Upon a Time in Hollywood premiered at the 2019 Cannes Film Festival to critical acclaim, and was a commercial success with a worldwide gross of $374.3 million.[73] Despite many bemoaning Robbie's lack of lines in the film,[74] Robbie Collin of The Daily Telegraph highlighted a scene with Robbie in the cinema, which he found to be the film's \"most delightful\" scene.[75]\n\nAlso in 2019, she starred as Kayla Pospisil, a composite character based on several Fox News employees, in Jay Roach's drama Bombshell. Co-starring Charlize Theron and Nicole Kidman, the film recounts stories of various female personnel at the news network and their sexual harassment by the network's chairman Roger Ailes.[76] Robbie based her character's accent on Katherine Harris.[77] The film received positive reviews;[78] Kenneth Turan of the Los Angeles Times wrote, \"Robbie [is] at her best, the arc of her story is so crushing that it stays with you the longest.\"[79] For her performances in Once Upon a Time in Hollywood and Bombshell, she received two nominations for the BAFTA Award for Best Actress in a Supporting Role,[a][80] and for the latter she received nominations for an Academy Award, a Golden Globe and a Screen Actors Guild Award; all in the Best Supporting Actress category.[81]\n\nRobbie began the new decade by reprising the role of Harley Quinn in Cathy Yan's Birds of Prey (2020). Determined to make a female ensemble action film, she pitched the idea for the film to Warner Bros. in 2015. Robbie spent the subsequent three years developing the project under her production company, making a concerted effort to hire a female director and screenwriter.[82] Birds of Prey, along with Robbie's performance, gained generally positive reviews;[83][84][85] Ian Freer of Empire wrote that \"the MVP is Robbie, who lends Harley charming quirk and believable menace, hinting at Harley's inner life without reams of dialogue.\"[86] She received two nominations at the 46th People's Choice Awards.[87]\n\nRobbie served as a producer on Promising Young Woman (2020), a comedy thriller by writer-director Emerald Fennell, starring Carey Mulligan as a woman who seeks to avenge the rape and death of her best friend. The film received acclaim,[88][89] earning a nomination for the Academy Award for Best Picture.[90] In 2021, Robbie reprised her voice role as Flopsy Rabbit in Peter Rabbit 2: The Runaway, which received mixed reviews and grossed $153.8 million worldwide.[91][92] She also made her third outing as Quinn in the standalone sequel The Suicide Squad, written and directed by James Gunn. Due to the COVID-19 pandemic, the film was simultaneously released theatrically and on the streaming service HBO Max. Owen Gleiberman praised Robbie's \"delectable performance\" in it.[93] She also served as an executive producer for the Netflix miniseries Maid.[94]\n\nRobbie at the Sydney premiere of Barbie in 2023\n\nIn 2022, Robbie reprised her role as Donna Freedman for the final episode of Neighbours.[95] She starred alongside an ensemble cast in David O. Russell's period comedy Amsterdam, based on the 1933 Business Plot.[96] The film emerged as a critical and commercial failure.[97][98] In her second film release of the year, she played Nellie LaRoy, an actress inspired by silent movie star Clara Bow, in Damien Chazelle's comedy-drama Babylon. In preparation, she studied the works of Bow and researched her traumatic childhood.[30] She described LaRoy as \"the most physically and emotionally draining character I've ever played\".[30] The film polarised critics and had poor box office returns, though her performance received praise;[99][100] Caryn James of BBC Culture opined, \"Robbie's bold, charismatic performance makes Nellie a daring, endlessly spiraling, sympathetic figure\".[101] She received another Golden Globe nomination for Best Actress,[102] although the underperformance of her two major releases that year led some commentators to brand her as \"box office poison\" at the time.[103]\n\nIn the following year, Robbie had a single scene in Wes Anderson's ensemble comedy film Asteroid City.[104] Chris Hewitt of the Star Tribune described her \"impassioned acting in her lone scene\" as \"perfectly judged\".[105] The fantasy comedy Barbie, co-starring Ryan Gosling as Ken, was her next film release.[106] As producer, Robbie bought the rights from Mattel for a film about the eponymous fashion doll in 2018.[107] She hired Greta Gerwig to write and direct the film, and took on the title role herself after Gal Gadot declined her offer.[107] In preparation, Gerwig and Robbie watched old Technicolor musicals such as The Red Shoes (1948) and The Umbrellas of Cherbourg (1964).[107] Variety reported that Robbie earned $12.5 million for the role, the highest for an actress in Hollywood that year.[108] Vulture's Alison Willmore took note of how much Robbie fit the part, and commended her for combining both \"heartbreaking earnestness\" and \"humor\" in her performance.[109] With a worldwide gross of over $1.4 billion, Barbie emerged as Robbie's highest-grossing release.[110] She received further BAFTA and Golden Globe nominations for her performance, in addition to a nomination for the Academy Award for Best Picture.[111][112][113]\n\nAlso in 2023, Robbie produced Fennell's second directorial, Saltburn.[114] The 2024 Sundance Film Festival marked the release of her next production, Megan Park's comedy film My Old Ass.[115] Robbie starred alongside Colin Farrell in Kogonada's 2025 film A Big Bold Beautiful Journey[116] and will appear with Jacob Elordi in Fennell's Wuthering Heights, adapted from the novel.[117]\n\nPersonal life\n\nDespite significant media attention, Robbie rarely discusses her personal life.[118][119] Robbie moved from Melbourne to Williamsburg, Brooklyn, in the early 2010s, having previously shared a flat with Neighbours co-star Ashleigh Brewer.[120][121] During that period, she became an avid ice hockey fan; she supports the New York Rangers and previously played right wing in an amateur ice hockey league.[122][123]\n\nRobbie met British assistant director Tom Ackerley on the set of Suite Française in 2013.[124] As a child, Ackerley served as an extra in the first three films of the Harry Potter film series, which Robbie has been a fan of since childhood.[125] In 2014, she moved to London with Ackerley and LuckyChap Entertainment co-founders Sophia Kerr and Josey McNamara. Later that year, Robbie and Ackerley began a romantic relationship.[6][126] In December 2016, they married in a private wedding ceremony in Byron Bay, Australia.[127][128] The couple reside in Venice Beach, California.[124] In August 2024, the couple revealed that they were expecting their first child,[129][130] and in October, in the same year, Robbie gave birth to their son.[131][132]\n\nOther work\n\nRobbie has been a vocal supporter of human rights, women's rights, gender equality and LGBT rights.[133][134] Through LuckyChap Entertainment, she and her co-founders focus on promoting female stories from female storytellers, whether it would be writers, directors, producers or all the above.[135] In 2014, she was part of a fundraising event in support of the Motion Picture & Television Fund, which helps people in the film and television industries with limited or no resources; she joined the same event on two other occasions, in 2018 and 2020.[136] In 2015, she helped raise $12 million through the BGC Global Charity Day fundraising event, which donates money to different charities around the world.[137] In 2016, Robbie joined other celebrities and UN Refugee Agency staff in a petition aiming to gather public support for the growing number of families forced to flee conflict and persecution worldwide.[138] Later in the year, she joined Oxfam's \"I Hear You\" project, which was designed to amplify the personal stories of the world's most vulnerable refugees and donated more than $50.000 to UNICEF's \"Children First\" campaign, in support of refugee children.[139]\n\nIn October 2016, while hosting Saturday Night Live, Robbie made a stand for same-sex marriage in her native Australia wearing a T-shirt that read \"Say 'I Do' Down Under\", with a map of the country in rainbow colours. A year later, she joined fellow actor Chris Hemsworth in advocating for the same purpose.[140] In 2018, she pledged to support the Time's Up initiative to protect women from harassment and discrimination.[141] In April 2021, Robbie was announced as the recipient of the inaugural RAD Impact Award, for inspiring purpose with her philanthropy. She chose to share the prize with Youngcare, a charity she had previously worked with, and therefore an impact donation was made to fund a project benefiting young people with extensive care needs.[142]\n\nPublic image\n\nRobbie in 2013\n\nRobbie is known for starring in both high-profile, mainstream productions and low-budget independent films, in which she has been able to display both her dramatic and comedic range.[143][144][145][146][147]\n\nFor her role in The Wolf of Wall Street, Vanity Fair named her one of its breakthrough actors of 2013.[148] In 2017, she appeared on the annual Forbes 30 Under 30 list, a compilation of the brightest young entrepreneurs, innovators and game changers in the world and was included on a similar list compiled by The Hollywood Reporter.[149][150][151] That same year, Time named her one of the 100 most influential people in the world; her The Wolf of Wall Street director Martin Scorsese penned the article in the magazine, referring to Robbie as having \"a unique audacity that surprises and challenges and just burns like a brand into every character she plays. [...] Margot is stunning in all she is and all she does, and she will astonish us forever.\"[152] In 2019, Forbes ranked her among the world's highest-paid actresses, with annual earnings of $23.5 million, and The Hollywood Reporter listed her among the 100 most powerful people in entertainment.[153][154] In 2021, she was named one of the 100 most influential women in entertainment by The Hollywood Reporter.[155] In December 2023, Robbie has been listed in The Hollywood Reporter’s 2023 Women in Entertainment Power 100.[156] In 2024, she was named by Forbes as the world's highest-paid actress in 2023, with earnings of $78 million.[157]\n\nVogue has named her \"one of the most glamorous starlets\", and she was ranked as one of the best-dressed women in 2018 and 2019 by luxury fashion retailer Net-a-Porter.[158][159] In 2014 and 2016, she featured on AskMen's Top 99 Women, ranking among the top ten each year.[160][161] Also in 2016, Robbie was placed at number one on FHM's \"100 Sexiest Women in the World\" list.[162] Since 2016, she has been chosen as the ambassador for brands such as Calvin Klein, Nissan and Chanel.[163][164][165] She was the last brand ambassador picked by Karl Lagerfeld before his death in February 2019.[166] She is the latest ambassador of Chanel No. 5.[167][168]\n\nNotes\n\nReferences\n\nFurther reading", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/Margot_Robbie_%2828601016915%29_%28cropped_3%29.jpg/250px-Margot_Robbie_%2828601016915%29_%28cropped_3%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/20px-Wikiquote-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Margot_Robbie_%28cropped%29.jpg/250px-Margot_Robbie_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Margot_Robbie_by_Gage_Skidmore.jpg/250px-Margot_Robbie_by_Gage_Skidmore.jpg", "http://en.wikipedia.org/static/images/footer/wikimedia.svg", "http://en.wikipedia.org/static/images/icons/wikipedia.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/57/SYDNEY%2C_AUSTRALIA_-_JANUARY_23_Margot_Robbie_arrives_at_the_Australian_Premiere_of_%27I%2C_Tonya%27_on_January_23%2C_2018_in_Sydney%2C_Australia_%2828074883999%29_%28cropped_2%29.jpg/250px-thumbnail.jpg", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Margot_Robbie_signature.svg/60px-Margot_Robbie_signature.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/20px-Symbol_category_class.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/5/57/SYDNEY%2C_AUSTRALIA_-_JANUARY_23_Margot_Robbie_arrives_at_the_Australian_Premiere_of_%27I%2C_Tonya%27_on_January_23%2C_2018_in_Sydney%2C_Australia_%2828074883999%29_%28cropped_2%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Margot_Robbie_2019_by_Glenn_Francis_%28cropped%29.jpg/250px-Margot_Robbie_2019_by_Glenn_Francis_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Margot_Robbie_at_Somerset_House_in_2013_%28cropped%29.jpg/250px-Margot_Robbie_at_Somerset_House_in_2013_%28cropped%29.jpg", "http://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Margot_Robbie_%2853012385004%29.jpg/250px-Margot_Robbie_%2853012385004%29.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/5/57/SYDNEY%2C_AUSTRALIA_-_JANUARY_23_Margot_Robbie_arrives_at_the_Australian_Premiere_of_%27I%2C_Tonya%27_on_January_23%2C_2018_in_Sydney%2C_Australia_%2828074883999%29_%28cropped_2%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Margot_Robbie", "title": "Margot Robbie", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/5/57/SYDNEY%2C_AUSTRALIA_-_JANUARY_23_Margot_Robbie_arrives_at_the_Australian_Premiere_of_%27I%2C_Tonya%27_on_January_23%2C_2018_in_Sydney%2C_Australia_%2828074883999%29_%28cropped_2%29.jpg", "width": 916, "height": 1200}, "title": "Margot Robbie - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}