{"url": "https://en.wikipedia.org/wiki/Mine_(Taylor_Swift_song)", "text": "2010 single by Taylor Swift\n\n\"Mine\" is a song written and recorded by the American singer-songwriter Taylor Swift and the lead single from her third studio album, Speak Now (2010). Big Machine Records released the song for download and to US country radio on August 4, 2010. Produced by Swift and Nathan Chapman, \"Mine\" is a country pop song with elements of pop rock. In the lyrics, the track discusses the ups and downs of young love, inspired by Swift's tendency to run away from love for fears of heartbreak.\n\nMusic critics praised \"Mine\" for its narrative and mature perspective on love, although some deemed the song formulaic and likened it to Swift's previous country pop songs. The single was a top-ten hit and received recording certifications in Australia, Canada, and Japan. In the United States, \"Mine\" peaked at number three on the Billboard Hot 100, number two on Billboard's Hot Country Songs chart, and number one on Billboard's Adult Contemporary chart. The Recording Industry Association of America (RIAA) certified the single triple platinum for crossing three million units based on sales and streaming.\n\nSwift and Roman White directed the music video for \"Mine\", which chronicles a romance with a happy ending between Swift and her love interest (played by Toby Hemingway). It won Video of the Year at the 2011 CMT Music Awards. During promotion of Speak Now, Swift performed \"Mine\" on televised events in the United States and Japan, and she included the song on the set list of her Speak Now World Tour (2011–2012). A re-recorded version, titled \"Mine (Taylor's Version)\", was released as part of Swift's third re-recorded album Speak Now (Taylor's Version) (2023).\n\nBackground and release [ edit ]\n\nIn an interview with Rolling Stone in September 2010, Taylor Swift revealed that her song \"Mine\" was inspired by an unnamed crush in mind, saying \"I was reflecting back on a boy I liked at a certain time.\"[1] She also told MTV that the song was about what it would be like if she actually let her guard down.[2] During a live Ustream chat with her fans on July 20, 2010, Swift explained that the song is about \"her tendency to run from love\" after seeing many relationships end in goodbye and breakups.[3] She continued, \"I think I've developed this pattern of sort of running away when it comes time to fall in love and to stay in a relationship. The song is sort of about finding the exception to that and finding someone who would make you believe in love and realize that it could work out.\" During the livestream, Swift also confirmed that the final mix of the song was completed that morning.[3][4] In March 2011, during an interview with In:Demand Scotland, Swift revealed that she had written the song when she was in Texas for her Fearless Tour (2009–2010).[5]\n\n\"Mine\" was one of the fourteen tracks on Speak Now that was written solely by Swift. She produced the song with the American record producer Nathan Chapman.[6] It was originally planned to be released on August 16, 2010,[7] however, after the leak of an unauthorized low-quality mp3 file of the song, Big Machine Records decided to release the song to US country radio and on iTunes on August 4, 2010, twelve days earlier than planned.[8][9] Swift commented that \"a leak is so out of my comfort zone, but it ended up good in the end. It made me so emotional that I started crying.\"[2][10]\n\nComposition [ edit ]\n\n\"Mine\" is a country pop song with an uptempo rhythm and elements of mainstream pop music.[11][12] In the Los Angeles Daily News, Sam Gnerre characterized it as a blend of country and pop rock.[13] KILT-FM described \"Mine\" as \"an uptempo song that's unmistakably Taylor\" with \"a big chorus and [is] very singable.\"[14] In the track, Swift sings with a slight country twang.[15] Alan Macpherson of The Guardian noted that the song \"reprises the joyous rush of Swift's breakthrough hit, 'Love Story', but depicts love as an adult process rather than a teenage dream.\"[16]\n\nDave Heaton of PopMatters described \"Mine\" as a \"song of rebirth\" with a \"fairly complex\" narrative.[17] He wrote about the lyrical content, \"it starts in the past, at the start of a relationship, and then lets us know it's a flashback. They're sitting on the couch reminiscing. It then jumps back to the beginning and steps us through the couple's years together, but all the while shifting perspective, jumping between their separate memories.\"[17] James Dinh from MTV said that it \"features an uplifting country/pop melody and a big chorus\" and it talks about \"the wonders of being in a happy relationship after surviving a rocky past.\"[18] Priya Elan of The Guardian believed that \"Mine\" depicts \"a stop-start relationship between a normal guy and girl\".[19] Leah Greenblatt of Entertainment Weekly interpreted the song's message to be about \"young love blossoming — in this specific case, young college love.\"[20]\n\nCritical reception [ edit ]\n\n\"Mine\" received mostly positive reviews by music critics. Rob Sheffield of Rolling Stone praised Swift's lyrical craftsmanship, regarding the lyric \"You made a rebel of a careless man's careful daughter\" as a \"brilliant throwaway detail.\"[24] Chrissie Dickinson of the Chicago Tribune regarded \"Mine\" as an epitome of Swift's classic song-craft, calling it \"simple but honest expressions of emotion.\"[25] Bobby Peacock from Roughstock lauded the song's catchy yet melodious hook, but thought that it reflects her earlier works and said that he wished that Swift would \"try something a little more out of the ordinary.\"[23] Nick Levine of Digital Spy commented that although \"Mine\" was \"formulaic\", the formula was executed convincingly.[22] Anthony Benigno of the Daily News similarly wrote although the track was reminiscent of Swift's previous hits, its \"origins are grounded more in failed relationships than storybook ones.\"[26]\n\nCommercial performance [ edit ]\n\nTwo days after its official release, it was estimated that \"Mine\" would sell approximately 350,000 digital downloads with a possible debut in the top three on the Billboard Hot 100.[27] On the week ending August 21, 2010, the song debuted at number one on the Hot Digital Songs chart due to 297,000 digital downloads, which led to its appearance on the Billboard Hot 100 at number three. This consequently made Swift the second female artist in the history of the Hot 100 to have multiple tracks debut in the top five during a calendar year.[28] With 297,000 downloads, \"Mine\" became the eighth-biggest debut sales week ever for a digital song, and the fourth-best of 2010.[29] The song also debuted at number 26 on the Hot Country Songs on the week ending August 21, 2010, later peaking at number two on the week ending November 13, 2010.[30] \"Mine\" also reached number one on Adult Contemporary,[31] number seven on Adult Pop Songs,[32] and number 12 on Pop Songs.[33] \"Mine\" ranked at number 46 on the Billboard Hot 100 year-end chart.[34] On August 21, 2014, the song was certified triple platinum by the RIAA.[35] As of November 2017, \"Mine\" has sold 2.3 million copies in the United States.[36]\n\n\"Mine\" achieved moderate success outside the United States. The song debuted and peaked at number seven in Canada with 15,000 digital downloads sold in the week of August 2, 2010.[37][38] It was certified platinum by Music Canada.[39] On the week ending August 22, 2010, the song entered in Australia and peaked at number nine.[40] It was certified gold by the Australian Recording Industry Association (ARIA) for shipments exceeding 35,000 copies.[41] On the week ending August 9, 2010, it debuted at number 30 in New Zealand, and peaked at number 16 the following week after its release.[42] The song debuted and peaked at number 30 on the week ending October 30, 2010, in the United Kingdom.[43] In Europe, \"Mine\" peaked at number 38 in Ireland,[44] 70 on the Eurochart Hot 100 Singles Chart,[45] number 48 in Belgium (Flanders),[46] and number 48 in Sweden.[47]\n\nMusic video [ edit ]\n\nDevelopment and release [ edit ]\n\nSwift directed the music video for \"Mine\" with Roman White, who had directed her previous music videos such as \"You Belong with Me\" and \"Fifteen\". This marked Swift's first time to be the director for her music video.\"[48] White explained that the video features \"a lot of time travel, which would explain how those two crazy kids end up with kids of their own in the end.\"[49] He further added that \"the song has a lot of dark elements, but it also has a lot of happy elements\" and he praised Swift for her involvement with the production of the music video.[50] Swift chose her friend Jaclyn Jarrett, the daughter of the professional wrestler Jeff Jarrett, to play the younger version of herself in the video.[51] Kyra Angle, the daughter of the professional wrestler Kurt Angle, also made an appearance in the music video.[51] The music video was shot in Kennebunkport, Maine,[52] where several scenes took place in Ram Island Farm, Cape Elizabeth, and Christ Church on Dane Street. Christ Church served as the venue for the wedding scene.[53] The video features Swift marrying a groom played by the British actor Toby Hemingway, who was cast by Swift after watching Feast of Love. She was impressed with Hemingway and thought \"it would be perfect to put him in the video.\"[54] The video premiered on August 27, 2010, on CMT,[55] in a live half-hour special event which included a behind-the-scenes look of the video.[56] Swift returned to Kennebunkport, Maine to share the premiere with local residents, which attracted approximately 800 people, including the former US President George H. W. Bush, who brought his grandchildren to see Swift.[57]\n\nSynopsis [ edit ]\n\nThe video begins with Swift entering a coffee shop. As she sits down, she notices that a couple, opposite where she is sitting, is arguing, reminding her about her parents arguing when she was very young. A waiter (Toby Hemingway) comes by to take Swift's order. She looks up and infatuates him, resulting in a romantic relationship between the two. They are seen moving in together and unpacking boxes. After some time of dating, Swift's lover proposes to her on a rowboat and she cheerfully accepts. Later, the two are seen arguing, resulting in Swift running away from the house, crying, just like she did when she was younger as she saw her parents arguing. He follows her, and the two reconcile the relationship. They get married and have two sons. In the end, time returns to when Swift was ordering her food at the coffee shop. Throughout the video, there are some scenes of Swift singing the verses of the song while walking barefoot on a green pasture amongst photos of her and her family. The photos are hanging on a white string in between two large trees. Swift is seen with her hair loose and wearing a white dress with a thin belt around the waist.[58]\n\nReception [ edit ]\n\nTanner Stransky of Entertainment Weekly felt the video was \"rather sweet\" and \"heartwarming\" in a sense that the song \"seems to have a happy ending.\"[59] Leah Collins of Dose lamented the video for its typical fairytale element even though the plot ended with a blissful marriage. She concluded her review by writing, \"Swift happens to include dirty diapers and recreating scenes from The Notebook.\"[60] Tamar Anitai from MTV described the video as \"a coming-of-age story\" where Swift is depicted to endure \"many adult life cycle events and major milestones.\"[48] In a different perspective, James Montgomery from the same publication compared the music video to Katy Perry's \"Teenage Dream\", writing that although both videos are \"essentially about the same thing: the fantasies of young, thoroughly modern women\", the fantasies are \"about as different as the women presenting them.\"[61] A reviewer from The Improper Bostonian also compared the music video to \"Teenage Dream\" and noticed that the two music videos presented two contrasting end points, writing \"for Swift, it's a marriage, a home and babies. For Perry, its independence and the ability to define your own life.\"[62]\n\nAwards and nominations [ edit ]\n\nLive performances [ edit ]\n\nSwift performing \"Mine\" on guitar during the Speak Now World Tour\n\nOn June 11, 2010, Swift performed the song for the first time at a small, intimate concert that aired as a part of CMA Music Festival: Country's Night to Rock on ABC on September 1, 2010.[70] She also performed \"Mine\" and \"You Belong With Me\" at the 2010 NFL Opening Kickoff event.[71] On October 5, 2010, Swift performed the song live on the Italian X Factor.[72] On October 9, 2010, she performed an acoustic version of \"Mine\" during the Grand Ole Opry's 85th birthday celebration.[73] She later performed the song as well as an acoustic cover of Coldplay's \"Viva la Vida\" in the BBC Radio 2 studio on October 21, 2010.[74]\n\nSwift sang \"Mine\" on several other occasions. She performed it on Paul O'Grady Live on October 24, 2010.[75] On October 25, 2010, Swift sang \"Mine\" with two other songs from Speak Now on Speak Now: Taylor Swift Live From New York City, a special programme which was streamed live on CMT.com, MTV.com, VH1.com and other MTV Networks websites in Europe, Asia, Australia and Latin America to celebrate the album's release.[76] She performed the song on a Today show on October 26, 2010.[77] She sang \"Mine\" and several songs from Speak Now at JetBlue's T5 Terminal at New York's John F. Kennedy International Airport.[78]\n\nOn October 27, 2010, she visited Scholastic Corporation headquarters to talk about the importance of reading and writing and perform the song to a 200 grade-schoolers and middle-schoolers at the publisher's downstairs auditorium.[79] She later performed the song on Live With Regis and Kelly.[80] On November 2, 2010, Swift made an appearance on Dancing with the Stars where she performed \"Mine\" and \"White Horse\" for the show's 200th episode.[81][82] Swift was invited to perform in BBC Radio 1's first Teen Awards in London, where she sang \"Mine\", \"Love Story\" and \"Speak Now\".[83] On November 19, 2010, she performed the song on the Japanese program Music Station.[84] \"Mine\" was the second song on the set list of the Speak Now World Tour (2011–2012).[85]\n\n\"Mine\" was performed as the \"surprise song\" for the concerts in Indianapolis and Saitama during the Red Tour; and on December 8, 2015, Swift dedicated an acoustic performance of the song to 17-year old Rachel Erlandsen, who had died in a car crash before she was able to attend her 1989 World Tour in Brisbane.[86] She also sang \"Mine\" as a \"surprise song\" on the Reputation Stadium Tour in Louisville on June 30, 2018,[87] and on the Eras Tour in Nashville on May 7, 2023. In 2024, Swift performed the track as part of mashups with her songs \"Starlight\" (2012), \"I Can See You\" (2023), and \"I Don't Wanna Live Forever\" (2016), at the respective Singapore (March 2), Liverpool (June 13), and Toronto (November 15) stops of the Eras Tour.[88]\n\nPersonnel [ edit ]\n\nTaylor Swift – vocals, songwriter, producer, acoustic guitar\n\nNathan Chapman – producer, acoustic guitar, electric guitar, banjo, digital piano, piano, synthesizer\n\nBrian Sutton – acoustic guitar\n\nJohn Gardner – drums\n\nNick Buda – drums\n\nShannon Forrest – drums\n\nGrant Mickelson – electric guitar\n\nMike Meadows – electric guitar\n\nPaul Sidoti – electric guitar\n\nRob Hajacos – fiddle\n\nTim Lauer – Hammond B3\n\nAl Wilson – percussion\n\nEric Darken – percussion\n\nTim Lauer – piano\n\nSmith Curry – steel guitar\n\nCharts [ edit ]\n\nCertifications [ edit ]\n\nRelease history [ edit ]\n\nAfter signing a new contract with Republic Records, Swift began re-recording her first six studio albums in November 2020.[130] The decision came after the public 2019 dispute between Swift and talent manager Scooter Braun, who acquired Big Machine Records, including the masters of Swift's albums the label had released.[131][132] By re-recording her catalog, Swift had full ownership of the new masters, including the copyright licensing of her songs, potentially devaluing the Big Machine-owned masters.[133]\n\nA re-recorded version of \"Mine\", titled \"Mine (Taylor's Version)\", was released on July 7, 2023, via Republic Records as part of Speak Now (Taylor's Version), Swift's third re-recorded album.[134] Prior to the album's release, Swift teased a snippet of \"Mine (Taylor's Version)\" via social media on June 24.[135] \"Mine (Taylor's Version)\" retains the original recording's lyrics and country-influenced arrangement, but it is more pop-oriented and has an enhanced production quality with richer vocals.[136] In the re-recorded track, Swift sings without the country twang that existed in the original.[137] The re-recording was recorded in Nashville at Prime Recording Studios and Blackbird Studio, and in London at the Kitty Committee Studio.[138]\n\nPersonnel [ edit ]\n\nAdapted from Speak Now (Taylor's Version) digital album inline notes[138]\n\nCharts [ edit ]\n\nCertifications [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Taylor_Swift_-_Speak_Now_World_Tour_Sydney_2012.jpg/250px-Taylor_Swift_-_Speak_Now_World_Tour_Sydney_2012.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/20px-Symbol_support_vote.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/5/56/Taylor_Swift_-_Mine.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Star_empty.svg/20px-Star_empty.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Star_full.svg/20px-Star_full.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Gnome-mime-sound-openclipart.svg/60px-Gnome-mime-sound-openclipart.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/5/56/Taylor_Swift_-_Mine.png/250px-Taylor_Swift_-_Mine.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/20px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Star_half.svg/20px-Star_half.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/5/56/Taylor_Swift_-_Mine.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Mine_(Taylor_Swift_song)", "title": "Mine (Taylor Swift song)", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/5/56/Taylor_Swift_-_Mine.png", "width": 1200, "height": 1200}, "title": "Mine (Taylor Swift song) - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}