{"url": "https://en.wikipedia.org/wiki/Kathy_Griffin", "text": "American comedian and actress (born 1960)\n\nNot to be confused with Katie Griffin\n\nKathleen Mary Griffin (born November 4, 1960) is an American comedian and actress who has starred in television series, comedy specials and has released multiple comedy albums. In 2007 and 2008, Griffin won Primetime Emmy Awards for her reality show Kathy Griffin: My Life on the D-List. She has also appeared in supporting roles in films.\n\nGriffin was born in Oak Park, Illinois, a suburb of Chicago. In 1978, she moved to Los Angeles, where she studied drama at the Lee Strasberg Theatre and Film Institute and became a member of the improvisational comedy troupe The Groundlings. In the 1990s, Griffin began performing as a stand-up comedian and appeared as a guest star on television shows, and then had a supporting role on the NBC sitcom Suddenly Susan (1996–2000).\n\nThe Bravo reality show Kathy Griffin: My Life on the D-List (2005–2010) became a ratings hit for the network and earned her two Emmy Awards for Outstanding Reality Program. Griffin has released six comedy albums, all of which received Grammy Award nominations. Her first album For Your Consideration (2008) made her the first female comedian to debut at the top of the Billboard Top Comedy Albums chart. In 2009, she released her autobiography Official Book Club Selection: A Memoir According to Kathy Griffin. After being nominated for six years in a row for the Grammy for Best Comedy Album, she won the award in 2014. Griffin has recorded numerous standup comedy specials for HBO and Bravo. For the latter network, she has recorded sixteen television specials, breaking the Guinness World record for the number of aired television specials on any network.[1][2] In 2011, she also became the first comedian to have four specials televised in a year.[3]\n\nGriffin is known for her controversial style and statements about celebrities, religion and sexuality, including holding a mask stylized as Donald Trump's severed head in 2017, which provoked a United States Secret Service investigation and later became the basis of her concert film A Hell of a Story (2019).\n\nEarly life [ edit ]\n\nKathleen Mary Griffin was born on November 4, 1960, in the Chicago suburb Oak Park, Illinois,[4] to first-generation Irish-Americans Margaret Mary Griffin (née Corbally), who was a cashier at a Hospital in Oak Park, and John Patrick Griffin, an employee at a RadioShack.[5][6] She has four older siblings.[6] Griffin grew up Catholic.[7] She described growing up in a \"dysfunctional\" and \"Irish alcoholic\" family.[7][8]\n\nKathy's eldest brother \"Kenny\" (Kenneth John Griffin, December 25, 1942...October 15, 2001) was a pedophile, drug addict and homeless at various times. When Kathy was 7, Kenny, who was 20 years older, sexually abused her and would climb into her bed and whisper into her ears. She did not tell her parents until she was in her 20s, at which point Kenny admitted his pedophilia to them. For many years, Kathy was \"shunned\" by her own family because she tried to get Kenny arrested after learning he had abused other children. She was \"afraid of him until the moment he died\" because of his violent, abusive nature.[9][10][11] \"...two of his girlfriends confessed to me he also physically abused them very violently and I called the LAPD about it twice\"[12]\n\nGriffin described herself during her early years as being \"a kid who needed to talk, all the time\".[6] She would often visit her neighbors to tell them stories about her family; she has referred to those visits as her first live shows where she learned \"the power of juicy material\".[6] After most of her siblings had moved, Griffin developed a binge eating disorder.[13] In her 2009 autobiography Official Book Club Selection, Griffin said she \"still suffers [from food issues]\" but has learned to \"deal with them\".[13]\n\nAt elementary school, Griffin began to develop a dislike for organized religion because of the punishments she and other \"vulnerable\" students received from the nuns.[13] At her high school, she sought refuge in musical theater, playing roles such as Rosemary in How to Succeed in Business Without Really Trying and Hodel in Fiddler on the Roof.[14] During her senior year, she wanted to become a professional actor. Her first appearance on television was as an extra on a Chicago White Sox commercial, and she was signed with several Chicago talent agencies. At 18, Griffin persuaded her parents to move to Los Angeles to help her become famous.[14]\n\nAt 19, Griffin attended a performance by the improvisational group The Groundlings. She said, \"I thought this is where I want to be. This is the greatest thing in the world.\"[15]\n\nCareer [ edit ]\n\nStand-up comedy, television and film [ edit ]\n\nGriffin performing stand up in Las Vegas in 2008\n\nGriffin began performing in the early 1990s in the Los Angeles improvisational comedy troupe The Groundlings.[16] She went on to perform standup comedy and became part of the alternative comedy scene in Los Angeles. With Janeane Garofalo, she created a standup act called \"Hot Cup of Talk\", which became the title of her 1998 solo HBO special.[17] Griffin earned a number of television and film credits during the 1990s. She appeared in Julie Brown's Medusa: Dare to Be Truthful, a Showtime parody of the 1991 Madonna film Truth or Dare. Griffin twice appeared as Susan Klein, a reporter on NBC's The Fresh Prince of Bel-Air; it was her television sitcom debut.[18]\n\nOn June 12, 2008, Griffin hosted the first Bravo! Canada A-List Awards, which included a parody of the \"wardrobe malfunction\" experienced by Janet Jackson in the Super Bowl halftime show in 2004. She also hosted the 2009 Bravo A-List Awards, which aired on April 15, 2009, and her Bravo special Kathy Griffin: She'll Cut a Bitch aired beforehand. Shout! Factory released an extended version of the show on DVD in early 2010.[19]\n\nOn September 8, 2009, Ballantine Books published Griffin's memoir, titled Official Book Club Selection: A Memoir According to Kathy Griffin, which debuted at number one on The New York Times Best Seller list. A week prior, she released her second comedy album Suckin' It for the Holidays; it was her second bid to win a Grammy Award.[20][21] It was announced on November 3, 2009, that Griffin was to host ABC's new show Let's Dance, on which celebrity contestants would have re-enacted famous dance routines while competing for a $250,000 grand prize for their favorite charity.[22]\n\nGriffin hosted CNN's New Year's Eve broadcast on December 31, 2009, along with Anderson Cooper. As Cooper talked about the Balloon boy hoax, Griffin said \"fucking\".[23] Although Griffin was rumored to have been banned from future CNN broadcasts,[24] she co-hosted the show with Cooper until 2017.[25] In 2017, CNN terminated Griffin from its New Year's Eve Broadcast after Griffin showed pictures of herself holding a bloody, model severed head resembling President Donald Trump.[26] Griffin has also guest-starred in a 2009 episode of Law & Order: Special Victims Unit, playing a lesbian activist.[27]\n\nSince the 2008 presidential election, Griffin has made frequent jokes about Republican vice-presidential contender Sarah Palin and her family.[28] On US television program Glee, Griffin parodied Palin posing as a judge at a regional singing competition. Griffin also made fun of Christine O'Donnell in the show by stating, \"Before we start, I would like to say I am not a witch\".[29]\n\nOn January 7, 2012, it was announced that Griffin would host a weekly one-hour talk show on the channel Kathy, which would consist of standup routines, \"rant about pop culture\", and celebrity interviews.[30] On April 8, 2013, during a live standup performance in Cincinnati, Ohio, Griffin announced that her show would not be renewed for a third season. She confirmed it later on her Twitter account. According to FOX 411, Bravo was planning to film several comedy specials starring Griffin after the show ended.[31]\n\nOn June 13, 2014, it was announced that Griffin would host the 41st Daytime Emmy Awards.[32] For the first time in the event's four-decade history, the show bypassed a network television airing for a live online streaming media event.[33] The ceremony took place on June 22, 2014. Griffin's performance was well received by critics.[34]\n\nGuest co-host of The View [ edit ]\n\nKathy Griffin served as a co-host of The View from May 2007 to September 2007, replacing the recently departed Rosie O'Donnell.[35][36] She declined to discuss the ban on Access Hollywood[37] As of August 2009, Griffin had been un-banned from The View and was a guest on September 18, 2009, and June 15, 2010. In an interview on The Talk, Griffin said that she has been re-banned from The View[38] due to an argument with its co-host Elisabeth Hasselbeck.[39]\n\nLaugh Your Head Off World Tour 2017–2018 [ edit ]\n\nIn August 2017, Griffin announced a worldwide comedy tour. The title \"Laugh Your Head Off\" was a reference to her depiction of an effigy of U.S. President Donald Trump's severed head. The tour visited major cities in Singapore, Australia, Germany, Sweden, the United Kingdom, and many more European, and Asian cities. Several shows sold out within minutes of going on sale, leading to Griffin adding several shows to the lineup.[40] She continued with a North America leg of the tour, commencing May 23, 2018, in Ottawa, Ontario and including both Radio City Music Hall and Carnegie Hall in New York City.[41]\n\nControversies [ edit ]\n\nVarious talk shows bans [ edit ]\n\nGriffin said she was banned from appearing on several television shows including The Tonight Show with Jay Leno and The View.[42] She was re-banned from The View after making a joke about Barbara Walters.[43] Griffin made a joke during a 2005 E! televised event saying that eleven-year-old actor Dakota Fanning had entered drug rehabilitation.[44]\n\nEmmy Awards controversy [ edit ]\n\nGriffin, Michael McDonald, and Karri Turner perform an improvisational skit for soldiers and airmen in Tikrit, Iraq in 2006.\n\nThe second season of My Life on the D-List, which premiered June 2006, earned Griffin the 2007 Primetime Emmy for Outstanding Reality Program in non-competition. She received it during the Creative Arts Emmy Awards, which was hosted by Carlos Mencia and aired on E! in September. Griffin said,\n\nNow, a lot of people come up here and thank Jesus for this award. I want you to know that no one had less to do with this award than Jesus. He didn't help me a bit. If it was up to him, Cesar Millan would be up here with that damn dog. So all I can say is suck it, Jesus, this award is my God now![45]\n\nGriffin later said that she meant the remark to be a satire of celebrities who thank Jesus for their awards, especially artists who are controversial in their speech and actions, rather than as a slight on Jesus.[46] The academy said her \"offensive remarks will not be part of the E! telecast on Saturday night\".[47] Griffin said that she was fired from an appearance on Hannah Montana because of her Emmy acceptance speech.[48]\n\nBan from Apollo Theater [ edit ]\n\nIn a July 2009 episode of My Life on the D-List, Griffin used profanity in an Octomom joke during her routine at New York's Apollo Theater. Griffin said that she received a letter banning her from the venue.[49]\n\nDepiction of Donald Trump [ edit ]\n\nOn May 30, 2017, Griffin posted a video of herself holding \"a mask styled to look like the severed, bloody head\" of then U.S. President Donald Trump.[50] It was posted on her Instagram and Twitter accounts. She wrote: \"I caption this 'there was blood coming out of his eyes, blood coming out of his ... wherever'\", referencing a comment Trump had made about Megyn Kelly. The video was from a session with photographer Tyler Shields, who is known for producing \"shocking\" imagery.[51][52] Griffin later took down the image and apologized for posting the image, saying that she went too far and adding, \"I beg for your forgiveness\".[53][54]\n\nOn June 2, 2017, Lisa Bloom, an attorney for Griffin stated, \"Like many edgy works of artistic expression, the photo could be interpreted different ways. But Griffin never imagined that it could be misinterpreted as a threat of violence against Trump. That was never what she intended. She has never threatened or committed an act of violence against anyone.\"[55][56] Griffin said the Trump family was \"trying to ruin my life forever\".[57]\n\nIn May 2017, Griffin was dropped by Squatty Potty as a spokesperson.[58] CNN fired her from its New Year's Eve broadcast with Anderson Cooper.[59] Cooper said, \"For the record, I am appalled by the photo shoot Kathy Griffin took part in. It is clearly disgusting and completely inappropriate.\"[60] All of Griffin's remaining scheduled tour dates were canceled by their venues.[61] During an interview on Australian television in August 2017, Griffin talked about the photo, saying, \"Stop acting like my little picture is more important than talking about the actual atrocities that the president of the United States is committing\".[62] In November 2017, she appeared on Skavlan where she said, \"I take that apology back by the way. I take it back big time\". He said she had received a lot of bad advice at the time.[63]\n\nOn October 28, 2017, Griffin uploaded a YouTube video titled \"Kathy Griffin: A Hell of a Story\", which is about the backlash she received for the Trump photo controversy.[64] It was the basis for her A Hell of a Story concert film. She said she was under a federal investigation by the Justice Department for two months and was on the No Fly List during that time. She also said that she was put on the Interpol list which is the Five Eyes list; she said that she had been detained at every airport during her Laugh Your Head Off World Tour.[65][66]\n\nOn November 4, 2020 (her 60th birthday and the day after the 2020 United States presidential election), Griffin once again posted a photo of herself with a model of Donald Trump's bloody, severed head.\n\nTwitter suspension [ edit ]\n\nOn November 6, 2022, Griffin was suspended from Twitter for impersonating Elon Musk. Griffin used his profile photo and changed her name on the service, tweeting under his name imploring people to vote for Democrats in the upcoming midterm elections and encouraging them to retweet and spread her post. She also posted that she, posing as Musk, had decided to vote blue to support women's rights. Musk tweeted the same day that anyone impersonating a public figure would be permanently suspended unless the account was clearly marked as parody. On the next day, Griffin posted on her deceased mother's Twitter account, calling Musk an \"asshole\". She further challenged the site's policy that she had used her Twitter profile for impersonation.[69] Musk tweeted sardonically in reply to another tweet, \"Actually she was suspended for impersonating a comedian.\"[70] On November 18, Elon Musk announced that her account has been reinstated due to new rules concerning \"negative/hate tweets\".[71]\n\nStyle of humor [ edit ]\n\nGriffin at the VH1 Divas Awards in 2009\n\nGriffin developed her love of popular culture through her immediate and extended family, who were frequently commenting about the latest news. She said; \"I may have been into The Brady Bunch like every other kid, but I also wanted to watch John Lennon and Yoko Ono on The Dick Cavett Show, and every minute of the Watergate hearings. It was fear of the dinner table that got me hooked.\"[72] She has also named her mother Maggie as influential in her consumption of pop culture, calling her \"the ideal audience for the Hollywood dish\". Griffin named the character Rhoda Morgenstern of 1970s sitcom The Mary Tyler Moore Show as an influence.[73]\n\nGriffin established her career with candid observations of everyday life and her dating experiences, later focusing on mocking celebrities; her act currently consists of embellished stories involving celebrities. Griffin hopes people understand that no malice is intended by her humor. \"I'm genuinely a fan of most of the people I trash in the act\", she said; \"I really, really try and focus on making fun of people for their behavior. I'm not so into making fun of someone for the way they look, or something that's out of their control.\"[74]\n\nGriffin is sometimes the object of her own humor, particularly with regard to her D-list status. She portrays herself as a Hollywood outsider and has a group of close celebrity friends such as Rosie O'Donnell, Joan Rivers, Jerry Seinfeld, Gloria Estefan, and Lance Bass. Her longtime friendship with Bass was the catalyst for a feud between Griffin and gossip blogger Perez Hilton.[75][76]\n\nIn 2007, Griffin commented on her aversion to making fun of celebrity friends; \"There's nothing I won't do, but on the other hand I'm full of shit because that changes\".[77] Griffin and Hilton ended their feud after the death of Griffin's father, and Hilton appeared on an episode of Griffin's show in 2007.[76]\n\nLGBT rights and political advocacy [ edit ]\n\nGriffin arriving at the rally to Repeal \"Don't Ask, Don't Tell\" (Freedom Plaza, Washington, D.C.)\n\nGriffin is a supporter for LGBT rights including same-sex marriage.[78][79] She has protested with fellow proponents in West Hollywood, California[80] and included the footage from protests on her reality show Kathy Griffin: My Life on the D-List. Her mother was also a supporter of LGBT rights during her lifetime. She was often seen on the same television shows protesting alongside her daughter. Prior to the Proposition 8 ballot results, Griffin volunteered for the Los Angeles Gay and Lesbian Center's \"Vote for Equality\" campaign, going door-to-door asking Los Angeles residents for their opinion of LGBT marriage rights.[81]\n\nIn March 2010, Griffin helped organize a rally in Washington, D.C., to advocate the repeal of \"Don't ask, don't tell\". She said that she organized the rally after meeting with several closeted gay people serving in Iraq and Afghanistan. Griffin held meetings with several Members of Congress to encourage its repeal; she also organized a rally in Freedom Plaza.[82]\n\nGriffin caused controversy when she confronted Republican Congresswoman Michele Bachmann over her views on homosexuality at the 2010 Radio and Television Correspondents' Association Dinner; according to Griffin, she asked Bachmann \"were you born a bigot or did you grow into it\", a reference to Bachmann's belief that homosexuality is strictly environmental.[83] Griffin said Bachmann replied, \"That's a good question, I'll have to think about that\". Bachmann's office confirmed the exchange but said Griffin confronted Bachmann after Bachmann approached Griffin to compliment her appearance.[84][85]\n\nGriffin is a long-time supporter of the Aid for AIDS annual fundraiser Best in Drag Show in Los Angeles, and hosted the opening of the show for more than five years.[86] In November 2009, Aid For AIDS presented Kathy Griffin with an AFA Angel Award at their silver anniversary celebration.[86][87]\n\nGriffin is a long-time critic of Sarah Palin and has made fun of Palin's daughter, Bristol Palin, using the Palin family as material for her comedy routines.[88] In March 2011, Sarah Palin responded to Griffin by calling her a \"bully\".[89] In her reality television show, Griffin visited the Palin family home in Wasilla, Alaska, and invited Palin to attend her stand-up show in Anchorage, Alaska.[90] Griffin has also poked fun at Willow Palin as a result of Palin's Facebook statements on homosexuality.[91]\n\nIn 2020, Griffin hosted the Str8Up Gay Porn Awards.[92]\n\nShe was named the 2025 Advocate of the Year by the magazine The Advocate; an article in the magazine about this stated, \"The Advocate is highlighting her bold activism and utterly unique humor by selecting her as our 2025 Advocate of the Year.\"[93]\n\nPersonal life [ edit ]\n\nIn a 2006 interview, Griffin said she does not drink alcohol in spite of growing up in a family where she was surrounded by “lots” of alcoholism. She said, “I still think that if I would've taken a drink, I think I would have become an alcoholic very quickly.” By June 2020, Griffin developed an addiction to prescription drugs.[94][95]\n\nGriffin's estranged eldest brother, Kenny, died from a drug overdose in October 2001.[9] Her brother Gary died of esophageal cancer in 2014.[96] Her sister, Joyce Patricia Griffin, died in September 2017 from an undisclosed form of cancer.[96] Kathy had shaved her head in solidarity with her in late July.[96]\n\nHer father, John Patrick Griffin, died of heart failure in 2007.[97] Her mother, Maggie, died on March 17, 2020.[97][98] In a post on her social media accounts, Griffin said, \"I am gutted. My best friend. I am shaking. I won't ever be prepared. I'm so grateful you guys got to be part of her life. You knew her. You loved her. She knew it. Oh, and OF COURSE she went on St. Patrick's Day.\"[99]\n\nIn 1999, Griffin nearly died during a liposuction procedure in Los Angeles. She has undergone multiple plastic surgeries including breast augmentation and a nose job.[100]\n\nShe placed 17th on Oxygen's 2007 list of \"The 50 Funniest Women Alive\". In 2009, a Golden Palm Star on the Palm Springs, California, Walk of Stars was dedicated to her.[101]\n\nGriffin is an atheist. Speaking to Sacramento's Outword Magazine, Griffin said: \"I think I'm getting more atheist because of the way the country is getting more into bible-thumping\".[102] In her book Official Book Club Selection: A Memoir According to Kathy Griffin, Griffin said that while in high school, she fell away from Catholicism. She considered becoming a Unitarian but was not sure what that would involve. In 2008, Griffin became an ordained minister with the Universal Life Church to officiate at the wedding of two fans.[103]\n\nShe is an opponent of LASIK eye surgery, having had a series of operations that left her partially blind in one eye with a visible eyeball deformity.[104]\n\nIn August 2021, she announced that she had been diagnosed with lung cancer although she is not a smoker, and needed to have half of her left lung removed.[105] She underwent surgery the same month.[106]\n\nIn April 2023, Griffin revealed she was diagnosed with an \"extreme case\" of complex post-traumatic stress disorder.[107]\n\nGriffin lived in the Hollywood Hills from 2004 to 2016.[108] Since then, she has resided in Bel Air.[108]\n\nMarriages and relationships [ edit ]\n\nKathy Griffin with her then-boyfriend Steve Wozniak in April 2008\n\nGriffin married computer administrator Matt Moline in 2001, after being introduced by Moline's sister, television producer Rebecca Moline.[109] They divorced in May 2006.[110] On Larry King Live, Griffin accused Moline of stealing $72,000 from her; Moline did not respond to the allegation publicly but said that he was saddened by it.[111][112]\n\nIn July 2007, rumors that Griffin was dating Apple co-founder Steve Wozniak circulated.[113] Griffin and Wozniak attended the 2007 Emmy Awards together.[114] On Tom Green's House Tonight on February 6, 2008, Griffin confirmed her relationship with Wozniak. Wozniak and Griffin served as King and Queen of the Humane Society of Silicon Valley Fur Ball on April 5, 2008, in Santa Clara, California.[115] In June 2008, it was confirmed that Griffin and Wozniak were no longer dating.[116]\n\nOn August 9, 2009, Griffin attended the Teen Choice Awards with Levi Johnston[117] and then interviewed him on Larry King Live. In the interview, Griffin and Johnston joked that they were in a serious relationship.[118]\n\nOn March 7, 2011, while appearing on The Howard Stern Show, Griffin announced that she was romantically involved with actor and former NFL practice-squad player Isaiah Mustafa. He later said that he was single.[119]\n\nIn the same interview, she said that the previous July, she had ended a four-year relationship with a man she did not identify but said he is \"a regular guy with a regular job\", and that it was a \"messy breakup\".[120] It was later revealed that the man is Griffin's tour manager, who had appeared on several seasons of My Life on the D List.[121]\n\nFrom 2012 until November 2018, Griffin was in a relationship with marketing executive Randy Bick. They also reconciled in April 2019.[122] Griffin married Bick at her home on January 1, 2020, in a ceremony officiated by comedian Lily Tomlin.[123] On December 29, 2023, Griffin filed for divorce from Bick, citing irreconcilable differences.[124] The divorce was finalized on January 13, 2025.[125]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nOther [ edit ]\n\nYear Film Role Notes 1980s In Search of the Missing Numbers Negative Number Educational mathematics video 1980s Math Rock Countdown Member of the trio The Products Educational mathematics video\n\nStand-up specials [ edit ]\n\nDiscography [ edit ]\n\nOn June 10, 2008, Griffin released a comedy CD titled For Your Consideration.[138] The disc was recorded at the ETK Theatre at the Grand Theatre Center For The Arts in Tracy, California on February 17, 2008.[139] Griffin stated she decided to release the CD to try to win a Grammy award.[139]\n\nOn August 25, 2009, Griffin released a second comedy album, Suckin' It for the Holidays, in another bid for a Grammy.[140]\n\nGriffin received her third Grammy nomination for Kathy Griffin: Does the Bible Belt in 2010,.[141]\n\nOn May 4, 2012, the full length version of \"I'll Say It\", the theme song of her show Kathy, was released to iTunes as a single.[142] On August 20, 2012, Griffin released a seven-track EP containing dance remixes of \"I'll Say It\".[143]\n\nHer fourth and fifth albums are 50 and Not Pregnant (2011) and Seaman 1st Class (2012) respectively.\n\nCalm Down Gurrl (2013), her sixth album, won the Grammy for Best Comedy Album at the 56th Grammy Awards.\n\nLook at My Butt Crack is her seventh album, it was recorded in Las Vegas and released in 2014.\n\nBibliography [ edit ]\n\nAwards and nominations [ edit ]\n\nPrimetime Emmy Awards\n\nEmmy Awards source:[144]\n\nYear Nominee / work Award Result 2006 Kathy Griffin: My Life on the D-List Primetime Emmy Award for Outstanding Reality Program Nominated 2007 Kathy Griffin: My Life on the D-List Primetime Emmy Award for Outstanding Reality Program Won 2008 Kathy Griffin: My Life on the D-List Primetime Emmy Award for Outstanding Reality Program Won 2008 Kathy Griffin: Straight to Hell Primetime Emmy Award for Outstanding Variety, Music, or Comedy Special Nominated 2009 Kathy Griffin: My Life on the D-List Primetime Emmy Award for Outstanding Reality Program Nominated 2009 Kathy Griffin: She'll Cut A Bitch Primetime Emmy Award for Outstanding Variety, Music, or Comedy Special Nominated 2010 Kathy Griffin: My Life on the D-List Primetime Emmy Award for Outstanding Reality Program Nominated 2011 Kathy Griffin: My Life on the D-List Primetime Emmy Award for Outstanding Reality Program Nominated 2012 Kathy Griffin: Tired Hooker Primetime Emmy Award for Outstanding Variety, Music, or Comedy Special Nominated\n\nGrammy Awards\n\nGrammy Awards source:[145]\n\nGLAAD Media Awards\n\nYear Nominee / work Award Result 2009 [ 148 ] Kathy Griffin Vanguard Award Won\n\nPGA Awards\n\nYear Nominee / work Award Result 2008 Kathy Griffin: My Life on the D-List Television Producer of the Year Award in Non-Fiction Television Nominated 2009 Nominated 2010 Nominated\n\nGracie Awards\n\nYear Nominee / work Award Result 2009 Kathy Griffin: My Life on the D-List Outstanding Female Lead – Comedy Series Won\n\nOther\n\nYear Nominee / work Award Result 2025 [ 93 ] Advocate of the Year from the magazine The Advocate Won\n\nReferences [ edit ]\n\nCitations [ edit ]\n\nBibliography [ edit ]\n\nGriffin, Kathy (2010). Official Book Club Selection: A Memoir According to Kathy Griffin (paperback ed.). Ballantine Books. ISBN 978-0-345-51856-9 .\n\nOfficial website", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b7/Pending-protection-shackle.svg/20px-Pending-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Unbalanced_scales.svg/60px-Unbalanced_scales.svg.png", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Defense.gov_photo_essay_080403-D-8901Q-004.jpg/250px-Defense.gov_photo_essay_080403-D-8901Q-004.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Kathy_and_Woz_%282400485190%29_%28cropped2%29.jpg/250px-Kathy_and_Woz_%282400485190%29_%28cropped2%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Griffin_Turner_McDonald.jpg/250px-Griffin_Turner_McDonald.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/40px-Wikiquote-logo.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Kathy_Griffin_2009_VH1_Divas_2.jpg/250px-Kathy_Griffin_2009_VH1_Divas_2.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/KathyGriffin.png/250px-KathyGriffin.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Kathy_Griffin_%40_SXSW_2019_%2840387773813%29.jpg/1200px-Kathy_Griffin_%40_SXSW_2019_%2840387773813%29.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Dadt.JPG/250px-Dadt.JPG", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Kathy_Griffin_%40_SXSW_2019_%2840387773813%29.jpg/250px-Kathy_Griffin_%40_SXSW_2019_%2840387773813%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/KathyGriffinTIFFSept2011.jpg/250px-KathyGriffinTIFFSept2011.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Kathy_Griffin_%40_SXSW_2019_%2840387773813%29.jpg/1200px-Kathy_Griffin_%40_SXSW_2019_%2840387773813%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Kathy_Griffin", "title": "Kathy Griffin", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.3", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Kathy_Griffin_%40_SXSW_2019_%2840387773813%29.jpg/1200px-Kathy_Griffin_%40_SXSW_2019_%2840387773813%29.jpg", "width": 1200, "height": 800}, "title": "Kathy Griffin - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}