{"url": "https://en.wikipedia.org/wiki/Zara_Tindall", "text": "British equestrian (born 1981)\n\n\"Zara Phillips\" redirects here. Not to be confused with the singer of the same name, the third wife of Richard Thompson (musician)\n\nZara Anne Elizabeth Tindall (née Phillips; born 15 May 1981) is a British equestrian, Olympian, socialite, and member of the British royal family. She is the daughter of Anne, Princess Royal and Captain Mark Phillips, and the eldest niece of King Charles III. Born sixth in the line of succession to the British throne during the reign of her maternal grandmother, Queen Elizabeth II, she is 22nd in line as of 2025.\n\nZara won the Eventing World Championship in Aachen in 2006 and was voted BBC Sports Personality of the Year that same year. In 2012, she carried the Olympic flame at Cheltenham Racecourse on her horse Toytown. As a member of the Great Britain Eventing Team, she won a silver medal at the 2012 Summer Olympics, which was presented to her by her mother.\n\nIn 2011, she married rugby union player Mike Tindall. The couple have three children.\n\nEarly life and education [ edit ]\n\nZara Anne Elizabeth Phillips was born on 15 May 1981 in the Lindo Wing of St Mary's Hospital, London. She was baptised on 27 July 1981, at Windsor Castle. Her first name was suggested by her uncle, Charles, the then Prince of Wales.[1] Her godparents are her maternal uncle, Andrew Mountbatten Windsor; the Countess of Lichfield; Helen, Lady Stewart, the wife of Sir Jackie Stewart; Andrew Parker Bowles; and Hugh Thomas.[2] She has an elder brother, Peter, and two younger half-sisters, Felicity Wade (née Tonkin;[3] from her father's affair with Heather Tonkin) and Stephanie Phillips, from her father's second marriage to Sandy Pflueger.[4]\n\nPhillips attended Beaudesert Park School in Stroud, Gloucestershire, and Port Regis School in Shaftesbury, Dorset, before following other members of the royal family in attending Gordonstoun School in Moray, Scotland. During her schooldays, Phillips excelled at many sporting activities, representing her schools in hockey, athletics, and gymnastics. She later studied at the University of Exeter and qualified as a physiotherapist.[5][6]\n\nEquestrianism [ edit ]\n\nAfter university, Phillips began to pursue an equestrian career, in the footsteps of her parents. In June 2003, she announced that she had secured a sponsorship deal with Cantor Index, a leading company in spread betting, to help cover the costs of her equestrian career.[7] She finished as runner-up at Burghley Horse Trials in 2003 in her first four-star event.[8] Tindall missed the 2004 Summer Olympics in Athens after her horse suffered an injury during training.[9]\n\nRiding her horse Toytown, Tindall collected individual and team gold medals at the 2005 European Eventing Championship in Blenheim,[10] and individual gold and team silver medals at the 2006 FEI World Equestrian Games in Aachen, Germany, making her the Eventing World Champion until 2010.[11][12] The same year, after her win in Germany, she was voted BBC Sports Personality of the Year by the British viewing public, an award her mother had won in 1971.[11] She was also appointed Member of the Order of the British Empire (MBE) in the 2007 New Year Honours for her services to equestrianism.[13] She won team gold at the 2007 European Eventing Championships in Italy, but did not defend her individual title in the show-jumping phase of the competition.[14]\n\nTindall competing at the 2012 Summer Olympics in London\n\nThe British Olympic Association announced that Tindall would ride Toytown for the British equestrian team at the Beijing Olympic Games 2008 in Hong Kong;[15] however, Toytown was injured during training and she was forced to withdraw from the team.[16] On 25 October 2008, Tindall fell from her horse, Tsunami II, at the 15th fence of a cross-country event at Pau, France, and broke her right collarbone. The horse broke her neck after she tipped over the hedge and was put down.[17] In July 2010 a range of equestrian clothing Tindall designed for Musto Outdoor Clothing, named ZP176 after Tindall's team number when she first represented her country, was launched.[18][19][20]\n\nZara competed in the 2012 London Olympic Games on High Kingdom, and won a silver medal in the team event.[21] Tindall finished second at Luhmühlen Horse Trials 2013, on her top horse High Kingdom.[22] At the World Equestrian Games in 2014, Tindall and High Kingdom were part of the British team that won team silver.[23] Tindall stopped using her maiden name, Phillips, in March 2016. She competed for the first time as Zara Tindall during her unsuccessful attempt to qualify for the 2016 Rio Olympic Games.[24]\n\nIn 2017, she won the third place at the Kentucky Three-Day Event on High Kingdom, before High Kingdom retired from the sport in 2018.[25][26] In January 2020 she became a non-executive director of the Cheltenham Racecourse.[27] In August 2020, Tindall was selected for her first appearance on the British Team competing at the FEI Nations Cup in Le Pin au Haras, France.[28] In October 2021, Tindall competed in Maryland 5 Star at Fair Hill and finished at 11th place with score 30.4, riding Gleadhill House Stud's 12-year-old horse Class Affair.[29] In May 2022, Tindall won the advanced class at the Chatsworth Horse Trials, riding Class Affair.[30]\n\nCharity work [ edit ]\n\nTindall frequently supports and attends events for various charitable causes, mainly revolving around spinal injuries, equestrianism, and children's causes. In 2005, she auctioned one of her evening gowns, worn at the London premiere of the film Seabiscuit, to raise money for tsunami relief. She also undertook a visit to New Zealand in her role as patron of The Catwalk Trust.[31][32] From 1998 to 2005, she served as the president of Club 16–24, a group which encourages young people to take an interest in horse racing.[33] She is associated with Inspire, a Salisbury-based medical research charity which helps to improve the quality of life of people with spinal cord injuries. She is patron of Lucy Air Ambulance for Children,[34] which is the UK's first dedicated air transfer service to fly critically ill infants and children to hospitals for urgent care.\n\nTindall has appeared at events for The Caudwell Charitable Trust, which targets children with special needs, disabilities and serious illnesses.[35] In 2006, she took part in a special charity day for Cantor Index, 658 of whose staff were killed in the 11 September 2001 attacks. In 2007, she became patron of the Mark Davies Injured Riders Fund.[36] To help with Sport Relief 2008 she posed for a portrait by artist Jack Vettriano.[37] In 2009, she attended a celebrity poker tournament in Monaco in aid of Darfur, Sudan.[38] In October 2010, she attended a celebrity poker tournament in London, in aid of Cancer Research UK, of which she is patron. In 2011, she auctioned another evening gown in aide of the Christchurch earthquake appeal, raising £22,000. In 2013, she visited the Stroud Maternity Ward to celebrate their 60th anniversary. In 2014, Tindall lent her support to the #bringbackourgirls campaign.[39] In April 2020, Tindall participated in an Equestrian Relief initiative to provide increased personal protective equipment for National Health Service workers.[40]\n\nOther activities [ edit ]\n\nIn June 2015, Tindall launched an equestrian-themed jewellery collection, named \"Zara Phillips Collection\", in collaboration with Australian designer John Calleija.[41] On 17 September 2022, during the period of official mourning for Queen Elizabeth II, Tindall joined her brother and six cousins to mount a 15-minute vigil around the coffin of the Queen, as it lay in state at Westminster Hall.[42] On 19 September, with her husband Mike and daughter Mia, she joined other family members at the state funeral.[43]\n\nPersonal life [ edit ]\n\nTindall with her husband in 2012\n\nZara Phillips met rugby union player Mike Tindall, who was playing for the England national team, during their Rugby World Cup-winning campaign in Australia in 2003. They became engaged in 2010.[44] As was at that time required by the Royal Marriages Act 1772, the Queen gave her consent to the marriage in a meeting of the Privy Council on 10 May 2011.[45] The couple held a celebration on the royal yacht Britannia prior to the wedding.[46]\n\nThey married on 30 July 2011 at the Canongate Kirk in Edinburgh, Scotland, with 400 guests in attendance.[46][47] Her off-the-rack ivory silk dress designed by Stewart Parvin featured \"a chevron-pleated bodice, a dropped waist, and a 'cathedral-length' train\".[48][49] The Meander Tiara was lent to her and secured the veil.[50] A reception was held at Holyrood Palace following the service.[46][51]\n\nThe Tindalls lived in Cheltenham, Gloucestershire, before moving to Aston Farm, a seven-bedroom farmhouse next to the Princess Royal's Gatcombe Park estate.[52][53] Tindall gave birth to a daughter, Mia Grace on 17 January 2014 at Gloucestershire Royal Hospital, who was born 16th, later 23rd in the line of succession.[54] Tindall's next two pregnancies ended in miscarriage.[55] Their second daughter, Lena Elizabeth was born on 18 June 2018 at the Stroud Maternity Hospital, and was born 19th, later 24th in the line of succession.[56][57] Their third child, son Lucas Philip, was born on 21 March 2021 at the family home in Gatcombe Park, and was born 22nd, later 25th in the line of succession.[58] Tindall is godmother to Prince George of Wales, the son of her cousin William, Prince of Wales.[59]\n\nIn December 2000, Tindall was involved in a serious car crash near Bourton-on-the-Water, escaping serious injury after overturning her Land Rover.[7] In January 2020, she was banned from driving for six months after accumulating 12 points on her driving licence. It was also announced that the court was fining her \"£666 plus costs and a victim surcharge of £151\".[60]\n\nArms [ edit ]\n\nCoat of arms of Zara Tindall Notes Tindall bears her father's arms on a lozenge. She is also entitled to use the coronet of a female-line grandchild of the sovereign. [ 61 ] Coronet Tindall is entitled to use the coronet of a female-line grandchild of the sovereign. [ 62 ] Escutcheon Per chevron Azure and Or, in chief a Horse courant Argent, and in base a Sprig of Forget-me-not Flowers, slipped and leaved Proper Orders Member of the Most Excellent Order of the British Empire\n\nHonours [ edit ]\n\nReferences [ edit ]\n\n\n\n", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Flag_of_Switzerland_%28Pantone%29.svg/20px-Flag_of_Switzerland_%28Pantone%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Olympic_rings_without_rims.svg/120px-Olympic_rings_without_rims.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Blue_pencil.svg/20px-Blue_pencil.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Silver_medal_icon_%28S_initial%29.svg/16px-Silver_medal_icon_%28S_initial%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Zara_Phillips_High_Kingdom_cross_country_Olympics_2012.jpg/250px-Zara_Phillips_High_Kingdom_cross_country_Olympics_2012.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Flag_of_France.svg/40px-Flag_of_France.svg.png", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Order_of_the_British_Empire_%28Civil%29_Ribbon.svg/60px-Order_of_the_British_Empire_%28Civil%29_Ribbon.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Zara_Phillips_cropped_but_without_a_crop.jpg/250px-Zara_Phillips_cropped_but_without_a_crop.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/The_All-New_Range_Rover_-_Global_Reveal_%287955215290%29_%281%29.jpg/250px-The_All-New_Range_Rover_-_Global_Reveal_%287955215290%29_%281%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/40px-Flag_of_the_United_Kingdom.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/12/Flag_of_Poland.svg/40px-Flag_of_Poland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Gold_medal_icon_%28G_initial%29.svg/16px-Gold_medal_icon_%28G_initial%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Flag_of_the_Soviet_Union.svg/40px-Flag_of_the_Soviet_Union.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Zara_Phillips_cropped_but_without_a_crop.jpg/960px-Zara_Phillips_cropped_but_without_a_crop.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4c/Flag_of_Sweden.svg/40px-Flag_of_Sweden.svg.png", "https://upload.wikimedia.org/wikipedia/commons/e/ef/Coat_of_Arms_of_Mrs._Zara_Tindall_MBE.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Flag_of_Denmark.svg/20px-Flag_of_Denmark.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Flag_of_Ireland.svg/40px-Flag_of_Ireland.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/ba/Flag_of_Germany.svg/40px-Flag_of_Germany.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Zara_Phillips_cropped_but_without_a_crop.jpg/960px-Zara_Phillips_cropped_but_without_a_crop.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Zara_Tindall", "title": "Zara Tindall", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Zara_Phillips_cropped_but_without_a_crop.jpg/960px-Zara_Phillips_cropped_but_without_a_crop.jpg", "width": 785, "height": 1200}, "title": "Zara Tindall - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}