{"url": "https://www.thehollywoodgossip.com/2017/10/dr-phil-sued-for-car-accident-involving-skateboarder/", "text": "Reading Time: 3 minutes\n\nIt looks like talk show host and walrus-American Dr. Phil may have made a mistake. And no, we don’t just mean catapulting Danielle Bregoli to fame and millions.\n\nNo – Dr. Phil was involved in a traffic accident. And the skateboarder he hit might be in for a serious payday. But … it’s complicated.\n\n(Getty)\n\nWith the possible exception of a few midwestern grandmas, we don’t think that anyone actually thinks that Dr. Phil is infallible.\n\n… Or the sort of expert to whom you should be listening about the most important things in your life, honestly.\n\nHe’s just a guy whom some people find charming and folksy and he makes for good television.\n\nLike, one of the statements from his show that’s highlighted on his Instagram page is “Parenting is both a noun and a verb.”\n\n… Yes.\n\nThat is literally how language works. (When a progressive verb is working as a noun, it’s called a gerund)\n\nBut passing that off as something with profound meaning is more than a little goofy.\n\nSo … you’re probably wondering what Dr. Phil did wrong.\n\nThe short version? Dr. Phil reportedly hit a guy with his car.\n\nAccording to TMZ, who broke the story, Dr. Phil’s car accident happened when the TV star was emerging from a Universal City parking lot.\n\nThis was on Friday.\n\nApparently, Dr. Phil made an impatient attempt to pass a van, and ended up hitting Terrence Bembury — a 20-something skateboarder and bodybuilder.\n\nNow, getting hit by a car is most people’s nightmare.\n\nGetting hit by a car driven by a guy worth an estimated $400 million … well, if you’re okay afterwards, that’s the stuff that dreams are made of, right?\n\nThere are a couple of versions of how this went down.\n\nOne version, the police account (though it looks like no officers were actual witnesses to the collision), says that Terrence Bembury shook hands with Dr. Phil and told him that he was fine.\n\n(Pro-tip: never tell people that you’re fine; an impact from even a slow-moving car can cause injuries that you might not notice right away. Sometimes, those injuries can be very serious. Also, never tell the other person “sorry,” even if you do feel sorry, as that can be used against you as an admission of fault)\n\nTerrence Bembury now paints a different picture, posting about being injured.\n\nRight now, we don’t know whether he was genuinely injured or whether he suddenly realized that he’d have to be out of his mind to not get any cash out of Dr. Phil.\n\nWhile Terrence might not benefit from the multiple versions of events, as police say that he had earlier been singing the same tune as Dr. Phil and only later changed his story, he says that he’s securing a lawyer.\n\nAnd, honestly, police have reviewed traffic footage and say that Dr. Phil was in the wrong.\n\nIf Terrance was actually injured, it sounds like he might have a real case.\n\nWe have mixed feelings about this.\n\nOn the one hand, if Terrance was injured in the slightest, you’d think that Dr. Phil would be culpable for it.\n\nOn the other hand, we’ve never understood why skateboarders (or bicycles!) are allowed on streets. If we have to humor people who insist upon riding that awful middle-ground between walking and cars, maybe they should have their own lanes, right?\n\nAnd then there’s the possibility — though we’re not accusing him of anything — that Terrence is taking advantage of this situation for cash.\n\nBut … we think that most people would, right?\n\nTerrence certainly didn’t seek out this situation (no one has accused Terrence of being a mastermind schemer who somehow arranged for this to happen or anything), and it’s hard to blame him for trying to make the best out of a bad situation.\n\nDr. Phil might feel differently, though.\n\nBut do you know what’s the weirdest about this case?\n\nWith all of his money, it sounds like Dr. Phil drives himself home from work.", "images": ["https://cdn.thehollywoodgossip.com/uploads/2025/11/282b9db9-f970-47ab-aa86-b5db88e06692_1763082694-80x80.avif", "https://cdn.thehollywoodgossip.com/uploads/2018/12/cards-and-off-150x150.jpg", "https://cdn.thehollywoodgossip.com/uploads/2025/11/1114_christinaricci_header-80x80.jpg", "https://cdn.thehollywoodgossip.com/uploads/2025/11/GettyImages-1252373567-80x80.jpg", "https://cdn.thehollywoodgossip.com/uploads/2022/02/thg-logo.png", "https://cdn.thehollywoodgossip.com/uploads/2025/10/1017_haileesteinfeld_header-80x80.jpg", "http://cdn.thehollywoodgossip.com/uploads/2016/11/phil-mcgraw-sucks-684x1024.jpg", "https://cdn.thehollywoodgossip.com/uploads/2025/11/RHOC-80x80.jpg", "https://cdn.thehollywoodgossip.com/uploads/2025/11/GettyImages-2225798881-2-80x80.jpg", "https://cdn.thehollywoodgossip.com/uploads/2025/07/0708_sophieturner_header-80x80.jpg", "https://cdn.thehollywoodgossip.com/uploads/2016/12/ooh-la-la-kent-320x240.jpg"], "top_img": "http://cdn.thehollywoodgossip.com/uploads/2016/11/phil-mcgraw-sucks-684x1024.jpg", "keywords": [], "authors": ["Simon Delott"], "canonical_link": "https://www.thehollywoodgossip.com/2017/10/dr-phil-sued-for-car-accident-involving-skateboarder/", "title": "Dr. Phil Runs Into Skateboarding Bodybuilder With Car", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Dr. Phil Runs Into Skateboarding Bodybuilder With Car", "description": "It looks like talk show host and walrus-American Dr. Phil may have made a mistake. And no, we don't just mean catapulting Danielle Bregoli to fame and millions.", "url": "https://www.thehollywoodgossip.com/2017/10/dr-phil-sued-for-car-accident-involving-skateboarder/", "site_name": "The Hollywood Gossip", "updated_time": "2022-04-25T19:58:49+00:00", "image": {"identifier": "http://cdn.thehollywoodgossip.com/uploads/2016/11/phil-mcgraw-sucks-684x1024.jpg", "width": 684, "height": 1024, "type": "image/jpeg"}, "article": {"published_time": "2017-10-24 15:23:43", "modified_time": "2022-04-25 19:58:49"}}, "article": {"published_time": "2017-10-24T15:23:43+00:00", "modified_time": "2022-04-25T19:58:49+00:00"}, "twitter": {"card": "summary", "title": "Dr. Phil Runs Into Skateboarding Bodybuilder With Car", "description": "It looks like talk show host and walrus-American Dr. Phil may have made a mistake. And no, we don't just mean catapulting Danielle Bregoli to fame and millions.", "image": "http://cdn.thehollywoodgossip.com/uploads/2016/11/phil-mcgraw-sucks-684x1024.jpg", "label1": "Written by", "data1": "Simon Delott", "label2": "Est. reading time", "data2": "3 minutes"}, "author": "Simon Delott", "generator": "WordPress 6.8.3", "theme-color": "#000000", "msapplication-TileImage": "https://cdn.thehollywoodgossip.com/uploads/2024/07/cropped-THG-LOGO-270x270.jpg"}, "movies": [], "publish_date": 1508858623.0, "source": "https://www.thehollywoodgossip.com", "summary": ""}