{"url": "https://www.vox.com/fall-tv/2017/9/29/16360962/will-and-grace-history-controversy", "text": "wrote about culture, which usually means television. Also seen @ The A.V. Club, The Atlantic, Complex, Flavorwire, NPR, the fridge to get more seltzer.\n\nNineteen years ago, a gay man and his straight female friend moved in together and changed television for ... well, better or for worse, depending on who you ask.\n\nNBC’s farcical sitcom Will & Grace debuted in 1998, at a time when gay characters were barely represented on TV. Its central couple wasn’t a will-they won’t-they romance, but a fiercely close friendship between gay lawyer Will (Eric McCormack) and his straight best friend Grace (Debra Messing). It even dared to include yet another gay man as a lead character in Sean Hayes’s melodramatic Jack (Sean Hayes). Meanwhile, Megan Mullally’s boozy Karen, the kept wife of an unseen husband, eventually revealed that she cared less about the gender of the people she slept with than what they could do for her — but her primary role on the show was to pop pills, make off color jokes, and keep things weird.\n\nWill & Grace would run for eight seasons, ending in 2006 as LGBTQ representation in media slowly but surely started to change. But from the very moment it premiered, the series has been both lauded as revolutionary and dismissed as an instant relic. It’s been credited with shifting a nation’s consciousness toward greater tolerance of gay people, as Joe Biden said in 2012 when coming out in support of gay marriage, and condemned for perpetuating tired stereotypes, as some critics have been saying for years.\n\nEither way, the show was a hit for the better part of a decade, drawing an overall average of 14 and a half million viewers per episode throughout its run. And now, 11 years after its initial series finale, Will & Grace has returned to the air for a super hyped revival, which premiered on September 28 after an equally nostalgic and enthusiastic promotional tour.\n\nNBC is apparently so thrilled to have the show back — not least because of its stellar main cast, who are all reprising their original roles — that the network ordered two full seasons months before the revival premiered (season one has a 16-episode order, while the second is slated for 13). And in the leadup to its launch, both NBC and creators David Kohan and Max Mutchnick repeatedly promised Will & Grace’s longtime fans that the new show would be identical in spirit to its original flavor.\n\nThey said it so often, however, that their soundbites almost transcended reassurance to become something more like defiance. While the show had earned much acclaim and many viewers over the years, it also drew backlash for what some called indulgence of stereotypes (especially regarding Jack’s more flamboyant characterization) and bluntly insensitive jokes (especially regarding anyone who wasn’t a white gay man).\n\nFor industry observers, the narrative that ultimately took shape was that NBC and the show’s creators were all too aware that many people saw no need for Will & Grace to return to the air in 2017, as part of a TV landscape that has changed vastly and significantly since it was last present in the primetime lineup. They just didn’t especially care, as long as they could make the old fans laugh again.\n\nBut in order to understand why and how Will & Grace earned such an unstable and contentious reputation, let’s flash back to the moment when America first met Will and Grace and their co-dependence, almost 20 years ago.\n\nWill & Grace premiered in an incredibly different media landscape than the one we have now — one almost completely bereft of gay people’s lives\n\nThe very first episode of Will & Grace — which aired in September 1998 — plays games with audience expectations right off the bat. It opens with Will seemingly trying to lure Grace over to his apartment for some raunchy fun, before revealing that she’s in bed with her boyfriend; he just wants someone to watch E.R. with.\n\nRight from the jump, the show leaned into the fact that McCormack’s square-jawed Will seems exactly like the kind of leading man viewers were used to seeing on sitcoms, exploiting that familiarity to add more impact to the fact that Will is gay, and the most important woman in his life is the best friend he used to date in college before he realized as much.\n\nEverything about Will & Grace’s basic premise was a twist on the usual sitcom formula — and in that respect, the show’s historical context is crucial to understanding why it was so noteworthy. Bear in mind that Will & Grace premiered barely a year after Ellen DeGeneres’s character on her ABC sitcom Ellen came out, and only a couple months after that show ended following the subsequent backlash. (Laura Dern, who played Ellen’s love interest, revealed in April that she couldn’t find work for a good year after the two-part coming out episode aired.) Also, and not insignificantly, Bill Clinton had signed the Defense of Marriage Act, which legally confirmed that the federal government strictly defined marriage as the union between a man and a woman, just two years before.\n\nBut Will & Grace was a show that not only prominently featured gay men, but took their lives and feelings into real consideration — an unusual and important step.\n\n“[When Will & Grace premiered], LGBTQ representation in the media was largely abysmal, both in quantity and quality,” says Sarah Kate Ellis, president and CEO of GLAAD. “To have one of the major networks airing a show like this in primetime and standing behind it with advertising dollars was very important in sending a message to the country that LGBTQ stories are valid, important, and worth telling.”\n\nEarly reviews of Will & Grace were largely positive. But today, it’s pretty depressing to look back at how many of them hedged around whether or not the show had “an agenda” other than making people laugh. The Philadelphia Inquirer, for example, heartily recommended the show — under a headline that simultaneously breathed a sigh of relief that it was about “friendship, not the gay lifestyle.”\n\nEven if you put aside the questionable “gay lifestyle” distinction, this description fails to take into account that Will & Grace’s backbone is a very specific kind of close friendship that can’t be divorced from its participants’ sexualities.\n\n“The bond between gay men and straight women is often treated as a punchline,” says Carlos Maza, a longtime Will & Grace fan, Vox multimedia producer, and self-described “gay wonk.”\n\n“But those relationships are also incredibly important sources of love, affirmation, and emotional support, a safe haven where you’re not afraid of parental, societal, or sexual rejection. Will & Grace was my first exposure to popular culture that took that relationship really seriously.”\n\nAnd when I put out a call on Twitter and Facebook asking people to share what Will & Grace meant to them, I heard many similar sentiments about watching the show and experiencing dual surprise and gratitude. Even with frequent caveats that many elements of the show are now pretty dated, most of the people who responded maintained that they were thankful to have the show around at all, given how relatively few options they had to choose from.\n\nKathleen Bryant, who’s 17 years old and identifies as a lesbian, told me she found Will & Grace reruns on TV when she was younger and credits it with showing her a world in which being gay wasn’t a problem, but just an intrinsic part of life. “Will & Grace showed that you could be gay and happy,” she says. “And gay and sad. And gay and funny. And gay with friends. You could be gay and a million other things too.”\n\nIn short, there’s no denying that a major broadcast network like NBC airing a primetime sitcom that not only starred two gay characters but treated their intimate lives as nuanced and complicated was a huge deal in 1998 (though to be frank, the same is largely true today). Where things get complicated is in the way the show portrayed those characters while ignoring many others on the LGBTQ spectrum, consequently sparking a particularly heated debate.\n\nThe way Will & Grace twisted sitcom conventions — especially when spotlighting Will and Jack — was the show’s greatest strength and most controversial attribute\n\nWill & Grace’s diametric portrayals of Will and Jack’s expressions of what it means to be a gay man were, and still are, immediately contentious. First of all, even though the show was created and largely written by gay men, Will and Jack were both played by straight men as far as the press and public knew; McCormack is married to a woman, and Hayes only felt comfortable coming out as gay in 2010, four years after the show wrapped.\n\nIn particular, the writing of Jack’s character was criticized as playing on a whole host of flailing gay stereotypes, while Will’s relative chasteness came off to some as neutering his sexuality. Perhaps due to some combination of Will & Grace’s own comfort level and outside expectations, the show didn’t even feature a same-sex kiss until its second season, and even then it was a stunt between Will and Jack.\n\nWooOooOo! NBC\n\n“[Will] approaches asexual,” wrote the LA Times in its wary initial review of the 1998 premiere, “his gayness appearing to exist solely as a device to give him the moral authority to repeatedly ridicule the mincing manner of his bandanna-wearing homosexual friend, Jack, without being labeled homophobic.”\n\nWill and the rest of the Will & Grace cast cracked constant jokes about Jack’s melodramatic flapping about, which Jack habitually responded to with an indignant flourish or defiant dance move. As far as the show was concerned, it was laughing with Jack, not at him — but it couldn’t control how people interpreted its character portrayals. As Joe Reid points out in a 2013 retrospective, some LGBTQ viewers became nervous that straight viewers enjoyed Jack’s one-man show because it confirmation all their suspicions about who gay men were, with some fearing that his characterization “had a touch of the minstrel to it.”\n\nAmong many people I spoke to, Jack came up several times as both an inspiration and a cautionary tale. On the one hand, seeing someone confidently embrace his flamboyance with zero apologies could be refreshing. And Hayes vehemently defends Jack as realistic to his own experiences, saying he finds it “ridiculous” to scrutinize “Jack’s level of gay ... How can you be too gay?”\n\nBut on the flip side, Jack made some gay Will & Grace fans worry that straight viewers would associate his demeanor with the LGBTQ community at large. Scott Simpson, who describes his relationship with the show as “very conflicted,” recalled that evangelical parents used both the show and Jack to affirm their own biases about what gay men were like. “The very few clips of Will & Grace they witnessed were in large part responsible for their views on homosexuality,” he told me. “To them gay men equaled Jack, [which] equaled super effeminate vapid queens.”\n\nAs Reid explained in his retrospective, such associations make sense, but also put a ton of pressure on Jack to represent an entire community while ignoring the fact that Will & Grace did demonstrate a certain level of self-awareness regarding its two gay leads. Even that first season explicitly examines Will’s instinct to downplay his gayness versus Jack’s refusal to ever do the same, and the tension that could arise between the two as a result.\n\nOne of the show’s most memorable episodes on this front is “Will Works Out,” which revolves around Will being embarrassed of Jack when Jack brings his sashaying exercise techniques to Will’s gym.\n\nThat episode — Will & Grace’s 19th overall — aired in 1999. But the clash of Will’s “masc” personality against Jack’s more “femme” one is still reflective of a prominent and enduring conflict in the gay community today, almost two decades later.\n\nHowever, for all its nuance with regard to Will and Jack, Will & Grace’s depiction of gay life was incredibly narrow overall — a point that has come back to haunt it as the revival steps into a far different media landscape.\n\nOutside the “G” in LGBTQ, the original Will & Grace was never the most inclusive show. How much will — or should — that matter in 2017?\n\nAs has been pointed out countless times, Will & Grace’s go-to way of acknowledging anyone outside the white gay male experience on the LGBTQ spectrum — most especially lesbians and trans people — was to refer to them in passing, often as the butt of a careless joke. And even though the New York Times wrote as recently as last week that the show was “once seen as the epitome of diversity,” it rarely invited anyone but white cis gay men to be in on the jokes at all. (GLAAD confirmed to Vox that it’s spoken with NBC about the revival, but would not comment on whether the discussion included guidance on updating such jokes for 2017.)\n\nAs Will & Grace prepared to make a comeback 11 years after its final bow, the show’s creators were all too aware that it would now going to be airing in an era where people are much quicker to call out shows for a lack of inclusion and intersectionality. Kohan even acknowledged to the New York Times that “there will probably be a bit more blowback.” But he also defended Will & Grace’s sense of humor by emphasizing that “saying the most un-P.C. things has always been part of what makes the show funny, so I’m hoping we get away with it.”\n\nNBC\n\nThis is a frustrating statement to hear for any viewer who might exist on the LGBTQ spectrum outside the “G” of it all. When I talked through my own complex feelings on the revival with Vice editor Pilot Viruet, they pointed out that its jokes about anyone who isn’t a white cis gay man are a little more questionable when the show rarely included the subjects to be part of the joke rather than just its punchline. “I’m not mad they’re making fun of lesbians,” Viruet said. “I’m mad they’re doing it without including lesbian characters that are named and aren’t just the butt of jokes. It’s not that it’s un-PC ... it’s that they think that’s the problem, not their lack of intersectionality.”\n\nThat might not have been a pressing concern in 1998, but it frankly should be in 2017. While Will & Grace was once a rarity for featuring an openly gay character at all, it’s now returning having missed over a decade of news and rapid developments affecting the LGBTQ community, both in the real world and on TV. It’s coming back in a world several years removed from Glee, a world in which networks are taking chances on happily queer shows like Amazon’s Transparent, the Carmen Esposito and Rhea Butcher comedy Take My Wife (formerly of Seeso), and even Cartoon Network’s Steven Universe. It’s coming back at a time when queer creators are being met with more encouragement to tell queer stories and explore different LGBTQ perspectives than ever before.\n\nYou could theoretically argue that it’s unfair to hold 2017’s Will & Grace to a higher standard than any of the hundreds of other roughly reboots that have reemerged as hollow shells of their former selves. But by virtue of its premise and its history, Will & Grace has never been in the same class as, say, a deliberately bland Fuller House. If it wants to be truly prescient today, it can’t stay the same as it ever was — and to the revival’s credit, it seems to know that, since the best moments in its first three episodes see the characters confronting their age and supposed irrelevance.", "images": ["https://platform.vox.com/wp-content/uploads/sites/2/2025/07/Screenshot-2025-07-18-at-1.47.24%E2%80%AFPM.png?quality=90&strip=all&crop=10.37037037037%2C0%2C79.259259259259%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/10/GettyImages-140443597.jpg?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/07/Screenshot-2025-07-18-at-1.47.24%E2%80%AFPM.png?quality=90&strip=all&crop=0%2C7.9439252336449%2C100%2C84.11214953271&w=2400", "https://www.google-analytics.com/g/collect?v=2&tid=G-C3QZPB4GVE&cid=555&en=noscript_page_view", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9352479/NUP_177367_1732.JPG?quality=90&strip=all&crop=2.9%2C14.527736131934%2C73.2%2C73.163418290855&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/10/GettyImages-170887182.jpg?quality=90&strip=all&crop=0%2C1.5099552253025%2C100%2C96.980089549395&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-2220822378-1.jpg?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/gettyimages-108986758.jpg?quality=90&strip=all&crop=0%2C1.4798641436196%2C100%2C97.040271712761&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9352231/jack_today_show_will_kiss.gif?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/10/GettyImages-140443597.jpg?quality=90&strip=all&crop=16.666666666667%2C0%2C66.666666666667%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/gettyimages-108986758.jpg?quality=90&strip=all&crop=15.65%2C0%2C68.7%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9389457/headshots_1507128337084.jpg?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9352493/NUP_179312_3379.JPG?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/author_profile_images/11181/Photo_on_11-5-15_at_12.21_PM.jpg?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=96", "https://platform.vox.com/wp-content/uploads/sites/2/2024/04/default-og-image.png?quality=90&strip=all&crop=10.625%2C0%2C78.75%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/TradHusbands_10-31_IsabelSeliger.jpg?quality=90&strip=all&crop=16.666666666667%2C0%2C66.666666666667%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9457643/Screen_Shot_2017_10_13_at_11.22.13_AM.png?quality=90&strip=all&crop=2.337786259542%2C0%2C95.324427480916%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9457643/Screen_Shot_2017_10_13_at_11.22.13_AM.png?quality=90&strip=all&crop=18.225190839695%2C0%2C63.549618320611%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/TradHusbands_10-31_IsabelSeliger.jpg?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-2220822378-1.jpg?quality=90&strip=all&crop=16.666666666667%2C0%2C66.666666666667%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/10/GettyImages-170887182.jpg?quality=90&strip=all&crop=15.628683693517%2C0%2C68.742632612967%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2024/04/default-og-image.png?quality=90&strip=all&crop=23.75%2C0%2C52.5%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9389457/headshots_1507128337084.jpg?quality=90&strip=all&crop=0%2C0%2C66.666666666667%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9352479/NUP_177367_1732.JPG?quality=90&strip=all&crop=2.9,14.527736131934,73.2,57.458181903812"], "top_img": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9352479/NUP_177367_1732.JPG?quality=90&strip=all&crop=2.9,14.527736131934,73.2,57.458181903812", "keywords": [], "authors": ["Caroline Framke"], "canonical_link": "https://www.vox.com/fall-tv/2017/9/29/16360962/will-and-grace-history-controversy", "title": "Will & Grace is back, and so is the debate over its place in LGBTQ history", "meta_data": {"bingbot": "nocache", "twitter": {"card": "summary_large_image", "site": "@voxdotcom", "url": "https://www.vox.com/fall-tv/2017/9/29/16360962/will-and-grace-history-controversy", "title": "Will & Grace is back, and so is the debate over its place in LGBTQ history", "description": "Is the series revolutionary or a relic? It depends on who you ask.", "image": {"identifier": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9352479/NUP_177367_1732.JPG?quality=90&strip=all&crop=2.9,14.527736131934,73.2,57.458181903812", "alt": "Will and Grace"}}, "fb": {"app_id": 549923288395304}, "og": {"site_name": "Vox", "title": "Will & Grace is back, and so is the debate over its place in LGBTQ history", "description": "Is the series revolutionary or a relic? It depends on who you ask.", "url": "https://www.vox.com/fall-tv/2017/9/29/16360962/will-and-grace-history-controversy", "type": "article", "image": {"identifier": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9352479/NUP_177367_1732.JPG?quality=90&strip=all&crop=2.9,14.527736131934,73.2,57.458181903812", "alt": "Will and Grace", "type": "image/jpeg", "width": 732, "height": 383}}, "viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Vox", "robots": "index,follow,max-image-preview:large", "description": "Is the series revolutionary or a relic? It depends on who you ask.", "article": {"published_time": "2017-09-29T14:30:02+00:00", "modified_time": "2017-09-29T14:30:02+00:00"}, "author": "Caroline Framke", "amazonbot": "noarchive", "parsely-type": "post", "parsely-title": "Will & Grace is back, and so is the debate over its place in LGBTQ history", "parsely-link": "https://www.vox.com/fall-tv/2017/9/29/16360962/will-and-grace-history-controversy", "parsely-image-url": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9352479/NUP_177367_1732.JPG?quality=90&strip=all&crop=2.9,14.527736131934,73.2,57.458181903812", "parsely-pub-date": "2017-09-29T14:30:02+00:00", "parsely-section": "explainers", "parsely-tags": "vox,pagetype:story,latest-news,business-and-finance,culture,explainers,media,money,tv,stream-16091999", "parsely-author": "Caroline Framke", "cse-category": "Explainers", "cse-authors": "Caroline Framke", "next-head-count": 51}, "movies": [], "publish_date": 1506657600.0, "source": "https://www.vox.com", "summary": ""}