{"url": "https://people.com/tv/most-dramatic-bachelor-bachelorette-exits/", "text": "01 of 25 The Bachelor Season 25: Matt Bachelor Nation/ Youtube Sarah, a contestant on Matt James' season, had been getting negative attention from the other girls for what they perceived as attention-seeking behavior, including fainting during a rose ceremony and crashing a group date to talk to Matt about her misgivings. She isolated herself from the rest of the contestants, leading Kit to tell her, \"I hope that your connection with Matt is very strong right now, because the rest of your living situation here is going to be horrible.\" \"Seriously, like, all the fake bitches can all go home,\" Victoria said about her rival after her fainting spell, and eventually Sarah decided to do just that. \"I just felt really called to go home and be with my family,\" Sarah said, before crying in the car during her exit. \"I just don't think I'm ready for this.\"\n\n02 of 25 The Bachelorette Season 16: Clare Dale Moss and Clare Crawley. Craig Sjodin/ABC What could be more dramatic than the Bachelorette herself leaving the show? \"Congratulations, you've just blown up The Bachelorette,\" host Chris Harrison quipped to Crawley on the Nov. 5 episode — just halfway through her season — which saw her dump the remaining 16 contestants in order to pursue the immediate spark she felt with Dale Moss. Having spent only one night together, the pair then got engaged by the end of the episode. \"It was one of those cliché things,\" Crawley told PEOPLE after the episode aired. \"When you know, you know. Period.\" The Sacramento-based hair stylist was succeeded by Tayshia Adams for the remainder of the season.\n\n03 of 25 The Bachelorette Season 15: Peter Peter Weber and Hannah Brown. John Fleenor/ABC During Part 1 of Monday's season finale, Bachelorette Hannah Brown bid an emotional farewell to fan-favorite Peter Weber. While there was none of the typical drama in his exit, the difficultly of their goodbye felt particularly intense, as Brown admitted that she \"was in love with Peter\" and \"was scared [she] was letting go of the perfect guy.\" The charming pilot tugged at our heartstrings as he reflected fondly on their time together. \"She was just honestly the most amazing person I've ever met so far in my life,\" he said, holding back tears. \"I'm just grateful for all those memories we made and being able to fall in love with her.\" \"I really fell for her and I had no doubt that it was going to be us in the end,\" he added. \"I really didn't [think I was going home]. That was tough to watch back.\"\n\n04 of 25 The Bachelorette Season 15: Luke Luke Parker and Hannah Brown. ABC Brown sent her season's most contentious contestant packing following a candid arguement about sex in which he told her he expected her to remain abstinent until marriage. Brown eliminated Parker after he told her over dinner in Greece, \"If you told me you're going to have sex or you had sex with one or multiple of these guys I would be wanting to go home 100 percent.\" Brown replied that he had no right to judge her, and that after praying for clarity on her feelings for him, she had finally gotten it: \"I do not want you to be my husband,\" she told him. After Parker refused to leave, Brown informed him that she had had sex, \"and Jesus still loves me. From obviously how you feel, me f—ing in a windmill, you probably want to leave. And my husband would never say what you said to me.\" Stunned, Parker asked to pray over the former pageant queen before leaving, which she declined before flipping him off as he drove away. And as if that wasn't enough, the eliminated import/export manager shocked Brown by interrupting her rose ceremony the following week, ready to propose and sort-of apologize, which she angrily shot down. \"Leave! I'm so tired. You're so narcissistic,\" she declared.\n\n05 of 25 The Bachelorette Season 15: Scott ABC On the first episode of Hannah Brown's season, the new Bachelorette wasted no time in getting rid of a bad egg. After advisors Demi Burnett and Katie Morton tipped her off that one of her suitors, Scott, allegedly had a girlfriend back home, Brown marched back into the mansion and cut him loose. \"I knew you were nervous coming in today,\" Brown started. \"It might be because you have a girlfriend.\" Scott quickly denied the accusation. \"I don't have a girlfriend,\" he claimed. Once Brown recounted what Demi told her, the Chicago sales exec explained that he didn't consider this woman to be his girlfriend, but they did date until he left for the show. \"We were never serious like boyfriend and girlfriend,\" he said. Hannah didn't accept that as an excuse, and instead invited him to go back home to the woman he was seeing. \"If you want to get this upset with me that's totally fine,\" Scott added. \"But I could also say that you just dated Colton for the last two months, the last three months. You were just madly in love with him and then all of a sudden this is like the same exact thing.\" \"You are such a jerk!\" Brown responded before asserting, \"I'm done with this! There's no reason for you to be here if you're not serious. It's time for you to head out.\"\n\n06 of 25 The Bachelor Season 23: Colton Colton and Hannah. ABC When his favorite, Cassie, decided to leave the show, Bachelor Underwood ripped off his mic and hopped a fence while live on set in Portugal. He later told Good Morning America he needed alone time and space following Cassie's departure. After host Chris Harrison caught up to him — and everyone got a good night's sleep — Underwood decided to let go of the remaining two contestants, Tayshia and Hannah G., in hopes of getting Cassie back. (He did!) Underwood eventually came out and recently got enaged to boyfriend Jordan C. Brown.\n\n07 of 25 The Bachelor Season 22: Tia ABC All throughout Arie Luyendyk Jr.'s season of The Bachelor, a clip was included in the season's trailer: One of a man, with a thick Southern accent, arriving at the mansion to win back his fiancée. And given the similarity of his accent to of one contestant in particular — Tia, from Arkansas — many assumed it was her ex-boyfriend. But that fan theory had a major hole put in it when Arie sent Tia home after a seemingly successful hometown date, leaving her in tears the whole limo ride home. (It later turned out it was Becca's ex, and no, he didn't win her back.)\n\n08 of 25 The Bachelorette Season 13: Peter During the season 13 finale, Rachel Lindsay and runner-up Peter Kraus sat down for one of the most raw, painful conversations in franchise history before they were finally forced to come to the realization that neither one was fully willing to compromise: Peter wasn't ready to propose, and Rachel wasn't prepared to walk away without a ring on her finger. With that, they said their final goodbyes — but not without exchanging \"I love you's\" between tear-soaked kisses. She ultimately married her final pick, Bryan Abasolo.\n\n09 of 25 The Bachelorette Season 12: Chase Just when Chase McNary decided to take his romance with JoJo Fletcher to the next level by saying those three little words, the Bachelorette sent him home – on the couple's Fantasy Suite date. \"I get a fantasy suite card and then I get sent home,\" he said to cameras after Fletcher, who tearfully revealed to McNary, admitting, \"I wanted to fall in love with you.\" An emotional McNary added, \"So many highs just to end on such a low all because I said 'I love you.' I should have never said that. Why did I do that? I'm embarrassed, and I'm heartbroken.\"\n\n10 of 25 The Bachelorette Season 11: Ian ABC After weeks of pining after Kaitlyn Bristowe, Ian Thompson just couldn't handle that she wasn't as interested in him as she was in some of the other men. \"I don't understand why Kaitlyn wouldn't want a Princeton graduate, former model that defied death and has been around the world a couple times,\" he told cameras, and then said worse to Kaitlyn's face: \"I question your intentions. I really see you as a surface-level person at this stage.\" So, she told him that he needed to go. Ian's last words in the car home? \"Oh man, I need to have sex.\"\n\n11 of 25 The Bachelor Season 17: AshLee ABC AshLee Frazier, the second runner-up on Sean Lowe's season, was completely blindsided by her dramatic elimination – during the Women Tell All episode, she called him a fake \"frat boy,\" while Sean fired back that she wasn't fun enough to make the final two. Then AshLee accused Sean of confessing to her that he didn't have feelings for the other two women.\n\n12 of 25 The Bachelorette Season 9: Brooks ABC/Getty \"I have great connections with Chris and Drew, but my feelings for Brooks are set apart from the other guys. When I'm with Brooks, I do see my future,\" Desiree Hartsock told cameras of her final three. Brooks Forester, however, was less sure – and he felt increasingly uncomfortable with the notion of proposing to her at the end of the show. After expressing his uncertainties to host Chris Harrison, who told him he needed to \"be a man,\" Brooks confronted Hartsock and said he couldn't go through with it. Des broke down sobbing, saying how in love she was with him, and after the incident, she even considered quitting her own season. \"Honestly, for me, it's over,\" she said. (It wasn't – Des would eventually go on to marry Chris.)\n\n13 of 25 The Bachelorette Season 7: Ben ABC Bachelorette Ashley Hebert basically made Ben Flajnik propose to her – he got down on one knee and the whole shebang – before sending him home in one of the most shocking finales in Bachelorette history. \"You can't leave something like this on good terms. It's not possible,\" Ben told her, right before walking away in a silent fury. She went on to wed her final pick, J.P. Rosenbaum, though the two divorced in 2020.\n\n14 of 25 The Bachelorette Season 8: Kalon ABC After a contestant informed Emily Maynard that suitor Kalon McMahon had referred to her kids as \"baggage,\" she confronted him in front of everyone, sending Kalon home and lashing out at the other contestants for not telling her about Kalon's views earlier. \"If you'd asked me about Ricki you'd see that she's the furthest thing from baggage. Get the f--- out!\"\n\n15 of 25 The Bachelor Season 17: Des ABC When Sean Lowe gave his third (and final) rose to now-wife Catherine Guidici, Desiree Hartsock immediately burst into tears, telling Sean he made a huge mistake and begging him to take her back. \"It was an excruciating, confusing and emotional night, and I was just praying that I wouldn't regret my decision,\" Lowe blogged afterward.\n\n16 of 25 The Bachelor Season 13: Molly ABC When Jason Mesnick didn't give Molly Malaney the rose in the finale and proposed to Melissa Rycroft, Molly was beyond devastated – and, it turns out, so was he. Six weeks later, Jason ended it with Melissa (on ATFR) to reunite with Molly, and the couple tied the knot in 2010.\n\n17 of 25 The Bachelor Season 18: Andi ABC Andi Dorfman famously dumped Bachelor Juan Pablo after spending a night with him in the Fantasy Suite, which she referred to as a \"nightmare.\" She proceeded to call him out on all his less-than-gentlemanly behavior, like when he told her she only made it to the final three \"by default\" and when he talked nonstop about fellow contestant Clare in the Fantasy Suite. Basically, Andi accused him of not knowing her at all. Then, she peaced. Next stop? The Bachelorette, season 10.\n\n18 of 25 The Bachelor Season 14: Rozlyn ABC Proof that receiving a rose doesn't mean you're safe: Contestant Rozlyn Papa got kicked off for having a romantic relationship with a producer after making it through a rose ceremony. \"She had a physical relationship with a producer on our show,\" host Chris Harrison told PEOPLE at the time. \"You cannot do that. There is no gray area … Other girls on the show saw it.\" Jake Pavelka, the season's pilot bachelor, was beyond bummed. \"When he told me the news, my heart dropped and I felt numb,\" Jake said. \"I had started to develop feelings for Rozlyn and that's why I had given her a rose.\"\n\n19 of 25 The Bachelorette Season 6: Kasey ABC Damn, that's cold – literally. Ali Fedotowsky dumped Kasey Kahl and left him alone on a glacier in Iceland, just days after he'd gotten a 6-in. tattoo on his wrist to commemorate his devotion to her.\n\n20 of 25 The Bachelor Season 7: Bentley ABC \"[Staying] is not an option for me,\" the world's biggest Bachelor villain, Bentley Williams, told cameras right before sitting down with Ashley Hebert to lie and say he was leaving because he couldn't bear to be apart from his daughter any longer. Before the deed, he told cameras, \"So I'm going to make Ashley cry. I hope my hair looks okay!\"\n\n21 of 25 The Bachelor Season 17: Lindsay ABC Dressed in an elegant David Meister gown and super high Badgley Mischka pumps, contestant Lindsay Yenter's initial reaction to not receiving the final rose from Sean Lowe was to make a move that had ladies around the country nodding and clapping in recognition – she took off the heels.\n\n22 of 25 The Bachelorette Season 6: Justin ABC Officially one of the most uncomfortable moments in Bachelor franchise history – Bachelorette Ali Fedotowsky confronted suitor Justin Rego about the fact that he had a long-term girlfriend back at home. The confrontation got even more dramatic when Ali revealed that Justin's girlfriend had called her on the phone and told her she'd found out Justin had been cheating on her with another girl from their hometown.\n\n23 of 25 The Bachelor Season 18: Clare ABC As one of the most controversial bachelors in Bachelor history, it makes sense that we have another dramatic exit – this one, from Clare Crowley. In the finale, Juan Pablo whispered to Clare that he loved \"f---ing\" her, but didn't know her. Naturally, she flipped out – and got out.\n\n24 of 25 The Bachelor Season 11: Deanna ABC In a shocking turn of events, Brad Womack rejected both of his two remaining suitors – Jenni Croft and DeAnna Pappas – though DeAnna's exit was significantly more dramatic. She thought she had been chosen the moment she found out Jenni had been sent home – causing her to light up and smile – even though her fate would be the exact same. \"When he told her that he had just sent me home, she just had the biggest smile on her face, and I think she felt so happy inside. Just watching her get her dreams and feelings crushed too … that was rough for me,\" said Jenni on After the Final Rose.", "images": ["https://people.com/thmb/eTQ1fVsvOtfLqCEQ4tULqIEukKU=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/Golden-Bachelor-Gerry-Turner-and-Theresa-Nist-Seen-Together-for-the-First-Time-Since-Divorce-111325-925470e2cc544b48a6bab2a718fb8910.jpg", "https://people.com/thmb/OSPaPHuVwzZmsSRtQCbaQVcHNAk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(959x0:961x2)/matt-james-sarah2-8a716f3c93ca4b7fa55b095a69f3124b.jpg", "https://people.com/thmb/dY5lRLoUTXxpfLJQ7QoLr2AYg0g=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/ashlee-b0e0974bc0494feea681294d11b308c1.jpg", "https://people.com/thmb/hOeESeJ7SzpcXJwK883VaWJO1UQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Taylor-Frankie-Paul-091025-4d4931e79a60485396023938bc1a9728.jpg", "https://people.com/thmb/tx3CFTThcwra3E9IDPIDgeY-LsE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/MEL-OWENS-Engagement-ring-111225-5923d433b598498a8823b24550f19a86.jpg", "https://people.com/thmb/M-Xi_i24v1dz0fS7opR6uYpbo8Y=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/ian-kaitlyn-76cbcfa2122b41c3add785ade3db90d9.jpg", "https://people.com/thmb/gVYQMcVGW92nO5fgcYOAk_TmkMI=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/Mel-Owens-Golden-Bachelor-042225-0fc58b6db15f472fae1aa1127f5ab357.jpg", "https://people.com/thmb/QoyOfZDmooctt-5Vkeb9h0HOYWY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(959x0:961x2)/sarah-matt-james-cf674e9f3be14b7e8496a4df17107c0b.jpg", "https://people.com/thmb/GfeEXkE2XAscnDcsdqvnlsMBpAE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Golden-Bachelor-Gerry-Turner-and-Theresa-Nist-Seen-Together-for-the-First-Time-Since-Divorce-111325-925470e2cc544b48a6bab2a718fb8910.jpg", "https://people.com/thmb/brdlVViMWyLkCAOfQpxh_68-h2I=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/golden-bachelor-mel-owens-peg-cindy-110525-d30d64f4a9fc4cbfadc7775eff01d183.jpg", "https://people.com/thmb/t-xMnazqNKHl-1TRcV3LeYwfha0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/gerry-turner-theresa-nist-121124-11e8664a91ee4b4984221537f5203785.jpg", "https://people.com/thmb/VnFjj-ulUS4M8T1hfPpCVx2yJtQ=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/mel-owens-peg-munson-golden-bachelor-111325-42efe59dada446d9bd1f718573f4151c.jpg", "https://people.com/thmb/VjkrCSErlvU9Zc_BA-gInSHnqqs=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/molly-jason-4792f79513b646af9046b0cd8ae38dfc.jpg", "https://people.com/thmb/Uo8iLTyanrj7eNHYmSXZHwHJbxY=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/Spencer-Lofranco-112025-56efb2cd379b4817ac0f4d3b10fb37f3.jpg", "https://people.com/thmb/eQp7F_d2AsxtaKW-5VlIjGbbBxw=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/bach-1-2000-e3610e8d80e241d295213a9263d277cd.jpg", "https://people.com/thmb/Nop4P1rTAhxwpJLCo3NqZVshho0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/tia-bachelor-1eda297cf15f439e99c05bb8bedfb2a4.jpg", "https://people.com/thmb/QYcDMFNJJ5cYNNpMyma3Du4imSk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/peter-bachlorette-15331cebfebb417599fc3daba1262cc2.jpg", "https://people.com/thmb/DrBwhtaGUpCgOtzXwGUljtHYWa8=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/rozlyn-scandal3-c6fd0186c3b045a694c2bef823f58235.jpg", "https://people.com/thmb/xz89WVw9-gBg2p8iqUBlWp6lTAo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/lindsay-1-4621aa26ca0e48dc85a9f655a5f8c2f2.jpg", "https://people.com/thmb/uuwB0COvh2mCjBuOhdw8s1Oqhg4=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/charlie-oconnell-660-2d2fbdf30bb84bbab808d27dc74a7f1e.jpg", "https://people.com/thmb/uKKi1M7GmKHA0aVJSOC2qklFapE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/mel-owens-peg-munson-golden-bachelor-111325-42efe59dada446d9bd1f718573f4151c.jpg", "https://people.com/thmb/DZyK7YS4su4jyYEL6GmX9d6pX5Q=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/real-housewives-of-rhode-island-Bravo-TV-111625-f4706de30af74d8a8294c0cee14885c4.jpg", "https://people.com/thmb/GyBlm68RmlXIT5ZTYrepvRpJAFI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/kalon-e82b33f252fa404697329d90d24d0d72.jpg", "https://people.com/thmb/9Q2OU1KKDKNuJZd01sEQ5wloQPY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/golden-bachelor-mel-owens-cindy-peg-111225-0d1d70338cb2406bae2f9deee6f62c03.jpg", "https://people.com/thmb/nS-rhtWBfTjJ_pDQZP4L63-QvQY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/brooks-desi-660-2-2f871014883149df92d4939dad204a47.jpg", "https://people.com/thmb/djP0TRoy9vuIloEmCmuanA0N1NY=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/quadruple-amputation2-112025-c05ec8d5ca3f44488ab8fd45eb9d724d.jpg", "https://people.com/thmb/lZOQ9K50bTGwZTlL5NohFb9JbKU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/dancing-with-the-stars-HANNAH-BROWN-ALAN-BERSTEN-XOCHITL-GOMEZ-VAL-CHMERKOVSKY-DANIELLA-KARAGACH-IMAN-SHUMPERT-051925-eaa0beb970b843859adf7b4c5eb84edb.jpg", "https://people.com/thmb/cdr5Zbe3Os5huoAHXHYiALIhYGM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/chris-harrison-1-4c6ec188ecb84a938d5faa5dd4bdcffb.jpg", "https://people.com/thmb/gzwENEh9wZT2B8hkDLloZqD_PAQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/juan-pablo-andi-1-09f52bfc4121416e899ac1794814c78f.jpg", "https://people.com/thmb/wv2rMzLSx7Qgf5twhG7Xt_-rGgE=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/dale-clare-c0f3bfa7273b41d6a073c1ce87b5fa37.jpg", "https://people.com/thmb/tQgah2x9vO8l9AIXN6tyXfKpsaQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/bentley-williams-949c4d9b80dd4c09b3f4e9990d12093a.jpg", "https://people.com/thmb/LKJMOZY5Y1W3ROesLnYnN7qSjJo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/deanna-2-d02a1e159dc44bcfa2690272854b1543.jpg", "https://people.com/thmb/AyD4cnu2i-6GR_kI2WzSm_QJkks=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/kacey-7972be57e14143e28234d976cf91fdaa.jpg", "https://people.com/thmb/bZmGXn3K6QTMep7gwl0CGwOVoA8=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/david-sharon-schoo-leaving-court-102825-31cfe4a2ae50417c99a42136edcfda93.jpg", "https://people.com/thmb/NYEp9cP098t0ibiJEIneiijIVIo=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/clare-906622743f9546e380173967abfb70f4.jpg", "https://people.com/thmb/_Fg6pocGwiFVMemj8RGcdor-mHI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/theresa-nist-gerry-turner-launch-of-Hulu-on-Disney-041224-1-ec3c1719cf044a348f70bdd40256e61d.jpg", "https://people.com/thmb/yaLWcTJ31dDPpSBGBz4pMYpQ9pM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(399x0:401x2)/jojo-chase-800-2-6f47fb0272e447cbbf4f19ec803b94ff.jpg", "https://people.com/thmb/yHKoDLWrRCZckkXijmSbKxOaKmY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/desiree-e3f5769888a94cbead35492799db3172.jpg", "https://people.com/thmb/_rVBMDbzuTChcRLnK_30ZnlDECY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/justin-ali-966b8fbf79ce4cbe91898729e287f62b.jpg", "https://people.com/thmb/zC54Oci9i_GRvZODUvtgF0Pv9ns=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/151842_7328-2000-5df1398b746c4c238aa7d33d44c603b5.jpg", "https://people.com/thmb/6zZj592O1bWqHbml_nzvQwFoLSs=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(631x0:633x2)/the-bachelor-10-1-ec105b138a834555817c0a31b6587ad1.jpg", "https://people.com/thmb/houJgFYu3h_jBt0tQwFzaIKWRpY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/golden-bachelor-mel-owens-main-042325-0c580dad2f294daa82ca7a941097b7b9.jpg", "https://people.com/thmb/bHqUr0JCVp8wk8JOGwUY3t3njYY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Mel-Cindy-Golden-Bachelor-111325-5fafc5719c214131b93f2be28047a8f6.jpg", "https://people.com/thmb/2UOU2KiU35iS8mrRQJg0v6J9AsM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/bach2-2000-d474ee02e02a4a479136b9723ea727a8.jpg", "https://people.com/thmb/FmveNe5DmBkjKJPGQU3g6EA5pDQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/ben-1-103fb8866e7c45edbf7408a921a53085.jpg", "https://people.com/thmb/YjVJ_APv3yBQMjgO7tyd4o47P3Y=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Mel-Owens-Golden-Bachelor-042225-0fc58b6db15f472fae1aa1127f5ab357.jpg", "https://people.com/thmb/jIK60Q2ZLv7v9GA22X6VPlAmlvU=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/jellyroll-instagram2-112025-8ebe824d77cc42eda053a3e687ae8d0f.jpg", "https://people.com/thmb/RZlr9YHoMi-jqQuTk7IRay0SNTc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Gerry-Turner-and-his-finalists-Theresa-Nist-and-Leslie-Fhima11302369-46c30e6d82a74a8da96790e0b47a17f5.jpg"], "top_img": "https://people.com/thmb/OSPaPHuVwzZmsSRtQCbaQVcHNAk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(959x0:961x2)/matt-james-sarah2-8a716f3c93ca4b7fa55b095a69f3124b.jpg", "keywords": [], "authors": ["Maria Yagoda", "Maria Yagoda Is A Former Writer-Reporter At People. She Left People In", "People Editorial Guidelines", "Caroline Blair", "Kimberlee Speakman", "Stephanie Sengwe", "Michelle Lee", "Liza Esquibias", "Emily Blackwood", "Charna Flam"], "canonical_link": "https://people.com/tv/most-dramatic-bachelor-bachelorette-exits/", "title": "The Most Dramatic 'Bachelor' and 'Bachelorette' Exits of All Time", "meta_data": {"robots": "max-image-preview:large, NOINDEX, FOLLOW", "viewport": "width=device-width, initial-scale=1.0", "description": "We're looking back at The Bachelor and The Bachelorette's most memorable departures", "emailcontenttype": "LISTSC", "emailvertical": "PEOPLE", "sailthru.author": "Maria Yagoda", "sailthru.tags": "reality-tv-shows", "parsely-section": "Entertainment", "parsely-tags": "Entertainment,TV,People.com,Reality TV,Celebrity,The Scoop", "article": {"section": "People", "author": "https://www.facebook.com/peoplemag"}, "og": {"type": "article", "site_name": "People.com", "url": "https://people.com/tv/most-dramatic-bachelor-bachelorette-exits/", "title": "The Most Dramatic Bachelor and Bachelorette Exits of All Time", "description": "We're looking back at The Bachelor and The Bachelorette's most memorable departures", "image": "https://people.com/thmb/OSPaPHuVwzZmsSRtQCbaQVcHNAk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(959x0:961x2)/matt-james-sarah2-8a716f3c93ca4b7fa55b095a69f3124b.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "The Most Dramatic Bachelor and Bachelorette Exits of All Time", "description": "We're looking back at The Bachelor and The Bachelorette's most memorable departures", "image": "https://people.com/thmb/OSPaPHuVwzZmsSRtQCbaQVcHNAk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(959x0:961x2)/matt-james-sarah2-8a716f3c93ca4b7fa55b095a69f3124b.jpg"}, "vf": {"url": "https://people.com/tv/most-dramatic-bachelor-bachelorette-exits/"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.147.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.147.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.147.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.147.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.147.0/icons/favicons/mstile-310x150.png", "fb": {"pages": 95926963131}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}