{"url": "https://www.biography.com/people/oprah-winfrey-9534419", "text": "We may earn commission from links on this page, but we only recommend products we back.\n\n1954–\n\nWho Is Oprah Winfrey?\n\nOprah Winfrey is an Emmy Award–winning talk show host, media executive, Academy Award–nominated actress, and philanthropist. She’s best known for being the host of her wildly popular program, The Oprah Winfrey Show, which aired for 25 seasons, from 1986 to 2011. Its success helped her become the world’s first Black woman billionaire in 2003. Winfrey’s media empire has grown to include a TV network, the Oprah Winfrey Network, and a lifestyle magazine brand. In 1994, she was inducted into the Television Academy Hall of Fame, and in 2018, became the first Black woman to receive the Cecil B. DeMille Award at the Golden Globes for her outstanding contributions to entertainment.\n\n\n\nQuick Facts\n\nFULL NAME: Oprah Gail Winfrey\n\nBORN: January 29, 1954\n\nBIRTHPLACE: Kosciusko, Mississippi\n\nASTROLOGICAL SIGN: Aquarius\n\nEarly Life and Education\n\nOprah Gail Winfrey was born on January 29, 1954, in the rural town of Kosciusko, Mississippi. Her aunt Ida named her after the biblical figure Orpah, but quickly, her family began spelling it Oprah, which was easier to pronounce. After a troubled adolescence in a small farming community, where she was sexually abused by a number of male relatives and friends of her mother, Vernita Lee, Winfrey moved to Nashville to live with her father, Vernon Winfrey, a barber and businessman.\n\nWinfrey East Nashville High School. In 1972, she won the Miss Black Nashville pageant. She would go on to become Miss Black Tennessee and compete for Miss Black America.\n\nIn 1971, Winfrey entered Tennessee State University and majored in speech communications and performing arts. She began working in radio and television broadcasting in Nashville and dropped out of college in 1975, one credit shy of her degree. Years later, she resumed her studies and graduated as part of Tennessee State’s 1986 class.\n\nEarly Broadcasting Career\n\nIn 1976, Winfrey moved to Baltimore, Maryland, where she hosted the TV talk show People Are Talking. The show became a hit, and Winfrey stayed with it for eight years, after which she was recruited by a Chicago TV station to host her own morning show, A.M. Chicago.\n\nGetty Images Oprah Winfrey hosts A.M. Chicago in 1984.\n\nHer major competitor in the time slot was Phil Donahue. Within several months, Winfrey’s open, warm-hearted personal style had won her 100,000 more viewers than Donahue and had taken her show from last place to first in the ratings.\n\nThe Oprah Winfrey Show\n\nWinfrey launched The Oprah Winfrey Show in 1986, becoming the first Black female host of a nationally syndicated daily talk show. It ran for 25 years, until 2011.\n\n\n\nWith its placement on 120 channels and an audience of 10 million people, the show grossed $125 million by the end of its first year, of which Winfrey received $30 million. She soon gained ownership of the program from ABC, drawing it under the control of her new production company, Harpo Productions (“Oprah” spelled backward), and making more and more money from syndication.\n\nIn 1994, with talk shows becoming increasingly trashy and exploitative, Winfrey pledged to keep her show free of tabloid topics. Although ratings initially fell, she earned the respect of her viewers and was soon rewarded with an upsurge in popularity.\n\n\n\n\n\nIn 2004, Winfrey signed a new contract to continue The Oprah Winfrey Show through the 2010–11 season. At the time, the syndicated show was seen on nearly 212 stations across the United States and in more than 100 countries worldwide. In 2009, Winfrey announced that she would be ending her program when her contract with ABC ended, in 2011.\n\nBy the end of its run, The Oprah Winfrey Show had racked up dozens of Daytime Emmy Awards, including nine for Outstanding Talk Show and Winfrey’s seven for Outstanding Talk Show Host. The success of the show helped launch the TV careers of Dr. Phil McGraw, Dr. Mehmet Oz, and Rachael Ray, who all had their own talk shows. The talk show was also the first platform for popular series such as Oprah’s Book Club and Oprah’s Favorite Things.\n\nOprah’s Book Club\n\nWinfrey contributed immensely to the publishing world by launching Oprah’s Book Club as a segment of her talk show in September 1996. Her first selection was by Jacquelyn Mitchard. Other picks have included by Toni Morrison, by Cheryl Strayed, and Michelle Obama’s 2018 memoir .\n\nThe program has propelled many unknown authors to the top of the bestseller lists. Since The Oprah Winfrey Show ended, the book club has continued through O, The Oprah Magazine, an Apple TV+ series, and a podcast.\n\nOprah’s Half-Sister\n\nIn the final season of her talk show, Winfrey made ratings soar when she revealed a family secret: She has a half-sister named Patricia.\n\nWinfrey’s mother, Vernita Lee, gave birth to a baby girl in 1963. At the time, Winfrey was 9 years old and living with her father. Lee put the child up for adoption because she believed that she wouldn’t be able to get off public assistance if she had another child to care for. Patricia lived in a series of foster homes until she was 7 years old.\n\nPatricia tried to connect with her birth mother through her adoption agency after she became an adult, but Lee did not want to meet her. After doing some research, she approached a niece of Winfrey’s, and the two had DNA tests done, which proved they were related.\n\nOprah Winfrey Network (OWN)\n\nWinfrey debuted Oxygen Media, a company she co-founded that was dedicated to producing cable and online programming for women, in 1999.\n\nSoon after The Oprah Winfrey Show ended in 2011, Winfrey moved to her own network, the Oprah Winfrey Network, a joint venture with Discovery Communications.\n\nDespite a financially rocky start, OWN made headlines in January 2013 when it aired an interview between Winfrey and seven-time Tour de France winner Lance Armstrong. Armstrong, the American cyclist who had his Tour titles stripped in 2012 because of doping, admitted to using performance-enhancing substances throughout his career, including the hormones cortisone, testosterone, and erythropoietin (also known as EPO). The interview reportedly brought in millions of dollars in revenue for the network.\n\nIn March 2015, Winfrey announced that her Chicago-based Harpo Studios would close at the end of the year to consolidate the company’s production operations to the Los Angeles–based OWN.\n\nIn December 2017, Discovery announced it had become the majority owner of OWN, with the purchase of 24.5 percent of the company from its founder for $70 million. Winfrey retained 25.5 percent of OWN and remained its chief executive under the terms of the agreement. In December 2020, Winfrey sold another 20.5 percent of her stake in the network to Discovery. She is still chairman and CEO.\n\nOprah Magazine and Oprah Daily\n\nGetty Images Oprah Winfrey attends a launch event for the first issue of O, The Oprah Magazine in April 2000.\n\nWinfrey’s highly successful monthly magazine, O: The Oprah Magazine, debuted in 2000. The Hearst publication printed its last monthly issue in 2020. Soon after in 2021, Winfrey announced Oprah Daily, which features “thoughtful digital storytelling, a quarterly print edition, and a special membership-only community.”\n\nThrough the publications, Winfrey has continued sharing “Oprah’s Favorite Things,” her annual list of her top holiday gifts first introduced on her talk show. The 20th edition was featured on Amazon in 2017.\n\nPartnership with Apple\n\nIn June 2018, Winfrey agreed to a multi-year deal in which she would create original content for Apple. In September 2019, it was announced that Winfrey was bringing Oprah’s Book Club to the Apple TV+ streaming service, with Ta-Nehisi Coates’ to be featured on the inaugural episode.\n\nAs part of her partnership with Apple, Winfrey signed on as executive producer of On the Record, a documentary about several of the women who accused music producer Russell Simmons of sexual misconduct. However, Winfrey abruptly pulled her support of the doc shortly before it was scheduled to premiere at the 2020 Sundance Film Festival.\n\nStarting in 2020, Apple TV+ The Oprah Conversation, a series of interviews with stars from film, music, and more. Winfrey’s guests have included Will Smith, Dolly Parton, Stevie Wonder, and former President Barack Obama.\n\nInterview With Prince Harry and Meghan Markle\n\nOn March 7, 2021, CBS aired Winfrey’s exclusive interview with Prince Harry and Meghan Markle, the Duke and Duchess of Sussex, in a primetime special. The two discussed their decision to quit as working members of the British royal family and move to the United States. The duchess notably revealed she had experienced suicidal thoughts because of feelings of loneliness and isolation within the royal family. CBS said the special averaged 17.1 million viewers, and Winfrey’s ability as an interviewer once again drew praise.\n\nOn November 15, 2021, a similar interview with Winfrey and Grammy-winning singer Adele aired as a CBS special.\n\nActing Career\n\nWinfrey’s breakthrough acting role came in Steven Spielberg’s 1985 film The Color Purple, based on the Pulitzer Prize–winning novel by Alice Walker. She played Sofia Johnson, a friend of the protagonist, Celie, and was nominated for an Academy Award for Best Supporting Actress.\n\n\n\nIn 2005, Winfrey helped give The Color Purple a new life onstage as one of the producers of the 11-time Tony-nominated musical, which ran on Broadway until 2008. A revival of the musical, which Winfrey co-produced in 2015, won a Tony Award.\n\nAfter The Color Purple film, Winfrey appeared in TV shows and movies, but her next big role was starring in the 1998 film adaptation of Beloved. The movie, which Winfrey helped produce, was based on Toni Morrison’s Pulitzer Prize–winning novel.\n\nIn the 2013 historical drama The Butler, directed by Lee Daniels, Winfrey played Gloria Gaines, the wife of main character Cecil Gaines (Forest Whitaker). Her performance received acclaim, including a nomination for a Screen Actors Guild Award.\n\nWinfrey has also had roles in Charlotte’s Web (2006), The Princess and the Frog (2009), Selma (2014), and A Wrinkle in Time (2018).\n\nOprah Winfrey’s Net Worth\n\nAccording to Forbes magazine, Winfrey was the richest African American of the 20th century. She became the world’s only Black billionaire in 2003 and held the distinction for three years running. Life magazine hailed her as the most influential woman of her generation.\n\nForbes listed her real-time net worth at $2.5 billon as of March 9, 2023.\n\nRelated Story Oprah Winfrey: The First Black Female Billionaire\n\nPhilanthropy\n\nIn 2005, Business Week named Winfrey the greatest Black philanthropist in American history. She has created multiple charities over the years, including Oprah’s Angel Network, the Oprah Winfrey Foundation, and the Oprah Winfrey Charitable Foundation. Between 1998 and September 2010 when it stopped operating, Oprah’s Angel Network had raised more than $80 million that supported schools around the world and victims of Hurricane Katrina, among other recipients.\n\nWinfrey is a dedicated supporter of youth around the world and has even advocated on behalf of children’s rights. She created the Oprah Winfrey Leadership Academy for Girls in South Africa as a safe space to educate and inspire the “next generation of leaders for South Africa.” It opened in 2007. In 1994, then-President Bill Clinton signed a bill, which Winfrey had proposed to Congress, into law that created a nationwide database of convicted child abusers.\n\nIn February 2018, after a shooting at Florida’s Marjory Stoneman Douglas High School left 17 people dead, Winfrey announced she would follow the example set by George and Amal Clooney and donate $500,000 to the March for Our Lives demonstration scheduled for the following month.\n\n\n\nPolitical Activism\n\nGetty Images Oprah Winfrey and Michelle Obama hug as they campaign for Barack Obama in Des Moines, Iowa, in 2007.\n\nIn December 2007, Winfrey campaigned for then-Democratic presidential hopeful Barack Obama and attracted the largest crowds of the primary season to that point. Winfrey joined Obama for a series of rallies in the early primary/caucus states of Iowa, New Hampshire, and South Carolina. It was the first time Winfrey had ever campaigned for a political candidate.\n\nThe biggest event was at the University of South Carolina football stadium, where 29,000 supporters attended a rally that had been switched from an 18,000-seat basketball arena to satisfy public demand.\n\n“Dr. (Martin Luther) King dreamed the dream. But we don’t have to just dream the dream any more,” Winfrey told the crowd. “We get to vote that dream into reality by supporting a man who knows not just who we are, but who we can be.”\n\nIn November 2018, Winfrey campaigned with Georgia gubernatorial candidate Stacey Abrams, the first Black female nominee for a major party to run for governor in any state. Winfrey knocked on doors and even participated in a town-hall meeting.\n\nOver the years, Winfrey’s potential political career has been the subject of conversation. In 1999, Donald Trump said on Larry King Live that were he to run for president, he’d want Winfrey as his running mate. After winning the presidency in 2016, Trump said that he was friends with Winfrey until he ran for office. During a speech at the 2018 Golden Globes, Winfrey criticized the racially charged environment in America, and fans later speculated that she might run for president in 2020. However, Winfrey has said that she has no intention of running for president.\n\n\n\nAwards and Honors\n\nWinfrey has received numerous awards and honors for her work on and off screen.\n\nShe is a seven-time recipient of the Daytime Emmy Award for Outstanding Talk Show Host for The Oprah Winfrey Show and was inducted into the Television Academy Hall of Fame in 1994. In September 2002, Winfrey was named the first recipient of the Academy of Television Arts & Sciences’ Bob Hope Humanitarian Award.\n\nIn 1994, Winfrey was inducted into the National Women’s Hall of Fame. Six years later, in 2000, Winfrey received the Spingarn Medal, the highest honor awarded by the NAACP. The organization presents the medal annually to a man or woman of African descent and American citizenship for merit and achievement.\n\nGetty Images Oprah Winfrey receives the Presidential Medal of Freedom from President Barack Obama in 2013.\n\nWinfrey was featured at the 2010 Kennedy Center Honors for her contributions to United States art and culture. Then, in November 2013, Winfrey received the nation’s highest civilian honor, the Presidential Medal of Freedom from President Obama for her contributions to her country.\n\nIn January 2018, Winfrey was honored with the Golden Globes’ Cecil B. DeMille Award for lifetime achievement. She is the first Black woman to receive the award. In a powerful acceptance speech, she recalled being inspired by seeing Sidney Poitier honored at the Globes decades earlier, before emphasizing the importance of a free press and discussing the systemic issue of abuse and assault against women a year after the Me Too movement went viral.\n\n“I want all the girls watching here and now to know that a new day is on the horizon,” she said, in closing. “And when that new day finally dawns, it will be because of a lot of magnificent women, many of whom are right here in this room tonight, and some pretty phenomenal men, fighting hard to make sure that they become the leaders who take us to the time when nobody ever has to say, ‘Me too’ again.”\n\nAmong her noteworthy nominations, Winfrey became the first Black woman to be nominated for the Academy Award for Best Picture when Ava DuVernay’s Selma, which she helped produce, was in the running.\n\nOprah’s Health\n\nWinfrey has publicly struggled with her weight, and her numerous weight loss efforts have been well-documented. In 1988, she revealed on her talk show that she lost 67 pounds on a liquid diet and exercise. “I had literally starved myself for four months—not a morsel of food,” she later said. By 1992, she had gained most of the weight back.\n\nIn 1995, she lost an estimated 90 pounds (dropping to her ideal weight of around 150 pounds). That year, she competed in the Marine Corps Marathon in Washington, D.C.\n\nIn the wake of her highly publicized weight loss success, Winfrey’s personal chef, Rosie Daley, and trainer, Bob Greene, both published best-selling books. However Winfrey’s weight continued to fluctuate through the years.\n\nIn 2015, Winfrey bought a 10 percent stake in WeightWatchers. She also became and advisor for the company and secured herself a seat on the board, and she appeared in TV ads as a spokesperson for the company. In early 2017, Winfrey revealed that she had again lost 42 pounds, which she credited to WeightWatchers. That year, Winfrey launched O That’s Good, a line of prepared foods with a nutritious twist.\n\n\n\nPersonal Life\n\nGetty Images Stedman Graham and Oprah Winfrey attend the 2013 premiere of The Butler.\n\nWinfrey has been in a relationship with Stedman Graham, a public relations executive, since the mid-1980s. They became engaged in 1992 and planned to get married the following year but never tied the knot. In 2022, Winfrey described their relationship as a “spiritual partnership.”\n\nWinfrey has never had children by choice. In a , she said she feels a maternal connection through the work of the Oprah Winfrey Leadership Academy.\n\nWinfrey currently owns or has owned multiple homes, including in Montecito, California; Rolling Prairie, Indiana; Telluride, Colorado; and Kula, Hawaii.\n\n\n\nWinfrey’s mother died on Thanksgiving in 2018. Her father died on July 8, 2022.\n\nQuotes\n\nThe whole point of being alive is to evolve into the complete person you were intended to be.\n\nExcellence is the best deterrent to racism or sexism.\n\nCheers to a New Year and another chance for us to get it right.\n\nWhat I learned at a very early age was that I was responsible for my life. And as I became more spiritually conscious, I learned that we all are responsible for ourselves, that you create your own reality by the way you think and therefore act. You cannot blame apartheid, your parents, your circumstances, because you are not your circumstances. You are your possibilities. If you know that, you can do anything.\n\nWhat other people label or might try to call failure, I have learned is just God’s way of pointing you in a new direction.\n\nThis is what I know for sure: In order to be truly happy, you must live along with and you have to stand for something larger than yourself. Because life is a reciprocal exchange. To move forward, you have to give back.\n\nLearn from every mistake because every experience, encounter, and particularly your mistakes are there to teach you and force you into being more who you are.\n\nWhen you’re doing the work you’re meant to do, it feels right and every day is a bonus, regardless of what you’ re getting paid.\n\nEvery right decision I’ve made—every right decision I’ve ever made—has come from my gut. And every wrong decision I’ve ever made was a result of me not listening to the greater voice of myself.\n\nNo matter what triumphs, defeats, sad times, painful times, whatever you have to go through in life—you are your own best thing.\n\nYou’re never going to run out of people who are looking for a more joyful life.\n\nI’ve always known that life is better when you share it. I now realize it gets even sweeter when you expand the circle.\n\nThere is no greater gift you can give or receive than to honor your calling. It’s why you were born. And how you become most truly alive.\n\nWhen you do well, do your best, people notice.\n\nNothing about my life is lucky. Nothing. A lot of grace, a lot of blessings, a lot of divine order, but I don’t believe in luck. For me, luck is the moment of preparation meeting the moment of opportunity. There is no luck without you being prepared to handle that moment of opportunity. Every single thing that has ever happened in your life is preparing you for the moment that is to come.\n\nEverything passes in time. It doesn’t matter how much money you have, how much power you have, how high you sit on the Forbes list, how many times you make the ‘Most Influential’ list—all of that changes. But what is real, what is lasting, is who you are and what you were meant to bring.\n\nYou will find true success and happiness if you have only one goal. There really is only one, and that is this: to fulfill the highest, most truthful expression of yourself as a human being.\n\nI really believe when you give to other people, you give to yourself.\n\nWhen your to-do list has you coming undone, you have to step back and come back to center. Without a connection to something that is real, you will lose your way.\n\nI don’t believe in failure. It’s not failure if you enjoyed the process.\n\nYou know you are on the road to success if you would do your job and not be paid for it.\n\nDoing the best at this moment puts you in the best place for the next moment.\n\nFact Check: We strive for accuracy and fairness. If you see something that doesn’t look right, contact us!\n\n..", "images": ["https://www.biography.com/_assets/design-tokens/biography/static/images/logos/logo.5ec9b18.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2189275794-crop-675c4d3701992.jpg?crop=0.646xw:0.646xh;0.165xw,0.0144xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/biography/static/images/logos/network-logo.04aa008.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/oracle-co-founder-cto-and-executive-chairman-larry-ellison-news-photo-1757603680.pjpeg?crop=0.470xw:0.705xh;0.315xw,0.0366xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/oprah-winfrey-attends-the-ee-british-academy-film-awards-2014-at-the-royal-opera-house-on-february-16-2014-in-london-england-photo-by-anthony-harveygetty-images.jpg?crop=1.00xw:0.769xh;0,0.00491xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/michelle-obama-9-raw.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/and-founder-dov-charney-at-american-apparel-factory-news-photo-1750189766.pjpeg?crop=0.590xw:0.885xh;0.246xw,0.114xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/stephen-jones-gene-jones-jerry-jones-charlotte-jones-news-photo-1755099310.pjpeg?crop=0.612xw:0.911xh;0.212xw,0.0889xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://hips.hearstapps.com/hmg-prod/images/robert-redford-gettyimages-1186761501.jpg?crop=1.00xw:1.00xh;0,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/founder-sam-bankman-fried-leaves-from-manhattan-federal-news-photo-1758909571.pjpeg?crop=0.733xw:0.935xh;0.138xw,0.0646xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/colorado-vail-mountain-portrait-of-smokey-the-bear-in-news-photo-1755031694.pjpeg?crop=0.607xw:0.922xh;0,0.0243xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://www.biography.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://www.biography.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://hips.hearstapps.com/hmg-prod/images/openai-ceo-sam-altman-poses-during-the-artificial-news-photo-1755716119.pjpeg?crop=0.647xw:0.966xh;0.0465xw,0.0336xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/disneyland-opening-17-july-1955-anaheim-orange-california-news-photo-1751909379.pjpeg?crop=0.794xw:1.00xh;0.173xw,0&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/oprah-winfrey-attends-the-oprah-winfrey-show-season-24-kickoff-party-on-michigan-avenue-on-september-8-2009-in-chicago-illinois-photo-by-tasos-katopodis_getty-images.jpg?crop=1xw:0.7713414634146342xh;center,top&resize=300:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/houseofguinness-episodicimage-firstlook-7-68cc28cc15548.jpg?crop=0.554xw:0.989xh;0.224xw,0&resize=360:*", "https://hips.hearstapps.com/vidthumb/92ed6f8b-7955-44ad-be75-f3b656558fa6/92ed6f8b-7955-44ad-be75-f3b656558fa6_image.jpg?crop=1xw:1.0xh;center,top", "https://hips.hearstapps.com/hmg-prod/images/oprah-winfrey-arrives-at-the-premiere-of-owns-david-makes-news-photo-1678107172.jpg?crop=1.00xw:0.863xh;0,0.00149xh&resize=640:*", "https://hips.hearstapps.com/hmg-prod/images/stedman-graham-and-oprah-winfrey-attend-the-butler-new-york-news-photo-1678127294.jpg?crop=0.960xw:1.00xh;0.0397xw,0&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/sean-diddy-combs-on-friday-september-15-2023-news-photo-1711468298.jpg?crop=0.674xw:1.00xh;0.137xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/oprah-winfrey-receives-the-2013-presidential-medal-of-news-photo-1678128112.jpg?crop=0.715xw:1.00xh;0,0&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/oprah-winfrey-arrives-at-the-premiere-of-owns-david-makes-news-photo-1678107564.jpg?crop=1.00xw:0.433xh;0,0.165xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/oprah-winfrey-hosting-am-chicago-news-photo-1678377738.jpg?crop=0.855xw:0.857xh;0.0276xw,0.0468xh&resize=980:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2194420718-67d9b4e326598.jpg?crop=0.638xw:0.957xh;0.154xw,0.0409xh&resize=360:*", "https://hips.hearstapps.com/rover/profile_photos/8ebb24a5-6121-4849-a984-bf608cacdd3c_1729282614.file?fill=1:1&resize=120:*", "https://hips.hearstapps.com/hmg-prod/images/oprah-winfrey-gettyimages-52739564.jpg?crop=1xw:0.8888888888888888xh;center,top&resize=300:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://hips.hearstapps.com/hmg-prod/images/oprah-winfrey-celebrates-the-launching-of-her-new-magazine-news-photo-1678382310.jpg?crop=0.753xw:1.00xh;0.105xw,0&resize=980:*", "https://hips.hearstapps.com/rover/profile_photos/b50d4909-0f39-4b73-b482-46d0a9078d40_1682363012.file?fill=1:1&resize=120:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/oprah-winfrey-arrives-at-the-premiere-of-owns-david-makes-news-photo-1678107564.jpg?crop=1.00xw:0.433xh;0,0.165xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.biography.com/movies-tv/oprah-winfrey", "title": "Oprah Winfrey: Biography, Talk Show Host, Philanthropist", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Oprah Winfrey: Biography, Talk Show Host, Philanthropist", "description": "Billionaire media executive and philanthropist Oprah Winfrey is best known for hosting her own internationally popular talk show from 1986 to 2011.", "theme-color": "#000000", "og": {"site_name": "Biography", "title": "Oprah Winfrey: The Queen of All Media", "description": "Billionaire media executive and philanthropist Oprah Winfrey is best known for hosting her internationally popular talk show from 1986 to 2011. From there, she launched her television network, OWN.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/oprah-winfrey-arrives-at-the-premiere-of-owns-david-makes-news-photo-1678107564.jpg?crop=1.00xw:0.433xh;0,0.165xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.biography.com/movies-tv/oprah-winfrey", "type": "article"}, "article": {"publisher": "https://www.facebook.com/Biography", "opinion": "false", "section": "Movies & TV", "modified_time": "2024-02-05T00:18:00Z", "published_time": "2024-02-05T00:18:00Z"}, "parsely-metadata": "{\"socialHeadline\":\"Oprah Winfrey: The Queen of All Media\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/oprah-winfrey-arrives-at-the-premiere-of-owns-david-makes-news-photo-1678107564.jpg?crop=0.989xw:0.851xh;0.00489xw,0.0112xh&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/oprah-winfrey-arrives-at-the-premiere-of-owns-david-makes-news-photo-1678107564.jpg?crop=1.00xw:0.433xh;0,0.165xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/oprah-winfrey-arrives-at-the-premiere-of-owns-david-makes-news-photo-1678107564.jpg?crop=0.989xw:0.851xh;0.00489xw,0.0112xh", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/oprah-winfrey-arrives-at-the-premiere-of-owns-david-makes-news-photo-1678107564.jpg?crop=1.00xw:0.433xh;0,0.165xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "never", "sailthru.excerpt": "1954–Who Is Oprah Winfrey?Oprah Winfrey is an Emmy Award–winning talk show host, media executive, Academy Award–nominated actress, and philanthropist. She’s best known for being the host of her wildly popular program, The Oprah Winfrey Show, which aired for 25 seasons, from 1986 to 2011. Its success helped her become the", "sailthru.tags": "movies-tv,Movies & TV,entrepreneurs,Entrepreneurs,philanthropists,Philanthropists,academy-awards,Academy Awards,womens-history,Women’s History,black-history-month,Black History,Biography-US", "sailthru.date": "2024-02-05 00:18:00", "sailthru.socialtitle": "Oprah Winfrey: The Queen of All Media", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1707092280.0, "source": "https://www.biography.com", "summary": ""}