{"url": "https://comicbook.com/thewalkingdead/2018/06/01/the-walking-dead-andrew-lincoln-leaving-fans-threaten-stop-watching/", "text": "A subset of Walking Dead fans are taking to social media with threats to stop watching after the looming exit of leading man Andrew Lincoln, who will be departing the zombie drama after eight years as series protagonist Rick Grimes.\n\nVideos by ComicBook.com\n\nWord of Lincoln’s retirement from the long-running series broke Tuesday, with ComicBook.com exclusively revealing AMC is expected to officially announce Lincoln’s exit ahead of his final episodes in season 9.\n\nAccording to reports, AMC aims to bump Daryl Dixon star Norman Reedus up to leading man status with a $20 million payday while Lincoln and Maggie Rhee actress Lauren Cohan are “phased out” with just a handful of episodes in the upcoming season 9.\n\nThe Walking Dead season 8 saw the show drop to its lowest ratings since its first season in 2010, bringing in just a 2.9 rating in adults 18—49 and 6.8 million viewers in Nielsen Live+Same Day numbers with episode 8×10, ‘The Lost and the Plunderers.’\n\nThat episode followed the mid-season premiere, ‘Honor,’ which controversially killed off longtime survivor Carl Grimes (Chandler Riggs).\n\nWith the upcoming exits of both Lincoln and Cohan — and the already significant losses of Riggs’ Carl and Lennie James’ Morgan, who made the leap to spinoff Fear The Walking Dead at the start of its fourth season — The Walking Dead risks losing even more viewership once two of its biggest stars are gone before the mid-season finale.\n\n@JonZarlengz, @Craig14_MUFC, @_zac15\n\nAndrew Lincoln (Rick Grimes) will be leaving The Walking Dead by the end of next season.\n\n\n\nI knew I had every reason to want to stop watching it. They should have ended it this season when they had the chance… — Jon Z (@JonZarlengz) May 29, 2018\n\nAndrew Lincoln leaving TWD would be disastrous. Tbf I’d stop watching the show altogether as I can’t see the show going anywhere without him. #thewalkingdead #andrewlincoln — CRAIG (@Craig14_MUFC) June 1, 2018\n\nSo since Andrew Lincoln is leaving TWD and Rick’s being done dirty, I will give the show a rest and stop watching after S9 — Zac Annarumma (@_zac15) June 1, 2018\n\n@CoCoMathew, @sunnyclouds_, @AnthonyQuarton\n\nI’m actually glad #AndrewLincoln is evidently leaving #TWD now I can stop watching it!!! ??? — CoCo? (@CoCoMathew) June 1, 2018\n\nNot even kidding but if Andrew Lincoln leaves twd I’m gonna stop watching it if it carries on that’s the tea — nicole ? (@sunnyclouds_) May 30, 2018\n\nAfter Andrew Lincoln leaves ‘The Walking Dead’, I’ll stop watching it.\n\n\n\nSorry 🙁 #walkingdead — uoʇɹɐnb ʎuoɥʇuɐ (@AnthonyQuarton) May 30, 2018\n\n@villamatt1874, @jamesdwyer192\n\nAs soon as Andrew Lincoln leaves TWD, that’s when I stop watching. — WembleyAVFCMatt (@villamatt1874) May 30, 2018\n\nAs soon as Andrew Lincoln leaves TWD, that’s when I stop watching. — WembleyAVFCMatt (@villamatt1874) May 30, 2018\n\nAndrew Lincoln leaving…Lauren Cohen leaving…Norman Reedus taking the lead role…and now Danai Gurira possibly leaving…i think it’s time to finish The Walking Dead… — ? James Dwyer ? (@jamesdwyer192) May 30, 2018\n\n@TheeStockBomb, @Dust103194, @TWDFamilyy\n\nI’m done with the walking dead now. Rick Maggie and Michone to leave…#Pointless — Michael Stockley (@TheeStockBomb) June 1, 2018\n\nIf it’s true that Andrew Lincoln is leaving The Walking Dead after season 9 then I am officially done with the show. Killing Carl was bad enough, but now Rick? — dustin (@Dust103194) May 29, 2018\n\nI know Rick Grimes and everyone on this show has to die “eventually” but we are going on S9, and when basically the main character is done with the show, I think they need to wrap it up and end it how they planned to end it. — The Walking Dead (@TWDFamilyy) May 29, 2018\n\n@AthosVartis, @_frankiemarrone, @fartoonsprod\n\nAndrew Lincoln leaving The Walking Dead!?I was going to stick with the show, but I’m done. Rick is the absolute center. They would have a very hard time doing it well without him. Season 9 should be the end. It doesn’t sound like they’re going to end it, but they should. — Athos Vartis (@AthosVartis) May 29, 2018\n\nThe walking dead is DONE now that Andrew Lincoln is leaving. Ive never been more upset and frustrated — Frankie (@_frankiemarrone) May 29, 2018\n\nI said from the beginning if Rick Grimes is killed off in The Walking Dead I will quit watching. It appears as though that time has come. It is like losing a best friend. ? But I have to thank Andrew Lincoln for eight glorious seasons. #TWD — FARToons (Ryan) (@fartoonsprod) May 31, 2018\n\n@Sciles__, @MrsBettieBinx, @infiniteh0rror, @elvenora\n\nWTF Andrew Lincoln is leaving walking dead after season 9 wow well this show is done . It won’t survive without him #TheWalkingDead — K (@Sciles__) May 29, 2018\n\nIf Andrew Lincoln leaves The Walking Dead, I’m done watching. I’m about done work Fear the Walking Dead too. — xuıq✨ǝıʇʇǝq (@MrsBettieBinx) May 30, 2018\n\nThe Walking Dead needs to quit it with all this moneygrab and next season spoiler bullshit. I get that they know they went far past the point of no return with the show, but this is just excsssive. I hope it ends next season, they’ve just fucked it up too much. — Meghann ✨ (@infiniteh0rror) June 1, 2018\n\nThe fact that Andrew Lincoln will quit The Walking Dead, is like the last drop. I really don’t want to watch it anymore. — Musashi ? (@elvenora) May 30, 2018\n\n@smvkeandmirrors, @MikeDoNot, @EmilyStewart6, @sam_3246\n\nandrew lincoln/rick grimes is the most important person on the walking dead.. idc what you say, there’s no show without him. — ana (@smvkeandmirrors) May 29, 2018\n\nHonestly, they killed off Carl and Andrew Lincoln is leaving the show. Is there really a point to watching The Walking Dead now? — Mike Don’t (@MikeDoNot) June 1, 2018\n\nAndrew Lincoln is leaving The Walking Dead so I think I can safely say that I’m done with the show now — Emily Stewart (@EmilyStewart6) May 29, 2018\n\nWell I think that’s The Walking Dead done with and if not I’m done with it — Sam (@sam_3246) May 29, 2018\n\nSo #TheWalkingDead killed off Carl, sent Morgan to its spin-off show, wouldn’t pay Lauren Cohan what she deserved, and now reportedly Andrew Lincoln (aka Rick) is leaving after next season. Has AMC royally screwed up or what? — Bradly Alan (@HereLiesBradly) May 29, 2018\n\n@TWDFamilyy, @DaleDownton, @joesiano24, @lovinglaggie\n\nI love this show SO much. But Andrew Lincoln is THE show. We have been following him since the very first episode. I can’t imagine the show without Rick Grimes. — The Walking Dead (@TWDFamilyy) May 29, 2018\n\nReportedly, Andrew Lincoln is leaving The Walking Dead after the ninth season. The show is dead. It’s done. It needs to look at the flowers and have a bullet put into its head. — Kendrick D. Downton (@DaleDownton) May 29, 2018\n\nI think I’m going to give up on the Walking Dead now that Rick Grimes is leaving the show. What’s the point of the show without him? — J (@joesiano24) June 1, 2018\n\nThe walking dead without them is a show not worth watching. They’re so important. pic.twitter.com/bF0H31WAGZ — el (@lovinglaggie) May 29, 2018\n\n@sonnaluv76, @ZigZagSwag, @MariamHosny1997, @TheKidT_Webb, @KwikWarren\n\nThe show is nothing without Andrew Lincoln. Not worth watching if Rick Grimes is gone!! He is The STORY of The Walking Dead!!#AndrewLincoln — SonnaRodrigueZ (@sonnaluv76) May 31, 2018\n\nIf Rick leaves walking dead I’m not watching the show no more — ZIG (@ZigZagSwag) May 30, 2018\n\nThe Walking Dead without Andy is equal to not having a show. I am not watching TWD after Rick leaves. Bravo. It’s ruined. — Mariam (@MariamHosny1997) June 1, 2018\n\nThis man Rick Grimes is leaving The Walking Dead. I’m not watching it once he leaves — Thomas Webb (@TheKidT_Webb) June 1, 2018\n\nIf Andrew Lincoln is leaving The Walking Dead after next season, then next season needs to be the last season of The Walking Dead. End of discussion. That show w/o Rick Grimes is like Batman w/o Bruce Wayne. — Kenny BooYah! (@KwikWarren) May 29, 2018\n\nSlide 10\n\nif andrew lincoln is really leaving after season nine, then the walking dead should end with season nine. you CAN’T do the walking dead without rick grimes. — edy (@edylue) May 29, 2018\n\n#TheWalkingDead won’t be the same without Andrew Lincoln/Rick Grimes, I don’t even want to watch the show without him in it. So many of the main cast members are already gone and now Rick! They might as well end the show now. — Azad (@Azadkhan95) May 29, 2018\n\nAndrew Lincoln (rick) is leaving the walking dead omg,, they might as well end the show because now they don’t even have the Carl story line to follow BECAUSE THEY KILLED HIM — georgia | 71 (@bearshowell) May 29, 2018\n\nIf Rick leaves #TheWalkingDead. I’m going to stop watching it. Andrew Lincoln IS The Walking Dead!!!! without him the show is nothing! Killing off Carl was one of the worst decisions Scott Gimple ever made.. that’s why Lincoln is leaving. Gimple should be fired! @WalkingDead_AMC — Rachel Keane (@rachelkeane99) May 30, 2018\n\nCancel walking dead if Andrew lincoln isn’t part of the cast. — Noah Pascarella (@Noah_bulls1) May 30, 2018\n\nSo yeah. I’m officially finished with The Walking Dead after season 9 (and that’s if I even watch that because there’s a million reasons not to). I love Daryl Dixon as much as the next guy but without Rick and Maggie, it just won’t work for me. They should cancel the show. — Matt? (@MrWhelan101) May 29, 2018\n\nI kind of lost interest in walking dead during this Negan storyline but Andrew Lincoln leaving in Season 9 does not entice me to start watching again.\n\n\n\nThey pretty much killed off most of the characters I liked anyway or butchered the ones who are still alive into something dumb pic.twitter.com/CavkOGVK3m — Tommy (@sirtommyguns) May 29, 2018\n\nThe Walking Dead returns this October on AMC.", "images": ["https://comicbook.com/wp-content/uploads/sites/4/2025/11/Blooming-Love-Shonen-Jump.jpg?w=300", "https://sb.scorecardresearch.com/p?c1=2&c2=8568956&cj=1", "https://pixel.quantserve.com/pixel/p-KpNhwJ0RxTQPU.gif", "https://comicbook.com/wp-content/uploads/sites/4/2024/10/ComicBook-logo_40a31d.png", "https://comicbook.com/wp-content/uploads/sites/4/2025/11/more-recent-sci-fi-movies.jpg?w=300", "https://comicbook.com/wp-content/uploads/sites/4/2025/11/lego-black-friday.jpeg?w=300", "https://comicbook.com/wp-content/uploads/sites/4/2025/03/Netflix-Logo-N.jpg?w=300", "https://comicbook.com/wp-content/uploads/sites/4/2025/08/Dexter-Resurrection-Suit.jpg?w=300", "https://comicbook.com/wp-content/uploads/sites/4/2025/04/Cartoon-Network-Studios-Logo.jpg?w=300", "https://comicbook.com/wp-content/uploads/sites/4/2025/11/zodiac-streaming-netflix.jpg?w=300", "https://comicbook.com/wp-content/uploads/sites/4/2025/11/Ubisoft-Logo.jpg?w=300", "https://comicbook.com/wp-content/themes/comicbook-2024/assets/images/comicbook-logo-white.png", "https://comicbook.com/wp-content/uploads/sites/4/2024/05/eb9b8d3d-fe15-45d5-ab1e-bc17074dabe4.png?w=1200"], "top_img": "https://comicbook.com/wp-content/uploads/sites/4/2024/05/eb9b8d3d-fe15-45d5-ab1e-bc17074dabe4.png?w=1200", "keywords": [], "authors": ["Cameron Bonomolo", ".Wp-Block-Savage-Platform-Post-Byline Font-Family Var --Wp--Custom--Typography--Font-Family--Secondary", "Font-Size Var --Wp--Custom--Typography--Font-Size--Sm", "Font-Weight Var --Wp--Custom--Typography--Font-Weight--Bold", "Line-Height Var --Wp--Custom--Typography--Line-Height--Xxs", ".Wp-Block-Savage-Platform-Post-Byline A Font-Weight Var --Wp--Custom--Typography--Font-Weight--Black", "Text-Decoration None", ".Wp-Block-Savage-Platform-Post-Byline Font-Family Var --Wp--Custom--Typography--Font-Family--Primary", "Font-Size Var --Wp--Custom--Typography--Font-Size--Tiny", "Media Min-Width"], "canonical_link": "https://comicbook.com/the-walking-dead/news/the-walking-dead-andrew-lincoln-leaving-fans-threaten-stop-watching/", "title": "‘The Walking Dead’ Fans Threaten To Stop Watching After Andrew Lincoln Exit", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "‘The Walking Dead’ Fans Threaten To Stop Watching After Andrew Lincoln Exit", "description": "A subset of Walking Dead fans are taking to social media with threats to stop watching after the looming exit of leading man Andrew Lincoln, who will be departing the zombie drama after eight years as series protagonist Rick Grimes. Word of Lincoln’s retirement from the long-running series broke Tuesday, with ComicBook.com exclusively revealing AMC […]", "url": "https://comicbook.com/the-walking-dead/news/the-walking-dead-andrew-lincoln-leaving-fans-threaten-stop-watching/", "site_name": "ComicBook.com", "image": {"identifier": "https://comicbook.com/wp-content/uploads/sites/4/2024/05/eb9b8d3d-fe15-45d5-ab1e-bc17074dabe4.png?w=1200", "width": 1200, "height": 670, "type": "image/png"}}, "article": {"published_time": "2018-06-03T22:59:00+00:00", "modified_time": "2024-10-06T08:51:44+00:00"}, "author": "Cameron Bonomolo", "twitter": {"card": "summary_large_image", "label1": "Written by", "data1": "Cameron Bonomolo", "label2": "Est. reading time", "data2": "4 minutes"}, "generator": "WordPress 6.8.3", "msapplication-TileImage": "https://comicbook.com/wp-content/uploads/sites/4/2024/10/cropped-ComicBook-icon_808e20.png?w=270"}, "movies": [], "publish_date": 1527825600.0, "source": "https://comicbook.com", "summary": ""}