{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/christopher-wallace-jr-net-worth/", "text": "What is Christopher Wallace, Jr.'s net worth?\n\nChristopher Wallace, Jr. is an American actor who has a net worth of $20 million. Christopher Wallace, Jr. is the son of the late Notorious B.I.G. and Faith Evans. He was six months old when his father was shot in what is still an unsolved drive-by murder. His father was one of the most successful rap artists of the 90s.\n\nGrowing up in the shadow of hip-hop royalty, Wallace Jr. has approached his father's legacy with both respect and a determination to establish his own identity. He made his first foray into entertainment playing a young version of his father in the 2009 biopic \"Notorious,\" a role that brought him significant attention at age 12. This experience helped spark his interest in the entertainment industry, though he would ultimately pursue multiple creative and entrepreneurial ventures.\n\nAs a young adult, Wallace Jr. ventured into acting, appearing in films including \"Everything Must Go\" (2010) alongside Will Ferrell and the coming-of-age drama \"Kicks\" (2016). His acting career demonstrated his desire to make his own mark in entertainment rather than simply trading on his father's name.\n\nIn 2019, Wallace Jr. launched Think BIG, a cannabis company focused on wellness and social justice initiatives. The company's name pays tribute to his father's nickname while addressing modern social issues, particularly the impact of cannabis criminalization on communities of color. This venture reflects his commitment to combining business with social responsibility and his father's legacy with contemporary causes.\n\nBeyond his business ventures, Wallace Jr. has been actively involved in preserving and extending his father's musical legacy. He has participated in various tribute events and documentaries about The Notorious B.I.G., offering personal insights into his father's impact on hip-hop culture and his family. However, he has consistently avoided trying to replicate his father's rap career, instead choosing to honor the legacy while pursuing his own distinct path.\n\nIn interviews, Wallace Jr. has spoken thoughtfully about growing up without his father but with the weight of his enormous cultural influence. He maintains close relationships with his mother Faith Evans, his grandmother Voletta Wallace, and his sister T'yanna Wallace, forming a tight-knit family unit that has helped preserve and extend the Wallace family legacy.\n\nThrough his various endeavors, Christopher Wallace Jr. has demonstrated a mature understanding of how to balance his father's legacy with his own aspirations. Rather than trying to fill his father's shoes in hip-hop, he has chosen to honor that legacy while blazing his own trail through entrepreneurship and advocacy. His approach to business and social justice initiatives suggests an understanding that his father's impact can be honored through more than just music, extending into broader efforts to create positive change in society.\n\nThe Notorious B.I.G.'s Wealth and Estate\n\nNet Worth at the Time of His Death\n\nWhen The Notorious B.I.G. (Christopher Wallace) was tragically killed in 1997, his estimated net worth was around $10 million. His wealth primarily came from his multi-platinum albums, performances, and music industry ventures. However, his estate would grow exponentially in the decades following his passing.\n\nWho Inherited His Estate?\n\nBiggie did not have a formal will, so his estate was overseen by his mother, Voletta Wallace, who became its administrator. His two children, T'yanna Wallace and Christopher \"C.J.\" Wallace Jr., were the primary beneficiaries, with their inheritance placed in trust funds. His widow, Faith Evans, also played a key role in managing his legacy but did not take a significant portion of the estate for herself.\n\nGrowth of the Estate Over Time\n\nDespite his young age at death, Biggie's estate has grown tremendously. Through music sales, streaming, licensing, and merchandising, the estate's value has surged to an estimated $50–$100 million. His albums continue to sell millions of copies, and his music is frequently streamed, keeping royalty revenues high.\n\nPosthumous releases, licensing deals, and his image being used in films, documentaries, and merchandise have further contributed to the estate's success. His music is widely featured in commercials, movies, and video games, ensuring a steady income stream.\n\nManagement of the Estate\n\nVoletta Wallace was the estate's primary decision-maker, overseeing branding, licensing, and music-related projects until her death in 2025. Faith Evans has also played a key role in preserving Biggie's legacy. The estate is operated through Notorious B.I.G., LLC, which ensures that profits are distributed to Biggie's heirs and that his brand remains protected.\n\nBoth of Biggie's children have become involved in the family business. T'yanna Wallace has launched a clothing line inspired by her father, while C.J. Wallace has pursued acting and other ventures tied to his father's name. Both have received significant financial benefits from their father's legacy.\n\nPosthumous Business Ventures\n\nBiggie's estate continues to expand into modern business ventures. In 2022, the estate launched an NFT collection, tapping into digital markets to generate new revenue. The estate has also been vigilant in protecting his image, taking legal action against unauthorized uses of his likeness to maintain control over his brand.\n\nAdditionally, the estate supports charitable efforts through the Christopher Wallace Memorial Foundation, which funds education and community programs in honor of Biggie.\n\nLegacy and Ongoing Revenue Streams\n\nEvery anniversary of Biggie's death or his album releases brings renewed interest in his music. Special edition vinyl releases, documentary films, and media projects drive increased streaming and merchandise sales. His estate remains one of the most profitable of any late celebrity, continuing to generate millions annually.", "images": ["https://vz.cnwimg.com/thm/1JoH3482haSLevnlEMdqhrz36y0=/132x132/center/top/filters:format(webp)/2009/11/George-Clooney.jpg", "https://vz.cnwimg.com/thm/I4dSiTJhq0kprSuO--deoPCEAmQ=/132x132/center/top/filters:format(webp)/2020/06/taylor.png", "https://vz.cnwimg.com/thm/uRsxoLs7Ymmit5ATgRtN2utad40=/221x5:381x236/132x132/filters:format(webp):strip_exif()/2009/09/P-Diddy.jpg", "https://vz.cnwimg.com/thm/KNDSqD-9inbRekV6AGgXDEG2Scw=/375x35:810x586/132x132/filters:format(webp):strip_exif()/2015/09/GettyImages-476575299.jpg", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "https://vz.cnwimg.com/thm/0dOqT2nlNQM7u_J-5xWrCsf2nAw=/132x132/center/top/filters:format(webp)/2020/02/Angelina-Jolie.png", "https://vz.cnwimg.com/thm/Y14fttV9jls9mxFLuNAHJTnNWTE=/132x132/center/top/filters:format(webp)/2019/10/denzel-washington-1.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/thm/lt1abKKVHSBtY-US0k9GLU9MTmM=/132x132/center/top/filters:format(webp)/2009/09/Brad-Pitt.jpg", "https://vz.cnwimg.com/thm/DoloVjR3rMEs48lY3rl27gZEunI=/132x132/center/top/filters:format(webp)/2021/01/Voletta-Wallace-1.jpg", "https://vz.cnwimg.com/thm/eoylqzzz7tLvKUxYX7pvSceI6D4=/600x300/center/top/filters:format(webp)/2021/01/Voletta-Wallace.jpg", "https://vz.cnwimg.com/thm/IDQbmUWZlHZXHdEKRE8IR63231g=/132x132/center/top/filters:format(webp)/2020/12/Suzette-Quintanilla.png", "https://vz.cnwimg.com/thm/7beZ9XxffktAeQmSJ5xjoj1ZtMg=/132x132/center/top/filters:format(webp)/2020/10/faith-evans.jpg", "https://vz.cnwimg.com/thm/IoWqGPmFDjvC6iTqcDsspXBuxqo=/132x132/center/top/filters:format(webp)/2018/03/GettyImages-821622848.jpg", "https://vz.cnwimg.com/wp-content/uploads/2021/01/Voletta-Wallace.jpg?x46379", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/thm/dXuAPIEBU--L_kRib4u0nSzjUtE=/132x132/center/top/filters:format(webp)/2020/04/Megan-Fox.jpg", "https://vz.cnwimg.com/thm/zPmtTy-VBa17TR6wtyJGYW0VPvw=/132x132/center/top/filters:format(webp)/2020/02/notorious-big.jpg", "https://vz.cnwimg.com/thm/lY3-oCS-xIdiqDaOi1qHd6UaTjg=/132x132/center/top/filters:format(webp)/2009/09/Cristiano-Ronaldo.jpg", "https://vz.cnwimg.com/thm/ogXKS17r07BFFRTRn-EDRV62OoU=/132x132/center/top/filters:format(webp)/2021/02/wallace.png", "https://vz.cnwimg.com/thm/KFAqJ9F4o80l6an2fe78-0jw28s=/132x132/center/top/filters:format(webp)/2019/04/rr.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2021/01/Voletta-Wallace.jpg?x46379", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/christopher-wallace-jr-net-worth/", "title": "Christopher Wallace Jr Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Christopher Wallace, Jr. is an American actor who has a net worth of $20 million. Christopher Wallace, Jr. is the son of the late Notorious B.I.G. and Faith Evans.", "slick": {"wpversion": "3.0.1", "wppostid": 53482, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2021/01/Voletta-Wallace.jpg?x46379", "group": "post", "category": "actors:Actors"}, ";": "richest-celebrities:Richest Celebrities", "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "cnw": {"wppostid": 53482}, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Christopher Wallace Jr Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/christopher-wallace-jr-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2021/01/Voletta-Wallace.jpg?x46379", "site_name": "Celebrity Net Worth", "description": "What is Christopher Wallace Jr's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2025-02-21T19:33:27+00:00", "published_time": "2025-02-21T05:41:15+00:00", "section": "Actors", "tag": "T'yanna Wallace net worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2021/01/Voletta-Wallace.jpg?x46379", "title": "Christopher Wallace Jr Net Worth", "description": "Christopher Wallace, Jr. is an American actor who has a net worth of $20 million. Christopher Wallace, Jr. is the son of the late Notorious B.I.G. and Faith Evans."}}, "movies": [], "publish_date": 1740116475.0, "source": "https://www.celebritynetworth.com", "summary": ""}