{"url": "https://en.wikipedia.org/wiki/List_of_most_streamed_songs_on_Spotify#100_most_streamed_songs", "text": "The following lists contain the most streamed songs and albums as well as chart records on the audio streaming platform Spotify.\n\nMost-streamed songs [ edit ]\n\nOn this list, songs are ranked by cumulative streams since their release. This section features the top 100 most streamed songs.\n\nArtists with the highest number of songs currently in the top 100 [ edit ]\n\nHistorical most-streamed songs [ edit ]\n\nCurrent record of longest time held\n\nBillions of streams at the time song became most-streamed.\n\nMilestones and achievements for songs [ edit ]\n\nWeekly number-one songs [ edit ]\n\nKey # Indicates current number-one song ‡ Indicates number-one Spotify Wrapped song of the year [ E ]\n\nAnnual top five most-streamed songs [ edit ]\n\nDrake has topped the annual most-streamed songs list a record two times.\n\nThe following table lists the five songs that Spotify reported as most-played in each calendar year.\n\nThe following table lists the top song that Spotify reported as most-played in each calendar year for the years 2008 to 2011.\n\nMost-streamed songs in a single day [ edit ]\n\nNon-seasonal songs [ edit ]\n\nThe following table lists the 20 non-seasonal songs to receive the most streams in a single day, as registered on the Spotify Global Daily chart.[121]\n\nChristmas seasonal songs [ edit ]\n\nThe following table lists the 20 songs associated with the Christmas season that received the most streams in a single day, as registered on the Spotify Global Daily chart. Historically, these songs have performed best yearly on 24 December, and often reach new peaks with each season.[121]\n\nHistorical number one most-streamed non-seasonal songs in a single day [ edit ]\n\nThe following table lists the progression by date of number one ranked most-streamed songs in a single day, as registered on the Spotify Global Weekly chart.[131]\n\nKey # Indicates most days at number one\n\nMost-streamed songs in a single week [ edit ]\n\nThe following table lists the top 20 most-streamed in a single week, as registered on the Spotify Global Weekly chart.[131]\n\nHistorical number one most-streamed songs in a single week [ edit ]\n\nThe following table lists the progression by date of number one ranked most-streamed songs in a single week, as registered on the Spotify Global Weekly chart.[131]\n\nKey # Indicates most days at number one\n\nLongest-running number-one songs by days [ edit ]\n\nThe following table lists the songs with more than 60 days in the number 1 position on the Global Spotify Chart.[131]\n\nProgression of the record for longest-running non-seasonal number-one songs by days [ edit ]\n\nThe following table lists the progression for the record of most number of days for non-seasonal songs in the number 1 position on the Global Spotify Chart, showing the date the record was achieved and the length the record was held (in the case of the current record holder, \"Die with a Smile\", has been held).\n\nkey # Indicates most days record held\n\nFastest songs to reach one billion streams [ edit ]\n\nThe following table lists the top 10 songs which have reached one billion streams the fastest.\n\nMost-streamed albums [ edit ]\n\nAs of November 2025, Un Verano Sin Ti (2022) by Puerto Rican rapper Bad Bunny is the most-streamed album of all time on Spotify, while Sour (2021) by American singer Olivia Rodrigo is the most-streamed album by a female artist. Canadian singer the Weeknd is the only male artist with multiple albums in the top 10, while Albanian-British singer Dua Lipa is the only woman with multiple albums in the top 10. The newest album in the top 10 is currently Avicii Forever (2025) by Swedish DJ Avicii, while the oldest album in the top 10 is currently Starboy (2016) by the Weeknd.\n\nThe following table lists the top 10 most-streamed albums on Spotify, with streams rounded to the nearest million, as well as the number of tracks, the artist and the date it was released.\n\nMilestones and achievements for albums [ edit ]\n\nAnnual top five most-streamed albums [ edit ]\n\nThe following table lists the five albums most-played on Spotify in each calendar year.\n\nMost streamed albums in a single day [ edit ]\n\nThe following table lists the most streamed albums in a single day, registering the total of obtained streams, the artist, the publication of the album and the date in which these streams were reached.[207]\n\nHistorical number one most-streamed album in a single day [ edit ]\n\nThe following table lists the progression by date of number one ranked most-streamed albums in a single week, as registered on the Spotify Global Weekly chart.[131]\n\nKey # Indicates most days at number one\n\nMost streamed albums in a single week [ edit ]\n\nThe following table lists the most streamed albums in a single week, registering the total of obtained streams, the artist, the publication of the album and the date in which these streams were reached.\n\nHistorical number one most-streamed album in a single week [ edit ]\n\nThe following table lists the progression by date of number one ranked most-streamed albums in a single week, as registered on the Spotify Global Weekly chart.[131]\n\nKey # Indicates most days at number one\n\nSee also [ edit ]\n\nNotes [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/GagaSpurs290722_%2833_of_39%29_%2852250248117%29_%28cropped_2%29.jpg/250px-GagaSpurs290722_%2833_of_39%29_%2852250248117%29_%28cropped_2%29.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/BrunoMars24KMagicWorldTourLive_%28cropped%29.jpg/250px-BrunoMars24KMagicWorldTourLive_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Bad_Bunny_2019_by_Glenn_Francis_%28cropped%29.jpg/250px-Bad_Bunny_2019_by_Glenn_Francis_%28cropped%29.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Drake_July_2016.jpg/250px-Drake_July_2016.jpg", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/20px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/2024_Spotify_Logo.svg/120px-2024_Spotify_Logo.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_Spotify_streaming_records", "title": "List of Spotify streaming records", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.3", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "viewport": "width=1120", "og": {"title": "List of Spotify streaming records - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}