{"url": "mightynest.com/learn/research-by-concern/dangers-of-triclosan", "text": "The chemical Triclosan was introduced in 1972 for use as a surgical scrub in hospitals. Since then, it has increasingly been added to a wide variety of products. In a culture that has become more germ-obsessed than ever, companies have marketed products of all kinds to keep germs at bay. From airports to grocery stores to gyms and many more public spaces, there's a dispenser ready to give you a dose of anti-bacterial goo. The more we see these \"stations\", the more likely we feel the need for a bacteria-killing \"fix\".\n\nWith strains like swine flu causing great panic, it seemed reasonable that people would resort to adding more and more antibacterial products to their exposed skin and cleaning routine. But why not stand behind the old tried and true method of a good 20 second hand wash at the sink? According to the American Medical Association (AMA), there is no evidence that suggests that using antibacterial soap works any more effectively than soap and water.\n\nWhat is Triclosan?\n\nTriclosan is a synthetic chemical with antimicrobial properties which destroy or inhibit the growth of microorganisms such as bacteria or fungi. When triclosan was first introduced in the early 70's for use in hospitals, it was a good thing, as it is crucial to keep medical instruments sterile. However, over the last decade, with the rapid increase in the use of triclosan products, the chemical is becoming ubiquitous.\n\nWhere is Triclosan used? This chemical is used in a wide variety of household products including soaps, toothpaste, cosmetics, deodorant, personal care products, dish detergent, first-aid, kitchenware, toys and even workout clothing! That's a long list when the original intention was just meant for the hospital room.\n\nMarketed under names like \"Microban\" that promises to keep household goods like cutting boards, garden hoses, workout clothes and computer keyboards free of bacteria and \"BioFresh\" for antimicrobial socks that keep your feet odor free.\n\n\n\nWhy is Triclosan harmful? Triclosan is a known endocrine disruptor and a suspected carcinogen. There is good reason to believe that the over use of products with triclosan has contributed to bacterial resistance in the same way we are cautioned against the use of antibiotics. The persistent nature that is connected to the use of triclosan being washed down our drains daily and affecting water life.\n\nTriclosan is also lipophilic, which means it can bioaccumulate in your fat for long periods of time, and as reported by Scientific American, triclosan is now detectable in human breast milk, blood, and urine samples. Environmental Health Perspectives (EHP) found the chemical in 75% of urine samples tested for a study focused on triclosan. And furthermore, the Center for Disease Control and Prevention detected triclosan in 58% of US waterways.\n\nAccording to the FDA, \"Animal studies have shown that triclosan alters hormone regulation. Other studies in bacteria have raised the possibility that triclosan contributes to making bacteria resistant to antibiotics. In light of these studies, the FDA is engaged in an ongoing scientific and regulatory review of this ingredient.\"\n\nRegarding the possible health impacts of triclosan, the F.D.A. also acknowledged, \"valid concerns about the effect of repetitive daily human exposure to these antiseptic ingredients.”\n\nTriclosan safety is currently under review by the F.D.A. and the E.P.A. The Environmental Protection Agency has also previously indicated that because of the amount of research being planned and currently in progress, it will undertake another comprehensive review of triclosan beginning in 2013.\n\nThe use of triclosan is linked to the following effects on human health:\n\nAbnormal endocrine system/thyroid hormone signaling.\n\nWeakening of immune system.\n\nChildren exposed to antibacterial products at an early age have an increased chance of developing allergies, asthma and eczema.\n\nUncontrolled cell growth.\n\nDevelopmental and reproductive toxicity.\n\nHow to keep clean without antibacterials:", "images": ["https://s3.amazonaws.com/braintree-badges/braintree-badge-dark.png", "https://s3-us-west-2.amazonaws.com/mightylegacy/germs.jpg", "https://mightynest.com/favicon.png", "https://s3-us-west-2.amazonaws.com/mightylegacy/imagecache/article_image/articles/triclosan.jpeg", "https://mightynest.com/assets/mn_rebrand-logo-lockup-3bd1d5071564b881011b23f3a3c9fa48e37ee1b9053863b9fc98a691c2a53029.svg", "https://mightynest.s3.amazonaws.com/blog/home/Blog_300x250%402x.webp"], "top_img": "https://mightynest.com/favicon.png", "keywords": [], "authors": [], "canonical_link": "https://mightynest.com/learn/research-by-concern/dangers-of-triclosan", "title": "Dangers of Triclosan", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 269762766497309}, "fragment": "!", "description": "Dangers of Triclosan", "csrf-param": "authenticity_token", "csrf-token": "fvUH8HIhFxnI69aKyWajgF7CzhdVbSUNvEqrmmtgxSmECWIFNs1iP02bgUd-m-3bCiJAcTkWprSZwYTf04J1og"}, "movies": [], "publish_date": null, "source": "https://mightynest.com", "summary": ""}