{"url": "https://en.wikipedia.org/wiki/Keri_Russell", "text": "American actress (born 1976)\n\nNot to be confused with Kerry Rossall\n\nKeri Lynn Russell (born March 23, 1976)[2] is an American actress. Prolific in dramatic television since the 1990s, she has received a record seven nominations for the Critics' Choice Television Award for Best Actress in a Drama Series. She won a Golden Globe Award in 1999 for her lead role in the drama series Felicity, and has received five Primetime Emmy Award nominations and four additional Golden Globe Award nominations for her roles in The Americans and The Diplomat. In 2017, she was honored with a star on the Hollywood Walk of Fame for her contributions to television.\n\nShe first appeared on Disney Channel's revival of The Mickey Mouse Club when she was 15 and was a regular cast member on the show from 1991 to 1994. She made her first film appearance in Honey, I Blew Up the Kid (1992). Russell's other film appearances include We Were Soldiers (2002), Waitress (2007), Dawn of the Planet of the Apes (2014), and Star Wars: The Rise of Skywalker (2019). On stage, she acted in Neil LaBute's off-Broadway play Fat Pig (2004–2005) and made her Broadway debut in the Lanford Wilson revival Burn This (2019).\n\nEarly life [ edit ]\n\nRussell was born on March 23, 1976, in Fountain Valley, California, to Stephanie Stephens, a homemaker, and David Russell, a Nissan Motors executive.[3] She has an older brother and a younger sister. The family lived in Coppell, Texas; Mesa, Arizona; and Highlands Ranch, Colorado, moving frequently due to her father's work.\n\nCareer [ edit ]\n\n1990–2002: Early roles and rise to prominence with Felicity [ edit ]\n\nRussell was a dancer in middle school and high school, and her dancing had helped her get cast on The All New Mickey Mouse Club television show on the Disney Channel.[4][5] Russell was on the show from 1991 to 1994, encompassing seasons four to six.\n\nIn 1992, she appeared in Honey, I Blew Up the Kid and in 1993, had a minor role on the sitcom Boy Meets World as Mr. Feeny's niece. She appeared on Married... with Children in a 1995 episode (\"Radio Free Trumaine\", production 9.24). She subsequently had several film and television roles, including the 1996 made-for-television film The Babysitter's Seduction.[4] That year she also had a role on the short-lived soap opera series Malibu Shores.[4]\n\nIn 1994, Russell appeared as the \"other woman\" in Bon Jovi's music video \"Always\".[6] In 1997, she appeared in two episodes of Roar.[4]\n\nFrom 1998 to 2002, Russell starred as the title character on the successful WB Network series Felicity, and in 1999 won a Golden Globe for the role.\n\nDuring the show's run, Russell appeared in the films Eight Days a Week, The Curve, and Mad About Mambo, all of which received only limited releases in North America. Her next role was in the film We Were Soldiers (2002),[4] as the wife of a United States serviceman during the Vietnam War. The film was released two months before the end of Felicity's run.\n\n2003–2012: Theater and film roles [ edit ]\n\nRussell at the British premiere of Mission: Impossible III, 2006\n\nWhen Felicity ended, Russell moved to New York City and made her off-Broadway stage debut in 2004 in Neil LaBute's Fat Pig.[7] In 2005, she returned to television and film, beginning with an appearance in the Hallmark Hall of Fame television movie The Magic of Ordinary Days, the theatrical film The Upside of Anger, and the television miniseries Into the West. In 2005, director J. J. Abrams asked Russell to join the cast of Mission: Impossible III, and she accepted. She was screen tested for the role of Lois Lane in Superman Returns but lost the part to Kate Bosworth.[8]\n\nIn mid-2006, Russell was chosen to be a celebrity spokeswoman for CoverGirl cosmetics.[9] In the summer of 2007, Russell appeared in The Keri Kronicles, a reality show sitcom sponsored by CoverGirl that aired on MySpace; the show was filmed at Russell's home in Manhattan and spotlighted her life.[10] Also in 2007, she played Melody on the NBC show Scrubs.\n\nRussell next starred in the film Waitress, which marked the fourth time she played a pregnant woman.[11] Her performance was positively received by critics,[10] with Michael Sragow of The Baltimore Sun writing that Russell's performance had \"aesthetic character\" and \"wields tenderness and fierceness with quiet heat\".[12] In 2007, Russell also completed roles in Grimm Love and The Girl in the Park.\n\nRussell next appeared in August Rush, released in November 2007. She later appeared in Bedtime Stories.[13] In an appearance on The View on December 15, 2008, Russell said she got the part because Adam Sandler's wife Jackie had seen her in Waitress and suggested her for the movie. Russell voiced Wonder Woman in a direct-to-video animated feature released on March 3, 2009.[14]\n\nRussell starred in the Tom Vaughan-helmed Extraordinary Measures[15][16] for CBS Films. The drama, released on January 22, 2010, was the company's first film to go into production.[4][17] Russell plays Aileen Crowley, a mother who tries to build a normal home life for her sick children while her husband and an unconventional scientist race against time to find a cure.[18]\n\nRussell starred in the Fox series Running Wilde from 2010 to 2011.[19]\n\n2013–present: The Americans and The Diplomat [ edit ]\n\nFrom 2013 to 2018, Russell starred in the FX drama series The Americans, playing Elizabeth Jennings, a deep-undercover Russian KGB spy living as an American in the 1980s Cold War era. She appeared opposite Matthew Rhys, who portrays her character's husband and spy partner. Russell and Rhys became partners in real life during this time. The series ended after six seasons.[20] For her performance, she was nominated for three consecutive Primetime Emmy Award for Outstanding Lead Actress in a Drama Series, as well as two Golden Globe Award for Best Actress – Television Series Drama. Emily St. James of Vox called her performance \"gorgeously restrained\".[21]\n\nIn 2013, Russell starred in the science-fiction horror film Dark Skies and the romantic comedy film Austenland. In 2014, she starred in the science fiction action film Dawn of the Planet of the Apes, a sequel to 2011's Rise of the Planet of the Apes.[22] She starred as Serena Knight in the 2016 historical war film Free State of Jones. In 2017, she received a star on the Hollywood Walk of Fame.[23] In 2018, Russell was announced to have joined the cast of the film Star Wars: The Rise of Skywalker, which was released on December 20, 2019. The film reunited her with J.J. Abrams, with whom she had worked on Felicity and Mission: Impossible III.[24]\n\nIn March 2019, she starred in the first Broadway revival of Lanford Wilson's play Burn This at the Hudson Theatre.[25] Frank Rizzo of Variety wrote of her performance, \"Russell, whose stage credits are slim but who's proven her chops onscreen in The Americans, creates a vivid, if less flashy, performance\", adding, \"Still, she's a force in her own right.\"[26]\n\nIn 2023, Russell began starring in The Diplomat, a political series on Netflix from writer and producer Debora Cahn.[27]\n\nPersonal life [ edit ]\n\nIn 2006, Russell became engaged to Shane Deary, a Brooklyn-based contractor she met through mutual friends.[11] They married in New York on February 14, 2007.[28] They have two children: a son born in 2007 and a daughter born in 2011.[29][30] Russell and Deary separated in early 2013 and divorced in mid-2014.[31][32] Since 2014, she has been in a relationship with Welsh actor Matthew Rhys, her co-star in The Americans.[33] They have a son, born in 2016.[34][35] In interviews conducted in 2021, Russell and Rhys referred to each other as husband and wife,[36][37] although in an interview in 2025, Rhys said \"we literally haven't got round to marriage yet\".[38]\n\nActing credits [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nTheater [ edit ]\n\nMusic videos [ edit ]\n\nYear Song Artist 1994 \"Always\" Bon Jovi\n\nVideo games [ edit ]\n\nYear Title Role Notes 2024 Open Roads Opal Devine (voice)\n\nAwards and nominations [ edit ]\n\nNotes [ edit ]\n\n^ Where available, the \"Year\" value is linked to the specific ceremony.", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/KeriRussellApr06.jpg/250px-KeriRussellApr06.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Keri_Russell_%2813948636905%29_%28cropped%29.jpg/250px-Keri_Russell_%2813948636905%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Keri_Russell_%2813948636905%29_%28cropped%29.jpg/960px-Keri_Russell_%2813948636905%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/Keri_Russell_by_Gage_Skidmore.jpg/250px-Keri_Russell_by_Gage_Skidmore.jpg", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Keri_Russell_%2813948636905%29_%28cropped%29.jpg/960px-Keri_Russell_%2813948636905%29_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Keri_Russell", "title": "Keri Russell", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.3", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Keri_Russell_%2813948636905%29_%28cropped%29.jpg/960px-Keri_Russell_%2813948636905%29_%28cropped%29.jpg", "width": 899, "height": 1200}, "title": "Keri Russell - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}