{"url": "www.marieclaire.co.uk/life/health-fitness/kim-kardashian-diet-exercise-608108", "text": "What happens when you eat and exercise like celeb royalty for a fortnight? One writer investigates...\n\nWords by Lamya Tilmatine\n\nKim Kardashian has been on a fitness mission of late and, frankly, has never looked better.\n\nHer recent body debut at the CFDA Fashion Awards last month showcased a lighter, tighter and fitter Kim – arms of envy I tell you – to the point where she may actually de-throne Khloe’s revenge-body title…\n\nI decided I wanted in.\n\n(Image credit: Richie Buxo/SilverHub/REX/Shutterstock)\n\nLet’s get one thing straight from the off; I am not trying to ‘get’ a body like Kim’s, nor do I endorse her stance on Instagram marketing and promoting certain lollipops.\n\nHowever, I have definitely seen her eating slices of cake and McDonald’s as well as a variety of nutritious meals, showing that she must have a well-balanced outlook on food.\n\nMarie Claire Newsletter Celebrity news, beauty, fashion advice, and fascinating features, delivered straight to your inbox! Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nI looked into her diet plan and found out that she was following the Atkins 40 diet and getting great results at a healthy rate. Her trainer Alcantara explained to People that it’s all about clean eating and strength training.\n\nSounds promising – so what does it actually entail?\n\nWho is it for?\n\nPeople who want to lose weight or those that just want a healthier lifestyle and reign in their intake simple carbohydrates.\n\nWhat this is also about is achieving a fitter version of myself that I can sustain without starvation.\n\nWhat is the Atkins 20/40 Diet?\n\nThere are two options: Atkins 20 or Atkins 40, and the numbers are the total net carbohydrates you can have in a day, with 20 being stricter on the carb intake but quicker in weight-loss in comparison to 40.\n\nLike the old Atkins, you are limiting your carbohydrate intake, cutting out sugars and processed foods, eating high protein, vegetables and healthy fats to curb those hunger pangs.\n\nThe science behind the diet is quite simple: eating foods that are high in carbohydrates makes your body produce more glucose and insulin. Glucose is your body’s first point of energy that it uses, leaving stored fat just that, stored fat. Make sense?\n\nSo, the decreased intake of carbs means your body is pushed to burn fat for fuel hence the weight loss. Still with me?\n\nIs it the same as the Ketogenic diet?\n\nThere are similarities in the beginning as your low carb diet means that your body goes into Ketosis but after that, you’re allowed to increase levels of healthy carbs in your diet which essentially means ketosis will decrease too.\n\nWhat you can eat on Atkins 20 and 40\n\nPoultry, seafood, dairy (like yoghurt and cheese), vegetables (particularly your greens), healthy fats from nut and seeds, avocados, almond/olive/coconut oil.\n\nAlso, you do eat carbohydrates though from healthier sources like legumes, whole grains and fruits, but all under a net total of 20g/40g depending on what you choose to do.\n\nI opted for Atkins 40 as it’s recommended to those who want to shift a smaller amount of weight. If it works for Kimmy (who isn’t a stranger to a treat or two) then I’m game.\n\nThe workout\n\nI’ve always been a bit of a gym bunny but have never gotten the right cardio/strength training ratio to create the muscle definition I want. I tend to do more of one or the other, which means I get quite slim without any definition or I bulk up (sad emoji).\n\nSo I got myself a personal trainer, explained my fitness goals: defined arms, firm abs and strong hamstrings. Some people love morning workouts as it boasts optimum fat burning but I’d rather the extra 2 hours in bed and workout in the early evening.\n\nKeep scrolling to see what it’s like eating like Kim Kardashian for two weeks – will I get the results or will it just be another fad diet?\n\nThe meal plan\n\nBelow is what I ate during the first week of the plan, following a similar approach in week two.\n\nMonday\n\nBreakfast: poached eggs with spinach and a drizzle of olive oil.\n\nLunch: grilled chicken, broccoli, spring onions, spinach, kale and homemade chilli sauce.\n\nDinner: baked salmon with a grilled vegetable medley.\n\nSnacks: coffee with cinnamon, turmeric tea x2 and six almonds.\n\nHow I felt at the end of the day: Hungry! But I drank loads of water and tea to suppress my sugar cravings – but not having something sweet has proven to be tough on day one.\n\nTuesday\n\nBreakfast: 'Noatmeal' – made with almond flour and shredded coconut with a spoon of peanut butter.\n\nLunch: one boiled egg, sliced cucumbers, sweet corn, red peppers, green olives, rocket salad with turmeric and a teaspoon of olive oil.\n\nDinner: Grilled chicken breast seasoned with Moroccan herbs and spices, grilled onions, peas and green peppers.\n\nSnacks: Celery, six almonds, two cups of tea and two litres of water.\n\nWednesday\n\nBreakfast: I had no time to cook so I boiled an egg with one Weetabix biscuit along with organic almond milk and coffee.\n\nLunch: one boiled egg, sliced cucumbers, beetroot, olives, spinach, green peppers topped with cashew nuts and a slice of avocado.\n\nDinner: cod fillet with homemade parsley sauce, cauliflower mash, leafy rocket salad. Yum!\n\nSnacks: Nak’d bar, coffee, turmeric tea, English breakfast tea. And of course, a lot of water!\n\nThursday\n\nBreakfast: one poached egg on a bed of spinach with an apple, celery, cucumber, mint and kale smoothie.\n\nLunch: Tuna salad with mixed leaves, olives, onions and beetroot.\n\nDinner: Cod fillet with mushroom and broccoli\n\nSnacks: Nak'd bar, turmeric tea, six almonds, red pepper slices.\n\nSpeaking to a personal trainer I got some advice on my workouts, he advised I focused on HIIT sessions in combination with strength training (which I have been doing). However, after a hard core session with him I realised I could push myself even more.\n\nAlready, I train five to six times a week – the ideal to see a real difference – and after a week my legs feel more defined, my core feels stronger but my arms are a bit slow at catching up.\n\nA photo posted by on\n\nFriday\n\nBreakfast: Mini coconut pancakes with peanut butter and coffee.\n\nLunch: Chicken and broccoli soup.\n\nDinner: Cod fillet with peas and a mixed cabbage salad topped with homemade mayonnaise.\n\nSnacks: Turmeric tea, six almonds and a slither of cake (I caved).\n\nThe weekend was more of the same but with Nutella pancakes for brunch on Sunday (cheeky I know).\n\nSome may argue that the rotation of protein based meals can be boring, but I found that having a structure to start with was much easier to follow, especially with a hectic work schedule.\n\nThe verdict\n\nI’ve realised that Kim’s diet has the same principles of a keto diet; Ketosis does occur, but at a healthier pace that I found more sustainable. She allows for oatmeal pancakes and the odd treat.\n\nBut, as seen on her Instagram account, her diet mainly consists of protein in the form of chicken and fish, accompanied by an array of vegetables. I found this hard at first so I made my meals richer in protein where I could.\n\nKKW has an advantage though; she reportedly has a chef that creates personalised meals guided by her personal trainer. But we have the internet with endless recipes, advice and inspiration – we can do this!\n\nResults so far? I’ve lost two pounds – but, more importantly, my sugar cravings have all but completely gone. This approach gets the thumbs up from me.", "images": ["https://cdn.mos.cms.futurecdn.net/bEtpDRHwV4btzES66DmPjZ.jpg", "https://cdn.mos.cms.futurecdn.net/5npnsWY7uEMhiTiXSbVpo7.jpeg", "https://cdn.mos.cms.futurecdn.net/ZoMk2UDQyx3EKfbJKWFW6.jpg", "https://cdn.mos.cms.futurecdn.net/2wvMVeg4gRimiEdJyfq36T.jpg", "https://cdn.mos.cms.futurecdn.net/wf9CXFjyXBYSYdqXiuPrAS.jpg", "https://cdn.mos.cms.futurecdn.net/vWWvPqAT9Q774CX8PoygNg.jpg", "https://cdn.mos.cms.futurecdn.net/pfL4rWtFPuJBvmH7JDTpJh.jpg", "https://cdn.mos.cms.futurecdn.net/flexiimages/mednnv697g1760357120.png", "https://cdn.mos.cms.futurecdn.net/DAA7RGWZBQhrpVAws9DXZh.jpg", "https://cdn.mos.cms.futurecdn.net/ea4trnSvTbocxTpgG4v8N8.jpg", "https://cdn.mos.cms.futurecdn.net/X6PMynX3coBH5NqzSNisDB.jpg", "https://cdn.mos.cms.futurecdn.net/Ce4gw55eUXoykMzgopy7f6.jpeg", "https://sb.scorecardresearch.com/p/?c1=2&c2=10055482&cv=4.4.0&cj=1", "https://cdn.mos.cms.futurecdn.net/w5DyS8DCnnAwk5tCtsLpon.jpg", "https://cdn.mos.cms.futurecdn.net/7HUBpafLpvtTmw3PSwdtnA.jpg", "https://cdn.mos.cms.futurecdn.net/7eW7jGXmM9o3PaLsrNVJmG.jpg", "https://cdn.mos.cms.futurecdn.net/y5W6pyPafV7r9qvVoCCZCX.png", "https://cdn.mos.cms.futurecdn.net/ETtK88xe5DucYFPLaxDsYo.jpg", "https://cdn.mos.cms.futurecdn.net/n3sCzRVdcNrDPEkZ5AmkNi.jpg", "https://cdn.mos.cms.futurecdn.net/kSvHsvXAAbRSbVHeZ7cBM.jpg", "https://cdn.mos.cms.futurecdn.net/ZXq84EVn4spE973VtJ8X8M.jpg", "https://cdn.mos.cms.futurecdn.net/iPAyUkgmDQ7D8fhFR2mnEk.jpg", "https://cdn.mos.cms.futurecdn.net/HgcFSTvcwXxFum4e2caNTj.jpg", "https://cdn.mos.cms.futurecdn.net/SqTtRkgSz9NAFgu4AU67sN.jpeg", "https://cdn.mos.cms.futurecdn.net/YffLHzbG8QjZGemWtwt53f.jpg", "https://cdn.mos.cms.futurecdn.net/MdMDewBYY8oLiDugRRU22J.png", "https://cdn.mos.cms.futurecdn.net/LZ9FXVz2Jk6WKobcZTUVtT.jpg", "https://cdn.mos.cms.futurecdn.net/QidPRVSs6EZx2PFWFqZHUD.jpg", "https://cdn.mos.cms.futurecdn.net/7eW7jGXmM9o3PaLsrNVJmG-2000-80.jpg", "https://cdn.mos.cms.futurecdn.net/Ck3AS2eDwCJSR9aM4zw3aU.jpg", "https://images.fie.futurecdn.net/41brhgf2zkbbo72v-17377295467353-250-80.png.webp", "https://cdn.mos.cms.futurecdn.net/HhXanLss86r3tV27PE54pT.jpg", "https://cdn.mos.cms.futurecdn.net/LcNxDY7qLh5ai9ShUG2GbR.jpg", "https://cdn.mos.cms.futurecdn.net/flexiimages/30x0h4jexz1665657665.svg", "https://cdn.mos.cms.futurecdn.net/wd7ETfxSwicAFkhD8Xs3e8.jpg", "https://cdn.mos.cms.futurecdn.net/yNNctMHDeWWvsFT8HMrmPf.jpg"], "top_img": "https://cdn.mos.cms.futurecdn.net/7eW7jGXmM9o3PaLsrNVJmG-2000-80.jpg", "keywords": [], "authors": ["Marie Claire", "Social Links Navigation"], "canonical_link": "https://www.marieclaire.co.uk/life/health-fitness/kim-kardashian-diet-exercise-608108", "title": "'I tried Kim Kardashian's diet for two weeks, and the results weren't what I expected'", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "pub_date": "2018-07-18T18:41:56+00:00", "description": "When it comes to Kim Kardashian's diet, the woman knows how to get the balance right. One writer tries her eating plan for two weeks...", "robots": "max-image-preview:large", "msapplication-TileColor": "#000000", "msapplication-TileImage": "https://cdn.mos.cms.futurecdn.net/flexiimages/gich8ywzch1659617848.png", "og": {"site_name": "Marie Claire UK", "image": {"identifier": "https://cdn.mos.cms.futurecdn.net/7eW7jGXmM9o3PaLsrNVJmG-2000-80.jpg", "width": 2000, "height": 1125}, "type": "article", "title": "'I tried Kim Kardashian's diet for two weeks, and the results weren't what I expected'", "url": "https://www.marieclaire.co.uk/life/health-fitness/kim-kardashian-diet-exercise-608108", "description": "What happens when you eat and exercise like celeb royalty for a fortnight? One writer investigates..."}, "article": {"publisher": "https://www.facebook.com/MarieClaireUK/", "published_time": "2018-07-18T18:41:56Z"}, "mrf": {"tags": "region:GB;articleType:Feature;control:serversidehawk;control:van-enable-adviser-more-about;category:Health and Fitness;category:Life"}, "twitter": {"card": "summary_large_image", "site": "marieclaireuk", "title": "'I tried Kim Kardashian's diet for two weeks, and the results weren't what I expected'", "description": "What happens when you eat and exercise like celeb royalty for a fortnight? One writer investigates...", "creator": "marieclaireuk", "image": "https://cdn.mos.cms.futurecdn.net/7eW7jGXmM9o3PaLsrNVJmG-1200-80.jpg", "account_id": 9696142}, "google-site-verification": "yIeI3xewp1Vc5WrxptNtgP6GlK_oeSo-8hblyIcOYJg", "msvalidate.01": "CC462E6DF91492086145CA5EBDCB615E"}, "movies": [], "publish_date": 1531939316.0, "source": "http://www.marieclaire.co.uk", "summary": ""}