{"url": "https://popculture.com/celebrity/2018/04/06/brad-pitt-mit-professor-neri-oxman-everything-to-know/", "text": "Brad Pitt has been spending a lot of time with MIT professor Neri Oxman, but their relationship is strictly professional… at least for now.\n\nThe pair reportedly connected over their shared love of design and architecture, with Oxman and Pitt sharing a “professional friendship.”\n\nVideos by PopCulture.com\n\nA source told Page Six that despite being just friends, Pitt is “interested in spending more time” with the accomplished MIT scholar.\n\nScroll through to find out more about the new woman in the famous actor’s life, according to PEOPLE.\n\nHow They Met\n\nPitt and Oxman, 42, reportedly met through an architecture project at MIT, where she works as a professor of media arts and sciences at the university’s Media Lab.\n\nWhile the nature of the project is unknown, Pitt is an architecture enthusiast and founded the Make It Right Foundation, which builds affordable and environmentally friendly homes in New Orleans for people in need.\n\nShe was born in Israel\n\nOxman was born in Haifa, Israel. She enjoyed splitting her time between her grandmother’s garden and her parents’ architectural studio, which is set to be the inspiration for her work fusing elements of nature with architectural design.\n\nHer parents, Robert and Rivka were well-known architects. She also has a younger sister, Karen, who works as an artist in mixed media.\n\nHer “funky” childhood\n\nIn a 2016 interview with Surface magazine, she described her childhood as “funky” and filled with creative influences.\n\n“She grew up ‘between nature and culture,’ pressing leaves and making balsa airplanes,” the Vilcek Foundation’s website says.\n\nAfter fulfilling her mandatory service in the Israeli military, she applied to medical school. But after two years of studying at the Hebrew University in Jerusalem, she transferred to the Technion-Israel Institute of Technology, where her father was a professor.\n\nMigrating to the U.S.\n\nOxman immigrated to the United States in 2005 after studying in Jerusalem and London. She went on to study under her mentor, Professor William J. Mitchell, at MIT.\n\nShe became an associate professor at MIT in 2010 and has remained at the school ever since.\n\nHer most famous designs\n\nOxman is perhaps most well-known for a dome-like structure dubbed The Silk Pavilion, which she create using a combination of robotics and I’ve silkworms in 2003. Yeah you read that right… worms!\n\nInspired by the way silkworms weave cocoons, the pavilion was created by 6,500 live silkworms that were deployed on a base structure created by a robotic arm. The final product is meant to be a fusion of human and natural design.\n\nHer work garnered praise\n\nOxman’s work has been praised by her colleagues. She’s held exhibitions at the Museum of Modern Art and Boston’s Museum of Science, both of which also have some of her pieces as part of their permanent collections.\n\nIn addition, she won the Vilcek Prize in Design in 2014, the MIT Collier Medal in 2016, the Carnegie “Pride of America” Award in 2014, the Earth Award for Future Crucial Design in 2009 and the Holcim Foundation Next Generation award in 2008. She’s also a senior fellow in the Design Futures Council and was a Culture Leader at the World Economic Forum in 2016.\n\nOxman was also named one of the the “most talented, intelligent, funny, and gorgeous Jewish women in the world” by Shalom Life in 2012.\n\nShe designs 3D printed art\n\nSome of her most interesting art pieces include 3D-printed ancient death masks, which can be found in museums around the world.\n\nShe was married to a famous composer\n\nOxman was once married to world-famous Argentine composer Osvaldo Golijov.\n\nThe couple married in 2011 and Oxman later said his music had an “incredible influence” on her work. Intensely private about her personal life, Oxman declined to comment on her split from the composer. In 2017, Oxman revealed she does not have children.\n\nShe once name dropped Brad Pitt in an interview\n\nIn a 2017 interview with W Magazine, Oxman used Pitt as an example of the human tendency to idolize male icons.\n\nAsked if she thinks the issue of male dominance is unique to her profession, she said, “For the same reason we have the Brad Pitts and the George Clooneys, it’s just part of human nature to idolize stereotypes.”\n\nShe added, “Such singularities are useful to the common perception of heroism. But it’s not only true for architecture; it’s true in musical composition, for females working in theater, for film directors. This isn’t just a disease of the architecture profession; it’s a phenotype of human culture and how we develop stereotypes and perceptions.”", "images": ["https://popculture.com/wp-content/uploads/sites/5/2025/11/molly-dangerously-obese.png?w=300", "https://sb.scorecardresearch.com/p?c1=2&c2=8568956&cj=1", "https://popculture.com/wp-content/uploads/sites/5/2025/06/netflix-logo.png?w=300", "https://popculture.com/wp-content/uploads/sites/5/2025/05/robert-irwin.jpg?w=300", "https://popculture.com/wp-content/uploads/sites/5/2021/03/14024377-87b5-44da-926d-abcee03cd657.png?w=640", "https://popculture.com/wp-content/themes/popculture-2024/assets/images/popculture-logo-white.png", "https://popculture.com/wp-content/uploads/sites/5/2024/04/1c80a318-ac01-429c-ae50-dcd1a2e17f40.jpg?w=300", "https://popculture.com/wp-content/uploads/sites/5/2025/11/zach-bryan.jpg?w=300", "https://popculture.com/wp-content/uploads/sites/5/2024/10/PopCulture-logo_1f401e.png", "https://popculture.com/wp-content/uploads/sites/5/2025/11/cma-awards-lainey-wilson-devlin-hodges-getty.jpg?w=300", "https://popculture.com/wp-content/uploads/sites/5/2024/10/14024377-87b5-44da-926d-abcee03cd657.png?w=640", "https://popculture.com/wp-content/uploads/sites/5/2025/11/cma-awards-getty.jpg?w=300", "https://pixel.quantserve.com/pixel/p-RxPFZR-mKeJrq.gif", "https://popculture.com/wp-content/uploads/sites/5/2024/07/70afec6a-3143-4947-b047-428e525611d4.jpg?w=300"], "top_img": "https://popculture.com/wp-content/uploads/sites/5/2021/03/14024377-87b5-44da-926d-abcee03cd657.png?w=640", "keywords": [], "authors": ["Jose Bastidas", ".Wp-Block-Savage-Platform-Post-Byline Font-Family Var --Wp--Custom--Typography--Font-Family--Secondary", "Font-Size Var --Wp--Custom--Typography--Font-Size--Sm", "Font-Weight Var --Wp--Custom--Typography--Font-Weight--Bold", "Line-Height Var --Wp--Custom--Typography--Line-Height--Xxs", ".Wp-Block-Savage-Platform-Post-Byline A Font-Weight Var --Wp--Custom--Typography--Font-Weight--Black", "Text-Decoration None", ".Wp-Block-Savage-Platform-Post-Byline Font-Family Var --Wp--Custom--Typography--Font-Family--Primary", "Font-Size Var --Wp--Custom--Typography--Font-Size--Tiny", "Media Min-Width"], "canonical_link": "https://popculture.com/celebrity/news/brad-pitt-mit-professor-neri-oxman-everything-to-know/", "title": "Brad Pitt Is ‘Just Friends’ With MIT Professor Neri Oxman: See Everything About Her", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Brad Pitt Is ‘Just Friends’ With MIT Professor Neri Oxman: See Everything About Her", "description": "Brad Pitt has been spending a lot of time with MIT professor Neri Oxman, but their relationship is strictly professional… at least for now. The pair reportedly connected over their shared love of design and architecture, with Oxman and Pitt sharing a “professional friendship.” A source told Page Six that despite being just friends, Pitt […]", "url": "https://popculture.com/celebrity/news/brad-pitt-mit-professor-neri-oxman-everything-to-know/", "site_name": "PopCulture.com", "image": {"identifier": "https://popculture.com/wp-content/uploads/sites/5/2021/03/14024377-87b5-44da-926d-abcee03cd657.png?w=640", "width": 640, "height": 320, "type": "image/png"}}, "article": {"published_time": "2018-04-06T22:03:00+00:00", "modified_time": "2024-10-07T16:08:21+00:00"}, "author": "Jose Bastidas", "twitter": {"card": "summary_large_image", "label1": "Written by", "data1": "Jose Bastidas", "label2": "Est. reading time", "data2": "4 minutes"}, "generator": "WordPress 6.8.3", "msapplication-TileImage": "https://popculture.com/wp-content/uploads/sites/5/2024/10/cropped-PopCulture-icon_a9e4e3.png?w=270"}, "movies": [], "publish_date": 1522987200.0, "source": "https://popculture.com", "summary": ""}