{"url": "https://www.refinery29.com/en-us/2016/05/108339/the-hills-mtv-drama-fake-reality", "text": "The Cast\n\nThe producers knew what the show would look like and how the story lines would be crafted together. They then needed their dramatis personae to populate the episodes with dialogue and plot. Heidi Montag, Lauren Conrad’s best friend at the time, had already appeared in several episodes of Laguna Beach. Producers found Whitney Port during a casting call for Condé Nast interns, and she became Lauren’s workplace confidant. Audrina was a model and actress (a \"mactress,\" DiVello calls her) who lived in Lauren and Heidi’s apartment complex. The producers met her when they were scouting the location for shooting.\n\n\n\nDiVello: “I went to MTV and told them I wanted to follow Lauren to Los Angeles, because she was going to fashion school [there]. To me, that’s a very aspirational dream, to want to be a fashion designer. I always loved Lauren, and I always connected with her not as the underdog, but someone who really wears her heart on her sleeve. You can really see what she’s feeling through every expression on her face. I thought it would be so much fun to see her move to a big city and kind of take that all in for the first time, and make friends or enemies, or whatever the case may be. We wanted to be there and film it. I went and actually asked her parents first, just out of respect. They were only 18 at the time; they were really young. So I asked her mom and dad before I asked her. Then, I flew to New York and asked MTV, and they said, ‘Yeah, go make it.’” Travis: “The story was already set. That pilot was that Lauren was very interested in fashion, so she wanted to move to Los Angeles with her best friend Heidi. She was going to go work at Teen Vogue, and then go to fashion school. That was real… The early seasons were when we were asking who was going to be the villains or heroes. What we learned early on was if we just pay attention and really listen to what’s happening in people’s lives, if you have an okay cast, you’ll never run out of story. The girls are in their early 20s; they’re going to have things happen to them. Sure enough, they did. Jason Wahler started to become a real problem for Lauren, and she was torn up about it. He was this great, charming, attractive guy who was treating her terribly and disappearing at night. Heidi ran into some trouble with [her boyfriend at the time] Jordan eventually — he cheated on her or something happened — but we got like a whole episode out of a day and a half of shooting a big breakup between Heidi and Jordan. It was a really genuine thing for Heidi.”", "images": ["https://www.refinery29.com/assets/d68e2ddc49f6065953daf57eac5b849a.png", "https://www.refinery29.com/assets/b3658fb2d9482c50df8996241fb2b67d.png", "https://www.refinery29.com/assets/9aa89696be7da8b249e2ee2622a111e9.png", "https://www.refinery29.com/assets/1ce585852b9e9a8cba36762b911e0f5f.png", "https://www.refinery29.com/assets/cda4774d79df76d9c5ab2dfba3784155.png", "https://www.refinery29.com/assets/90e3b0501ff143bd058ecb3f754a4430.png", "https://www.refinery29.com/assets/c5a8ae3dd50e6ebe17044593c2c7ee0c.svg", "https://www.refinery29.com/assets/d27ad8510dcf0eef13f6419f4f9a76e6.svg", "https://www.refinery29.com/assets/6a9d712b4b1480df334054a94146cc34.png", "https://s2.r29static.com/bin/public/bff/0,0,2000,1050/x,80/1580497/image.jpg"], "top_img": "https://s2.r29static.com/bin/public/bff/0,0,2000,1050/x,80/1580497/image.jpg", "keywords": [], "authors": ["Kathleen Newman-B...", "Rachel Choy", "Taryn Finley", "Alicia Lansom", "Banseka Kayembe", "Tess Garcia", "The Hills Reality Show Real Or Fake"], "canonical_link": "https://www.refinery29.com/en-us/2016/05/108339/the-hills-mtv-drama-fake-reality", "title": "The Hills Producers Finally Tell Us What Was Real & What Was Fake", "meta_data": {"title": "The Hills Reality Show Real Or Fake", "description": "Was MTV's \"The Hills\" real or fake? On the show's 10th anniversary, the producers reveal how the drama behind the reality show actually went down.", "og": {"url": "https://www.refinery29.com/en-us/2016/05/108339/the-hills-mtv-drama-fake-reality", "title": "\"The Hills\" Producers Finally Tell Us What Was Real & What Was Fake", "description": "Was MTV's \"The Hills\" real or fake? On the show's 10th anniversary, the producers reveal how the drama behind the reality show actually went down.", "image": {"identifier": "https://s2.r29static.com/bin/public/bff/0,0,2000,1050/x,80/1580497/image.jpg", "secure_url": "https://s2.r29static.com/bin/public/bff/0,0,2000,1050/x,80/1580497/image.jpg", "width": 2000, "height": 1050}, "type": "article"}, "twitter": {"title": "\"The Hills\" Producers Finally Tell Us What Was Real & What Was Fake", "card": "summary_large_image", "site": "@refinery29", "description": "Was MTV's \"The Hills\" real or fake? On the show's 10th anniversary, the producers reveal how the drama behind the reality show actually went down.", "image": "https://s2.r29static.com/bin/public/bff/0,0,2000,1050/x,80/1580497/image.jpg"}, "pinterest": {"image": "https://s3.r29static.com/bin/entry/f39/112,0,1776,2400/x/1580495/image.png"}, "fb": {"app_id": 155023867867753, "pages": "86973707921,587074007996399,269626263209765,509115739117952,1562713254009921,583745561686633,656112191237463,284423314989162,974273182666651,192477361634120"}, "article": {"publisher": "refinery29"}, "viewport": "width=device-width, initial-scale=1", "theme-color": "#fd5b4e", "news_keywords": "the hills, lauren conrad, spencer pratt, heidi montag, holly montag, kristin cavallari, brody jenner, jason wahler, was the hills real, was the hills fake, the hills reality show, the hills scripted, whitney port, was the hills faked, audrina patridge, justin bobby, justin brescia, justin bobby brescia, spencer pratt and heidi montag, the city, laguna beach, stephen colletti, lauren conrad boyfriends, lauren conrad sex tape, lauren conrad sex tape rumor, you know what you did, lauren conrad mascara tears, natasha bedingfield unwritten, hilary duff, the hills theme song, was the hills totally fake, secrets of the hills, the princes of malibu, stephanie pratt, best moments on the hills, lauren conrads best moments, lauren conrads best the hills lines, fidm, teen vogue, lauren doesnt go to paris, stacie the bartender", "p": {"domain_verify": "b10faeb45f92f5ebf0073a215d615ea9"}, "entry_template": "entry.article", "author": "Lauren Le Vine"}, "movies": [], "publish_date": 1462852800.0, "source": "https://www.refinery29.com", "summary": ""}