{"url": "https://www.thewrap.com/black-mirror-tech-how-close-season-4/", "text": "WARNING: Mild spoilers for “Black Mirror” season 4 below.\n\n\n\nOne thing we love about “Black Mirror” is all of the creative, futuristic technology.\n\nSome of it is seriously freaky, like those killer dog bots in “Metal Head,” but some of it is truly dreamy, like the consciousness cloud from the Emmy-winning “San Junipero.”\n\nTake a look at how close we are to some of the tech in Season 4, which dropped on Netflix on December 29.\n\n“Arkangel” mommy cam\n\nTo actually track the location of a human, you’d need a lot more power than would be available in the teeny-tiny microchip inserted into Sarah’s head in “Arkangel.”\n\nBut microchipping in humans does actually already exist — the chips are used for things like swiping into a building, using a printer or buying food. In the future, “smart dust” is more likely to be the direction things go–sensors so small that they could be injected undetected.\n\nThe downside to microchipping yourself or you offspring? You could be vulnerable to getting hacked.\n\n“U.S.S. Callister” VR game\n\nDid the VR game in this episode remind anyone else of the Oasis in “Ready Player One”? If you’ve ever played a game in VR, you understand why Callister would be such a hot company, and why they’d be so busy leading up to Christmas.\n\nYou can already play games with a digital look-alike — like in NBA 2K, for example. As for a “digital clone”? Yeah, that exists, too. Scientists have created digital clones of animals, and some have created bots of themselves that can interact with others without their own actual involvement.\n\n“Hang the DJ” dating app\n\nThe tech in this episode honestly seems pretty similar to the VR used in “U.S.S. Callister,” but repurposed to learn who your heart desires. And while that tech isn’t quite here, there is such a thing as VR dating.\n\nThe show “Virtually Dating,” a partnership between Condé Nast Entertainment and Facebook, follows couples who are photo-scanned to get a photo-realistic version of themselves and date in virtual reality. This might be way cooler in the future — imagine falling in love with someone who lived, say, on another continent, all through\n\nVR. Right now, the would-be lovebirds are right next to each other, they just have VR headsets on.\n\nThe automated pizza delivery in “Crocodile”\n\nWhen Mia is looking out her hotel room — just after murdering her ex-boyfriend because he was going to come clean about a previous murder they covered up together 15 years prior — she sees an automated pizza delivery truck accidentally hit a pedestrian.\n\nThis becomes a storyline throughout the episode for Mia, an insurance agent trying to figure out what happened to her client. Yes, that memory collecting device is crazy, but Domino’s Pizza has already tried out robot pizza delivery in Germany.\n\nThe bot in question, from Starship Technologies, can hold up to five medium pizzas and navigates at four miles per hour using cameras and short-range ultrasonic sensors, according to Wired.", "images": ["https://i0.wp.com/www.thewrap.com/wp-content/uploads/2025/10/5x4_082025_COVER.jpg?fit=240%2C300&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2017/12/1359358-2729031-zoomed-1.jpg?fit=618%2C412&quality=89&ssl=1"], "top_img": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2017/12/1359358-2729031-zoomed-1.jpg?fit=618%2C412&quality=89&ssl=1", "keywords": [], "authors": ["Ashley Boucher", ".Wp-Block-Post-Author Box-Sizing Border-Box Display Flex Flex-Wrap Wrap .Wp-Block-Post-Author__Byline Font-Size Margin-Bottom Margin-Top Width", ".Wp-Block-Post-Author__Avatar Margin-Right .Wp-Block-Post-Author__Bio Font-Size Margin-Bottom .Wp-Block-Post-Author__Content Flex-Basis Flex-Grow .Wp-Block-Post-Author__Name Margin", ".Wp-Block-The-Wrap-Author-Bios__Entry Align-Items Center Display Flex Flex-Wrap Wrap Gap .Wp-Block-The-Wrap-Author-Bios__Entry .Wp-Block-The-Wrap-Author-Bios__Entry Margin-Top .Wp-Block-The-Wrap-Author-Bios__Entry-Excerpt Flex-Basis", ".Wp-Block-The-Wrap-Author-Bios Border-Top Solid", "Margin-Block Padding-Top .Wp-Block-The-Wrap-Author-Bios__Entry-Avatar Display Var --Display-No-Mobile", "Block", "Margin-Bottom .Wp-Block-The-Wrap-Author-Bios__Entry-Avatar Img Border Solid", "Border-Radius Box-Shadow Rgba", "Rgba"], "canonical_link": "https://www.thewrap.com/black-mirror-tech-how-close-season-4/", "title": "‘Black Mirror’ Season 4 Reality Check: How Close to All That Futuristic Tech Are We?", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "'Black Mirror' Season 4 Reality Check: How Close to All That Futuristic Tech Are We?", "description": "We take a look at how realistic the technology is used in Season 4", "url": "https://www.thewrap.com/black-mirror-tech-how-close-season-4/", "site_name": "TheWrap", "image": {"identifier": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2017/12/1359358-2729031-zoomed-1.jpg?fit=618%2C412&quality=89&ssl=1", "width": 618, "height": 412, "type": "image/jpeg"}}, "article": {"published_time": "2017-12-29T08:01:39+00:00", "modified_time": "2017-12-29T16:18:54+00:00"}, "author": "Ashley Boucher", "twitter": {"card": "summary_large_image", "label1": "Written by", "data1": "Ashley Boucher", "label2": "Est. reading time", "data2": "3 minutes"}, "generator": "WordPress 6.8", "article-tags": "black-mirror, netflix", "article-section": "tech", "article-categories": "tech, tv", "msapplication-TileImage": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2024/05/the_wrap_symbol_black_bkg.png?fit=270%2C270&quality=80&ssl=1"}, "movies": [], "publish_date": 1514534499.0, "source": "https://www.thewrap.com", "summary": ""}