{"url": "https://en.wikipedia.org/wiki/Mia_Farrow", "text": "American actress (born 1945)\n\nMaria de Lourdes Villiers Farrow ( mə-REE-ə dee LOORDZ VIL-yərz FARR-oh; born February 9, 1945) is an American actress. She first gained notice for her role as Allison MacKenzie in the prime-time television soap opera Peyton Place and gained further recognition for her subsequent short-lived marriage to Frank Sinatra. An early film role, as Rosemary in Roman Polanski's Rosemary's Baby (1968), saw her nominated for a BAFTA Award and a Golden Globe Award for Best Actress. She went on to appear in several films throughout the 1970s, such as Follow Me! (1972), The Great Gatsby (1974), and Death on the Nile (1978). Her younger sister is Prudence Farrow.\n\nFarrow was in a relationship with actor-director Woody Allen from 1980 to 1992 and appeared in thirteen of his films beginning with A Midsummer Night's Sex Comedy (1982). She received Golden Globe Award nominations for her roles in Broadway Danny Rose (1984), The Purple Rose of Cairo (1985), and Alice (1990). She also acted in Hannah and Her Sisters (1986), Crimes and Misdemeanors (1989), and Husbands and Wives (1992). In 1992, Farrow publicly accused Allen of sexually abusing their adopted daughter, Dylan Farrow. Allen was never charged with a crime and has vigorously denied the allegation. These claims have received significant renewed public attention since 2013.\n\nSince the 2000s, Farrow has made occasional appearances on television, including a recurring role on Third Watch (2001–2003). She has also had supporting parts in such films as The Omen (2006), Be Kind Rewind (2008), and Dark Horse (2011) as well as the Netflix series The Watcher (2022). On stage, she returned to Broadway in the Jen Silverman play The Roommate (2025) for which she was nominated for the Tony Award for Best Actress in a Play. Farrow is also known for her work as a UNICEF Goodwill Ambassador and is involved in various international humanitarian activities. In 2008, Time magazine named her one of the most influential people in the world.[1]\n\nEarly life and family [ edit ]\n\nFarrow (far left) with her family, 1950\n\nMaria de Lourdes Villiers Farrow[2] was born February 9, 1945, in Los Angeles, California, the third child and eldest daughter of Australian film director John Farrow and his second wife, the Irish actress Maureen O'Sullivan. She is one of seven children, with older brothers Michael Damien, Patrick,[5] younger brother John Charles,[b] and younger sisters Prudence, Stephanie, and Tisa. Her godparents were director George Cukor and columnist Louella Parsons.\n\nFarrow was raised in Beverly Hills, California, in a strict Catholic household.[13] She was described by her family as an eccentric and imaginative child, and would occasionally put on performances with \"toy daggers and fake blood\" for passing celebrity tour buses.[15] Aged two, she made her film debut in a short documentary, Unusual Occupations: Film Tot Holiday (1947). Farrow attended Catholic parochial schools in Los Angeles for her primary education. At nine years old, she contracted polio during an outbreak in Los Angeles County reportedly affecting 500 people.[17] She was placed in an isolation ward for three weeks[18] and later said the experience \"marked the end of [her] childhood.\"[15]\n\nIn 1958, the Farrow family temporarily relocated to Spain, where her father was filming John Paul Jones (1959). Farrow, then age 13, made a brief uncredited appearance in the film. In September 1958, Farrow and her sister Prudence were sent to attend a convent-operated boarding school in Surrey, England[15][19] while her father completed post-production on John Paul Jones in London.\n\nOn October 28, 1958, Farrow's eldest brother Michael died in a plane crash near Pacoima, California while a member of the United States Marine Corps Reserve.[21] After his burial, Farrow returned to boarding school in Surrey. Her family temporarily lived in the London Park Lane Hotel before renting a home in Chelsea. Farrow's father began drinking heavily, which strained the marriage. In her memoir, Farrow recalls witnessing violent arguments between her parents while visiting their Chelsea residence.\n\nWhen Farrow was 16, she returned with her family to the United States and continued her education at an all-girls Catholic school in Los Angeles, Marymount High School. (She is among its most famous alumnae.)[25] Farrow subsequently studied at Bard College.[26]\n\nDuring this time, her parents were struggling financially and her mother relocated to New York City to act in Broadway productions. Farrow's father remained in California, where he died the following year of a heart attack. Farrow was 17 years old.\n\nThe family was left with little money after her father's death, prompting Farrow to begin working to help support herself and her siblings. She initially found work as a fashion model[29] before being cast as a replacement in a New York stage production of The Importance of Being Earnest.\n\nCareer [ edit ]\n\n1963–1969: Beginnings and breakthrough [ edit ]\n\nFarrow screen-tested for the role of Liesl von Trapp in The Sound of Music (1965), but did not get the part.[31] The footage has been preserved, and appears on the fortieth Anniversary Edition DVD of The Sound of Music.[32] She began her acting career in movies by appearing in supporting roles in several 1960s films, making her first credited appearance in Guns at Batasi (1964).\n\nFarrow photographed in 1965\n\nThe same year, she achieved stardom on the successful primetime soap opera Peyton Place, playing naive, waif-like Allison MacKenzie.[33] Farrow left the series in 1966 at the urging of Frank Sinatra, whom she married on July 19, 1966, when she was 21 and he was 50 years old. She subsequently appeared in her first featured role in the British spy film A Dandy in Aspic (1968).\n\nFarrow's first leading film role was in the psychological horror film Rosemary's Baby (1968), which was a critical and commercial success. It is highly regarded as a classic of the horror genre, and named the second-best horror film of all time (after Psycho) by The Guardian in 2010.[37] She won numerous awards, including the Golden Globe Award for New Star of the Year – Actress,[38] and became established as a leading actress. Film critic and author Stephen Farber described her performance as having an \"electrifying impact... one of the rare instances of actor and character achieving a miraculous, almost mythical match\". Film critic Roger Ebert called the film \"brilliant\", and noted, \"A great deal of the credit for this achievement must go to Mia Farrow, as Rosemary.\"[39]\n\nFollowing Rosemary's Baby, Farrow was to be cast as Mattie in True Grit and was keen on the role. But, prior to filming she made Secret Ceremony in England with Elizabeth Taylor and Robert Mitchum. While filming, Mitchum told her that True Grit director Henry Hathaway had a reputation for being rude to actresses. Farrow asked producer Hal Wallis to replace Hathaway. Wallis refused; Farrow quit the role, which was then given to Kim Darby.[40]\n\nSecret Ceremony divided critics but has developed a devoted following. Farrow's other late 1960s films include John and Mary (1969) opposite Dustin Hoffman.[41] She earned a Golden Globe nomination for Best Actress in a Comedy or Musical.[38]\n\n1970–1979: Theater work and mainstream success [ edit ]\n\nBeginning in the early 1970s, Farrow appeared onstage in numerous classical plays in London, beginning with the Royal Shakespeare Company's 1971 production of Jeanne d'Arc au bûcher—in which she portrayed Joan of Arc—at the Royal Albert Hall.[failed verification][42] Farrow made history as the first American actress to join the Royal Shakespeare Company.[unreliable source?] The same year, she appeared in the British horror film See No Evil, portraying a blind woman whose family is stalked by a killer.[43] Though he gave the film a mixed review, Roger Greenspun of The New York Times wrote that Farrow \"plays her blind patrician with exactly the right small depth of pathos and vulnerable nobility.\"[43] Farrow also starred in the television film Goodbye, Raggedy Ann (1971), playing an unstable Hollywood starlet.[44] In 1972, Farrow starred in the French black comedy film Dr. Popaul, opposite Jean-Paul Belmondo, as a secretary who marries a womanizer, and in Carol Reed's Follow Me! as a woman suspected of having an affair by her wealthy husband. Onstage, she starred as the lead in a 1972 stage production of Mary Rose,[47] followed by the role of Irina in The Three Sisters,[48] and a dual role in The House of Bernarda Alba (both 1973).[49]\n\nFarrow was cast as Daisy Buchanan in the 1974 Paramount Pictures film adaptation of The Great Gatsby, directed by Jack Clayton.[50] The film was a commercial success, grossing over $25 million in the United States,[51] while Variety deemed it \"the most concerted attempt to probe the peculiar ethos of the Beautiful People of the 1920s.\"[50] In 1975, Farrow was cast as the lead in a stage production of The Marrying of Ann Leete, followed by The Zykovs (1976), both of which were staged at the Aldwych Theatre.[52][53] She again appeared at the Aldwych in the 1976 production of Ivanov, portraying Sasha.[54] She also appeared onscreen, portraying Peter Pan in the television musical film Peter Pan (1976), and as a woman haunted by the ghost of a deceased girl in the horror film Full Circle (1977).\n\nFarrow had a supporting role in Robert Altman's comedy A Wedding (1978), playing the mute daughter of a trucking company tycoon. The same year, she starred with Rock Hudson in the disaster film Avalanche, followed by the British Agatha Christie adaptation Death on the Nile. In 1979, Farrow appeared on Broadway opposite Anthony Perkins in the play Romantic Comedy by Bernard Slade,[58] and in the romance film Hurricane, opposite Jason Robards.\n\n1980–1992: Collaborations with Woody Allen [ edit ]\n\nFarrow in 1980\n\nBeginning in the 1980s, Farrow had a decade-long relationship with director Woody Allen; they collaborated on many of his films. Her first film with Allen was the comedy A Midsummer Night's Sex Comedy (1982), in a role originally intended for Diane Keaton. She next appeared in Allen's Zelig (1983), portraying a psychiatrist whose patient, Leonard Zelig (Allen), takes on characteristics of those around him in an effort to be liked.\n\nIn Broadway Danny Rose (1984), Farrow starred as the mistress of a washed-up lounge musician who becomes involved with the mob. Both her character, and the film, were inspired by a woman she and Allen had frequently encountered while dining at Rao's, an Italian restaurant in East Harlem. Farrow gained weight for the role and adopted a thick Italian-American accent; Allen biographer John Bailey described her as \"unrecognizable\" in the role. Farrow gained critical notice for this role, and she was nominated for a Golden Globe Award for Best Actress in a Comedy or Musical.[38] Allen subsequently reflected that her performance was a \"very, very brave thing for her to do,\" as the majority of her scenes required her to wear sunglasses that block view of her eyes. Farrow also voiced the title role in the animated film The Last Unicorn (1982). After Broadway Danny Rose, Farrow had a supporting role in Jeannot Szwarc's superhero film Supergirl (1984), playing Alura In-Ze, the mother of Supergirl. The film was considered a box office bomb, earning $13 million against its $35 million budget.[66][67]\n\nFarrow reunited with Allen for his The Purple Rose of Cairo (1985), which follows a film character (portrayed by Jeff Daniels) who emerges from the screen and enters the real world. He falls in love with a waitress (Farrow). Farrow earned a BAFTA nomination for Best Actress[69] and a Golden Globe nomination for Best Actress in a Comedy or Musical.[38] Allen next cast Farrow as the lead in his drama Hannah and Her Sisters (1986), which follows a New York City family over a period of two years between two Thanksgivings. In the film, Farrow starred as the titular Hannah opposite Barbara Hershey and Dianne Wiest (who portray her sisters), and Michael Caine as her husband. Released in February 1986, Hannah and Her Sisters was a box-office hit, grossing $35 million in the United States during its original theatrical release.[71] The film was praised by critic Roger Ebert, who felt it was Allen's best work to date. Farrow earned her third BAFTA nomination, again in the category of Best Leading Actress.[73]\n\nIn 1987, Farrow appeared in two films directed by Allen: the comedy Radio Days, in which she had a supporting role as an aspiring radio star; and the drama September, in which she played a woman haunted by her killing of her mother's abusive lover. Farrow shot the latter film twice, originally with her own mother Maureen O'Sullivan playing her character's mother in the film. Displeased with the final cut, Allen decided to recast several roles and reshoot the film entirely. The second and final version featured Elaine Stritch as Farrow's mother in the film. Farrow was subsequently cast opposite Gena Rowlands in Allen's drama Another Woman (1988), which follows a philosophy professor (Rowlands) who becomes acquainted with a troubled woman undergoing an existential crisis (Farrow). While the film earned praise from critics such as Roger Ebert,[78] its screenplay and dialogue were criticized by Vincent Canby in The New York Times. He described it as \"full of an earnest teen-age writer's superfluous words.\"[79] In 1989, Farrow starred in a segment of Allen's anthology film New York Stories, playing the shiksa fiancée of a Jewish man (Allen). She appeared in a supporting role in his film Crimes and Misdemeanors (1989), portraying a producer who falls in love with a documentary filmmaker.\n\nShe was next cast by Allen in his fantasy film Alice (1990), marking the couple's 11th collaboration.[81] In Alice, Farrow portrays the title character, an upper-class Manhattan woman who becomes enamored with a jazz musician. Her attraction results in feelings of Catholic guilt that manifest as physical ailments which she attempts to treat with herbal medicine. Vincent Canby praised her portrayal as career-defining, writing: \"Miss Farrow gives a performance that sums up and then tops all of the performances that have preceded it.\"[81] She was nominated for a Golden Globe for Best Actress in a Comedy or Musical,[38] and won a National Board of Review award for Best Actress.[83] The next year, Farrow appeared as a circus performer in Allen's black-and-white comedy Shadows and Fog.\n\nFarrow had a lead role in Allen's drama Husbands and Wives (1992), in which she portrayed the wife of a writer and professor (Allen) having an affair with one of his students. Husbands and Wives marked Farrow's final collaboration with Allen. It was released shortly after the couple's highly publicized separation. Todd McCarthy of Variety noted in his review of the film that much of its audience would watch it \"for the titillation of seeing Allen make out with a 21-year-old and go through a wrenching split from Farrow onscreen. Even those who enter in this frame of mind, however, probably will put these thoughts aside for the most part as they become involved in the romantic longings and verbal crossfire of a host of interesting, difficult, intersecting characters.\"[86]\n\n1993–1999: Film and television; return to stage [ edit ]\n\nFarrow at the 1998 Kennedy Center Honors\n\nCiting the need to devote herself to raising her young children, Farrow worked less frequently during the 1990s. But she appeared in leading roles in several films, including the Irish film Widows' Peak (1994), in which she starred as \"Miss O'Hare\", the mysterious victim of a vengeful, matriarchal figure in a small Irish village.[87] She also appeared in the comedy Miami Rhapsody (1995), playing the mother of a single woman in her thirties (played by Sarah Jessica Parker).[88]\n\nThat year Farrow also had a lead role in the film adaptation of Craig Lucas' Off-Broadway play Reckless (1995), a dark comedy in which she portrayed a woman whose husband arranges a contract killing against her.[89] Critic Stephen Holden praised her performance, writing: \"Ms. Farrow is so perfectly cast as Rachel that the character seems a distillation of nearly every role she has played since she was a teen-ager in Peyton Place.\"[89] In the spring of 1996, Farrow had an uncredited voice role in the Broadway play Getting Away with Murder, appearing in a pre-recorded voice message.[90]\n\nIn 1997, Farrow published her autobiography, What Falls Away.[91] She had a cameo appearance as herself in Howard Stern's biographical comedy, Private Parts.[92] She appeared on television in the 1998 The Wonderful World of Disney segment Miracle at Midnight, a dramatization of the Rescue of the Danish Jews during the Holocaust.[93] Will Joyner of The New York Times credited Farrow's performance in the segment as \"crucial to the production's success.\"[93] Farrow was next cast as a woman suffering Alzheimer's disease in the television film Forget Me Never.[94] Critic Steven Linan of the Los Angeles Times praised Farrow, writing that she \"convincingly conveys the fear and insecurity that accompany such a downward spiral.\"[94] Her portrayal earned her her seventh Golden Globe nomination for Best Actress, in the category of Miniseries or Television Film.[38] Also in 1999, Farrow appeared in the comedy Coming Soon, playing the hippie mother of a high school student.[95]\n\nIn November 1999, Farrow returned to Broadway portraying Honey in a staged reading of the Edward Albee play Who's Afraid of Virginia Woolf?, opposite Matthew Broderick, Jonathan Pryce, and Uta Hagen.[96] Vincent Canby praised the production in The New York Times, writing that \"as performed by Mr. Broderick and Ms. Farrow, Nick and Honey took on dimensions I have never seen before.\"[96] The reading was subsequently staged in Los Angeles in the spring of 2000.[97]\n\n2000–present: Later film, television, and theater [ edit ]\n\nDuring the 2000s, Farrow appeared on television. She began with a recurring role on the series Third Watch, in which she guest-starred in five episodes between 2000 and 2003.[98] Farrow also appeared in the 2001 LGBT-themed television film A Girl Thing, opposite Kate Capshaw and Stockard Channing,[99] followed by a lead in the Lifetime film The Secret Life of Zoey in 2002.[100] She also appeared in a touring stage production of The Exonerated the same year,[101] followed by the lead in Fran's Bed, staged at Connecticut's Long Wharf Theatre in the fall of 2003.[102] She subsequently had a supporting part in the children's television film Samantha: An American Girl Holiday (2004).[103]\n\nFarrow at the 2012 Time 100\n\nFarrow made her first feature film appearance in several years as Mrs. Baylock, a Satanic nanny, in the remake of The Omen (2006). Although the film received a lukewarm critical reception, Farrow's performance was widely praised. The Associated Press declared \"thank heaven for Mia Farrow\" and said her performance was \"a rare instance of the new Omen improving on the old one.\"[104] The Seattle Post-Intelligencer also praised her performance, describing it as \"a truly delicious comeback role... Farrow [is] chillingly believable as a sweet-talking nanny from hell.\"[105]\n\nFarrow subsequently appeared as the mother of a Manhattan attorney (played by Amanda Peet) in the romantic comedy The Ex (2007), also starring opposite Jason Bateman and Zach Braff.[106] The film was poorly received by critics, with several writing that the cast's talents were underserved by the material.[107][108] Farrow next voiced Daisy Suchot in Luc Besson's animated fantasy film Arthur and the Invisibles (2007).[109]\n\nThe following year, Farrow appeared in a supporting role opposite Danny Glover in Michel Gondry's comedy Be Kind Rewind (2008), playing the friend and patron of a video store operator in suburban New Jersey.[110] She also provided voice narration for the documentary film As We Forgive (2008), which recounts the stories of two Rwandan women who confronted the individuals who murdered their families during the Rwandan genocide.[111] In 2009, Farrow reprised her voice role as Daisy Suchot in Arthur and the Revenge of Maltazard,[112] and she also reprised it for Arthur 3: The War of the Two Worlds (2010).[113] She was subsequently cast in a supporting role in the comedy-drama Dark Horse (2011), directed by Todd Solondz,[114] in which she played the mother of a stunted 35-year-old man.[115]\n\nIn September 2014, Farrow returned to Broadway in the play Love Letters. The play was well received by critics,[116] with Charles Isherwood of The New York Times deeming Farrow's performance \"utterly extraordinary... as the flighty, unstable and writing-averse Melissa Gardner.\"[117] In 2016, Farrow appeared with Faye Dunaway in an episode of the IFC mockumentary series Documentary Now!.[118] In 2022 Farrow appeared in Ryan Murphy's Netflix series The Watcher.[119] It was announced that Farrow would make her return to Broadway in the Jen Silverman play The Roommate starring opposite Patti LuPone at the Booth Theatre in August 2024.[120] Daniel D'Addario of Variety wrote, \"Farrow, in her greatest work on film, runs cool to the touch. Together, they modulate. LuPone will be the bigger star, perhaps, to a Broadway audience (with apologies to the producer who wanted to cast Annette Bening in the role). But it's Farrow audiences will swoon for\".[121] For her performance, she received her first Tony Award nomination for Best Actress in a Play.[122]\n\nActing credits and accolades [ edit ]\n\nFarrow's film debut was in Guns at Batasi (1964), followed by roles in Rosemary's Baby (1968), John and Mary (1969), The Great Gatsby (1974) and Death on the Nile (1978). She collaborated with filmmaker Woody Allen starring in 12 of his films A Midsummer Night's Sex Comedy (1982), Zelig (1983), Broadway Danny Rose (1984), The Purple Rose of Cairo (1985), Hannah and Her Sisters (1986), Radio Days (1987), September (1987), Another Woman (1988), Crimes and Misdemeanors (1989), Alice (1990), Shadows and Fog (1991), and Husbands and Wives (1992).\n\nOver her career she has received various accolades including a Golden Globe Award as well as nominations for three BAFTA Awards and a Tony Awards. She won the Golden Globe Award for New Star of the Year – Actress for Guns at Batasi (1964). She was Globe-nominated for her roles in Rosemary's Baby (1968), John and Mary (1969), Broadway Danny Rose (1984), The Purple Rose of Cairo (1985), Alice (1990), and Forget Me Never (1999). On stage, she earned a Tony Award for Best Actress in a Play for The Roommate (2025).\n\nHumanitarian activities [ edit ]\n\nFarrow during a visit to the Central African Republic\n\nFarrow became a UNICEF Goodwill Ambassador in 2000 and is a high-profile advocate for human rights in Africa, particularly for children's rights. She has worked to raise funds and awareness for children in conflict-affected regions and to draw attention to the fight to eradicate polio. Farrow has received several awards for her humanitarian work[123][124] including the Leon Sullivan International Service award,[125] the Lyndon Baines Johnson Moral Courage Award[126] and the Marion Anderson Award.[127] In 2006, Farrow and her son Ronan visited Berlin in order to participate in a charity auction of United Buddy Bears, which feature designs by artists representing 142 U.N. member states.[128] In 2008, Time magazine named her one of the most influential people in the world.[130]\n\nShe has traveled to Darfur several times for humanitarian efforts, first in 2004.[131] Her third trip was in 2007, with a film crew engaged in making the documentary Darfur: On Our Watch.[132] The same year, she co-founded the Olympic Dream for Darfur campaign, which drew attention to China's support for the government of Sudan. The campaign hoped to change China's policy by embarrassing it in the run-up to the 2008 Summer Olympics held in Beijing. In March 2007, China said it would urge Sudan to engage with the international community. The campaign persuaded Steven Spielberg to withdraw as an artistic adviser to the opening ceremony. During the Olympics, Farrow televised via the internet from a Sudanese refugee camp to highlight China's involvement in the region.[133]\n\nFarrow speaking to a European Union Force Chad soldier in Darfur, 2008\n\nLater in 2007, Farrow offered to \"trade her freedom\" for the freedom of a humanitarian worker for the Sudan Liberation Army who was being treated in a UN hospital while under threat of arrest. She wanted to be taken captive in exchange for his being allowed to leave the country.[134] Farrow is also a board member of the Washington, D.C.–based non-profit Darfur Women Action Group (DWAG).[135]\n\nIn 2009, Farrow narrated a documentary, As We Forgive, relating the struggle of many of the survivors of the Rwandan genocide to forgive those who murdered family and friends. To show \"solidarity with the people of Darfur\" Farrow began a water-only fast on April 27, 2009.[137] Farrow's goal was to fast for three weeks, but she called a halt after twelve days on the advice of her doctor.[138] In August 2010, she testified in the trial against former Liberian President Charles Taylor in the Special Court for Sierra Leone.[139]\n\nIn October 2009, Farrow visited Israel and the Palestinian territories for six days. She expressed outrage over the conditions children in the Gaza Strip had to live in after Israel's blockade of the area, and also criticized rocket attacks by Gaza militants on southern Israel, saying that more international aid could be provided if the attacks stopped.[140]\n\nFarrow helped build The Darfur Archives, which document the cultural traditions of the tribes of Darfur.[141] She has filmed some 40 hours of songs, dances, children's stories, farming methods and accounts of genocide in the region's refugee camps that make up the current archives.[142] Since 2011, the Archives have been housed at the Thomas J. Dodd Research Center at the University of Connecticut.[143][144] In 2013, Farrow criticized President Barack Obama for his lack of address regarding the Sudanese genocide during a United Nations General Assembly.[142] In February 2015, Farrow appeared in an episode of A Path Appears, a PBS documentary series from the creators of the Half the Sky movement. In the episode Farrow travels to Kibera, Kenya's largest slum, to share stories from organizations providing education to at-risk girls.[145][146]\n\nFarrow has also participated in environmental activism. In 2014, she protested against Chevron, accusing the oil company of environmental damage in the South American rainforest.[147]\n\nPersonal life [ edit ]\n\nReligious and political beliefs [ edit ]\n\nFarrow was raised as a Catholic[19] and in a 2013 interview with Piers Morgan, she stated that she had not \"lost her faith in God.\"[148] In 1968, when she was 23 years old, Farrow spent part of the year living at the ashram of Maharishi Mahesh Yogi in Rishikesh, Uttarakhand, India, studying Transcendental Meditation. Her visit received worldwide media attention at the time because of the presence of all four members of the Beatles, Donovan, Mike Love, and her sister, Prudence Farrow. The behavior of her sister Prudence during this trip inspired John Lennon to write the song \"Dear Prudence\".[152] The trip also inspired the song \"Sexy Sadie\", originally titled 'Maharishi', which was written by John Lennon in response to alleged sexual advances made by the Maharishi Mahesh Yogi towards Mia Farrow.[153] Paul McCartney, George Harrison, and Cynthia Lennon have later said that they believe the story to have been fabricated.[154][155][156][157][158]\n\nFarrow has stated that she has long been a registered Independent, though she has consistently voted for Democratic candidates.[159] In the 2016 Democratic presidential election, Farrow publicly endorsed Democratic Party candidate Bernie Sanders,[160][161] though she subsequently stated that \"as a pragmatist\" she planned to vote for Hillary Clinton.[159] Farrow tweeted in support of Joe Biden during the 2020 Democratic Party presidential primaries, but later added that she would vote for Sanders if he was nominated.[162]\n\nIn a 2009 visit to Israel, Farrow commented on the Goldstone report, \"crimes were carried out by both sides of the conflict. I didn't come to criticize anyone, just to express hope for a better leadership everywhere.\"[163] During the 2014 Gaza War, Farrow tweeted, \"Israel said it's [sic] objective is to take out Hamas tunnels- but why are they bombing homes in Gaza City.\"[164] She also expressed sympathy for the people of Gaza.[164][165] In October 2023, she criticized Israel's blockade of the Gaza Strip as a \"war crime\" and \"collective punishment\".[166]\n\nMarriages and relationships [ edit ]\n\nA pregnant Farrow with André Previn at Juilliard, 1969\n\nFrank Sinatra [ edit ]\n\nOn July 19, 1966,[167] she married singer Frank Sinatra at the Las Vegas home of Jack Entratter.[169] Farrow was 21 years old; Sinatra 50.[33] Sinatra wanted Farrow to give up her acting career, which she initially agreed to do. She accompanied Sinatra while he was shooting several films, but soon grew tired of doing nothing and signed on to star in Roman Polanski's horror film Rosemary's Baby.\n\nFilming of Rosemary's Baby ran over its initial schedule, which angered Sinatra, who had cast Farrow in a role in his film The Detective (1968). After Farrow failed to report for filming, Sinatra cast Jacqueline Bisset in Farrow's role.\n\nIn November 1967, while Farrow was filming Rosemary's Baby, Sinatra's lawyer served her with divorce papers. Their divorce was finalized in August 1968.[172]\n\nFarrow later blamed the demise of the marriage on their age difference and said she was an \"impossibly immature teenager\" when she married Sinatra. The two remained friends until Sinatra's death.\n\nAndré Previn [ edit ]\n\nOn September 10, 1970, Farrow married conductor and composer André Previn in London. She was 25, and he was 41.[175]\n\nFarrow had begun a relationship with Previn while he was still married to his second wife, songwriter Dory Previn. When Farrow became pregnant, Previn left Dory and filed for divorce. Farrow, with two stepdaughters Claudia Previn and Alicia Previn,[176] gave birth to twin sons in February 1970,[175] and Previn's divorce from Dory became final in July 1970.[177]\n\nDory Previn later wrote a scathing song, titled \"Beware of Young Girls\", about the loss of her husband to Farrow.[178]\n\nPrevin and Farrow divorced in 1979.[31]\n\nWoody Allen [ edit ]\n\nIn 1980, Farrow began a relationship with film director Woody Allen.[179][180]\n\nDuring their years together, Farrow starred in thirteen of Allen's films including, A Midsummer Night's Sex Comedy (1982), Zelig (1983), Broadway Danny Rose (1984), The Purple Rose of Cairo (1985), Hannah and Her Sisters (1986), Radio Days (1987), September (1987), Another Woman (1988), Crimes and Misdemeanors (1989), Alice (1990), Shadows and Fog (1991), and her final film with Allen, Husbands and Wives (1992).\n\nSeveral of her relatives made appearances in Allen's films, including her mother, Maureen O'Sullivan, in Hannah and Her Sisters.[180]\n\nTheir relationship ended in 1992 when Allen's intimate relationship with Soon-Yi Previn, Farrow's 21-year-old adopted daughter, was publicized.[181]\n\nChildren [ edit ]\n\nFarrow's children [ 182 ] ‡ Matthew Previn (b. February 26, 1970) ‡ Sascha Previn (b. February 26, 1970) Lark Previn (adopted 1973; b. February 15, 1973; died December 25, 2008) ‡ Fletcher Previn (b. March 14, 1974) Summer \"Daisy\" Previn (adopted 1976; b. October 6, 1974) Soon-Yi Previn (adopted 1977; b. c. October 8, 1970 ) Moses Farrow (adopted 1980; b. January 27, 1978) Dylan Farrow (adopted 1985; b. July 11, 1985) ‡ Ronan Farrow (b. December 19, 1987) Tam Farrow (adopted 1992; b. 1979; died 2000) Isaiah Farrow (adopted 1992; b. February 3, 1992) Thaddeus Farrow (adopted 1994; b. December 16, 1988; died September 21, 2016) Kaeli-Shea \"Quincy\" Farrow (adopted 1994; b. January 19, 1994) Frankie-Minh Farrow (adopted 1995; b. February 4, 1989) ‡ indicates biological child\n\nFarrow has fourteen children: four biological and ten adopted. She and former husband André Previn have three biological sons: twins Matthew and Sascha (born February 26, 1970),[183] and Fletcher (born March 14, 1974).[184] Sascha is a graduate of Fordham University,[185] while Fletcher, a graduate of Connecticut College, became the chief information officer of IBM.[186] Farrow and Previn adopted Vietnamese infants Lark Song Previn and Summer \"Daisy\" Song Previn, in 1973 and 1976, respectively,[187] followed by the adoption of Soon-Yi from Korea in 1977. Soon-Yi's precise birth date is not known, but a bone scan estimated her age as from 5 to 7, at the time of her adoption.[181] The Seoul Family Court established a Family Census Register (legal birth document) on her behalf on December 28, 1976, with a presumptive birth date of October 8, 1970.[188][189]\n\nIn 1980, following her divorce from Previn, Farrow adopted Moses Farrow, a two-year-old Korean orphan with cerebral palsy.[185] In 1985, Farrow adopted Dylan Farrow (born July 1985, adopted at two weeks old).[190] Dylan was known as \"Eliza\" for some time and also as \"Malone\".[191][167] In December 1991, a New York City court allowed Woody Allen to co-adopt Dylan and Moses.[192]\n\nWith Allen, Farrow gave birth to her fourth and final biological child, son Satchel Ronan O'Sullivan Farrow (later known simply as Ronan Farrow),[2] on December 19, 1987.[193] In a 2013 interview with Vanity Fair, Farrow stated Ronan could \"possibly\" be the biological child of Frank Sinatra, with whom she claimed to have \"never really split up.\"[194] In a 2015 CBS Sunday Morning interview, Sinatra's daughter Nancy dismissed the idea that her father is also the biological father of Ronan Farrow, calling it \"nonsense\". She said that her children were affected by the rumor because they were being questioned about it. \"I was kind of cranky with Mia for even saying 'possibly,'\" she said. \"I was cranky with her for saying that because she knew better, you know, she really did. But she was making a joke! And it was taken very serious and was just silly, stupid.\"[195]\n\nBetween 1992 and 1995, Farrow adopted five more children: Tam Farrow; Kaeli-Shea Farrow, later known as Quincy Maureen Farrow; Frankie-Minh; Isaiah Justus; and Gabriel Wilk Farrow, later known as Thaddeus Wilk Farrow[196] and named after Elliott Wilk, the judge who oversaw Farrow's 1993 legal battle with Allen.[197]\n\nTam Farrow died in 2000 at the age of 21. Farrow's spokeswoman Judy Hofflund stated that she died of cardiac arrest.[198] In May 2018, Moses Farrow made claims on his personal blog that Tam had actually died from a prescription medication overdose following a lifelong battle with depression, and after a fight with her mother.[199] In 2021, Mia Farrow confirmed Moses' claim that Tam had died after an overdose of a prescription medication.[200] On December 25, 2008, Lark Previn died at the age of 35 from complications of HIV/AIDS.[201] On September 21, 2016, Thaddeus Farrow was found dead in his car in Connecticut at the age of 27.[202] It was ruled that he had committed suicide by shooting himself in the torso while inside his car.[203]\n\nFarrow has six biological granddaughters from her and Previn's sons (three by Matthew, one by Sascha, and two by Fletcher). She has nine grandchildren from her adopted children.[204][205][206]\n\nAbuse allegations against Allen [ edit ]\n\nFollowing the revelation that Soon Yi and Allen had been together romantically, Farrow and Allen were in the process of separating. According to court testimony, on August 4, 1992, Allen visited the Farrow farm in Bridgewater, Connecticut to see his children while she was out shopping.[181] During his visit it was alleged by that Allen molested the couple's then-seven-year-old adopted daughter, Dylan.[181] Allegedly Farrow asked Dylan about the incident in question with Dylan responding that Allen had touched her \"private part\" while the two were alone in the attic of the home.[181][207] Farrow reported the incident to the family's pediatrician, who in turn reported the allegations to authorities.[181] Allen was informed of the accusations on August 6 and vigorously denied the allegation citing it as being \"totally false\" and stated that he was \"sickened\" by it.[208] A week later, on August 13, Allen sued for full custody of his biological son, Satchel, and two of Farrow's adopted children, Dylan and Moses, with whom Allen had assumed a parental role.[209][210]\n\nIn March 1993, the lead doctor of Yale New Haven Hospital Child Sexual Abuse Clinic, John Leventhal, gave sworn testimony via a deposition that,[211] in his opinion, Dylan \"either invented the story under the stress of living in a volatile and unhealthy home or that it was planted in her mind by her mother\" because of the \"inconsistent\" presentation of the story by Dylan.[212] Leventhal did not meet with Dylan prior to giving his testimony, and instead delivered his findings based on interviews conducted by others.[209] The Yale New Haven Hospital team's findings were criticized by the presiding judge.[213][214] Justice Elliott Wilk stated that the investigating team's behavior was \"less credible\" and that its recommendations and statements had \"exceed[ed] its mandate.\" He concluded, \"I am less certain, however, than is the Yale-New Haven team, that the evidence proves conclusively that there was no sexual abuse.\"[210]\n\nIn his final decision, in June 1993, Justice Wilk stated that he found \"no credible evidence to support Mr. Allen's contention that Ms. Farrow coached Dylan.\"[209] He rejected Allen's bid for full custody and denied him visitation rights with Dylan, stating that even though the full truth of the allegations may never be known, \"that measures must be taken to protect her.\"[210] In September 1993, the state's attorney, Frank Maco, announced he would not pursue Allen in court for the molestation allegations, despite having \"probable cause\" citing his and Farrow's desire not to traumatize Dylan further.[215] Marco also stated that there is evidence which points to the existence of a reasonable doubt as to the accusation.[216] Farrow has later commented that she would no longer bring dates or significant others into her home in the years following the allegation.[217]\n\nIn February 2014, Dylan publicly renewed her claims of sexual abuse against Allen, in an open letter published by Nicholas Kristof, a friend of Farrow, in his New York Times blog.[218][219][220] Allen has strongly denied the allegations and repeated his denial in his 2020 memoir, Apropos of Nothing.[221] Soon Yi Previn and Moses Farrow have defended Allen against the abuse allegations.[222] In 2013, Moses Farrow publicly asserted that Mia had coached her children into believing stories she made up about Allen.[223][224] In 2018, Moses published a lengthy blog post arguing for Allen's innocence. Moses also recounted a series of incidents in which he and his siblings were physically abused by Farrow.[c]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Wikinews-logo.svg/40px-Wikinews-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/15/Mia_Farrow_and_Andre_Previn_at_Juilliard_%281969%29.jpg/250px-Mia_Farrow_and_Andre_Previn_at_Juilliard_%281969%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Mia_Farrow_in_discussion_with_EUFOR_soldier_%282530868572%29.jpg/250px-Mia_Farrow_in_discussion_with_EUFOR_soldier_%282530868572%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Pulitzer2018-mia-farrow-20180530-wp.jpg/960px-Pulitzer2018-mia-farrow-20180530-wp.jpg", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/40px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/20px-Lock-green.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/John_Farrow_family_1950.jpg/250px-John_Farrow_family_1950.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Mia_Farrow_-1980.jpg/250px-Mia_Farrow_-1980.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Dustin_Hoffman_and_Mia_Farrow_-_John_and_Mary_%281969%29.jpg/250px-Dustin_Hoffman_and_Mia_Farrow_-_John_and_Mary_%281969%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Pulitzer2018-mia-farrow-20180530-wp.jpg/250px-Pulitzer2018-mia-farrow-20180530-wp.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Mia_Farrow_2012_Shankbone_2.JPG/250px-Mia_Farrow_2012_Shankbone_2.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Mia_Farrow_-_Guns_at_Batasi_%281964%29.png/250px-Mia_Farrow_-_Guns_at_Batasi_%281964%29.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Open_Access_logo_PLoS_transparent.svg/20px-Open_Access_logo_PLoS_transparent.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Mia_Farrow_1965_press_photo.jpg/250px-Mia_Farrow_1965_press_photo.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/Mia_Farrow_1998.jpg/250px-Mia_Farrow_1998.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/MiaFarrowAfrica.jpg/250px-MiaFarrowAfrica.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Pulitzer2018-mia-farrow-20180530-wp.jpg/960px-Pulitzer2018-mia-farrow-20180530-wp.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Mia_Farrow", "title": "Mia Farrow", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.3", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Pulitzer2018-mia-farrow-20180530-wp.jpg/960px-Pulitzer2018-mia-farrow-20180530-wp.jpg", "width": 900, "height": 1200}, "title": "Mia Farrow - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}