{"url": "https://people.com/music/justin-bieber-selena-gomez-relationship-timeline/", "text": "Justin Bieber and Selena Gomez had one of the most famous on-off romances in Hollywood.\n\nThe pop stars first met as young teenagers in 2009, after Bieber admitted that the \"Good for You\" singer was his celebrity crush. Under the guise of close friends, the pair went on to quietly date for several months before making their public debut as a couple at the Vanity Fair Oscars party in February 2011.\n\nAfter two years together, they broke up for the first time — a cycle that would repeat for five more years, until their final split (and Bieber's subsequent marriage to model Hailey Baldwin Bieber) in 2018.\n\n\"We were so in love. Nothing else mattered,\" Bieber told Complex in 2015 about his and Gomez's early relationship, calling it a \"marriage kind of thing.\"\n\nFrom the \"Baby\" singer serenading Gomez on New Year's Eve 2009 to their eventual split, here is a look back at Justin Bieber and Selena Gomez's relationship.\n\nEarly 2009: Justin Bieber and Selena Gomez are introduced by their managers\n\nThe pair first met in 2009 when they were introduced by their managers after Bieber revealed in an interview with Los Angeles radio host DJ Skee that Gomez was his celebrity crush.\n\n\"Actually, his manager [Scooter Braun] called my mom, who is my manager,\" Gomez revealed to David Letterman on The Late Show in 2011.\n\nDecember 31, 2009: Justin Bieber serenades Selena Gomez on New Year's Eve\n\nKevin Winter/DCNYRE2010/Getty\n\nThe rising pop star serenaded Gomez on Dick Clark's New Year's Rockin' Eve in Las Vegas, performing his song \"One Less Lonely Girl\" while occasionally stroking Gomez's arm and cuddling up beside her as she sat on a stool and sang along.\n\nFebruary 2010: Selena Gomez says she feels like a \"big sister\" to Justin Bieber\n\nChris Polk/KCA2010/Getty\n\nSpeaking to MTV News, Gomez referred to Bieber as one of her \"good friends.\"\n\n\"I love Justin,\" she told the outlet, calling him \"such a good kid.\" Describing their relationship, she explained, \"And I feel like a big sister now, 'cause I want to protect him. So I'm always very cautious with him, but he is so talented and he's so sweet, so that just started us wanting to work together. Now he's just become one of my good friends.\"\n\nDecember 8, 2010: Justin Bieber and Selena Gomez are spotted on a date\n\nThe pair sparked romance rumors when they were seen walking out of an IHOP in Philadelphia together, according to a photo obtained by TMZ. The two were photographed arm-in-arm during the outing, which took place just before the singers performed separately at the Q102 Jingle Ball — where during a Q&A, Bieber replied to a fan question confirming that of all the \"Disney girls,\" Gomez was his favorite.\n\nGomez later shut down suggestions that they were more than friends, telling MTV News, \"It was pancakes. Who doesn't like pancakes?\"\n\nDecember 31, 2010: Justin Bieber and Selena Gomez spend New Year's together in St. Lucia\n\nOne year after serenading her on live television, the \"Baby\" singer and Wizards of Waverly Place star celebrated their second New Year's Eve together — but this time, they were spotted getting a bit more romantic, with photos surfacing of the pair kissing on a yacht in the Caribbean.\n\nFebruary 28, 2011: Justin Bieber and Selena Gomez make their red carpet debut\n\nGregg DeGuire/FilmMagic\n\nAfter months of quieting the romance rumors, the pair stepped out at the Vanity Fair Oscars party together in coordinated red and black outfits, marking their red carpet debut as a couple. However, they still avoided confirming their relationship status verbally.\n\nMarch 16, 2011: Selena Gomez shies away from confirming her romance with Justin Bieber\n\nDuring an interview with Letterman, Gomez gracefully sidestepped his questions about whether or not she and Bieber were dating after he showed a photo of the pair at the Vanity Fair party.\n\n\"He's been in my life for so long and it's just nice to have someone that understands what you're going through,\" she told him, admitting that she was \"blushing.\"\n\nMay 2, 2011: Selena Gomez confirms her relationship with Justin Bieber\n\nCentral Image Agency/FilmMagic\n\nA few months after their red carpet debut, Gomez opened up to Seventeen about why she finally felt comfortable having their relationship out in the open.\n\n\"I don't like hiding. I do like to keep certain things to myself, but at the end of the day, I'm 18 and I'm going to fall in love,\" she told the outlet. \"I'm going to hang out with people and I'm going to explore myself, and I'm OK with that.\"\n\nMay 22, 2011: Justin Bieber kisses Selena Gomez at the Billboard Music Awards\n\nKevin Mazur/WireImage\n\nSoon after going public with their romance, the pair began to express more affection for each other in public, including at high-profile events like the 2011 Billboard Music Awards. They shared a smooch before Bieber accepted one of his six awards that evening.\n\nSeptember 23, 2011: Justin Bieber rents out the Staples Center for a romantic date night with Selena Gomez\n\nBieber famously rented out the Staples Center (since renamed the Crypto.com Arena) for an epic date night with Gomez, in which the pair enjoyed a candlelit dinner on the court and a private screening of Titanic. Bieber tweeted, \"Romance [isn't] dead. Treat your lady right fellas. #REAL.\"\n\nNovember 20, 2011: Justin Bieber and Selena Gomez attend the American Music Awards\n\nJason Merritt/Getty\n\nThe musicians channeled Old Hollywood glamour at the 2011 AMAs, where Bieber performed and Gomez presented. They packed on the PDA on the red carpet, with Bieber adorably carrying his girlfriend's train at one point.\n\nOctober 24, 2012: Justin Bieber says he never wants Selena Gomez to \"feel like I'm ashamed of her\"\n\nKevin Mazur/WireImage\n\nSpeaking to Oprah Winfrey about the efforts he and Gomez sometimes had to go through to navigate crowds of fans and the paparazzi on dates — like sneaking out the back door of venues — he explained, \"I never make her separate from me [because] I don't ever want her to feel like I'm ashamed of her.\"\n\nHe added, \"I feel like a lot of guys do that, especially in the business,\" saying, \"they don't want to be seen with [their girlfriend], so they'll make them ride in separate cars and do all that getaway stuff.\"\n\n\"[But] if we get away,\" he said, \"we're getting away together.\"\n\nNovember 2012: Justin Bieber and Selena Gomez break up for the first time\n\nAfter nearly two years together, the pair's first split came in early November 2012, following months of denying rumors that their romance was over.\n\n\"She broke up with him about a week ago,\" a source told PEOPLE at the time. \"With them being apart so much it got complicated. She had some trust issues. It's not easy, but the relationship needed to end.\"\n\nThe pair were spotted out to dinner together a few days later, but it didn't appear to lead to anything more.\n\nApril 2013: Justin Bieber and Selena Gomez appear to be back together\n\nKevin Mazur/TCA 2011/WireImage\n\nIn April 2013, Bieber posted a series of throwbacks of himself and his ex, keeping fans wondering if the pair were back on. One photo featured the \"Same Old Love\" singer hugging a shirtless Bieber, captioned, \" 'You've been makin music for too long babe come cuddle' -her.\"\n\nThat same month, a source told PEOPLE that Gomez flew to Oslo, Norway, to catch one of Bieber's performances. \"They were holding hands, hugging and they kissed on the lips,\" the insider said.\n\nDecember 18, 2013: Justin Bieber reflects on his breakup and says he still loves Selena Gomez\n\nDuring an interview with radio host Big Boy, Bieber confirmed that the pair were taking space at that point but that he would always love Gomez and that their split had been incredibly painful for both of them.\n\n\"[The breakup] affected us, especially when we are in front of so many people,\" Bieber said, revealing that his song \"All That Matters\" was written while working through the breakup. \"It's such a public thing. It's just hard for the both of us. But you know, she's a great woman. I love her [to] this day.\"\n\nAugust 27, 2014: Justin Bieber seems to confirm his romance with Selena Gomez on Instagram\n\nThe \"Boyfriend\" singer posted yet another photo of the pair on social media — a black-and-white selfie — which sparked more reconciliation rumors.\n\nNovember 6, 2014: Selena Gomez confirms she and Justin Bieber have split once again\n\nGomez acknowledged their breakup during an interview with Ryan Seacrest when discussing her single, \"The Heart Wants What It Wants,\" which she confirmed was about Bieber. \"He thought it was beautiful. I think it was really hard,\" she said of playing him the song.\n\nWhen asked about where their relationship stood at that point, Gomez told Seacrest, \"I support him. I think I always will. I'm upset when he's upset. I'm happy when he's happy.\"\n\nDecember 2014: Justin Bieber sparks romance rumors with Hailey Baldwin\n\nRumors of a new romance with model Hailey Baldwin (now Hailey Bieber) — Bieber's longtime friend whom he'd go on to have an on-and-off romance with and ultimately marry a few years later — sparked when Bieber posted a slew of photos on Instagram of the pair's New Year's getaway together.\n\nBieber was quick to deny the speculation, sharing a photo of him and Baldwin on Instagram and writing, \"People are crazy. I'm super single and this is my good friend u would know otherwise [sic].\"\n\n2015: Selena Gomez briefly has \"a thing\" with Zedd\n\nKevin Mazur/Getty\n\nGomez collaborated with Russian-German DJ Zedd on their hit song \"I Want You to Know,\" which sparked a fun and fast fling.\n\n\"I adore Anton [Zedd] a lot and I definitely had a thing with him, which was nice,\" she said during a July 2015 interview on New Zealand's radio show The Edge Afternoons.\n\n​​September 2015: Justin Bieber reveals he and Selena Gomez had moved in together before their breakup\n\nNoel Vasquez/Getty\n\nFor Complex's September 2015 cover story, Bieber reflected on his relationship with Gomez, referring to it as a \"marriage kind of thing.\"\n\n\"We were so in love. Nothing else mattered,\" he explained of the pair's early relationship. \"We were all about each other. But when it's like that and you get your value from that, people will always disappoint you.\"\n\nHe added that in retrospect, the relationship moved too fast for what he was ready for at the time — but that he didn't regret it at all.\n\n\"I learned a lot. I moved in with my girlfriend [Gomez] when I was 18. Started my own life with her. It was a marriage kind of thing. Living with a girl, it was just too much at that age,\" he explained.\n\nBieber also opened up about some of the pair's more dramatic ups and downs, explaining, \"when stuff would happen, I would lose my freakin' mind, and she would lose her mind, and we would fight so hard because we were so invested in each other. Love is a choice. Love is not a feeling. People have made it seem in movies that it's this fairy tale.\"\n\nNovember 20, 2015: Justin Bieber serenades Selena Gomez in Beverly Hills\n\nFollowing Gomez's split from Zedd, Bieber was spotted serenading her at a Beverly Hills hotel bar with two rather romantic ballads: The Temptations' \"My Girl\" and his own hit, \"Sorry,\" which is rumored to be about Gomez.\n\nDecember 31, 2015: Justin Bieber kisses Hailey Baldwin in St. Barts\n\nAfter fending off romance rumors for years, Bieber was spotted kissing Baldwin while on a New Year's vacation in St. Barts — and even shared a snap of the sultry smooch himself. In his GQ March 2016 cover story, the singer referred to Baldwin as \"someone I really love.\"\n\nJanuary 4, 2016: Selena Gomez says she's \"so beyond done\" talking about Justin Bieber\n\nDuring a Rolling Stone interview, Gomez was quick to shut down an inquiry about Bieber's 2015 musical serenade.\n\n\"Honestly, what I would love to be printed is that I am so beyond done with talking about that, and him,\" she responded.\n\nThe singer-actress echoed the sentiment the following month, in W's March cover story. \"I'm so exhausted,\" she said of her relationship with Bieber. \"I honestly am so done. I care about his health and well-being. But I can't do it anymore.\"\n\nMarch 23, 2016: Selena Gomez attends Justin Bieber's concert in Los Angeles\n\nOne week after Bieber posted yet another romantic throwback of the pair on Instagram, Gomez was spotted at one of his concerts at the Staples Center in L.A.\n\nMay 8, 2016: Selena Gomez reacts to a fan's Justin Bieber sign at a concert\n\nDuring a performance on her Revival tour, Gomez spotted a fan's sign that read \"Marry Justin Please\" and motioned for it to be passed up to the stage before crumpling and tossing it aside. Videos of the incident quickly went viral, seemingly confirming that things were in poor standing between the former pair.\n\nAugust 2016: Justin Bieber begins dating Sofia Richie, Selena Gomez weighs in and accuses him of infidelity\n\nJun Sato/GC Images\n\nLater that summer, Bieber stepped out several times with Sofia Richie — a relationship that lasted a brief six weeks and received a hefty amount of online criticism from fans.\n\nBieber stood up for his new love interest, who was the target of cyberbullying from \"Jelena shippers\" (fans who hoped for a reconciliation between him and Gomez). He told fans he'd leave social media for good if they didn't back off.\n\n\"I'm gonna make my Instagram private if you guys don't stop the hate,\" Bieber captioned a black-and-white shot with the model. \"This is getting out of hand, if you guys are really fans you wouldn't be so mean to people that I like.\"\n\nGomez commented on the post, prompting a rare social media exchange between the exes. \"If you can't handle the hate, then stop posting pictures of your girlfriend lol - It should be special between you two only,\" Gomez wrote. \"Don't be mad at your fans. They love you and supported you before anyone ever did.\"\n\nThe comment sparked a heated online spat between the two, with Gomez then suggesting that Bieber \"cheated multiple times.\"\n\nJanuary 2017: Selena Gomez starts dating The Weeknd\n\nKarwai Tang/WireImage\n\nThe Only Murders in the Building actress was spotted smooching R&B musician The Weeknd (né Abel Tesfaye) at a restaurant in L.A. in early 2017, kicking off a whirlwind romance that would span 10 months and see them travel to several continents together.\n\nOctober 2017: Justin Bieber and Selena Gomez are seen hanging out, sparking reconciliation rumors\n\nBefore Gomez and The Weeknd's uncoupling was confirmed, the Rare Beauty founder was spotted going to church and grabbing breakfast with Bieber.\n\nThe former flames continued to fuel rumors that they had reunited after Gomez's split from The Weeknd was officially confirmed. The duo were seen riding bikes together and Gomez was spotted wearing Bieber's hockey jersey while cheering him on at a game.\n\nA source told PEOPLE at the time that the pair were enjoying \"quiet date nights at home and outings to local, low-key spots. They are still catching up and just enjoy hanging out. They have learned from past mistakes and are not putting any pressure on each other. Things are much different and more mature.\"\n\nNovember 30, 2017: Selena Gomez opens up about her split from The Weeknd and reuniting with Justin Bieber\n\nKevin Mazur/WireImage\n\nGomez opened up to Billboard about her \"remarkable\" split from The Weeknd, saying the pair \"ended it as best friends.\" She also spoke candidly about reuniting with Bieber, telling the outlet, \"I'm 25. I'm not 18, or 19, or 20. I cherish people who have really impacted my life. So maybe before, it could have been forcing something that wasn't right. But that doesn't mean caring for someone ever goes away.\"\n\nFebruary 14, 2018: Justin Bieber and Selena Gomez celebrate Valentine's Day together\n\nShortly after reconciling, Bieber and Gomez spent Valentine's Day together. \"They celebrated a romantic Valentine's Day,\" a source told PEOPLE at the time. \"They had been apart for a couple of days and seemed happy to be reunited.\"\n\nA few days later, the pair jetted off to Jamaica for Bieber's father Jeremy Bieber's wedding.\n\nMarch 1, 2018: Selena Gomez makes her rekindled romance with Justin Bieber Instagram official\n\nGomez publicly acknowledged their on-again relationship in early March 2018, sharing a photo of herself laughing and holding up a polaroid of Bieber in celebration of his 24th birthday.\n\n\"March 1, 1994 someone I know that happens to be super cool was born. Boom,\" she captioned the shot.\n\nMarch 7, 2018: Justin Bieber and Selena Gomez decide to \"take a break\"\n\nLater that month, the pair were spotted sitting separately at the same church service.\n\n\"They weren't getting along and decided to take a break,\" a Bieber source told PEOPLE. \"It doesn't seem like a big deal and they will probably be fine soon again.\"\n\nJune 10, 2018: Justin Bieber and Hailey Baldwin rekindle their relationship\n\nRicky Vigil M/GC Images\n\nOne month after Baldwin confirmed that the pair had \"moved past\" a stretch of not speaking and the \"weirdness that went on\" between them, they were spotted together at church and later at a nightclub in Miami.\n\nTheir unconfirmed relationship picked up steadily from there, with the couple holding hands and kissing on multiple dates around New York City.\n\nBy the following month, Bieber had proposed to Baldwin on a trip to the Bahamas. The pair went on to tie the knot at an N.Y.C. courthouse that September and they celebrated their union with a religious ceremony in South Carolina in 2019.\n\nOctober 23, 2019: Selena Gomez releases \"Lose You to Love Me\"\n\nTommaso Boddi/WireImage\n\nAfter taking time off from making music, Gomez released \"Lose You to Love Me\" the month after Bieber and Baldwin wed. Fans interpreted the song's emotional lyrics to allude to the singer and Bieber's rollercoaster relationship, with lines like \"Set fire to my purpose and I let it burn\" seemingly referencing Bieber's 2015 album Purpose.\n\nOne of the song's most heart-wrenching lyrics also seemed to reference Bieber's quickness in moving on with his now-wife. \"In two months you replaced us like it was easy,\" Gomez sings.\n\nJanuary 26, 2020: Selena Gomez says she was a \"victim to certain abuse\" in her relationship with Justin Bieber\n\nInan interview with NPR's Lulu Garcia-Navarro, Gomez opened up about her breakup with Bieber and how she's moved forward. \"I've found the strength in it. It's dangerous to stay in a victim mentality. And I'm not being disrespectful, I do feel I was a victim to certain abuse,\" she said, confirming it was \"emotional\" abuse when asked by the interviewer.\n\nLater in the interview, she added that \"Lose You to Love Me\" was a way to help her get closure. \"It's not a hateful song; it's a song that is saying — I had something beautiful and I would never deny that it wasn't that. It was very difficult and I'm happy it's over,\" she explained. \"And I felt like this was a great way to just say, you know, it's done, and I understand that, and I respect that, and now here I am stepping into a whole other chapter.\"\n\nMay 15, 2022: Selena Gomez opens up about her dating life and reveals she's single on Saturday Night Live\n\nWill Heath/NBC/NBCU Photo Bank via Getty\n\nWhile Bieber has navigated the first few years of marriage, he and Gomez have largely kept quiet about each other in recent years. In May 2022, Gomez spoke out about her own love life while hosting Saturday Night Live.\n\nGomez joked about looking for love with \"anyone\" during her opening monologue on the show. \"One reason I've been very happy to host is because I'm single,\" she said, continuing, \"and I've heard SNL is a great place to find romance.\"\n\nSeptember 28, 2022: Hailey Bieber addresses rumors she \"stole\" Justin Bieber from Selena Gomez\n\nDuring an appearance on Alex Cooper's Call Her Daddy podcast, Hailey addressed the claim she stole Bieber from Gomez. \"I can say, period, point blank, I was never with him when he was in a relationship with anybody — that's the end of it,\" the model said.\n\nThe next day, Gomez shared a message on TikTok that seemingly responded to Hailey's interview. In the clip, she spoke about spreading positivity and the irony behind haters supporting her brand, Rare Beauty. \"If you support Rare, I cannot thank you enough, but know that you are also representing what it means — and that is: Words matter. Truly matter,\" the actress said, adding that she was \"all about kind words.\"\n\nOctober 15, 2022: Selena Gomez and Hailey Bieber are pictured together at a Los Angeles event\n\nJust weeks after Hailey spoke out about rumors she \"stole\" Bieber from Gomez, Hailey and Gomez posed for photos together at the Academy Museum of Motion Pictures' 2nd annual gala.\n\nIn one photo, Gomez and Hailey stand and smile together, and in another, the two pose at a table with Gomez's hand on Hailey's leg.\n\nNovember 4, 2022: Selena Gomez says breaking up with Justin Bieber was the \"best thing\" for her\n\nIn her documentary, Selena Gomez: My Mind & Me, Gomez opened up about her very public relationship with Bieber, despite not ever mentioning him by name.\n\n\"I felt haunted by a past relationship that no one wanted to let go of,\" Gomez said. \"But then I just moved past it. I wasn't afraid anymore.\"\n\nShe went on to add: \"I feel like I had to go through the worst possible heartbreak ever. I just think that needed to happen, and ultimately, it was the best thing that ever happened to me.\"", "images": ["https://people.com/thmb/Tk6opfyz3n-qrWySGwKteYWWVzk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(566x999:568x1001)/zedd-selena-gomez-8fa859d9745243c090f9292e8cd53edc.jpg", "https://people.com/thmb/7eFBql8ZZe4iIl8RO9K1pd-UAEc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/justin-hailey-bieber-victoria-monet-tout-123024-a66fb0ee0a89478fbe5e25ba9df61587.jpg", "https://people.com/thmb/FxcPdVVfz_Rpz3GpzYKgRuIeyQk=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(633x719:635x721)/justin-bieber-selena-gomez-12-ba1d239ca59c4c4bbbcb3e6290148938.jpg", "https://people.com/thmb/JriXaljCvYCwii_fihblnkg52tc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/justin-bieber-hailey-bieber-111325-75f47ad4431d4e9085a6570e2de2bde4.jpg", "https://people.com/thmb/L82wFAXr3ZkW3sbMdiYNI69CjTA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(1039x792:1041x794)/justin-bieber-selena-gomez-2-d05edaa22d09486bae25a24f3a057a12.jpg", "https://people.com/thmb/Uo8iLTyanrj7eNHYmSXZHwHJbxY=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/Spencer-Lofranco-112025-56efb2cd379b4817ac0f4d3b10fb37f3.jpg", "https://people.com/thmb/FnQ63VseLGTxhOplCRv-nXSCg3k=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(600x599:602x601)/justin-bieber-selena-gomez-7-848396f0263a4cd69f68c3f9fbfbe20f.jpg", "https://people.com/thmb/uz34Gyn0wxBcEyCQTpmpyN6-D1Q=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(638x819:640x821)/justin-bieber-selena-gomez-6-9c9b58cedcff4d5a957551a693cd36eb.jpg", "https://people.com/thmb/bA1iIr1qNz95nCuTKuWhlhwV-e4=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/Hailey-Bieber-Justin-Bieber-The-League-090525-tout-29ed83d66f3f4ea483a0a52387bb4ca8.jpg", "https://people.com/thmb/GDCOzkxBCGOp67K4hBAXD1iBSio=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/eddie-murphy-nicole-mitchell-paige-butcher-split-111325-ce081c34ea7b46f884155c23e91c0aef.jpg", "https://people.com/thmb/Ne2sqf5KQBpW3MvkXsH5KsQgn3c=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x839:601x841)/justin-bieber-selena-gomez-3-f2d4cb07b7124688a345b1a7d6cc4a87.jpg", "https://people.com/thmb/JzY_KtTo3EE0FLKqKaWVGHOlEEw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/meghan-king-jim-edmonds-main-split-2c6c2bfd59ac4dce9031c7b47d9127c9.jpg", "https://people.com/thmb/xD6vcu5Sk_Ao6o_P8H-1W79_GAU=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/justin-bieber-hailey-bieber-111325-75f47ad4431d4e9085a6570e2de2bde4.jpg", "https://people.com/thmb/ULULgc7B9U_PFVdOwdJvKEXwiOE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Selena-Gomez-marriage-111425-tout-81fa821430a943e59410bd0642010e41.jpg", "https://people.com/thmb/mr4oW0CxDYQduL74t1nnZGGM_kE=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(498x919:500x921)/justin-bieber-selena-gomez-8-83ed1d265ff4484bab3996655bbdfddc.jpg", "https://people.com/thmb/8N_HWraYqa6-oA6xEtoar9K2obA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(691x599:693x601)/justin-bieber-selena-gomez-9-1d83fafcedc34c2bac77fb7e623d8b69.jpg", "https://people.com/thmb/d3H53QI2fo2aQXgBpK9fsoYCfSE=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(555x679:557x681)/selena-gomez-2-198e8b17461c444788486220b0dd6b85.jpg", "https://people.com/thmb/z4D3B6h7FvMPJbyyCZN8OwHHbM4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/selena-gomez-taylor-swift-wedding-111725-7ded0f81776f4daea4367f757dfeaac9.jpg", "https://people.com/thmb/latNy6O_DnRNb9RptOuIm_6YNDY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/minka-kelly-dan-reynolds-relationship-ufc-303-event-041625-6a1e0711fb494f76bec8ece05a8d6b49.jpg", "https://people.com/thmb/djP0TRoy9vuIloEmCmuanA0N1NY=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/quadruple-amputation2-112025-c05ec8d5ca3f44488ab8fd45eb9d724d.jpg", "https://people.com/thmb/AvU89UyLRVv2d49QoVCGbALDnzA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(1039x990:1041x992)/justin-bieber-selena-gomez-11-49eb6956001f46dfb698f4ea47ed42f7.jpg", "https://people.com/thmb/oMAhmBVvFbzWV0QWJrniU92tUlk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/justin-bieber-hailey-beiber-111425-d61e4c9363354321a091b810b74f7bf4.jpg", "https://people.com/thmb/X0CAXH51AL2EE2ZItApgv40GkTY=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(919x840:921x842)/justin-bieber-selena-gomez-5-84d4ab6301464671a5baf95379441fdf.jpg", "https://people.com/thmb/GV6bqVjqa4Mk6AbFtOKnwkphnF8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Hailey-Bieber-Justin-Bieber-The-League-090525-tout-29ed83d66f3f4ea483a0a52387bb4ca8.jpg", "https://people.com/thmb/GPVdv4kV4pRy2HikqdnBYqxYK7I=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(914x819:916x821)/justin-bieber-selena-gomez-10-cd5305061b5548a7994ac65c864a6abc.jpg", "https://people.com/thmb/XGKy6h_fuvbuTE9HF1a3rx9Sfns=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Hailey-Bieber---Kendall-and-Kylie-Jenner-384-110725-d987361412f949cab010204c704c0bdc.jpg", "https://people.com/thmb/fBvVAR9vuLZYlDAFv-9z7EPXoeI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/benny-blanco-selena-gomez-one-month-of-marriage-102825-1-f882a8b5b8634d4fbfe40de3d4cab5c6.jpg", "https://people.com/thmb/xQo68yW6TfdBMeqfFTtp8PuBJ0g=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(565x779:567x781)/selena-gomez-21011cf3e76149619050a33be47ed12a.jpg", "https://people.com/thmb/5dgpVgL820ifGGAGW_ZSYKsWBKk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/hailey-bieber-justin-bieber-5-484cc6f2e7074c6893410cfa6c1cd90b.jpg", "https://people.com/thmb/ew_Q1sbYdgoFSLcaX-8lf55G4L8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/hailey-bieber-wsj-magazine-2025-innovator-awards-103025-1-7dc494445e3443e68dd46f562cbdf905.jpg", "https://people.com/thmb/07OxQKvtxSa79gckbP7h6xBcYRI=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(565x859:567x861)/justin-bieber-hailey-baldwin-a7821b6cf38b4dc4b843a2bf8d63ad96.jpg", "https://people.com/thmb/PcbEYdoXEvIkXa7m11VD8g2Od3o=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(633x679:635x681)/justin-bieber-selena-gomez-4-f996de53d5a44c218e427e0b54b68dd4.jpg", "https://people.com/thmb/bZmGXn3K6QTMep7gwl0CGwOVoA8=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/david-sharon-schoo-leaving-court-102825-31cfe4a2ae50417c99a42136edcfda93.jpg", "https://people.com/thmb/aIREmjonJHqGtWfwkqEadKBD8bU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Billy-Bob-Thornton-and-wife-Connie-Angland-arrive-for-the-Los-Angeles-Premiere-of-Landman-111324-7bc83a53fc8541c88f74faa413f7f1c2.jpg", "https://people.com/thmb/BeWVwsW3djPwRFDSKzN4-xvKUsI=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/justin-bieber-hailey-beiber-111425-d61e4c9363354321a091b810b74f7bf4.jpg", "https://people.com/thmb/MR1-y8aXW09Jd0e5E8MAXjMLrLM=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(570x599:572x601)/justin-bieber-sofia-richie-ee507707a3824d1c9dfd638d2152c7cc.jpg", "https://people.com/thmb/6st_L-XUYHbjg59RSxnPNDkrNt4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/selena-quintanilla-chris-perez-9-7f7ae9ac911b411fa3f7753818d24a9f.jpg", "https://people.com/thmb/pp5fSZnx3gVt3oVo3ZMMN6Rb520=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(979x814:981x816)/justin-bieber-selena-gomez-1-ea80cc6115c448a3951d2fba3db20552.jpg", "https://people.com/thmb/jIK60Q2ZLv7v9GA22X6VPlAmlvU=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/jellyroll-instagram2-112025-8ebe824d77cc42eda053a3e687ae8d0f.jpg", "https://people.com/thmb/PRUt5Rb6-Pby6Uiffq1Ns9snXjg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/justin-bieber-hailey-bieber-110425-79cd3c2c5d4d4c28aef21f5fc0422ef7.jpg"], "top_img": "https://people.com/thmb/pp5fSZnx3gVt3oVo3ZMMN6Rb520=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(979x814:981x816)/justin-bieber-selena-gomez-1-ea80cc6115c448a3951d2fba3db20552.jpg", "keywords": [], "authors": ["Sophie Dodd", "Sophie Dodd Is A Writer For People. She Previously Worked As An Editorial Assistant At People To", "People Editorial Guidelines", "Skyler Caruso", "Madison E. Goldberg", "Michelle Lee", "Ashlyn Robinette", "Kimberlee Speakman", "Charna Flam", "Angel Saunders"], "canonical_link": "https://people.com/music/justin-bieber-selena-gomez-relationship-look-back/", "title": "Justin Bieber and Selena Gomez's Relationship: A Look Back", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Justin Bieber and Selena Gomez dated on-and-off from 2010 until 2018. Here's a look back at the pop stars' relationship.", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "PEOPLE", "sailthru.author": "Sophie Dodd", "parsely-section": "Celebrity", "parsely-tags": "Person,People.com,Celebrity Relationships,Celebrity,Justin Bieber", "article": {"section": "People", "author": "https://www.facebook.com/peoplemag"}, "og": {"type": "article", "site_name": "People.com", "url": "https://people.com/music/justin-bieber-selena-gomez-relationship-look-back/", "title": "Justin Bieber and Selena Gomez's Relationship: A Look Back", "description": "Justin Bieber and Selena Gomez dated on-and-off from 2010 until 2018. Here's a look back at the pop stars' relationship.", "image": "https://people.com/thmb/pp5fSZnx3gVt3oVo3ZMMN6Rb520=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(979x814:981x816)/justin-bieber-selena-gomez-1-ea80cc6115c448a3951d2fba3db20552.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Justin Bieber and Selena Gomez's Relationship: A Look Back", "description": "Justin Bieber and Selena Gomez dated on-and-off from 2010 until 2018. Here's a look back at the pop stars' relationship.", "image": "https://people.com/thmb/pp5fSZnx3gVt3oVo3ZMMN6Rb520=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(979x814:981x816)/justin-bieber-selena-gomez-1-ea80cc6115c448a3951d2fba3db20552.jpg"}, "vf": {"url": "https://people.com/music/justin-bieber-selena-gomez-relationship-look-back/"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.147.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.147.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.147.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.147.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.147.0/icons/favicons/mstile-310x150.png", "fb": {"pages": 95926963131}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}