{"url": "https://ew.com/gallery/ranking-bachelorette-seasons/", "text": "21. Season 2 (Meredith Phillips) Bob D'Amico/ABC Meredith was the first Bachelorette to be on a season of The Bachelor, this one led by Bob Guiney, who was, in turn, on a season of The Bachelorette (Trista Rehn). Got all that? Although her season wasn't incredibly memorable — she ended up with Ian, in case you forgot (though their love did not last) — as only the second Bachelorette ever, she still holds a place in our hearts…. which is why we're giving our final rose to her. —Dalene Rovenstine\n\n20. Season 17 (Katie Thurston) Craig Sjodin/ABC Even before one episode of her season, Katie Thurston made headlines by wrapping up her Bachelorette \"journey\" one week early. The production may have been shorter, but the season itself was long on drama. Multiple men were called out because they weren't there for the Right Reasons™ (remember Cody? Karl? Thomas?), and during an emotional group date in week 2, Katie revealed that she's a survivor of sexual assault. Front-runners were thrown for a loop when Blake — the guy who fell for two Bachelorettes in season 16 — showed up and declared that Katie was The One. And you know what? He was right! Though before he could get engaged to Katie, she had to go through a very intense breakup with Greg. Speaking of Katie and Greg, we haven't seen a post-finale interview so chilly since Jason Mesnick broke up with Melissa Rycroft on After the Final Rose way back in 2009. —Kristen Baldwin\n\n19. Season 9 (Desiree Hartsock) Craig Sjodin/ABC Coming off Sean Lowe's season of The Bachelor, Desiree was pitched as the nice girl. And she was. But nice only goes so far in terms of entertainment. Her one saving grace? All the drama surrounding Brooks Forester — her number one pick — who decided to leave the show, and somehow led to Desiree realizing that her true love, Chris Siegfried, was right in front of her the entire time. The two are now married and have two sons. —Samantha Highfill\n\n17. Season 19 (Gabby and Rachel) Rachel Recchia and Gabby Windey. Craig Sjodin/ABC/Getty They trauma-bonded during Clayton Echard's wretched season of The Bachelor, so ABC rewarded Gabby Windey and Rachel Recchia with the first ever dual-Bachelorette reign. Though most things are better with a BFF, finding a husband on TV isn't one of them: Two Bachelorettes meant each woman had half as much time to get to know the men, and too much of that time was taken up with the guys figuring out which Bachelorette they wanted to court. The gimmick made for decent drama — especially when a slippery videographer named Logan tried to hop from Team Rachel to Team Gabby — but it wasn't particularly effective when it came to helping the women find \"love.\" Rachel's relationship with her \"winner,\" Tino Franco, imploded before the finale even aired, and Gabby broke up with Erich \"I'm sorry I did blackface\" Schwer a few months later. —Kristen Baldwin\n\n16. Season 7 (Ashley Hebert) Kenny Ting/ABC A rare Bachelor Nation success story, Ashley Hebert made it down the aisle with the winner of her final rose. (However, the couple announced their separation in October 2020, and they have since divorced.) Ashley met her now ex-husband J.P. Rosenbaum on the seventh season of the show after getting her heart broken by Brad Womack on the 15th season of The Bachelor. She endured some tough blows when two men voluntarily quit her season. Ashley and J.P. were married for eight years and have two kids together. —Madeline Boardman\n\n15. Season 18 (Michelle Young) Michelle Young from 'The Bachelorette.'. ABC/Sami Drasin The very likable 28-year-old teacher from Minneapolis brought a refreshing dose of maturity and honesty to her season — whether scolding her suitors for not paying enough attention to her on the \"slumber party\" date, or talking openly about feeling like the \"token Black girl\" growing up in Minnesota. Barring a few drama junkies (see: Jamie, Chris S.), the men on Michelle's season were top-notch — which only makes it sadder that producers chose Clayton (instead of Rodney, or Brandon, or Olu, or Leroy…) as the Bachelor. But let's focus on the positive: Michelle found her \"person,\" and we got to spend lots of time with her absolutely adorable parents, LaVonne and Ephraim over the course of the season. Plus, the After the Final Rose special made headlines… but not for the reasons ABC hoped: Producers were shamed into making the live studio audience put on masks mid-broadcast after viewers blasted the show on Twitter. —Kristen Baldwin\n\n14. Season 4 (DeAnna Pappas) Kevin Foley/ABC via Getty Images Before becoming the Bachelorette, DeAnna was a part of one of the most shocking Bachelor finales in history when Brad Womack sent both of his final two women home. Pappas then took her adorable accent to The Bachelorette, where she introduced the world to Jason Mesnick — who would go on to become the Bachelor. Sadly, not much else came out of her season, unless you count her failed relationship with that snowboarder. —Samantha Highfill\n\n13. Season 3 (Jennifer Schefft) Bob D'Amico/ABC The third Bachelorette to look for love on air, Jen Schefft nabbed the gig after winning Andrew Firestone's season of The Bachelor. While her love with Firestone didn't last, she had quite the twist in store for her own season of The Bachelorette. She made it all the way to the final episode, only to turn down both Jerry Ferris and John Paul Merritt, her last two suitors. —Madeline Boardman\n\n12. Season 13 (Rachel Lindsay) Craig Sjodin/ABC After being rejected by Nick Viall, Rachel faced more pressure than usual when she became the first Black Bachelorette. But she handled it gracefully — even as she, unfortunately, had to deal with that whole Lee vs. Kenny scenario. Sadly though, her season wasn't nearly as epic as many had hoped (especially if you were rooting for Peter). —Samantha Highfill\n\n11. Season 6 (Ali Fedotowsky) Bob D'Amico/ABC The sixth Bachelorette almost never had her own season of the reality franchise: On Jake Pavelka's season 14 (aka The Bachelor: On the Wings of Love), Ali made history by putting her career ahead of a man — gasp! She quit The Bachelor instead of her job… but then she wound up quitting anyway and becoming the Bachelorette. Thankfully for us she did, because her season offered up Justin \"Rated R\" Rego and Kasey Kahl. The images of Justin trying to flee the show while in a foot cast and Kasey being stranded on a glacier are some of the best of the series to date. And on top of all that, Ali and Robert made a pretty cute couple, even if it wasn't forever. —Dalene Rovenstine\n\n10. Season 14 (Becca Kufrin) Paul Hebert/ABC After getting blindsided by Arie post-proposal on The Bachelor, Becca bounced back with her own \"journey\" to find \"love.\" Her pack of potential husbands included some future Bachelor Nation favorites, including male model/sound bite machine Jordan Kimball, the stylish and oh-so-chill Wills Reid, and the very sweaty Blake Horstmann (who would go on to be public enemy No. 1 on Bachelor in Paradise season 6). Though she and Garrett Yrigoyen wound up engaged in the finale, they parted ways in August 2020. —Samantha Highfill\n\n9. Season 16 (Clare Crawley/Tayshia Adams) Maarten de Boer/ABC; Kwaku Alston/ABC You thought a global pandemic was the most dramatic thing to happen in 2020? Bachelor Nation was equally shook by the strangeness of this season. First came the out-of-left-field Bachelorette, Clare Crawley — a contestant last seen in 2018 on Bachelor Winter Games and, at 38, the oldest Bachelorette ever. Then came the behind-the-scenes drama: Once shooting finally got underway in the LaQuinta \"bubble\" in Palm Springs, Clare broke the land-speed record for falling in love and exited the season 4 weeks in with her newly-minted fiancé, Dale Moss, in tow. (They split in January 2021.) Enter Tayshia Adams, a fan favorite from Colton's season of The Bachelor. After many sweaty dates and many tears, she found her \"person\" in Zac Clark, an addiction specialist from New Jersey. Their relationship ended the following year. —Kristen Baldwin\n\n8. Season 20 (Charity Lawson) Charity and Dotun on 'The Bachelorette'. Christopher Willard/ABC via Getty Images Yes, we know producers spent way too much time on the Brayden drama, but this season makes the top 10 because the romance between Charity and the man who became her fiancé — Dotun Olubeko, the 31-year-old integrative medicine specialist from Nigeria — was one of the sweetest, purest love stories we’ve ever seen from this franchise. From their first real conversation at the mansion in week two to their glorious hometown date (where Dotun’s grandma declared that he and Charity were “bonded from Heaven”), these two actually made us believe in love again. —Kristen Baldwin\n\n7. Season 10 (Andi Dorfman) Craig Sjodin/ABC Andi Dorfman really had her pick of guys: a buff baseball player, a fit farmer, a pantspreneur, and a Nick Viall, among others. But these guys didn't play well together and created a lot of drama outside of their relationships with Andi. As she might say, \"Staaaahhhp.\" It was entertaining for viewers at times, but also got a bit old. The constant fighting took a toll on the Bachelorette, and the news of Eric's death put a more somber tone on the end of the season. —Dalene Rovenstine\n\n6. Season 8 (Emily Maynard) Craig Sjodin/ABC Emily Maynard couldn't quite catch a break when it came to ABC's dating franchise, a turn that was unfortunate for the single mother but juicy for viewers. After losing her then-fiancé in a plane crash, Maynard went on the 15th season of The Bachelor and won, accepting a proposal from Brad Womack. They broke up soon after, and she got another shot at love as the eighth Bachelorette. She was in for heartbreak once more, however, as she chose Jef in the finale, only to break up with him a few months later. —Madeline Boardman\n\n5. Season 15 (Hannah Brown) Ed Herrera/ABC The former beauty queen had two villains to deal with over the course of her season: Luke P., a sanctimonious control freak who tried to slut-shame Hannah for her Fantasy Suite dates, and \"winning\" bachelor Jed, who turned out to be a lying liar who lies (specifically about having a serious girlfriend before filming began). As irritating as Luke P.'s antics were, it made it all the more satisfying when Hannah gave him the what-for in Greece: \"I have had sex, and Jesus still loves me.\" Bachelor Nation knew before Hannah did that Jed was no good, and it was hard to watch her accept his proposal — but at least she sent the wannabe musician packing in the end. —Samantha Highfill\n\n4. Season 12 (JoJo Fletcher) Craig Sjodin/ABC After JoJo had her heart broken by Ben Higgins, it was impossible not to root for her to find happiness. (After all, she has a mother who drinks wine straight from the bottle!) Add in a passionate cowboy named Luke, a protein powder-loving Chad Bear, and, well, Jordan, and there was more than enough drama to go around... until there wasn't. Sadly, JoJo's season was either highly entertaining or borderline boring, but hey, at least she found love, right? And it lasted! After being engaged for six years, JoJo and Jordan tied the knot in May 2022. —Samantha Highfill\n\n3. Season 5 (Jillian Harris) Kevin Foley/ABC After being turned down by Jason Mesnick, Jillian and her oh-so-relatable personality went on to become the Bachelorette. And thanks to her season, we were introduced to Kiptyn Locke, who would become a longtime Bachelor franchise favorite, and Jake Pavelka, who would become a much-debated Bachelor. But perhaps most importantly, we met the unforgettable Wes Hayden, the guitar playing bad boy America loved to hate. —Samantha Highfill\n\n2. Season 11 (Kaitlyn Bristowe) Craig Sjodin/ABC A textbook \"guy's girl,\" Kaitlyn Bristowe became an early frontrunner on Chris Soules' season of The Bachelor. While she was eventually edged out by Becca Tilley and Whitney Bischoff, she won the real prize when she became ABC's 11th Bachelorette. She was a star for the ages: funny, entertaining, and as real as you can be with a dozen cameras on you at all times. Bristowe and her pick, Shawn Booth, were engaged for three years before ending their relationship in 2018. —Madeline Boardman", "images": ["https://ew.com/thmb/AZ4GJzs0h_iddj2_sVdT1Vac1Y4=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/gettyimages-93746306-0091075ce94b4f6c976885d1e5de21b3.jpg", "https://ew.com/thmb/PK9cCxVci6LsUuFY2HNBDsZIrso=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/135044_1887r1_ful-ba522d5921374cca9d4ac2a1c15b2379.jpg", "https://ew.com/thmb/jMMICfWF6uxkoKE0fYXmApKCN1w=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/Bachelorette-957dbabe481749af8389e4f40fe3a520.jpg", "https://ew.com/thmb/WawkPtNyShfTlGOMBK3W0AMGRcs=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/151633_0794-2000-9c7a9307038b4c4393382e4ac39371b4.jpg", "https://ew.com/thmb/4GxF1j_sWzX9zfMEQiFsNl2dJNs=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/159841_0417_v1-236da51c2684472297dfd8f87c375b23.jpg", "https://ew.com/thmb/tDrcG-xSJFJQ1ulg1BHAzeSi3cg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/MEL-OWENS-PEG-110525-b13d3389d5b9473b9611bbdbf3fddaec.jpg", "https://ew.com/thmb/x1yJDOmuvXrlYl8sZrkso_vYnHc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/survivor-49-Rizo-Velovic-jeff-probst-111825-6285824536f945cb81e5876c09406764.jpg", "https://ew.com/thmb/_y08WxwSYqAY0UP4rpJT2ptMNtE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Gerry-Turner--731-100925-e326438bca72404ab39546d5e9800de8.jpg", "https://ew.com/thmb/IPZfwUC-okBSdgcvNvc8e2RdOkU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Darrell-Hammond-saturday-night-live-dick-cheney-111225-1f5304d219444e089f67771eb65d7784.jpg", "https://ew.com/thmb/lcdlKUk7H5-Co_fEd20XAwfeChQ=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/Charity-Dotun-Bachelorette-082323-2d799a2045ec46358c375e8b7e950c34.jpg", "https://ew.com/thmb/D-bm3_RD5HS1BsiCNqdujeqQmtE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/the-golden-bachelor-MEL-OWENS-NICOLE-102925-05e1608c44e040fbb72def41f0f184cf.jpg", "https://ew.com/thmb/SkOBe12-gxboPP_RihtT5In_Pe8=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/148862_dsc01825-2000-0ef62db76fac4943976713051fc40fbb.jpg", "https://ew.com/thmb/aEI4rIZDgBkmBOFPNKQhsAfEmbY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Netflix-Cooking-shows-110823-tout-94d8032711c147b9abbc8e6fe723ccf1.jpg", "https://ew.com/thmb/ElSdJdbKemtl31qDt6w5jIcm5d4=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/66326_183_ful-c9b50430f59c4837a2b32c2de727dba4.jpg", "https://ew.com/thmb/t-xMnazqNKHl-1TRcV3LeYwfha0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/gerry-turner-theresa-nist-121124-11e8664a91ee4b4984221537f5203785.jpg", "https://ew.com/thmb/lgLG_Z-MBSzlpGpb5nAhD9b8nis=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/jesse-palmer-golden-bachelor-102925-822e7ada4ce9461b9381cafa56ff1c2c.jpg", "https://ew.com/thmb/qdRhNtBs-LeZYrmtBcKYi7TxhKg=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/156978_0645-1f14b1fab0974d91ba11feece985b9fd.jpg", "https://ew.com/thmb/gjlDGg3023enkUHSuToGmU8AJB0=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/146142_1130-2000-304b9eb50ab640488e94305e35bde49d.jpg", "https://ew.com/thmb/4K2UWkzwYhR6aazSCsz8NmYiGK4=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/142735_1079-f288537ffa9d4753b0f0c2a2fcaea0de.jpg", "https://ew.com/thmb/cbKevO9HloOxbfZKx-BlXFjfMQU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/the-bachelorette-ranking-2000-1b0799504f484542a3e6024d4565cc25.jpg", "https://ew.com/thmb/TeCVTxER7qzTnrO1A_Lb_flR9A0=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/67482_21_215_ful-f06114bf07df41bca995df956f6ef25b.jpg", "https://ew.com/thmb/M1tbBsz-MVL8Cg2Ha-sAaNFvSYA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Nikki-Glaser-SNL-110925-e9624e93aecc4dda92e49398d1f5dd02.jpg", "https://ew.com/thmb/g-2Op14bBr-LeEjXjb3LlcgmXHs=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/the-bachelorette-514cf1ace1f04a179edcfb0d9935a2a8.jpg", "https://ew.com/thmb/Bqy_RAOwqlb1YaAn0iaourZSUlU=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/131656_1612r1_ful-be47e0173ede41048c95e8623bbf7a61.jpg", "https://ew.com/thmb/9kTJ7qtp827bBePJDKNG1oEMr4A=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/NCIS-102825-1-45854be259f640608d9dae5eb26d8721.jpg", "https://ew.com/thmb/C3MZ3FVC71aXsmHHCfmFuYEkhGM=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/jenn-tran-devin-the-bachelorette-after-the-final-rose-111924-384bd18d150945b1b9ff7d9ede1b91b7.jpg", "https://ew.com/thmb/tNy8Km5_Wune84eO7A-g3HykCEM=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/119510_d_564_ful-41d5d5a537f548d7ad404404e159a3b2.jpg", "https://ew.com/thmb/s6nG9ClkIhopelX4ph8Yr80OmLA=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/115951_d_0735_ful-b983fb4e81bc46399a051ede1d4684ab.jpg", "https://ew.com/thmb/-4eMZE16VAbzdVk4FA2iADXf8OQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Survivor-49-sage-shannon-103025-407ed3f7cd4c4073882e6edf7c182e2e.jpg", "https://ew.com/thmb/ot2nlJZn2OME0QLi91loe8H0ig4=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/Rachel-Recchia-and-Gabby-Windey-2022-6461c7e9b0bd4a07a232aa81953fe36a.jpg", "https://ew.com/thmb/zumtWrgOB1CdUlceLSRJxuCzPoo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Glen-Powell-Monologue-SNL-111625-01-495d77a5f4a1408698e7ddbb6bbafc2c.jpg", "https://ew.com/thmb/sB-DsV1FuLShLq-W_92gcZwoQXw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/THE-GOLDEN-BACHELOR-Finale-111025-2-76096ce6a8be4243b4816d8558208232.jpg", "https://ew.com/thmb/VgeLvBdo900QGxU9Pxjj76EoxDY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/survivor-Steven-Ramm-111125-3d7558863020484c91ce94ebfe1eec44.jpg", "https://ew.com/thmb/N46Ft50JD-0EU394cCURjCi0Wwo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/millie-bobby-brown-david-harbour-stranger-things-5-premiere-110725-d4a174b1ac014d34924b8225760c20f3.jpg", "https://ew.com/thmb/0QCShFMaTVneZm6tguDpBa0PdZU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Darrell-Hammond-as-Donald-Trump-snl-alec-baldwin-as-donald-trump-snl-111225-ab016d57c3684c7a99ea835b31076d2e.jpg", "https://ew.com/thmb/IOE68YQdqFmDQN-GqbEutO67iK8=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/124115_4065_ful-4caeb0f33d624a0e9c88df606db595f1.jpg", "https://ew.com/thmb/ccQ3EZydJiT0SKa6P02DHfGyJao=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/138792_0834-ddda8ac4be8f44b889b4e7be5b8fcfb1.jpg", "https://ew.com/thmb/7d7MzZ_jAt63tvlh_G5wCF_h16g=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/101272_279-ph20041109_179-36d73f919c674a37a6f6b6e7228f13d8.jpg"], "top_img": "https://ew.com/thmb/cbKevO9HloOxbfZKx-BlXFjfMQU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/the-bachelorette-ranking-2000-1b0799504f484542a3e6024d4565cc25.jpg", "keywords": [], "authors": ["Kristen Baldwin", "Joey Nolfi", "Emlyn Travis", "Lauren Huff", "Andy Hoglund", "Dalton Ross", "Debwolfinsohn", "Ilana Gordon"], "canonical_link": "https://ew.com/gallery/ranking-every-season-of-the-bachelorette/", "title": "Ranking every season of The Bachelorette", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "From Trista in season 1 to Jenn in season 21, EW ranks every season of 'The Bachelorette,' worst to best.", "parsely-section": "TV", "parsely-tags": "Show Fandoms,Entertainment Weekly,TV Genres,Bachelor Universe Fandom,Reality,ABC,TV,News,Reality Dating & Relationship Shows", "article": {"section": "EW", "author": "https://www.facebook.com/entertainmentweekly"}, "og": {"type": "article", "site_name": "EW.com", "url": "https://ew.com/gallery/ranking-every-season-of-the-bachelorette/", "title": "Ranking every season of 'The Bachelorette'", "description": "From Trista in season 1 to Jenn in season 21, EW ranks every season of 'The Bachelorette,' worst to best.", "image": "https://ew.com/thmb/cbKevO9HloOxbfZKx-BlXFjfMQU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/the-bachelorette-ranking-2000-1b0799504f484542a3e6024d4565cc25.jpg"}, "twitter": {"card": "summary_large_image", "site": "@EW", "title": "Ranking every season of 'The Bachelorette'", "description": "From Trista in season 1 to Jenn in season 21, EW ranks every season of 'The Bachelorette,' worst to best.", "image": "https://ew.com/thmb/cbKevO9HloOxbfZKx-BlXFjfMQU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/the-bachelorette-ranking-2000-1b0799504f484542a3e6024d4565cc25.jpg"}, "vf": {"url": "https://ew.com/gallery/ranking-every-season-of-the-bachelorette/"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.104.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.104.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.104.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.104.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.104.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://ew.com", "summary": ""}