{"url": "https://www.reddit.com/r/The100/comments/8vl0v3/bob_eliza_bellarke_fandom_wins_at_eonline_tv/", "text": "Most shocking character deaths in The 100\n\nThe 100 is known for its high character turnover, and fans have shared their thoughts on the most shocking character deaths in the show. Here are some of the most discussed deaths:\n\nLincoln\n\nLincoln's death was particularly shocking and heartbreaking for many fans. He was a beloved character who had a significant impact on the storyline, especially through his relationship with Octavia.\n\nLexa\n\nLexa's death was another shocking moment that left many fans upset, especially given her strong character and relationship with Clarke.\n\nBellamy\n\nBellamy's death was highly controversial and left many fans feeling betrayed by the storyline.\n\nDiyoza\n\nDiyoza's character development from a villain to an anti-hero made her death particularly impactful.\n\nKane\n\nKane's death was a significant moment that marked the end of a character who had undergone substantial moral evolution.\n\nWells Jaha\n\nWells' death was a shocking early character death that set the tone for the show's willingness to kill off major characters.\n\nJasper\n\nJasper's death was sad for many fans, especially given his long and painful journey throughout the show.\n\nMonty and Harper\n\nThe deaths of Monty and Harper were bittersweet, as they lived a full life together and left a legacy behind.\n\nSinclair\n\nSinclair's death was touching due to his pure character and his relationship with Raven.\n\nFinn\n\nFinn's death was a tragic moment where Clarke had to kill him to spare him from torture.\n\nPike\n\nPike's death was well-deserved in the eyes of many fans, given his actions against the Grounders.\n\nRoan\n\nRoan's death was seen as unfair and brutal, especially given his portrayal as a strong warrior.\n\nMadi\n\nMadi's near-death experience and subsequent locked-in syndrome was a heartbreaking moment for many fans.\n\nAbby\n\nAbby's death and the subsequent mind wipe was a sad moment for Clarke and many fans.\n\nFor more discussions and insights, you might want to check out these subreddits:", "images": ["https://styles.redditmedia.com/t5_2x5yb/styles/bannerBackgroundImage_gerp664zoyz41.png", "https://id.rlcdn.com/472486.gif", "https://b.thumbs.redditmedia.com/bPFBfRbqTH8UnYhqydT8lcC02U9L1noObUEMlh35pLM.png", "https://external-preview.redd.it/nN2BIJxrNKugMk1aRkCssp1rGsnoXoRj1HGgF-HCVgE.jpg?blur=40&format=pjpg&auto=webp&s=22f518ecda69c392f65c33de8487670a45e4847d", "https://www.redditstatic.com/shreddit/assets/favicon/64x64.png", "https://external-preview.redd.it/nN2BIJxrNKugMk1aRkCssp1rGsnoXoRj1HGgF-HCVgE.jpg?width=640&crop=smart&auto=webp&s=9947568eec58ac2011ba467b513b51ab2c71fad8"], "top_img": "https://www.redditstatic.com/shreddit/assets/favicon/64x64.png", "keywords": [], "authors": [], "canonical_link": "", "title": "The heart of the internet", "meta_data": {"viewport": "width=device-width, initial-scale=1, viewport-fit=cover", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black", "msapplication-navbutton-color": "#000000", "theme-color": "#000000"}, "movies": [], "publish_date": null, "source": "https://www.reddit.com", "summary": ""}