{"url": "https://itsblossom.com/nicole-kidman-magazine-cover-cant-recognize/", "text": "From her extensive career as an actress on both the big and small screen, to oozing grace and sophistication on every magazine cover she’s appeared on, there’s truly nothing Nicole Kidman can’t do while looking like a goddess. But when we saw Kidman’s October 2018 Marie Claire cover, we were a bit shocked. Through no fault of her own, Kidman looks nothing like herself. Is it just us or…?\n\nHer dyed red hair against the cherry red background paired with bright red lips is a lot to take in all at once. But after cutting through the color, it’s still so hard to figure out whose face is gracing the October 2018 issue of Marie Claire. Thankfully, “Nicole Kidman” is written in bold white lettering right next to her portrait so we can put two and two together.\n\nAlthough the photo is beautiful and is giving us grunge ’90s vibes, having so much of Kidman’s face concealed by her new, unrecognizable hair may be to blame for us not registering who the heck it is. Or maybe Photoshop is to blame…\n\nThis cover comes several months after Marie Claire underwent a total rebrand, remarking its territory as a prominent fashion and lifestyle magazine. Prior post-rebrand issues have featured cover models Zendaya, Halsey, and Amy Adams, and each cover shoot has been clean and simple with a vintage flair.\n\nKidman’s cover follows suit, yet it feels confusing compared to those that came before it. Seriously, what is up with this pic?\n\nAnd the rest of the photos from the cover shoot are no better. The red on red on red look could have worked if Kidman’s face wasn’t photoshopped within an inch of its life AND if her hair wasn’t covering her face.\n\nAt least we have this video of Kidman doing the Marie Claire “Pop Quiz” to verify that the cover model was actually her and not a stand-in.\n\nUnfortunately, this isn’t the first time that a woman has been heavily photoshopped on the cover of a magazine (remember Kerry Washington on the cover of Adweek?) In fact, at this point in time, such alterations are pretty standard. But why is it that we have to hide perfectly normal body types and features with the likes of photo-editing? I mean, if Marie Claire is trying to rebrand, shouldn’t they pave the way by ignoring what society has deemed “imperfections”?\n\nAs you can imagine, the internet has a lot to say:\n\nShe’s talented actress what do you gain by airbrushing her beyond recognition? An insult to real women. She’s 50. Stop pretending — Mary Kachinske (@MKachinske) September 26, 2018\n\nNicole Kidman Is Barely Recognizable on Marie Claire’s October Cover https://t.co/w6UHguCvsp via https://t.co/0pNEUlOa2r — Fashion & Beauty NG (@omnigist1) September 19, 2018\n\nJust got my new @marieclaire magazine... Nicole Kidman is a beautiful lady but this just doesn't look like her! #photoshop #magazine #Retouch — Michelle P (@michmichsf) September 24, 2018\n\nmarie clare needs to dismiss the guy who made this photoshop in nicole kidman’s photos — t. (@swifttkidman) September 17, 2018\n\nUsually, we’re always happy to see our girl Nicole. But this photo caused us to react the same as we did when our dad shaved his beard off during our terrible twos: Who is that person and why are they in our house? We’ll let this strange cover fly, Marie Claire — because we love you regardless.", "images": ["https://itsblossom.com/wp-content/uploads/2018/09/41254901_2070885556573727_5776327066808380137_n-e1537993326967.jpg", "https://secure.gravatar.com/avatar/15582943fcd700a6a538709c95c9fbdf139ada5007a578504e3471ec0115136d?s=96&d=mm&r=g"], "top_img": "https://itsblossom.com/wp-content/uploads/2018/09/41254901_2070885556573727_5776327066808380137_n-e1537993326967.jpg", "keywords": [], "authors": ["Abssar Ch"], "canonical_link": "https://itsblossom.com/entertainment/trending-topics/nicole-kidman-magazine-cover-cant-recognize/", "title": "Nicole Kidman Looks So Photoshopped On This Magazine Cover That You Won’t Recognize Her", "meta_data": {"robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Discover the best DIY projects, life hacks, and crafty ideas to add a little magic to your daily routine.", "og": {"locale": "en_US", "type": "website", "title": "Inspiration For Your Most Creative Self", "description": "DIY projects, life hacks, and crafty ideas to make everyday life easier and more fun.", "url": "https://www.stgitsblsm.wpenginepowered.com", "site_name": "Blossom", "image": {"identifier": "https://itsblossom.com/wp-content/uploads/2018/09/41254901_2070885556573727_5776327066808380137_n-e1537993326967.jpg", "width": 1080, "height": 598, "type": "image/jpeg"}}, "article": {"published_time": "2018-09-26T20:34:25+00:00", "modified_time": "2018-09-26T21:31:35+00:00"}, "author": "Abssar ch", "twitter": {"card": "summary_large_image", "label1": "Written by", "data1": "Abssar ch", "label2": "Est. reading time", "data2": "3 minutes", "domain": "stgitsblsm.wpenginepowered.com", "url": "https://www.stgitsblsm.wpenginepowered.com", "title": "Inspiration For Your Most Creative Self", "description": "DIY projects, life hacks, and crafty ideas to make everyday life easier and more fun."}, "tags": "beauty,celebrities,celebrity,Marie Claire,Marie Claire cover,news,Nicole Kidman,Nicole Kidman magazine cover,Nicole Kidman on Marie Claire,Nicole Kidman photoshoot,trending,Trending Topics", "msapplication-TileImage": "https://itsblossom.com/wp-content/uploads/2023/11/fav.png", "viewport": "width=device-width, user-scalable=yes, maximum-scale=1"}, "movies": [], "publish_date": 1537994065.0, "source": "https://itsblossom.com", "summary": ""}