{"url": "https://www.good.is/articles/trump-stares-at-the-sun", "text": "In the United States, where some significant portion of the public believes that the government is out to take their guns, the idea that a mass shooting was orchestrated by the government in an attempt to make guns look bad may be appealing both psychologically and ideologically. Our studies of mass shootings and conspiracy theories help to shed some light on why these events seem particularly prone to the development of such theories and what the media can do to limit the ideas' spread.\n\n\n\nBack to the 1990s Mass shootings and conspiracy theories have a long history. As far back as the mid-1990s, amid a spate of school shootings, Cutting Edge Ministries, a Christian fundamentalist website, found a supposed connection between the attacks and then-President Bill Clinton. The group's website claimed that when lines were drawn between groups of school-shooting locations across the U.S., they crossed in Hope, Arkansas, Clinton's hometown. The Cutting Edge Ministries concluded from this map that the \"shootings were planned events, with the purpose of convincing enough Americans that guns are an evil that needs to be dealt with severely, thus allowing the Federal Government to achieve its Illuminist goal of seizing all weapons.\" Beliefs persist today that mass shootings are staged events, complete with \"crisis actors,\" people who are paid to pretend to be victims of a crime or disaster, all as part of a conspiracy by the government to take away people's guns. The idea has been linked to such tragedies as the 2018 Marjory Stoneman Douglas High School shooting in Parkland, Florida, and the Sandy Hook Elementary attack that resulted in the deaths of 20 children in Newtown, Connecticut, in 2012.\n\nThese beliefs can become widespread when peddled by prominent people. U.S. Rep. Marjorie Taylor Greene has been in the news recently because of her belief that the Parkland shooting was a \"false flag,\" an event that was disguised to look like another group was responsible. It's not clear, though, in this instance who Rep. Greene felt was really to blame. Conservative personality Alex Jones recently failed to persuade the Texas Supreme Court to dismiss defamation and injury lawsuits against him by parents of children who were killed in the 2012 Sandy Hook shooting. Jones has, for years, claimed that the Sandy Hook massacre didn't happen, saying \"the whole thing was fake,\" and alleging it happened at the behest of gun-control groups and complicit media outlets. After the country's deadliest mass shooting to date, with 59 dead and hundreds injured in Las Vegas in 2017, the pattern continued: A conspiracy theory arose that there were multiple shooters, and the notion that the shooting was really done for some other purpose than mass murder.", "images": ["https://assets.rbl.ms/60090574/origin.png", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1245 700'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 760 694'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201200%20800'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 454 452'%3E%3C/svg%3E", "https://assets.rbl.ms/55306740/origin.png", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 358 200'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1712 1092'%3E%3C/svg%3E"], "top_img": "https://assets.rbl.ms/55306740/origin.png", "keywords": [], "authors": ["Tod Perry", "Tod Perry Is A Freelance Writer Long Beach", "Adam Albright Hanna", "Good Staff", "Erik Barnes", "Elyssa Goodman", "Mark Wales", "Ryan", "Zoheb Alam", "Craig Carilli"], "canonical_link": "https://www.good.is/articles/trump-stares-at-the-sun", "title": "The Internet Can’t Get Enough Of Trump Staring Directly At The Solar Eclipse", "meta_data": {"fb": {"app_id": 200167090048537}, "twitter": {"site": "@", "card": "summary"}, "og": {"type": "article", "url": "https://www.good.is/articles/trump-stares-at-the-sun", "site_name": "GOOD", "image": {"identifier": "https://assets.rbl.ms/55306740/origin.png", "width": 210, "height": 2000}, "title": "The Internet Can’t Get Enough Of Trump Staring Directly At The Solar Eclipse", "description": "“I have the greatest corneas of all time, really. The best.”"}, "article": {"section": "Articles", "published_time": "2017-08-21T23:55:00+00:00", "modified_time": "2021-12-17T07:40:08+00:00"}, "description": "“I have the greatest corneas of all time, really. The best.”", "referrer": "always", "viewport": "width=device-width,initial-scale=1,minimum-scale=1.0"}, "movies": [], "publish_date": 1503359700.0, "source": "https://www.good.is", "summary": ""}