{"url": "https://www.harpersbazaar.com/celebrity/latest/a19625325/kate-middleton-gives-birth-royal-baby-3-prince-william/", "text": "Every product on this page was chosen by a Harper's BAZAAR editor. We may earn commission on some of the items you choose to buy.\n\n14 min read\n\nPrince William and Princess Kate have fascinated the world since they first went public with their relationship nearly two decades ago. Now, the couple have come to be emblematic of the British royal family, representing the kind of stability that Queen Elizabeth II once provided while also acclimating to today’s values and principles.\n\nThey first met as students at St. Andrews University, where William studied geography while Kate, then known as Kate Middleton, studied art history. “I knew there was something very special about her, and then I knew there was possibly something I wanted to explore there, but we ended up being friends for a while,” William recalled during their 2010 engagement interview. “I do genuinely believe now that being friends with [each other] is a massive advantage.”\n\nSince then, William and Kate have experienced massive amounts of change together within the royal family, from Prince Harry and Duchess Meghan’s exit in 2020 to the ascension of King Charles III to the British throne. They have also welcomed three children: Prince George, Princess Charlotte, and Prince Louis.\n\nAhead, we break down the complete timeline of the Prince and Princess of Wales’s decades-spanning love story.\n\nSamir Hussein // Getty Images\n\n2001: They meet at St. Andrews University.\n\nThe two first met as students at Scotland’s St. Andrews University, where they initially started out as friends. They both studied art history, though William later changed his degree to pursue geography.\n\nSome have speculated that Kate specifically chose to attend St. Andrews University to be in closer proximity to the future king.\n\n“Kate was very strategic,” royal historian Robert Lacey wrote in his 2020 book , per Elle. “She gave up her place at one of Britain’s premier universities, Edinburgh, and opted for another one [St. Andrews] that probably didn’t have the same academic standard. She had already been to Edinburgh to get her flat accommodations sorted out, but switched universities and switched her courses to history of art because that was William’s. She delayed her own education by a year” and took the chance of not getting into St. Andrews, Lacey wrote.\n\nLacey noted that Kate wasn’t the only incoming student who changed her academic plans for William. After William announced his intention to study at St. Andrews, applications reportedly increased by 44 percent.\n\nUK Press // Getty Images Prince William visits St. Andrews University’s campus.\n\n2002: They move in together and start dating.\n\nTo start their second year at St. Andrews, Kate and William, along with friends Fergus Boyd and Olivia Bleasdale, moved into a four-bedroom, two-story town house off campus. At this point, the two were still just friends—but not for much longer.\n\nDuring their time as roommates, Kate and William’s relationship took a romantic turn. Rumor has it, William became romantically interested in Kate after seeing her walk the runway for a charity fashion show, wearing a see-through minidress over a bra and underwear set. The dress, designed by Charlotte Todd, later sold at auction for $125,000.\n\nRune Hellestad - Corbis // Getty Images\n\nApril 1, 2004: Their relationship becomes public.\n\nAfter about a year of dating, William and Kate’s relationship became public knowledge when The Sun published photos of the two enjoying a ski trip in the Swiss Alps. The breach of privacy led to the then-Prince Charles threatening to sever his media relations with the tabloid.\n\nAt the time, a spokesperson for Charles said he was “very disappointed” by the outlet’s actions and that The Sun would “face the consequences,” according to The Guardian. “They do understand that they have broken the agreement and they are aware they will have to face the consequences. It's not set in stone but that could include being excluded from photo calls.”\n\nJulian Herbert // Getty Images Prince Harry, then-Prince Charles, and Prince William pose during a 2002 photo call at Swiss ski resort.\n\nJune 23, 2005: They graduate from St. Andrews.\n\nThe couple ended their journey in higher education together, joining their class of about 260 students for an intimate graduation ceremony. Also in attendance were William’s grandparents, Queen Elizabeth II and Prince Philip, as well as dad Prince Charles and stepmother Camilla.\n\nAnwar Hussein Collection/ROTA // Getty Images MICHAEL DUNLEA // Getty Images\n\nRelated Story Watch Kate and William's Graduation Video\n\nApril 1, 2007: They break up.\n\nDuring their 2010 engagement interview, William reflected on his and Kate’s brief time apart. “We were both very young, it was at university, and we were both sort of defining ourselves as such and being different characters,” he said. “It was very much trying to find our own way and we were growing up.”\n\nKate added, “I at the time wasn’t very happy about it, but actually it made me a stronger person. You find out things about yourself that maybe you hadn’t realized. I think you can get quite consumed by a relationship when you’re younger, and I really valued that time for me, as well.”\n\nMax Mumby/Indigo // Getty Images\n\nJune 2007: They reconcile.\n\nTheir split was short-lived, with the couple reconciling just a few months later.\n\nRoyal reporter Katie Nicholl in her book Kate: The Future Queen. William, who initiated the breakup, apparently had to convince Kate to get back together with him.\n\n“Kate didn't want to rush anything. She had been badly hurt and told William she needed some time,” Nicholl wrote. When William invited his ex to a costume party, Kate showed up dressed as a “sexy” nurse “in fishnet tights and a short dress.” Subsequently, the prince “followed her around like a lost puppy all night.”\n\nTheir reunion was publicly confirmed when Kate attended the Concert for Diana, organized by William and Prince Harry in honor of the 10th anniversary of Princess Diana’s death, in July 2007.\n\nDavid Davies - PA Images // Getty Images Harry, William, and Kate watch a rugby match together in 2007.\n\nOctober 20, 2010: William proposes.\n\nWilliam got down on one knee during a romantic getaway the two took to Kenya, where they stayed in a cabin hut on a wildlife reserve about 10,500 feet above sea level.\n\n“We had a little private time away together with some friends, and I just decided that it was the right time, really,” William later said, during their joint engagement interview. “We’d been talking about marriage for a while, so it wasn’t a massively big surprise, but I took her up somewhere nice in Kenya, and I proposed.”\n\nKate said the proposal was “very romantic,” a sentiment that William shared. “It just felt really right to ask in Africa,” he added. “And I had done a little bit of planning of sorts to share my romantic side.”\n\nWilliam popped the question with Princess Diana’s iconic engagement ring: a 12-carat oval sapphire surrounded by a white gold halo featuring 14 solitaire diamonds.\n\nWPA Pool // Getty Images\n\nNovember 16, 2010: They publicly announce their engagement.\n\nThe couple formally announced their engagement a month later, when they appeared for a photo call at London’s St. James’s Palace. That same day, they participated in their first televised joint interview to discuss their engagement with ITV’s Tom Bradby.\n\nChris Jackson // Getty Images\n\nFebruary 10, 2011: Kate makes her first royal appearance.\n\nKate completed her first-ever duty as a member-to-be of the royal family by joining William on an engagement in Wales. There, the couple helped launch the new Hereford Endeavour lifeboat, which Kate was photographed breaking a bottle of champagne on for good luck.\n\nChris Jackson // Getty Images\n\nApril 29, 2011: They get married.\n\nKate officially became Catherine, the Duchess of Cambridge, upon her Westminster Abbey wedding to Prince William, who formally received the Duke of Cambridge title a few days prior. The highly anticipated nuptials were watched live by over 72 million people across the globe.\n\nFor the grand occasion, Kate wore a fairy-tale lace bridal gown designed by Alexander McQueen’s then–creative director, Sarah Burton. She topped off the look with the Cartier Halo tiara, which she borrowed from the queen. Meanwhile, William wore a red tunic, his military uniform as a colonel of the Irish Guards.\n\nChris Jackson // Getty Images\n\nJune 2011: They embark on their first royal tour.\n\nFor their first official trip abroad as a married couple representing the royal family, the two traveled to Canada. The nine-day royal tour took them through Ottawa, Montreal, Quebec City, Prince Edward Island, and Calgary.\n\nChris Jackson // Getty Images\n\nDecember 3, 2012: Kate announces she’s pregnant with their first child.\n\nSt. James’s Palace announced the couple’s first pregnancy after Kate was admitted to King Edward VII’s Hospital for hyperemesis gravidarum, or severe morning sickness associated with the symptoms of pregnancy.\n\n“Their Royal Highnesses the Duke and Duchess of Cambridge are very pleased to announce that the Duchess of Cambridge is expecting a baby,” the palace said in a statement, per ABC News. “The Queen, the Duke of Edinburgh, the Prince of Wales, the Duchess of Cornwall, and Prince Harry and members of both families are delighted with the news.”\n\nJuly 22, 2013: Prince George is born.\n\nKate gave birth to Prince George Alexander Louis of Cambridge—who is next in line for the British throne after his father—at 4:24 p.m. on July 22, 2013 in the Lindo Wing at St. Mary’s Hospital in West London. As per royal tradition, Kate and William posed for photos outside the hospital with their newborn soon after the birth.\n\nMike Marsland // Getty Images\n\nSeptember 8, 2014: Kate is pregnant with their second child.\n\nKensington Palace announced Kate’s second pregnancy with a statement: “Their Royal Highnesses the Duke and Duchess of Cambridge are very pleased to announce that the Duchess of Cambridge is expecting their second child. The Queen and members of both families are delighted with the news.”\n\nMay 2, 2015: Princess Charlotte is born.\n\nKate gave birth to her second child, Princess Charlotte Elizabeth Diana of Cambridge, in the Lindo Wing at St. Mary’s as well. Charlotte entered the world at 8:34 a.m., and the couple returned to their home at Kensington Palace that same evening.\n\nSamir Hussein // Getty Images\n\nFebruary 12, 2017: They make their red carpet debut at the BAFTAs.\n\nFor her first-ever red carpet appearance with William, Kate tapped the same designer who created her 2011 wedding dress. The then-duchess wore a black floral off-the-shoulder Alexander McQueen gown to the 2017 British Academy Film Awards. Meanwhile, William looked dapper in a classic black tux with a white dress shirt.\n\nSamir Hussein // Getty Images\n\nSeptember 4, 2017: Kate is pregnant with their third child.\n\nKensington Palace announced the couple had another royal baby on the way with a formal statement, which read: “Their Royal Highnesses the Duke and Duchess of Cambridge are very pleased to announce that the Duchess of Cambridge is expecting their third child. The Queen and members of both families are delighted with the news.”\n\nRelated Story Kate Middleton’s Maternity Leave Appearances\n\nApril 23, 2018: Prince Louis is born.\n\nKate had a smooth delivery giving birth to her third child, Prince Louis Arthur Charles of Cambridge. At the time, Bazaar reported that Kate’s “relaxed” birth involved a luxe $10,000-a-night suite with “triple-glazed” windows that helped create a calm and peaceful environment for the duchess as she underwent labor.\n\nWith Louis’s birth, big sister Charlotte also became the first female member of the British royal family to retain her spot in the line of succession following the Succession to the Crown Act of 2013. Prior to the act, male relatives outranked their female relatives in the line of succession.\n\nKarwai Tang // Getty Images\n\nApril 2020: They give a rare joint interview during the COVID-19 pandemic.\n\n\n\nThe couple virtually spoke with the BBC about mental health at the height of the lockdowns enforced after the outbreak of COVID-19 in early 2020.\n\n“If we are going to go forward with more time spent in lockdown, then there is going to be an ever-increasing need for people to look after their mental health and take it seriously, and also know where to go to get the support they might need,” William said.\n\nKate stressed the importance of community during the pandemic. “While that’s hugely important, we mustn’t forget our mental well-being as well, and making sure you’re reaching out to those people around you that you have access to—even if it’s over the phone or online, to really make sure you have those conversations,” she added.\n\nThey also provided some insight into their life in lockdown with their three kids. The couple had taken up homeschooling their children. “We don’t tell the children we’ve actually kept going through the holidays. I feel very mean,” Kate said.\n\nOf keeping in touch with family through phone or video calls, the then-duchess added, “It gets a bit hectic, I’m not going to lie, with a two-year-old you have to take the phone away. It’s quite hectic for them all to say the right thing at the right time without pressing the wrong buttons. But it’s great and it’s nice to keep in touch with everybody.”\n\nComic Relief // Getty Images\n\nApril 29, 2021: They celebrate their 10-year wedding anniversary.\n\nTo celebrate their major milestone, the couple released two sweet portraits of themselves affectionately posing together on the grounds of their home at Kensington Palace, shot by celebrity portrait photographer Chris Floyd.\n\nChris Floyd\n\nOctober 20, 2021: They attend the first Earthshot Prize Awards.\n\nKate and William made a glamorous joint appearance for the inaugural Earthshot Prize Awards ceremony, held at London’s Alexandra Palace.\n\nFor the occasion, Kate wore a lilac Alexander McQueen gown she had previously worn to a 2011 BAFTAs black-tie event. Meanwhile, William changed up his classic style with a dark green velvet blazer, a black turtleneck, and black slacks.\n\nSamir Hussein // Getty Images\n\nThe Earthshot Prize Awards is a passion project for William, who has followed in his father’s footsteps and made environmentalism one of his signature causes.\n\n“For too long, we haven’t done enough to protect the planet for your future,” William said in a speech at the ceremony. “The Earthshot is for you. In the next 10 years, we are going to act. We are going to find solutions to repair our planet. Please keep learning, keep demanding change, and don’t give up hope. We will rise to these challenges.”\n\nDecember 2021: William supports Kate’s first-ever Christmas carol service at Westminster Abbey.\n\nKate’s growing prominence within the royal family became more apparent when she announced she would be organizing and hosting a holiday carol service at Westminster Abbey to honor “the incredible work of individuals and organizations across the nation who have stepped up to support their communities through the pandemic.”\n\nWilliam attended the event, even coordinating his red tie to match the then-duchess’s bright red Catherine Walker coatdress.\n\nWPA Pool // Getty Images\n\nJune 30, 2022: They release their first official painted portrait.\n\nBritish artist Jamie Coreth painted the portrait, taking inspiration from an appearance the couple made during a 2020 visit to Dublin.\n\nIn the painting, Kate wears a metallic, deep-green midi dress from the Vampire’s Wife, paired with green satin Manolo Blahnik pumps and a pair of pearl drop earrings that once belonged to Princess Diana. Meanwhile, Prince William wears a black suit with a white button-up shirt and a blue tie.\n\nPAUL EDWARDS // Getty Images Artist Jamie Coreth poses with his painting of the Duke and Duchess of Cambridge.\n\nSeptember 9, 2022: They receive new titles upon Queen Elizabeth's death.\n\nUpon Queen Elizabeth’s death on September 8, King Charles III announced that his eldest son and his daughter-in-law had officially inherited the titles of Prince and Princess of Wales, which formerly belonged to Charles and the late Princess Diana.\n\nAt the time, a royal source told Bazaar the couple intended “on deepening the trust and respect of the people of Wales over time” and would “approach their roles in the modest and humble way they’ve approached their work previously.”\n\nSeptember 15, 2022: They make their first appearance after becoming the Prince and Princess of Wales.\n\nFor their first public appearance since becoming Prince and Princess of Wales, William and Kate observed floral tributes laid in honor of the late queen at Sandringham. They also greeted crowds of well-wishers.\n\nAs per royal mourning tradition, Kate wore an all-black outfit consisting of a black midi dress, a long black coat, and black pumps, while William wore a navy blue suit.\n\nKarwai Tang // Getty Images\n\nApril 29, 2023: A new photo is released in honor of their 12th anniversary.\n\nTo mark 12 years of marriage, the couple released a sweet new photo captured by photographer Matt Porteous. The snap shows the two embracing during a bike ride in Norfolk. Kate wears a white eyelet blouse tucked into a pair of dark blue jeans, and accessorizes with black sunglasses and a brown crossbody bag. William similarly looks casual in a dark blue button-up, jeans, and black shades.\n\nMatt Porteous/Kensington Palace\n\nMay 6, 2023: They attend the coronation of King Charles III.\n\nThe Wales family presented a united front at the coronation of King Charles III, held at Westminster Abbey. The historic ceremony, which also crowned Charles’s wife, Camilla, as queen consort, was the first to take place in 70 years.\n\nAt the request of the king and queen, William and Kate arrived at the event wearing formal robes and mantels. Underneath her robe, Kate wore an Alexander McQueen dress in ivory silk crepe with silver bullion and embroidery featuring rose, thistle, daffodil, and shamrock motifs. Though she didn’t wear a tiara, she styled her hair in an updo adorned with a Jess Collett x Alexander McQueen headpiece with silver bullion, crystal, and a silver threaded three-dimensional leaf embroidery.\n\nThe couple’s three children also attended the coronation.\n\nWPA Pool // Getty Images\n\nJanuary 17, 2024: Kensington Palace announces Kate's abdominal surgery.\n\nThe palace released a statement revealing that Princess Kate had been admitted into the London Clinic for a “planned abdominal surgery.” Kate's recovery is expected to last for at least three months, with the royal not expected to return to public duties until after Easter, which falls on March 31.\n\n“The Princess of Wales appreciates the interest this statement will generate. She hopes that the public will understand her desire to maintain as much normality for her children as possible; and her wish that her personal medical information remains private,” the statement continued. “Kensington Palace will, therefore, only provide updates on Her Royal Highness’s progress when there is significant new information to share.”\n\nJanuary 18, 2024: Prince William visits Kate in the hospital.\n\nThe Prince of Wales was photographed driving to the London Clinic, where Kate was recuperating after her abdominal operation.\n\nMax Mumby/Indigo // Getty Images\n\nFebruary 7, 2024: William speaks on Kate's health.\n\nAt a dinner for the London Air Ambulance Charity Gala, William made a speech that references the recent bout of alarming health news affecting his wife Kate and father King Charles III, who had recently been diagnosed with cancer.\n\n“I’d like to take this opportunity to say thank you, also, for the kind messages of support for Catherine and for my father, especially in recent days. It means a great deal to us all,” he said before jokingly adding, “It’s fair to say the past few weeks have had a rather ‘medical’ focus. So I thought I’d come to an air ambulance function to get away from it all!”\n\nMarch 10, 2024: Kensington Palace release first photo of Kate since her surgery; major wire agencies retract the photo hours after its release, prompting worldwide controversy.\n\nThe palace shared the first official portrait of the Princess of Wales since her surgery was announced in January. Purportedly taken by William the previous week at their Windsor home, the photo features Kate sitting with Prince George, Princess Charlotte, and Prince Louis to mark the U.K.’s Mother's Day.\n\nHours after its release, the Associated Press, Agence France-Press, Getty Images, and Reuters issued a kill notification for the photo, citing evidence of image manipulation. The glaring Photoshop errors, as well as the fact that Kate is notably not wearing her engagement ring in the picture, fueled worldwide concerns over the royal’s health and speculation over the state of the Waleses’ marriage.\n\nMarch 11, 2024: Kate apologizes for the doctored photo.\n\nKensington Palace issued a rare personal statement attributed to Kate, in which she admits to editing the photo.\n\n“Like many amateur photographers, I do occasionally experiment with editing,” the message read. “I wanted to express my apologies for any confusion the family photograph we shared yesterday caused. I hope everyone celebrating had a very happy Mother’s Day.”\n\nA source from Kensington Palace told Bazaar, “This was an amateur, family photograph taken by the Prince of Wales. [William and Kate] wanted to offer an informal picture of the family together for Mother’s Day.” The insider said that Kate “made minor adjustments” to the picture, and that the family as a whole had spent the holiday “together and had a wonderful day.”\n\nMarch 13, 2024: The couple are pictured together for the first time since Kate’s surgery.\n\nPaparazzi captured a photo of William and Kate riding in a car outside of Windsor—the first shot of the two together since Kate’s surgery was announced in January. The photo shows William in profile, while Kate sits with her head turned and facing out the window.", "images": ["https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/catherine-duchess-of-cambridge-and-prince-william-duke-of-news-photo-1698868932.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/x-regular.e414d97.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/1103-cfda-00-690945e97fabc.jpg?crop=0.563xw:1.00xh;0.0192xw,0&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/caret-left-regular.5546078.svg", "https://hips.hearstapps.com/hmg-prod/images/prince-charles-and-his-sons-william-and-harry-appear-at-a-news-photo-1698857431.jpg?crop=0.730xw:1.00xh;0.155xw,0&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/prince-william-and-catherine-princess-of-wales-arrives-for-news-photo-1698873839.jpg?crop=0.665xw:1.00xh;0.0289xw,0&resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/harpersbazaar/static/images/logos/logo.823d7af.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/hbz-kate-middleton-prince-william-graduation-1540309940.jpg?crop=1.00xw:1.00xh;0,0&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/344126699-2092958464241513-1913855792094295419-n-644ea4b5f1ab0.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/kate-middleton-girlfriend-of-prince-william-during-their-news-photo-1698857536.jpg?crop=1.00xw:1.00xh;0,0&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/kate-middleton-and-prince-william-attend-day-1-of-the-news-photo-1698859761.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523ffffff&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/if-this-a-dream-i-don-t-want-to-wake-up-690a558e38e8e.jpg?crop=0.848xw:0.705xh;0,0.295xh&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/harpersbazaar/static/images/logos/network-logo.6416a85.svg?primary=%2523ffffff", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/vma-holding-10-68be1813cefda.jpg?crop=0.558xw:0.991xh;0.221xw,0.00855xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/1102-lacma-00-1-690773ba36027.jpg?crop=0.564xw:1.00xh;0.0657xw,0&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/envelope-simple-regular.91a0134.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-165651733-1590515761.jpg?crop=1xw:0.8152830188679245xh;center,top&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/st-andrews-united-kingdom-prince-william-after-his-news-photo-1698857656.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/in-this-screengrab-prince-william-duke-of-cambridge-news-photo-1698871211.jpg?crop=0.801xw:1.00xh;0.0765xw,0&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/prince-william-prince-of-wales-seen-leaving-the-london-news-photo-1710528891.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/prince-william-duke-of-cambridge-and-catherine-duchess-of-news-photo-1698871740.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/index-1524756216.jpg?crop=0.984xw:0.984xh;0,0&resize=300:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg?primary=%2523ffffff", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2247250671-691c890525b19.jpg?crop=1.00xw:0.792xh;0,0.0177xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1403531009-653fcb2ead925.jpg?crop=1.00xw:0.427xh;0,0.108xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/kendall-jenner-attends-the-2025-academy-museum-gala-at-news-photo-1762372545.pjpeg?crop=0.668xw:1.00xh;0.188xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1403531009-653fcb2ead925.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg", "https://hips.hearstapps.com/hmg-prod/images/kate-middleton-and-prince-william-launch-the-new-hereford-news-photo-1698861425.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/catherine-duchess-of-cambridge-smiles-during-a-dinner-at-news-photo-913119222-1537719474.jpg?crop=1.00xw:0.754xh;0,0&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/1031-celebhalloween-00-6904cd7c7381f.jpg?crop=0.563xw:1.00xh;0.0753xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/0070-69163dbcb4c7a.jpg?crop=0.554xw:0.445xh;0.405xw,0.186xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/ariana-grande-attends-the-31st-annual-screen-actors-guild-news-photo-1761842282.pjpeg?crop=0.668xw:1.00xh;0.197xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/prince-william-prince-of-wales-and-catherine-princess-of-news-photo-1698872851.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/bookmark-simple-regular.9d9d56b.svg", "https://hips.hearstapps.com/hmg-prod/images/lily-allen-attends-the-hunger-games-on-stage-the-global-news-photo-1763048341.pjpeg?crop=1.00xw:0.701xh;0,0.0269xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/camera-press-04148445-1619644468.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/globe-simple-regular.e7f303c.svg", "https://hips.hearstapps.com/hmg-prod/images/pre-auction-photo-call-with-the-charlotte-todd-designed-news-photo-1698857044.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/prince-william-duke-of-cambridge-and-catherine-duchess-of-news-photo-1698869661.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/kate-wills-wedding-night-1532891617.jpg?crop=1xw:1xh;center,top&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/prince-william-duke-of-cambridge-catherine-duchess-of-news-photo-1698869280.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/catherine-duchess-of-cambridge-and-prince-william-duke-of-news-photo-1698869914.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/catherine-duchess-of-cambridge-and-prince-william-duke-of-news-photo-1698870780.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/close-up-of-kate-middletons-engagement-ring-as-she-poses-news-photo-1698861021.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2243569937-690365688d945.jpg?crop=1.00xw:0.731xh;0,0.0257xh&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/saved.ad81f1a.svg?primary=%2523000000", "https://hips.hearstapps.com/hmg-prod/images/previously-unissued-photo-dated-08-12-21-prince-william-news-photo-1698872311.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2241371298-6917880764f3e.jpg?crop=0.748xw:1.00xh;0.252xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/prince-william-duke-of-cambridge-and-catherine-duchess-of-news-photo-1698866337.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/prince-harry-prince-william-and-williams-girlfriend-kate-news-photo-1698860506.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1403531009-653fcb2ead925.jpg?crop=1xw:0.4785xh;0,0.108xh", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/clock-regular.b2f2888.svg", "https://hips.hearstapps.com/hmg-prod/images/prince-william-and-kate-middleton-pose-for-photographs-in-news-photo-1698861101.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/british-artist-jamie-coreth-poses-with-his-painting-of-news-photo-1698872515.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/prince-william-arrives-for-his-first-day-of-school-at-st-news-photo-1698855892.jpg?resize=980:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1403531009-653fcb2ead925.jpg?crop=1.00xw:0.427xh;0,0.108xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.harpersbazaar.com/celebrity/latest/a45658025/prince-william-kate-middleton-relationship-timeline/", "title": "Prince William and Princess Kate’s Complete Relationship Timeline", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Prince William and Kate Middleton's Complete Relationship Timeline", "description": "Their royal love story spans decades.", "theme-color": "#000000", "og": {"site_name": "Harper's BAZAAR", "title": "Prince William and Princess Kate’s Complete Relationship Timeline", "description": "Revisit their royal love story", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1403531009-653fcb2ead925.jpg?crop=1.00xw:0.427xh;0,0.108xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.harpersbazaar.com/celebrity/latest/a45658025/prince-william-kate-middleton-relationship-timeline/", "type": "article"}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "opinion": "false", "section": "Celebrity News", "modified_time": "2024-03-15T19:32:00Z", "published_time": "2024-03-15T19:32:00Z"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "parsely-metadata": "{\"socialHeadline\":\"Prince William and Princess Kate’s Complete Relationship Timeline\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1403531009-653fcb2ead925.jpg?crop=1.00xw:0.853xh;0,0.0641xh&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1403531009-653fcb2ead925.jpg?crop=1.00xw:0.427xh;0,0.108xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1403531009-653fcb2ead925.jpg?crop=1.00xw:0.853xh;0,0.0641xh", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1403531009-653fcb2ead925.jpg?crop=1.00xw:0.427xh;0,0.108xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "timely", "sailthru.excerpt": "Prince William and Princess Kate have fascinated the world since they first went public with their relationship nearly two decades ago. Now, the couple have come to be emblematic of the British royal family, representing the kind of stability that Queen Elizabeth II once provided while also acclimating to today’s", "sailthru.tags": "celebrity,Celebrity,latest,Celebrity News,royal-news,Latest Royal News,Harper's BAZAAR-US", "sailthru.date": "2024-03-15 19:32:00", "sailthru.socialtitle": "Prince William and Princess Kate’s Complete Relationship Timeline", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1710531120.0, "source": "https://www.harpersbazaar.com", "summary": ""}