{"url": "www.mirror.co.uk/3am/celebrity-news/meghan-markles-nephew-reveals-heartache-11386023", "text": "EXCLUSIVE: Meghan Markle's nephew reveals heartache at the family rift that tore them apart\n\nThomas Dooley and Prince Harry’s girlfriend were once close and she used to love babysitting him as a little boy, but a family feud between the Suits star's father and her half-brother has meant they haven't seen one another in years\n\nView 5 Images Meghan Markle's family was torn apart by a feud between her father and half-brother (Image: FilmMagic)\n\nMeghan Markle ’s nephew today tells of his anger and shame at a bitter family rift that has erupted over the aunt he adores.\n\n‌\n\n\n\nThomas Dooley reveals he and Prince Harry ’s girlfriend were so close she used to love babysitting him as a little boy.\n\n‌\n\n\n\nBut treasured pictures are now all he has left of her after a feud between his father Thomas Jnr and grandfather Thomas Snr tore them apart.\n\n‌\n\n\n\nNow the Domino’s Pizza manager says he wants to apologise to Meghan for the way his dad – her half-brother – has dragged her name through the dirt.\n\nThomas Jnr hit the headlines in January after being arrested and charged over holding a gun to his girlfriend’s head in a row. Thomas reveals he is ashamed of cheap remarks his dad has since made about Suits star Meghan, 36, calling her a “hot commodity” and saying Harry “better get on it”.\n\nView 5 Images Meghan's nephew Thomas Dooleyhas apologised for his family's behaviour (Image: Coleman-Rayner)\n\n‌\n\n\n\nHe is also dismayed by reports that his aunt Samantha, 51, Meghan’s half-sister, is set to reveal a tell all book on the Suits actress. Called The Diary of Princess Pushy’s Sister, it is reportedly set to suggest the Suits actress is only with Prince Harry, 33, for fame.\n\n‌\n\n\n\nIn an exclusive interview, Thomas, 26, says: “My dad and aunt are crazy. I feel terrible for Meghan.\n\n“Me and my brother Tyler have nothing to do with our dad. His behaviour since Meghan began dating Prince Harry has been completely appalling.\n\n‌\n\n\n\n“I want people to know I have nothing to do with it and just apologise to her.\n\n“It’s just a shame her own family are making up stories about her.”\n\n‌\n\n\n\nThomas, who lives in a small mountain town in ­California, says he longs to see Meghan again.\n\n“She is a lovely, warm and caring person and she seems super happy with Prince Harry. I believe it was fate they fell for each other and I wish them both the best,” he says.\n\nHe said he and brother Tyler, 24, “have always been supportive of her and always cherished what she was doing with her life.\n\n‌\n\n\n\n“She worked really hard to get where she is and she has always presented herself very well, so it’s well deserved.\n\n“I would like to see my aunt again – hopefully even before she got married . But if that’s the chance I get to see her, I would love it.”\n\nView 5 Images Meghan's nephew says he is ashamed of dad Thomas Jnr, pictured (Image: Coleman-Rayner)\n\n‌\n\n\n\nThe Royals fan says he was “up the entire night watching Prince William marry Catherine on TV. It was very nice and I was glued to it”.\n\nThomas reckons Meghan would be proud of what has happened to the little boy she so loved looking after. Now married to Ronnie, 41, he says: “My earliest memory of her was when we were at Grandpa’s house and she was playing with us.\n\n“Meghan probably knew I was gay even as a kid. We used to play with Barbie dolls together.\n\n‌\n\n\n\n“I think almost everybody who knew me had an inkling. I told my mom when I was 13, but she already knew.”\n\nHe says his 50-year-old dad, who left his mum and now lives in Oregon, struggled to accept his sexuality.\n\nAnd he tells how Thomas Jnr’s bust-up with Meghan’s dad Thomas Snr, 72, more than 10 years ago led to their side of the family being cut off from her.\n\n‌\n\n\n\nView 5 Images Meghan as a baby with half-brother Tom (Image: Coleman-Rayner)\n\n“My grandpa lives in Mexico and he and Dad do not speak whatsoever,” Thomas said. “They have not had a relationship for over a decade.\n\n“Grandpa wants nothing to do with my dad. Tyler and I have no issues with our grandpa. We speak on the phone every now and then.\n\n‌\n\n\n\n“It’s not that we made the decision to stop seeing Meghan and grandpa, because we always really liked our family.\n\n“But tensions were really high between Grandpa and Dad, and eventually our lives took different paths and we fell out of touch.”\n\n‌\n\n\n\nMeghan met the Queen for the first time 10 days ago when she and Harry had afternoon tea with her at Buckingham Palace .\n\n‌\n\n\n\nThe landmark event – 18 months into the pair’s relationship – has led to increased speculation that the Prince, who needs his grandmother’s consent to marry, is now preparing to pop the question.\n\nView 5 Images Meghan has met the Queen and may soon be a royal herself (Image: Getty Images North America)\n\nThomas read about the Royal meeting with amazement.\n\n‌\n\n\n\n“It shows the Queen is being accepting of who Meghan is and what she’s done with her life and I think that’s amazing,” he says.\n\n“It shows she’s been accepted as a good companion for Prince Harry. It’s a huge step. But I know she would have stayed calm and collected.\n\n“She would have had a nice little chat. I’m thinking it would have gone really well.”\n\nArticle continues below\n\nThomas hopes Meghan may one day “strap on some skis” and visit him at the Domino’s branch he and his husband run in Mammoth Lakes, California.\n\nAsked if he expects a wedding invite, he says: “You never know but it would totally be her choice.\n\nLaughing, he adds: “But if she did need to invite anyone out of our family, we would be the safest.”", "images": ["https://i2-prod.mirror.co.uk/article12965190.ece/ALTERNATES/s810/1_Samantha-Markle-on-GMB.jpg", "http://www.mirror.co.uk/footer/trust-project.svg", "https://i2-prod.mirror.co.uk/article11386087.ece/ALTERNATES/s615/1_PROD-ELLEs-6th-Annual-Women-In-Television-Dinner-Arrivals.jpg", "https://i2-prod.mirror.co.uk/article13028647.ece/ALTERNATES/s810/3_Preparations-for-Royal-Wedding-of-Harry-and-Meghan.jpg", "https://i2-prod.mirror.co.uk/article12570753.ece/ALTERNATES/s810/MAIN-THP_CHP_210518SLUG_2082JPG.jpg", "https://i2-prod.mirror.co.uk/article16168652.ece/ALTERNATES/s810/0_Anniversary-main2.jpg", "https://i2-prod.mirror.co.uk/article12287571.ece/ALTERNATES/s810/PROD-Meghan-Markle-and-Trevor-Engelson-attend-COACH-Legacy-Photo-Exhibit.jpg", "https://i2-prod.mirror.co.uk/article11602866.ece/ALTERNATES/s810/BLP_MDG_infocentre_1201JPG.jpg", "https://i2-prod.mirror.co.uk/article9160081.ece/ALTERNATES/s810/Suits-Season-4.jpg", "https://i2-prod.mirror.co.uk/article11386107.ece/ALTERNATES/s1200/PROD-BESTPIX-Invictus-Games-Toronto-2017-Day-31.jpg", "https://i2-prod.mirror.co.uk/article12562854.ece/ALTERNATES/s810/Meghan-Marklerf.jpg", "http://www.mirror.co.uk/nav-web-static/release-v41-14493b7c888038a7d89b99cb3a7937c2b71eaebe/public/logo-reach.png", "https://i2-prod.mirror.co.uk/article11380259.ece/ALTERNATES/s615b/EMB-PAY-PROD-Meghan-Markles-nephew-Thomas-Dooley-26-poses-with-his-husband-Ronnie-Tanner-41-outside-their-Do.jpg", "https://i2-prod.mirror.co.uk/article11386107.ece/ALTERNATES/s615b/PROD-BESTPIX-Invictus-Games-Toronto-2017-Day-31.jpg", "https://i2-prod.mirror.co.uk/article11380267.ece/ALTERNATES/s615b/0_EMB-PAY-PROD-Prince-Harrys-alleged-new-girlfriend-Megan-Markles-brother-Thomas-Markle-II-and-his-son-Tyler-Mark.jpg", "http://www.mirror.co.uk/footer/ipso.svg", "https://i2-prod.mirror.co.uk/article11380258.ece/ALTERNATES/s615b/EMB-PAY-PROD-Never-before-seen-pics-show-Meghan-Markles-family-with-red-hair-just-like-her-boyfriend-Prince-H.jpg", "http://www.mirror.co.uk/assets/mirror/logos/masthead-mirror-default.svg"], "top_img": "https://i2-prod.mirror.co.uk/article11386107.ece/ALTERNATES/s1200/PROD-BESTPIX-Invictus-Games-Toronto-2017-Day-31.jpg", "keywords": [], "authors": ["Karleigh Smith", "Patrick Hill", "Updated"], "canonical_link": "https://www.mirror.co.uk/3am/celebrity-news/meghan-markles-nephew-reveals-heartache-11386023", "title": "Meghan Markle's nephew reveals heartache at the family rift that tore them apart", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"page_id": 6149699161, "app_id": 123792601022133, "pages": 1814357575554395}, "description": "Thomas Dooley and Prince Harry’s girlfriend were once close and she used to love babysitting him as a little boy, but a family feud between the Suits star's father and her half-brother has meant they haven't seen one another in years", "author": "Patrick Hill", "robots": "noarchive, max-image-preview:large", "Googlebot-News": "noarchive", "referrer": "unsafe-URL", "keywords": "Meghan Markle, Prince Harry", "news_keywords": "Meghan Markle, Prince Harry", "allowTaboolaDeepDive": "true", "vf": {"00000000-0000-4000-8000-67e599051dc3": "mirror-prod-11386023"}, "og": {"title": "Meghan Markle's nephew reveals heartache at the family rift that tore them apart", "description": "Thomas Dooley and Prince Harry’s girlfriend were once close and she used to love babysitting him as a little boy, but a family feud between the Suits star's father and her half-brother has meant they haven't seen one another in years", "url": "http://www.mirror.co.uk/3am/celebrity-news/meghan-markles-nephew-reveals-heartache-11386023", "site_name": "Daily Mirror", "locale": "en_GB", "image": "https://i2-prod.mirror.co.uk/article11386107.ece/ALTERNATES/s1200/PROD-BESTPIX-Invictus-Games-Toronto-2017-Day-31.jpg", "type": "article"}, "article": {"published_time": "2017-10-21T21:34:50Z", "modified_time": "2017-11-29T09:47:47Z", "author": "https://www.mirror.co.uk/authors/patrick-hill/", "section": "Celebrity News", "tag": "Prince Harry"}, "twitter": {"card": "summary_large_image", "site": "@DailyMirror", "creator": "@patrick_hill_", "title": "Meghan Markle's nephew reveals heartache at the family rift that tore them apart - The Mirror", "description": "Thomas Dooley and Prince Harry’s girlfriend were once close and she used to love babysitting him as a little boy, but a family feud between the Suits star's father and her half-brother has meant they haven't seen one another in years", "image": "https://i2-prod.mirror.co.uk/article11386107.ece/ALTERNATES/s1200/PROD-BESTPIX-Invictus-Games-Toronto-2017-Day-31.jpg"}}, "movies": [], "publish_date": 1508621690.0, "source": "http://www.mirror.co.uk", "summary": ""}