{"url": "https://www.brides.com/story/meghan-markle-gets-official-royal-aide-ahead-of-may-wedding", "text": "Who would have thought all Prince Harry needed to tie him down was an actress from America? Since news broke that the British royal and Meghan Markle were an item, we've been obsessed with them. From their first blind date to the Royal Wedding and of course, their Royal baby, here's a complete history of Meghan Markle and Prince Harry's relationship.\n\nMeghan Markle and Prince Harry first met on a blind date in 2016 and kept their relationship very private for a few months until the press got word of the news. Prince Harry proposed in November 2017 with a one-a-kind three-stone engagement ring that included diamonds from Princess Diana's collection.\n\nTheir 2018 royal wedding brought loads of A-listers across the pond for the nuptials, and marked their new title as husband and wife: The Duke and Duchess of Sussex.\n\nNearly a year after their wedding, the couple welcomed a son, Archie Harrison Mountbatten-Windsor.\n\nAt the beginning of 2020, they announced they will be stepping down as senior members of the Royal Family and will be splitting their time between the United Kingdom and North America.\n\nMeghan Markle and Prince Harry welcomed their second child, a daughter, Lilibet Diana Mountbatten-Windsor, on June 4, 2021.\n\nMay 2016: A Blind Date\n\nNot much is known about Prince Harry and Meghan's first date, but one thing is for certain. The pair were set up on a blind date by a mutual friend and fashion designer, Misha Nonoo. Matchmaker, matchmaker, make us a royal match next time, OK?\n\nOctober 31, 2016: The Secret's Out\n\nThe day it all began—at least for the public. The Sunday Express reported that Prince Harry had been secretly dating the Suits star, and according to one source the royal was \"happier than he’s been for many years.\" That very day, Meghan posted an adorable banana couple hugging on her Instagram page, followed by a high-tea snap on November 1.\n\nNovember 1, 2016: A Cryptic Quote\n\nCanada's Vancouver Sun published a Q&A in which Meghan discussed her collection for retailer Reitmans. Her closing quote, while cryptic, sure said a lot. \"So, my cup runneth over and I’m the luckiest girl in the world!\" she shared.\n\nNovember 2, 2016: Transatlantic Travels\n\nIt didn't take long for reports of the new couple to begin swirling. Us Weekly wrote that Prince Harry made a top-secret visit to Toronto in October, where Markle was filming her show, and claimed it was \"one of many transatlantic travels in their relationship.\"\n\nNOTTINGHAM, ENGLAND - OCTOBER 26: Prince Harry waves as he leaves Nottingham's new Central Police Station on October 26, 2016 in Nottingham, England. (Photo by Joe Giddins - WPA Pool/Getty Images). Getty Images\n\nNovember 8, 2016: Royally Official\n\nAfter days of ongoing reports of the new couple, Prince Harry released a rare statement that acknowledged the relationship. The 32-year-old asked that the media respect the privacy of his American girlfriend and her loved ones, noting he was \"worried about Ms. Markle’s safety and is deeply disappointed that he has not been able to protect her.\"\n\nNovember 27, 2016: Brotherly Support\n\nAfter reports surfaced claiming Prince Harry did not have older brother Prince William's blessing to go public with his relationship, the Duke of Cambridge released a statement through Kensington Palace to set the record straight. According to The Telegraph, it read, \"The Duke of Cambridge absolutely understands the situation concerning privacy and supports the need for Prince Harry to support those closest to him.\"\n\nDecember 14, 2016: Getting Into The Christmas Spirit\n\nThe Sun published the first photos of the couple together in London. Dressed inconspicuously, the bundled-up twosome were snapped in London's West End. The prince and his girlfriend were spotted picking out a Christmas tree in London's Battersea Park the day before. Relationship milestones!\n\nJanuary 6, 2017: Ringing In The New Year\n\nAfter ringing in the new year together in London, Us Weekly reported the couple took their first vacation together to Norway to catch the Northern Lights. The two reportedly stayed in Tromsø for the romantic getaway.\n\nFebruary 2, 2017: A Valentine's Day Date\n\nJust days before Valentine's Day, Meghan and Harry were photographed by The Sun holding hands outside of London's Soho House, where they reportedly first met in the summer of 2016 through a mutual friend.\n\nMarch 4, 2017: She's His Plus One\n\nMeghan joined Harry at his childhood friend Tom Inskip's wedding in Montego Bay, Jamaica. E! published photos of the couple enjoying a conversation at their table, and People reported that it was Meghan's first time accompanying Harry to a wedding.\n\nASCOT, UNITED KINGDOM - MAY 06: (EMBARGOED FOR PUBLICATION IN UK NEWSPAPERS UNTIL 48 HOURS AFTER CREATE DATE AND TIME) Prince Harry takes part in Audi Polo Challenge at Coworth Park Polo Club on May 6, 2017 in Ascot, England. (Photo by Max Mumby/Indigo/Getty Images). Getty Images\n\nMay 6-7, 2017: The Post-Match Peck\n\nThe prince and the actress not only attended their first public event as a couple, but the two were also photographed kissing for the first time—all in one weekend. Meghan was spotted cheering on her beau at the annual Audi Polo Challenge in Ascot, England. On day two of the event, the couple was candidly photographed sneaking in a kiss post-match.\n\nMay 20, 2017: Plus One at Pippa's\n\nAfter much speculation, Harry indeed brings Meghan as his date to Pippa's wedding. Meghan was not in attendance at the ceremony per royal protocol, but Harry made the three-hour round trip to Kensington Palace, where his date was staying, picking her up for the wedding reception. Can we give him the best boyfriend award already?\n\nJune 19, 2017: He (Sort Of) Puts A Ring On It\n\nWhile we waited for the ring, Daily Mail reported that Harry gifted Meghan with a gold thumb ring. The jewelry gift joined a collection of a blue and white bracelet (which matched his own), a Cartier Love bracelet, a Maya Brenner necklace with \"M\" and \"H\" initials, and a gold arrow ring.\n\nAugust 4, 2017: Birthday in Botswana and a Proposal Promise\n\nThe pair celebrated Meghan's 36th birthday with trip to Botswana where they stayed with a few of Harry's closest friends. The three-week holiday also prompted plenty of speculation around whether or not the actress would return home with a ring. However, according to the revealing book Finding Freedom: Harry and Meghan and the Making of a Modern Royal Family (which was released in 2020), the prince made his intention of proposing to the actress \"very clear.\" The romantic conversation took place under \"Botswana's blanket of stars\"—the same place they supposedly fell in love a year earlier.\n\nSeptember 5, 2017: She's Wild About Harry!\n\nMeghan graced the cover of Vanity Fair's October 2017 issue with a headline that read \"She's Just Wild About Harry.\" During the candid interview, she opened up about her relationship with the royal and said, \"This is for us. It’s part of what makes it so special, that it’s just ours. But we’re happy. Personally, I love a great love story.\"\n\nSeptember 13, 2017: Meeting The Queen\n\nShortly after their African holiday, Prince Harry orchestrated a secret introduction between his girlfriend and his grandmother—AKA the Queen! The couple jetted off to Scotland to visit Prince Charles and Harry’s stepmother, Camilla, Duchess of Cornwall. The following day, the couple headed to Balmoral Castle, the queen’s summer residence.\n\nTORONTO, ON - SEPTEMBER 25: Meghan Markle and Prince Harry appear together at the wheelchair tennis on day 3 of the Invictus Games Toronto 2017 on September 25, 2017 in Toronto, Canada. The Games use the power of sport to inspire recovery, support rehabilitation and generate a wider understanding and respect for the Armed Forces. (Photo by Samir Hussein/WireImage). Getty\n\nSeptember 25, 2017: PDA in Toronto\n\nAfter so much time avoiding the spotlight, the pair made a public joint appearance at the 2017 Invictus Games in Toronto and even showed a little PDA as the two sat front row to watch a wheelchair tennis match.\n\nNovember 13, 2017: Saying Goodbye to Suits\n\nAfter playing Rachel Zane on the hit series Suits since 2011, Meghan reportedly quit the show. Of course, the news led to even more speculation of an impending move across the pond followed by an engagement.\n\nNovember 21, 2017: Royal Roommates\n\nEngagement rumors reached a fever pitch as People reported that, \"Markle will live with Harry at his two-bedroom Nottingham Cottage in the grounds of Kensington Palace, where staff already know Markle.\"\n\nGetty Images\n\nNovember 27, 2017: They're Engaged!\n\nIt's official! Kensington Palace confirmed that Meghan Markle and Prince Harry were engaged. \"His Royal Highness and Ms. Markle became engaged in London earlier this month,” Clarence House said in a statement. The romantic moment occurred when the couple was cooking a quiet dinner at home—proof that the engagement chicken works!\n\nGetty Images\n\nDecember 21, 2017: The Official Portrait\n\nThe couple commissioned New York-based fashion photographer Alexi Lubomirski to take the engagement photos at Frogmore House in Windsor. Meghan's sheer Ralph & Russo ballgown caused some serious controversy among those claiming the nude top wasn't appropriate for the soon-to-be royal. However, we can't image the actress wearing anything else!\n\nDecember 25, 2017: A Very Royal Christmas\n\nAs a soon-to-be official member of the royal family, Meghan spent her first Christmas with Prince Harry and the Queen. \"The family loved having her there,\" Harry revealed shortly after the holiday.\n\nMarch 14, 2018: A Stamp of Approval\n\nWhile most have to gain parental permission to wed their S.O., Prince Harry had an extra person to please before he walked down the aisle. Luckily, the Queen officially expressed her wedding well wishes in a letter to the advisors of the Privy Council, giving Meghan and Harry the go-ahead!\n\nGetty Images\n\nMay 19, 2018: The Royal Wedding\n\nDuring one of the most-anticipated weddings of this generation, Meghan and Harry said \"I do\" in front of 600 guests (and millions of television viewers) at Windsor Castle's St. George's Chapel. The bride commissioned Givenchy's Clare Waight Keller to design her simple boatneck gown. Several of Meghan's former Suits castmates witnessed the nuptials and Idris Elba even DJ'ed the reception at Frogmore House. In August 2020, it was revealed that the newlyweds chose “I’m in Love” by Wilson Pickett for their first dance of the evening.\n\nOctober 15, 2018: They're Expecting!\n\nOne fall Monday, Harry and Meghan shocked the world when they announced they were expecting! Kensington Palace confirmed the news in a statement writing, “Their Royal Highnesses The Duke and Duchess of Sussex are very pleased to announce that The Duchess of Sussex is expecting a baby in the Spring of 2019. Their Royal Highnesses have appreciated all of the support they have received from people around the world since their wedding in May and are delighted to be able to share this happy news with the public.”\n\nGetty Images\n\nOctober 16, 2018: A Tour Down Under\n\nThe day after the couple announced their pregnancy news, they jetted off on their first official tour as the Duke and Duchess of Sussex. They visited Australia, Fiji, the Kingdom of Tonga, and New Zealand, a trip that coincided with Prince Harry's Paralympic competition, Invictus Games, which was held in Sydney that year.\n\nFebruary 19, 2019: Stateside Baby Shower\n\nIn February, the Duchess made a surprise visit to New York City to celebrate her pregnancy with friends. The star-studded event, which was reportedly hosted and paid for by Serena Williams, was held in the Mark Hotel's penthouse suite—the most expensive hotel room in America! Guests like Amal Clooney, Gayle King, Abigail Spencer, Jessica Mulroney and Misha Nonoo participated in a flower arranging class and enjoyed a \"dessert-tasting experience\" by world-renowned chef Jean-Georges Vongerichten.\n\nApril 2, 2019: @SussexRoyal\n\nA month following their formal split from Kensington Palace, an account now dedicated to solely Prince William and Kate Middleton, Harry and Meghan created an official Instagram account, Sussex Royal. Their post featured a carousel of images, the first being their official monogram—a design that blends the first letters of Harry and Meghan's names into one elegant icon, topped with a coronet and “Official Instagram for their Royal Highnesses the Duke and Duchess of Sussex” written beneath it.\n\nGetty Images\n\nMay 6, 2019: Introducing Baby Archie\n\nMeghan and Harry welcomed the littlest royal family member a few weeks shy of their first anniversary. Two days later they announced his name: Archie Harrison Mountbatten-Windsor. While an unexpected name, royal reporter Emily Andrews says the couple picked it because they just liked it!\n\nJuly 6, 2019: Archie's Private Christening\n\nThe proud new parents chose to keep their son's christening quite private. However, since christenings are very important to royals, the couple shared two official photos from the ceremony at Windsor Castle.\n\nJuly 14, 2019: Lion King Premiere in London\n\nFor the first red carpet moment together, Meghan and Harry attended The Lion King premiere in London in support of their conservation efforts in Africa. While there, the royals rubbed elbows with the movie's cast including Beyoncé and her husband Jay-Z. In a video taken by royal commentator Rebecca English, Beyoncé told Meghan, \"The baby is so beautiful, we love you guys.\" Queens meeting queens—absolutely iconic!\n\nGetty Images\n\nSeptember 25, 2019: Bringing Archie to Africa\n\nPrince Harry and Meghan took their first official tour as a family of three to Africa this fall. During the 10-day visit, the couple introduced their son to a very important man—Desmond Tutu! The photos revealed just how adorable Archie is and how loving the new parents are.\n\nJanuary 8, 2020: A Shocking Relationship Decision\n\nOn January 8, 2020 the couple revealed via Instagram that they will be stepping down as senior members of the Royal Family and will work to become \"financially independent.\" They also shared that they will be splitting their time between the United Kingdom and North America. \"This geographic balance will enable us to raise our son with an appreciation for the royal tradition into which he was born, while also providing our family with the space to focus on the next chapter, including the launch of our new charitable entity,\" they wrote.\n\nJuly 2020: The Sussexes Move to Santa Barbara\n\nAfter a few months of living in Tyler Perry's Beverly Hills mansion, the Duke and Duchess made their California residency official and purchased a home in Santa Barbara—about 100 miles north of Los Angeles. \"The Duke and Duchess of Sussex moved into their family home in July of this year,\" a rep for the couple told People in August. \"They have settled into the quiet privacy of their community since their arrival and hope that this will be respected for their neighbors, as well as for them as a family.\"\n\nSeptember 2, 2020: The Newest Stars of Netflix\n\nMeghan is going back to her Hollywood roots! The Duke and Duchess founded a production company and landed a multi-year deal with Netflix, according to The New York Times. The news means Meghan and Harry will be creating documentaries, docu-series, feature films, scripted shows and children’s programming for the streaming company. \"Our focus will be on creating content that informs but also gives hope,” the couple said in a statement. “As new parents, making inspirational family programming is also important to us.”\n\nSeptember 8, 2020: Finally Financially Independent\n\nNine months after stepping down as senior royals, the Sussexes finally achieved their goal of financial independence. The couple paid off the taxpayer-funded renovation costs of their former Frogmore Cottage home in Windsor (a feat that cost $3 million) and no longer rely on financial assistance from Prince Charles (who was helping with living costs since the pair's move in March, per People.\n\nNovember 25, 2020: Mourning the Loss of a Second Child\n\nIn November Meghan wrote a deeply personal essay for The New York Times in which she shared details of a miscarriage she suffered in July 2020. “I knew, as I clutched my firstborn child, that I was losing my second,” Meghan wrote in the heartbreaking essay. In the roughly 1,000 word piece, the Duchess used her pain to shed light on the \"taboo\" that still exists about experiencing such a loss: “In the pain of our loss, my husband and I discovered that in a room of 100 women, 10 to 20 of them will have suffered from miscarriage. Yet despite the staggering commonality of this pain, the conversation remains taboo, riddled with (unwarranted) shame, and perpetuating a cycle of solitary mourning.\"\n\nDecember 15, 2020: Officially Spotify Podcasters\n\nFirst Netflix, and now Spotify—the Duke and Duchess of Sussex inked a multi-year partnership with the streaming service that includes a plan to host and produce podcasts that uplift and entertain audiences. The joint venture kicks off later this month with a holiday special hosted by the couple that couldn't come any sooner. Spotify-owned studio Gimlet will produce the show in partnership with Archewell Audio.\n\n\"What we love about podcasting is that it reminds all of us to take a moment and to really listen, to connect to one another without distraction,\" Harry and Meghan said in a statement. \"With the challenges of 2020, there has never been a more important time to do so, because when we hear each other, and hear each other’s stories, we are reminded of how interconnected we all are.\"\n\nFebruary 14, 2021: Expecting Baby Number Two\n\nA Valentine's Day surprise came in the form of an announcement from the Duke and Duchess of Sussex: Meghan Markle is pregnant with baby number two! \"We can confirm that Archie is going to be a big brother. The Duke and Duchess of Sussex are overjoyed to be expecting their second child,\" Meghan and Harry shared in a statement. The statement was accompanied by a gorgeous black and white photo of the couple with Meghan cradling her stomach, taken by photographer Misan Harriman.\n\nThe announcement was also filled with subtle tributes. For starters, the Duke and Duchess honored Harry's late mother Princess Diana, who 37 years ago to the day, announced she was pregnant with Harry. Markle also gave a sweet nod to her son Archie. The floor-length Carolina Herrera dress she wore in the photo was actually made for her during her first pregnancy. Now Archie and his sibling-on-the-way already share this one thing. According to People, Markle has a longtime relationship with the brand's creative director Wes Gordon. So here's to hoping there are more pregnancy looks like this one!\n\nFebruary 25, 2021: Prince Harry Shares Royal Secrets\n\nDuring an episode of The Late Late Show With James Corden, Prince Harry frolicked around Los Angeles with the television host—and spilled some major royal secrets along the way. While chatting on top of a double-decker bus (a first for the royal!), Prince Harry revealed that he knew Meghan was \"the one\" on their second date. \"It was just the fact we hit it off with each other and we were just so comfortable in each other's company,\" he said, adding, \"We went from zero to 60 in the first two months.\"\n\nThe prince also gave some insight into life at home with his wife and one-and-a-half-year-old son Archie. Per Harry, Archie's first word was \"crocodile.\" He said, \"He is hysterical. He's got the most amazing personality. He's already putting three or four words together.\" Archie also asked for a waffle maker for Christmas, and Queen Elizabeth happily obliged. Meghan now makes their family of three waffles every morning!\n\nMarch 7, 2021: A Secret Wedding and a Gender Reveal\n\nWhen the world witnessed Meghan walk down the aisle to wed Prince Harry in 2018, we thought that was the first time the couple said \"I do.\" However, the couple secretly wed three days prior to the royal nuptials at Windsor Castle! Meghan revealed the shocking news during her highly-anticipated tell-all interview with Oprah Winfrey on March 7, 2021. Turns out, the Duke and Duchess of Sussex officially became husband and wife in their backyard during a ceremony officiated by the Archbishop of Canterbury.\n\nDuring the same interview with Oprah, the royal couple also shared some very special news: the gender of their second baby. After announcing their pregnancy on Feb. 14, the couple is currently expecting a baby girl! With their nearly two-year-old son Archie and a daughter on the way the expecting parents also said \"they are done\" with having children.\n\nMarch 8, 2021: A Growing Family\n\nOn March 8, just one day after the Oprah Winfrey special aired, Harry and Meghan shared the cutest photo of their growing family. Their close friend Misan Harriman—who also captured their pregnancy announcement photo—shared the photo to Instagram.\n\n\"What wonderful news to celebrate on International Women’s Day!\" the photographer wrote. \"Congratulations my friends, and welcome to the #girldad club H .\"\n\nThe black-and-white photo (taken in front of the same backdrop as their pregnancy announcement) shows a smiley Meghan showing off her growing baby bump in a flowing, off-the-shoulder maxi dress with Archie nestled against her chest and Harry behind her with his arms around them both. We can't wait to see them as a soon-to-be family of four!\n\nJune 4, 2021: Introducing Lilibet\n\nIt’s a girl! On June 6, Meghan and Harry announced the birth of their second child, Lilibet “Lili” Diana Mountbatten-Windsor.\n\n\"It is with great joy that Prince Harry and Meghan, The Duke and Duchess of Sussex, welcome their daughter, Lilibet “Lili” Diana Mountbatten-Windsor, to the world,\" the couple shared on their Archewell Foundation website. \"Lili was born on Friday, June 4 at 11:40 a.m. in the trusted care of the doctors and staff at Santa Barbara Cottage Hospital.\" The youngest member of the royal family weighed 7 pounds, 11 ounces, and the statement confirmed that both Meghan and Lili are \"healthy and well, and settling in at home.\"\n\nThe baby’s name is a sweet tribute to two significant people, according to the official announcement. \"Lili is named after her great-grandmother, Her Majesty The Queen, whose family nickname is Lilibet.\" Lili's middle name, Diana, of course, is a nod to Prince Harry's late mother, Princess Diana.\n\nThe royal family congratulated the couple on their new arrival with a series of messages. Queen Elizabeth II released a statement from Buckingham Palace shortly after the birth announcement was made. \"The Queen, The Prince of Wales and The Duchess of Cornwall, and The Duke and Duchess of Cambridge have been informed and are delighted with the news of the birth of a daughter for The Duke and Duchess of Sussex,\" the statement read.\n\nPrince William and his wife Kate Middleton also shared a message on their Instagram account that read, \"We are all delighted by the happy news of the arrival of baby Lili. Congratulations to Harry, Meghan, and Archie.\" A source told Us Weekly that the couple were “informed about the birth and have sent Lilibet a gift.”\n\nAugust 4, 2021: Meghan’s Sweet Birthday Tribute to Archie and Lili\n\nMeghan Markle celebrated her 40th birthday with a sweet birthday message that included a subtle tribute to her kids. On August 4, 2021, the Duchess shared a new video to the Archewell Foundation website featuring friend Melissa McCarthy. The video announced her latest initiative she's launching in honor of her big milestone birthday: 40x40, which encourages people to give 40 minutes of their time to support and mentor women re-entering the workforce.\n\nIn the announcement, Meghan is seen wearing two gold constellation necklaces from celebrity-beloved brand Logan Hollowell that pay tribute to her two kids Archie, 2, and Lilibet Diana, 2 months. One necklace is the Taurus constellation, which represents Archie's zodiac sign. The other is the Gemini constellation for Lili.\n\nCourtesy of Archewell.com\n\nIn another very brief shot, we get the tiniest glimpse at a photo of Lili. On Meghan's desk, we see a tri-fold picture frame which holds a photo of their daughter in the center.\n\nCourtesy of Archewell.com\n\nIn addition to featuring a few adorable Easter eggs, the video is also quite comical. Of course, Bridesmaids star McCarthy brings her witty humor to the table, but Prince Harry also makes a surprisingly hilarious cameo. While McCarthy and Meghan are chatting toward the end of the video, Harry is seen juggling outside of Meghan's window.\n\nCourtesy of Archewell.com\n\nMcCarthy also suggested a few birthday celebrations for Meghan, including a yacht party, a Suits reunion, and even matching tattoos. The comedian shared her idea for their potential new ink, holding up a drawing of the pair that read \"Besties Forever.\"\n\n“Well you know I already have something very similar on my back,” said Meghan. “You know, maybe we save it for when I turn 50.”\n\nSeptember 15, 2021: Meghan and Harry’s First Joint Magazine Cover\n\nPrince Harry and Meghan are among the most influential people in the world, according to TIME magazine. The publication just announced its annual Time100 list, which includes 100 powerful changemakers who are making a difference in the world, and the Duke and Duchess landed a coveted spot.\n\nTo mark the occasion, Meghan and Harry posed for their first joint magazine cover. The couple appears on TIME’s cover in monochromatic outfits (black for Harry, white for Meghan) in front of a tree-filled background. While they didn’t sit for an interview for the issue, their friend Jose Andres, a chef and the founder of World Central Kitchen, wrote a touching tribute.\n\n“In a world where everyone has an opinion about people they don’t know, the duke and duchess have compassion for the people they don’t know,” wrote the chef, noting the couple’s nonprofit work through their Archewell Foundation. “They don’t just opine. They run toward the struggle.”\n\n\n\nMarch 4, 2023: A Coronation Invitation\n\nAccording to a spokesperson for Harry and Meghan, the couple received an invitation to attend King Charles’ coronation on May 6, 2023. “The Duke has recently received email correspondence from his majesty's office regarding the coronation,” the representative shared. “An immediate decision on whether the duke and duchess will attend will not be disclosed by us at this time.”\n\nApril 12, 2023: The Couple RSVPs to the Coronation\n\nAfter the public speculated whether or not Meghan and Harry would attend King Charles’ coronation, Buckingham Palace revealed that Harry will be in attendance, but Meghan will not accompany him. “Buckingham Palace is pleased to confirm that the duke of Sussex will attend the coronation service at Westminster Abbey on 6th May,” the statement said. “The Duchess of Sussex will remain in California with Prince Archie and Princess Lilibet.” According to People, Meghan will not be in attendance because the coronation falls on the same day as Archie’s fourth birthday, so she wants to be there to celebrate her son. Meanwhile, a friend of Harry’s said the Duke wants to support his father during such a milestone moment.\n\nApril 18, 2024: Harry Changes His Country of Residence\n\nPrince Harry has officially changed his country of residence from the United Kingdom to the United States on paperwork at the U.K.’s Companies House. According to People, the “date of change” was listed as June 6, 2023, but the update has just become public.", "images": ["https://www.brides.com/thmb/_Z4Y6mF6zKGeAeJT4xmVXc-534U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/ConstellationNecklaces-d41d7883b94541d6ae9401ea2555a76f.png", "https://www.brides.com/thmb/A12hBiLLCOLjzBOK-6ULlho-BdM=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/princess-diana-wedding-dress-recirc-getty-9-22-6a3d1517f35147338aa650841e5d0427.jpg", "https://www.brides.com/thmb/ksyKGdFQ86kze9X7UfDmZ5x94cI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/prince-harry-meghan-markle-engagement-news-000b7c548610411b83af9b534b30d80e.jpg", "https://www.brides.com/thmb/NTc3kweiBSwgKx8J2x5P6039gns=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/prince-harry-meghan-markle-baby-archie-e27027a1cf3842fb984625015b3c1b6b.jpg", "https://www.brides.com/thmb/EH-bH1CqqxyWPN0WXdGopsJetgo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__brides__public__brides-services__production__2017__09__05__59aed7cbaf890c591c0bf18c_GettyImages-618294018-26faff29c764434c8d64759cb8f3f28b.jpg", "https://www.brides.com/thmb/20goWC-WaAMpvxhws8M9KVJyJUU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/prince-harry-meghan-markle-wedding-kiss-ee8590edfe5442c3a2a9e685ab07a2d3.jpg", "https://www.brides.com/thmb/A5F9hZstmtSc9TeXx4LeCSz5uO4=/200x200/filters:no_upscale():max_bytes(150000):strip_icc()/headshot1-1726354bd1dd433b821411df1feb205a.JPG", "https://www.brides.com/thmb/_LObLdZSeY8DEIIKT-DbjoSw8wA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Meghan-Markle-Lilibet-Embed-06e383f9b8db44b490538763c805ae04.jpg", "https://www.brides.com/thmb/Ia3RkT_PrOrLuneSrp4KjId8Z60=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/tom-holland-zendaya-red-carpet-getty-primary-1025-c070dcd16add48829e940334f37ea2c8.jpg", "https://www.brides.com/thmb/99pP21_jHCaAFWY-7qLDj-ZuOlI=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/selena-gomez-benny-blanco-recirc-getty-9-30-63e2d599988c4d6c958b6ef2beebec62.jpg", "https://www.brides.com/thmb/cquGbz5QyQ7GJyVkvrY6AGclfeg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/meghan-markle-prince-harry-australia-tour-day-one-2018-fea1e1d1260d4153ab6ecca22c47cb95.jpg", "https://www.brides.com/thmb/VuPMei42ufC8bo9T8oGzlMdprA8=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/meghan-harry-recirc-getty-8-26-e067e910dea54d18b04bf1bccf21da67.jpg", "https://www.brides.com/thmb/XCcxg_orZjp37rqYgIa9ixMiR3A=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/ririprimary-1eb76ffee280496a856776bc13e0453f.png", "https://www.brides.com/thmb/hDGrBgPOB5Jdl3oQGXs3CBJUQD8=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/princess-diana-ring-recirc-getty-8-13-7793d724c1434e5ab52a8372b84fb4d5.jpg", "https://www.brides.com/thmb/lZ_foC9gvXw9LJg_DfxChFe9M1U=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/072825-News-Recirc-26f53f2b445f4f4690c42fc619904ca7.jpg", "https://www.brides.com/thmb/fdTJrXmlZH3ISoAn7-KNBsPNuIY=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/princess-beatrice-engagement-ring-recirc-getty-10-8-cb4e23a2c1e240c39f1cb8d1afde6653.jpg", "https://www.brides.com/thmb/DHvHZm1-TKm4EHny-7jJjfalnrc=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/millie-bobby-brown-jake-bongiovi-recirc-getty-10-6-6e8851200c9d49aa81206441544ff05c.jpg", "https://www.brides.com/thmb/2lgBc8zvgT0VJlTYBKLoRF0OUfY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/royal-wedding-handout-ce88891c5bc54940b9b328766f4de82e.jpg", "https://www.brides.com/thmb/SMInGaQY4HTtEyRZsAH1Mf4EjNg=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/kate-middleton-fascinator-recirc-getty-1-22-92691b6fb3c3473c9195736694935ca3.jpg", "https://www.brides.com/thmb/PrmkwSkxVgBJzoy_7ARdlFEYARk=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/kristin-kyle-juszczyk-recirc-getty-10-2-2e19c8ed28874ecca97ae930da17237f.jpg", "https://www.brides.com/thmb/9y5aI7WuM6TV3x2j-ipn47NEzhI=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/100225-charles-marriages-recirc-28cf12a4bd5e434db595007c9b3498ec.jpg", "https://www.brides.com/thmb/MdGNDAYLOa91IYDEPEHLAMM6Ydo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__5a5e5c61a759cb4dab6f1112__11-b0af505c67cd4c15952673e41ea49443.jpeg", "https://www.brides.com/thmb/qeWs0njzFyENJnlTGZWWJ0iZm2w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__brides__public__brides-services__production__2017__09__05__59aee946d8e62933eb5a4ea8_GettyImages-679752864-7d148aeb8fec403db45fdb16716fd008.jpg", "https://www.brides.com/thmb/G9G7AbOBm-BapUUYY4g1KNijsfk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__brides__public__brides-services__production__2017__11__27__5a1c2e7c95d1d6401c02b586_GettyImages-853710240-c0cad8d4678347ae9ab2eef051f978c4.jpg", "https://www.brides.com/thmb/QkAbKAlMOn724HSthIFxiG7G66k=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/will-and-kate-wedding-recirc-getty-7-9-88e66308dac143aea8668ec00892574f.jpg", "https://www.brides.com/thmb/ccq_fJxXcOoA7fj136c9rrJvGkE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1192406417-2a7bbbeaa29b4a61a4f1b97ead6626b2.jpg", "https://www.brides.com/thmb/mk2ixSraQmAgzkt1VGUEyb5mXDA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Meghan-Markle-40-Birthday-Vid-02e6740a4ee044f0925d01a3d6f020ae.jpg", "https://www.brides.com/thmb/CpScQR7dZKa7dgURvBl7FdJNsP4=/200x200/filters:no_upscale():max_bytes(150000):strip_icc()/DSC03763-54bce324f1bd48f5af0910efb178cb7e.jpg", "https://www.brides.com/thmb/NsddO54Ps9kGOMQONLuBg3_x7eA=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/prince-harry-kate-middleton-recirc-getty-9-4-251b98b274684ab38e87fbb0c0055328.jpg", "https://www.brides.com/thmb/tZcgUIECqYX_WGcFPUGQ44rzuCU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/meghan-markle-prince-harry-baby-archie-first-photo-7006eb6605a743c992075bfe932ded97.jpg", "https://www.brides.com/thmb/v-w-JVBmzuweyQrTolB3XtaSswc=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/royal-wedding-traditions-diana-charles-getty-recirc-1124-29708a59ac5a4a44a816508afd553b5d.jpg", "https://www.brides.com/thmb/dtquhjd6pN79qdnKKe6mXVRV-90=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/goldie-hawn-kurt-russell-recirc-getty-10-7-ef4ed3fd779a45eb936ce7337796037b.jpg"], "top_img": "https://www.brides.com/thmb/ccq_fJxXcOoA7fj136c9rrJvGkE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1192406417-2a7bbbeaa29b4a61a4f1b97ead6626b2.jpg", "keywords": [], "authors": ["Maggie Kreienberg", "Maggie Kreienberg Is An Editor At", "Brides'S Editorial Guidelines", "Tess Petak Has Written For Brides Since Her Work Has Also Appeared In Instyle Magazine", "On Instyle.Com."], "canonical_link": "https://www.brides.com/story/meghan-markle-prince-harry-relationship-timeline", "title": "Prince Harry and Meghan Markle's Relationship Timeline", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Plus, everything you need to know about Meghan Markle and Prince Harry's relationship, dating back to when it all started in 2016.", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "BRIDES", "sailthru.author": "Maggie Kreienberg", "sailthru.tags": "news,celebrity-and-royal-weddings", "parsely-section": "News", "parsely-tags": "Brides,News,Celebrity & Royal Weddings", "article": {"section": "Brides"}, "og": {"type": "article", "site_name": "Brides", "url": "https://www.brides.com/story/meghan-markle-prince-harry-relationship-timeline", "title": "Prince Harry and Meghan Markle's Relationship Timeline", "description": "Plus, everything you need to know about Meghan Markle and Prince Harry's relationship, dating back to when it all started in 2016.", "image": "https://www.brides.com/thmb/ccq_fJxXcOoA7fj136c9rrJvGkE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1192406417-2a7bbbeaa29b4a61a4f1b97ead6626b2.jpg"}, "twitter": {"card": "summary", "site": "@Brides", "title": "Prince Harry and Meghan Markle's Relationship Timeline", "description": "Plus, everything you need to know about Meghan Markle and Prince Harry's relationship, dating back to when it all started in 2016.", "image": "https://www.brides.com/thmb/2lgBc8zvgT0VJlTYBKLoRF0OUfY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/royal-wedding-handout-ce88891c5bc54940b9b328766f4de82e.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.129.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.129.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.129.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.129.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.129.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://www.brides.com", "summary": ""}