{"url": "https://www.inquisitr.com/4200803/how-brad-pitt-and-angelina-jolie-went-from-volatile-enemies-to-working-it-out/", "text": "Brad Pitt and Angelina Jolie have been through a lot over the past six months. Following Jolie’s divorce filing in September, the two engaged in a bitter custody battle before eventually smoothing things out. How did they go from enemies to friends in such a short time?\n\nAccording to E! News , things went downhill after Pitt was accused of child abuse stemming from an incident on a private plane with his oldest son, Maddox. The allegations created a lot of buzz in the media and led to an investigation by the FBI and the Los Angeles Department of Children and Family Services. Pitt was also accused of having a drinking problem and cheating on Jolie with Marion Cotillard, his co-star on the film Allied .\n\nAlthough the failed marriage appeared shockingly sudden, inside sources claimed the couple had been experiencing issues for a long time.\n\n“Things had been volatile in their relationship for a little while. They had crazy fights and wouldn’t speak for a bit. They would take some time apart, go on location, calm down and miss each other,” an insider shared. “But, no matter how bad it got, Brad, especially, was never planning on walking away. Every so often, Angelina threatened divorce, but in Brad’s eyes, their lives were stressful because they were raising six kids, things were always going to work out.”\n\nPitt was eventually cleared of the abuse allegations, but not before suffering significant damage to his public image. To make matters worse, the two were fighting a nasty custody battle that granted Pitt only supervised visits with his six children. The situation didn’t turn around until 2016 came to a close.\n\nJolie was spotted in Cambodia promoting her film, First They Killed My Father , in February. The actress took all six children for the trip and finally talked about the split for the first time. In her emotional interview, Jolie admitted that the breakup had been hard on the family but assured everyone that they were working things out.\n\n“We are and forever will be a family. And so that is how I’m coping. I’m coping with finding a way through to make sure this somehow makes us stronger and closer,” she said.\n\nFollowing Jolie’s telling interview, insiders revealed that Brad Pitt was actually in Cambodia with the kids while Jolie was promoting the film. The actor secretly traveled to the country so that he could spend time with the brood, signaling a major shift in his relationship with Jolie.\n\n“They have made some progress and are taking small steps in the right direction. Both are in agreement on putting the kids first. So that part of the equation is better,” an insider revealed.\n\nPitt’s relationship with Jolie is far from perfect, but it has come a long way since September. Although he was accused of abusing his oldest son, sources claim that Pitt has patched up they relationship and things couldn’t be better.\n\n“The kids have always adored Brad and have a very solid relationship with him,” a source explained.\n\nThe source added that Jolie actually regrets how everything played out in the early months of the divorce. According to ET Online , Jolie recently allowed the kids an overnight stay with Pitt for the first time since the split. The children reportedly enjoyed their short stay with their father, who is now communicating with Jolie on a regular basis.\n\nWhile Pitt is enjoying more freedom with the kids, Radar Online reports that Jolie is planning on throwing herself a post-breakup party . The actress is allegedly having the party in London and believes it will help her move on and forget about the divorce.\n\nTell us! Do you think that Angelina Jolie and Brad Pitt will eventually work out a joint custody agreement, allowing him to see the kids more? Let us know in the comments below.\n\n[Featured Image by Jason Merritt/Getty Images]", "images": ["https://www.inquisitr.com/wp-content/uploads/2025/10/2421769f-57a4-4bff-913f-cf316747493e.jpg", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20500%20157'%3E%3C/svg%3E", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20492%20142'%3E%3C/svg%3E", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo-white.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/inquisitr-logo.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent-Dark-Mode.png", "https://secure.gravatar.com/avatar/b22e0f663e4d84f04836297310aadfd9?s=120&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20120%20120'%3E%3C/svg%3E"], "top_img": "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "keywords": [], "authors": ["News Writer"], "canonical_link": "https://www.inquisitr.com/how-brad-pitt-and-angelina-jolie-went-from-volatile-enemies-to-working-it-out", "title": "How Brad Pitt And Angelina Jolie Went From ‘Volatile’ Enemies To ‘Working It Out’", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "https://www.inquisitr.com/wp-content/uploads/2024/12/favicon.png", "description": "Brad Pitt and Angelina Jolie have been through a lot over the past six months. Following Jolie’s divorce filing in September, the two engaged in a bitter", "robots": "follow, index, max-snippet:-1, max-video-preview:-1, max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "How Brad Pitt And Angelina Jolie Went From ‘Volatile’ Enemies To ‘Working It Out’ - Inquisitr News", "description": "Brad Pitt and Angelina Jolie have been through a lot over the past six months. Following Jolie’s divorce filing in September, the two engaged in a bitter", "url": "https://www.inquisitr.com/how-brad-pitt-and-angelina-jolie-went-from-volatile-enemies-to-working-it-out", "site_name": "Inquisitr News"}, "article": {"tag": "Brad Pitt", "section": "Entertainment", "published_time": "2017-05-07T08:54:00-04:00"}, "twitter": {"card": "summary_large_image", "title": "How Brad Pitt And Angelina Jolie Went From ‘Volatile’ Enemies To ‘Working It Out’ - Inquisitr News", "description": "Brad Pitt and Angelina Jolie have been through a lot over the past six months. Following Jolie’s divorce filing in September, the two engaged in a bitter", "site": "@theinquisitr", "creator": "@theinquisitr"}, "generator": "WP Rocket 3.18.3"}, "movies": [], "publish_date": 1494161640.0, "source": "https://www.inquisitr.com", "summary": ""}