{"url": "https://www.popsugar.com/entertainment/Adrift-True-Story-44675299", "text": "Adrift is based on Tami Oldham Ashcraft's memoir Red Sky in Mourning: A True Story of Love, Loss and Survival at Sea . In a 2003 interview with the Chicago Tribune , Ashcraft revealed that she survived on peanut butter and canned food for 41 days after the hurricane hit. She was left with nothing but a sextant and watch to help her navigate the 1,500 miles to Hilo, Hawaii. In addition to hunger, she also had a head injury and a badly damaged boat to deal with. Ashcraft rigged a makeshift sail and fashioned a pump to keep the cabin from flooding as she fought to make it home — and she did it all on her own.\n\nThe basics of the story are completely factual. In 1983, the real Tami and Richard did agree to sail from Tahiti to San Diego, and they were caught in Hurricane Raymond's path. However, the reality behind this story of survival is full of heartache.\n\nBased on a true story, the film focuses on two avid sailors, Tami Oldham (Woodley) and Richard Sharp (Claflin). In 1983, the couple set off across the Atlantic Ocean to deliver a yacht in a trip that was meant to take them from Tahiti to San Diego. When they set off on their journey, they never expected to run into one of the worst hurricanes in history. The trailer reveals that Tami and Richard's yacht is capsized by Hurricane Raymond, leaving Richard gravely injured and Tami in charge of piloting them home. It's a harrowing story, for sure, but how much of Adrift is actually true?\n\nSadly, Sharp did not survive the hurricane. In reality, he sent Ashcraft below deck when the worst of the storm hit, and she ended up knocked out after sustaining a head injury when the boat capsized. She was unconscious for one day, and when she awoke, she went above deck to discover that the storm had taken her fiancé out to sea, leaving her to grapple with his loss as she fought for her own survival.\n\n\"Definitely the hardest part was dealing with Richard being gone,\" Ashcraft told the Chicago Tribune. \"There were times I didn't even want to live anymore because I didn't know how I was going to go on. I was never going to fall in love again. But, actually, while I was in the survival mode, the grief was fairly low. It wasn't as intense as when I got to shore and the survival was over, and I could see people together and everything kept reminding me of him. I just really had a hard time. But that survival instinct [while at sea] just kicked in. It helped me to focus, to keep myself on track.\"\n\nThis is a departure from what's revealed in the Adrift trailer. After Tami regains consciousness in the film, she finds Richard injured, but still alive, in the water. Although he is suffering from broken bones and can't help Tami navigate them toward home, he's still by her side. But that doesn't necessarily mean that Hollywood is planning on giving Richard and Tami the happy ending they never had in real life. It's entirely possible that Woodley's Tami is only imagining Richard being there, especially when you remember that she has a severe head injury, and that throughout her memoir, Ashcraft talks about hearing an inner voice that helped her maintain the will to fight for her survival.\n\nIn an interview with USA Today, the film's director, Baltasar Kormákur, emphasizes that Adrift is a uniquely female survival story. He explained:\n\n\"First of all, we don't have many survival stories where the survivor is a young woman, or a woman at all. How the story intertwines the love between Richard and Tami and the survival tale is compelling. And it asks us the question, 'What is it that makes us survivors?'\"\n\nWhile the heartache of losing her fiancé will always remain with Ashcraft, she is a real life survivor. Not only did she make it out of her terrifying ordeal alive, she even continued to sail afterwards. She also found love again, and is now married with two children. No matter what transpires in Adrift, you can rest assured that Ashcraft's true story is even more painful and inspiring than anything that Hollywood can come up with.", "images": ["https://media1.popsugar-assets.com/files/thumbor/dlsvSM1hFmmhJmO_ER7d6HO-F8k=/fit-in/792x414/top/filters:format_auto():upscale()/2018/03/19/906/n/1922283/tmp_O0V9Dg_c7575a02cc765a0d_edit_img_facebook_post_image_file_44675299_1521343651.jpg", "https://media1.popsugar-assets.com/files/thumbor/TB7LlI7q2ULp8JeFnYkB-B7jlh0=/116x116/filters:format_auto():extract_cover()/2017/07/05/818/n/1922153/64cfa311595d32443b4d74.74797512_edit_img_front_page_image_file_18875468_1499277596.jpg", "https://media1.popsugar-assets.com/files/thumbor/Zb_5xCCoxwwS4ZHmxDnbxKmTQkY=/fit-in/3601x1881/top/filters:format_auto():quality(85):upscale()/2018/03/19/909/n/1922283/0c400d2c5ab022771f96f6.84456207_.jpg"], "top_img": "https://media1.popsugar-assets.com/files/thumbor/Zb_5xCCoxwwS4ZHmxDnbxKmTQkY=/fit-in/3601x1881/top/filters:format_auto():quality(85):upscale()/2018/03/19/909/n/1922283/0c400d2c5ab022771f96f6.84456207_.jpg", "keywords": [], "authors": ["Sabienna Bowman", "Updated On June", "At Pm"], "canonical_link": "https://www.popsugar.com/entertainment/adrift-true-story-44675299", "title": "Adrift: The True Story Behind Shailene Woodley's New Movie Is Harrowing", "meta_data": {"viewport": "initial-scale=1.0, width=device-width", "keywords": "popsugar, sabienna bowman, standard, entertainment, movies, true stories, adrift", "robots": "max-image-preview:large, follow, index", "bingbot": "nocache", "google-site-verification": "-ULnbgnS51gqvbNlz7JAhFDpYe74n2hhzpfc4KXeONA", "description": "PS makes wellness more accessible through real-life stories, first-person perspectives, and expert-backed information. Our staff of journalists and subject-matter experts research, report, and produce articles, videos, and social content that help people feel good about their well-being choices, no matter what they are. Via our core verticals — Health, Fitness, Beauty, Balance, Identity, and Shopping — we help our audience proceed with confidence.", "article": {"publisher": "https://www.facebook.com/PopSugar", "author": "Sabienna Bowman", "published_time": "2018-03-19T21:30:04.000Z", "modified_time": "2018-06-09T16:55:03.000Z"}, "author": "Sabienna Bowman", "parsely-title": "Adrift: The True Story Behind Shailene Woodley's New Movie Is Harrowing", "parsely-link": "https://www.popsugar.com/entertainment/adrift-true-story-44675299", "parsely-type": "post", "parsely-image-url": "https://media1.popsugar-assets.com/files/thumbor/Zb_5xCCoxwwS4ZHmxDnbxKmTQkY=/fit-in/3601x1881/top/filters:format_auto():quality(85):upscale()/2018/03/19/909/n/1922283/0c400d2c5ab022771f96f6.84456207_.jpg", "parsely-pub-date": "2018-03-19T21:30:04.000Z", "parsely-section": "Entertainment", "parsely-author": "Sabienna Bowman", "parsely-tags": "Movies,True Stories,Adrift,Popsugar Voices,Popsugar Voices Team", "fb": {"pages": 112402358796244, "app_id": 175338224756}, "og": {"site_name": "Popsugar", "url": "https://www.popsugar.com/entertainment/adrift-true-story-44675299", "type": "article", "title": "Adrift: The True Story Behind Shailene Woodley's New Movie Is Harrowing", "description": "Brace yourself for this intense story.", "image": "https://media1.popsugar-assets.com/files/thumbor/Zb_5xCCoxwwS4ZHmxDnbxKmTQkY=/fit-in/3601x1881/top/filters:format_auto():quality(85):upscale()/2018/03/19/909/n/1922283/0c400d2c5ab022771f96f6.84456207_.jpg"}, "twitter": {"card": "summary_large_image", "site": "@Popsugar", "image": "https://media1.popsugar-assets.com/files/thumbor/4PG9XLw7iJYllOUCO0rk918lTXE=/fit-in/3825x1881/top/filters:format_auto():quality(85):upscale()/2018/03/19/909/n/1922283/0c400d2c5ab022777da0f8.64749642_.jpg", "description": "Brace yourself for this intense story.", "title": "Adrift: The True Story Behind Shailene Woodley's New Movie Is Harrowing", "url": "https://www.popsugar.com/entertainment/adrift-true-story-44675299"}, "placeholder": {"1": "ph", "2": "ph", "3": "ph", "4": "ph", "5": "ph", "6": "ph", "7": "ph", "8": "ph", "9": "ph"}, "next-head-count": 56}, "movies": [], "publish_date": 1521495004.0, "source": "https://www.popsugar.com", "summary": ""}