{"url": "https://web.archive.org/web/20170707003039/http://digg.com/2017/how-to-watch-all-of-marvel-cinematic-universe", "text": "​Welcome to Fan Service, a guide to engaging with gargantuan, lore-heavy franchises. In each volume, we'll recommend a watch/read order to approach the given series with and dissect our argument for it. Today: The Marvel Cinematic Universe in film and television.\n\nLess than a decade after Nick Fury popped up in Tony Stark's living room uninvited, cinematic universes are now the blockbuster business model everyone wants to emulate. So far, no company has come within spitting distance of the hype the Marvel Cinematic Universe possesses.\n\nTease us with King Kong versus Godzilla? Peanuts compared to Marvel. Give audiences a Mummy and promise them Dracula and Wolf Man in the future? Crickets. And what about the venerable superhero lineup of DC? There's finally life in that effort thanks to \"Wonder Woman,\" but the rest of the \"DCU\" is still dead weight.\n\nLesser superhero movies and cinematic universes might fade from view in the near future, but it looks like there's no stopping Marvel's momentum. By the end of 2017 there will be 17 films in the Marvel Cinematic Universe (MCU) along with a half-dozen TV shows and a bunch of comic book spin-offs. Marvel Studios president Kevin Feige says Marvel has film storylines drafted through 2028. It'd take some kind of cataclysmic event to knock the MCU off track.\n\nThe benefit of Marvel's centrally-planned canon is that, for the most part, it's not too hard to follow the main storyline. All the movies so far have been building towards a future meeting between our Earth-bound heroes, the aliens and gods who chill in space and a big purple CG Josh Brolin in possession of the powerful Infinity Stones.\n\nUnfortunately, from hedged bets in earlier movies to recast roles to outright rebooting a contemporaneous Marvel series — here's looking at you, Spidey — there are a couple things that might throw you off if you're trying to watch all the Marvel movies without getting lost in a dark dimension of crossover confusion. Our recommendation privileges variety over strict chronology in some places and it doesn't abide by Marvel's awkward attempts to plug movies into the middle of television seasons. Also, we'll do our best to clear up any confusion on what movies are in the Marvel Cinematic Universe (a lot) and which movies aren't (also a lot). Here we go.\n\nInching Towards An Infinitely Hyped-Up Intersection\n\nMarvel's first \"Avengers\" movie was in the works well before Robert Downey Jr.'s smarmy charisma brought Tony Stark to life in 2008's \"Iron Man,\" but the studio was careful to not say anything definitive about a crossover flick until they knew they had an arc-powered hit on their hands. As such, the early Marvel movies are careful to only build up towards 2012's \"The Avengers\" and little more. With Tony Stark's warmly received debut and a lasting narrative hangover caused by him having the most screentime of any Avenger prior to their team-up, Iron Man's narrative arc lays most of the groundwork for \"The Avengers.\" Even though Captain America's debut takes place 50 years earlier, you've gotta start with Stark. With that in mind, here's what order to watch everything in:\n\nIron Man (2008)\n\n\n\nIron Man 2 (2010)\n\n\n\nThe Incredible Hulk (2008)\n\n\n\nThor (2011)\n\n\n\nCaptain America: The First Avenger (2011)\n\n\n\nMarvel's The Avengers (2012)\n\n\n\nIron Man 3 (2013)\n\n\n\nThor: The Dark World (2013)\n\n\n\nGuardians of the Galaxy (2014)\n\n\n\nGuardians of the Galaxy Vol. 2 (2017)\n\n\n\nCaptain America: The Winter Soldier (2014)\n\n\n\nAgents of S.H.I.E.L.D. Season 1 (2013)\n\n\n\nDaredevil Season 1 (2015)\n\n\n\nAvengers: Age of Ultron (2014)\n\n\n\nAgents of S.H.I.E.L.D. Season 2 (2014)\n\n\n\nJessica Jones Season 1 (2015)\n\n\n\nAnt-Man (2015)\n\n\n\nDaredevil Season 2 (2016)\n\n\n\nDoctor Strange (2016)\n\n\n\nLuke Cage Season 1 (2016)\n\n\n\nCaptain America: Civil War (2016)\n\n\n\nAgent Carter Seasons 1 and 2 (2015-16)\n\n\n\nAgents of S.H.I.E.L.D. Seasons 3 and 4 (2015-16)\n\n\n\nIron Fist Season 1 (2017)\n\n\n\nSpider-Man: Homecoming (2017)\n\n\n\nIf you're just focusing on the films, this order guides you through the major arcs of the MCU thus far. First, you meet the individual heroes who come together and form the Avengers. Next, you see the sprawling aftermath of the Avengers' first conflict followed by a detour in deep space (where we learn a lot more about the Infinity Stones). The introduction of Ultron leads to division amongst Earth's heroes, putting them on icy terms with one another right as that big purple guy plots to assemble those dang Stones.\n\nOkay, What Movies Aren't Part Of Marvel's Cinematic Canon?\n\nMarvel Entertainment predates the MCU by quite a while, and the name is still attached to projects primarily led by other studios that negotiated the rights to certain Marvel characters a long time ago. Marvel Studios is responsible for films in the MCU. You'll never see their name attached to films featuring Marvel characters that don't exist in the same canon as Robert Downey Jr.'s Iron Man and the rest.\n\nThe biggest, most clearly separated example of non-MCU Marvel movies are Fox's \"X-Men\" films, starting with 2000's \"X-Men\" and continuing through films like \"Deadpool,\" \"X-Men: Apocalypse\" and \"Logan.\" The first few \"X-Men\" and subsequent solo endeavors like Wolverine's films can be seen as blueprints for the MCU in reverse — if they hadn't shown that audiences were willing to watch ensemble superhero movies and more focused tie-in films, Marvel Studios likely wouldn't have moved forward with the build-up towards \"The Avengers.\"\n\nMarvel surely appreciates the success of the \"X-Men\" films to an extent, but they'd probably rather have the rights back themselves. Professor X's cohort of mutants has so many memorable Marvel characters wrapped up in it that fans are constantly asking about the chances of the \"X-Men\" joining the MCU. As of last year, Kevin Feige reiterated that the chances are slim. So long as Fox keeps making films with those characters, they hold the rights — and they won't stop so long as there's money in it for them.\n\nThe X-Men aren't the only Marvel characters Fox holds the rights to: Fox still has The Fantastic Four under their belts. They've already rebooted that series once, after two poorly received films (with future Captain America Chris Evans as The Human Torch). The 2015 reboot film was panned too, so it's possible that Fox will negotiate handing rights to the Four back to Marvel. Fox also made the 2003 Ben Affleck \"Daredevil\" film, and that bombed so badly that Fox went ahead and let Marvel have the rights back — and when they did, Marvel rebooted Daredevil as their first Netflix show in the MCU. So it's not impossible that other Fox characters will join the MCU fold, but it's almost certain it'll involve a reboot and a lot of money changing hands.\n\nIt's a similar story with Spider-Man, only now the web slinger's already part of the MCU. Sony Pictures holds the rights to that character in a similar fashion to Fox; so long as they keep making Spider-Man movies, they keep those rights. That's why they did \"The Amazing Spider-Man\" and it's sequel a little while back, after the MCU already took off. Unfortunately for Sony, those films didn't do as well as the originals — and then the massive Sony email leak happened. It was shortly after that damaging hit to the company that they announced a new deal with Marvel Studios regarding Spider-Man: Spidey would join the MCU in the next Captain America film, and then get his own solo film as a co-production between Marvel Studios and Columbia Pictures. Sony gets all the profit from solo Spider-Man films and any other Spider-Man spinoffs while Marvel Studios makes all the money from films where Spider-Man has a smaller role, like with the character's introduction in \"Captain America: Civil War.\"\n\nSo Wait, Who's Spider-Man Now? Who's The Hulk?\n\nOK, perhaps you're still confused. With so many reboots and recastings over the last decade and change, who could blame you? Let's go through the iterations of a few key Marvel characters to establish which versions are and aren't canon in the MCU.\n\nSpider-Man/Peter Parker\n\n&amp;amp;amp;amp;lt;img src=\"http://static.digg.com/images/c2f43ddb92c74a349cc98db3e5a99142_2ce9f48683ed4673913f75945c5a5965_1_post.jpeg\" alt=\"\" /&amp;amp;amp;amp;gt;\n\nThe three Spider-Man films starring Tobey Maguire as Peter Parker are not canon in the MCU, and neither are the \"Amazing Spider-Man\" reboots with Andrew Garfield. Tom Holland's Peter Parker, introduced midway through \"Captain America: Civil War,\" is the one you've got to know. Hopefully we won't have to deal with any other Spider-Men (and that is how you pluralize \"Spider-Man\") in the near future. Do not cry for Maguire or Garfield — the true loss to Marvel's cinema canon through this double reboot is J.K. Simmons' hilarious version of J. Jonah Jameson, Parker's irritable, cigar chomping boss at the Daily Bugle. If they introduce Jameson to the MCU and cast Simmons again, everyone would be willing to look the other way.\n\nThe Hulk/Bruce Banner\n\n&amp;amp;amp;amp;lt;img src=\"http://static.digg.com/images/e51a5339da0d4a0e877b667642f06706_2ce9f48683ed4673913f75945c5a5965_1_post.jpeg\" alt=\"\" /&amp;amp;amp;amp;gt;\n\nAlright, this is a bit more confusing. Eric Bana starred as Bruce Banner in Universal's 2003 film \"Hulk,\" directed by Ang Lee. The poor reception that film received made it easy for Marvel to get the film rights for the Hulk back from Universal, and so they introduced Hulk to the MCU five years later in \"The Incredible Hulk\" starring Ed Norton as Banner. Throughout the production of that film, there were tensions between Norton and the folks at Marvel Studios — the film wasn't too well-received and so Marvel and Norton split, leading to Banner's recasting in \"The Avengers.\"\n\nWar Machine/James Rhodes\n\n&amp;amp;amp;amp;lt;img src=\"http://static.digg.com/images/8f55ad118aff4a5ab0d85331044816c9_2ce9f48683ed4673913f75945c5a5965_1_post.jpeg\" alt=\"\" /&amp;amp;amp;amp;gt;\n\nIt's not too hard to follow along here, considering that Terrence Howard only appears as James Rhodes in the first \"Iron Man\" film. Howard left the franchise because of a salary dispute (according to Howard, Marvel went back on their promised salary bump for \"Iron Man 2\" while still increasing Robert Downey Jr.'s paycheck) and Rhodes ended up being recast. Don Cheadle's Rhodes donned Tony Stark's old Iron Man suit in the second film, and he's been in the MCU as Rhodes a.k.a. War Machine ever since.\n\nWhat's The Deal With The TV Shows?\n\nWhile the Marvel movies are generally pretty good at either sticking to self-contained stories or giving you the context you need, there are two flavors of Marvel TV: plotty film-spin offs and isolated, prestige TV solo stories.\n\n\"Agents of S.H.I.E.L.D.\" and \"Agent Carter\" are ABC’s MCU television shows, and they’re both lead by supporting characters plucked from the Marvel films. Of anything in the MCU, these shows are the most stereotypically \"comic-book-y\" — their central pitch is that they’re giving your a bigger picture of the world depicted in the films.\n\nNetflix's Marvel shows take the opposite approach: they all focus on super powered New Yorkers whose lives cross paths but who collectively have little to no connection with the heroes we see on the big screen.\n\nWhen it comes to a watch order, the ABC and Netflix shows are wedge themselves into the MCU timeline differently. In \"Daredevil,\" \"Jessica Jones\" and \"Luke Cage,\" the climactic New York battle in the first Avengers film is referenced from time to time, placing those stories after the film. Simple enough. \"Agents of S.H.I.E.L.D.\" wants to give the appearance of being more deeply embedded in the MCU, so there are numerous points in the show where audiences are told one of the films takes place between episodes of the show.\n\nOur order follows the Netflix-ian impulse throughout: The assumption is that you're going to binge watch these shows. The Netflix shows have shorter seasons and are more consciously suited for this style of watching, but it holds up with \"S.H.I.E.L.D.\" too. Clearly, the idea is that fans who are deeply committed to the MCU timeline will wedge the movies in between episodes of \"S.H.I.E.L.D.\" where they come, but this would totally disrupt the flow a person has when watching a season of television. You go right from one low-ish budget episode of television (sorry, it's true) to a blockbuster film and back — a little weird. Plus, as integrated as the films are supposed to be in the timeline, \"S.H.I.E.L.D.\" pulls the lazy move of having the critical events of these film interludes summarized with TV news reports at the top of the following episode twice.\n\nAside from these \"S.H.I.E.L.D.\" tie-ins, the TV shows aren’t likely to become more critical to the films either. While the Netflix heroes are teaming up for the first season of \"The Defenders\" in August 2017, they’re not likely to rise to the level of The Avengers any time soon. Small film cameos seem likely, perhaps inevitable, but it's doubtful that the franchise overlords at Marvel would craft those scenes in such a way that people who’ve only seen the films will be lost or confused.\n\nSo long as the connective tissue between the shows and the films stays as thin as it is now, it makes more sense to stick whole seasons between movies or to just watch all the films first before doubling back to watch any of the shows that strike your fancy. Oh, and if you're wondering which show you could skip if you want to, hardly anybody liked Netflix's \"Iron Fist.\" Plus, do you really need another story about an über rich guy who becomes a superhero with \"Iron\" in their name?\n\nThe Future\n\n2018 is going to add a few more hero-focused movies into the MCU, including the highly anticipated \"Black Panther\" film, but the biggest splash will be \"Avengers: Infinity War.\" After six years of teasing that started with the first \"Avengers\" film, most of the heroes introduced in the films (plus, if hints from the directors pan out, heroes who haven't gotten their films yet) will team up to punch Purple Brolin in the face — or at least get very close to doing so. \"Infinity War\" was originally pitched as a two-part film, not unlike how \"The Hunger Games\" split the last installment into two films released a year apart. Now that the films are in production the plan has changed slightly, with the fourth Avengers installment receiving a different, as-yet-unannounced title.\n\nWhile it's unlikely that we'll see the end of the Infinity Stone storyline in 2018, hopefully Marvel won't stick audiences with a dud of a cliffhanger either. And, for the sake of keeping the story straight, hopefully they won't stick too many shows and films into that gap in the timeline.\n\nOkay, who are we kidding? Next year you'll probably need to get a corkboard and some red yarn to start tying together all the different plotlines. Excelsior?", "images": ["https://web.archive.org/web/20170707003039im_/http://static.digg.com/images/60fe9580d068402ca26664a449194ac0_2ce9f48683ed4673913f75945c5a5965_2_www_marquee_standard.jpeg", "https://web.archive.org/web/20170707003039im_/http://static.digg.com/images/d6deb2486dbd42b893e6afe182a90599_8844d552f83f4e7e8bcb4bd04efaa6ba_2_www_large_thumb.jpeg", "https://web.archive.org/web/20170707003039im_/http://static.digg.com/images/7409a1612bc04845a93c952207878d3c_2ce9f48683ed4673913f75945c5a5965_header.jpeg", "https://web.archive.org/web/20170707003039im_/https://www.facebook.com/tr?id=1397659756922323&ev=PageView&noscript=1", "https://web.archive.org/web/20170707003039im_/http://www.google-analytics.com/collect?v=1&_v=j27d&t=pageview&_s=1&dl=/nojs/2017/how-to-watch-all-of-marvel-cinematic-universe&ul=en-us&de=UTF-8&&je=1&fl=15.0%20r0&_utma=31339030.1779803059.1499387439.1499387439.1499387439&_utmz=31339030.1499387439.2.2.utmcsr%3D(direct)%7Cutmcmd%3D(none)&_utmht=1411419978909&_u=MSACAEQ~&cid=1779803059.1499387439&tid=UA-33556916-1&z=1779803059", "https://web.archive.org/web/20170707003039im_/http://pixel.quantserve.com/pixel/p-XScWTQ3jeFt7B.gif", "https://web.archive.org/web/20170707003039im_/http://static.digg.com/static/images/x.gif", "https://web.archive.org/web/20170707003039im_/http://static.digg.com/images/8f3948a89e584a03a504044bd93686be_2ul91bh_1_www_large_thumb.jpeg", "https://web.archive.org/web/20170707003039im_/http://b.scorecardresearch.com/p?c1=2&c2=23640849&cv=2.0&cj=1", "https://web.archive.org/web/20170707003039im_/http://static.digg.com/images/eb896727bb534861808f4d56d0cd0912_1386ea696c9e20d1ba1743b2fce3895e_1_www_large_thumb.jpeg", "https://web.archive.org/web/20170707003039im_/http://static.digg.com/images/a6e7a1a5c39d4f1e99a920882d6502af_ac1d52af989f405398e896c29141a760_profile.jpeg"], "top_img": "https://web.archive.org/web/20170707003039im_/http://static.digg.com/images/60fe9580d068402ca26664a449194ac0_2ce9f48683ed4673913f75945c5a5965_2_www_marquee_standard.jpeg", "keywords": [], "authors": ["Mathew Olson"], "canonical_link": "https://web.archive.org/web/20170707003039/http://digg.com/2017/how-to-watch-all-of-marvel-cinematic-universe", "title": "The Best Way To Watch The Marvel Cinematic Universe", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "twitter": {"card": "summary_large_image", "site": "@digg", "title": "The Best Way To Watch The Marvel Cinematic Universe", "image": "https://web.archive.org/web/20170707003039im_/http://static.digg.com/images/60fe9580d068402ca26664a449194ac0_2ce9f48683ed4673913f75945c5a5965_2_www_marquee_standard.jpeg", "description": "Confused as to who the heck is playing Spider-Man these days? Want to know the difference between The Avengers and The Defenders? Let us do you a Fan Service by demystifying Marvel's Cinematic Universe."}, "fb": {"app_id": 123277257693179}, "og": {"url": "https://web.archive.org/web/20170707003039/http://digg.com/2017/how-to-watch-all-of-marvel-cinematic-universe", "type": "article", "title": "The Best Way To Watch The Marvel Cinematic Universe", "image": "https://web.archive.org/web/20170707003039im_/http://static.digg.com/images/60fe9580d068402ca26664a449194ac0_2ce9f48683ed4673913f75945c5a5965_2_www_marquee_standard.jpeg", "description": "Confused as to who the heck is playing Spider-Man these days? Want to know the difference between The Avengers and The Defenders? Let us do you a Fan Service by demystifying Marvel's Cinematic Universe."}, "application-name": "Digg", "msapplication-TileImage": "/static/images/windows-tile-144x144.png", "msapplication-TileColor": "#ffffff", "description": "Confused as to who the heck is playing Spider-Man these days? Want to know the difference between The Avengers and The Defenders? Let us do you a Fan Service by demystifying Marvel's Cinematic Universe."}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}