{"url": "www.harpersbazaar.com/celebrity/latest/a13453462/taylor-swift-repuation-magazine-tabloid-criticism/", "text": "Every product on this page was chosen by a Harper's BAZAAR editor. We may earn commission on some of the items you choose to buy.\n\n15 min read\n\nTaylor Swift and Travis Kelce confirmed their budding romance in September 2023, when the singer showed up to cheer on the Kansas City Chiefs tight end at a home game in Missouri’s Arrowhead Stadium. The move came months after Kelce first publicly expressed interest in Swift, after attending one of her concerts.\n\nAhead, see everything we know about their relationship so far.\n\nThe engagement\n\nAugust 26, 2025\n\nIt’s official, Swift and Kelce are getting married! The two announced the happy news with a joint Instagram post today, including photos from the fairytale garden proposal—and most importantly, the singer’s giant 10-carat diamond ring. Shop Swift’s engagement dress here.\n\n“Your English teacher and your gym teacher are getting married 🧨,” they write.\n\nThey later reveal that the NFL player popped the question right after filming their New Heights episode, where Swift announced The Life of a Showgirl.\n\nA week later, Kelce says he gets “giddy” calling Swift his fiancé, admitting on his New Heights podcast: “It’s been really fun telling everybody who I’m going to be spending the rest of my life with.”\n\nThen, in November, Swift starts building up her bridesmaid crew. After attending Selena Gomez’s wedding, Swift asks her longtime bestie to join her own wedding party, as a bridesmaid. And shortly after, during a girls’ night with Gigi Hadid, the singer asks the same of the supermodel, the U.S. Sun reports.\n\n“Taylor wants to start the wedding process this way—building her bridesmaid group and getting everyone involved in the preparations, celebrations, and planning,” an insider tells the outlet. “She wants it to be fun and memorable for everyone, with parties, trips, and time spent together leading up to the big day.”\n\nGotham // Getty Images Taylor Swift and her friends in NYC on November 4, 2023.\n\nThe podcast episode\n\nAugust 13, 2025\n\nMaking her New Heights debut, Swift joins Kelce and his brother Jason for an episode of their NFL podcast. In addition to announcing her 12th studio album, The Life of a Showgirl, Swift gushes over Kelce, calling him a “human exclamation point” and thanking the podcast for getting her a boyfriend. He, in turn, looks smitten with his girlfriend, swooning at her vocabulary and sharing his excitement for the album. See all the Easter eggs here.\n\nTheir red-carpet debut\n\nJune 23, 2025\n\nSwift joins her beau at Tight End University—an annual event that brings together the best tight ends in the league to train and bond—at a local bar in Nashville, Tennessee. The event comes as football star prepares for his upcoming NFL season.\n\nIn clips and photos shared to social media, Swift and Kelce are seen smiling and chatting at the NFL party. The singer stays true to her style in a green gingham set, while the athlete is cool and casual in a white knit polo and matching shorts.\n\nThe event also marks the first time the couple walks the red carpet together.\n\nAt one point in the night, Swift and Kelce are seen dancing closely to her song “Shake It Off.” See a video of the sweet moment:\n\nThe 2025 Super Bowl\n\nFebruary 9, 2025\n\nOn January 26, Swift runs into the field to congratulate Kelce at his Kansas City Chiefs game against the Buffalo Bills in Kansas City, Missouri, where the Chiefs win big and secure their spot at their third consecutive Super Bowl. They look so in love as they share celebratory hugs and kisses.\n\nSwift wears a head-to-toe Louis Vuitton ensemble for the big day, the details of which you can see here.\n\nJamie Squire // Getty Images\n\nPerry Knotts // Getty Images\n\n\n\n\n\nThe next month, Swift arrives at Super Bowl LIX in a look filled with musical Easter eggs and romantic nods to Kelce. See all the photos of her reacting to the big game here.\n\nGregory Shamus // Getty Images\n\nThe Grammys nod\n\nFebruary 2, 2025\n\nThe pop superstar walks the red carpet at the 2025 Grammys in a vibrant red gown, nodding to her Reputation and to Kelce’s NFL team, the Kansas City Chiefs. Her look also gives another sexy shoutout to Kelce via a red beaded garter belt chain that peeks out from underneath her sparkly minidress. The dangly chain has a little letter “T,” which seems like a shoutout to her boyfriend, who is training for his next Super Bowl and therefore could not join her at the award show.\n\nFrazer Harrison // Getty Images\n\nThe surprise party\n\nDecember 2024\n\nTo celebrate her career-defining, record-breaking Eras Tour, Kelce hosts a bash for Swift. Their close friends attend, all in Eras-themed party fits, and he even recreates the suit and top hat look he wore onstage to make his cameo at one of her shows. The singer is striking in a plunging black Balmain minidress adorned with a line of clear crystals and sequins.\n\nKelce’s friend Ross Travis shares photos of the couple on Instagram. As does stylist Ashley Avignone.\n\nTravis’ Dublin appearance\n\nJune 30, 2024\n\nThe singer has the purest reaction to spotting her boyfriend in the audience at her final Eras Tour show in Dublin.\n\nAs seen in concert footage posted on X (formerly Twitter), Swift’s face lights all the way up after she sees Kelce in the VIP tent while she’s singing “August.” She smiles from ear to ear and then continues her performance with extra excitement.\n\nThe three-time Super Bowl winner’s appearance at the concert comes as a surprise, because just the night before, he attended teammate Clyde Edwards-Helaire’s wedding in California—which means that immediately after the ceremony, Kelce jumped on a flight to Ireland (traveling over 5,000 miles) to catch Swift’s final performance. A real-life rom-com.\n\nLater, in the liners of The Life of a Showgirl, Swift releases a poem addressing this moment: “He ran to his car from work to catch the flight / Missed the first act but somehow it’s better this way / It’s just right / Because you get to watch him make his way through the masses / Parting the crowd like some neon Moses in a sequin sea.”\n\nTravis’ stage debut\n\nJune 23, 2024\n\nAfter months of hanging out in the VIP section, Kelce onstage at one of Swift’s Eras Tour concerts. On the final night of her first set of shows at London’s Wembley Stadium, Swift subtly sneaks her beau into the transition between “The Smallest Man Who Ever Lived” and “I Can Do It With a Broken Heart.”\n\nTypically, between the two songs, a pair of male dancers in tuxedos and top hats carry Swift around like a rag doll, changing her into her next outfit while vaudeville-style music plays in the background. However, for this stop, in a surprise appearance, Kelce—dressed in the same formalwear—joins the two men, carrying Swift on his own and proceeding to fan her and use a makeup brush to touch up her face (essentially bringing her back to life), while the other two performers otherwise continue the skit as per usual.\n\nThe interlude fits neatly with the theme of “I Can Do It With a Broken Heart,” which explores Swift’s obligation to continue working and performing even during emotionally turbulent moments in her life. Of course, the symbolism of Kelce carrying the singer after “The Smallest Man Who Ever Lived” is not lost on viewers—she has clearly found herself a man who supports her (and is big enough to carry her on his own). Also, it feels as if Swift is winking at her two British exes (Joe Alwyn and Matty Healy) by having Kelce appear specifically during a London stop.\n\nWeeks later, on his podcast episode released on July 3, Kelce reveals it was his idea to join Swift on stage. “I was like, ‘How funny would it be if I just rolled out on one of the bikes during the 1989 era,’” He recalls, adding that Swift initially laughed at the idea, but then asked, “‘Would you seriously be up for doing something like that?’’\n\nTravis told her, “I was just like, ‘What? I would love to do that, are you kidding me? I’ve seen the show enough—might as well put me to work here,’” he recalls. “And sure enough, she found the perfect part of the show for me to come in.”\n\n“It was an absolute blast,” he adds. “And I didn’t disappoint Taylor, so that’s all that really matters.”\n\nThe Instagram launch\n\nJune 22, 2024\n\nFor the first time in their near-year of dating, Swift adds Kelce to her Instagram grid. She shares a selfie of her and Kelce posing backstage with Prince William and his two oldest kids, Prince George and Princess Charlotte, after her first London Eras Tour show. “Happy Bday M8! London shows are off to a splendid start 🇬🇧🇺🇸🤝@princeandprincessofwales,” Swift captions the snap, referencing William’s 42nd birthday, which he celebrated at the concert.\n\nOver the summer, they travel Europe and find the time for romantic holidays during Swift’s breaks from her tour. In a particularly sweet getaway, they enjoy an alfresco dinner date at the luxurious Villa Sola Cabiati in Lake Como, Italy’s Grand Hotel Tremezzo—before boarding a private boat cruise.\n\nBACKGRID\n\nBACKGRID\n\nFirst Tayvis love songs\n\nApril 19, 2024\n\nOn her 11th studio album, The Tortured Poets Department, Swift seems to allude to her relationship with Kelce for the first time. Most notably, in “The Alchemy” and bonus track “So High School,” she makes several references to football.\n\n“So when I touch down / Call the amateurs and cut ’em from the team / Ditch the clowns, get the crown / Baby, I’m the one to be,” she sings on “The Alchemy.”\n\nAnd on “So High School,” she sings, “Truth, dare, spin bottles / You know how to ball, I know Aristotle / Brand new, full throttle.”\n\nThe 2024 Super Bowl\n\nFebruary 11, 2024\n\nOn January 28, Swift rushes the field to meet her man with a big, proud, tearful kiss and hug after his big win against the Baltimore Ravens—as seen in now iconic photos.\n\nPatrick Smith\n\nRob Carr\n\nPatrick Smith\n\nA week later, Swift makes the trek from Tokyo, where she performed an Eras Tour show, to Las Vegas to support Kelce at Super Bowl LVIII. Kelce and the Kansas City Chiefs triumph over the San Francisco 49ers in nail-biting overtime, 25–22. Swift meets Kelce on the field after the championship game, where she is photographed giving him a congratulatory kiss.\n\nPATRICK T. FALLON\n\nPATRICK T. FALLON // Getty Images\n\nLater, Swift and Kelce head to the Chiefs’ celebratory after-party, where fellow attendees capture video footage of the two serenading each other with a couple of Swift’s most iconic love songs, both from her 2008 Album of the Year Fearless: “Love Story” and “You Belong With Me.”\n\nTheir first statements\n\n\n\nDecember 2023\n\nIn his December/January cover story for WSJ. Magazine, Kelce opens up for the first time about his relationship with Swift.\n\nSpeaking of how they first connected, he says he had some people close to Swift “playing Cupid” for them, after he shot his shot at her Eras Tour. They eventually gave her his contact information, and he “got lucky enough to get her to reach out.”\n\n\n\nAs for their first meeting, Kelce reveals, “When I met her in New York, we had already kind of been talking, so I knew we could have a nice dinner and, like, a conversation, and what goes from there will go from there.”\n\nKelce also says in the interview that he has “never dated anyone with that kind of aura about them” before the 12-time Grammy winner. “I’ve never dealt with it,” he says. “But at the same time, I’m not running away from any of it … the scrutiny she gets, how much she has a magnifying glass on her, every single day, paparazzi outside her house, outside every restaurant she goes to, after every flight she gets off, and she’s just living, enjoying life. When she acts like that, I better not be the one acting all strange.”\n\nElsewhere in the interview, Kelce calls his new girlfriend “hilarious” and “a genius,” and reveals that he and the superstar share a similar outlook on family, work, and life. “Everybody knows I’m a family guy,” he says. “Her team is her family. Her family does a lot of stuff in terms of the tour, the marketing, being around, so I think she has a lot of those values as well, which is right up my alley.”\n\nThen, as Time’s 2023 Person of the Year, Swift opens up to the magazine about her supportive relationship with the NFL player. She clarifies the timeline of their romance, revealing that the first time she attended a Kansas City Chiefs game was, in fact, not their first date.\n\n“This all started when Travis very adorably put me on blast on his podcast, which I thought was metal as hell,” Swift explains. “We started hanging out right after that. So we actually had a significant amount of time that no one knew, which I’m grateful for, because we got to get to know each other. By the time I went to that first game, we were a couple. I think some people think that they saw our first date at that game? We would never be psychotic enough to hard-launch a first date.”\n\nAlthough Swift valued their privacy at the start of their relationship, she says the couple has no plans to run from the public. “When you say a relationship is public, that means I’m going to see him do what he loves, we’re showing up for each other, other people are there and we don’t care,” she says. “The opposite of that is you have to go to an extreme amount of effort to make sure no one knows that you’re seeing someone. And we’re just proud of each other.”\n\nThe singer also addresses her viral, well-documented cameos at Chiefs games. “I don’t know how they know what suite I’m in,” she says. “There’s a camera, like, a half mile away, and you don’t know where it is, and you have no idea when the camera is putting you in the broadcast, so I don’t know if I’m being shown 17 times or once.”\n\nDespite the attention her attendance receives, she says, “I’m just there to support Travis. I have no awareness of if I’m being shown too much and pissing off a few dads, Brads, and Chads.”\n\nDavid Eulitt // Getty Images\n\nLater that month, they celebrate the holidays together for the first time. On New Year’s Eve, the couple counts down to 2024 and celebrates with a passionate kiss at a private party in the Kansas City area with family and friends. Their smooch is captured by @krystenrachelle and later reposted by @mustlikeme4me.\n\nFirst lyrical shout-out\n\nNovember 11, 2023\n\nAmerica’s sweetheart couple takes things international with a reunion in Argentina amid th pop star’s Eras Tour. Videos on X show the two holding hands and smiling as Swift leads her guy through Elena, a steak house in the Four Seasons Buenos Aires.\n\n\n\nKelce attends one of Swift’s sold-out Eras Tour concerts at Buenos Aires’s Estadio Monumental, and she puts on quite a show. In addition to delivering a stellar performance, the pop singer surprises her beau—and the adoring crowd—with some post-show PDA and an onstage shout-out.\n\nVideos capture the singer in her dazzling blue leotard waving goodbye to the audience before running backstage to greet the NFL star with a big smooch and tight embrace.\n\nEarlier in the night, Swift gives Kelce a lyrical acknowledgment during “Karma,” singing, “Karma is the guy on the Chiefs coming straight home to me”—which elicits a big grin from the Kansas City tight end, a roar from the crowd, and a bout of celebration from Swift’s dad, Scott Kingsley Swift, who is watching the show beside Kelce and wearing a Chiefs lanyard.\n\nThe first PDA date nights\n\nOctober 14, 2023\n\nAfter weeks of speculation, Swift and Kelce share their first public display of affection while heading to a Saturday Night Live after-party. Earlier, the pair both make surprise cameos on SNL, with the singer introducing musical guest Ice Spice’s second performance, and the football star appearing as himself in a sketch about the NFL’s Swiftie era.\n\nThe couple are seen holding hands as they arrive and later leave the party at New York City hot spot Catch Steak. Swift pairs a slouchy gray coat with a black corset top, high-waisted pants, and a black bag. Meanwhile, Kelce wears a white leather jacket with pastel decoration, a white button-down, and brown slacks.\n\nGotham // Getty Images\n\nGotham // Getty Images\n\nThe next night, they step out for second PDA-filled date, where they are spotted holding hands on their way home from dinner at the Waverly Inn in Manhattan. The singer looks cool in a sheer black top with purple illustrations and green accents, by Jean Paul Gaultier. She pairs it with a black leather miniskirt, matching lace-up boots with block heels, and a burgundy leather . Kelce wears a beige corduroy suit with a black T-shirt and white Nike sneakers.\n\nGotham // Getty Images\n\nOn the October 18 episode of his podcast with brother Jason Kelce, the Chiefs star addresses the attention he got on a recent date with Swift, when he was seen escorting her to and from her car while seemingly asking her security to step aside. Kelce clarifies in the podcast episode that he simply put his hand on the security guard’s back to show respect and let him know he was there for Swift, too.\n\n“I feel like whenever I’m on a date, I’m always having the sense that I’m a man in the situation. I’m protective, yeah, for sure. You always have to have that feeling or self-awareness, I guess,” Kelce says.\n\nTaylor's first Chiefs game\n\nSeptember 24, 2023\n\nSwift is pictured sitting in a VIP box at Arrowhead Stadium in Kansas City, Missouri, on Sunday next to Kelce’s mother, Donna; the two chat and happily cheer on the Chiefs.\n\nAfter the game, Swift and Kelce are seen walking out together, and Kelce even wears a 1989 Bedroom Painting set from Kid Super Studios—a clear nod to Swift’s 1989 album!\n\nSwift, meanwhile, dresses in the team’s signature red, layering a red bomber jacket over a white tank and black jeans, and wearing her go-to red lipstick.\n\n\n\nJason Hanna // Getty Images\n\nThe pair later grab dinner in the rooftop lounge at Kansas City’s Prime Social. An eyewitness tells Entertainment Tonight, “Travis bought out the restaurant for his family and team. Taylor arrived, wearing a denim dress, and was seen snacking, having some cocktails and dancing alongside Travis. The two were very affectionate with one another but kept things fun and lighthearted. Travis’ teammates also showed up to the after-party, as well as his mom, Donna Kelce. The party lasted until 2 a.m.”\n\nDays later, a photo emerges of them together at the restaurant. In it, Swift is seen with her arm wrapped around Kelce at the bar, while chatting with some friends. (See the photo here.)\n\nThe next week, Swift brings her celebrity posse to Kelce’s game in New Jersey. For the occasion, she’s accompanied by close friends Blake Lively, Ryan Reynolds, Sophie Turner, and even Hugh Jackman.\n\nKevin Sabitus // Getty Images\n\nElsa // Getty Images\n\nKevin Sabitus // Getty Images\n\nTravis’ big shot\n\n\n\nJuly 26, 2023.\n\nThe NFL star first expresses interest in the Grammy winner after going to one of her Eras Tour concerts—though his plan doesn’t exactly work out.\n\nDuring an episode of his New Heights podcast (which he co-hosts with his brother, Philadelphia Eagles center Jason), Kelce mentions that he recently went to one of Swift’s shows and made a friendship bracelet with his phone number to give to her, but wasn’t able to deliver it.\n\n“If you’re up on Taylor Swift concerts, there are friendship bracelets, and I received a bunch of them being there, but I wanted to give Taylor Swift one with my number on it,” he says.\n\nThough Swift usually holds a meet-and-greet with fans after her concerts, she hasn’t been doing so during the Eras Tour (as she performs for three hours or longer every night).\n\n“I was disappointed that she doesn’t talk before or after her shows, because she has to save her voice for the 44 songs that she sings,” Kelce says, confessing that he was “a little butt-hurt” that he couldn’t chat with her. “She doesn’t meet anybody—or at least she didn’t want to meet me, so I took it personal,” he jokes.\n\n“It’s hilarious how much traction this has actually got,” Kelce says months later on The Pat McAfee Show of his potential romance with Swift. “I think right now it’s like that old game in school called telephone, where everybody is just whispering in each other’s ear and just hearing some random stuff … no one actually knows what’s going on.”\n\n\n\nHe adds of his and Swift’s relationship: “I threw it out there; I threw the ball in her court, and y’know, I told her … ‘I’ve seen you rock the stage in Arrowhead. You might have to come see me rock the stage in Arrowhead and see which one’s a little more lit.’ So we’ll see what happens in the near future.”", "images": ["https://hips.hearstapps.com/hmg-prod/images/gettyimages-1968530699-65b6f96b87ec9.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1996273040-65c99aae4ada1.jpg?crop=0.655xw:1.00xh;0.185xw,0&resize=200:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1699256826-651189f173f13.jpg?crop=0.592xw:0.888xh;0.252xw,0&resize=200:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2196123517-6797a3619d89a.jpg?resize=980:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/travis-taylor-eras-tour-party-691cbbdd910ca.png?crop=0.906xw:1.00xh;0.0714xw,0&resize=200:*", "https://hips.hearstapps.com/hmg-prod/images/travis-and-taylor-651443c94b47d.jpg?crop=0.490xw:0.980xh;0.00680xw,0.00680xh&resize=200:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1712328302-651ac5ee3d6ea.jpg?resize=980:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1738320487-652d38ae2be51.jpg?crop=1.00xw:0.821xh;0,0.0293xh&resize=200:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/bookmark-simple-regular.9d9d56b.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1701285733-651ac5b73c2d6.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2197310399-67a01325b8c6b.jpg?resize=980:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1775397905-69134d593cf3c.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1738320487-652d38ae2be51.jpg?resize=980:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/saved.ad81f1a.svg?primary=%2523000000", "https://hips.hearstapps.com/hmg-prod/images/taylor-travis-prince-william-691cbdbe1189a.png?crop=1.00xw:0.857xh;0,0.0262xh&resize=200:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1970250110-1-691cc5b899dbd.jpg?crop=1xw:0.84375xh;0,0.0841xh", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=currentColor&id=link-out-embed", "http://www.harpersbazaar.com/_assets/design-tokens/harpersbazaar/static/icons/arrow-left-regular.ba357e5.svg?primary=%2523D4D4D4", "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-and-brittany-mahomes-react-during-a-game-news-photo-1701874583.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/your-english-teacher-and-your-gym-teacher-are-getting-married-68adeaf23aceb.jpg?crop=0.672xw:1.00xh;0.117xw,0&resize=200:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1701286494-651ac5f9de8cd.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1968530700-65b6f9747fc51.jpg?resize=980:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg", "https://hips.hearstapps.com/hmg-prod/images/screenshot-2025-08-13-at-9-09-23-pm-689d4b70d137d.png?crop=0.828xw:1.00xh;0.0663xw,0&resize=200:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523000000&id=social-button-icon", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1736565874-652bed24e98c8.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2197310399-67a01325b8c6b.jpg?crop=0.828xw:0.553xh;0.0918xw,0.0533xh&resize=200:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/envelope-simple-regular.91a0134.svg", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=currentColor&id=link-out-embed", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1970250110-1-691cc5b899dbd.jpg?crop=1.00xw:0.752xh;0,0.0841xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2196123517-6797a3619d89a.jpg?crop=0.689xw:1.00xh;0.196xw,0&resize=200:*", "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-performs-onstage-during-taylor-swift-the-news-photo-1756395609.pjpeg?crop=0.634xw:1.00xh;0.112xw,0&resize=200:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2196124546-6797a40dc21fe.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1736568085-652bf12272def.jpg?resize=980:*", "http://www.harpersbazaar.com/_assets/design-tokens/harpersbazaar/static/icons/arrow-right-regular.377c654.svg?primary=%2523000000", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1699256826-651189f173f13.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2198607458-67a97216b9df0.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/bgus-2923331-034-66476e6a9302d.jpg?resize=980:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/clock-regular.b2f2888.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1968522896-65b6f961ed2dd.jpg?resize=980:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523000000&id=social-button-icon", "http://www.harpersbazaar.com/_assets/design-tokens/harpersbazaar/static/images/logos/logo.823d7af.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1996273118-65c99b4f4b7d9.jpg?resize=980:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523ffffff&id=social-button-icon", "http://www.harpersbazaar.com/_assets/design-tokens/harpersbazaar/static/images/logos/network-logo.6416a85.svg?primary=%2523ffffff", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/vs-tightenduniversity-teuteuniversityinstagramphotosandvideos-0-04-2-685d8497108f2.png?crop=1.00xw:0.563xh;0,0.184xh&resize=200:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1996273040-65c99aae4ada1.jpg?resize=980:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-is-joined-on-stage-by-travis-kelce-during-news-photo-1739459022.pjpeg?crop=0.658xw:1.00xh;0.184xw,0&resize=200:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/globe-simple-regular.e7f303c.svg", "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-grammys-65c0489ab4adc.jpeg?crop=0.670xw:0.493xh;0.143xw,0.0225xh&resize=200:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2166947444-68ed155781bff.jpg?crop=1.00xw:0.696xh;0,0.104xh&resize=200:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/x-regular.e414d97.svg", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523ffffff&id=social-button-icon", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/caret-left-regular.5546078.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2178036427-6718f8843a25e.jpg?crop=1.00xw:0.667xh;0,0&resize=200:*", "https://hips.hearstapps.com/hmg-prod/images/image002-664906b08b8fd.jpg?resize=640:*", "http://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1970250110-1-691cc5b899dbd.jpg?crop=1.00xw:0.752xh;0,0.0841xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.harpersbazaar.com/celebrity/latest/a45301082/taylor-swift-travis-kelce-full-relationship-timeline/", "title": "Taylor Swift and Travis Kelce’s Full Relationship Timeline", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Taylor Swift and Travis Kelce's Full Relationship Timeline", "description": "The singer and the Kansas City Chiefs tight end can't stop showing off their romance.", "theme-color": "#000000", "og": {"site_name": "Harper's BAZAAR", "title": "A Look at Taylor Swift and Travis Kelce’s Full Relationship Timeline", "description": "A true love story", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1970250110-1-691cc5b899dbd.jpg?crop=1.00xw:0.752xh;0,0.0841xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.harpersbazaar.com/celebrity/latest/a45301082/taylor-swift-travis-kelce-full-relationship-timeline/", "type": "article"}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "opinion": "false", "section": "Celebrity News", "modified_time": "2025-11-18T19:16:00Z", "published_time": "2025-11-18T19:16:00Z"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "parsely-metadata": "{\"socialHeadline\":\"A Look at Taylor Swift and Travis Kelce’s Full Relationship Timeline\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1970250110-1-691cc5b899dbd.jpg?crop=0.668xw:1.00xh;0.146xw,0&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1970250110-1-691cc5b899dbd.jpg?crop=1.00xw:0.752xh;0,0.0841xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1970250110-1-691cc5b899dbd.jpg?crop=0.668xw:1.00xh;0.146xw,0", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1970250110-1-691cc5b899dbd.jpg?crop=1.00xw:0.752xh;0,0.0841xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "timely", "sailthru.excerpt": "Taylor Swift and Travis Kelce confirmed their budding romance in September 2023, when the singer showed up to cheer on the Kansas City Chiefs tight end at a home game in Missouri’s Arrowhead Stadium. The move came months after Kelce first publicly expressed interest in Swift, after attending one of", "sailthru.tags": "celebrity,Celebrity,latest,Celebrity News,Harper's BAZAAR-US", "sailthru.date": "2025-11-18 19:16:00", "sailthru.socialtitle": "A Look at Taylor Swift and Travis Kelce’s Full Relationship Timeline", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1763493360.0, "source": "http://www.harpersbazaar.com", "summary": ""}