{"url": "https://www.celebritynetworth.com/richest-celebrities/singers/ricky-martin-net-worth/", "text": "What is Ricky Martin's Net Worth?\n\nRicky Martin is a Puerto Rican pop musician, actor, and author who has a net worth of $130 million. After a long and successful career, Ricky Martin has earned the moniker \"King of Latin Pop.\" With over 70 million record sales worldwide, he is one of the most commercially successful Latin artists. Martin's work in the late 90s is credited with bringing Latin pop into the mainstream of US music culture. Outside of acting, Martin has achieved considerable success as an actor.\n\nWhen Ricky Martin quite literally exploded onto the American mainstream music scene with his now legendary performance of \"La Copa de la Vida\" at the 41st Grammy Awards in 1999, he'd already established himself as a popular artist in multiple other arenas. As a member of the boy band Menudo, he toured incessantly throughout his teen years and recorded eleven albums. He retired from the group when he was seventeen and was accepted to NYU's Tisch School of the Arts, but chose to defer his acceptance to tour with a new musical in Mexico. His performance in the musical led to roles in two popular Mexican telenovelas and the launch of his solo career. His first two albums with his new record label, Sony Music, were quite successful, and in addition to solid sales, he also launched an acting career in the US, appearing on the sitcom \"Getting By\" and landing a recurring role on \"General Hospital.\" Between 1995 and 1999, his star rose exponentially. His third album was a massive hit in multiple countries. He was invited to star in the Broadway cast of \"Les Miserables\" as Marius Pontmercy and received rave reviews. His fourth album, \"Vuelve,\" released in 1998, proved to be the turning point. It went Platinum in the United States, sold 8 million copies worldwide, and earned him a Grammy nomination for Best Latin Pop Album. This nomination led to the aforementioned performance that changed everything. (And he won the Grammy, too.) Since then, he has released a string of successful English and Spanish language hits and appeared on Broadway in the acclaimed revival of \"Evita\" as Che.\n\nEarly Life\n\nEnrique Martin Morales was born on December 24th, 1971, in San Juan, Puerto Rico. His father was a psychologist, and he was raised in a Roman Catholic household alongside four brothers and one sister. Enrique's parents divorced when he was just two years old. His passion for singing began at an early age, and by the age of six, he was singing along to his favorite pop songs – both Latin and English. Enrique's grandmother was a poet, and he was inspired by her to start writing his own songs.\n\nEarly Career/Menudo\n\nBy age nine, Enrique began to appear in commercials for soft drinks, toothpaste, and other products. Before the age of 11, he had starred in 11 Puerto Rican commercials. His auditions eventually led him to try out for the Latin boy band Menudo. Although he was only 12 years old, Enrique was accepted into the band after exhibiting his impressive dancing and singing skills.\n\nEnrique soon discovered that the band's strict management and tiresome schedule were not to his liking, although he loved having the chance to perform on stage. By 1987, record sales began to decline, and two years later, Enrique left the group as a 17-year-old. Because he was still a minor, Enrique didn't have access to his bank account until he graduated from high school in Puerto Rico. Once he turned 18, he moved to New York City to rest and enjoy the money he had earned during his time in Menudo.\n\nTelenovela\n\nHowever, Enrique Morales soon moved to Mexico City to take a role in the play Mama Ama el Rock. When he was performing on stage, he was noticed by a producer who wanted him to star in a Mexican telenovela. The show focused on a fictional pop group. Outside of the show, this group eventually released several semi-successful albums and toured throughout Mexico. On the heels of this success, Enrique signed a deal with Sony.\n\nSolo Singing Career\n\nHis first album with Sony was Ricky Martin, and this marked the beginning of his stylized stage name. The album was successful and prompted a tour throughout Latin America. He later collaborated with Juan Carlos Calderon on his second studio album, Me Amaras. In 1994, Martin moved to Los Angeles to perform in shows such as Getting By and General Hospital.\n\nIn 1995, Martin revitalized his music career and experimented with a fusion of pop and traditional Latin sounds. His third album, A Medio Vivir, contained the smash hit \"Maria,\" which epitomized this new approach to Latin music. The album went on to sell over 3 million copies worldwide. In 1996, he appeared in a Broadway production of Les Miserables.\n\nHis fourth album came in 1998 with Vuelve, which was certified platinum and sold over 8 million copies worldwide. That year, he also wrote a song for the FIFA World Cup and performed during the finals, bringing Latin pop to the attention of the entire world. Ricky Martin later won a Grammy for this album.\n\nIn 1999, Martin's career took a major step forward as he transitioned to an English audience for the first time. His self-titled album was released later that year, and it contained the smash hit \"Livin' la Vida Loca.\" Madonna also featured on the album. Today, \"Livin' la Vida Loca\" is seen as the song that sparked a newfound interest in Latin pop for English-speaking audiences. Many believe that with this song, Ricky Martin single-handedly paved the way for artists such as Jennifer Lopez, Enrique Iglesias, and Shakira. The 1999 album went on to sell 15 million copies worldwide, earning a seven times platinum status.\n\nIn 2000, he released the album Sound Loaded, which contained the hit \"She Bangs.\" The album later went on to sell over 8 million copies, earning a double-platinum status. In 2001, Martin released a greatest hits album called La Historia. In 2003, he returned to his Latin roots with Almas del Silencio, a Spanish album. Then, in 2005, he returned to an English-speaking audience with the album Life.\n\nIn 2006, he released his first live album, MTV Unplugged. He then began an ambitious world tour. In 2007, the hardworking singer took a three-year break to focus more on his personal life. In 2010, Ricky Martin returned with an autobiography entitled Me, and \"Lo Mejor de Mi Vida Eres Tu,\" a new single featuring Natalia Jimenez. In 2011, he released another album: Musica + Alma + Sexo. This album featured the dance hit \"Mas.\"\n\nIn 2012, Ricky Martin appeared on TV shows Glee and The Voice Australia. After a period of touring, he appeared on The Voice Mexico in 2014 and then toured Mexico. He continued to appear in various broadcasts of The Voice from that point onwards. In 2015, he released the album A Quien Quiera Esuchar. The album later earned Martin another Grammy Award. After a notable role in 2018's American Crime Story, Martin was nominated for an Emmy for the first time. In 2020, Martin announced that he was working on a new album.\n\nPersonal Life\n\nIn 2008, Ricky Martin fathered twin boys via a surrogate mother. Although Ricky Martin was in a relationship with Mexican TV host Rebecca de Alba for over a decade, he publically came out as gay in 2010. He later clarified that he is attracted to both men and women but only wants to have romantic relationships with men. After dating Jwan Yosef in 2016, the couple married and later had two children together.\n\nReal Estate\n\nIn November 2016, Ricky paid $13.5 million for a home in Beverly Hills, California. At the same time, he listed a New York City apartment that he bought in 2012 for $6 million, for $8.4 million. He previously owned a home in Beverly Hills, which he sold in 2006 for $15 million, and a different NYC condo, which he sold in 2015 for $7.55 million.\n\nHe also owns a villa in Madrid, a private island off the coast of Rio de Janeiro, and a large property in his home country of Puerto Rico.", "images": ["https://vz.cnwimg.com/thm/1JoH3482haSLevnlEMdqhrz36y0=/132x132/center/top/filters:format(webp)/2009/11/George-Clooney.jpg", "https://vz.cnwimg.com/thm/uRsxoLs7Ymmit5ATgRtN2utad40=/221x5:381x236/132x132/filters:format(webp):strip_exif()/2009/09/P-Diddy.jpg", "https://vz.cnwimg.com/thm/KNDSqD-9inbRekV6AGgXDEG2Scw=/375x35:810x586/132x132/filters:format(webp):strip_exif()/2015/09/GettyImages-476575299.jpg", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "https://vz.cnwimg.com/thm/x0vUVVlSsnW2lcmVgOVMhHzJtw0=/132x132/center/top/filters:format(webp)/2010/08/GettyImages-480798772.jpg", "https://vz.cnwimg.com/wp-content/uploads/2009/12/GettyImages-168378637.jpg?x46379", "https://vz.cnwimg.com/thm/Y14fttV9jls9mxFLuNAHJTnNWTE=/132x132/center/top/filters:format(webp)/2019/10/denzel-washington-1.jpg", "https://vz.cnwimg.com/thm/yboGsO77E1kQwELLmrwRZv_4RmE=/132x132/center/top/filters:format(webp)/2017/02/GettyImages-528215436.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/thm/AiM9m3Ec-0WxMj7zO8Vwcv3FemY=/132x132/center/top/filters:format(webp)/2020/04/enrique.jpg", "https://vz.cnwimg.com/thm/lt1abKKVHSBtY-US0k9GLU9MTmM=/132x132/center/top/filters:format(webp)/2009/09/Brad-Pitt.jpg", "https://vz.cnwimg.com/thm/LIp_AFJLp0k-BsWEKR30GewslRs=/132x132/center/top/filters:format(webp)/2014/12/GettyImages-459333172.jpg", "https://vz.cnwimg.com/thm/mDOEIv96GO5CYaDmwbPOsRHi8cE=/132x132/center/top/filters:format(webp)/2021/07/luis-fonsi.png", "https://vz.cnwimg.com/thm/IoWqGPmFDjvC6iTqcDsspXBuxqo=/132x132/center/top/filters:format(webp)/2018/03/GettyImages-821622848.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/thm/dXuAPIEBU--L_kRib4u0nSzjUtE=/132x132/center/top/filters:format(webp)/2020/04/Megan-Fox.jpg", "https://vz.cnwimg.com/thm/atsCV2yUGigUxnL53ji9iZWeXFw=/132x132/center/top/filters:format(webp)/2010/05/Chayanne.jpg", "https://vz.cnwimg.com/thm/lY3-oCS-xIdiqDaOi1qHd6UaTjg=/132x132/center/top/filters:format(webp)/2009/09/Cristiano-Ronaldo.jpg", "https://vz.cnwimg.com/thm/eHLH5vjZkWmbKm96DR62yHTgXrE=/600x300/center/top/filters:format(webp)/2009/12/GettyImages-168378637.jpg", "https://vz.cnwimg.com/thm/95i5RI1LWkjHyyoolMeto-z_WeU=/132x132/center/top/filters:format(webp)/2020/01/lopez3.jpg", "https://vz.cnwimg.com/thm/KFAqJ9F4o80l6an2fe78-0jw28s=/132x132/center/top/filters:format(webp)/2019/04/rr.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2009/12/GettyImages-168378637.jpg?x46379", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/singers/ricky-martin-net-worth/", "title": "Ricky Martin Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Ricky Martin is a Puerto Rican pop musician, actor, and author who has a net worth of $130 million dollars.", "slick": {"wpversion": "3.0.1", "wppostid": 2081, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2009/12/GettyImages-168378637.jpg?x46379", "group": "post", "category": "singers:Singers"}, ";": "richest-celebrities:Richest Celebrities", "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "cnw": {"wppostid": 2081}, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Ricky Martin Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/singers/ricky-martin-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2009/12/GettyImages-168378637.jpg?x46379", "site_name": "Celebrity Net Worth", "description": "What is Ricky Martin's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2024-06-14T01:43:16+00:00", "published_time": "2020-03-02T04:59:45+00:00", "section": "Singers", "tag": "ricky martin salary"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2009/12/GettyImages-168378637.jpg?x46379", "title": "Ricky Martin Net Worth", "description": "Ricky Martin is a Puerto Rican pop musician, actor, and author who has a net worth of $130 million dollars."}}, "movies": [], "publish_date": 1583125185.0, "source": "https://www.celebritynetworth.com", "summary": ""}