{"url": "www.thehollywoodgossip.com/2018/05/kendall-jenner-pregnant-with-blake-griffins-baby/", "text": "Reading Time: 3 minutes\n\nLast week, we discussed the incendiary report from an industry insider that says that Kendall Jenner is pregnant and that she’s been canceling modeling gigs to hide the baby bump.\n\nKendall is the only one of Kris Jenner’s children to have not yet had a child, so this idea has a lot of people very excited.\n\nBut is she pregnant? Let’s take a look at the evidence.\n\nReportedly, during a call to set up a modeling shoot, it was confided by a photographer that Kendall Jenner is not modeling at the moment.\n\nShe’s a supermodel who makes, like, $20 million a year from doing shoots. So that might strike people as odd.\n\nBut the photographer reportedly claimed — on a private call — that Kendall is taking this quiet leave of absence because she is pregnant.\n\nWe have stressed from the beginning that this is not confirmed. It’s not even a firsthand report of hearing the statement.\n\nBut … some people have pointed out that probably is how something like this would leak.\n\nAs in, not from someone who could be directly traced to the knowledge, but from someone who heard it from a friend or coworker.\n\nIf Kendall really is pregnant, it is widely expected that the baby daddy would be Blake Griffin.\n\n(Getty)\n\nBut many who may hope to see Kendall and Blake produce yet another beautiful grandchild for Kris Jenner to love and monetize, Gossip Cop reports that they have a statement on record from Kendall’s representative.\n\n\"Kendall is not pregnant.\"\n\nThat was crushing for many to hear.\n\nAt the same time, some wonder if they should trust an official statement.\n\nAfter all, last year, both Kylie and Khloe were bizarrely coy about their pregnancies for months.\n\nWhile it is totally their right to tell people about their bodies if and when they see fit, a number of fans feels that they are less willing to trust official statements as a result.\n\nSo let’s look at some clues, instead.\n\nJust a few weeks ago, Kendall Jenner shared this photo.\n\nIn the caption, she writes: \"The party Gods got me.\"\n\nWe don’t think that she’s announcing to her fans that she was kidnapped by Dionysus and has only just returned from an otherworldly realm of merrymaking.\n\nInstead, and coupled with the photo, this was widely interpreted as an announcement that she was suffering from a major hangover.\n\nHey, it happens.\n\nNaturally, if Kendall were pregnant, one would absolutely hope that she is not drinking anything, let alone drinking enough to give herself a hangover.\n\n(Fetal Alcohol Syndrome is no joke, folks)\n\nAdditionally, Kendall and Blake have been spotted together, out and about.\n\nThat in and of itself has done nothing to quell rumors that they’re having a child together.\n\nBut those who have seen Kendall have noted that, just as in the recent photos of her that we have pointed out, Kendall is showing no sign of a baby bump.\n\nAdditionally, Kendall has stated recently — what with all of the chatter about Kylie giving birth to sweet baby Stormi — that she doesn’t plan on having any kids until her late twenties.\n\nShe is, again, only 22. This is a very sensible plan on her part.\n\nSo it looks like her flat tummy will be here for years to come.\n\nWe do find ourselves wondering where the claim that she’s pregnant originated.\n\nDid someone make an offhand remark or a poorly phrased joke that others took seriously?\n\nWe may never know.\n\nWe can only imagine how amazing it would be if Kendall were pregnant with Blake Griffin’s baby.\n\nAnd we have the perfect name suggestion for her child.\n\nPepsi Griffin.", "images": ["https://cdn.thehollywoodgossip.com/uploads/2025/11/GettyImages-2234157895-80x80.jpg", "https://cdn.thehollywoodgossip.com/uploads/2025/11/GettyImages-692110730-80x80.jpg", "https://cdn.thehollywoodgossip.com/uploads/2025/11/Screenshot-2025-11-17-at-11.00.41-AM-80x80.png", "https://cdn.thehollywoodgossip.com/uploads/2025/11/1117_tekashi6ix9ine_header-80x80.jpg", "https://cdn.thehollywoodgossip.com/uploads/2018/05/janelle-monae-on-the-mic-320x240.jpg", "http://www.thehollywoodgossip.com/wp-content/uploads/2017/12/kendall-jenner-possible-bump.png", "http://cdn.thehollywoodgossip.com/uploads/2017/10/blake-griffin-rocks-a-suit-620x1024.jpg", "https://cdn.thehollywoodgossip.com/uploads/2022/02/thg-logo.png", "https://cdn.thehollywoodgossip.com/uploads/2025/11/1117_justinbaldoni_header-80x80.jpg", "https://cdn.thehollywoodgossip.com/uploads/2025/11/Screenshot-2025-11-17-at-2.29.38-PM-80x80.png", "https://cdn.thehollywoodgossip.com/uploads/2025/11/Screenshot-2025-11-17-at-9.24.12-AM-80x80.png", "https://cdn.thehollywoodgossip.com/uploads/2025/08/0826_meghanmarkle_01-Cropped-80x80.png"], "top_img": "http://www.thehollywoodgossip.com/wp-content/uploads/2017/12/kendall-jenner-possible-bump.png", "keywords": [], "authors": ["Simon Delott"], "canonical_link": "https://www.thehollywoodgossip.com/2018/05/kendall-jenner-pregnant-with-blake-griffins-baby/", "title": "Kendall Jenner: Pregnant with Blake Griffin's Baby?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Kendall Jenner: Pregnant with Blake Griffin’s Baby?", "description": "Last week, we discussed the incendiary report from an industry insider that says that Kendall Jenner is pregnant and that she's been canceling modeling gigs to", "url": "https://www.thehollywoodgossip.com/2018/05/kendall-jenner-pregnant-with-blake-griffins-baby/", "site_name": "The Hollywood Gossip", "updated_time": "2024-05-28T13:08:30+00:00", "image": "http://www.thehollywoodgossip.com/wp-content/uploads/2017/12/kendall-jenner-possible-bump.png", "article": {"published_time": "2018-05-07 15:16:25", "modified_time": "2024-05-28 13:08:30"}}, "article": {"published_time": "2018-05-07T15:16:25+00:00", "modified_time": "2024-05-28T13:08:30+00:00"}, "twitter": {"card": "summary", "title": "Kendall Jenner: Pregnant with Blake Griffin’s Baby?", "description": "Last week, we discussed the incendiary report from an industry insider that says that Kendall Jenner is pregnant and that she's been canceling modeling gigs to", "image": "http://www.thehollywoodgossip.com/wp-content/uploads/2017/12/kendall-jenner-possible-bump.png", "label1": "Written by", "data1": "Simon Delott", "label2": "Est. reading time", "data2": "3 minutes"}, "author": "Simon Delott", "generator": "WordPress 6.8.3", "theme-color": "#000000", "msapplication-TileImage": "https://cdn.thehollywoodgossip.com/uploads/2024/07/cropped-THG-LOGO-270x270.jpg"}, "movies": [], "publish_date": 1525706185.0, "source": "http://www.thehollywoodgossip.com", "summary": ""}