{"url": "www.houstonpress.com/music/review-jay-z-reminds-us-hes-the-goat-at-houston-4-44-stop-9947539", "text": "Jay-Z: 29 songs for Houston. Credit: Photo by Marco Torres\n\n\n\nThe 4:44 Tour\n\nJay-Z, Vic Mensa\n\nToyota Center\n\nNovember 8, 2017\n\nExpecting Jay-Z to be defiant, even at 47 is akin to asking a known superstar to go out and score 30 on a given night. It’s what Jay-Z does. It’s what he has done for the better part of two decades, both on stage and in music.\n\nThe 4:44 Tour, his latest North American light jog through the classics offers, maybe for the first time, a bit of bite and added emphasis to prove something to the world. There have been numerous reports of the tour not selling out, that it isn’t meeting expectations or worse, is an abject failure solely because you can find a few decent seats on Groupon or a third-party reseller. None of those issues came into Toyota Center on Wednesday night. Well, there was the moment where Hov caught a glimpse of a man who brought his dog to the concert, but we need to build up to that moment first.\n\nJay-Z performed 29 songs on Wednesday, which allowed for 29 different thoughts to run through my head at any given moment. Instead of fully recapping how Jay-Z, one of music’s interesting yet straightforward best live performers managed to captivate an audience for damn near two hours, I’ll jog through 15 separate thoughts I had during the set.\n\nTHOUGHT ONE: Jay-Z really can’t grow a proper mustache. There’s a rule in life that you can’t trust anyone who can’t grow facial hair, and somehow Jay-Z fits that bill and yet he doesn’t. Somebody trusted Jay-Z with 92 bricks, and he lost them, but somehow he didn’t die of it which makes him close to immortal. Or a Highlander.\n\nTHOUGHT TWO: “Kill Jay-Z” is a perfect tone-setter for this show. One, because four revolving boards are showing old Jay-Z videos and each of the still frames are getting set on fire. All of the doom and gloom, breaking up with Kanye, loving Blue and Beyonce plays out on these boards. FYI, he still loves Kanye to death and if I were a betting man, “Otis” and “Runaway” are Jay-Z’s two favorite Kanye West videos.\n\nTHOUGHT THREE: LeBron James and the Cleveland Cavaliers showed up, ahead of their scheduled matchup with the Rockets on Thursday. Does Jay go harder when LeBron’s in attendance? Cause he went super hard on stage, almost as if he were still dissing Deshawn Stevenson and Soulja Boy on behalf of the NBA’s best player.\n\nTHOUGHT FOUR: Yes, that was a thing that happened in 2007. Jay-Z is as petty as I am when it comes to friends and that makes him a super best friend unless you cross him.\n\nTHOUGHT FIVE: Is it customary that when you go to a Jay-Z show, you have to wear a Yankees fitted? Or that you have to break out your Timbaland boots? Scratch that, when the weather gets anywhere near 59 degrees in Houston, those Timbs are coming out.\n\nTHOUGHT SIX: Jay-Z has maybe three distinct national anthem style records. Those are the significant arena records that are gritty as hell and separate real Jay-Z fans from the guys who latched on with “Empire State of Mind.” “PSA” from 2003’s The Black Album? A definite national anthem. “U Don’t Know” from 2001’s The Blueprint? A full-on national anthem with a simple refrain: “I will not lose, ever.” The third is “Run This Town” from 2009’s The Blueprint 3. The build-up to that song immediately makes you believe you could take on Andre The Giant with your bare hands and survive. All three were performed, almost in near succession to one another.\n\nTHOUGHT SEVEN: When Jay-Z feels like really getting excited, he makes sure the crowd lights are blood red. You know he’s performing the entire song when the lights go red.\n\nTHOUGHT EIGHT: Thank God he cut “Forever Young” out of this setlist. It’s a cheesy closer. “Numb / Encore” in honor of the late Chester Bennington? A perfect closer. Never go “Forever Young.”\n\nTHOUGHT NINE: Hearing “Allure,” his goodbye to the drug game song from The Black Album mixed in with a verse from “Dead Presidents II,” one of his favorite hustler records is a top 5 Jay-Z concert moment for me, and I don’t care who says otherwise. Fight the guy who messed over your chopped cheese sandwich.\n\nTHOUGHT TEN: There are zero guests for the 4:44 Tour. It’s mostly Jay-Z, in a one-person show getting a lot of feelings off his chest. Even the cues where you’d think a guest would show up like Bun B for “Big Pimpin” or Beyoncé just to send people on a higher level for “Family Feud” were absent. It was a man, on a self-created mountain, performing with a band underneath him.\n\nTHOUGHT ELEVEN: “4:44” as a song is a demonstrative exercise. There’s so much to unpack it outside of Jay admitting that he cheated and that he cannot perform the song while directly looking at the audience. The same guy who wrote songs about shooting his brother, selling drugs to his friends and leaving condoms in the baby seat of the mother that once dated his most significant rival (Nas) is scared to look a crowd in the eye and admitted he messed up. It’s riveting theater.\n\nTHOUGHT TWELVE: You can’t go to a Jay-Z show and not break out rap hands. It’s an ordained right from watching Jay-Z perform for over 20 years. You know the mannerisms, you know how it’s going to go, and you especially do that when it’s time for your moment with your song, you’re going to let out a roar and try to emulate the guy on stage. The biggest fear, however, with a Jay-Z show in 2017 is that you can apparently figure out who is a diehard Hov stan since 1996 and who caught on real late and is picky about their Jay-Z fandom. Don’t trust people who are picky about their Jay-Z fandom. Don’t believe the people who tug at their jackets a bit tight when you’re rapping “Where I’m From” or “Lucifer” or the Hov deep cuts. Don’t trust people who think that “.38 revolve like the sun around the Earth” line from “It’s Hot” is fantastic. Why? Because a real Jay-Z fan will tell you that line was terrible, that’s why.\n\nTHOUGHT THIRTEEN: Right before “99 Problems,” Jay-Z singled out a guy who decided to make history. Jay-Z has seen plenty of shows and tours in his life. He’s never seen someone bring a dog, without headphones (!) to a concert of his. “I want to see him recognized and shouted out for his dedication,” Hov said. No one decided to ask why the man brought his dog, or how he even got the dog past Toyota Center security. We just know the dog, and the man were there. About as random as the man who dressed in full Astros regalia at the parade crowd surfing.\n\nTHOUGHT FOURTEEN: A catalog as dense as Jay’s would lead to a few questionable moments on the setlist. Somehow, he spread out the list to touch nearly every era of his career. There were Black Album cuts I thought he would never perform live again (“Allure”). There was even an emphasis on some of his Magna Carta Holy Grail work with “Beach Is Better,” though I’m sure it was tossed in there for the Beyoncé line alone, this being Houston after all. The one weird quirk? “99 Problems” was the only song that had closed-captioned for the hearing impaired. Did Jay-Z individually do this because he wanted everyone in the audience to get his point? Did he do this specifically for the guy who brought his dog? We need answers.\n\n\n\nTHOUGHT FIFTEEN: Meek Mill is on Jay-Z’s mind. Tuesday night in Dallas, he spoke out about the Philadelphia rapper’s latest incarceration due to riding a dirt bike in New York City. The judge considered it a probation violation since riding dirt bikes in NYC is illegal and sentenced Meek to serve two to four years in state prison in Pennsylvania. “He’s been on probation for 11 years,” Hov said to the shock of the crowd. “If that ain’t modern day slavery and fuckery, I don’t know what is. I’m not talking about a black and white issue; I’m talking about a human issue.” Human issues are paramount these days, and with Hov, every problem becomes more considerable to speak on. The prison-industrial complex, mental health, therapy? All of it is big. Jay-Z is like Ric Flair in that way. On stage and in front of a camera? He’s Jay-Z. When he’s off it? He’s Shawn Carter, still trying to navigate these spaces where Jay-Z would be comfortable.\n\nIt’s a Comfy Hov world now.\n\n\n\nSO HOW ABOUT THE OPENER: When I spoke to Vic Mensa ahead of this show, he told me that performing a record like “We Could Be Free” made him get lost in the lyrics and the message. As he prepared himself to kick off the 4:44 Tour, he kept that word in mind.\n\nMensa’s set uses that same circular stage that Jay-Z’s does but the Chicago rapper condenses his movement far more than Hov does. Songs like “16 Shots” get reflective lights and Mensa clutching a mike stand as if the drums and bass are hitting him dead in the chest. In other moments, such as “OMG,” he stands at attention, and for a twist, he put Paul Wall’s “Sittin Sidewayz” and UGK and OutKast’s “International Players Anthem” underneath him to make him lift higher.\n\nClad in a jacket that was half-denim, half tribute to Michael Jackson’s “Rock With You” video, Mensa used up a solid 30 minutes to tell his story. There were the three sides to a story narrative of “Heaven On Earth,” where he discussed his friend getting killed through his eyes, the eyes of his killer and the eyes of his friend wishing him success. He discussed losing love with “Homewrecker” and made sure to dedicate “We Could Be Free” to those who lost their lives to police violence and also to the 26 men, women and children who lost their lives in Sutherland Springs last Sunday. Everything was on Mensa’s mind on Wednesday, and in a controlled fury, all of his thoughts spilled out. For a kicker? Malik Yusef, the Chicago poet, decided to go all-in on a poem celebrating Houston’s triumph through the pain following Hurricane Harvey and the Astros winning the World Series.\n\nBefore Toyota Center became a home game for Jay-Z, it felt like a home away from home for Vic Mensa too.\n\nPERSONAL BIAS: Jay-Z has learned from Kanye in how to make a stage design a big damn deal in a one-man rap show.\n\nTHE CROWD: There are your reformed dope boys who took their ladies out. There were the women who didn’t mind the cold to show off and show out. There were Astros jerseys and hats everywhere, the city still awash in the pride of a championship touching this city’s lips for the first time in two decades. It was half-date night, half-stunt night in Toyota Center. Which is probably the only way a Jay-Z concert in 2017 can go.\n\nOVERHEARD IN THE CROWD: “I thought you didn’t like the Yankees!”\n\nRANDOM NOTEBOOK DUMP: Moments after the show ended and the drive home began, I realized that all of the talks about the tour being a failure due to it not being as in-demand a show was bull. There’s no way you can have a bad show with your favorite artist unless that artist is late as hell or skips out with plenty of time left on the clock. Jay-Z could have gone until 1 performing the hits and nobody would have minded. Well, except those who had to work the next morning.\n\nVIC MENSA SETLIST\n\nDidn’t I (Say I Didn’t)\n\nU Mad\n\nMemories On 47th St.\n\n16 Shots\n\nHomewrecker\n\nRollin’ Like a Stoner\n\nOMG\n\nHeaven On Earth\n\nDown For Some Ignorance\n\nWings\n\nThe Fire Next Time\n\nWe Could Be Free\n\nRage\n\nJAY-Z SETLIST\n\nKill Jay Z\n\nNo Church in the Wild\n\nCan I Live\n\nLucifer\n\nD’evils\n\nHeart of the City (Ain’t No Love)\n\nRun This Town\n\nFuckwithmeyouknowigotit\n\nBeach Is Better\n\n4:44\n\nBam\n\nJigga My Nigga\n\nIzzo (H.O.V.A.)\n\nDirt Off Your Shoulder\n\nOn to the Next One\n\nI Just Wanna Love U (Give It 2 Me)\n\nPublic Service Announcement\n\nFamily Feud\n\nU Don’t Know\n\n99 Problems\n\nBig Pimpin’\n\nAllure\n\nMoonlight\n\nThe Story of O.J.\n\nNiggas in Paris\n\nWhere I’m From\n\nEmpire State of Mind\n\nHard Knock Life (Ghetto Anthem)\n\nSmile\n\nNumb / Encore\n\nThis article appears in Nov 2-8, 2017.", "images": ["https://i0.wp.com/www.houstonpress.com/wp-content/uploads/2025/11/Edita-Sage-Bitner.png?fit=1200%2C857&ssl=1", "https://i0.wp.com/www.houstonpress.com/wp-content/uploads/2017/11/hou_mus_20171108_jayz_marcotorres_0001_800.webp.webp?fit=780%2C459&ssl=1", "https://www.houstonpress.com/wp-content/uploads/2025/08/houston-press-logo-copy.png", "https://i0.wp.com/www.houstonpress.com/wp-content/uploads/2025/11/No-Kings.jpg?fit=1200%2C900&ssl=1", "https://www.houstonpress.com/wp-content/uploads/2025/07/Caldwell__Brandon_Houston-80x80.png", "https://i0.wp.com/www.houstonpress.com/wp-content/uploads/2022/01/shutterstock_420317140.webp.webp?resize=780%2C520&ssl=1", "https://i0.wp.com/www.houstonpress.com/wp-content/uploads/2025/08/houston-press-logo.png?fit=2462%2C595&ssl=1", "https://i0.wp.com/www.houstonpress.com/wp-content/uploads/2025/08/tacos_by_becca_wright__13_.webp?resize=1200%2C900&ssl=1", "https://i0.wp.com/www.houstonpress.com/wp-content/uploads/2017/11/hou_mus_20171108_jayz_marcotorres_0001_800.webp.webp?resize=780%2C459&ssl=1", "https://www.houstonpress.com/wp-content/uploads/2025/07/Caldwell__Brandon_Houston-96x96.png", "https://i0.wp.com/www.houstonpress.com/wp-content/uploads/2025/11/etoile2-5818-Thanksgiving-Dinner-Plate.jpg?fit=1200%2C800&ssl=1", "https://i0.wp.com/www.houstonpress.com/wp-content/uploads/2017/11/hou_mus_20171108_jayz_marcotorres_0001_800.webp.webp?fit=800%2C471&ssl=1", "https://i0.wp.com/www.houstonpress.com/wp-content/uploads/2025/11/CongressmanAlGreen_HarrisCountyDemocraticRally_GavinNewsom_11082025_HTX_7RV01553-2.jpg?resize=1200%2C900&ssl=1", "https://i0.wp.com/www.houstonpress.com/wp-content/uploads/2025/11/Lazy-Lane-tablespread-by-Brian-Kennedy.jpeg?fit=1024%2C682&ssl=1", "https://i0.wp.com/www.houstonpress.com/wp-content/uploads/2025/10/Emma-Jane-offers-traditional-tea-service-with-a-glass-of-bubbles-1-scaled.jpg?resize=1200%2C900&ssl=1"], "top_img": "https://i0.wp.com/www.houstonpress.com/wp-content/uploads/2017/11/hou_mus_20171108_jayz_marcotorres_0001_800.webp.webp?fit=800%2C471&ssl=1", "keywords": [], "authors": ["Brandon Caldwell", "More Brandon Caldwell", ".Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow", "Class", "Wp-Block-Co-Authors-Plus", "Display Inline", ".Wp-Block-Co-Authors-Plus-Avatar", "Where Img", "Height Auto Max-Width", "Vertical-Align Bottom .Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow .Wp-Block-Co-Authors-Plus-Avatar"], "canonical_link": "https://www.houstonpress.com/music/review-jay-z-reminds-us-hes-the-goat-at-houston-4-44-stop-9947539/", "title": "Review: Jay-Z Reminds Us He's The GOAT At Houston '4:44' Stop", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Jay-Z brought his '4:44' Tour to Houston where a sold-out crowd got to witness the greatest rapper of all-time in his element and in his bag for two hours and more.", "og": {"locale": "en_US", "type": "article", "title": "Review: Jay-Z Reminds Us He's The GOAT At Houston '4:44' Stop", "description": "Jay-Z brought his '4:44' Tour to Houston where a sold-out crowd got to witness the greatest rapper of all-time in his element and in his bag for two hours and more.", "url": "https://www.houstonpress.com/music/review-jay-z-reminds-us-hes-the-goat-at-houston-4-44-stop-9947539/", "site_name": "Houston Press", "image": {"identifier": "https://i0.wp.com/www.houstonpress.com/wp-content/uploads/2017/11/hou_mus_20171108_jayz_marcotorres_0001_800.webp.webp?fit=800%2C471&ssl=1", "width": 800, "height": 471, "type": "image/webp"}}, "article": {"publisher": "https://www.facebook.com/HoustonPress", "published_time": "2017-11-09T15:51:13+00:00", "modified_time": "2017-11-09T16:12:36+00:00"}, "author": "Brandon Caldwell", "twitter": {"card": "summary_large_image", "creator": "@HoustonPress", "site": "@HoustonPress", "label1": "Written by", "data1": "Brandon Caldwell", "label2": "Est. reading time", "data2": "10 minutes"}, "generator": "Site Kit by Google 1.162.1", "theme-color": "#fff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "HoustonPress", "application-name": "HoustonPress", "msapplication-TileImage": "https://i0.wp.com/www.houstonpress.com/wp-content/uploads/2025/09/cropped-houston-press-icon-scaled-1.png?fit=270%2C270&ssl=1"}, "movies": [], "publish_date": 1510242673.0, "source": "http://www.houstonpress.com", "summary": ""}