{"url": "https://www.cosmopolitan.com/entertainment/movies/a13427671/fifty-shades-freed-trailer-moments-climax/", "text": "11 min read\n\nWhen you’re in the mood to watch something sexy but don’t really feel like going down a romantic comedy rabbit hole, consider opting for something…kinkier, yes? Enter: BDSM movies—the kind that’ll scratch your itch for cinematic eroticism, with a steaming hot side of actual plot-driven storylines. (Ahem, perfect for those nights when it’s just you and your vibrator.) And while, yes, it’s totally normal to immediately think of Fifty Shades of Grey as the default kink film of our generation, trust us when we say it’s just the tip of the iceberg. There are plenty of kinky options, from French art house films to historical masterpieces starring your favorite celebs, and we rounded up a comprehensive list of our faves for your literal viewing pleasure.\n\nNow, disclaimer: Not all of these films depict BDSM (bondage and discipline, dominance and submission , sadism and masochism) in a sex-educator approved way. Actually practicing BDSM goes hand-in-hand with open and honest communication, clear consent, safety precautions, trusted partners, and more—all things that aren’t necessarily top-of-mind when it comes to making Hollywood movie magic. So if high quality kink education is what you seek, check out this beginner’s guide to BDSM . But if a horny, kinky good time is what you came for, then you’re in the right place.\n\nWhether you're planning a movie date night with the hope of getting spanked, a sexy film to screen at your next girl’s night, or an excuse to stay home with your vibrator on the couch, look no further than this list of the very best BDSM movies out there.\n\n1. The Fifty Shades Trilogy\n\n(Okay, yeah, so we just talked some ish on these ones. But look, we couldn’t not include them.) Chances are you’ve already seen Ana and Christian’s love story play out on-screen, and while it might not be the most realistic depiction of a BDSM relationship, it sparked mainstream viewers’ curiosity about the lifestyle. From shower sex to bondage to the use of Ben Wa balls, the scenes will forever live rent free in my mind. No matter how many times you’ve indulged, the soundtrack still slaps, and the leads’ chemistry still sizzles.\n\n\n\n2. Crash\n\nis based on a 1973 book of the same name by author J.G. Ballard, and follows film producer James, who's in an open marriage with his wife Catherine. Their sex life hits a bit of a lull and they're mostly aroused by hearing about each other's encounters with other people...until James survives a car crash and connects with a group of car crash fetishists. Yep—a group of folks who re-create car crashes and feign injuries all for the sake of pure hot arousal.\n\nCrash\n\n3. Sanctuary\n\nChristopher Abbott stars as Hal, a man with a humiliation kink who has degradation sessions with a dominatrix named Rebecca (played by Margaret Qualley). But Hal becomes CEO at his company and tries to end his arrangement with Rebecca to protect his job, and Rebecca...well, let's just say she does not handle it well.\n\n\n\n4. Belle de Jour\n\nAs one of Luis Buñuel’s most influential works, you’ll not only feel very aroused while watching Belle de Jour, but you’ll feel cultured as well. The eternally sexy Catherine Deneuve plays Séverine Serizy, a woman in a conventional marriage who craves sexual exploration. So what does she do? She gets in contact with the madam of a high-class brothel and begins living a double life as a sex worker. While her hubs is away, Séverine explores the world of bondage and domination with people who definitely aren’t her S.O.\n\nRelated Story Just a Bunch of BDSM Books to Read Right Now\n\n5. 9 1/2 Weeks\n\nSay hello to one of the most iconic movies about sexual obsession ever made. The '80s film starring Mickey Rourke and Kim Basinger follows a Wall Street trader and an art gallerist who have an instant connection that quickly turns very emotional and sexual. The flick touches upon everything from power and control, to food play, to public masturbation, to learning how to define your personal boundaries. And if that doesn’t get you going, the retro style will definitely do the job.\n\n6. The Secretary\n\nBefore Christian Grey and his red room of pain, there was actually another Mr. Grey whose BDSM desires were even more defined. The 2002 film starring Maggie Gyllenhaal and James Spader was one of the first mainstream movies to introduce everyday viewers to the lifestyle. What sets The Secretary apart — aside from the legendary cast — is it’s impressive blend of humor with hotness. While many of the other movies on this list are a little more serious, this steamy classic showcases sadomasochistic activities in ways that’ll have you giggling between your orgasms.\n\n7. Love and Leashes\n\nTwo colleagues dive into a nasty agreement where they explore consensual kink, transforming their work relationship into one of intimate partnership. This charming romantic comedy, hailing from South Korea and available on Netflix, is directed by Park Hyun-jin and features performances by Seohyun and Lee Jun-young. The story unfolds around Ji-hoo, a seemingly perfect individual with clandestine BDSM interests, and Ji-woo, a boss babe PR team member who discovers his secret (she becomes his domme). This film strikes the perfect balance of sweet and sultry, making it an excellent choice for a fun-filled girl's night or a playful yet provocative movie date.\n\nWatch Here\n\n8. Mapplethorpe, the Director’s Cut\n\nThis film chronicles the life of the infamous, and perhaps still unmatched, photographer Robert Mapplethorpe, tracing his rise to fame in the 1970s through his tragically young death in 1989. It features Matt Smith, who you'll recognize from The Crown, as Mapplethorpe and Marianne Rendón portraying Patti Smith, his lifelong friend, partner, and the poet and musician whom Taylor Swift sings about on TTPD. The movie explores the (kinky) legacy of Mapplethorpe, who, through his photos, documented gay sex, bondage, and even Satanism in striking black-and-white images. The film isn't just kinky; it's a super chic history lesson on one of the most important figures in kink history.\n\n9. La Piscine (The Swimming Pool)\n\nIf French art films are your thing (although this one’s in English) look no further than this super sexy psychological thriller. Set next to, you guessed it, a swimming pool during a steamy summer on the French Riviera, it’s highly erotic and super artsy, loaded with fraught sexual jealousy (and plenty of butt lashings for anyone into impact play ). JFYI, there is another kinky film called The Swimming Pool that came out in 2003, but this is the OG.\n\n10. Kinky\n\nKinky is a 2018 erotic romantic thriller directed by Jean-Claude La Marre and starring Robert Ri'chard, Gary Dourdan, and Vivica A. Fox. Fox plays one of the best surgeons in the world, but, alas, like so many renowned women, dating isn’t her area of expertise. So, she makes up a fake relationship to get out of going out with her pestering coworker. But then, enter scene: gorgeous, kinky, and, of course, problematic billionaire. She actually starts dating him! The BDSM commences, complete with a plot line that involves the FBI. Now, the film doesn't exactly have the best reviews, but between Vivica A. Fox looking absolutely smoking and the BDSM billionaire trope, do you really care?\n\n11. After Fall, Winter\n\nYou've been warned: After Fall, Winter is a little heavy but also, honestly, relatable and poignantly sexy. It follows the suicidal writer Michael (Eric Schaeffer), who is in massive debt, so he leaves New York to find a fresh start in Paris. He finds it in the nurse Sophie (Lizzie Brocheré), who cares for a little girl, Anais, who is dying of leukemia. However, Sophie has a second job...as a dominatrix. Sophie and Michael enter an obsessive, combative, and passionate relationship loaded with epic sex scenes. If you're looking for something sexy, dark, and intellectual, consider your date night planned.\n\n12. Dogs Don’t Wear Pants\n\nOkay, so trigger warning: Even the trailer is pretty gruesome. But, as the film itself says, “I don't like ordinary stuff.” If you relate, then this Finnish erotic black comedy is sure to transform any night into a major conversation piece. The red-lit film follows a heart surgeon who is mourning the death of his wife and finally feels alive again thanks to a dominatrix (there's lots and lots of choking in this film, JFYI). It's pretty hardcore, so stick with Kinky if you want something light. As Rotten Tomatoes reads: “Dogs Don't Wear Pants will be too intense for many viewers, but for those who can take the punishment, there's pleasure in this stark drama's pain.”\n\n13. Hellraiser\n\n\"What's your pleasure,\" asks this iconic 1987 horror film—which, yes, is a horror film, but doesn’t get enough credit for also moving BDSM mainstream. The movie starts with the hedonist Frank Cotton, who uses a puzzle to unleash another world of underworld pleasure, summoning the Cenobites, a group of extra-dimensional, sadomasochistic creatures who can't tell the difference between pain and pleasure. It's gory, and scary, but also...very kinky.\n\nWatch Here\n\n14. 365 Days: This Day\n\nThe 365 Days franchise, based on the novel trilogy by Blanka Lipińska and starring Anna-Maria Sieklucka and Michele Morrone, doesn’t exactly have great reviews, we’ll be honest. But if you’re looking for a fun, kinky, erotic thriller that’s still blowing up Netflix (and/or something lighter than some of the other titles on this list) you’ve found a winner. Following the 2020 Polish film 365 Days, Netflix released 365 Days: This Day in April of 2022, followed by The Next 365 Days in August of 2022. If you're into dominant Sicilian mobsters, you'll be over the moon.\n\nWatch Here\n\n15. Venus In Fur\n\nIf you’re looking for a salacious film that just begs to be discussed, Venus In Fur by Roman Polanski will leave you feeling some type of way. The 2013 erotic French drama is based on the Tony Award winning play by the same name, and is about a writer/director named Thomas who’s casting the lead role for his upcoming play about sexual domination and submission. When an actress named Vanda Jordan arrives on the scene just as Thomas is closing up shop, she does everything she can to convince him she’s the right person for the role. The two engage in different scenes from the play, acting out various sexual situations while arguing about BDSM. It’s somehow funny, empowering, and sexy, in case you weren’t yet convinced.\n\nRelated Story 22 Beginner-Friendly BDSM Toys\n\n16. The Notorious Bettie Page\n\nIt wouldn’t be a BDSM movie list without including the 2005 biographical drama about the, well, notorious pin-up model, Bettie Page. As the model who brought BDSM into the public light with her famed photos (she’d pose as both a dominatrix dishing out punishment and a submissive receiving it), her real life is fascinating, provocative, and oh-so mysterious. Be prepared: There’s a 100 percent chance you’ll have a crush on Gretchen Mol after watching her tease the masses.\n\n17. The Bitter Tears of Petra von Kant\n\nVisually stunning and sexually alluring, The Bitter Tears of Petra von Kant will take you on a mesmerizing adventure following a lesbian love triangle. Three women—one of whom is an infamous fashion designer—embark on an emotional tryst that takes place completely in von Kant’s artsy apartment. The all-female cast showcases sadistic and submissive expression all while exploring the complexities of human sexuality. And the fact that the sexual tension throughout is literally palpable, makes it all that more fun to watch.\n\n18. A Dangerous Method\n\nSpanking? An unlikely relationship? Keira Knightley in 19th century gowns? Check, check, check. Set around World War I, Knightly stars as a student of Dr. Carl Jung (Michael Fassbender) who associates pain with pleasure. After getting a nod of approval from his pal Sigmund Freud (Viggo Mortensen), Jung embarks on an affair with his student to learn more about human sexuality from a very, ahem, hands-on perspective. If you’re looking for some solid spanking, it doesn’t get much better than this, TBH.\n\n19. The Piano Teacher\n\nWarning: This isn’t a casual, happy-go-lucky watch—and if you’re not down to stomach some violence, you might want to skip this one. Basically, a 40-year-old piano teacher named Erika Kohut (Isabelle Huppert) lives with her controlling mother and has no outlet for her sexual fantasies, which includes voyeurism and masochism. After meeting a younger man named Walter (Benoît Magimel) at a piano recital, the two embark on an affair to satisfy Erika’s fantasies. While the film gets very uncomfortable to watch, it shines a harrowing light on sexual repression unlike anything you’ve ever seen.\n\nRelated Story 8 Things to Know About Aftercare for BDSM Sex\n\n20. Basic Instinct\n\nOdds are you’ve heard about the racy, 1992 film that shocked viewers with its famous “open leg scene,” but it’s not just Sharon Stone’s vag shot that makes Basic Instinct so seductive. Stone’s character, a bisexual author accused of murdering her boyfriend, seduces the lead detective in the murder case, Nick (Michael Douglas), and the two embark on a sexually charged affair that’s full of mind games and bondage. If you love thrillers and hot people going at it on screen, Basic Instinct is about to become your new favorite film.\n\n21. The Story of O\n\nYup, another French film is making the list because it’s clear the country knows how to make some seriously erotic movies. In this 1975 drama, a woman (Corinne Clery) who goes solely by “O” is taken by her boyf to a château in the French countryside. But this is no couple’s retreat… It’s a society that specializes and indulges in all types of sexual fetishes and acts. It’s there that O is trained to be a submissive and learns the ins and outs of bondage and sadomasochism.\n\n22. Nymphomaniac\n\nUp close and personal, Lars von Trier‘s follows a self-proclaimed sex-addict as she recounts her sexual explorations and experiences throughout her life. The star-studded films include celebs like Charlotte Gainsbourg, Shia LaBeouf, Christian Slater, Uma Thurman, and Willem Dafoe (just to name a few), and offer a raw (and very explicit) look at someone immersed in BDSM. Both volumes are on Amazon and make for one very sultry double feature.\n\n23. The Duke of Burgundy\n\nIt honestly doesn’t get much more BDSM than The Duke of Burgundy. The 2014 film centers around Cynthia and Evelyn, a dom/sub couple, and showcases their scenes and struggles as they try to find ways to quench each others’ thirsts. Evelyn—who cleans the house and acts like a maid—wants more punishment, while Cynthia kinda wants to chill out a little bit. The erotic film showcases a female dom (which isn’t as common) and will absolutely make you want to buy a new pair of knee-high boots ASAP.\n\n24. Tie Me Up! Tie Me Down!\n\nThe sheer fact that Antonio Banderas stars in Tie Me Up! Tie Me Down! is reason enough to watch, but after seeing him tie up the woman he thinks is his true love, you’ll totally feel the heat. The problem is, his true love is a porn star named Marina (Victoria Abril) who doesn’t feel the same way. The film explores all kinds of themes like bondage, control, and dominance, but somehow works to create one humorous and wonderfully raunchy movie.\n\n25. Quills\n\nWe love a good period piece. Add in some classic early 2000s Kate Winslet and you have yourself a must-watch. While you might not necessarily think the fictional retelling of sexual deviant Marquis de Sade’s life would make for a seriously erotic watch, it totally does. Taking place in an asylum, the film covers a wide variety of themes including pornography, mental illness, religion, and censorship. What’s more, the cast list alone is orgasm-inducing. In addition to Winslet, Joaquin Phoenix, Michael Caine, and Geoffrey Rush come together to create the scary, sexy, and spell-binding film you didn’t know your fantasies were missing.\n\n", "images": ["https://hips.hearstapps.com/hmg-prod/images/bdsm-aftercare-1578500064.png?crop=0.505xw:1.00xh;0.272xw,0.00338xh&resize=300:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/best-sex-toys-for-couple-67b78e0fcfd35.png?crop=0.5023255813953489xw:1xh;center,top&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523ffffff&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://hips.hearstapps.com/hmg-prod/images/18-best-clit-sucking-vibrators-6813a840241b5.jpg?crop=0.575xw:1.00xh;0.213xw,0&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/14-best-flavored-lubes-2-68cb2ec8c657f.jpg?crop=0.505xw:1.00xh;0.325xw,0&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/cosmopolitan/static/images/logos/network-logo.722abed.svg?primary=%2523ffffff", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/globe-simple-regular.e7f303c.svg", "https://hips.hearstapps.com/hmg-prod/images/long-distance-sex-toys-68d310b788178.jpg?crop=0.465xw:0.924xh;0.522xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/sex-bucket-list-68d1b80e474b2.jpg?crop=1.00xw:1.00xh;0,0&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/vidthumb/images/sex-toy-review-ep01-yt-thumbnail-1581551045.jpg?crop=1xw:1xh;center,top", "https://www.cosmopolitan.com/_assets/design-tokens/cosmopolitan/static/images/logos/logo.eca17dd.svg?primary=%2523000000", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/best-bdsm-books-1616614225.png?crop=0.601xw:1.00xh;0.399xw,0&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/sex-games-couples-688101313f51e.jpg?crop=0.505xw:1.00xh;0.224xw,0&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/bookmark-simple-regular.9d9d56b.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523000000&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/clock-regular.b2f2888.svg", "https://hips.hearstapps.com/hmg-prod/images/halloween-pickup-lines-2-68dd6a424ec91.png?crop=0.5023255813953489xw:1xh;center,top&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/best-bdsm-movies-66958797da9db.png?crop=0.502xw:1.00xh;0.386xw,0&resize=640:*", "https://hips.hearstapps.com/hmg-prod/images/16-best-butt-plugs-of-2024-68cdd07c9bad3.jpg?crop=0.5023255813953489xw:1xh;center,top&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/sexscenes-netflix-689f9f8a6d534.png?crop=0.505xw:1.00xh;0.391xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/confessay-beach-hookup-64e64e7c73f1e.png?crop=1.00xw:0.672xh;0,0.0962xh&resize=300:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/wand-vibes-1-66105dffbe448.png?crop=0.748xw:1.00xh;0.127xw,0&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://hips.hearstapps.com/hmg-prod/images/best-bdsm-movies-66958797da9db.png?crop=1xw:1xh;center,top&resize=1200:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/envelope-simple-regular.91a0134.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/2-1-6847404781675.jpg?crop=0.575xw:1.00xh;0.160xw,0&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/cosmopolitan/static/images/logos/logo.eca17dd.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/bdsm-test-1589928147.png?crop=0.5xw:1xh;center,top&resize=300:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/bdsm-switch-1605900714.png?crop=0.505xw:1.00xh;0.123xw,0&resize=300:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/pleasure-gel-65f09e0251d65.png?crop=0.899581589958159xw:1xh;center,top&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/caret-left-regular.5546078.svg", "https://hips.hearstapps.com/hmg-prod/images/bdsm-67e46b8bee3e2.png?crop=1.00xw:0.797xh;0,0&resize=300:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523000000&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/x-regular.e414d97.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/saved.ad81f1a.svg?primary=%2523ffffff"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/best-bdsm-movies-66958797da9db.png?crop=1xw:1xh;center,top&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.cosmopolitan.com/sex-love/a36148271/best-bdsm-movies/", "title": "Best Movies About BDSM to Stream Right Now", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "23 Best BDSM Movies - Best Movies About BDSM to Stream Right Now", "description": "If 'Fifty Shades of Grey' was the hottest thing you've ever seen in a movie, here are 22 other BDSM movies you'll enjoy.", "keywords": "bdsm movies, bdsm, kink, kinky movies, sexy movies", "theme-color": "#000000", "og": {"site_name": "Cosmopolitan", "title": "25 BDSM Movies That'll Make You Want to Get Kinky", "description": "If you thought Fifty Shades was intense, just wait.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/best-bdsm-movies-66958797da9db.png?crop=1xw:1xh;center,top&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.cosmopolitan.com/sex-love/a36148271/best-bdsm-movies/", "type": "article"}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "opinion": "false", "section": "Sex & Intimacy", "modified_time": "2024-07-15T20:34:00Z", "published_time": "2024-07-15T20:34:00Z"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "parsely-metadata": "{\"socialHeadline\":\"25 BDSM Movies That'll Make You Want to Get Kinky\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/best-bdsm-movies-66958797da9db.png?crop=0.502xw:1.00xh;0.386xw,0&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/best-bdsm-movies-66958797da9db.png?crop=1xw:1xh;center,top&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/best-bdsm-movies-66958797da9db.png?crop=0.502xw:1.00xh;0.386xw,0", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/best-bdsm-movies-66958797da9db.png?crop=1xw:1xh;center,top&resize=640:*", "card": "summary_large_image"}, "auto-publish": "never", "sailthru.excerpt": "When you’re in the mood to watch something sexy but don’t really feel like going down a romantic comedy rabbit hole, consider opting for something…kinkier, yes? Enter: BDSM movies—the kind that’ll scratch your itch for cinematic eroticism, with a steaming hot side of actual plot-driven storylines. (Ahem, perfect for those", "sailthru.tags": "sex-love,Sex & Intimacy,sex-love-selects,Sex & Love Selects,Cosmopolitan-US", "sailthru.date": "2024-07-15 20:34:00", "sailthru.socialtitle": "25 BDSM Movies That'll Make You Want to Get Kinky", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1721075640.0, "source": "https://www.cosmopolitan.com", "summary": ""}