{"url": "https://okmagazine.com/videos/bachelor-in-paradise-cast-finally-address-shows-sex-scandal/", "text": "The ‘Bachelor In Paradise’ Cast Finally Addresses The Show’s Sex Scandal & It's SERIOUSLY Intense\n\nArticle continues below advertisement\n\nArticle continues below advertisement\n\n“Before I can officially declare Paradise back open, I think it’s very important that we sit down and have a serious talk, all of us, about what happened, what didn’t happen, and what we all need to do to start this show together,” host Chris Harrison began the group discussion. Warner Bros. hired an outside firm to “look into everything that supposedly happened” and “they concluded that there was no evidence of misconduct by cast on the set,” he continued. “Do you trust that conclusion?”\n\nArticle continues below advertisement\n\nThe contestants then unanimously agreed and the conversation turned to their support for not only Corinne and DeMario, but also the show’s producers and staff. “I was confident that nothing happened between DeMario and Corinne that was bad,” said Raven Gates. “I trusted everyone that worked here, so I knew everything was going to be okay.” “I think there was a lot in the media regarding the producers as if they’re not our friends and they’re just using us to make us do things like we’re going to just do whatever they say,” Alex Woytkiw added.\n\nArticle continues below advertisement\n\nDerek Peth then jumped in saying, “I think there’s a weird perception that exists out there that we’re not in control of ourselves when we’re here. … We all know how realistic the friendships are with and among the cast. … We are here to make our own decisions and develop real relationships with everybody.” The cast then discussed how they believed race played a role in how the situation was handled.\n\nWant OK! each day? Sign up here!\n\nArticle continues below advertisement\n\n“I’m sensitive to it because I’m from the South and we have a stigma that seeing a white woman with a black man is wrong,” Raven said. “And that night, what happened wasn’t wrong. And so I was super empathetic with DeMario because it’s just another issue. Not only is consent important, but it’s also to get rid of the stigma that interracial couples can’t be or blaming African American men for crimes they didn’t commit.”\n\nArticle continues below advertisement\n\nJasmine Goode then added that she was thinking about the long-term repercussions for DeMario even after he was cleared of any wrongdoing. “I was just thinking the whole time: what if this happened to my brother?” she said. “He’s a great guy from the guy I met here … and I never felt he was aggressive with any of us. … I just hate that he’s going to have this image stuck with him for a while.” The group also discussed consent and slut shaming, with Chris leading the conversation as he asked the cast to define consent before telling everything to “keep consent in mind,” especially while in Paradise and “for forever.”\n\nArticle continues below advertisement\n\nChris then asked the group if they wanted to be there and if they agreed with the show resuming filming following the incident. “Knowing what we all know now, having lived through what we’ve all lived through and experienced — the shutdown, the scandal, the accusations, everything we’ve all endured — do each of you want to be here?” he asked. “If the majority of you feels like we should not continue, then we will not continue the show. Please be 100 percent honest because it’s important that we get this right. And so I want to literally go person-by-person,” Chris said before asking each contestant one-by-one if they wanted to continue the show.", "images": ["https://media.okmagazine.com/brand-img/gwn3vFiVn/1200x628/2017/08/bachelor-in-paradise-cast-finally-address-shows-sex-scandal-hero.jpg", "https://okmagazine.com/ok_logo_white.png", "https://okmagazine.com/ok_logo_black.png"], "top_img": "https://media.okmagazine.com/brand-img/gwn3vFiVn/1200x628/2017/08/bachelor-in-paradise-cast-finally-address-shows-sex-scandal-hero.jpg", "keywords": [], "authors": [], "canonical_link": "https://okmagazine.com/videos/bachelor-in-paradise-cast-finally-address-shows-sex-scandal/", "title": "The ‘Bachelor In Paradise’ Cast Finally Addresses The Show’s Sex Scandal & It's SERIOUSLY Intense", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "theme-color": "#000", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "description": "In the second half of Bachelor In Paradise’s two-night premiere, the BIP cast addressed the sexual encounter that occurred between DeMario", "keywords": "VIDEOS,NEWS", "og": {"site_name": "OK Magazine", "title": "The ‘Bachelor In Paradise’ Cast Finally Addresses The Show’s Sex Scandal & It's SERIOUSLY Intense", "url": "https://okmagazine.com/videos/bachelor-in-paradise-cast-finally-address-shows-sex-scandal/", "description": "In the second half of Bachelor In Paradise’s two-night premiere, the BIP cast addressed the sexual encounter that occurred between DeMario", "type": "article", "locale": "en_US", "image": {"identifier": "https://media.okmagazine.com/brand-img/gwn3vFiVn/1200x628/2017/08/bachelor-in-paradise-cast-finally-address-shows-sex-scandal-hero.jpg", "width": 1200, "height": 628, "type": "image/jpeg", "alt": "ABC&#8217;s &#8220;Bachelor in Paradise&#8221; &#8211; Season Four"}}, "article": {"published_time": "2017-08-16T18:35:37.000Z", "modified_time": "2017-08-16T19:17:02.000Z", "author": "Lauren Crawford"}, "twitter": {"site": "@okmagazine", "card": "summary_large_image", "title": "The ‘Bachelor In Paradise’ Cast Finally Addresses The Show’s Sex Scandal & It's SERIOUSLY Intense", "description": "In the second half of Bachelor In Paradise’s two-night premiere, the BIP cast addressed the sexual encounter that occurred between DeMario", "image": {"identifier": "https://media.okmagazine.com/brand-img/gwn3vFiVn/1200x628/2017/08/bachelor-in-paradise-cast-finally-address-shows-sex-scandal-hero.jpg", "alt": "ABC&#8217;s &#8220;Bachelor in Paradise&#8221; &#8211; Season Four"}}}, "movies": [], "publish_date": 1502908537.0, "source": "https://okmagazine.com", "summary": ""}