{"url": "www.cosmopolitan.com/entertainment/celebs/a62812/justin-bieber-selena-gomez-timeline-breakup/", "text": "14 min read\n\nGetty\n\nThe book of Jelena added another chapter in the fall of 2017 when news broke that the two were hanging out again. One day after Justin Bieber and Selena Gomez were spotted going to church and brunch together, it was reported that Selena had split with her boyfriend of 10 months, The Weeknd. Jelena then rode bikes together. And then came the hockey jersey. And the kissing photos! And more kissing photos! Then in March 2018, Jelena was hit with their first big breakup rumor. What will these two think of next? As fans ponder on the possibility that this on-again-off-again love story has a sequel, here’s a look back at everything that’s unfolded since the birth of Jelena.\n\n\n\nDecember 2010: Justin and Selena are spotted holding hands in Philadelphia. No drama here but TBH, the birth of Jelena was life-changing.\n\nNovember 2011: Justin is named in a paternity suit by non-famous person Mariah Yeater (it's later dropped). The first of many, many breakup rumors between Justin and Selena surface.\n\nMay 2012: Selena posts a photo on Instagram and Facebook from a shooting range along with the caption, \"Releasing some stress today.\" She deletes her Instagram account shortly after.\n\nFacebook/Instagram/Selena Gomez\n\nJune 2012: Jelena is hit by another round of breakup rumors but fear not — they arrive to the premiere of Katy Perry: Part of Me together. See?\n\nROBYN BECK/AFP/GettyImages\n\nOctober 2012: Justin posts and deletes a photo with the caption \"Lingse,\" which fans believe is an anagram of the word \"single.\"\n\nNovember 2012: Justin and Selena reportedly break up due to their schedules. Justin is briefly linked to Victoria's Secret model Barbara Palvin and later, Miranda Kerr.\n\nTwitter\n\nDecember 2012: Days after Justin and Selena are caught kissing at the airport in Salt Lake City, Jelena reportedly call it quits while vacationing in Mexico for New Year's Eve. Selena tweets this Jan. 1:\n\nJanuary 2013: Selena posts a photo of herself on Twitter wearing a Stratford Culltions hat. The hat is from Justin's hometown hockey team. \"I can make the Stars Dance…\" she writes with the photo.\n\nTwitter\n\nMarch 2013: While promoting Spring Breakers on the Late Show With David Letterman, Selena says, \"I'm so good,\" and reveals \"that makes two of us\" when Letterman says he made Justin cry on the show.\n\n\n\n\n\nApril 2013: Selena reportedly flies to Norway to see Justin, who Instagrams a black and white photo of them along with the caption, \"You've been makin music for too long babe come cuddle – her.\" The photo was quickly deleted.\n\nInstagram\n\nMay 2013: Selena greets Justin with a kiss on the cheek while backstage at the Billboard Music Awards. Taylor Swift makes a face.\n\n\n\n\n\nJuly 2013: Justin and Selena spend Fourth of July together but in an interview with the Associated Press days later says she's \"single.\"\n\nJanuary 2014: Justin kicks off the year with this sweet photo of Selena hugging him, along with the caption, \"Love the way you look at me.\"\n\nInstagram\n\nMarch 2014: Justin and Selena appear in several videos in which they appear to be dirty dancing (yes). They're deleted shortly after.\n\n\n\n\n\nJustin posts photos of Selena from the Vanity Fair Oscar party and calls her \"the most elegant princess in the world.\"\n\nFilmMagic\n\nBefore the month wraps, Selena attends a #WeDay event with Orlando Bloom, Seth Rogen, and others.\n\nApril 2014: Selena and Justin reportedly have a fight at Coachella after she finds photos of Kylie Jenner on his phone. Selena is later linked to Orlando Bloom after their now-famous curb photo is taken outside a Chelsea Handler show in L.A.\n\nMay 2014: Justin is romantically linked to Kylie, Adriana Lima, and Yovanna Ventura. He previews a song called \"It's Working\" that's definitely, maybe about Selena.\n\nInstagram\n\nJune 2014: Justin posts and deletes another black and white photo of him and Selena, along with the caption \"Our love is Unconditional.\" They're later spotted together at the movies, Bible study, and a friend's birthday. All signs are suggesting that they're back together. Justin apologizes for making a racist joke on video and it's reported that Selena is by his side during this time.\n\nInstagram\n\nJuly 2014: Orlando punches Justin in Ibiza and it's all caught on video. Justin can be heard saying, \"What's up bitch?\" to Orlando after the encounter. He posts and deletes a sexy photo of Miranda Kerr on Instagram.\n\nInstagram/via The Daily Mail\n\nAugust 2014: Justin posts a photo of him and Selena together, suggesting they're back on.\n\nInstagram\n\nOctober 2014: Justin and Selena are spotted fighting at the airport in France. She later tweets about being lonely.\n\nIt's rumored that Kendall Jenner is the one behind this latest breakup. Mama Pattie sends a cryptic message on Twitter.\n\n[twitter ]https://twitter.com/pattiemallette/status/51848713...[/twitter]\n\nIt looks like Justin is trying to win Selena back by posting romantic photos and songs on Instagram.\n\nInstagram\n\nNovember 2014: Selena releases \"The Heart Wants What It Wants\" and tells Ryan Seacrest it's about Justin. She says Justin has also seen the video for the song and that it was \"really hard\" for him. She also says that she will \"support\" Justin: \"I think I always will. I'm upset when he's upset. I'm happy when he's happy. I don't want anything bad to ever happen to him. It hurts me. That's all.\"\n\nJustin also responds with this Insta.\n\nInstagram\n\nSelena performs \"The Heart Wants What It Wants\" at the American Music Awards and everyone — including Taylor Swift — is in tears.\n\nSee?\n\nGiphy\n\nDecember 2014: Justin responds to rumors that he's dating Hailey Baldwin.\n\nInstagram\n\nJanuary 2015: Selena and Zedd are romantically linked but Selena is later seen grabbing dinner with Justin at Mastros in L.A.\n\nMay 2015: Justin and Selena attend the Met Gala separately but he calls her \"gorgeous\" while being bombarded by TMZ the following day.\n\nAugust 2015: Selena tells Sunday Times, \"it's difficult for people to separate us. The internet wants to freeze this moment in time and constantly repeat it.\" Fans begin to link Justin to \"Same Old Love.\"\n\nSeptember 2015: Justin is brought up in nearly every interview Selena conducts for her new album Revival. She tells Elle's October 2015 issue: \"I'll forever support him and love him in a way that ... We grew up together. I think people want it to be different ... We're too young for that. Nobody was married. There was no ... I respect him. And I think he respects me, in a healthy manner.\" She also says, \"I don't know,\" when asked if she would ever get back together with Justin and confirms that yes, she had a \"thing\" with Zedd.\n\nSelena also speaks about Justin to the New York Times without mentioning his name: \"While people were writing that I was stupid for being in it, this is what I always saw in him. I'm like, duh!\"\n\nMeanwhile, Justin has a feature of his own with Complex: \"I moved in with my girlfriend when I was 18. Started my own life with her. It was a marriage kind of thing. Living with a girl, it was just too much at that age. But we were so in love. Nothing else mattered. We were all about each other. But when it's like that and you get your value from that, people will always disappoint you.\"\n\nGetty\n\nOctober 2015: Selena continues to talk about Justin in interviews. She tells Refinery29, \"Of course I got my heart broken. Of course I was pissed about it. There, everybody has it. I was so disappointed, because I never wanted my career to be a tabloid story.\" She says that \"there is no anger\" at this point. \"There's closure in a very good, healthy way. We've seen each other. I'm always encouraging and I am proud of his journey. I think people are making it out to be something that is more tragic than it really was. We grew up together. We both made mistakes. That's it.\"\n\nNovember 2015: Leading up to the release of Purpose, Justin appears on the Ellen DeGeneres Show and confirms that three songs, \"What Do You Mean?\" \"Sorry,\" and \"Mark My Words,\" on the album are about Selena. He also tells Access Hollywood that his \"first real love\" was Selena and that \"it was really tough. I don't know if I'm over it yet.\" \"I love her and I want her to be awesome, but there are things that remind me of her.\"\n\nMeanwhile, Selena is spotted holding hands with Gigi Hadid's BFF Samuel Krost.\n\nJustin scores a Billboard feature. He says this about Selena: \"I'm proud of the woman she is today. When you love someone that much, even if something comes between you, it's a love that never really dies.\" When asked if he's heard Revival, Justin offers this: \"I know I had a lot of play in that one. I don't know what she's saying about me.\"\n\nBefore the month wraps, Justin is spotted serenading Selena with \"My Girl\" at a hotel bar in Beverly Hills:\n\n\n\n\n\nFebruary 2016: In an interview with GQ, Justin says Selena was the only one \"bad\" breakup in his life and that she inspired \"a lot\" of the tracks on Purpose. \"We don't talk often, but we're cordial. If she needs something, I'm there for her. If I need something, she's there for me.\"\n\nSelena, meanwhile, tells W magazine that she's \"so exhausted ... I honestly am so done. I care about his health and well-being. But I can't do it anymore.\"\n\nMay 2016: Selena and Orlando appear to get handsy in photos obtained by TMZ, even though he's dating Katy Perry.\n\nJuly 2016: Mama Pattie sends Selena some birthday messages. People freak out about the possible identity of the \"birdie.\"\n\nAugust 2016: Justin shares multiple photos of rumored new girlfriend Sofia Richie. He lashes out at fans for attacking her on Instagram and warns he'll make his account private if it continues. Selena chimes in, shades Justin by posting photos with her own fans on Instagram and likes posts that appear to be dissing Justin.\n\nInstagram\n\nDays, later Selena apologizes on Snapchat, writing \"What I said was selfish and pointless.\" Justin deletes his Instagram entirely, confusing Beliebers everywhere.\n\nInstagram\n\nSeptember 2016: Sofia talks about Justin for the first time in Billboard. “We have a special relationship. Justin is very easy to talk to, and that’s hard to find with people in Los Angeles.” Weeks later, TMZ reports that Justin and Sofia are over and that they’ve already been seeing other people. According to sources, Jofia (?) had not been in contact for a while and things between them were never too serious. Good to know!\n\nJanuary 2017: Selena and The Weeknd make headlines after they’re spotted kissing outside Giorgio Baldi in Santa Monica. In wake of the dating news, Justin is approached by TMZ, who dares to ask if he can listen to a Weeknd song now. “I can’t… that shit’s whack,” Justin said.\n\nGetty\n\nFebruary 2017: Justin reactivates his Instagram after being offline for a long and dark six months to share his new T-Mobile commercial for the Super Bowl. It doesn’t take long for the Biebs to return to his old, shirtless ways though.\n\nDespite being up for four Grammys, Justin skips this year's ceremony and instead goes on Instagram Live with friend Alfredo Flores to take questions from fans. When asked what his favorite song is, Justin says, “’Starboy’ by The Weeknd,” before bursting out in laughter.\n\n\n\nOn Valentine’s Day, Justin quotes Dumb and Dumber and laments about being alone.\n\nTwo days later, Selena releases “It Ain’t Me,” a new single she co-wrote with Kygo. Fans are quick to point out the Justin references, with the most telling one in the line, “I had a dream / We were back to seventeen.” Reminder: Selena was introduced to Justin when she was 17.\n\n\n\nJune 2017: Selena praises Justin following his performance at Ariana Grande’s One Love Manchester benefit concert.\n\nAppearing on Sirius XM’s Morning Mash Up, Selena says, \"It was beautiful,\" she said. \"I thought everyone did such a beautiful job. It was so gorgeous. I love how she [Ariana] ended it. I thought Justin did great. It was really beautiful.\"\n\nJuly 2017: Justin cancels the rest of his \"Purpose\" world tour, which was originally supposed to end in October in Asia. Less than two weeks later, Justin would release a lengthy statement to explain the reason behind his cancelation: his health. \"Me taking this time right now is me saying I want to be SUSTAINABLE. I want my career to be sustainable, but I also want my mind, heart, and soul to be sustainable. So that I can be the man I want to be, the husband I eventually want to be and the father I want to be.\"\n\nAugust 2017: Justin and Bloodpop release a new song, “Friends.” Jelena fans immediately analyze all the possible Selena references.\n\nSeptember 2017: Taking to Instagram, Selena reveals that she had a kidney transplant and that her donor was actress and BFF Francia Raisa. “I’m very aware some of my fans noticed I was laying low for part of the summer,” she wrote. “I found out I needed to get a kidney transplant due to my Lupus and I was recovering.”\n\nAccording to TMZ, Justin was never notified about the surgery because the two had not been in contact for a while. “They don’t talk. Period,” says one source.\n\nIn what would later turn out to be the not-so-final nail in the Jelena coffin, Selena’s assistant Theresa Mingus shares an Instagram story about Selena and The Weeknd, writing, “In an industry that’s so hard to be loyal and love these two made it happen.” Eagle-eyed fans later spot Theresa liking a comment that says Jelena will “NEVEERRRR” get back together.\n\nScreenshot\n\n\n\n\n\nOctober 2017: Us Weekly reports that Justin is dating Ballers actress Paola Paulin after being spotted at church and an “intimate private date” together. According to one source, they are “totally smitten with each other.” The report comes not long after E! News revealed that Justin was single and focused on being healthy.\n\nGetty\n\nJust before Halloween, Justin and Selena stir the hearts of Jelena fans as the former couple are spotted at church and breakfast together in Los Angeles. TMZ reports that Justin also showed up at Selena’s house later that evening.\n\nOne day later, multiple outlets report that Selena and The Weeknd have split after 10 months of dating. TMZ reports that The Weeknd was the one who called Selena to end things after things started going sour in the summer. The former couple’s respective work schedules reportedly also got in the way.\n\nNovember 2017: Selena and Justin are spotted together again, this time on a bicycle adventure in L.A. Are bikes romantic? Maybe. More importantly, are they back together? (Consider this photo of Selena resting her head on Justin’s shoulder if you're not convinced.)\n\nHours later, Selena is spotted cheering Justin on during his hockey scrimmage. To the delight of lifelong Jelena fans, Selena is seen wearing Justin’s jersey following the game. Is there anything better than hockey sweat?\n\nMeanwhile, PEOPLE reports that Justin is “trying to take things slowly” with Selena, but is “too excited to spend time with her.” He continues to wait “for Selena to tell him they are officially back together” and is not in any rush because “they are already emotionally together.” SWEET.\n\nPrime example of the two spending time together: Selena is spotted cheering on the Biebs at his hockey scrimmage in L.A. with some adorable company: Charlie, her Cavalier King Charles Spaniel.\n\n\n\nAt the same game, to the delight of longtime Jelena fans, Justin and Selena are seen kissing during a break. Is hockey the best sport ever or what?\n\nThanksgiving 2017: Both E! News and TMZ report that Justin and Selena spent Thanksgiving apart, with Selena flying to Texas to be with her family and Justin dropping in on a hockey practice in Whistler, B.C. According to one E! News source, “Selena felt it was too soon for Justin to come to Texas with her. Her family is still getting comfortable with the idea of them back together.”\n\nDecember 2017: Speaking to PEOPLE during a holiday benefit luncheon for Justice Speaks, Justin’s mom Pattie Mallette briefly chimes in on Jelena. “I don’t know so much about their personal relationship because he doesn’t share a whole lot, but I love her. I support anything [he does], if he loves her I love her, and I’ve met her and we have a special bond so I think she’s precious… I can’t really speak on their relationship, that’s between them.”\n\nNine days before Christmas, Justin and Selena are spotted boarding a private plane bound for Bellevue, Washington. According to eagle-eyed fans (with the most excellent casual photo-taking and video skills), Jelena spent some time in the Bravern Mall’s Sugar Factory\n\nTMZ reports that the on-again, off-again couple enjoyed the non-alcoholic version of a 60 oz. drink called the Ocean Blue, which came with two straws, inside the Chocolate Lounge.\n\nJanuary 2018: Days after spending New Year’s Eve together in Cabo, Jelena are spotted leaving a hot yoga studio in L.A. looking sweaty and divine. Meanwhile, Selena’s mom, Mandy Teefy, opens up to Gossip Cop about Jelena, noting that while she’s “not happy” with the on-again relationship, “Selena is an adult and can make her own choices.”\n\nGetty Images\n\nE! also releases a report on why Jelena’s relationship is actually successful in 2018. According to sources, Justin has been “behaving like a gentleman and showing how much he cares about her” and has been really good at keeping in touch. That same week, Selena is spotted cheering on Justin at yet another hockey game at the Los Angeles Valley Ice Center in Ventura. According to E!, Selena was “focused” on Justin “the entire time.”\n\nFebruary 2018: Selena completes a two-week program in New York City to treat anxiety and depression, reports both Us Weekly and PEOPLE. According to an Us Weekly source, Selena “feels great” following the treatment and was able to keep in touch with a “supportive” Justin when they were apart.\n\nGetty\n\nNot long after her treatment, Selena joins Justin in Jamaica for his dad Jeremy's wedding to longtime girlfriend Chelsey Rebelo. One day after the nuptials, photos of Jelena nuzzling, kissing, embracing, laughing, nestling, and cuddling, surface.\n\nMarch 2018: After Selena wishes Justin a Happy Birthday on Instagram, Jelena is hit with the first breakup rumor of 2018. Courtesy of E!, Justin and Selena were reportedly “having a lot of little disagreements” and one fight “blew up,” paving the way for a split. The E! source maintains the two have “been in contact the entire time and their feelings for each other have not changed.”\n\nUs Weekly reports that Selena’s mom Mandy is part of the reason for the split. “Justin’s family loves Selena, but Selena’s family has put her in a very conflicting spot because they still don’t trust Justin… Selena has tried to convince her family that Justin has changed… but her family just isn’t budging right now,” says one source.\n\nDays later, E! reports that Selena has flown off to Texas to be with her family in the midst of the breakup rumor. Justin, meanwhile, is photographed looking distraught (hands over face) in his car.\n\nGetty\n\nBy mid-March, Jelena are spotted breathing the same air, but before you celebrate, the two were simply photographed going to the same church service in Los Angeles. They did not arrive together. They did not leave together.\n\nOne more thing: Selena goes on an Instagram purge and unfollows a bunch of people, including Justin Bieber. Among the 12 celebrity friends she still follows: Taylor Swift, Francia Raisa, Amy Schumer, Jessica Alba, and Julia Michaels.\n\nFollow Peggy on Twitter and Cosmo Celeb on Facebook.", "images": ["https://hips.hearstapps.com/cos.h-cdn.co/assets/16/33/1471283126-selena-gomez-shooting-range.jpg?crop=1xw:1xh;center,top&resize=980:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/33/1471361450-justin-bieber-instagram-response-song.jpg?crop=1xw:1xh;center,top&resize=640:*", "http://www.cosmopolitan.com/_assets/design-tokens/cosmopolitan/static/images/logos/logo.eca17dd.svg?primary=%2523ffffff", "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/33/1471284403-justin-bieber-instagrams-miranda-kerr.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/actor-zac-efron-attends-the-los-angeles-premiere-of-news-photo-1763567847.pjpeg?crop=0.638xw:1.00xh;0.230xw,0&resize=360:*", "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/33/1471284201-justin-bieber-selena-gomez-unconditional.jpg?crop=1xw:1xh;center,top&resize=980:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://hips.hearstapps.com/hmg-prod/images/dan-reynolds-and-minka-kelly-attend-a-gladiator-ii-special-news-photo-1763566535.pjpeg?crop=0.601xw:0.401xh;0.144xw,0.0748xh&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523000000&id=social-button-icon", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523ffffff", "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/33/1471283678-selena-gomez-justin-bieber-hat.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/33/1471361499-justin-bieber-instagram-hailey-baldwin.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/33/1471361570-justin-bieber-sofia-richie-instagram.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/selena-charlie-justin-hockey-1510861077.jpg?crop=1xw:1xh;center,top&resize=980:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/selena-gomez-feb-2018-bangs-1520519758.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/prince-harry-duke-of-sussex-and-meghan-duchess-of-sussex-news-photo-1763582339.pjpeg?crop=0.700xw:1.00xh;0.151xw,0&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/33/1471283855-justin-bieber-selena-gomez-cuddle-insta.jpg?crop=1xw:1xh;center,top&resize=980:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/justin-selena-timeline-2018-1521145289.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2025-11-19-at-7-54-52-am-691dbe33bda06.png?crop=0.509xw:0.906xh;0,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/justin-bieber-sweater-1521141955.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/cos110125-giovanniluciano-01-lead-691b64d317458.jpg?crop=0.670xw:1.00xh;0.239xw,0&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523ffffff&id=social-button-icon", "http://www.cosmopolitan.com/_assets/design-tokens/cosmopolitan/static/images/logos/logo.eca17dd.svg?primary=%2523000000", "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/33/1471283244-selena-gomez-justin-bieber-katy-perry-movie-premiere.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/33/1471285777-selena-gomez-vanity-fair-justin-bieber.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/justin-selena-2017-bikes-1510860743.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/miss-nigeria-chidimma-adetshina-miss-mexico-maria-fernanda-news-photo-1763581048.pjpeg?crop=0.668xw:1.00xh;0.167xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/king-charles-iii-and-queen-camilla-greet-guests-during-the-news-photo-1763570847.pjpeg?crop=0.665xw:1.00xh;0,0&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/33/1471283744-justin-bieber-barbara-palvin.jpg?crop=1xw:1xh;center,top&resize=980:*", "http://www.cosmopolitan.com/_assets/design-tokens/cosmopolitan/static/images/logos/network-logo.722abed.svg?primary=%2523ffffff", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/33/1471361148-justin-bieber-instagram-song-preview.jpg?crop=1xw:1xh;center,top&resize=640:*", "https://hips.hearstapps.com/vidthumb/images/screen-shot-2022-02-03-at-3-13-42-pm-1643919322.jpg?crop=0.9962319639738993xw:1xh;center,top", "https://hips.hearstapps.com/hmg-prod/images/prince-night-the-ballroom-is-turning-purple-this-week-as-news-photo-1763563610.pjpeg?crop=1.00xw:0.801xh;0,0.0449xh&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/bookmark-simple-regular.9d9d56b.svg", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523000000&id=social-button-icon", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/x-regular.e414d97.svg", "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/33/1471361392-justin-bieber-instagram-song-feel.jpg?crop=1xw:1xh;center,top&resize=640:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/globe-simple-regular.e7f303c.svg", "https://hips.hearstapps.com/hmg-prod/images/selena-gomez-mom-mandy-teefey-1513694506.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/prince-william-prince-of-wales-prince-george-of-wales-news-photo-1763556186.pjpeg?crop=0.668xw:1.00xh;0.150xw,0&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/ariana-grande-and-cynthia-erivo-attend-wicked-for-good-new-news-photo-1763570671.pjpeg?crop=0.740xw:1.00xh;0.112xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/catherine-princess-of-wales-and-prince-william-prince-of-news-photo-1763556135.pjpeg?crop=0.668xw:1.00xh;0.104xw,0&resize=360:*", "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/33/1471361060-justin-bieber-selena-gomez-instagram-love-the-way.jpg?crop=1xw:1xh;center,top&resize=640:*", "https://hips.hearstapps.com/hmg-prod/images/selena-justin-hockey-jersey-2017-1510860857.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/33/1471361291-justin-bieber-selena-gomez-instagram-diamond.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/33/1471350934-image1.png?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/justin-bieber-fall-2017-1509656080.jpg?crop=1xw:1xh;center,top&resize=980:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=currentColor&id=link-out-embed", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/selena-gomez-sept-2015-dress-1521141656.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/33/1471284677-taylor-swift-crying.gif?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/justin-bieber-shorts-1521142221.jpg?crop=1xw:1xh;center,top&resize=980:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/saved.ad81f1a.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/selena-weeknd-assistant-1509655504.jpg?crop=1xw:1xh;center,top&resize=640:*", "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/33/1600x800/landscape-1471279728-justin-bieber-selena-gomez-photo-together.jpg?resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/prince-william-prince-of-wales-and-prince-harry-duke-of-news-photo-1763575239.pjpeg?crop=0.665xw:1.00xh;0.162xw,0&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523000000&id=social-button-icon", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/clock-regular.b2f2888.svg", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/caret-left-regular.5546078.svg", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/envelope-simple-regular.91a0134.svg"], "top_img": "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/33/1600x800/landscape-1471279728-justin-bieber-selena-gomez-photo-together.jpg?resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.cosmopolitan.com/entertainment/celebs/a62812/justin-bieber-selena-gomez-timeline-breakup/", "title": "A Timeline of All the Drama Between Justin Bieber and Selena Gomez", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Selena Gomez and Justin Bieber Dating History - Jelena Relationship Timeline", "description": "A look back at Justin Bieber, Selena Gomez, and all the times they broke up, reunited, and shaded each other online and in interviews. Jelena forever.", "keywords": "justin bieber, selena gomez, justin bieber selena gomez timeline, justin bieber selena gomez break up, justin bieber selena gomez relationship, justin bieber selena gomez update", "theme-color": "#000000", "og": {"site_name": "Cosmopolitan", "title": "A Timeline of All the Drama Between Justin Bieber and Selena Gomez", "description": "All the breakups, makeups, and Instagrams.", "image": {"identifier": "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/33/1600x800/landscape-1471279728-justin-bieber-selena-gomez-photo-together.jpg?resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.cosmopolitan.com/entertainment/celebs/a62812/justin-bieber-selena-gomez-timeline-breakup/", "type": "article"}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "opinion": "false", "section": "Celebs", "modified_time": "2018-03-15T19:40:00Z", "published_time": "2018-03-15T19:40:00Z"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "parsely-metadata": "{\"socialHeadline\":\"A Timeline of All the Drama Between Justin Bieber and Selena Gomez\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/33/980x980/square-1471279728-justin-bieber-selena-gomez-photo-together.jpg?resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/33/1600x800/landscape-1471279728-justin-bieber-selena-gomez-photo-together.jpg?resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/33/980x980/square-1471279728-justin-bieber-selena-gomez-photo-together.jpg", "twitter": {"image": "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/33/1600x800/landscape-1471279728-justin-bieber-selena-gomez-photo-together.jpg?resize=640:*", "card": "summary_large_image"}, "auto-publish": "timely", "sailthru.excerpt": "The book of Jelena added another chapter in the fall of 2017 when news broke that the two were hanging out again. One day after Justin Bieber and Selena Gomez were spotted going to church and brunch together, it was reported that Selena had split with her boyfriend of 10", "sailthru.tags": "entertainment,Pop Culture,celebs,Celebs,Cosmopolitan-US", "sailthru.date": "2018-03-15 19:40:00", "sailthru.socialtitle": "A Timeline of All the Drama Between Justin Bieber and Selena Gomez", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1521142800.0, "source": "http://www.cosmopolitan.com", "summary": ""}