{"url": "https://www.independent.co.uk/arts-entertainment/films/news/jurassic-world-fallen-kingdom-2-review-chris-pratt-bryce-dallas-howard-a8385536.html", "text": "Your support helps us to tell the story Read more Support Now From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it's investigating the financials of Elon Musk's pro-Trump PAC or producing our latest documentary, 'The A Word', which shines a light on the American women fighting for reproductive rights, we know how important it is to parse out the facts from the messaging. At such a critical moment in US history, we need reporters on the ground. Your donation allows us to keep sending journalists to speak to both sides of the story. The Independent is trusted by Americans across the entire political spectrum. And unlike many other quality news outlets, we choose not to lock Americans out of our reporting and analysis with paywalls. We believe quality journalism should be available to everyone, paid for by those who can afford it. Your support makes all the difference. Read more\n\nThe first reviews for the brand new Jurassic World sequel have been released.\n\nTitled Jurassic World: Fallen Kingdom, the film follows on from Colin Trevorrow's immensely successful first of the rebooted Jurassic Park trilogy which sees Owen (Chris Pratt) and Claire (Bryce Dallas Howard) return to the dinosaur-ridden Islar Nublar to save the creatures from an erupting volcano.\n\nThis, as director J.A. Bayona told us “hints at a short section of the movie,” is a precursor to a final act which merges gothic horror with scares evoking Steven Spielberg's original which turns 25 later this month.\n\nIt seems that while some critics have lapped up the film's thrills, others remain unconvinced by the latest big-budget attempt from Universal Pictures despite hailing it as a better film than Jurassic World. You can read a selection below for yourself.\n\nThe Independent - Geoffrey Macnab - 4 stars\n\n\"This is a summer popcorn movie with all the trimmings - action, cheesy in-jokes, startling visual effects and a storyline with a moralising, eco-friendly subtext.\"\n\nThe Guardian - Peter Bradshaw - 2 stars\n\n\"There are some reasonably entertaining scenes and set pieces, but the whole concept feels tired and contrived, and crucially the dinosaurs themselves are starting to look samey, without inspiring much of the awe or terror they used to.\"\n\nThe Telegraph - Robbie Collin - 2 stars\n\n\"Hollywood finds a way to make dinosaurs boring.\"\n\nThe Hollywood Reporter - John Defore\n\n\"While the movie courses seamlessly through different modes, it remains old-fashioned in its treatment of Howard's character, who mostly screams and runs while Owen gets things done. Claire has grown up a lot since her debut as Jurassic World's soulless corporate climber, but she remains a damsel in distress who (this time, as last) gets to perform a single far-fetched heroic feat when things are at their most dire.\"\n\nEmpire - Ben Travis - 4 stars\n\n\"The island is where Bayona’s disaster movie credentials come into play. He invokes the relentless intensity of The Impossible's harrowing tsunami in a thunderous stampede sequence as the volcanic eruption escalates, boldly providing the film’s biggest set-piece at the midway point. Such mass destruction is a new flavour for the Jurassic series, and Bayona wisely punctuates the bombast with human-scale peril.\"\n\nIGN - Gav Murphy\n\n\"Jurassic World: Fallen Kingdom opens with one of the most exciting set pieces of the year and from there it barely stops for breath as we’re bounced from a huge, high-stakes disaster film to a claustrophobic gothic horror.\"\n\nJurassic World: Fallen Kingdom is in cinemas now", "images": ["https://static.the-independent.com/s3fs-public/thumbnails/image/2018/06/06/09/jurassic-world-fallen-kingdom.jpg?width=1200&height=800&crop=1200:800"], "top_img": "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/06/06/09/jurassic-world-fallen-kingdom.jpg?width=1200&height=800&crop=1200:800", "keywords": [], "authors": [], "canonical_link": "https://www.independent.co.uk/arts-entertainment/films/news/jurassic-world-fallen-kingdom-2-review-chris-pratt-bryce-dallas-howard-a8385536.html", "title": "Jurassic World: Fallen Kingdom review round-up: The verdict is in for JA Bayona's dinosaur sequel", "meta_data": {"robots": "max-image-preview:large,max-video-preview:-1", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "News", "sitename": "The Independent", "page path": "/arts-entertainment/films/news", "page type": "Article", "adPageType": "Article Page", "description": "It's a mixed bag of reactions for the follow-up to the 2015 blockbuster", "og": {"updated_time": "2018-06-20T14:50:48.000Z", "site_name": "The Independent", "title": "The first Jurassic World: Fallen Kingdom reviews are in", "url": "https://www.the-independent.com/arts-entertainment/films/news/jurassic-world-fallen-kingdom-2-review-chris-pratt-bryce-dallas-howard-a8385536.html", "type": "article", "description": "It's a mixed bag of reactions for the follow-up to the 2015 blockbuster", "image": {"identifier": "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/06/06/09/jurassic-world-fallen-kingdom.jpg?width=1200&height=800&crop=1200:800", "secure_url": "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/06/06/09/jurassic-world-fallen-kingdom.jpg?width=1200&height=800&crop=1200:800"}, "locale": "en_GB"}, "article": {"published_time": "2018-06-20T14:50:48.000Z", "modified_time": "2018-06-20T14:50:48.000Z", "section": "Culture", "subsection": "Film", "author_name": "Jacob Stolworthy", "content_type": "story", "word_count": 743, "image_count": 1, "embed_count": 1, "video_count": 1, "internal_link_count": 3, "external_link_count": 6}, "date": "2018-06-20T14:50:48.000Z", "viewport": "width=device-width,initial-scale=1,minimum-scale=1", "theme-color": "#919191", "indy-test-internal-article-helmet": "indy", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "vf": {"owner": "viafoura-id:11000176299319"}, "twitter": {"title": "The first Jurassic World: Fallen Kingdom reviews are in", "site": "@Independent", "card": "summary_large_image", "description": "It's a mixed bag of reactions for the follow-up to the 2015 blockbuster", "image": "https://static.the-independent.com/s3fs-public/thumbnails/image/2018/06/06/09/jurassic-world-fallen-kingdom.jpg?width=1200&height=800&crop=1200:800"}, "keywords": "[\"jurassic world\",\"Jurassic World: Fallen Kingdom\",\"Internal\"]"}, "movies": [], "publish_date": 1529506248.0, "source": "https://www.independent.co.uk", "summary": ""}