{"url": "https://www.huffingtonpost.com/entry/katy-perry-blames-taylor-swift-for-all-their-bad-blood_us_59242418e4b03b485cb4f683", "text": "LOADING ERROR LOADING\n\nWe finally know why they got bad blood.\n\nThe truth behind the Taylor Swift and Katy Perry feud has been largely a mystery. We could guess it had something to do with backup dancers, as Swift previously told Rolling Stone her song “Bad Blood,” rumored to be about Perry, was about a singer “who basically tried to sabotage an entire arena tour.”\n\nFacts were scant, though. Even with Perry’s “Swish, Swish,” a song rumored to be about Swift that debuted last week (more than a year after Swift’s track), we didn’t know the full story.\n\nAdvertisement\n\nNow it’s coming at you like a dark horse.\n\nDuring an extended “Primetime Carpool Karaoke Special” on Monday night, Perry opened up about everything to host James Corden.\n\nAccording to Perry, the feud started because some of her usual dancers wanted to perform with Swift. Perry said she had no problem with the dancers’ choice, but to make sure their contracts included a provision allowing them to drop out of Swift’s ensemble when Perry went back on tour in a year or so.\n\nAdvertisement\n\nWell, when the time came for Perry to prepare for her tour, the dancers went to Swift’s management to discuss leaving ― and got fired.\n\n“She started it, and it’s time for her to finish it,” Perry told Corden. The singer said she tried to speak to Swift about the issue but noted, “She wouldn’t speak to me.”\n\nThe singer continued, “It was a full shutdown, and then she writes a song about me, and I’m like, OK, cool, cool, cool, that’s how you want to deal with it? Karma!”\n\nAdvertisement\n\nThen Perry went off like a firework:\n\nBut what I want to say is that I’m ready for that BS to be done. Now, there is the law of cause and effect. You do something, and there’s going to be a reaction, and trust me, Daddy, there’s going to be a reaction. It’s all about karma, right? ... I think, personally, that women together, not divided, and none of this petty bullshit, women together will heal the world.\n\nPreach!\n\nStories That Inspire You Your Support Fuels Our Mission Your Support Fuels Our Mission Become a Member Today As the year ends, our reporting does not slow down. Support the journalists who continue asking questions and telling stories with depth and care. Your membership today helps ensure we start the new year strong. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. Support HuffPost Already a member? Log in to hide these messages.\n\nAlthough the feud has now lasted years, Corden gets Perry to admit that it could all be erased with an apology text from Swift.\n\nAdvertisement\n\nWill they shake, shake, shake, shake, shake it off? Or are they never, ever, ever getting back together?\n\nThe saga continues ...", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "https://img.huffingtonpost.com/asset/59242812200000290016e553.jpeg?cache=Xp7UcBV3Yp&ops=1200_630", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNkYAAAAAYAAjCB0C8AAAAASUVORK5CYII=", "https://img.huffingtonpost.com/asset/691c87541700009d2b9c5f37.jpg?ops=50_50", "https://img.huffingtonpost.com/asset/5c1c75392100003006caa650.jpg?ops=100_100"], "top_img": "https://img.huffingtonpost.com/asset/59242812200000290016e553.jpeg?cache=Xp7UcBV3Yp&ops=1200_630", "keywords": [], "authors": ["Entertainment Editor", "Whitney Snyder", "Editor-In-Chief Huffpost"], "canonical_link": "https://www.huffpost.com/entry/katy-perry-blames-taylor-swift-for-all-their-bad-blood_n_59242418e4b03b485cb4f683", "title": "Katy Perry Finally Explains Taylor Swift Feud: 'She Started It'", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "\"And it's time for her to finish it.\"", "keywords": "Celebrities,Taylor Swift ,Katy Perry", "fb": {"app_id": 46744042133}, "og": {"title": "Katy Perry Finally Explains Taylor Swift Feud: 'She Started It'", "type": "article", "image": {"identifier": "https://img.huffingtonpost.com/asset/59242812200000290016e553.jpeg?cache=Xp7UcBV3Yp&ops=1200_630", "url": "https://img.huffingtonpost.com/asset/59242812200000290016e553.jpeg?cache=Xp7UcBV3Yp&ops=1200_630", "type": "image/jpeg", "width": 1200, "height": 630}, "url": "https://www.huffpost.com/entry/katy-perry-blames-taylor-swift-for-all-their-bad-blood_n_59242418e4b03b485cb4f683", "site_name": "HuffPost", "locale": "en_US", "description": "\"And it's time for her to finish it.\""}, "article": {"tag": "Celebrities,Taylor Swift ,Katy Perry", "section": "Entertainment", "published_time": "2017-05-23T13:30:53Z", "modified_time": "2017-05-23T19:19:39Z"}, "twitter": {"card": "summary_large_image", "site": "@HuffPostEnt", "title": "Katy Perry Finally Explains Taylor Swift Feud: 'She Started It'", "image": {"identifier": "https://img.huffingtonpost.com/asset/59242812200000290016e553.jpeg?cache=Xp7UcBV3Yp&ops=1200_630", "width": 1200, "height": 630}, "description": "\"And it's time for her to finish it.\""}, "al": {"ios": {"url": "huffpostnews:///?editionID=us&entryID=us_59242418e4b03b485cb4f683", "app_store_id": 306621789, "app_name": "HuffPost"}}, "bingbot": "noarchive", "robots": "max-snippet:-1,max-image-preview:large,max-video-preview:-1", "google-site-verification": "97Mj-wW7u8U1NOnkW1rfH-I1kgO0-a9YsgoesOk41R8"}, "movies": ["https://www.youtube.com/embed/5tvxzLK3rFs?rel=0&showinfo=0&controls=2&start=581&enablejsapi=1"], "publish_date": 1495546253.0, "source": "https://www.huffingtonpost.com", "summary": ""}