{"url": "www.mirror.co.uk/3am/celebrity-news/weird-marriage-rules-tom-cruise-11126495", "text": "Weird marriage rules Tom Cruise imposed on Katie Holmes: 'Silence during labour' and 'no public dating' after their split\n\nTomKat split back in 2012 after Katie grew wary of Tom's interest in Scientology\n\nKatie Holmes has finally gone public with Jamie Foxx after a rumoured romance that became an open secret in Hollywood.\n\n‌\n\n\n\nBut while the public were wondering why it took them so long to confirm their relationship, it seems to stem back to her five-year marriage to Tom Cruise.\n\n‌\n\n\n\nMuch has been reported about their bizarre divorce - and how Katie literally fled the country to get herself and daughter Suri away - but the actress has never spoken publicly about life as part of TomKat.\n\n‌\n\n\n\nHere, we look back at the bizarre claims surrounding Tom's marriage rules for his wife...\n\nLeah Remini reveals secrets from inside Tom Cruise and Katie Holmes' Scientology wedding\n\nScientology elders 'audition for wives'\n\nView 7 Images Tom sweeps Katie in for a kiss in a very public display of affection in 2005 (Image: Eyevine)\n\n‌\n\n\n\nAfter Tom's divorce from second wife Nicole Kidman, he began getting more into Scientology - the religious organisation he was introduced to by first wife Mimi Rogers in the late 1980s.\n\nAnd there have been claims that Katie - who fancied Tom as a teenager - wasn't the Mission Impossible star's first pick.\n\nAccording to the controversial book Going Clear: Scientology, Hollywood and the Prison Belief by Lawrence Wright, Tom invited Scientology elders to hold screen tests to find his next wife - a claim which the church's lawyers have denied.\n\n‌\n\n\n\nBut the author claimed a number of eligible Hollywood women were 'auditioned' by the church for the role of Tom's next spouse, including Lindsay Lohan, Scarlett Johansson and Jessica Alba.\n\nNorwegian blonde Anette Iren Johansen said in 2015 that she'd been among the auditionees and claimed she'd been questioned later by a church elder about her sexual history - including whether she'd ever had threesomes or sex with a woman.\n\nA spokesperson for the Church of Scientology told Mail Online at the time: \"There was no project, secret or otherwise, ever conducted by the Church to find a bride, via audition or otherwise, for any member.\"\n\n‌\n\n\n\nMonitoring Katie's pregnancy\n\nView 7 Images Tom and a pregnant Katie in LA (Image: WireImage)\n\nWhen TomKat announced they were expecting their first child together in October 2005, doctors criticised Cruise for buying his own at-home ultrasound machine so he could keep an eye on Katie's womb.\n\nTom confessed he'd bought the high-tech equipment to use throughout his wife's pregnancy and said the couple would donate it to a hospital after she'd given birth, but medical specialists slammed his decision.\n\n‌\n\n\n\nSome doctors warned that sonograms should only be carried out by certified technicians and only for medical purposes, as potential problems could be missed by untrained observers or the unborn child could be exposed to more sound waves than necessary.\n\nSilent childbirth\n\n7 View 7 Images Katie with baby daughter Suri in 2008 7 View 7 Images Under Scientology rules, Katie had to remain silent during birth (Image: <P>Pictured: Katie Holmes and Suri Cruise<P><B>Ref: SPL43985 120808 ...)\n\n‌\n\n\n\nBy far and away the strangest rule to come out of Tom and Katie's marriage was Cruise's insistence that his wife stay silent while she was giving birth to baby Suri.\n\nAccording to Scientologists, labouring women should avoid screaming, groaning or even talking lest their words cause trauma to their newborn.\n\nEven doctors and other staff attending the birth should refrain from speaking, according to Scientology founder L. Ron Hubbard's rules.\n\n‌\n\n\n\n\"Everyone must learn to say nothing within the expectant mother's hearing using labor and delivery,\" Hubbard wrote before his death.\n\n\"Particularly during birth, absolute silence must be maintained and the more gentle the delivery, the better.\"\n\nPost-divorce dating rule\n\nView 7 Images Tom's divorce terms reportedly stated that Katie wasn't allowed to publicly date anyone for five years after their split (Image: <P>Pictured: Tom Cruise and Katie Holmes<P><B>Ref: SPL189747 210610 </B><BR/>Picture by: Jackson Lee / Splash News<BR/></P><P><B>Splash News and Pictures</B>...)\n\n‌\n\n\n\nAccording to the terms of their 'quickie' divorce, Katie was reportedly not allowed to mention their marriage or date anyone publicly for five years after her split from Tom.\n\nA source told Radar last year: \"She's allowed to date, but she cannot do so in a public fashion, and she's not supposed to let any boyfriend near their daughter, Suri.\"\n\nAgreeing to the clause reportedly netted Katie £3.6million in child support and £3.8million for herself.\n\n‌\n\n\n\nThat was on top of the £40million prenuptial agreement Katie drew up with the help of her lawyer father, in which she pocketed £2million for every year of their five-year marriage as well as a trust fund for 11-year-old Suri.\n\n7 View 7 Images Tom holding Katie's hand while her future boyfriend Jamie Foxx watches on in 2006 (Image: Reuters) 7 View 7 Images Katie got full custody of Suri when she fled her marriage (Image: XPOSUREPHOTOS.COM)\n\nArticle continues below\n\nThe settlement also reportedly contained “iron-clad” rulings that Suri would not be made a member of the controversial Church of Scientology, where Tom holds a high rank.\n\nAnd this week - not long after the five-year mark had passed since Katie filed for divorce on June 29 2012 - she finally went public with Jamie Foxx.", "images": ["https://i2-prod.mirror.co.uk/article601539.ece/ALTERNATES/s615b/70257eed-0c16-4058-97e3-9fdddf828dff.jpg", "http://www.mirror.co.uk/footer/trust-project.svg", "https://i2-prod.mirror.co.uk/article588296.ece/ALTERNATES/s615b/e5e135cb-f5c7-4d9e-a1c9-630d67fb599f.jpg", "https://i2-prod.mirror.co.uk/article945970.ece/ALTERNATES/s615b/Tom Cruise and a pregnant Katie Holmes at the Grauman's Chinese Theatre in Los Angeles", "http://brightcove01.brightcove.com/24/4221396001/201510/2493/4221396001_4588813544001_4588811177001-vs.jpg?pubId=4221396001", "https://i2-prod.mirror.co.uk/article601736.ece/ALTERNATES/s1200/dae6cc19-ce80-4dde-8b33-484e72349be3a.jpg", "https://i2-prod.mirror.co.uk/article7739334.ece/ALTERNATES/s615b/Suri-Cruise-and-Katie-Holmes.jpg", "https://i2-prod.mirror.co.uk/article676411.ece/ALTERNATES/s615b/CELEBRITY PDA katie holmes.jpg", "http://www.mirror.co.uk/nav-web-static/release-v41-14493b7c888038a7d89b99cb3a7937c2b71eaebe/public/logo-reach.png", "http://www.mirror.co.uk/footer/ipso.svg", "https://i2-prod.mirror.co.uk/article11121308.ece/ALTERNATES/s615b/Actors-Cruise-Holmes-and-Foxx-watch-before-the-Redskins-and-Minnesota-game-in-Landover.jpg", "https://i2-prod.mirror.co.uk/article588294.ece/ALTERNATES/s615b/f9c9a16e-06b8-4660-a822-a3244b813f96.jpg", "http://www.mirror.co.uk/assets/mirror/logos/masthead-mirror-default.svg"], "top_img": "https://i2-prod.mirror.co.uk/article601736.ece/ALTERNATES/s1200/dae6cc19-ce80-4dde-8b33-484e72349be3a.jpg", "keywords": [], "authors": ["Emmeline Saunders", "Updated"], "canonical_link": "https://www.mirror.co.uk/3am/celebrity-news/weird-marriage-rules-tom-cruise-11126495", "title": "Weird marriage rules Tom Cruise imposed on Katie Holmes: 'Silence during labour' and 'no public dating' after their split", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"page_id": 6149699161, "app_id": 123792601022133, "pages": 1814357575554395}, "description": "TomKat split back in 2012 after Katie grew wary of Tom's interest in Scientology", "author": "Emmeline Saunders", "robots": "noarchive, max-image-preview:large", "Googlebot-News": "noarchive", "referrer": "unsafe-URL", "keywords": "Church of Scientology, Mimi Rogers, Katie Holmes, Jamie Foxx, Tom Cruise, Nicole Kidman, Divorce", "news_keywords": "Church of Scientology, Mimi Rogers, Katie Holmes, Jamie Foxx, Tom Cruise, Nicole Kidman, Divorce", "allowTaboolaDeepDive": "true", "vf": {"00000000-0000-4000-8000-67e599051dc3": "mirror-prod-11126495"}, "og": {"title": "Inside the weird marriage rules Tom Cruise imposed on Katie Holmes", "description": "TomKat split back in 2012 after Katie grew wary of Tom's interest in Scientology", "url": "http://www.mirror.co.uk/3am/celebrity-news/weird-marriage-rules-tom-cruise-11126495", "site_name": "Daily Mirror", "locale": "en_GB", "image": "https://i2-prod.mirror.co.uk/article601736.ece/ALTERNATES/s1200/dae6cc19-ce80-4dde-8b33-484e72349be3a.jpg", "type": "article"}, "article": {"published_time": "2017-09-07T11:43:00Z", "modified_time": "2017-09-07T18:04:03Z", "author": "https://www.mirror.co.uk/authors/emmeline-saunders/", "section": "Celebrity News", "tag": "Divorce"}, "twitter": {"card": "summary_large_image", "site": "@DailyMirror", "creator": "@emm_saunders", "title": "Weird marriage rules Tom Cruise imposed on Katie Holmes: 'Silence during labour' and 'no public dating' after their split - The Mirror", "description": "TomKat split back in 2012 after Katie grew wary of Tom's interest in Scientology", "image": "https://i2-prod.mirror.co.uk/article601736.ece/ALTERNATES/s1200/dae6cc19-ce80-4dde-8b33-484e72349be3a.jpg"}}, "movies": [], "publish_date": 1504784580.0, "source": "http://www.mirror.co.uk", "summary": ""}