{"url": "https://www.mirror.co.uk/3am/celebrity-news/inside-nick-jonas-priyanka-chopras-13685976", "text": "Inside Nick Jonas and Priyanka Chopra's week of wedding celebrations\n\nNick Jonas and Priyanka Chopra wed in style last month as they jetted to Mumbai for a week of celebrations to commemorate their love\n\nView Image (Image: mirror.co.uk)\n\nNick Jonas and Priyanka Chopra have released pictures from their wedding - and it looked like a week of fun and decadence for all the family.\n\n‌\n\n\n\nThe pair became engaged in London on July 18, 2018, Priyanka's birthday, before they headed to Mumbair to celebrate their engagement.\n\n‌\n\n\n\nNow, they have celebrated their fairytale wedding in style and married at Umaid Phawan Palace in Jodhpur, India, after a week of amazing celebrations.\n\n‌\n\n\n\nThings kicked off on November 26 with a dinner party in Mumbai, before Priyanka's mother, Dr Madhu Chopra, invited the wedding party to their home for a traditional puja ceremony.\n\nThis is a celebration of the impending nuptials to take place later that week, and Priyanka shared an image of the whole family on celebrating together.\n\nContent cannot be displayed without consent\n\n‌\n\n\n\nNick Jonas and Priyanka Chopra celebrate lavish Indian wedding with passionate Vogue shoot READ MORE :\n\nNick's family also turned up, with Joe Jonas and his fiance, Sophie Turner, joining in as she wore an Indian dress for the occasion.\n\nThe bride, in contrast, wore a cream suit which was covered in embellishments, while Nick wpore a pink kurta and cream trousers, the former of which being a type of shirt.\n\nAfter this, the group flew over to Jodhpur, and Priyanka got some last minute fittings at the JW Marriott hotel ahead of the marriage ceremony, with designer Sabyasachi Mukherjee landing shortly after the happy couple, sparking speculation that he may have designed some garments.\n\n‌\n\n\n\nContent cannot be displayed without consent\n\nAt the palace on Friday, both sides of the families performed songs and dances for the couple in the Sangeet, in an incredible performance which lit up the entire area, though Priyanka joked it was a \"fierce competition\" for the families.\n\nShe said: \"It all began as a fierce song & dance competition between the families but ended, as always, as a huge celebration of love. Nick and I were looking forward to the Sangeet (musical evening), another pre wedding ritual.. and to see what each side had put together.\n\n‌\n\n\n\n\"And what a performance it was. Each family telling our stories through song and dance, filled with lots of laughter and love. We were both filled with gratitude for the effort, the love and the laughter and will carry the memories of this special evning fod th rest of our lives.\n\nContent cannot be displayed without consent\n\nNick Jonas shares picture with his brothers after three-day wedding celebration with Priyanka Chopra READ MORE :\n\n\"It is an amazing start to a lifetime of togetherness for our families and friends...#grateful @nickjonas @calebjordanlee @josevilla @josephradhik\"\n\n‌\n\n\n\nParineeti Chopra, Priyanka's cousin, also shared a post about their Bollywood-style performance, though they shared the trophy with the Jonas family, who had a more tradition American style.\n\nNext was the mehendi, the applying of henna before the wedding, and Priyanka shared her happiness over this, saying: \"One of the most special things that our relationship has given us is a merging of families who love and respect each other’s faiths and cultures.\n\nContent cannot be displayed without consent\n\n‌\n\n\n\n\"And so planning our wedding with an amalgamation of both was so so amazing.\"\n\nShe added they \"made it our own\" and they both dreamed of kicking off their celebrations as they did.\n\nNick wore a beige, plain Indian suit while Priyanka amazed the group with a brightly coloured dress, and Sophie wore a black and gold sari.\n\n‌\n\n\n\nContent cannot be displayed without consent\n\nPriyanka Chopra and Nick Jonas share pictures from their Mehendi ceremony ahead of wedding READ MORE :\n\nAfter this, the pair had a Christian ceremony, officiated by Nick's father Paul Kevin Jonas Sr, for which Priyanka wore a Ralph Lauren gown covered in Swarovski, mother of pearl and crystal seed beading, and was kitted out with a 75ft tulle veil.\n\nNick wore the same designer as he wore a double-breasted black tuxedo with a purple lapel, which had a lace from the bride's dress sewn into it with the Urdu words \"my jaan,\" meaning \"my life.\"\n\n‌\n\n\n\nThe pair finished off the ceremonial section with a Hindu ceremony, for which Priyanka wore a red lehenga, designed by Mukherji, which had a Chopard 16-carat, oval diamond headpiece and carats of diamonds set in white gold for the necklace.\n\nContent cannot be displayed without consent\n\nNick, sporting the traditional dress, wore a cream, silk turban and long, cream outfit with gold shoes.\n\nArticle continues below\n\nThe newlyweds then flew out to Delhi for another wedding reception, and another reception for mates in the industry is still being planned.\n\nSo there is still more to come!", "images": ["https://www.mirror.co.uk/footer/ipso.svg", "https://www.mirror.co.uk/footer/trust-project.svg", "https://i2-prod.mirror.co.uk/article13675600.ece/ALTERNATES/s615/1_Nick-Jonas-and-Priyanka-Chopra-first-wedding-pictures.jpg", "https://www.mirror.co.uk/nav-web-static/release-v41-14493b7c888038a7d89b99cb3a7937c2b71eaebe/public/logo-reach.png", "https://i2-prod.mirror.co.uk/article13675600.ece/ALTERNATES/s1200/1_Nick-Jonas-and-Priyanka-Chopra-first-wedding-pictures.jpg", "https://www.mirror.co.uk/assets/mirror/logos/masthead-mirror-default.svg"], "top_img": "https://i2-prod.mirror.co.uk/article13675600.ece/ALTERNATES/s1200/1_Nick-Jonas-and-Priyanka-Chopra-first-wedding-pictures.jpg", "keywords": [], "authors": ["Jenny Desborough", "Updated"], "canonical_link": "https://www.mirror.co.uk/3am/celebrity-news/inside-nick-jonas-priyanka-chopras-13685976", "title": "Inside Nick Jonas and Priyanka Chopra's week of wedding celebrations", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"page_id": 6149699161, "app_id": 123792601022133, "pages": 1814357575554395}, "description": "Nick Jonas and Priyanka Chopra wed in style last month as they jetted to Mumbai for a week of celebrations to commemorate their love", "author": "Jenny Desborough", "robots": "noarchive, max-image-preview:large", "Googlebot-News": "noarchive", "referrer": "unsafe-URL", "keywords": "Chopard, Sophie Turner, Ralph Lauren, Love, Marriage, Weddings, Nick Jonas", "news_keywords": "Chopard, Sophie Turner, Ralph Lauren, Love, Marriage, Weddings, Nick Jonas", "allowTaboolaDeepDive": "true", "vf": {"00000000-0000-4000-8000-67e599051dc3": "mirror-prod-13685976"}, "og": {"title": "Inside Nick Jonas and Priyanka Chopra's week of wedding celebrations", "description": "Nick Jonas and Priyanka Chopra wed in style last month as they jetted to Mumbai for a week of celebrations to commemorate their love", "url": "https://www.mirror.co.uk/3am/celebrity-news/inside-nick-jonas-priyanka-chopras-13685976", "site_name": "Daily Mirror", "locale": "en_GB", "image": "https://i2-prod.mirror.co.uk/article13675600.ece/ALTERNATES/s1200/1_Nick-Jonas-and-Priyanka-Chopra-first-wedding-pictures.jpg", "type": "article"}, "article": {"published_time": "2018-12-04T15:21:52Z", "modified_time": "2018-12-05T11:56:32Z", "author": "Jenny Desborough", "section": "Celebrity News", "tag": "Nick Jonas"}, "twitter": {"card": "summary_large_image", "site": "@DailyMirror", "creator": "@DailyMirror", "title": "Inside Nick Jonas and Priyanka Chopra's week of wedding celebrations - The Mirror", "description": "Nick Jonas and Priyanka Chopra wed in style last month as they jetted to Mumbai for a week of celebrations to commemorate their love", "image": "https://i2-prod.mirror.co.uk/article13675600.ece/ALTERNATES/s1200/1_Nick-Jonas-and-Priyanka-Chopra-first-wedding-pictures.jpg"}}, "movies": [], "publish_date": 1543936912.0, "source": "https://www.mirror.co.uk", "summary": ""}