{"url": "www.thewrap.com/is-kathy-griffins-career-over-top-crisis-managers-weigh-in/", "text": "The backlash surrounding comedian Kathy Griffin’s reviled photo shoot depicting her holding the severed head of President Trump hasn’t let down since it first exploded earlier this week.\n\nIn just the last few days she’s been dumped by CNN, Squatty Potty and several venues across the country. Even friend and “New Year’s Eve Live” sidekick Anderson Cooper was quick to distance himself from his former co-host, calling her photo “disgusting.” Now many are asking whether the comedian can survive her self-inflicted wound — one that’s increasingly threatening to derail her career.\n\n“Being dropped by CNN definitely hurts her visibility,” Matt Hiltzik, a New York-based communications consultant whose clients have included Harvey Weinstein, Alec Baldwin and Justin Bieber, told TheWrap. “Her business will be fine. But her opportunities to grow beyond her core base will be limited.”\n\nAfter widespread condemnation over her graphic photo, Griffin apologized on Tuesday, begging for forgiveness and acknowledging she “went too far.” But on Friday, she held an impromptu press conference with attorney Lisa Bloom, telling reporters she’s been bullied by Trump’s family while vowing to mock the president even more in the future.\n\nBut if the intent was to quash the flurry of negative headlines that have dominated the news cycle in recent days, it may have missed the mark.\n\n“Kathy Griffin claims ‘conspiracy’ at mad, looping press conference,” proclaimed Salon. Jezebel called it a “poorly conceived mess.”\n\n“I understand when you’re in this situation there’s a natural urge to respond,” public relations expert Howard Bragman told TheWrap, however, “that has to be done with great caution and consideration.”\n\nAnother top Hollywood publicist, who asked not to be named, said the news conference only made things worse.\n\n“If she were my client, I’d tell her to shut the f— up,” the P.R. guru told TheWrap. “You’re not talking to anyone and you’re certainly not talking to Lisa Bloom anymore.”\n\nAccording to the publicist, who said he likes Griffin, her approach was ill-conceived because it lacked any perceivable strategy.\n\n“What is she trying to accomplish?” he asked. “Is she trying to sue Trump? Good luck with that. Is she trying to say she’s the victim? I think 99 percent of the people would disagree with that. She did this to herself.”\n\n“It certainly keeps her in the news,” he added.\n\nAll three publicists said Griffin will likely retain her core fans who have supported her for years and who are mostly anti-Trump liberals.\n\n“She’ll have to lay low for a while and then come back and address the elephant in the room, maybe make fun of herself,” the P.R. expert went on to say. “The gays are not going to leave her. This will go away if she just shuts up. There is a real crisis in this country right now and anything she says is just a distraction.”\n\nThe good news for Griffin is that she can recover … but it might take a while for the whole thing to blow over.\n\n“She’s going to have to recalibrate and reconsider,” Bragman said. “But in no way is this going to end her career. She’s funny, she’s immensely talented. She’s original.”", "images": ["https://i0.wp.com/www.thewrap.com/wp-content/uploads/2017/06/GettyImages-610215142.jpg?fit=618%2C412&quality=89&ssl=1", "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2025/08/5x4_082025_COVER_B.png?fit=240%2C300&quality=80&ssl=1"], "top_img": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2017/06/GettyImages-610215142.jpg?fit=618%2C412&quality=89&ssl=1", "keywords": [], "authors": ["Itay Hod", ".Wp-Block-Post-Author Box-Sizing Border-Box Display Flex Flex-Wrap Wrap .Wp-Block-Post-Author__Byline Font-Size Margin-Bottom Margin-Top Width", ".Wp-Block-Post-Author__Avatar Margin-Right .Wp-Block-Post-Author__Bio Font-Size Margin-Bottom .Wp-Block-Post-Author__Content Flex-Basis Flex-Grow .Wp-Block-Post-Author__Name Margin", ".Wp-Block-The-Wrap-Author-Bios__Entry Align-Items Center Display Flex Flex-Wrap Wrap Gap .Wp-Block-The-Wrap-Author-Bios__Entry .Wp-Block-The-Wrap-Author-Bios__Entry Margin-Top .Wp-Block-The-Wrap-Author-Bios__Entry-Excerpt Flex-Basis", ".Wp-Block-The-Wrap-Author-Bios Border-Top Solid", "Margin-Block Padding-Top .Wp-Block-The-Wrap-Author-Bios__Entry-Avatar Display Var --Display-No-Mobile", "Block", "Margin-Bottom .Wp-Block-The-Wrap-Author-Bios__Entry-Avatar Img Border Solid", "Border-Radius Box-Shadow Rgba", "Rgba"], "canonical_link": "https://www.thewrap.com/is-kathy-griffins-career-over-top-crisis-managers-weigh-in/", "title": "Is Kathy Griffin’s Career Over? Top Crisis Managers Weigh In", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Is Kathy Griffin's Career Over? Top Crisis Managers Weigh In", "description": "\"If she were my client, I'd tell her to shut the f--- up,\" one Hollywood publicist tells TheWrap", "url": "https://www.thewrap.com/is-kathy-griffins-career-over-top-crisis-managers-weigh-in/", "site_name": "TheWrap", "image": {"identifier": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2017/06/GettyImages-610215142.jpg?fit=618%2C412&quality=89&ssl=1", "width": 618, "height": 412, "type": "image/jpeg"}}, "article": {"author": "https://www.facebook.com/iamitayhod", "published_time": "2017-06-03T00:15:01+00:00", "modified_time": "2017-06-03T14:04:52+00:00"}, "author": "Itay Hod", "twitter": {"card": "summary_large_image", "creator": "@Itayhod", "label1": "Written by", "data1": "Itay Hod", "label2": "Est. reading time", "data2": "3 minutes"}, "generator": "WordPress 6.8", "article-tags": "donald-trump, howard_bragman, kathy_griffin, lisa-bloom, matt-hiltzik", "article-categories": "culture, media, politics, politicshollywood", "msapplication-TileImage": "https://i0.wp.com/www.thewrap.com/wp-content/uploads/2024/05/the_wrap_symbol_black_bkg.png?fit=270%2C270&quality=80&ssl=1"}, "movies": [], "publish_date": 1496448901.0, "source": "http://www.thewrap.com", "summary": ""}