{"url": "https://www.cosmopolitan.com/entertainment/celebs/a15926860/kylie-jenner-hidden-baby-bump-photos/", "text": "21 min read\n\nKhloé Kardashian and Tristan Thompson’s rocky relationship conjures up a whole range of emotions: Yay, True is so cute! Wow, Tristan, WTF is wrong with you? Khloé, you deserve better! Jordyn Woods, um, what? They’re…getting back together? Oh no, the paternity scandal! Rumors they were engaged before the news broke??? (Passes out.) And the main question, as always: Why am I so invested?!?!\n\nIn the years since Khloé and Tristan got together, there have been plenty of ups and downs and maaany cryptic Instagram posts along the way. Let’s take a deep dive back through their entire relationship timeline. Spoiler alert: It seems like the two are done for good…but, like, who even knows?\n\nSeptember 2, 2016\n\nTMZ reports that Khloé Kardashian and Cleveland Cavaliers player Tristan Thompson “have been spending some serious quality time together recently.” They were spotted at a mansion in Beverly Hills and leaving a nightclub called Bootsy Bellows.\n\nAt this point, Tristan’s ex Jordan Craig is pregnant with his child.\n\n\n\nSeptember 3, 2016\n\nUs Weekly reports that Khloé and Tristan spent Labor Day weekend together in Cabo San Lucas.\n\nSeptember 15 to 18, 2016\n\nThe two reunite in Miami, where they support Kanye West’s Saint Pablo Tour and celebrate Flo Rida’s birthday at club LIV. They pose for photos, link arms, and look smitten. A friend takes over Khloé’s Snapchat and posts video of them kissing.\n\nMeantime, Mama Kris tells Us Weekly, “They are really cute. She’s having a good time. He seems like a really nice guy. I think just with any relationship, just in life, I think it’s about chemistry and about values.”\n\nNovember 3, 2016\n\nKhloé tells Jimmy Kimmel that she visits Cleveland often to be with her boyfriend. “I actually really like it,” she says of the city. “I like having my routine and being a little more under the radar.”\n\nDecember 12, 2016\n\nJordan Craig gives birth to a son.\n\nDecember 25, 2016\n\nTristan wishes everyone a happy holiday on IG alongside a photo of himself and Khloé.\n\n\n\nJanuary 1, 2017\n\nHappy New Year! Khloé wishes all of you a love as great as hers.\n\nAround this time, she writes on her app, “I like that my relationship is very normal and doesn’t need to be so publicized all the time. People aren’t wrong for putting all of their personal business out there, but I’ve learned from my mistakes and don’t need to do that anymore.”\n\nJanuary 11, 2017\n\nKhloé tells James Corden that she and Tristan use the L-word.\n\nJanuary 12, 2017\n\nKhloé tells Extra that she hopes Tristan is The One.\n\n“I mean, I think that’s why we are in relationships—to find The One,” she says. “And, I mean, I am in love with him. I think he’s, like, the best. And yeah, so I hope so. Only time will tell.”\n\n\n\nFebruary 19, 2017\n\nE! News reports that the couple went zip-lining in Jamaica.\n\n\n\nSnapchat\n\nMarch 12, 2017\n\nThe season 13 premiere of Keeping Up With the Kardashians features Khloé introducing Tristan to her family; footage includes their attendance at Kanye’s Saint Pablo Tour.\n\n\n\nMarch 14, 2017\n\nKhloé throws Tristan a gold-themed 26th birthday. She writes on IG: “To the happiest of birthdays my love!”\n\n\n\nApril 11, 2017\n\nKhloé tells ES Magazine that she has “never been in this type of love” and that “yes, [she] would” marry Tristan if he asked. “I would love to have a family,” she says. “We’ve talked about it.…I know for a fact that he would be an impeccable father.” (He has a child with ex-girlfriend Jordan Craig.) “I definitely want to be a mom. But I don’t put the pressure on it. It’s not like, ‘The clock is ticking.’ I feel in my soul it will happen.”\n\nJune 11, 2017\n\nOn the season 13 finale of KUWTK, Khloé debates whether she and Tristan are ready for kids. “Tristan and I definitely talk about starting a family,” she says. “He wants to have, like, five or six kids with me, and that’s lovely.…Now, knowing I’m not on birth control, it’s scary. That’s, like, a really big step.”\n\nJune 27, 2017\n\nTristan wishes Khloé a happy 33rd birthday on IG, saying, “Happy bday my love, this picture right here sums up how wild, crazy and how much we love each other. Let’s continue to build more memories and cherish them with each other.”\n\n\n\nThe photos are from Khloé’s surprise birthday party, which Tristan arranged. “I’m so lucky and blessed! Thank you so much baby!!!” Khloé tweeted. “You treat me like a queen!”\n\nJuly 11, 2017\n\nKhloé and Tristan share BTS footage from a workout session.\n\nSeptember 24, 2017\n\nKhloé reiterates on the KUWTK 10th anniversary special that her relationship is “serious.”\n\nSeptember 26, 2017\n\nMultiple outlets report that Khloé is pregnant.\n\n\n\nOctober 31, 2017\n\nKhloé has yet to confirm her pregnancy, but she does share a pic of her and Tristan dressed as Khaleesi and Khal Drogo from Game of Thrones.\n\nDecember 20, 2017\n\nAfter months of speculation, Khloé confirms her pregnancy on IG. “My greatest dream realized!” she wrote. “We are having a baby!”\n\nDecember 22, 2017\n\nKhloé also confirms that her pregnancy announcement will appear on Keeping Up With the Kardashians.\n\nJanuary 2, 2018\n\nKhloé drives fans mad with a “Mom and Dad” pic.\n\nFebruary 14, 2018\n\nTristan wishes Khloé a Happy Valentine’s Day and tells her he loves “the curly hair look.”\n\nFebruary 16, 2018\n\nKhloé shares a photo of herself and Tristan with the caption, “When a woman is loved correctly, she becomes ten times the woman she was before. Thank you my love. ❤️”\n\n\n\nMarch 3, 2018\n\nKhloé reveals on the season 14 finale of KUWTK that she’s having a girl.\n\nShe’d previously believed she was having a boy, so the news put her in a “state of shock.”\n\nShe explained: “When you have your mind made up as to what you’re having—like, everyone told me you’re going to feel what you’re having and you’ll just kind of know. And then when you find out it’s the complete opposite, it’s just a shock. I just was convinced that I was having a boy, so to be having a girl, it’s just like, ‘Okay, that wasn’t what I thought was going on.’”\n\nMarch 11, 2018\n\nKhloé’s family throws her a balloon-and-rose-filled baby shower.\n\nMarch 19, 2018\n\nPeople reports that Khloé is nesting in Cleveland, where she and Tristan live while he’s playing for the Cleveland Cavaliers. “Khloé is in Cleveland and plans to stay there until the baby is born. She is too far along to fly back and forth,” a source tells People.\n\nMarch 26, 2018\n\nKhloé shares an intimate photo from a maternity shoot with Tristan.\n\n\n\n\n\nApril 9, 2018\n\nKhloé shares a photo of herself and Tristan kissing with the message, “Ready when you are little mama.” She’s due any day now.\n\n\n\nApril 10, 2018\n\nThe Daily Mail publishes video in which Tristan gets up close and personal with—and appears to make out with—another woman at a New York City bar over the weekend. TMZ claims Tristan took the woman he’d allegedly been seen kissing back to his hotel. “The woman eventually left with a Louis Vuitton overnight bag…seeming to indicate she’d been at the hotel for some time with Tristan,” TMZ says. The Shade Room also offers its own blow-by-blow of the alleged hookup.\n\nApril 11, 2018\n\nPer Us Weekly, the Kardashians had voiced “concerns” about Khloé’s decision to date another NBA player after her marriage to Lamar Odom.\n\n“Khloé’s mom, Kris, and sisters Kim and Kourtney all had concerns about her relationship with another basketball player, and now their fears appear to have serious merit,” a source says. “Women are constantly throwing themselves at professional athletes, and it’s very easy to stray when teams are on the road. Kris never expressed her fears to Khloé because she felt it would cause nothing but drama and create tension.”\n\nRelated Story Kareem Abdul-Jabbar: Not All Athletes Are Cheaters\n\nAccording to ET, “Kris has gathered the family” in support of Khloé. They are also tasked with keeping her away from “any of the news right now.”\n\nKhloé and Tristan have yet to comment.\n\nApril 11, 2018\n\nTMZ reports that Khloé gave birth to a baby girl at approximately 4 a.m. She reportedly delivered the child in a hospital outside Cleveland. According to TMZ, Tristan was there for the birth.\n\nMay 4, 2018\n\nUs Weekly reports that despite all the cheating speculations with five different women, the couple are “fully back together.” A source states that Khloé feels like “the whole world is against Tristan” and they are trying to work things out.\n\nMay 13, 2018\n\nKhloé spends her first Mother’s Day with True in Cleveland. A source said her family wanted Khloé to come home, but “she is feeling very happy and settled there. She feels like it’s best for True.”\n\nKhloé took to Instagram to share some picture of flowers she received, saying how she “feels so loved,” but Tristan seemed to be out of town for the special day.\n\nInstagram\n\nMay 30, 2018\n\nThe Kardashian family has been very open about their opinions on the cheating scandals. Kanye had his turn when hosting a listening party for his new album Ye, where people were quick to pick up on the lyrics of his new song “All Mine.”\n\n\n\n“All these thots on Christian Mingle / That’s what almost got Tristan single / If you don’t ball like him or Kobe / Guarantee that bitch gon’ leave you.”\n\nJune 2, 2018\n\nKhloé and Tristan’s love seems to be strong as they take a couples retreat to Mexico with Kendall Jenner and her boyfriend Ben Simmons. Pictures were taken of the couple laughing, drinking, and having lots of PDA.\n\nInstagram\n\nJune 7, 2018\n\nA source tells People that Khloé is moving back to L.A. with Tristan. Their plan is for him to travel back and forth. Her family is still “very unhappy” and feels like “she deserves better,” but they’re glad she has made the decision to move back.\n\nJune 19, 2018\n\nThe Kardashian family has forgiven Tristan. According to ET, a source says that “everyone is back on board—friends, family, and Khloé have all forgiven him and are giving him this second chance—and so far it’s been working for them.”\n\nSeptember 26, 2018\n\nOnce again, Tristan is spotted getting too close to a woman who is not Khloé. According to US Weekly, he was “very touchy-feely” with her and “he had his hand on her butt.” For now, Khloé continues to stand by him.\n\nOctober 4th, 2018\n\nKhloé takes to Instagram to post a mysterious message. Most fans think it’s hinting to Tristan cheating again.\n\nInstagram\n\nOctober 29, 2018\n\nKhloé and Tristan seem to be on good terms again. After a vacation to Bali, Khloé returned to her home filled with “welcome home” balloons arranged by Tristan.\n\nInstagram\n\nNovember 22, 2018\n\nKhloé and Tristan spend a quiet Thanksgiving together in Ohio. Fans were questioning why she didn’t spend the holiday with her sisters, and Khloé was quick to take to Twitter to explain. “I’ve spent the past three years in Cleveland for Thanksgiving,” she wrote. “Not sure why people are trying to create drama between my family and I. My sisters and I are perfectly fine, thank you!”\n\nInstagram\n\nDecember 9, 2018\n\nThings seem to be going well again for Tristan and Khloé. A source tells Entertainment Tonight that they’re in “such a good place now.”\n\n“Her relationship with Tristan is so good,” the source said. “They made it through some really dark times, but she’s happy that she gave him a second chance because he’s stepped up and is not only an amazing father to True, but he’s been such a rock for Khloé. They’re really just so in love.” Perhaps these flowers were from him? The world. May never. Know!\n\nDecember 24, 2018\n\nThe Kardashians hold their annual Christmas Eve party, and Tristan is noticeably absent. According to a source, it’s because he “doesn’t have a lot of flexibility” in his basketball schedule. Instead of spending the holidays in Cleveland with him, Khloé decides to stay with her family.\n\nJanuary 1, 2019\n\nKhloé and Tristan spend New Year’s Eve together, and from the looks of Tristan’s Instagram, they enjoyed their night.\n\nInstagram.com/realtristan13\n\nBut then this video surfaced of Tristan ignoring Khloé as she tried to dance with him, and she looks super annoyed.\n\nJanuary 18, 2019\n\nKhloé is back at it with the cryptic messages. Speaking to E! News about her and her BFF Malika’s makeup collaboration with Becca Cosmetics, she says, “I think a lot of best friends can relate, especially when someone is going through a breakup or whatever. People always make this huge emphasis on Valentine’s Day, but you have each other.…You don’t always need a man to enjoy Valentine’s Day.”\n\nShe also posts a mysterious message on her Instagram Story about how “relationships are harder now” because “insecurities became a way of thinking, getting jealous became a habit, trust is hard to come by, being hurt became natural, and leaving became the only option.” Intense.\n\nInstagram/khloekardashian\n\nFebruary 13, 2019\n\nAfter a full month goes by without Khloé and Tristan being seen publicly together, a source tells People that Khloé “rarely talks about him.”\n\n“Khloé and True are happy in Los Angeles,” the source said. “They spend very little time in Cleveland, where Tristan is. She very much acts like a single mom.”\n\nFebruary 14, 2019\n\nTristan and Khloé spend Valentine’s Day apart. He sends Khloé a huge bouquet of flowers, which she’s quick to share on Instagram—but in her caption, she only refers to him as True’s “daddy.” She then proceeds to post more cryptic (and pretty sad) messages on her IG Story.\n\nInstagram.com/khloekardashian\n\nInstagram.com/khloekardashian\n\nInstagram.com/khloekardashian\n\nFebruary 16, 2019\n\nTristan is seen out partying in L.A. without Khloé. Of course, Khloé responds in her usual way: by posting a quote to her Instagram Story. “Be careful with how much you tolerate,” it reads. “You are teaching them how to treat you.”\n\nFebruary 19, 2019\n\nTMZ reports that Tristan cheated on Khloé with Kylie Jenner’s best friend Jordyn Woods. Over Valentine’s Day weekend, Tristan and Jordyn allegedly met at his exclusive party in L.A., and the two were “all over each other.” Originally, he claimed it was “fake news,” but according to a source, he admitted to cheating after Khloé confronted him. The Kardashian-Jenner family is “beyond disgusted” and decides to cut off all ties with both Tristan and Jordyn.\n\n\n\nInstagram\n\nFebruary 20, 2019\n\nUs Weekly says Khloé confronted Tristan and Jordyn about the rumors, and Tristan admitted they were true.\n\nKhloé then goes and Likes this tweet:\n\nShortly after, the Kardashians start to unfollow both Jordyn and Tristan, and Khloé deletes a bunch of Instagrams featuring Tristan. Kylie Jenner remains radio silent.\n\nFebruary 26, 2019\n\nKhloé addresses the situation directly for the first time.\n\n“Hi loves, wanted you to know that I appreciate you!” she writes. “I’ve been reading your kind words and they really are a blessing to me. I love you! Thank you, thank you! I’ll be back when I’m in the mood to chat with you all. Until then, remember to be kind to one another.”\n\n\n\nMeanwhile, People reports that Tristan has been trying to apologize to Khloé.\n\nMarch 1, 2019\n\nJordyn appears on Jada Pinkett Smith’s show Red Table Talk, to spill the tea, and it is DRAMATIC.\n\nHere’s the TL;DR version: Jordyn denies hooking up with Tristan, says she never gave him a lap dance, admits they did kiss, and admits to being drunk at the time.\n\nAfter seeing this, Khloé goes OFF on Twitter.\n\nIn short: It’s a mess.\n\nMarch 2, 2019\n\nKhloé walks back some of her comments after catching heat for blaming Jordyn alone for “breaking up” her family.\n\n“This has been an awful week & I know everyone is sick of hearing about it all (as am I). I’m a roller coaster of emotions & have said things I shouldn’t have. Honestly, Tristan cheating on me & humiliating me wasn’t such a shock as the first time.…What’s been harder & more painful is being hurt by someone so close to me. Someone whom I love & treat like a little sister. But Jordyn is not to be blamed for the breakup of my family. This was Tristan’s fault.…I have to move on with my life & count my blessings, my family, my health & my beautiful baby True.”\n\nMarch 16, 2019\n\nKhloe sweetly says her drama with Tristan will never come between their individual relationships with their daughter, True.\n\nMarch 27, 2019\n\nA Keeping Up With the Kardashians show teaser reveals they got (almost) the whole relationship fallout on camera.\n\nApril 16, 2019\n\nKhloé and Tristan cohost True’s 1st birthday party, and it’s massively awk.\n\nJune 2, 2019\n\n\n\nKhloé tells her bestie Malika Haqq on an episode of Keeping Up With the Kardashians that Tristan’s cheating “demolished” their relationship, even though she loves him.\n\n“Are you still in love?” Malika asks.\n\n“I am in love. I know I love him. But still, I’m not going to act like nothing’s wrong,” Khloé says.\n\n“Don’t you want that change?” Malika asks.\n\n“Totally. But I’m not going to force that,” Khloé says. “He counts—‘It’s been seven months.’ I’m like, ‘So it’s been seven months.’ I’m allowed to do things when I want to do it. But he also needs to know: ‘Your one stupid weekend or whatever you did, look what it did to three years of a relationship. It just demolished it. So was that worth it for you?’”\n\nSeptember 4, 2019\n\nNews breaks that Tristan is apparently trying to win Khloé back by showering her with gifts (like a $500,000 Porsche) and asking Drake for advice.\n\nNovember 11, 2019\n\nTristan posts a lowkey thirsty Instagram with paragraphs and paragraphs of praise for Khloé, and people in the comments are not amused.\n\nDecember 6, 2019\n\nDuring a KUWTK ep, Tristan gifted Khloé a big ol’ diamond necklace. She posts on Insta to explain/defend that he was still in her life, saying: “Yes, I’m allowed to feel hurt and pain. It would be unnatural for me to pretend as if I don’t.…I have chosen to NOT pollute my heart and my energy by holding on to anything negative.…I am allowed to forgive but still not accept their behaviors.…I was nothing but beautiful blessings for EVERYBODY that has ever been in my life.” She then clarified that she was talking about Tristan and Jordyn, so, sure.\n\nDecember 24, 2019\n\nKhloé and Tristan reunite for the Kardashian holiday party and apparently “there was no tension or drama, just a lot of love and family time. Khloé and Tristan were great.”\n\nMarch 20, 2020\n\n\n\nEven though both parties had been pretty insistent that the two were not back together, Us Weekly breaks the news that the two are quarantining together. Per a source, “Khloé doesn’t have bad or negative feelings toward Tristan at this point. Being quarantined has made her have a soft spot for him, and she knows he will always be part of her life in some way because he is True’s dad. Khloé has been open and receptive toward Tristan.” Open and receptive, huh?\n\nApril 22, 2020\n\nIn an ep of KUWTK, Khloé was in the process of freezing her eggs. Even though she and Tristan aren’t together, he agreed to be her sperm donor. “Tristan will do whatever I want to do,” she told her sisters—who were less than enthused about the whole idea—and later in the ep, Tristan seemed eager to go through with it.\n\nJune 9, 2020\n\nAt a friend’s b-day party, Tristan and Khloe look…extremely cozy, let’s say. They’re recording everyone singing “Happy Birthday” on their phones and his arm is wrapped around her. She’s leaning into him. They look like they’re together, TBH. Fans are immediately theorizing about a reunion.\n\nAugust 5, 2020\n\nYep: Apparently, the two are back together. “Khloé is hopeful that Tristan has changed for good and will continue to grow and be the great and loyal partner that he has been throughout their time together during the [coronavirus] quarantine,” a source tells Us Weekly, and “Khloé would love to give daughter True a sibling because she is at the perfect age.”\n\nNovember 2, 2020\n\nThe two dress in matching Halloween costumes with their daughter (Marc Antony and Cleopatra) but Khloé shuts down rumors that she’s preg in the comments:\n\nNovember 17, 2020\n\n\n\nAfter Khloé wins a People’s Choice Award, Tristan sends her a huge bouquet of pink flowers.\n\nFebruary 4, 2021\n\nIn a KUWTK ep, Khloé said she was “ready” to conceive a second baby with her frozen embryos and Tristan said he was “all for it.” “In my head, when I was gonna have kids, I never ever imagined having an only child,” she explained.\n\nJune 17, 2021\n\nUgh: The Daily Mail reports that Tristan was at Nessel “Chubbs” Beezer’s L.A. party and entered into a bedroom with three women.\n\nJune 21, 2021\n\nA bunch of outlets confirm it: The duo have broken up again.\n\nOctober 2021\n\nAccording to a May 2022 episode of Hulu’s The Kardashians, Khloé got back together with Tristan just before Travis Barker proposed to her sister Kourtney. “Tristan flew in for the proposal. This was something he was not going to miss.…We’re good. We’re actually in a really good place. We just got back together. He’s been going to therapy a lot. There’s just been a lot of effort on his part.” She added, “I have a lot of hope and faith and optimism for our future together.”\n\nDecember 3, 2021\n\nThe drama just continues: Personal trainer Maralee Nichols gives birth to a baby boy and says Tristan is the father. And if your math skills are good, that means you know they conceived in March 2021, when Tristan was still with Khloé (along with speculation that Khloé and Tristan are together, again, in December 2021, when the news breaks). Maralee sues for child support.\n\nDecember 6, 2021\n\nA source tells Us Weekly, “This is a very sad time for Khloé. She really loves Tristan and still held a candle for him. She thought he might have changed his ways.…Khloé now knows that Tristan was unfaithful to her when they were back together.”\n\nJanuary 3, 2022\n\nTristan confirms paternity of Maralee’s child and writes on his Instagram Stories, “Khloé, you don’t deserve this. You don’t deserve the heartache and humiliation I have caused you. You don’t deserve the way I have treated you over the years. My actions certainly have not lined up with the way I view you. I have the utmost respect and love for you. Regardless of what you may think. Again, I am so incredibly sorry.”\n\nMarch 9, 2022\n\nKhloé admits the paternity drama will play out on the new show. “I wish I never had to talk about that because it’s not a fun thing to talk about…but it is part of my journey in life, so we will see it on the show.”\n\nMarch 11, 2022\n\nIn court docs obtained by Us Weekly, Tristan told Maralee over Snapchat in October 2021 (after she told him she was pregnant), “I’m engaged but I will be married soon. I told you I won’t and can’t be in the child life at all by no means.…Why not wait till yoj [sic] find the right person to have a family with. Why would you want a baby with a man that’s engaged. You wanna keep a mistake.” Apparently, he also spent $2 million on a ring—so even though it wasn’t ever announced, the two were allegedly planning on getting married. Tristan says that the texts are fake, FYI.\n\nApril 6, 2022\n\nIn a tell-all with Robin Roberts, Khloé kinda addresses the situation: “I still think [Tristan’s] a great guy, and he’s a great dad. He’s just not the guy for me.” There you have it.\n\nMay 9, 2022\n\nThe Kardashians executive producer Danielle King confirms that the literal moment Khloé found out about the paternity scandal is *on camera*. “We were there to film something else early in the morning, and the morning that news broke, we legitimately just happened to be there.”\n\nMay 19, 2022\n\nIn an episode filmed in 2021 before the paternity scandal, Khloé says Tristan is “never leaving” the family. “Mom and Dad were best friends, Dad and Stepdad played golf together once a week, Scott [Disick] is never leaving, Kanye is never leaving, looks like you’re never leaving,” she told Tristan. He replied, “More like you’re never leaving me.” Ugh.\n\nMay 21, 2022\n\nTristan is (no surprise) not at Kourtney and Travis’s wedding in Italy (attended by Khloé, naturally) but has some father-daughter time with True.\n\nJune 9, 2022\n\nA new episode of The Kardashians debuts and fans get to relive the drama that was Tristan’s third (!!) cheating scandal. Not only do we find out the fact that Kim Kardashian found out about it before Khloé did, but we also get to hear the sisters’ phone calls IRL as they’re all made aware of the news. *le sigh*\n\n“I’m, like, shaking for [Khloé], my soul dies for her,” Kim told Kylie on the phone just after the exact moment she found out Tristan was being sued for child support. “No, she’s not awake, and what’s so fucking crazy is he wrote a whole declaration, let me read this to you. This is Tristan talking, these are his words,” she continued. “This is his whole declaration. He’s asking for a paternity test and admitting that he had sex with her. Khloé threw him his 30th birthday. So he went home from the 30th birthday party, went to Houston to play on the road, we can check his schedule, and then slept with this girl.”\n\n\n\nAs always, hindsight is twenty-twenty, and we now know that despite Tristan initially denying that he fathered a third child with Maralee Nichols, he actually…totally did. Luckily, Khloé seems to be in a better place (plus, she did get to go to the Met Gala this year), and TBH, that’s all we can ask. She has truly gone through it!\n\nAugust 5, 2022\n\nKhloé and Tristan welcome baby number two via surrogate! A source at the time tells Entertainment Tonight at the time that it’s a baby boy. The news was initially announced in mid-July, during which an insider dished to Us Weekly that Tristan has “tried countless times to win back” Khloé, but “she’s done with him for good romantically” and now they’re “strictly co-parenting,” which, fair!\n\nMarch 8, 2023\n\nAbout two months after Tristan’s mom sadly passed away, it’s reported that the reality TV star has been spending time with him. A source tells Entertainment Tonight that not only is Khloé’s entire family looking after her ex and his brothers since the death but that they have also “been sending flowers, keeping them engaged, and making sure they know they are loved and supported.”\n\n“Khloé has been very cognizant of making sure Tristan and his brothers don’t feel alone, and she has been doing her best to help them as they deal with this tragic loss. She has acted as an amazing support system.…Tristan wants to show the world, Khloé, and his mom—his guardian angel—the man and father that he can be, even more so now,” the insider adds. Unclear what might be in the cards for these two, but what we do know for sure is that they remain focused on their children. “Both Khloé and Tristan are extremely hands-on parents and True is absolutely loving being an older sister to her baby brother.”\n\n\n\nApril 11, 2023\n\nLooks like Tristan is moving back to California! The athlete was recently traded to the Los Angeles Lakers, which means he’ll be moving back to California. Of the career switch, a source tells People, “Khloé is supportive of Tristan joining the L.A. Lakers. She wants him to have a career. Having Tristan on the road again concerns Khloé. This is when all the cheating happened in the past.”\n\nThe insider adds that the former couple recently “became very close again” after Tristan’s mom died, with a second source adding, “Khloé thinks Tristan is a great dad, which she’s grateful for.…That sometimes makes it harder to completely shut the door on anything romantic.”\n\nIn-ter-est-ing!\n\nJune 8, 2023\n\nDuring an episode of The Kardashians, Khloé opens up about how she and Tristan are handling their co-parenting duties during a convo with her mom Kris Jenner. “Tristan and I, we always get along great,” she begins before adding, “Him and I have a great friendship relationship, we get along fine, and for my kids, I will put anything to the side.”\n\n“What's done is done, so what would I still be holding on to something for? I don't need to ‘punish’ him because I'm not getting back with him,” she continues.\n\nMarch 13, 2024\n\nKhloé celebrates her ex's 33rd birthday with an Instagram Story that features the basketball star with their two children. “Happy birthday @realtristan13. Your mommy is proud of you,” she captions the snap.\n\nJune 6, 2024\n\nIn a new episode of The Kardashians, the Good American founder details what her dating life looks like nowadays to Scott Disick. The celeb *also* dishes on how she feels about her future with Tristan, saying the “door is closed” romantically. Plus, the athlete's return to the Cleveland Cavaliers has been “really, really healthy for us” because of the increased space, she notes.\n\n“When Tristan was next door he was always over,” she adds.\n\nJune 27, 2024\n\nTristan dedicates a buncha Instagram Stories to Khloé in honor of her 40th birthday. “Happy birthday Khloé,” the pro athlete pens over an image of himself and the reality star with their two children. He also shares another snap of Khloé and their daughter True, writing, “You are the best mom.”\n\n“You are my best friend,” he adds in the following slide before posting a photo of Khloé with his youngest brother Amari alongside the caption, “And the most incredible person I’ve ever met.”\n\nTristan Thompson // Instagram\n\nTristan Thompson // Instagram\n\nTristan Thompson // Instagram\n\nTristan Thompson // Instagram\n\nThis post was originally published in September 2017. It has been updated throughout.\n\n", "images": ["https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=currentColor&id=link-out-embed", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2025-11-13-at-8-26-25-am-6915dccd7e9c7.png?crop=0.563xw:1.00xh;0.219xw,0&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523ffffff&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://hips.hearstapps.com/hmg-prod/images/tristan-thompson-and-khloe-kardashian-pose-for-a-photo-as-news-photo-930538154-1550699201.jpg?crop=0.629xw:0.465xh;0.151xw,0.0151xh&resize=640:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/khloe-ig-story-2-1550702143.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/beastinme-102-240924-cs-00259-r-6917adfc5ec1f.jpg?crop=0.668xw:1.00xh;0.154xw,0&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/cosmopolitan/static/images/logos/network-logo.722abed.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/rs-634x1024-170219133928-634-khloe-kardashian-tristan-thompson-snapchat-kg-021917-1506468409.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/globe-simple-regular.e7f303c.svg", "https://hips.hearstapps.com/hmg-prod/images/selling-the-oc-cast-leave-6915b3b002820.jpg?crop=0.505xw:1.00xh;0.274xw,0&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523ffffff&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/cosmopolitan/static/images/logos/logo.eca17dd.svg?primary=%2523000000", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2019-02-20-at-2-19-34-pm-1550690399.png?crop=1xw:1xh;center,top&resize=640:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/khloe-ig-story-1-1550702111.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2019-02-20-at-2-16-52-pm-1550690252.png?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/prince-andrew-duke-of-york-and-king-charles-iii-attend-news-photo-1763066178.pjpeg?crop=0.758xw:1.00xh;0.122xw,0&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523ffffff", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/bookmark-simple-regular.9d9d56b.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523000000&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/clock-regular.b2f2888.svg", "https://hips.hearstapps.com/hmg-prod/images/m-the-puppet-master-jeff-probst-addresses-the-remaining-news-photo-1585256153.jpg?crop=0.676xw:1.00xh;0.0401xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2024-06-28-at-12-38-19-pm-667ee768a7cbf.png?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/wicked-brand-collabs-2025-69028628d3416.png?crop=0.502xw:1.00xh;0.498xw,0&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2024-06-28-at-12-38-25-pm-667ee74a73b0b.png?resize=980:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/envelope-simple-regular.91a0134.svg", "https://hips.hearstapps.com/hmg-prod/images/tristan-ig-story-1550701477.jpeg?crop=1xw:1xh;center,top&resize=640:*", "https://hips.hearstapps.com/hmg-prod/images/khloe-cryptic-message-1550699918.jpeg?crop=1xw:1xh;center,top&resize=640:*", "https://hips.hearstapps.com/vidthumb/images/screen-shot-2022-02-03-at-3-13-42-pm-1643919322.jpg?crop=0.9962319639738993xw:1xh;center,top", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/untitled-design-2024-09-18t103848-899-66eae66b47c2d.png?crop=0.330xw:0.660xh;0.335xw,0.0929xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/sarah-ferguson-duchess-of-york-attends-the-traditional-news-photo-1763131536.pjpeg?crop=0.883xw:1.00xh;0.0595xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1085005904.jpg?crop=0.668xw:1.00xh;0.167xw,0&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/tristan-thompson-and-khloe-kardashian-pose-for-a-photo-as-news-photo-930538154-1550699201.jpg?crop=0.917xw:0.339xh;0,0.0391xh&resize=1200:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2019-02-20-at-1-36-35-pm-1550688011.png?crop=1xw:1xh;center,top&resize=980:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/image-uploaded-from-ios-100-1550680507.png?crop=1xw:1xh;center,top&resize=640:*", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2024-06-28-at-12-38-34-pm-667ee77d430ab.png?resize=980:*", "https://www.cosmopolitan.com/_assets/design-tokens/cosmopolitan/static/images/logos/logo.eca17dd.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/travis-barker-and-kourtney-kardashian-attend-the-2021-mtv-news-photo-1650562931.jpg?crop=0.780xw:0.520xh;0.120xw,0.0267xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2019-02-20-at-11-37-59-am-1550680694.png?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2024-06-28-at-12-38-41-pm-667ee7933d941.png?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/568669905-1390146615809557-6973902315575227966-n-68fa6145198d0.jpg?crop=1xw:0.6417100694444444xh;center,top&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/khloe-ig-story-3-1550702169.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/headphones-regular.117021e.svg?primary=%2523ffffff", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/kareem-1523828246.jpg?crop=0.75xw:1xh;center,top&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/171339-0701-v1-691b41c82c55d.jpg?crop=0.803xw:1.00xh;0.0913xw,0&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/disney-night-its-the-most-enchanting-night-of-the-season-as-news-photo-1759888936.pjpeg?crop=0.732xw:0.916xh;0.146xw,0.0581xh&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2019-02-20-at-1-23-26-pm-1550687050.png?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/season-3-momtok-is-back-but-damaging-revelations-and-news-photo-1763047973.pjpeg?crop=0.668xw:1.00xh;0.167xw,0&resize=360:*", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/caret-left-regular.5546078.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523000000&id=social-button-icon", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/x-regular.e414d97.svg", "https://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/saved.ad81f1a.svg?primary=%2523ffffff"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/tristan-thompson-and-khloe-kardashian-pose-for-a-photo-as-news-photo-930538154-1550699201.jpg?crop=0.917xw:0.339xh;0,0.0391xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.cosmopolitan.com/entertainment/celebs/a12479250/khloe-kardashian-tristan-thompson-relationship-timeline/", "title": "A Definitive Timeline of Khloé Kardashian and Tristan Thompson’s Entire Relationship", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Khloé Kardashian and Tristan Thompson Relationship Timeline", "description": "All the details of Khloé Kardashian and Tristan Thomspon's relationship, from the relationships, to the paternity scandal, to the breakups.", "keywords": "Khloe Kardashian, Tristan Thompson, true thompson, khloe and tristan, tristan cheating rumors, tristan thompson cheating, tristan thompson affair, khloe kardashian pregnant", "theme-color": "#000000", "og": {"site_name": "Cosmopolitan", "title": "A Definitive Timeline of Khloé Kardashian and Tristan Thompson’s Entire Relationship", "description": "Tristan just penned the sweetest message for the reality star in honor of her 40th birthday.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/tristan-thompson-and-khloe-kardashian-pose-for-a-photo-as-news-photo-930538154-1550699201.jpg?crop=0.917xw:0.339xh;0,0.0391xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.cosmopolitan.com/entertainment/celebs/a12479250/khloe-kardashian-tristan-thompson-relationship-timeline/", "type": "article"}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "opinion": "false", "section": "Celebs", "modified_time": "2024-06-28T16:44:00Z", "published_time": "2024-06-28T16:44:00Z"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "parsely-metadata": "{\"socialHeadline\":\"A Definitive Timeline of Khloé Kardashian and Tristan Thompson’s Entire Relationship\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/tristan-thompson-and-khloe-kardashian-pose-for-a-photo-as-news-photo-930538154-1550699201.jpg?crop=0.631xw:0.466xh;0.151xw,0.0154xh&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/tristan-thompson-and-khloe-kardashian-pose-for-a-photo-as-news-photo-930538154-1550699201.jpg?crop=0.917xw:0.339xh;0,0.0391xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/tristan-thompson-and-khloe-kardashian-pose-for-a-photo-as-news-photo-930538154-1550699201.jpg?crop=0.631xw:0.466xh;0.151xw,0.0154xh", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/tristan-thompson-and-khloe-kardashian-pose-for-a-photo-as-news-photo-930538154-1550699201.jpg?crop=0.917xw:0.339xh;0,0.0391xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "timely", "sailthru.excerpt": "Khloé Kardashian and Tristan Thompson’s rocky relationship conjures up a whole range of  emotions: Yay, True is so cute! Wow, Tristan, WTF is wrong with you? Khloé, you deserve better! Jordyn Woods, um, what? They’re…getting back together? Oh no, the paternity scandal! Rumors they were engaged before the news", "sailthru.tags": "entertainment,Pop Culture,celebs,Celebs,celebrity-relationship-timelines,Celebrity Relationship Timelines,celebrity-breakups-divorces,Celebrity Breakups,keeping-up-with-the-kardashians,The Kardashian Family,Cosmopolitan-US", "sailthru.date": "2024-06-28 16:44:00", "sailthru.socialtitle": "A Definitive Timeline of Khloé Kardashian and Tristan Thompson’s Entire Relationship", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1719593040.0, "source": "https://www.cosmopolitan.com", "summary": ""}