{"url": "www.inquisitr.com/4762190/robert-pattinson-2018-kristen-stewarts-ex-reportedly-flirting-with-kylie-minogue-bella-hadid-and-katy-perry/", "text": "Many fans were shocked when it was first confirmed that Robert Pattinson ended his relationship with FKA Twigs after many years of dating. Speculation about the former couple’s breakup sparked after the Twilight actor said that he was “kind of” engaged to the “Pendulum” singer during an appearance on The Howard Stern Show in July 2017. New reports suggest that the former beau of Kristen Stewart is now ready to move on from the English musician.\n\nRumors have it that Robert Pattinson is exclusively seeing Kylie Minogue. A mutual pal reportedly set up Kristen Stewart’s ex-boyfriend and the “Can’t Get You out of My Head” songstress in December 2017. It was even claimed that Kylie brought the Twilight actor to her Melbourne flat.\n\n“They have a lot in common and seem to like each other a lot.”\n\nThis is not the first time the Robert Pattinson and Kylie Minogue were rumored to be hitting on each other. As a matter of fact, the two sparked dating rumors after the former fiance of FKA Twigs was sighted kissing the Aussie singer at Cannes Films Festival in May 2014. People shared that Robert and Kylie exchanged kisses when they appeared on a special edition of a French talk show.\n\nAside from Kylie Minogue, Robert Pattinson was also linked to Bella Hadid lately. The Cosmopolis star and Gigi Hadid’s younger sister sparked romance rumors after they were allegedly spotted getting flirty with each other at the recent Dior Homme Menswear show in Paris. HollywoodLife shared that Robert and Bella “make a good looking couple” while posing for photos at the event. The publication shared that brief encounter possibly “hints at a new relationship.”\n\nEarlier this week, an unnamed Wonderwall source claimed that Robert Pattinson was seen kissing Katy Perry in Los Angeles. Together with their pals, the former Twilight star and the “Roar” singer reportedly had dinner at Taix French Restaurant in Echo Park on Friday, Feb. 26. The eyewitness claimed that Robert and Katy were “making out,” adding that they look like a real couple.\n\nPrior to the most recent claim, Robert Pattinson and Katy Perry have repeatedly denied the reports saying that they are dating. The duo has emphasized that they are just close to each other. “He’s my bud, I’m like his big sister,” the “Thinking of You” hitmaker previously said.\n\nWhile these dating reports could be true, Gossip Cop has already debunked these rumors . The news outlet stated that Robert Pattinson and Kylie Minogue had not developed a romance despite the dating reports. An unnamed tipster also revealed to the publication that the former beau of Kristen Stewart did not cozy up with Bella Hadid and described the claim as “wrong” and “dumb.”\n\nThey were totally caught making out! https://t.co/FJlsvlxlu2 — HollywoodLife (@HollywoodLife) January 28, 2018\n\nIn another report, the popular fact-checking website also claimed that Robert Pattinson and Katy Perry were not “spotted kissing” during a “flirty dinner.” An unidentified informant close to the ex-girlfriend of Orlando Bloom reportedly clarified that “such a thing never happened.” The publication also blasted HollywoodLife for claiming that Robert has been “ majorly crushing ” on the “Teenage Dream” hitmaker.\n\nNew titles added include Robert Pattinson’s ‘Damsel’ https://t.co/QaIevHBvmr — Variety (@Variety) January 15, 2018\n\nAfter his infamous split from FKA Twigs, Robert reportedly wants to focus more on his career. Previous reports claimed that the Twilight star wants to grow more as an artist, especially after he regained popularity due to the success of the Good Time movie . Kristen Stewart’s former on-screen partner, Kylie Minogue, Bella Hadid, and Katy Perry have yet to comment on these dating rumors. Stay tuned for the latest news and updates about Robert Pattinson!", "images": ["https://www.inquisitr.com/wp-content/uploads/2025/10/2421769f-57a4-4bff-913f-cf316747493e.jpg", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20500%20157'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20492%20142'%3E%3C/svg%3E", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo-white.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "https://secure.gravatar.com/avatar/4370e6aa6581e2b0edcee691b6cd4296?s=120&d=mm&r=g", "https://www.inquisitr.com/wp-content/uploads/2024/12/inquisitr-logo.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent-Dark-Mode.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20120%20120'%3E%3C/svg%3E"], "top_img": "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "keywords": [], "authors": ["News Writer"], "canonical_link": "https://www.inquisitr.com/robert-pattinson-2018-kristen-stewarts-ex-reportedly-flirting-with-kylie-minogue-bella-hadid-and-katy-perry", "title": "Robert Pattinson 2018: Kristen Stewart’s Ex Reportedly Flirting With Kylie Minogue, Bella Hadid And Katy Perry", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "https://www.inquisitr.com/wp-content/uploads/2024/12/favicon.png", "description": "Many fans were shocked when it was first confirmed that Robert Pattinson ended his relationship with FKA Twigs after many years of dating. Speculation about", "robots": "follow, index, max-snippet:-1, max-video-preview:-1, max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Robert Pattinson 2018: Kristen Stewart’s Ex Reportedly Flirting With Kylie Minogue, Bella Hadid And Katy Perry - Inquisitr News", "description": "Many fans were shocked when it was first confirmed that Robert Pattinson ended his relationship with FKA Twigs after many years of dating. Speculation about", "url": "https://www.inquisitr.com/robert-pattinson-2018-kristen-stewarts-ex-reportedly-flirting-with-kylie-minogue-bella-hadid-and-katy-perry", "site_name": "Inquisitr News"}, "article": {"tag": "Robert Pattinson", "section": "Entertainment", "published_time": "2018-01-30T12:29:00-05:00"}, "twitter": {"card": "summary_large_image", "title": "Robert Pattinson 2018: Kristen Stewart’s Ex Reportedly Flirting With Kylie Minogue, Bella Hadid And Katy Perry - Inquisitr News", "description": "Many fans were shocked when it was first confirmed that Robert Pattinson ended his relationship with FKA Twigs after many years of dating. Speculation about", "site": "@theinquisitr", "creator": "@theinquisitr"}, "generator": "WP Rocket 3.18.3"}, "movies": [], "publish_date": 1517333340.0, "source": "http://www.inquisitr.com", "summary": ""}