{"url": "https://www.mayoclinic.org/diseases-conditions/bells-palsy/diagnosis-treatment/drc-20370034", "text": "Diagnosis\n\nThere's no specific test for Bell's palsy. Your healthcare professional looks at your face and asks you to move your facial muscles. You're asked to close your eyes, lift your brow, show your teeth and frown, among making other movements.\n\nOther conditions — such as a stroke, infections, Lyme disease, inflammatory conditions and tumors — can cause facial muscle weakness that mimics Bell's palsy. If the cause of your symptoms isn't clear, your healthcare professional may recommend other tests, including:\n\nElectromyography (EMG). This test can confirm the presence of nerve damage and determine how serious it is. An EMG measures the electrical activity of a muscle in response to stimulation. It also measures the nature and speed of the conduction of electrical impulses along a nerve.\n\nThis test can confirm the presence of nerve damage and determine how serious it is. An measures the electrical activity of a muscle in response to stimulation. It also measures the nature and speed of the conduction of electrical impulses along a nerve. Imaging scans. Magnetic resonance imaging (MRI) or computerized tomography (CT) may be needed on occasion to rule out other possible sources of pressure on the facial nerve, such as a tumor or skull fracture.\n\nMagnetic resonance imaging (MRI) or computerized tomography (CT) may be needed on occasion to rule out other possible sources of pressure on the facial nerve, such as a tumor or skull fracture. Blood tests. There is no blood test for Bell's palsy. But blood tests can be used to rule out Lyme disease and other infections.\n\nTreatment\n\nMost people with Bell's palsy recover fully — with or without treatment. There's no one-size-fits-all treatment for Bell's palsy. But your healthcare professional may suggest medicines or physical therapy to help speed your recovery. Surgery is rarely an option for Bell's palsy.\n\nBecause the eye on the affected side doesn't close, it's important to take steps to protect and care for that eye. Use lubricating eye drops during the day and an eye ointment at night to help keep your eye moist. Wear glasses or goggles during the day and an eye patch at night to protect your eye from getting poked or scratched. You may need to see a healthcare professional to monitor your eye.\n\nMedicines\n\nCommonly used medicines to treat Bell's palsy include:\n\nCorticosteroids, such as prednisone (Rayos, Prednisone Intensol). These are powerful anti-inflammatory agents. If they can reduce the swelling of the facial nerve, the nerve can fit more comfortably within the bony corridor that surrounds it. Corticosteroids may work best if they're started within several days of when symptoms start. Steroids started early improve the likelihood of complete recovery.\n\nsuch as prednisone (Rayos, Prednisone Intensol). These are powerful anti-inflammatory agents. If they can reduce the swelling of the facial nerve, the nerve can fit more comfortably within the bony corridor that surrounds it. Corticosteroids may work best if they're started within several days of when symptoms start. Steroids started early improve the likelihood of complete recovery. Antiviral drugs. The role of antivirals is not certain. Antivirals alone have shown no benefit compared with placebo. Antivirals added to steroids may benefit some people with Bell's palsy, but this is still not proved. Despite this, an antiviral medicine, such as valacyclovir (Valtrex) or acyclovir, is sometimes given in combination with prednisone in people with severe facial palsy.\n\nPhysical therapy\n\nParalyzed muscles can shrink and shorten, which may be permanent. A physical therapist can teach you how to massage and exercise your facial muscles to help prevent this from occurring.\n\nSurgery\n\nIn the past, decompression surgery was used to relieve the pressure on the facial nerve by opening the bony passage that the nerve passes through. Today, decompression surgery isn't recommended. Facial nerve injury and permanent hearing loss are possible risks associated with this surgery.\n\nRarely, plastic surgery may be needed to correct lasting facial nerve problems. Facial reanimation surgery helps make the face look more even and may restore facial movement. Examples of this type of surgery include an eyebrow lift, an eyelid lift, facial implants and nerve grafts. Some procedures, such as an eyebrow lift, may need to be repeated after several years.\n\nThere is a problem with information submitted for this request. Review/update the information highlighted below and resubmit the form. From Mayo Clinic to your inbox Sign up for free and stay up to date on research advancements, health tips, current health topics, and expertise on managing health. Click here for an email preview. Email Address 1 ErrorEmail field is required ErrorInclude a valid email address Learn more about Mayo Clinic’s use of data. We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in our Notice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email. Subscribe! Thank you for subscribing! You'll soon start receiving the latest Mayo Clinic health information you requested in your inbox. Sorry something went wrong with your subscription Please, try again in a couple of minutes Retry\n\nLifestyle and home remedies\n\nHome treatment may include:\n\nTaking pain relievers. Aspirin, ibuprofen (Advil, Motrin IB, others) or acetaminophen (Tylenol, others) are available without a prescription and may help ease your pain.\n\nAspirin, ibuprofen (Advil, Motrin IB, others) or acetaminophen (Tylenol, others) are available without a prescription and may help ease your pain. Doing physical therapy exercises. Massaging and exercising your face according to your physical therapist's advice may help relax your facial muscles.\n\nAlternative medicine\n\nAlthough there's little scientific evidence to support the use of alternative medicine to treat Bell's palsy, some people with the condition may benefit from the following:\n\nAcupuncture. Placing thin needles into a specific point in the skin helps stimulate nerves and muscles, which may offer some relief.\n\nPlacing thin needles into a specific point in the skin helps stimulate nerves and muscles, which may offer some relief. Biofeedback training. By teaching you to use your thoughts to control your body, biofeedback training may help you gain better control over your facial muscles.\n\nBy teaching you to use your thoughts to control your body, biofeedback training may help you gain better control over your facial muscles. OnabotulinumtoxinA (Botox). This medicine may help manage symptoms such as facial spasms and tearing. Injections of onabotulinumtoxinA also may help improve the balance of the face.\n\nPreparing for your appointment\n\nYou may start by seeing your healthcare professional. You may be referred immediately to a doctor who specializes in the nervous system, known as a neurologist.\n\nIt's good to prepare for your appointment. Here's some information to help you get ready.\n\nWhat you can do\n\nWrite down any symptoms you're experiencing. Be sure to include any that may seem unrelated to the reason for which you scheduled the appointment.\n\nBe sure to include any that may seem unrelated to the reason for which you scheduled the appointment. Write down key personal information. Have you had any major stresses or life changes recently? Sharing this type of information may help with a diagnosis.\n\nHave you had any major stresses or life changes recently? Sharing this type of information may help with a diagnosis. Make a list of all medicines. Include the dosages of any medicines you're taking. Write down any vitamins or supplements that you're taking too.\n\nInclude the dosages of any medicines you're taking. Write down any vitamins or supplements that you're taking too. Take a family member or friend along, if possible. Sometimes it can be hard to remember all of the information you get during an appointment. Someone who comes with you may remember something that you missed or forgot.\n\nSometimes it can be hard to remember all of the information you get during an appointment. Someone who comes with you may remember something that you missed or forgot. Write down questions you want to ask.\n\nPreparing a list of questions will help you make the most of your time with your health professional. For Bell's palsy, some basic questions to ask include:\n\nWhat's the most likely cause of my symptoms?\n\nAre there any other possible causes for my symptoms?\n\nWhat kinds of tests do I need?\n\nIs this condition likely temporary or long lasting?\n\nWhat treatments are available for Bell's palsy? Which do you recommend?\n\nAre there alternatives to the primary approach that you're suggesting?\n\nI have other health conditions. How can I best manage these conditions together?\n\nAre there any brochures or other printed material that I can take home with me? What websites do you recommend?\n\nDon't hesitate to ask any additional questions that occur to you during your appointment.\n\nWhat to expect from your doctor\n\nBe prepared to answer questions such as:\n\nWhen did you begin having symptoms?\n\nHave your symptoms been continuous or occasional?\n\nHow severe are your symptoms?\n\nWhat, if anything, seems to improve your symptoms?\n\nWhat, if anything, appears to worsen your symptoms?\n\nHave any of your relatives ever had Bell's palsy or problems with facial paralysis?\n\nHave you had any symptoms of a more generalized infection?\n\nWhat you can do in the meantime\n\nIf you have facial pain:\n\nTake pain relievers. Aspirin, ibuprofen (Advil, Motrin IB, others) or acetaminophen (Tylenol, others) can help with pain.\n\nAspirin, ibuprofen (Advil, Motrin IB, others) or acetaminophen (Tylenol, others) can help with pain. Apply moist heat. Putting a washcloth soaked in warm water on your face several times a day may help relieve pain.\n\nIf your eye won't close completely, try these tips:", "images": ["https://assets.mayoclinic.org/content/dam/media/global/images/2023/06/26/cont-ed-1676659-3734290-0048-C-415x275.jpg", "https://assets.mayoclinic.org/content/dam/media/global/images/2025/03/19/1710753_3980687_0060.png", "https://www.mayoclinic.org/-/media/web/gbs/shared/images/apple-touch-icon-152x152.svg", "https://assets.mayoclinic.org/content/dam/mayoclinic/images/logos/mayo-clinic-logo.svg", "https://assets.mayoclinic.org/content/dam/mayoclinic/images/icons/giving-charity.svg", "https://assets.mayoclinic.org/content/dam/media/global/images/2023/10/23/giving-to-mayo-em100063715-p-195580295-415x275.png", "https://assets.mayoclinic.org/content/dam/mayoclinic/images/badges/App_Store_Badge_EN.svg", "https://assets.mayoclinic.org/content/dam/media/global/images/2023/06/26/pt-visitor-Getty-1419492732-415x275.jpg", "https://assets.mayoclinic.org/content/dam/mayoclinic/images/badges/Google_Play_Store_badge_EN.svg", "https://assets.mayoclinic.org/content/dam/media/global/images/2023/06/26/mccms-Getty-1082003662-415x275.jpg"], "top_img": "https://www.mayoclinic.org/-/media/web/gbs/shared/images/apple-touch-icon-152x152.svg", "keywords": [], "authors": [], "canonical_link": "https://www.mayoclinic.org/diseases-conditions/bells-palsy/diagnosis-treatment/drc-20370034", "title": "Diagnosis and treatment", "meta_data": {"application-name": "", "msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "/-/media/web/gbs/shared/images/mstile-144x144.png", "viewport": "width=device-width, initial-scale=1.0", "format-detection": "telephone=no", "PocID": "CON-20370010", "Subject": "Palsy, facial", "Person Group": "19 to 44 younger", "Content Package": "Syndication Adult Health Information Content", "Expected Delivery Channel": "Web", "Description": "Learn more about this condition that causes temporary facial paralysis. Find out why it happens and what to do about it.", "PublishDate": "2024-03-15", "contentLanguage": "en"}, "movies": [], "publish_date": 1710475200.0, "source": "https://www.mayoclinic.org", "summary": ""}