{"url": "https://en.wikipedia.org/wiki/Grammy_Award_records", "text": "Throughout the history of the Grammy Awards, many significant records have been set. This page only includes the competitive awards which have been won by various artists. This does not include the various special awards that are presented by the National Academy of Recording Arts and Sciences such as Lifetime Achievement Awards, Trustees Awards, Technical Awards or Legend Awards. The page however does include other non-performance related Grammys (known as the Craft & Production Fields) that may have been presented to the artist(s).\n\nAwards [ edit ]\n\nMost Grammys won [ edit ]\n\nBeyoncé has won a total of 35 Grammy Awards\n\nThe record for the most Grammy Awards won in a lifetime is currently held by American singer, songwriter and record producer Beyoncé, who has won 35. Hungarian-British conductor Sir Georg Solti, the previous record holder and current second-most wins, has 31.\n\nMost Grammys won by a female artist [ edit ]\n\nBeyoncé has won 35 Grammy Awards.\n\nMost Grammys won by a male artist [ edit ]\n\nSir Georg Solti has won 31 Grammy Awards.\n\nMost Grammys won by a group [ edit ]\n\n22-time Grammy Winners, U2 in 2005\n\nU2 holds the record for most Grammy Awards won by a group. They have won 22 awards.\n\nMost Grammys won by a producer [ edit ]\n\n28-time Grammy Winner, Quincy Jones in 1997\n\nQuincy Jones holds the record for most Grammy Awards won by a producer, with 28 awards. Eleven of these were awarded for production duties; Jones has also received Grammys as an arranger and a performing artist. Some producers have also won awards as engineers, mixers, and/or mastering engineers.\n\nMost Grammys won by a rapper [ edit ]\n\nJay-Z, with 25 awards,[1] has won more Grammy Awards than any other rapper. Lauryn Hill is the most awarded female rapper, with eight Grammy Awards.[2]\n\nMost Grammys won by jazz artist [ edit ]\n\nChick Corea, with 28 awards, has won more Grammy Awards than any other jazz artist. Pat Metheny is second with 20 Grammy Awards.\n\nRank Artist Awards 1 Chick Corea 28 2 Pat Metheny 20\n\nMost Grammys won by an engineer or mixer [ edit ]\n\nŞerban Ghenea with 21 awards, has won more Grammy Awards than any other engineer or mixer.[3]\n\nRank Engineer / Mixer Awards 1 Serban Ghenea 21 2 Al Schmitt 20 3 Tom Elmhirst 17\n\nMost Grammys won in the country genre [ edit ]\n\nWith 21 country-specific Grammy Awards, Vince Gill has won more Grammy Awards in the genre than any other artist. Kacey Musgraves has the most country-specific Grammy Awards for female artists, with six.\n\nYoungest winners [ edit ]\n\n\"Youngest Grammy winners\" redirects here.\n\nLeAnn Rimes is the youngest individual Grammy winner and the youngest to win Best New Artist.\n\nThe Peasall Sisters are the youngest Grammy winners, when they were credited artists on the O Brother, Where Art Thou? soundtrack, which won Album of the Year in 2002.[10] Blue Ivy Carter is the youngest individually credited winner. She was 9 years old when she won her first award in 2021 after she was credited on her mother Beyoncé's song \"Brown Skin Girl\", released in 2019. LeAnn Rimes is the youngest individual winner. She was 14 years old when she won her first two awards in 1997. She was also the first country artist to win the Best New Artist Grammy.\n\nYoungest artists to win Album of the Year (as lead artist) [ edit ]\n\nBillie Eilish is the youngest artist to win the Grammys for Album of the Year and Record of the Year.\n\nBillie Eilish is the youngest artist to win Album of the Year as a lead. She was 18 years old while winning for her album When We All Fall Asleep, Where Do We Go? in 2020.\n\nYoungest artists to win Record of the Year [ edit ]\n\nAt 18 years of age, Billie Eilish became the youngest artist to win Record of the Year when she won for \"Bad Guy\" in 2020.\n\nYoungest artist to win Song of the Year [ edit ]\n\nLorde became the youngest Song of the Year winner in 2014.\n\nAt 17 years of age, Lorde became the youngest artist to win Song of the Year when she won for \"Royals\" in 2014.\n\nYoungest artist to win Best New Artist [ edit ]\n\nAt 14 years of age, LeAnn Rimes became the youngest Best New Artist winner when she won in 1997.\n\nOldest winners [ edit ]\n\nPinetop Perkins is the oldest Grammy winner, winning just weeks prior to his death\n\nPinetop Perkins is the oldest person to win a Grammy. In 2011 he was awarded with Best Traditional Blues Album for Joined at the Hip, at 97 years of age.\n\nRank Age Artist Year Won, Category, Work 1 97 years, 221 days Pinetop Perkins 2011, Best Traditional Blues Album, Joined at the Hip 2 95 years, 243 days Tony Bennett 2022, Best Traditional Pop Vocal Album, Love For Sale 3 95 years, 31 days George Burns 1991, Best Spoken Word or Non-Musical Recording Album (now called Best Spoken Word Album), Gracie: A Love Story 4 94 years, 132 days Jimmy Carter 2019, Best Spoken Word Album, Faith: A Journey For All 5 91 years, 361 days John Williams 2024, Best Instrumental Composition, Helena's Theme 6 91 years, 137 days Jimmy Carter 2016, Best Spoken Word Album, A Full Life: Reflections at 90 7 90 years, 52 days Elizabeth Cotten 1985, Best Ethnic or Traditional Folk Recording, Elizabeth Cotten Live! 8 90 years, 26 days Betty White 2012, Best Spoken Word Album, If You Ask Me (And Of Course You Won't)\n\nNote: Sources vary on the birth year of Elizabeth Cotten, with some stating it as 1893, while others say 1895. The above information credits it as 1895. With either year, Cotten is the oldest female Grammy winner.\n\nMost honored albums [ edit ]\n\nSantana's Supernatural holds the record for most honored album having won nine awards. Supernatural won nine awards in 2000.\n\nMost Album of the Year wins [ edit ]\n\nThe record for most Album of the Year wins is five.\n\nOne engineer/mixer; has won the award five times;\n\nOne artist, one engineer/mixer and two mastering engineers have won the award four times;\n\nThree recording artists, five record producers, three engineer/mixers and one mastering engineer have won the award three times;\n\nMost Record of the Year wins [ edit ]\n\nThe record for most Record of the Year wins is four. One mastering engineer has won the award four consecutive times;\n\nTwo recording artists and four engineers/mixers have won the award three times;\n\nMost Song of the Year wins [ edit ]\n\nThe record for the most Song of the Year wins is two. Fourteen songwriters have won in this category twice;\n\nMost Grammys won for consecutive studio albums [ edit ]\n\nBeyoncé won eight consecutive awards for eight consecutive studio albums.\n\nMost consecutive Grammys won for the same category [ edit ]\n\nArtists who have won all four General Field awards [ edit ]\n\nAdele is one of three artists who have won all four general field awards.\n\nThere have been only three artists who have won all four General Field awards: Album of the Year, Record of the Year, Song of the Year, and Best New Artist.\n\nIn 1981, Christopher Cross became the first artist to win all four awards, as well as the first act to win them all in a single year.[11]\n\nIn 2009, Adele won Best New Artist, and she earned the three other awards in both 2012 and 2017. She was the second artist to win all four accolades throughout her career.[12]\n\nIn 2020, Billie Eilish became the third musician to win all four awards and the first female artist to win them during a single ceremony.[13]\n\nSingle ceremony [ edit ]\n\nMost Grammys won in one night [ edit ]\n\nThe record for most Grammys won in one night is eight. Michael Jackson won eight in 1984 and is the only solo artist to do so. The group Santana tied with Michael Jackson’s record in 2000.[14][15]\n\nMost Grammys won by a male artist in one night [ edit ]\n\nMichael Jackson won a record eight awards in 1984\n\nThe record for most Grammys won by a male artist in one night is eight. Michael Jackson won eight in 1984.\n\nMost Grammys won by a female artist in one night [ edit ]\n\nAdele and Beyoncé won six awards in a single year.\n\nThe record for most Grammys won by a female artist in one night is six. Beyoncé and Adele each won six in 2010 and 2012, respectively.\n\nMost Grammys won by a group in one night [ edit ]\n\nSantana won a record-tying eight awards in 2000\n\nThe record for most Grammys won by a group artist in one night is eight. Santana won eight in 2000.\n\nMost Grammys won by a record producer in one night [ edit ]\n\nQuincy Jones won six Grammys in 1991, setting the record for most Grammys won by a producer in one night.\n\nThe record for most awards won by a producer in one night is six. The record was set by Quincy Jones who won six awards in 1991, including Album of the Year, Best Arrangement On An Instrumental, Best Instrumental Arrangement Accompanying Vocal(s), Best Jazz Fusion Performance, Best Pop Instrumental Performance, Best Rap Performance By A Duo Or Group, as well as Producer of the Year, Non-Classical for his own studio album Back on the Block.[16]\n\nFinneas O'Connell tied the record in 2020, winning Producer of the Year, Non-Classical and five additional awards, including Record of the Year, Album of the Year, Song of the Year, Best Engineered Album, Non-Classical, and Best Pop Vocal Album for his contribution on Billie Eilish's When We All Fall Asleep, Where Do We Go?.[17]\n\nMost Grammys won by an engineer or mixer in one night [ edit ]\n\nThe most Grammys won by an engineer or mixer in one night is six. At the 59th Annual Grammy Awards in 2017, Tom Elmhirst won Record of the Year, Album of the Year, Best Pop Vocal Album, Best Rock Album, Best Alternative Music Album, as well as Best Engineered Album, Non-Classical for his work on Adele's 25, Cage the Elephant's Tell Me I'm Pretty, and David Bowie's Blackstar respectively.[18]\n\nArtists who have won all four General Field Awards at a single ceremony [ edit ]\n\nChristopher Cross was the first artist to win all four general field categories in one night\n\nChristopher Cross (1981) and Billie Eilish (2020) are the only artists who have received all four General Field awards in one night.[19]\n\nArtists who have won Album, Record, and Song of the Year in one night [ edit ]\n\nThe three biggest Grammy Awards are Album of the Year, Record of the Year, and Song of the Year. Eight artists have won all three in one night. Adele is the first and only artist in Grammy history to accomplish this feat twice.\n\nMost Grammys won by an album in one night [ edit ]\n\nThe most awards awarded to an album in one night is nine. At the 42nd Annual Grammy Awards in 2000 Santana's Supernatural was awarded nine awards. It won Record of the Year, Album of the Year, Song of the Year, Best Pop Collaboration with Vocals, Best Pop Instrumental Performance, Best Pop Performance by a Duo or Group with Vocals, Best Rock Instrumental Performance, Best Rock Performance by a Duo or Group with Vocal, and Best Rock Album.\n\nMost posthumous Grammys won in one night [ edit ]\n\nRay Charles won five Grammys in 2005, less than a year after his death.\n\nRay Charles holds the record for most posthumous awards won in one night. He was awarded five Grammy Awards at the 47th Annual Grammy Awards in 2005, including both Record of the Year and Album of the Year.\n\nNominations [ edit ]\n\nMost Grammy nominations [ edit ]\n\nMost nominations in one night [ edit ]\n\nMichael Jackson and Babyface hold the record for most Grammy nominations in one night with 12 nominations each.\n\nMost nominations without winning [ edit ]\n\nWith 21 nominations, Chris Gehringer has received the most Grammy nominations without winning.\n\nMost nominations in one night without winning [ edit ]\n\nPaul McCartney was nominated for nine awards in 1966 but failed to win\n\nThe record for most Grammy nominations without a win in one night is 9, held by Paul McCartney. The record was set in 1966.\n\nGrammy nominations in the most fields [ edit ]\n\nMost Grammy nominated albums [ edit ]\n\nArtists who had been nominated for all four General Field awards in one night [ edit ]\n\nOnly fifteen artists have been nominated for all four General Field awards in one night. Lizzo is the oldest person to be nominated for all four awards in one night, at 31 years old; while the youngest person to be nominated is Billie Eilish at 17 years old. Both were nominated in 2020, making it the first time that two artists were nominated for all four awards in one night. This occurred for the second time in 2025, with Sabrina Carpenter and Chappell Roan. In 1968, Bobbie Gentry became the first person to be nominated for all four awards, followed by Christopher Cross in 1981 and Fun. in 2013, becoming the first male artist and first group to be nominated, respectively. In addition, Finneas O'Connell was nominated for all four General Field awards in 2022, but he was not credited as a performing artist in three of the four categories. Cross and Eilish went onto win all four general field awards on their respective nights, the only two artists to ever to do so to date.\n\nYoungest nominees [ edit ]\n\nHazel Monét is the youngest ever Grammy nominee, receiving a nomination for Best Traditional R&B Performance as a featured artist on her mother Victoria Monét's song \"Hollywood\" at nearly three years old.\n\nOldest nominee [ edit ]\n\nIn 2024, former United States President Jimmy Carter became the oldest Grammy nominee, at 100 years old.[22]\n\nSee also [ edit ]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Quincy_Jones_1997.jpg/250px-Quincy_Jones_1997.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Quincy_Jones_May_2014.jpg/250px-Quincy_Jones_May_2014.jpg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Beyonc%C3%A9_at_The_Lion_King_European_Premiere_2019.png/250px-Beyonc%C3%A9_at_The_Lion_King_European_Premiere_2019.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Lorde_-_Coachella_2014_%2806%29.jpg/250px-Lorde_-_Coachella_2014_%2806%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Santana_%281971%29.png/250px-Santana_%281971%29.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/George_H._W._Bush_with_Michael_Jackson_%28cropped%29.png/250px-George_H._W._Bush_with_Michael_Jackson_%28cropped%29.png", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Jay-Z_Kanye_Watch_the_Throne_Staples_Center_9_%28cropped%29.jpg/250px-Jay-Z_Kanye_Watch_the_Throne_Staples_Center_9_%28cropped%29.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Beyonc%C3%A9_-_Tottenham_Hotspur_Stadium_-_1st_June_2023_%286_of_118%29_%2852945304172%29_%28high_cropped%29.jpg/250px-Beyonc%C3%A9_-_Tottenham_Hotspur_Stadium_-_1st_June_2023_%286_of_118%29_%2852945304172%29_%28high_cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/2005-11-21_U2_%40_MSG_by_ZG.JPG/250px-2005-11-21_U2_%40_MSG_by_ZG.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Lee_Ann_Rimes_1999.jpg/250px-Lee_Ann_Rimes_1999.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/60px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Christopher_Cross_in_beaumont_ca_%282637703689%29.jpg/250px-Christopher_Cross_in_beaumont_ca_%282637703689%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Paul_McCartney_Headshot_%28cropped%29.jpg/250px-Paul_McCartney_Headshot_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Pinetop_Perkins_1.jpg/250px-Pinetop_Perkins_1.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/KennethBabyfaceEdmondsHWOFMay2013.jpg/250px-KennethBabyfaceEdmondsHWOFMay2013.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Ray_Charles_FIJM_2003.jpg/250px-Ray_Charles_FIJM_2003.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/Adele_2016.jpg/250px-Adele_2016.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Michael_Jackson_with_Grammy_Awards_in_1984.jpg/250px-Michael_Jackson_with_Grammy_Awards_in_1984.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Billie_Eilish_at_Pukkelpop_Festival_-_18_AUGUST_2019_%2801%29_%28cropped%29.jpg/250px-Billie_Eilish_at_Pukkelpop_Festival_-_18_AUGUST_2019_%2801%29_%28cropped%29.jpg"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Grammy_Award_milestones", "title": "Grammy Award milestones", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "viewport": "width=1120", "og": {"title": "Grammy Award milestones - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}