{"url": "www.inquisitr.com/4020146/gwen-stefani-blake-shelton-the-voice-season-12-premiere-flirting-pda-leaves-fans-unimpressed/", "text": "Gwen Stefani and Blake Shelton returned to TV screens for Season 12 of The Voice on February 27, but their on-set flirting had fans threatening to turn off.\n\nAfter taking two seasons away from The Voice as a coach, Gwen was back by her man’s side when Season 12 of the NBC singing show kicked off, but it turns out that not everyone was so happy to see Stefani and Shelton side by side, as their romance and PDA had some viewers reaching for the remote.\n\nA number of viewers took to social media to voice their opinions during The Voice’s Season 12 premiere opener, with some even threatening to turn off the series to avoid Blake and Gwen’s flirting that played a big part in the first episode of the popular NBC series.\n\n“If the Blake and Gwen relationship is going to be this annoying every episode I [probably] won’t watch The Voice anymore,” Twitter user @claireecruz5 tweeted out of The Voice’s Season 12 premiere, while @j_alatoree added, “Blake and Gwen’s relationship has ruined The Voice for me. They are already annoying me!”\n\n“When u realize that it’s going to be a long season of The Voice if Blake and Gwen keep flirting every 5 seconds #TheVoice,” Twitter user @makennaacypert wrote on the 140-character site during The Voice’s Season 12 premiere, alongside photos showing her turning off the show after seeing Shelton and Stefani’s gushing interactions.\n\n“@NBCTheVoice I wish the show was focused more on the talent than Gwen & Blake #annoying #TheVoice #ImOverIt #verydisappointing,” The Voice viewer @NicolFranz69 tweeted of Stefani’s flirty interactions with her boyfriend, while @riitaloretta wrote on the social media site during the premiere episode, “Gwen is so annoying on #thevoice. She legit brings up her relationship [with] Blake every 5 seconds.”\n\n“Gwen and Blake are nauseating,” The Voice fan @alleb35 then added as Shelton and Stefani showed off their flirting and romance, “and I’m gonna turn the show off.”\n\nGwen Stefani and Blake Shelton’s romance, which began after they met on the show in 2015, was on full display on the February 27 premiere episode of The Voice , as Entertainment Tonight reported that the couple’s co-coach Adam Levine even commented that being in the middle of Shelton and Stefani made him a little uncomfortable amid allegations Stefani’s return supposedly hasn’t exactly been championed by The Voice crew.\n\nAfter both Gwen and Adam pushed their buttons for a contestant, Blake made it pretty clear that he wanted to see the singer head to Stefani’s team, urging him to say yes to Gwen and not his longtime co-coach Adam.\n\n“When they both push, because they’re dating, sometimes I feel like a third wheel in this thing,” Levine then admitted of the awkward moment after Shelton and Stefani made it pretty clear that they aren’t going to be hiding their romance on Season 12 of The Voice like they have in past seasons.\n\nThe site then noted that Gwen also headed over and sat on Blake’s lap during the episode after once again bringing up the fact that she and Shelton are dating by calling the singer her “boyfriend” and telling a contestant that she could “use her connections to her boyfriend to help them navigate the world of country music” after they revealed their dreams to become a country star.\n\nYahoo! also reported that Stefani and Shelton’s romance was on full display on The Voice opener, confirming that Gwen sat on Blake’s lap more than once during the episode to show her affection for the country star, much to Levine’s dismay.\n\n“What happened to you, Blake? Are you okay?” Levine jokingly asked Shelton during the flirty episode with Stefani.\n\nWhat did you think of Blake Shelton and Gwen Stefani showing off their romance on the show? Was their PDA and flirting sweet or too much for The Voice Season 12 premiere?\n\n[Featured Image by Rachel Murray/Getty Images for Glamour ]", "images": ["https://www.inquisitr.com/wp-content/uploads/2025/10/2421769f-57a4-4bff-913f-cf316747493e.jpg", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20500%20157'%3E%3C/svg%3E", "https://secure.gravatar.com/avatar/673ddaf526e964d15376329334d8a5b2?s=120&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20492%20142'%3E%3C/svg%3E", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo-white.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/inquisitr-logo.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent-Dark-Mode.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20120%20120'%3E%3C/svg%3E"], "top_img": "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "keywords": [], "authors": ["News Writer"], "canonical_link": "https://www.inquisitr.com/gwen-stefani-blake-shelton-the-voice-season-12-premiere-flirting-pda-leaves-fans-unimpressed", "title": "Gwen Stefani & Blake Shelton’s ‘The Voice’ Flirting Leaves Fans Unimpressed", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "https://www.inquisitr.com/wp-content/uploads/2024/12/favicon.png", "description": "Gwen Stefani and Blake Shelton returned to TV screens for Season 12 of The Voice on February 27, but their on-set flirting had fans threatening to turn off.", "robots": "follow, index, max-snippet:-1, max-video-preview:-1, max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Gwen Stefani & Blake Shelton’s ‘The Voice’ Flirting Leaves Fans Unimpressed - Inquisitr News", "description": "Gwen Stefani and Blake Shelton returned to TV screens for Season 12 of The Voice on February 27, but their on-set flirting had fans threatening to turn off.", "url": "https://www.inquisitr.com/gwen-stefani-blake-shelton-the-voice-season-12-premiere-flirting-pda-leaves-fans-unimpressed", "site_name": "Inquisitr News"}, "article": {"tag": "The Voice", "section": "Entertainment", "published_time": "2017-02-28T07:08:00-05:00"}, "twitter": {"card": "summary_large_image", "title": "Gwen Stefani & Blake Shelton’s ‘The Voice’ Flirting Leaves Fans Unimpressed - Inquisitr News", "description": "Gwen Stefani and Blake Shelton returned to TV screens for Season 12 of The Voice on February 27, but their on-set flirting had fans threatening to turn off.", "site": "@theinquisitr", "creator": "@theinquisitr"}, "generator": "WP Rocket 3.18.3"}, "movies": [], "publish_date": 1488283680.0, "source": "http://www.inquisitr.com", "summary": ""}