{"url": "https://www.techtimes.com/articles/230031/20180613/incredibles-2-review-roundup-was-14-years-of-waiting-worth-it.htm", "text": "The Incredibles is one of Pixar's most acclaimed entries out of its impressive animation roster, praised for its many complex themes: familial tumult, what it means to be a superhero, and the perils of hiding one's true identity.\n\nThe family returns to the big screen 14 years later, picking up exactly where the last film left off — The Underminer is about to wreak havoc in the city, and Mr. Incredible, Elastigirl, Dash, Violet, and Jack Jack are all there to save the day.\n\nExcept Incredibles 2 faces a unique challenge in this new era of superhero saturation. When the first film premiered in 2004, superhero movies weren't big spectacles — or at least not as significant as they are today, with Marvel's films alone raking in billions of dollars in the box office. Now, audiences are starved for big-budget, larger-than-life superhero movies, but they're also parched for good stories; those cleverly upend the superhero formula but also take advantage of it in ways that feel novel surprising.\n\nIs 'Incredibles 2' Worth The Wait?\n\nMake no mistake: this is a superhero film. The usual suspects are present: a world is in peril, a villain is causing trouble, many things are at stake, and the Parr family must save the world. But this is also a film with Pixar's stamp of quality, which means the tropes are never just mere embellishments, but part of a larger ploy to tell a story with enormous heart and ingenuity. As such, even with the film industry inundated with superhero stories that have been told many times over, Incredibles 2 feels fresh, smart, and keen. But is it a worthy sequel?\n\nHere's what the critics are saying.\n\nIncredibles 2 Review Roundup\n\nCinemablend: \"Rather than being a disappointment, it is instead a shining example of how to do a follow-up properly — wonderfully advancing the fantastic established characters and world, playing with smart, modern themes, and featuring beautiful, engaging and fascinatingly-consistent animation.\"\n\nVox: \"Incredibles 2 lacks some of the tight plotting, well-choreographed action, and emotional moments of its predecessor, but it's still a boatload of fun.\"\n\nScreen Rant: \"It's a mostly fun and enjoyable summer family movie — though, with a nearly two-hour runtime, some children may struggle to stay engaged. Still, considering the strong and forward-thinking films Pixar has produced in recent years, Incredibles 2 is a sequel that arrived a decade too late.\"\n\nChicago Tribune: \"Others will disagree, but to me, Incredibles 2 falls short of the level of Toy Story 2 or Finding Dory. Those Pixar sequels wholly justified their existence in many satisfying ways, while doing their corporate duty and making hundreds of millions.\"\n\nConsequence of Sound: \"It's as bright and visually inventive as its predecessor, and finds cheeky new outlets for [Bard] Bird's unbridled cinematic sensibilities.\"\n\nRogerEbert.com: \"Incredibles 2 understands something that most family sequels, even the Pixar ones, fail to comprehend — we don't just want to repeat something we loved before. We want to love it all over again. You will with Incredibles 2.\"\n\nVulture: \"Brad Bird's Incredibles 2 is, much like its predecessor, delightful as an animated feature but really, really delightful as a superhero picture. It's proof that someone (not anyone, mainly Bird) can make a Marvel-type movie that's fleet and shapely, with action sequences rich in style rather than tumult.\"\n\nSlate: \"Incredibles 2 is a movie that lavishes attention on the details but loses sight of the whole, where you can't see the forest for the meticulously rendered trees.\"\n\nThe Village Voice: \"Pixar's not-so-secret secret has always been that they understand parenting better than anyone else who makes movies for children. And Incredibles 2 is at its best — which is to say, it's funniest and most exciting — when it tackles the internal dynamics of the family itself.\"\n\nVariety: \"The new movie, energized as it is, too often feels like warmed-over sloppy seconds, with a what-do-we-do-now? Riff that turns into an overly on-the-nose plot.\"\n\nIncredibles 2 opens June 15.", "images": ["https://g.techtimes.com/themes/favicons/apple-touch-icon.png", "https://d.techtimes.com/en/full/460462/ol-tessie.png?w=184&h=103&f=dd255b046aaf8d30e4ce606af81f2445", "https://d.techtimes.com/en/full/456731/waymo-will-take-driverless-cars-japan-next-week.png?w=184&h=103&f=4227f3bb8bd0e4f02836925b31e3748d", "https://d.techtimes.com/en/full/460464/legend-zelda.png?w=184&h=103&f=e0afd548e69c0a58fcac77ff495b2bdb", "https://d.techtimes.com/en/full/460420/smartphone.png?w=184&h=103&f=f7b8db8f48cad1c2f0dfffd277112f55", "https://pixel.quantserve.com/pixel/p-LfaarYPdxYFdP.gif", "https://b.scorecardresearch.com/p?c1=2&c2=19747886&cv=2.0&cj=1", "https://d.techtimes.com/en/full/460383/android.jpg?w=184&h=103&f=670d20891e4337d929b95a8557fda43c"], "top_img": "https://g.techtimes.com/themes/favicons/apple-touch-icon.png", "keywords": [], "authors": ["Carl Velasco"], "canonical_link": "https://www.techtimes.com/articles/230031/20180613/incredibles-2-review-roundup-was-14-years-of-waiting-worth-it.htm", "title": "Incredibles 2 Review Roundup: Was 14 Years Of Waiting Worth It?", "meta_data": {"viewport": "width=device-width,initial-scale=1", "news_keywords": "Culture,The Incredibles, Incredibles 2, Pixar, Disney", "description": "The much-awaited sequel to 2004’s ‘The Incredibles’ is about to hit the big screen. But was the 14-year wait worth it? Here’s what the critics are saying.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "fb": {"app_id": 263851690471857, "pages": 128026713884051}, "og": {"type": "article", "site_name": "Tech Times", "url": "https://www.techtimes.com/articles/230031/20180613/incredibles-2-review-roundup-was-14-years-of-waiting-worth-it.htm", "title": "Incredibles 2 Review Roundup: Was 14 Years Of Waiting Worth It?", "description": "The much-awaited sequel to 2004’s ‘The Incredibles’ is about to hit the big screen. But was the 14-year wait worth it? Here’s what the critics are saying."}, "article": {"publisher": "https://www.facebook.com/techtimes/", "section": "Culture", "tag": "Disney", "published_time": "2018-06-13T23:26:31-04:00", "modified_time": "2018-06-13T23:26:31-04:00"}, "twitter": {"site": "techtimes", "card": "summary_large_image", "title": "Incredibles 2 Review Roundup: Was 14 Years Of Waiting Worth It?", "url": "https://www.techtimes.com/articles/230031/20180613/incredibles-2-review-roundup-was-14-years-of-waiting-worth-it.htm", "description": "The much-awaited sequel to 2004’s ‘The Incredibles’ is about to hit the big screen. But was the 14-year wait worth it? Here’s what the critics are saying."}}, "movies": [], "publish_date": 1528862400.0, "source": "https://www.techtimes.com", "summary": ""}