{"url": "https://en.wikipedia.org/wiki/Miss_Teen_USA_2017", "text": "35th edition of the Miss Teen USA competition\n\nMiss Teen USA 2017 was the 35th Miss Teen USA pageant held at the Phoenix Symphony Hall in Phoenix, Arizona on July 29, 2017. Karlie Hay of Texas crowned her successor, Sophia Dominguez-Heithoff of Missouri at the end of the event. The pageant was hosted by celebrity personal trainer and author Heidi Powell and E! correspondent Erin Lim, while Mexican singer Jorge Blanco performed.\n\nIt was the first time the pageant was held in Arizona and the first to broadcast in high dynamic range (HDR) color, virtual reality and on PlayStation consoles.\n\nThis was the final year that Miss USA and Miss Teen USA pageants have held separately, due to scheduling changes of the succeeding year's pageant that Dominguez-Heithoff would be the shortest reigning titleholders in the pageant, which held for nine months and 19 days.\n\nPageant\n\nSelection of contestants\n\nOne delegate from the 50 states and the District of Columbia were selected in state pageants held from September 2016 to February 2017.\n\nPreliminary round\n\nPrior to the final competition, the delegates compete in the preliminary competition, which involves private interviews with the judges and a presentation show where they compete in athletic wear and evening gown. It was held on July 28, one day before the finals.[2]\n\nFinals\n\nDuring the final competition, the top 15 finalists compete in athletic wear, evening gown and in a customized final question round, and the winner is decided by a panel of judges.\n\nBroadcasting\n\nAll rounds of the pageant were webcast on the Miss U mobile app, the pageant's Facebook page and as downloadable live events available on the PlayStation Store for PlayStation 4 consoles. The final round was also streamed on Xbox One consoles via Mixer, with support for high dynamic range (HDR) using the HDR10 standard,[a] and on Xbox 360 consoles via Xbox Live.\n\nFor the first time, 360-degree broadcasts of the pageant were available for the Google Daydream, PlayStation VR and Samsung Gear VR headsets.\n\nJudges\n\nContestants\n\nContestant stats provided via the Miss Universe Organization.[4]\n\nNotes\n\n^ Xbox One S models only ^ Ages at the time of the pageant", "images": ["https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Miss_Teen_USA_2017", "title": "Miss Teen USA 2017", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.3", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "viewport": "width=1120", "og": {"title": "Miss Teen USA 2017 - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}