{"url": "https://en.wikipedia.org/wiki/Bob_Morley", "text": "Australian actor (born 1984)\n\nRobert Alfred Morley[1] (born 20 December 1984) is an Australian actor. He is known for his role as Bellamy Blake in The CW's The 100 (2014–2020).\n\nHe first became known as Drew Curtis in the Australian soap opera Home and Away (2006), appeared on the Australian music talent show It Takes Two in 2007, and joined the cast of drama series The Strip in 2008. He played Aidan Foster in Neighbours in 2011, and starred in the Australian sports drama film Blinder in 2013.\n\nEarly life and education [ edit ]\n\nRobert Alfred Morley was born on 20 December 1984[2] and grew up on a farm in Kyneton, a town in Victoria, Australia. He is the son of a Filipina mother and an Australian-Irish father, who died when he was young.[3] Morley has two older sisters and an older brother.[2]\n\nHe studied drama at school all the way through to Year 11, until he was asked not to continue.[4] Morley told The Age that he was a \"naughty\" student and did not take things seriously.[4] After he completed year 12, he moved to Melbourne and began an engineering degree.[3] A year later, he decided to enrol in Creative Arts at the La Trobe University and got an agent.[2][3]\n\nCareer [ edit ]\n\nMorley was known as \"Bobby\" in his younger years and early career,[2] but is now professionally known as Bob Morley.[5] He began his career by acting in university plays, including Falling to Perfect and Tale From Vienna Woods, and short films.[2][4] He appeared in the 2005 low-budget horror film Dead Harvest, directed by Damian Scott,[2] and as an extra in the soap opera Neighbours. That year, he got a part in Angels with Dirty Faces and his performance brought him to the attention of the Home and Away casting directors.[4] Morley joined the cast of Home and Away as Drew Curtis in 2006.[4] For his role as Drew, Morley was nominated for the Most Popular New Male Talent Logie Awards.[6]\n\nHe appeared in the second series of the Australian celebrity singing competition series It Takes Two in May 2007. On 12 June 2007, he received his highest score but was voted off the series. In 2008, Morley departed Home and Away and was cast as Tony Moretti in the Nine Network action drama series The Strip.[7] The show was cancelled due to low ratings after its first series. Also in 2008, Morley appeared in Nine Network's television film Scorched,[3] and was nominated for Cleo magazine's \"Bachelor of the Year\" award.[8] In 2009, he starred as Lorca in the play Palindrome for a Dead Poet. The following year, Morley featured in season four of Sea Patrol, in the fifth episode titled \"Paradise Lost\".[9]\n\nIn 2011, he starred in the Australian thriller Road Train, directed by Dean Francis.[10] In June 2011, it was announced that Morley had joined the cast of Neighbours as Aidan Foster, a love interest for Chris Pappas.[11] Morley and Mason's characters formed the show's first gay couple.[11] Morley took a ten-week break from the soap to appear in Blinder, a feature film about Australian rules football.[12] He returned to the set of Neighbours in early June 2012.[12] Morley joined the cast of drama film Lost in The White City in 2013.[13]\n\nThe same year, he was cast as Bellamy Blake in The CW's The 100.[14]\n\nBob Morley speaking at the 2018 WonderCon at the Anaheim Convention Center in Anaheim, California.\n\nIn 2018, Morley completed the Warner Bros. Television Directors’ Workshop.[15] The same year, he directed the season 6 episode 11 \"Ashes to Ashes\" of The 100.[16]\n\nIn 2021, Morley appeared in the third season of police procedural The Rookie.[17] He played a supporting role in the Australian romantic drama series Love Me, a two-season adaptation of the Swedish series Älska Mig that premiered in 2021, which featured an ensemble cast including Hugo Weaving and Bojana Novakovic.[18][19] The same year Morley starred in Death on the Dearborn western together with Zach McGowan.[20][21]\n\nIn 2023, Morley and Eliza Taylor starred together as Marcus and Julie Alexander in the sci-fi thriller film I'll Be Watching, directed by Erik Bernard. The film was released on digital platforms.[22][23][24] The same year, Morley played Nate in the comedy-drama series In Limbo.[25][26]\n\nMorley stars in the television adaptation of Sally Hepworth's novel The Family Next Door for the ABC, playing Lucas.[27] The series premiered on August 10, 2025.[28][29][30]\n\nIn 2025, Morley and Taylor created the short film Status: Active.[31][32][33] Morley wrote and directed the film, while Taylor co-produced it and starred in the lead role. The film premiered at LA Shorts International Film Festival 2025.\n\nMorley will star in Another, a psychological horror film. The shooting was in April and May 2025, and the movie is in post-production.[34][35][36]\n\nPersonal life [ edit ]\n\nBob Morley and his wife, Eliza Taylor\n\nOn 5 May 2019, Morley married his The 100 co-star Eliza Taylor.[37]\n\nIn 2020, Morley and Taylor revealed that she had a miscarriage while filming the final season of The 100.[38]\n\nIn March 2022, Taylor gave birth to their son.[39][40]\n\nIn 2019, Morley addressed being fat-shamed and facing depression after having knee surgery in 2018.[41] Later that year, he shared that he had attempted suicide several times.[42]\n\nIn a 2024 interview with Tommy DiDario on his I’ve Never Said This Before podcast, Morley discussed his lifelong struggle with body dysmorphia and mentioned that he had an eating disorder as a teenager.[43]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nDirector [ edit ]\n\nAwards and nominations [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Bob_Morley_by_Gage_Skidmore.jpg/250px-Bob_Morley_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Bob_Morley_by_Gage_Skidmore.jpg/960px-Bob_Morley_by_Gage_Skidmore.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Bob_Morley_%2827207522208%29.jpg/250px-Bob_Morley_%2827207522208%29.jpg", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Eliza_Taylor_%26_Bob_Morley_%2825890275730%29.jpg/250px-Eliza_Taylor_%26_Bob_Morley_%2825890275730%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Bob_Morley_by_Gage_Skidmore.jpg/960px-Bob_Morley_by_Gage_Skidmore.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Bob_Morley", "title": "Bob Morley", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Bob_Morley_by_Gage_Skidmore.jpg/960px-Bob_Morley_by_Gage_Skidmore.jpg", "width": 933, "height": 1200}, "title": "Bob Morley - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}