{"url": "https://www.elle.com/culture/movies-tv/a17804585/katie-lowes-scandal-interview-working-moms/", "text": "7 min read\n\nKatie Lowes is busy. When she calls from her trailer on the set of Scandal, it's 7 A.M. her time and she's got a full day of shooting ahead of her. The actress, who just returned from maternity leave to complete her run as Quinn Perkins on the hit Shondaland show, is funny and engaged despite the early hour, the team of people buzzing behind her, and the breakfast sandwich order she has to briefly interrupt our call to make. \"This is me multi-tasking at Scandal,\" she says with a laugh.\n\nIf there's one thing the ABC political drama, which concludes this spring after seven seasons, has come to epitomize, it's multi-tasking—just think of Kerry Washington's Olivia Pope striding down the halls of power, speaking a mile a minute, running the country and B613 at the same time, or Lowes' character, who this season alone has had to run the DC fixing agency Olivia started, plan a wedding, give birth to a baby, and escape a kidnapping. Just another day at the office. \"I try just to take whatever's right in front of me, and do it justice,\" Lowes says.\n\nOff-screen, the actress has been almost as busy as her fictional counterpart—though with far less political intrigue involved. In addition to starring on Scandal, she gave birth to her first child this year and celebrated the tenth anniversary of IAMA Theater Company, of which she is co-artistic director. She talked with ELLE.com about being a working mom on a show run by working moms, dancing to Britney Spears with Joe Morton, and, of course, the end of Scandal.\n\nI know you can't tell me what's gonna happen on the show, but…\n\nI can't tell you what's gonna happen on the show. And you know what? I don't even know. I'm so freaked out. I have no idea what's gonna happen. I don't know how it's gonna end. Nobody's told us. It's so scary.\n\nIs that anxiety-producing for you?\n\nI'm just so used to trusting Shonda. For seven seasons, I haven't known what was going to happen to Quinn, I haven't known what was going to happen to anybody. And it's all been an amazing ride, because look, am I going to think of something better? No. Like, no way in hell. So I'm just like, \"Do your thing. You tell me where to stand and what to say.\" She's the great protector of our characters, and of the story.\n\nTyler Joe\n\nYou started off as Lindsay Dwyer, this wrongfully accused lawyer, and now you're Quinn Perkins, ex-assassin. What did you think you were signing up for?\n\nOh my God. I literally thought I was signing up for what I auditioned for: the rookie, the newbie, the bright-eyed, bushy-tailed new lawyer. I thought I was going to be lawyering stuff and in power suits. I had no idea I would be killing people, B613, a leather jacket. Having a baby. I had no no no idea.\n\nThey're really putting you through the ringer this season. Is that fun to play, or is that really grueling?\n\nIt's so fun to play. I mean, especially when you're 38 weeks pregnant. [Laughs] I feel really lucky that in this final season, Quinn has gotten to do a lot of heavy lifting. And I also just feel like it's such a testament to where I work. Because it's not like I told Shonda [Rhimes] I was pregnant and all of a sudden I'm completely written out, and being treated as if something was wrong. It's like, \"Oh, no, no. You're pregnant, now you're gonna run [Olivia Pope and Associates], and you're gonna be asked to do all these amazing things, because it's possible.\" You can be pregnant, and be playing a pregnant character who's also a badass. And kicking ass, and taking names.\n\n\"You can be pregnant, and be playing a pregnant character who's also a badass. And kicking ass.\"\n\nIt seems like the workplace has been structured to make it better for moms.\n\nIt's unbelievable here. I say to people, my biggest mistake is that I didn't have four babies on this show. Because I don't even want to think about what else is out there, I mean, in as far as other bosses in TV land, and other industries, too. It's just heaven to be a mom, and a working mom, and a pregnant person in Shondaland. She was the first person I told I was pregnant, right after my husband. She knew I was pregnant when I was five minutes pregnant.\n\nAnd as soon as it came out, and I was three or four months pregnant, I showed up, and they had replaced my trailer steps with this huge deck, and huge stairs, because they didn't even want me going up and down trailer stairs, because they can be slippery. Or any time I shot a scene that was remotely physical at all, I had a stunt coordinator, a stunt double. But also an OB was on set, making sure I did everything correctly and safely, for me and my baby. My trailer has a nursery in it. I'm allowed to bring my baby to work every day. They have my breastfeeding schedule. And so they let me go back to my trailer as much, and as long as I need, to feed my kid. Which is an amazing thing.\n\nTyler Joe\n\nI imagine that a lot of this comes from Shonda, and from the people that she surrounds herself with. It sounds like it's a much different work environment than most people have.\n\nShe's a mother of three, and Kerry's a mom. And Viola Davis is a mom. And I just think that it's really supported and encouraged here. Shonda supports people to have full lives, whatever that means to them. For example, she's super involved in my theater company because she loves theater. But it's just an example of how she really supports her actors to have full-fledged lives, whatever that may be for them. So when I told her that being a mom was something that was important to me, she backed me and supported me 100 percent.\n\n\"What's most effective about this show is that it's so many people leading by example.\"\n\nIt's interesting that this show that's so dramatic comes from such a utopian place.\n\nI think it's why. We're all so goofy. Of course when we get super serious scenes, we take it seriously, and we give each other space, and the time to prepare and focus. But I have to be honest, at [Quinn Perkins and Associates], when it's me and Guillermo [Diaz], and Kerry, and George [Newbern], and Darby [Stanchfield], or whatever. We're silly as hell. We sing, and we dance a lot, and we hang out a lot, and we make fun of each other a lot. And I feel like that's made the healthy work environment that allows us to kind of be as dark as we need to when they call us. I couldn't imagine how exhausting it would be to be that intense, and that dark, in between all the takes, too.\n\nABC/Eric McCandless Lowes on the set of Scandal with Kerry Washington and Bellamy Young\n\nAs a fan, I'm like, \"Oh, good.\" I want you to be happy as you're doing this. I watched a video that you posted of your choreography rehearsal with Debbie Allen and Joe Morton.\n\nCan you believe? Oh my God, can I tell you something? This is the exact example of what I'm talking about. That was my son's first day at work.\n\nI got some time off to go have my baby and spend some time with him, as a young newborn, which, even that alone is hard to get in some industries. You don't even know who you are, your hormones are so crazy, you're trying to figure it out. You're recovering physically, mentally, emotionally. And also connecting with this human that you just made. But my first day back was an episode directed by Kerry Washington. I'm so taken care of, in that I'm being directed by a woman who is a mom, who gets it.\n\nWe have choreography rehearsal with the one, the only, Debbie freaking Allen. And I'm dancing with Joe Morton to Britney Spears. I was like, \"Are you kidding? This is our son's first day at work. You're breastfeeding him under a nursing cover, while learning choreography that Debbie Allen is teaching you. And you're doing a duet dance move with Joe Morton to Britney Spears' \"Hit Me Baby, One More Time.\" I mean, is this real life?\n\nTyler Joe\n\nIt's kind of like a People crossword puzzle come to life.\n\nIt was the best thing ever. And honestly, I was running late. And Debbie Allen and Joe had been waiting for the rehearsal and I was like, \"Okay, well, I have to go nurse Albee.\" I can either make them wait 30 more minutes, and I'll go nurse in the trailer, or you know what? The scene has a baby in it anyway, that I have to hold, so maybe I'll just hold Albee while I feed him, and I can do it all at the same time.\n\nAnd of course Debbie Allen and Joe were like, \"Bring him, bring him. Yeah. Nurse him. We don't care. Of course.\" It was the best. That's what's also what's most effective about this show, is that it's so many people leading by example. I know that working these hours, and being a great mom, is possible, because I have watched Kerry do it for years. And I've watched Shonda do it for years. So I have all these women to lean on. And what's great, is the men are all around it, too. So they know it's possible. It's just good for everybody. It's just good to see it for everybody.\n\nWhen I'm having conversations with like Jeremiah [Acerra] who's our AD, and I'm like, \"Okay, well today my breastfeeding schedule is 12, 3, 6.\" This is what I'm going over with him in the morning. It's like, this is dope. We're all going to work together, and collaborate, to make this a great day at work, and a great day for my kid. And we're going figure it all out. And we do it together. It's awesome.\n\nThis interview has been edited and condensed.", "images": ["https://www.elle.com/_assets/design-tokens/fre/static/icons/envelope-simple-regular.91a0134.svg", "https://hips.hearstapps.com/hmg-prod/images/prince-harry-duke-of-sussex-serena-williams-and-meghan-news-photo-1763052708.pjpeg?crop=0.739xw:0.493xh;0.168xw,0.0769xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/jennifer-aniston-is-seen-filming-on-location-for-the-news-photo-1752184099.pjpeg?crop=0.675xw:1.00xh;0.191xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/148479-6447-1519265523.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/elle-katie-lowes0314-1519318326.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/bookmark-simple-regular.9d9d56b.svg", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/all-her-fault-series-690b64079162d.png?crop=0.560xw:1.00xh;0.0221xw,0&resize=360:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/saved.ad81f1a.svg?primary=%2523000000", "https://hips.hearstapps.com/hmg-prod/images/elm120125wljenniferaniston-002-6908dced2d1a7.jpg?crop=1.00xw:0.752xh;0,0.0517xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/elle-katie-lowes-1519318249.gif?crop=1.00xw:1.00xh;0,0&resize=980:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://www.elle.com/_assets/design-tokens/fre/static/icons/clock-regular.b2f2888.svg", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523000000&id=social-button-icon", "https://www.elle.com/_assets/design-tokens/elle/static/images/logos/logo.2856426.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/elle-katie-lowes0179-1519321449.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/taylor-travis-gettyimages-2187494391-691a4ee226049.jpg?crop=0.978xw:1.00xh;0.0128xw,0&resize=360:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523ffffff&id=social-button-icon", "https://www.elle.com/_assets/design-tokens/elle/static/images/logos/logo.2856426.svg?primary=navLogoColor", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523ffffff", "https://hips.hearstapps.com/vidthumb/images/2018-thumbnail-clean-v1-00-04-03-13-still089-1519322183.jpg?crop=1.00xw:1.00xh;0,0", "https://hips.hearstapps.com/hmg-prod/images/vivian-benitez-and-rufus-sewell-attend-the-awards-ceremony-news-photo-1760123174.pjpeg?crop=1.00xw:0.668xh;0,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/elle-katie-lowes0415-1519318160.jpg?crop=1xw:0.7498535442296427xh;center,top&resize=1200:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://hips.hearstapps.com/hmg-prod/images/all-her-fault-series-690b64079162d.png?crop=0.560xw:1.00xh;0.0102xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/elle-katie-lowes0415-1519318160.jpg?crop=0.889xw:1.00xh;0.0561xw,0&resize=768:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/caret-left-regular.5546078.svg", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523ffffff&id=social-button-icon", "https://www.elle.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg", "https://hips.hearstapps.com/hmg-prod/images/elm120125wlteyanataylor-004-6908de1c2d905.jpg?crop=0.670xw:1.00xh;0.274xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/meghan-markle-duchess-of-sussex-is-seen-leaving-the-news-photo-1763237513.pjpeg?crop=0.732xw:0.488xh;0.157xw,0.0374xh&resize=360:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/megan-fox-and-machine-gun-kelly-are-seen-in-tribeca-on-news-photo-1763220667.pjpeg?crop=1.00xw:0.667xh;0,0.0800xh&resize=360:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://www.elle.com/_assets/design-tokens/elle/static/images/logos/network-logo.242fea1.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/actor-timothee-chalamet-and-kylie-jenner-sit-court-side-news-photo-1762895644.pjpeg?crop=0.615xw:0.923xh;0.138xw,0.0625xh&resize=360:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/actress-claire-danes-and-her-husband-english-actor-hugh-news-photo-1762961278.pjpeg?crop=0.668xw:1.00xh;0.287xw,0&resize=360:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523000000&id=social-button-icon", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523ffffff&id=social-button-icon", "https://www.elle.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://www.elle.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://www.elle.com/_assets/design-tokens/fre/static/icons/x-regular.e414d97.svg", "https://www.elle.com/_assets/design-tokens/fre/static/icons/globe-simple-regular.e7f303c.svg", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523000000&id=social-button-icon", "https://www.elle.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/elle-katie-lowes0415-1519318160.jpg?crop=1xw:0.7498535442296427xh;center,top&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.elle.com/culture/movies-tv/a17804585/katie-lowes-scandal-interview-working-moms/", "title": "Katie Lowes on Scandal's Final Season", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Katie Lowes on Scandal's Final Season - Scandal End Date Working Moms", "description": "TV's Quinn Perkins talks about dancing to Britney Spears, being a working mom, and, of course, the end of Scandal.", "keywords": "mom, working mom, Scandal, Katie Lowes, Shondaland, Shonda Rhimes, Kerry Washinton, behind the scenes, when does Scandal end, scandal spoilers", "theme-color": "#000000", "og": {"site_name": "ELLE", "title": "Katie Lowes on Why <i>Scandal</i> is the Perfect Place for a Baby", "description": "TV's Quinn Perkins talks about dancing to Britney Spears, being a working mom, and, of course, the end of Scandal.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/elle-katie-lowes0415-1519318160.jpg?crop=1xw:0.7498535442296427xh;center,top&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.elle.com/culture/movies-tv/a17804585/katie-lowes-scandal-interview-working-moms/", "type": "article"}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "opinion": "false", "section": "Movies & TV", "modified_time": "2018-02-22T19:16:00Z", "published_time": "2018-02-22T19:16:00Z"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "parsely-metadata": "{\"socialHeadline\":\"Katie Lowes on Why <i>Scandal</i> is the Perfect Place for a Baby\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/elle-katie-lowes0415-1519318160.jpg?crop=0.666796875xw:1xh;center,top&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/elle-katie-lowes0415-1519318160.jpg?crop=1xw:0.7498535442296427xh;center,top&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/elle-katie-lowes0415-1519318160.jpg?crop=0.666796875xw:1xh;center,top", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/elle-katie-lowes0415-1519318160.jpg?crop=1xw:0.7498535442296427xh;center,top&resize=640:*", "card": "summary_large_image"}, "auto-publish": "timely", "sailthru.excerpt": "Katie Lowes is busy. When she calls from her trailer on the set of Scandal, it's 7 A.M. her time and she's got a full day of shooting ahead of her. The actress, who just returned from maternity leave to complete her run as Quinn Perkins on the hit Shondaland", "sailthru.tags": "culture,Culture,movies-tv,Movies & TV,ELLE-US", "sailthru.date": "2018-02-22 19:16:00", "sailthru.socialtitle": "Katie Lowes on Why <i>Scandal</i> is the Perfect Place for a Baby", "sailthru.contenttype": "longform-article"}, "movies": [], "publish_date": 1519326960.0, "source": "https://www.elle.com", "summary": ""}