{"url": "https://tvline.com/2018/01/04/the-four-recap-series-premiere-review-fox/", "text": "Who needs exciting performances, compelling contestants and chemistry between judges? Not Fox's The Four: Battle for Stardom, apparently.\n\nThursday marked the two-hour series premiere of television's newest singing competition, which begins with four finalists hand-selected by the show's judges — Sean \"Diddy\" Combs, DJ Khaled, Meghan Trainor and record executive Charlie Walk — and invites hungry competitors to compete for a chance to steal one of those spots.\n\nI use the word \"hungry,\" because, well, it's a word that's used a lot on this show — particularly by Diddy, who treats the Four like a pack of wild animals. \"Who wants to eat?!\" he taunts them before each challenge. \"Who's hungry?!\" (Honestly, this show might as well put the singers in a damn cage at this point.)\n\nIn fact, Diddy said a few curious things during Thursday's premiere, including this not-so-subtle dig at American Idol, returning (to ABC!) in March: \"This show is going to give you the reality of what it's about. Attention, America: No karaoke singers. This is not that show. ... I want this show to be a true reflection of this industry.\"\n\nIronically, the show chose to introduce its original Four — female rapper Lex Lu, \"sassy\" songstress Elanese Lansen, singer-songwriter Blair Perkins, and potentially British musician Ash Minor — with a group performance of Justin Timberlake's \"Can't Stop the Feeling,\" arguably one of today's most karaoke'd songs.\n\nDespite Fergie's most earnest hosting efforts, the two-hour premiere was relatively uneventful, save for the discuss-able moments below:\n\n* Los Angeles native Zhavia — who could very well just be Bella Thorne in a wig — earned the first unanimous \"yes\" from the judges with a performance of Khalid's \"Location,\" allowing her to challenge Elanese, ultimately stealing her spot in the Four.\n\n* Young rapper Illakriss didn't get too much love from the judges at first, but Lex Lu practically begged them to let him through. She was hungry — and she devoured him, retaining her seat.\n\n* Saeed Renaud's soulful performance of Whitney Houston's \"Run To You\" earned him the opportunity to challenge Blair, who chose to sing Sam Smith's \"Stay With Me.\" Unfortunately for Blair, he did not stay; he had to give up his seat to Saeed.\n\nTell us: Did you enjoy your first experience with The Four? Who was your favorite/least favorite judge? Grade the premiere below, then drop a comment with more of your thoughts.", "images": ["https://www.tvline.com/img/TVLine-Icon-RGB-Default-Color.svg", "https://www.tvline.com/img/TVLine-Logo-RGB-Default-Color.svg", "https://www.tvline.com/tvline/news/the-four-recap-series-premiere-review-fox-901751/the-four-premiere-fox.jpg"], "top_img": "https://www.tvline.com/tvline/news/the-four-recap-series-premiere-review-fox-901751/the-four-premiere-fox.jpg", "keywords": [], "authors": ["Andy Swift"], "canonical_link": "https://www.tvline.com/news/the-four-recap-series-premiere-review-fox-901751/", "title": "'The Four' Recap: Series Premiere Review", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "max-image-preview:large", "thumbnail": "https://www.tvline.com/tvline/news/the-four-recap-series-premiere-review-fox-901751/the-four-premiere-fox.jpg", "description": "What did you think of Fox's 'The Four'? Get our take, then weigh in with your own thoughts.", "mrf": {"tags": "Content Type:Legacy Article;Primary Category:Reality TV;Category:Reality TV;Headline Approver:Unknown;Trello Board:Legacy"}, "og": {"site_name": "TVLine", "title": "Fox's The Four Premiere: Grade It! - TVLine", "image": "https://www.tvline.com/tvline/news/the-four-recap-series-premiere-review-fox-901751/the-four-premiere-fox.jpg", "description": "What did you think of Fox's 'The Four'? Get our take, then weigh in with your own thoughts.", "type": "article", "url": "https://www.tvline.com/news/the-four-recap-series-premiere-review-fox-901751/"}, "twitter": {"title": "Fox's The Four Premiere: Grade It! - TVLine", "description": "What did you think of Fox's 'The Four'? Get our take, then weigh in with your own thoughts.", "site": "@TVLine", "card": "summary_large_image", "image": "https://www.tvline.com/tvline/news/the-four-recap-series-premiere-review-fox-901751/the-four-premiere-fox.jpg"}, "article": {"published_time": "2018-01-05T03:00:01+00:00", "modified_time": "2018-01-05T03:00:01+00:00", "author": "Andy Swift"}}, "movies": [], "publish_date": 1515042000.0, "source": "https://tvline.com", "summary": ""}