{"url": "https://ew.com/oscars/2018/03/06/the-most-important-awards-season-moments-for-women/", "text": "On Sunday evening, Frances McDormand made waves with her inspiring Oscars acceptance speech — she set off not only a flurry of Google searches (“Siri, what is inclusion rider?”) but discussions across Hollywood and the rest of the country. It was a moment to rival Patricia Arquette’s equal pay speech at the 2015 Oscars, complete with a new set of Meryl Streep reaction GIFs to covet. But while McDormand’s message of sisterhood and diversity may be capturing the attention of the internet more than anything else of late, it’s really the culmination of an awards season that has seen the women of Hollywood rise up and band together like never before. Let’s reflect on the most important moments.\n\nThe birth of Time’s Up\n\nIt all started with Time’s Up, of course, the story of which has now been written into the history books. When faced with the looming awards season — and most pressingly the Golden Globes — many of Hollywood’s most powerful actresses acted with lightning speed to launch the Time’s Up Legal Defense Fund (and the larger #TimesUp movement). They spread the word far and wide that this year’s Golden Globes would be different, organizing the entire industry into one giant force against Harvey Weinstein and the rest of the worst of Hollywood.\n\nThe activists at the Golden Globes\n\nThe founding members of Time’s Up walked the walk and talked the talk when they refused to surrender the narrative on the Golden Globes red carpet. Despite Ryan Seacrest’s attempts to change the subject, these women and the fierce advocates they brought with them — Rosa Clemente, Ai-jen Poo, Billie Jean King, Tarana Burke, Mónica Ramirez, Marai Larasi, Calina Lawrence, and Sayu Jayaraman — constantly brought the conversation back to the plight of women in the face of sexual harassment.\n\nKristen Bell: SAG Awards host\n\nThe showing at the Golden Globes made for a powerful statement but also raised a question: Where does the rest of awards season go from here? The Screen Actors Guild Awards answered by installing an all-female presenters lineup and giving the first-ever hosting gig to Kristen Bell, putting the show in, quite possibly, the most capable hands ever. Seth Meyers did a fantastic job hosting the Globes, but the message felt all the more powerful when delivered by a woman.\n\nThe actress didn’t shy away from addressing the big issues, but she managed to to it in an approachable and, when appropriate, funny way. She gave inspiring calls to action: “We are living in a watershed moment in time and as we march forward with active momentum and open ears, let’s make sure we are leading the charge with empathy and diligence, because fear and anger never win the race.” She poked fun at herself: “I’m Kristen Bell and I am a narcissist. Just kidding! I am an actor and tonight I am also your host.” And she also raised a glass to her fellow females.\n\nThe Oscar party-turned-resistance retreat\n\nOscars week is historically marked by fancy fetes thrown to honor the nominated films — and, if we’re being honest, the executives behind them — as well as sponsored dinners and cocktail parties and anything else that could be filed under fabulous. This week was just as fabulous but, thanks to some intrepid and determined (and female) industry insiders, the mood was decidedly more empowering.\n\nThat mood kicked off with a huge first: The (hopefully) inaugural EMILY’s List “Resist, Run, Win” Pre-Oscars Panel. The group, which is the nation’s largest resource for women in politics and aims to help women get elected to office, teamed up with Hollywood heavyweights to discuss the current climate for women and, more importantly, help industry insiders learn how they could start making a change for good. Chelsea Handler, the co-chair of the group’s Creative Council, moderated the event, which included panelists (and #MeToo activists) like Constance Wu and Padma Lakshmi (she also brought friends like Kathryn Hahn and Emmy Rossum to observe the panel).\n\nThe comedian spoke to a packed ballroom at the Four Seasons about her refusal to accept the hand that women have been dealt in the industry (and in general) and shared insights, like her belief that if Hillary Clinton had won the election, there wouldn’t have been a rush to launch the #MeToo movement, as well as what she sees as a lack of women supporting other women in all aspects of life (something she experienced while trying to break into comedy).\n\nThe ode to black excellence, by black excellence\n\nA day later, more industry heavyweights gathered to mark the beginning of Women’s History Month, plot world domination, most importantly, celebrate this year’s most gifted entertainers at the Essence Black Women in Hollywood Awards. Yvonne Orji, of Insecure fame, hosted the luncheon that brought together the likes of Tiffany Haddish, Lena Waithe, and Time’s Up founding member Tessa Thompson.\n\nRandy Shropshire/Getty Images\n\nHaddish shared with the audience her insights on staying positive through all of life’s highs and lows, Waithe delivered a speech about how to speak your truth in an industry that has been less than forgiving of differences, and Thompson waxed poetic on equality and where the women’s movement in Hollywood can go from here.\n\nViola Davis…being Viola Davis\n\nOver Oscars weekend, Women in Film hosted its 11th annual Pre-Oscars Party, which this year took on an air of even more heightened awareness. The official raison d’etre for the soirée is honoring all of the female nominees on the Academy Awards ballots, which, while that number grows annually, continues to be upsettingly small. Viola Davis did as Viola Davis always does and gave a rallying cry to the troops, assuring the actresses in the audience that they’re worthy.\n\n“Right now we’re feeling less than,” she said somberly. “We’re at the caboose. But we’re still worthy. Our complexities are worthy. This is the story of our year, and the privilege of a lifetime is being exactly who we are.”\n\nEmma Stone, the evening’s host, had her good friend and constant award season companion Billie Jean King in tow, and the tennis player (and inspiration for Stone’s Battle of the Sexes) stepped up to the podium to give some inspiring words of her own.\n\n“Women are taught to be perfect and men are taught to be brave,” she said. “Women: Stop apologizing. We don’t have to be perfect.”\n\nThe main event\n\nThe culmination of a season’s worth of activism came quickly on Sunday, an evening that saw only the fifth female directing nominee and the first-ever female cinematography nominee. Even though neither Greta Gerwig nor Rachel Morrison took home Oscars, after several months of exhausting work there was plenty to be proud of — besides McDormand’s speech, of course. Like Yance Ford, the first openly transgender director to be nominated. Or the win for A Fantastic Woman, about a young transgender waitress in Chile. Or the win for Jordan Peele — Get Out fans may have been disappointed to see it lose Best Picture to The Shape of Water, but his win for Best Screenplay was record-breaking, monumental, and inspiring.\n\nSo what’s next, now that this most historical of awards seasons is complete? We all heard Frances — it’s on to the inclusion riders.", "images": ["https://ew.com/thmb/Bi6-m-1W9CO0SBvR1z18cIYcL-o=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/The-Awardist---Oct-22nd-5c73fac29fcc45c2b8b4028c57ac9559.jpg", "https://ew.com/thmb/dJtVA8MyVkGdPSrPepJs5aWekFE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/gettyimages-927338006-2000-9a34016e4f08432d88b68aa7006dbae0.jpg", "https://ew.com/thmb/qgehumoivoMN9f20USSyFOOM2oQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/SCAD-Film-Fest-12-103125-8c15ae90578d422cbc95604b3c412ab2.jpg", "https://ew.com/thmb/qTSCoHzUuNIsBfeWL_2hkXZINLg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/The-Awardist---Oscar-Noms-Oct-28-d134ee4bc1534d398278420dd2a463fa.jpg", "https://ew.com/thmb/HDO28MpfY1UZZxTQbVD8wKCvJIk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/debbie-allen-tom-cruise-dancing-16th-governors-awards-111725-4a-a749d58fe7f24086a9db26ee5fa33db6.jpg", "https://ew.com/thmb/aS-x3o2-TkBpSm3VBFqfgKPemBw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Seth-Rogen-2025-Emmys-091425-4a33ef36126b42c68c7a69458d0b211b.jpg", "https://ew.com/thmb/IBJmxdWqd5R0lykWHyWFSuyvi5Y=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/wanda-sykes-will-smith-102725-5f8cadcaf4024277b26e2b3f2068984d.jpg", "https://ew.com/thmb/SwoMUUQGLxztnW-FNlHBlTmvhqc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Joe-Rogan-Golden-Globes-Megyn-Kelly-100325-80f303f6edf64674998ee0d42fc3254d.jpg", "https://ew.com/thmb/v_MxzTvpMYEklXDjhXAaiD-Kb_0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Kelly-Ripa-Mark-Consuelos-Live-With-Kelly-and-Mark-01-102025-32e50f89fda34e7fb51b85e689c2ec31.jpg", "https://ew.com/thmb/0wB2DfljwY6utfzqjHo35N567JU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/golden-globes-statue-oscars-statue-grammy-award-103025-46e24b26be8d4ce8ba87ac7e00f45c49.jpg", "https://ew.com/thmb/MPkWmkiKVjsvBuinOBSQHXEo0Ec=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Robert-Englund--Hollywood-Walk-of-Fame-103125-bc334782e44a4119940749c8d5369287.jpg", "https://ew.com/thmb/yJ4OZD9CDTUuICbYcxH34dsA1bY=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/926076324-2000-7a05e93af736449e9f9f42a59be6c5e8.jpg", "https://ew.com/thmb/7fOr7kpS9UdMcgJOT1Ak1yNwT1A=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/awardist-podcast-OCT1-0e643c4de8a842b698a7bb612f94fec1.jpg", "https://ew.com/thmb/cS7DVlJMnLkCpGp6yl0hiocCDeY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Eddie-Murphy-Robin-Williams-Academy-Awards-1988-111025-b9c5ba27639a44768b2bf4ed63f98db1.jpg", "https://ew.com/thmb/Gw-j_YFMNRNxXshp3CPaKJHliGI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Miss-Grand-International-2025-Miss-Panama-mistake-102225-58787d4e544946c484cc3b4e8214adf0.jpg", "https://ew.com/thmb/AnkYe6dbRNTeGH2L4ycunQnhtD4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/dolly-parton-Country-Music-Hall-of-Fame-2025-093025-74f7122680e54c209c29c238247c51d6.jpg", "https://ew.com/thmb/sRZ6h_nZhY32QjuQLsSQuZFpQkU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Carla-Hall-Drew-Barrymore-and-Jonathan-Jackson-101725-eaa5faba0f554b9cb7eee2c6d03fb899.jpg", "https://ew.com/thmb/SpZfd7qxVg8bA9y5MONH-9j8Ckc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Jennifer-Lopez-092925-c742a6b8251e4a17b41a56fc48c27535.jpg"], "top_img": "https://ew.com/thmb/dJtVA8MyVkGdPSrPepJs5aWekFE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/gettyimages-927338006-2000-9a34016e4f08432d88b68aa7006dbae0.jpg", "keywords": [], "authors": ["Seija Rankin Is The Former Books Editor At", "Ew'S Editorial Guidelines", "Joey Nolfi", "Mekishana Pierre", "Lauren Huff", "Gerrad Hall", "Raechal Shewfelt", "Ew Staff", "Jillian Sederholm", "Wesley Stenzel"], "canonical_link": "https://ew.com/oscars/2018/03/06/the-most-important-awards-season-moments-for-women/", "title": "The most important awards season moments for women", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "The women of Hollywood made it clear that they're not going to take it anymore.", "parsely-section": "Awards Shows & Events", "parsely-tags": "Entertainment Weekly,Awards Shows & Events,The Awardist,Awards Shows", "article": {"section": "EW", "author": "https://www.facebook.com/entertainmentweekly"}, "og": {"type": "article", "site_name": "EW.com", "url": "https://ew.com/oscars/2018/03/06/the-most-important-awards-season-moments-for-women/", "title": "The most important awards season moments for women", "description": "The women of Hollywood made it clear that they're not going to take it anymore.", "image": "https://ew.com/thmb/dJtVA8MyVkGdPSrPepJs5aWekFE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/gettyimages-927338006-2000-9a34016e4f08432d88b68aa7006dbae0.jpg"}, "twitter": {"card": "summary_large_image", "site": "@EW", "title": "The most important awards season moments for women", "description": "The women of Hollywood made it clear that they're not going to take it anymore.", "image": "https://ew.com/thmb/dJtVA8MyVkGdPSrPepJs5aWekFE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/gettyimages-927338006-2000-9a34016e4f08432d88b68aa7006dbae0.jpg"}, "vf": {"url": "https://ew.com/oscars/2018/03/06/the-most-important-awards-season-moments-for-women/"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.102.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.102.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.102.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.102.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.102.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": 1520312400.0, "source": "https://ew.com", "summary": ""}