{"url": "www.inquisitr.com/2627282/holy-smokes-batman-ben-affleck-looks-a-little-different-lately/", "text": "Ben Affleck is looking different from his usual handsome self. The actor appears to be changing his looks after his very public divorce.\n\nAccording to OK! Magazine , Ben Affleck has been the center of plastic surgery rumors recently. The actor was spotted on the set of his new film, Live By Night , wearing some bandages, cuts, and bruises on his face. The plastic surgery rumors first started when Affleck’s face has been looking smoother than usual. Several cosmetic surgeons have claimed that Affleck may have had some Botox and fillers.\n\nBen Affleck fuels plastic surgery rumors with bandaged and bruised appearance on film set — See the shocking photos! https://t.co/83uNJXF5fY — OK! Magazine USA (@OKMagazine) December 9, 2015\n\nOne of the doctors, a board-certified plastic surgeon named Dr. Lyle Back, who has not treated Ben, told RadarOnline that the actor does look different these days. But different doesn’t necessarily mean it’s a good thing.\n\n“He looks different — but he doesn’t look better. In fact, he doesn’t look like himself at all! He’s had the entire upper third of his face worked on, and the result is he looks more like Jack Nicholson’s Joker than Batman.”\n\nDr. Back then added that Affleck may have gotten Botox on his eyes.\n\n“A small amount of Botox fills your wrinkles and makes you look relaxed and well rested. He’s had so much put in that his eyebrows look jacked up and he’s just downed 50 cups of coffee. “Again, it’s a case of too much work where only a little was needed. Fat and skin has been trimmed from both above and below the eyes, and it’s so starkly different that he might as well be Kenny Rogers.”\n\nSo, is Ben Affleck’s new look for the sake of his role? Or does he want to appear younger looking? He could be desperate to keep up with his Batman Vs. Superman co-star Henry Cavill.\n\nAccording to the report, since the 43-year-old has been in the news for allegedly cheating on his ex-wife Jennifer Garner with his children’s nanny, sources close to Affleck claim that he’s trying out a new look. Cosmetic surgery experts speculate that Affleck may have also gotten cheek fillers and laser skin treatments but has already done too much, way too soon.\n\nBen isn’t just opting for a younger look on his face. He’s also trying to look younger by dyeing his hair. According to the Daily Mail , the actor is taking the role of Bruce Wayne very seriously by dyeing his gray hair back to his dark brown locks. Ben has also been looking different in recent weeks due to his noticeable weight loss.\n\nHe really IS the Dark Knight! Ben Affleck ditches fade to gray look for brown locks hitting the dye bottle for… https://t.co/3EVEGfDpEe — Las Vegas NV Blog (@LasVegasNvBlog) December 3, 2015\n\nEven the British tabloid is dumbfounded on what inspired Affleck to lose weight and dye his hair. Maybe it was for his recent appearance on Jimmy Kimmel Live where he looked dapper and suave than usual. It’s a departure from those photos of a down and out Affleck that were published over the summer, shortly after his divorce.\n\nThat’s not the only thing that’s different about Ben Affleck these days. Reports surfaced claiming that the actor has been hiding a huge Phoenix back tattoo from his fans and the rest of the world. Ben was spotted rocking a huge and unsightly tattoo on his back, but his fans thought it was for a movie role. Sources told TMZ that Ben’s tattoo is the real deal . In fact, he’s had the ink design for a few months now.\n\nPlastic surgery and a huge back tattoo?!?! Ben Affleck what is HAPPENING?!?! Stop before you ruin everything!!!! https://t.co/BunOmknDh6 — Lindsay (@PinotGrigioPls) December 10, 2015\n\nFans got a first glimpses of Ben Affleck’s tattoo back in July, but some assumed it was a “tramp stamp” for his role in Live By Night . But Affleck’s colorful tattoo was just a “work in progress” that happened shortly after his divorce from Garner. No, he didn’t get the fresh ink after a wild night out. An insider told Us Weekly that a tattoo artist visited Affleck at his home to finish the design.\n\nBen Affleck — Massive Back Tattoo Is the Real Deal!!! (PHOTOS) https://t.co/f4FSeMlkG7 — TMZ (@TMZ) December 12, 2015\n\nBen Affleck’s back tattoo shows commitment pic.twitter.com/XsF3cbusJk — Marlow Stern (@MarlowNYC) December 11, 2015\n\nWhat are your thoughts on Ben Affleck’s new tattoo? Do you think the actor has gotten Botox or plastic surgery procedures? Or do you think that’s another story from the rumor mill?\n\n[Photo by Angela Weiss/Getty Images]", "images": ["https://www.inquisitr.com/wp-content/uploads/2025/10/2421769f-57a4-4bff-913f-cf316747493e.jpg", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20500%20157'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20492%20142'%3E%3C/svg%3E", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo-white.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "https://secure.gravatar.com/avatar/f0754b796f2dd2adebf3705d05780aa7?s=120&d=mm&r=g", "https://www.inquisitr.com/wp-content/uploads/2024/12/inquisitr-logo.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent-Dark-Mode.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20120%20120'%3E%3C/svg%3E"], "top_img": "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "keywords": [], "authors": ["News Writer"], "canonical_link": "https://www.inquisitr.com/holy-smokes-batman-ben-affleck-looks-a-little-different-lately", "title": "Holy Smokes, Batman! Ben Affleck Looks A Little Different Lately", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "https://www.inquisitr.com/wp-content/uploads/2024/12/favicon.png", "description": "Ben Affleck is looking different from his usual handsome self. The actor appears to be changing his looks after his very public divorce.", "robots": "follow, index, max-snippet:-1, max-video-preview:-1, max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Holy Smokes, Batman! Ben Affleck Looks A Little Different Lately - Inquisitr News", "description": "Ben Affleck is looking different from his usual handsome self. The actor appears to be changing his looks after his very public divorce.", "url": "https://www.inquisitr.com/holy-smokes-batman-ben-affleck-looks-a-little-different-lately", "site_name": "Inquisitr News"}, "article": {"tag": "Ben Affleck", "section": "Entertainment", "published_time": "2015-12-11T21:20:00-05:00"}, "twitter": {"card": "summary_large_image", "title": "Holy Smokes, Batman! Ben Affleck Looks A Little Different Lately - Inquisitr News", "description": "Ben Affleck is looking different from his usual handsome self. The actor appears to be changing his looks after his very public divorce.", "site": "@theinquisitr", "creator": "@theinquisitr"}, "generator": "WP Rocket 3.18.3"}, "movies": [], "publish_date": 1449886800.0, "source": "http://www.inquisitr.com", "summary": ""}