{"url": "https://www.biography.com/people/jacqueline-kennedy-onassis-9428644", "text": "(1929-1994)\n\nWho Was Jacqueline Kennedy Onassis?\n\nJacqueline Kennedy Onassis married John F. Kennedy in 1953. When she became first lady in 1961, she worked to restore the White House to its original elegance and to protect its holdings. After JFK's assassination in 1963, she moved to New York City and married Aristotle Onassis in 1968. She died of cancer in 1994.\n\nEarly Life\n\nJacqueline Bouvier Kennedy Onassis was born on July 28, 1929, in Southampton, New York. Her father, John Bouvier, was a wealthy New York stockbroker of French Catholic descent, and her mother, Janet, was an accomplished equestrienne of Irish Catholic heritage. Onassis was a bright, curious and occasionally mischievous child. One of her elementary school teachers described her as \"a darling child, the prettiest little girl, very clever, very artistic, and full of the devil.\" Another teacher, less charmed by young Jacqueline, wrote admonishingly that \"her disturbing conduct in geography class made it necessary to exclude her from the room.\"\n\nOnassis enjoyed a privileged childhood of ballet lessons at the Metropolitan Opera House and French lessons beginning at age of 12. Like her mother, Onassis loved riding and was highly skilled on horseback. In 1940, at the age of 11, she won a national junior horsemanship competition. The New York Times reported, \"Jacqueline Bouvier, an eleven-year-old equestrienne from East Hampton, Long Island, scored a double victory in the horsemanship competition. Miss Bouvier achieved a rare distinction. The occasions are few when the same rider wins both competitions in the same show.\"\n\nOnassis attended Miss Porter's School, a prestigious boarding school in Farmington, Connecticut; in addition to its rigorous academics, the school also emphasized proper manners and the art of conversation. There she excelled as a student, writing frequent essays and poems for the school newspaper and winning the award as the school's top literature student in her senior year. Also during her senior year, in 1947, Onassis was named \"Debutante of the Year\" by a local newspaper. However, Onassis had greater ambitions than being recognized for her beauty and popularity. She wrote in the yearbook that her life ambition was \"not to be a housewife.\"\n\nUpon graduating from Miss Porter's School Onassis enrolled at Vassar College in New York to study history, literature, art and French. She spent her junior year studying abroad in Paris. \"I loved it more than any year of my life,\" Onassis later wrote about her time there. \"Being away from home gave me a chance to look at myself with a jaundiced eye. I learned not to be ashamed of a real hunger for knowledge, something that I had always tried to hide, and I came home glad to start in here again but with a love for Europe that I am afraid will never leave me.\"\n\nUpon returning from Paris, Onassis transferred to George Washington University in Washington, D.C., and graduated with a B.A. in French literature in 1951. After graduating from college in 1951, Onassis landed a job as the \"Inquiring Camera Girl\" for the Washington Times-Herald newspaper. Her job was to photograph and interview various Washington residents, and then weave their pictures and responses together in her column. Among her most notable stories were an interview with Richard Nixon, coverage of President Dwight D. Eisenhower's inauguration and a report on the coronation of Queen Elizabeth II.\n\nU.S. First Lady\n\nIt was at a dinner party in 1952 that Onassis met a dashing young congressman and senator-elect from Massachusetts named John F. Kennedy; he \"leaned across the asparagus and asked her for a date.\" They were married a year later, on September 12, 1953. Onassis gave birth to her first child, Caroline Kennedy, in 1957. That same year, she encouraged Kennedy to write and, subsequently, helped him edit Profiles in Courage, his famous book about U.S. senators who had risked their careers to stand for causes they believed in.\n\nIn January 1960, John F. Kennedy announced his candidacy for the U.S. presidency. Although Onassis was pregnant at the time and thus unable to join him on the campaign trail, she campaigned tirelessly from home. She answered letters, gave interviews, taped commercials and wrote a weekly syndicated newspaper column called \"Campaign Wife.\"\n\nOn November 8, 1960, Kennedy defeated Richard Nixon by a razor-thin margin to become the 35th president of the United States; less three weeks later, Onassis gave birth to their second child, John Fitzgerald Kennedy Jr. The couple had a third child, Patrick Bouvier Kennedy born prematurely on August 7, 1963, but lost the child two days later.\n\nOnassis's first mission as first lady was to transform the White House into a museum of American history and culture that would inspire patriotism and public service in those who visited. \"Every boy who comes here should see things that develop his sense of history,\" she once said. Onassis went to extraordinary lengths to procure art and furniture owned by past presidents—including artifacts owned by George Washington, James Madison and Abraham Lincoln—as well as pieces she considered representative of various periods of American culture. \"Everything in the White House must have a reason for being there,\" she insisted. \"It would be sacrilege merely to 'redecorate' it—a word I hate. It must be restored—and that has nothing to do with decoration. That is a question of scholarship.\"\n\nAs the culmination of her project, Onassis gave a tour of the restored White House on national television on February 14, 1962. A record 56 million viewers watched her televised special, and Onassis won an honorary Emmy Award for her performance.\n\nAs first lady, Onassis was also a great patron of the arts. In addition to the officials, diplomats and statesman who typically populated state dinners, Onassis also invited the nation's leading writers, artists, musicians and scientists to mingle with its top politicians. The great violinist Isaac Stern wrote to Onassis after one such dinner, \"It would be difficult to tell you how refreshing, how heartening it is to find such serious attention and respect for the arts in the White House. To many of us it is one of the most exciting developments on the present American cultural scene.\"\n\nAdditionally, Onassis frequently traveled abroad, both with the president and alone, and her deep knowledge of foreign cultures and languages (she spoke fluent French, Spanish and Italian) helped garner goodwill toward America. She was so adoringly received in France that President Kennedy introduced himself as \"the man who accompanied Jacqueline Kennedy to Paris.\" Presidential advisor Clark Clifford wrote to Onassis, \"Once in a great while, an individual will capture the imagination of people all over the world. You have done this; and what is more important, through your graciousness and tact, you have transformed this rare accomplishment into an incredibly important asset to this nation.\"\n\n(Photo: )\n\nAssassination of JFK\n\nOn November 22, 1963, Onassis was riding alongside the president in a Lincoln Continental convertible before cheering crowds in Dallas, Texas, when he was shot and killed by Lee Harvey Oswald, widowing Onassis at the age of 34. The first lady's stoic composure in her bloodstained pink suit became the symbol of national mourning. It was also Onassis who, in the aftermath of the president's death, provided a metaphor for her husband's administration that has remained its enduring symbol: Camelot, the idyllic castle of the legendary King Arthur. \"There'll be great presidents again,\" Onassis said, \"but there'll never be another Camelot again.\"\n\nMarriage to Aristotle Onassis\n\nIn 1968, five years after John F. Kennedy's death, Onassis married a Greek shipping magnate named Aristotle Onassis. However, he died only seven years later, in 1975, leaving Onassis a widow for the second time.\n\nFollowing the death of her second husband, Onassis returned to the promising career that had been put on hold when she married Kennedy. She went to work as an editor at the Viking Press in New York City and then moved to Doubleday, where she served as senior editor.\n\nJacqueline Bouvier Kennedy Onassis died on May 19, 1994, at the age of 64. She is buried beside President John F. Kennedy's gravesite at the Arlington National Cemetery, which is marked by the eternal flame.\n\nOnassis continues to be regarded as one of the most beloved and iconic first ladies in American history. Throughout her life, she was a ubiquitous presence on lists of the most admired and respected women in the world. Learned, beautiful and eminently classy, Onassis has come to symbolize an entire epoch of American culture. \"She epitomized elegance in the post–World War II era,\" historian Douglas Brinkley once said. \"There's never been a first lady like Jacqueline Kennedy, not only because she was so beautiful but because she was able to name an entire era 'Camelot' ... no other first lady in the 20th century will be able to have that aura. She's become an icon.\"\n\nVideos\n\nQUICK FACTS\n\nName: Jacqueline Kennedy Onassis\n\nBirth Year: 1929\n\nBirth date: July 28, 1929\n\nBirth State: New York\n\nBirth City: Southampton\n\nBirth Country: United States\n\nGender: Female\n\nBest Known For: Jacqueline Kennedy Onassis, noted for her style and elegance, was the wife of President John F. Kennedy and a U.S. first lady. She later married Aristotle Onassis.\n\nAstrological Sign: Leo\n\nSchools\n\nGeorge Washington University\n\n\n\nVassar College\n\n\n\nParis-Sorbonne University\n\nDeath Year: 1994\n\nDeath date: May 19, 1994\n\nDeath State: New York\n\nDeath City: New York\n\nDeath Country: United States\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION\n\nArticle Title: Jacqueline Kennedy Onassis Biography\n\nAuthor: Biography.com Editors\n\nWebsite Name: The Biography.com website\n\nUrl: https://www.biography.com/us-first-lady/jacqueline-kennedy-onassis\n\nAccess Date:\n\nPublisher: A&E; Television Networks\n\nLast Updated: September 14, 2022\n\nOriginal Published Date: April 3, 2014\n\nQUOTES", "images": ["https://hips.hearstapps.com/hmg-prod/images/pope-leo-xiv-greets-faithful-at-the-end-of-his-first-mass-news-photo-1757689816.pjpeg?crop=0.563xw:0.844xh;0.287xw,0.0433xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/biography/static/images/logos/logo.5ec9b18.svg?primary=%2523ffffff", "https://www.biography.com/_assets/design-tokens/biography/static/images/logos/network-logo.04aa008.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/christopher-columbus-detail-from-allegory-on-charles-v-of-news-photo-1759849836.pjpeg?crop=0.761xw:0.963xh;0.0641xw,0.0365xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/statue-of-liberty-royalty-free-image-1748881761.pjpeg?crop=0.673xw:1.00xh;0.176xw,0&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-73203544.jpg?crop=0.569xw:0.779xh;0.298xw,0.158xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/jacqueline-kennedy-onassis-gettyimages-517213210.jpg?crop=1xw:1.0xh;center,top&resize=640:*", "https://hips.hearstapps.com/hmg-prod/images/view-of-the-729-foot-ore-boat-ss-edmund-fitzgerald-sault-news-photo-1762795996.pjpeg?crop=0.685xw:1.00xh;0,0&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://www.biography.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://hips.hearstapps.com/hmg-prod/images/clara-barton-news-photo-1758724049.pjpeg?crop=0.699xw:0.537xh;0.181xw,0.194xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/firefighters-walk-towards-one-of-the-tower-at-the-world-trade-center-before-it-collapsed-after-a-plane-hit-the-building-september-11-2001-in-new-york-city-photo-by-jose-jimenezprimera-horagetty-images.jpg?crop=0.665xw:1xh;center,top&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://www.biography.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-525373675-67d980feb2725.jpg?crop=0.588xw:0.925xh;0.207xw,0.0187xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/ophelia-private-collection-news-photo-1759335054.pjpeg?crop=0.802xw:1.00xh;0.0735xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/former-first-lady-jacqueline-kennedy-enjoys-herself-at-a-news-photo-1688141417.jpg?crop=1.00xw:0.509xh;0,0.197xh&resize=1200:*", "https://hips.hearstapps.com/vidthumb/images/inkt-ep04-thumbnail-682dd7da2d33d.jpg?crop=1xw:1xh;center,top", "https://hips.hearstapps.com/hmg-prod/images/portrait-of-mary-todd-lincoln-royalty-free-image-1762448362.pjpeg?crop=1.00xw:0.793xh;0,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/jacqueline-kennedy-onassis-9428644-2-raw.jpg?resize=980:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/screenshot-2025-11-06-at-1-23-04-pm-690ce7a6b20b7.png?crop=0.667xw:1.00xh;0.240xw,0&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://hips.hearstapps.com/hmg-prod/images/amelia-image-68da9454ca115.png?crop=0.716xw:1.00xh;0.284xw,0&resize=360:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/former-first-lady-jacqueline-kennedy-enjoys-herself-at-a-news-photo-1688141417.jpg?crop=1.00xw:0.509xh;0,0.197xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.biography.com/history-culture/jacqueline-kennedy-onassis", "title": "Jacqueline Kennedy Onassis", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Jacqueline Kennedy Onassis - Style, Death & Aristotle Onassis", "description": "Explore the life of Jacqueline Kennedy Onassis, including her work as first lady, her marriages to JFK and Aristotle Onassis, and more, only at Biography.com.", "keywords": "School: Paris-Sorbonne University, School: Vassar College, School: George Washington University, Last Name: Onassis, First Name: Jacqueline, Death Year: 1994, Death Month/Day: May 19, Birth Month/Day: July 28, Birth City: Southampton, Group: The Kennedy Family, Affiliations: Catholic, Life Events/Experience: Were Injured in Combat, Affiliations: U.S. Democrat, Death City: New York, Industry/Interest Area: Vietnam War, Birth State: New York, Death Month: 5, Industry/Interest Area: Politics and Government, Astrological Sign: Leo, Death State: New York, Cultural Association: Irish American, Life Events/Experience: Assassinated, Birth Year: 1929, Industry/Interest Area: Civil Rights, Life Events/Experience: Served in the Navy, Death Country: United States, Birth Month: 7, Birth Country: United States", "theme-color": "#000000", "og": {"site_name": "Biography", "title": "Jacqueline Kennedy Onassis - Style, Death & Aristotle Onassis", "description": "Jacqueline Kennedy Onassis, noted for her style and elegance, was the wife of President John F. Kennedy and a U.S. first lady. After Kennedy's death, she married Greek shipping magnate Aristotle Onassis.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/former-first-lady-jacqueline-kennedy-enjoys-herself-at-a-news-photo-1688141417.jpg?crop=1.00xw:0.509xh;0,0.197xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.biography.com/history-culture/jacqueline-kennedy-onassis", "type": "article"}, "article": {"publisher": "https://www.facebook.com/Biography", "opinion": "false", "section": "History & Culture", "modified_time": "2022-09-14T01:46:00Z", "published_time": "2022-09-14T01:46:00Z"}, "parsely-metadata": "{\"socialHeadline\":\"Jacqueline Kennedy Onassis - Style, Death & Aristotle Onassis\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/former-first-lady-jacqueline-kennedy-enjoys-herself-at-a-news-photo-1688141417.jpg?crop=0.986xw:1.00xh;0.00801xw,0&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/former-first-lady-jacqueline-kennedy-enjoys-herself-at-a-news-photo-1688141417.jpg?crop=1.00xw:0.509xh;0,0.197xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/former-first-lady-jacqueline-kennedy-enjoys-herself-at-a-news-photo-1688141417.jpg?crop=0.986xw:1.00xh;0.00801xw,0", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/former-first-lady-jacqueline-kennedy-enjoys-herself-at-a-news-photo-1688141417.jpg?crop=1.00xw:0.509xh;0,0.197xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "never", "sailthru.excerpt": "(1929-1994)Who Was Jacqueline Kennedy Onassis?Jacqueline Kennedy Onassis married John F. Kennedy in 1953. When she became first lady in 1961, she worked to restore the White House to its original elegance and to protect its holdings. After JFK's assassination in 1963, she moved to New York City and married Aristotle", "sailthru.tags": "history-culture,History & Culture,Biography-US", "sailthru.date": "2022-09-14 01:46:00", "sailthru.socialtitle": "Jacqueline Kennedy Onassis - Style, Death & Aristotle Onassis", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1663119960.0, "source": "https://www.biography.com", "summary": ""}