{"url": "meaww.com/jennifer-aniston-furious-over-emma-stone-and-justin-theroux-romance-rumors", "text": "Jennifer Aniston is reportedly filled with 'furious rage' over the news of Emma Stone and Justin Theroux's rumored romance\n\nSources claim that Jennifer is feeling the same rage as it was with Angelina Jolie after Brad Pitt broke up with her. It's like a pattern they say - hating the woman never the man.\n\nIt's not a good time to Jennifer Aniston. After her marriage with Justin Theroux ended, she has been constantly in the limelight being scrutinized for her reactions on how her ex is moving on after the split. A while ago it was Selena Gomez and now it is another actress who has been drawn into the picture. The Friends actress is fed up with hearing news of Emma Stone and Justin's budding romance.\n\nThe actress is reportedly furious seeing how things are unfolding for Emma and Justin. According to Radar Online, Jennifer is filled with 'furious rage' looking at both of them get close and taking various trips together. “It bugs the hell out of Jen that Justin got close to Emma during their marriage and she isn’t taking this lying down,” a source told the website.\n\nJennifer is not taking news about Emma and Justin well (Photo by Pascal Le Segretain/Getty Images)\n\nIt seems like Jennifer is taking every bit of help she can from her pals in order to get back at Emma. “She’s dragging Emma every chance she gets and warning pals like Jason Bateman and Jimmy Kimmel to avoid her,\" the source added. The website further added that Jennifer is \"fuming\" over their now public romance. “Jen and her squad take issue with the fact that Emma never met a role she couldn’t steal from another actress [most famously ‘La La Land’ from Emma Watson],” the source revealed.\n\n“I don’t think she realizes who she messed with and how far Jen’s reach is,\" the source added. The website claims that the rage Jennifer has towards Emma is a lot like she had over Angelina Jolie after Brad Pitt broke up with her to be with the Maleficent actress. “This is a pattern for Jen, never directing the rage or gossip at the guy who left her but instead at the next woman he hooks up with,\" the source revealed.\n\nWhile Jennifer hasn't taken any steps yet, the source believes that Emma should be careful. “Jen is in revenge mode and Emma needs to recognize that she’s messing with somebody with a lot of loyal Hollywood friends,\" the source said. The rumors about Emma and Justin dating emerged after the two were spotted dining together in NYC. The pair was all smiles as they were photographed heading into Blue Ribbon Sushi in Soho for a night out.\n\nAt the same time, nearly a month after Justin announced his split from Jennifer Aniston, he made his first public appearance at the Louis Vuitton fashion show during Paris Fashion Week on March 6. The actor was seen sitting next to Michelle Williams and Emma. The following month, Justin shared some pictures on his Instagram where it was seen that the actor was hanging out with the Queer Eye's Jonathan Van Ness and Emma. Knowing how one photo is enough to raise speculation, Justin was careful of the words he used and made sure that he made their relationship status clear in the caption.\n\n\"Save lives! Save lives! Saving lives! Doing the most! Bffffffs. And yes. JUST bfffffs,\" he wrote. The pair was also spotted leaving Met Gala together even though they arrived separately at the event. Emma looked flawless as she wore a navy dress with gold embellishments for the event, while Justin chose to keep his look a bit casual as he opted for an all-black ensemble. The pair has been good friends ever since they worked together for Netflix's show 'Maniac'.", "images": ["https://d2a0gza273xfgz.cloudfront.net/15004/uploads/f1a18e60-591a-11ea-b202-8d14264fa8c5_800_420.jpeg", "http://d2a0gza273xfgz.cloudfront.net/15004/uploads/f1a18e60-591a-11ea-b202-8d14264fa8c5_800_420.jpeg"], "top_img": "https://d2a0gza273xfgz.cloudfront.net/15004/uploads/f1a18e60-591a-11ea-b202-8d14264fa8c5_800_420.jpeg", "keywords": [], "authors": ["Feb"], "canonical_link": "https://meaww.com/jennifer-aniston-furious-over-emma-stone-and-justin-theroux-romance-rumors", "title": "Jennifer Aniston is reportedly filled with 'furious rage' over the news of Emma Stone and Justin Theroux's rumored romance", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "Sources claim that Jennifer is feeling the same rage as it was with Angelina Jolie after Brad Pitt broke up with her. It's like a pattern they say - hating the woman never the man.", "robots": "index,follow,max-image-preview:large", "og": {"image": {"identifier": "https://d2a0gza273xfgz.cloudfront.net/15004/uploads/f1a18e60-591a-11ea-b202-8d14264fa8c5_800_420.jpeg", "width": 1200, "height": 630}, "site_name": "https://meaww.com", "locale": "en_US", "description": "Sources claim that Jennifer is feeling the same rage as it was with Angelina Jolie after Brad Pitt broke up with her. It's like a pattern they say - hating the woman never the man.", "url": "https://meaww.com/jennifer-aniston-furious-over-emma-stone-and-justin-theroux-romance-rumors", "type": "article"}, "twitter": {"card": "photo", "image": "https://d2a0gza273xfgz.cloudfront.net/15004/uploads/f1a18e60-591a-11ea-b202-8d14264fa8c5_800_420.jpeg"}, "article": {"published_time": "2018-06-12T05:05:58.000Z", "modified_time": "2020-02-27T04:39:15.000Z", "section": "news", "tag": "Florida,jacksonville florida,St. Johns River in Jacksonville,strong river current", "publisher": "https://www.facebook.com/meawwcom/"}, "keywords": "Florida,jacksonville florida,St. Johns River in Jacksonville,strong river current,animals,funny,inspiring,lifestyle,news,parenting,relationships,science-nature,wholesome,work,article,articles,viral,post,fun,read"}, "movies": [], "publish_date": 1528779958.0, "source": "http://meaww.com", "summary": ""}