{"url": "https://en.wikipedia.org/wiki/Bon_App%C3%A9tit_(song)", "text": "2017 single by Katy Perry featuring Migos\n\n\"Bon Appétit\" is a song by American singer Katy Perry featuring American hip hop group Migos from Perry's fifth studio album Witness (2017). It was released as the album's second single on April 28, 2017, by Capitol Records. The song was written by Perry and the Migos themselves, alongside Ferras and the song's producers, Max Martin, Shellback, and Oscar Holter. The song was recorded at MXM Studios and Unsub, both based in Los Angeles, and Wolf Cousins, based in Stockholm, Sweden. It is a dance-pop, trap-pop, electronic and Eurodisco song, with lyrics that feature oral sex double entendres involving food.\n\nUpon its release, the track received mixed reviews from music critics, who complimented the production but panned the lyrics. Commercially, the song charted within the top ten in Bulgaria and Israel, the top twenty in Canada, Panama and Wallonia, and the top thirty in Scotland, the Philippines, Slovakia, and the Netherlands. The song is certified Diamond in Brazil, and Platinum in Australia, Italy, Mexico, and the United States.\n\nAn accompanying music video followed on May 12, 2017, and features Perry being prepared and served by chefs as a dish. It received 16,000,000 views within 24, beating Adele's \"Hello\". The song won a Vevo Certified Award in 2017 and a TASTE Award in 2018, the latter for Song of the Year. It's music video was nominated in the Best Video at the 2017 MTV Europe Music Awards, the Best Art Direction category at the 2017 MTV Video Music Awards, and the Video of the Year category at the 2017 Telehit Awards. The video eventually won in the Best International Female Video category at the 2017 MTV Video Music Awards Japan.\n\nComposition [ edit ]\n\nKaty Perry described her fifth album Witness as a \"360-degree liberation\" record, with \"Bon Appétit\" representing a \"sexual liberation\".[1] She also called it a \"pretty sexual\" song that was part of \"some of that good 'ol Katy Perry, fluffy stuff that you love so much\".[2] \"Bon Appétit\" is a disco-infused[3] dance-pop,[4] trap-pop,[3] electronic[5] and Eurodisco[6] song with a duration of 3 minutes and 47 seconds.[7] According to Hugh McIntyre from Forbes, the track's rhythm features \"breezy, summery, 90's-invoking vibes\" and a beat that gradually builds, eventually becoming \"undeniable\".[8] MTV writer Sasha Geffen calls the track \"a smorgasbord\" of double entrendres with food saying that \"...'eating' can only mean two things\",[4] with Anna Gaca of Spin explicitly noting its connotations of oral sex.[9] In the song, Perry sings \"'Cause I'm all that you want, boy/All that you can have, boy/Got me spread like a buffet/Bon a, Bon appétit, baby\".[10] Christopher R. Weingarten of Rolling Stone found the song similar to the music of AC/DC.[11]\n\nThe song is written in the key of B♭ Phrygian with a tempo of 106 beats per minute in common time. Perry's vocals span from G♭ 3 to E♭ 5 .[12] The song was written by Perry and the Migos themselves, alongside Ferras and the song's producers, Max Martin, Shellback, and Oscar Holter. The song was recorded at MXM Studios and Unsub, both based in Los Angeles, and Wolf Cousins, based in Stockholm, Sweden.\n\nRelease and promotion [ edit ]\n\nOn April 24, Perry sent out a recipe for the \"World's Best Cherry Pie\", teasing the song's release. Fans sent photos of their completed pies to Perry on Twitter where she said they \"may get a surprise\" and rated their pies.[13][14] Perry subsequently announced the track's release two days later. Capitol Records released it for download on April 28, 2017, as the second single from her upcoming fifth studio album.[7][15] To promote the song on the day of its release, Perry went to Times Square in a food truck to hand out cherry pies to fans.[3] Three days later, she and Migos performed it at the 2017 Met Gala after Perry also sang her songs \"Chained to the Rhythm\", \"Dark Horse\", and \"Firework\". According to Vogue, \"Bon Appétit\" was the highlight of the show, writing the performance was where \"things really got going\", concluding \"that's how you wrap up a Met Gala.\"[16]\n\nCritical reception [ edit ]\n\n\"Bon Appétit\" received mixed reviews from critics.[17][18][19] Entertainment Weekly's reviewer Nolan Feeney gave \"Bon Appétit\" a B+ rating writing, \"she is back to garish, stupid-fun party jams that don't even try to be subtle about cramming in as many sex metaphors as possible in three-and-a-half minutes. In other words, the kind of songs she's best at.\"[20] Forbes writer Hugh McIntyre felt the song was \"great pop music\" with potential for success.[8] Jon Caramanica of The New York Times states, \"Ms. Perry is in her least convincing mode—dance-floor diva—but the production is direct and effective.\"[21] NME writer Jamie Milton calls \"Bon Appétit\" a \"recipe for greatness\", and \"supremely confident, addictive, steamed-up sound of summer 2017\". Milton praised Migos' presence on the song saying they \"could grace any track and make it even better\".[22] Chris Willman of Variety said \"Bon Appétit\" is, \"a gleefully ridiculous exercise in chewing the comedic scenery by presenting female sexuality as a four-course-plus meal\", noting Perry is moving \"further into a pure EDM-pop realm here\".[23] Idolator's Mike Wass ranked it as the eighth best pop song of 2017,[24] and described the song as \"catchy\" as well as a \"tasty treat\", though felt its chorus had too many double entendres.[25]\n\nIn a negative review, USA Today contributor Jayme Deerwester criticized the track's production as \"unsubstantial and ultimately unsatisfying\".[26] Spin writer Anna Gaca was equally critical of the song. Gaca called the song \"Katy Perry's drooling one-trick pony of a new single, also featuring Migos. It's about food and none-too-coded references to Katy Perry's vagina, and it will make you a little uncomfortable.\"[27] Isha Aran of Fusion was critical of the lyrics and production, while considering the song an improvement to its predecessor commenting \"I can't say the song is great (Katy Perry songs always feel incomplete to me, like they're giving 70%), but it's something of a relief—much less awkward than 'conscious' Katy.\"[28] Perry's collaboration with Migos was criticized by media commentators and fans due to the group's homophobic comments on American rapper iLoveMakonnen.[29][30][31]\n\nCommercial performance [ edit ]\n\nPerry performing “Bon Appétit” during her residency Play\n\nIn the United States, the song opened at number 76 on the Billboard Hot 100 dated May 20, 2017, with first week digital downloads of 18,000 copies and an airplay audience of 3.8 million.[32] Following the music video's release, it re-entered at number 59 and debuted on the Streaming Songs chart at number 36 with 11.7 million streams.[33] It also peaked at number 28 on the Hot Dance Club Songs chart, thus breaking her streak of 18 consecutive number-one singles on the chart.[34] The song has been certified platinum by the Recording Industry Association of America for equivalent sales of 1,000,000 units in the United States.\n\nIn Australia, the track debuted at number 35 on the ARIA Charts with sales of 4,358 copies.[35] In the United Kingdom, it entered at number 40 on the UK Singles Chart.[36] It later ascended to number 37 in the nation.[37] In Canada, \"Bon Appétit\" entered at number 41[38] before rising to number 14.[39] In France, the song debuted at number 37 on May 5, 2017. Following Perry's performance on The Voice: la plus belle voix on June 4, 2017, the song peaked at number 9 on the Download chart.[40][41]\n\nMusic video [ edit ]\n\nChef Roy Choi appeared in the music video.\n\nDent De Cuir directed the song's music video, which was released on May 12, 2017, and features chef Roy Choi. It first shows Perry wrapped in plastic before chefs cut the wrapping open and \"start kneading her like dough\" before she is boiled in a pot with carrots and prepared like a food while singing her lyrics and Choi serves her as a meal to various cannibalizing patrons. Migos watch and rap their verses as Perry rings the bell, signaling them to turn a switch allowing her to turn the tables on the patrons. In a scene heavily inspired by the 1988 film Beetlejuice, the patrons are then bound, gagged and then dismembered by the chefs as Perry then dances on a pole. Perry then is served a pie containing dismembered body parts of the patrons.[42]\n\nUpon its release, the music video received mixed reviews. Brian Josephs of Spin criticized the video as \"uncomfortable to watch\", and wrote that it is \"Weird as Hell\".[43] Writing for Entertainment Weekly, Nolan Feeney called it both \"eye-catching\" and \"as creepy as it is bonkers\".[44] Commercially, the video accrued over 16 million views within 24 hours on YouTube, the most since Adele's \"Hello\" music video.[45]\n\nAwards and nominations [ edit ]\n\nTrack listing [ edit ]\n\nDigital download [ 7 ] No. Title Length 1. \"Bon Appétit\" (featuring Migos) 3:47\n\nDigital download – 3lau remix [ 53 ] No. Title Length 1. \"Bon Appétit\" (3lau remix; featuring Migos) 3:04\n\nDigital download – Martin Jensen remix [ 54 ] No. Title Length 1. \"Bon Appétit\" (Martin Jensen remix; featuring Migos) 2:56\n\nDigital download – Muna remix [ 55 ] No. Title Length 1. \"Bon Appétit\" (Muna remix) 3:21\n\nDigital download – Amir Afargan remix [ 56 ] No. Title Length 1. \"Bon Appétit\" (Amir Afargan remix; featuring Migos) 3:43\n\nDigital download – Aslove remix [ 57 ] No. Title Length 1. \"Bon Appétit\" (Aslove remix; featuring Migos) 3:54\n\nCredits and personnel [ edit ]\n\nRecording [ edit ]\n\nManagement [ edit ]\n\nWhen I'm Rich You'll Be My Bitch (ASCAP) – administered by WB Music Corp., – MXM – administered by Kobalt (ASCAP), WB Music Corp. on behalf of Warner/Chappell Music Scandinavia AB and Wolf Cousins (ASCAP), WB Music Corp. (ASCAP), Crown and Scepter (ASCAP), Unsub Pub LLC (ASCAP) – administered by WB Music Corp. –, Huncho YRN Music/Quality Control QC Pro/Universal Music Corp. (ASCAP), YRN Piped Up Entertainment/Quality Control QC Pro/Reservoir Media Music (ASCAP) and Silent Assassin YRN/Quality Control QC Pro/Reservoir Media Music (ASCAP)\n\nMigos appears courtesy of Quality Control Music\n\nPersonnel [ edit ]\n\nKaty Perry – lead vocals, songwriter\n\nMigos – featured vocals, songwriters\n\nMax Martin – songwriter, producer for MXM Productions\n\nShellback – songwriter, producer for MXM Productions, keyboards, programming, background vocals\n\nOscar Holter – songwriter, producer for Wolf Cousins Productions, keyboards, programming\n\nFerras Alqasi – songwriter\n\nSam Holland – engineering\n\nCory Bice – engineering assistant\n\nJeremy Lertola – engineering assistant\n\nPeter Karlsson – vocal editing\n\nDaryl \"DJ Durel\" McPherson – vocals recording (Migos)\n\nSerban Ghenea – mixing\n\nJohn Hanes – mixing engineering\n\nRandy Merrill – mastering\n\nCredits adapted from the liner notes of Witness.[58]\n\nCharts [ edit ]\n\nCertifications [ edit ]\n\nRelease history [ edit ]\n\nNotes [ edit ]\n\n^ The 3lau remix was nominated.", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Katy_Perry_Play_at_Resorts_World%2C_Las_Vegas_%2851809958880%29.jpg/250px-Katy_Perry_Play_at_Resorts_World%2C_Las_Vegas_%2851809958880%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/2/27/Katy_Perry_-_Bon_App%C3%A9tit_%28Official_Single_Cover%29.png/250px-Katy_Perry_-_Bon_App%C3%A9tit_%28Official_Single_Cover%29.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Katy_Perry_10_%2842287588594%29.jpg/250px-Katy_Perry_10_%2842287588594%29.jpg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/en/2/27/Katy_Perry_-_Bon_App%C3%A9tit_%28Official_Single_Cover%29.png", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/Roy_Choi_from_Koji_BBQ_%28cropped%29.jpg/250px-Roy_Choi_from_Koji_BBQ_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/20px-Symbol_category_class.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/2/27/Katy_Perry_-_Bon_App%C3%A9tit_%28Official_Single_Cover%29.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Bon_App%C3%A9tit_(song)", "title": "Bon Appétit (song)", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/2/27/Katy_Perry_-_Bon_App%C3%A9tit_%28Official_Single_Cover%29.png", "width": 1200, "height": 1200}, "title": "Bon Appétit (song) - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}