{"url": "https://www.harpersbazaar.com/celebrity/latest/a14698/kendall-jenner-reveals-which-sisters-closet-she-shops-for-what/", "text": "16 min read\n\nKendall Jenner and Bad Bunny caused a stir in February 2023 with their unexpected romance—but by the end of the year, it was confirmed the It couple had called it quits. Now, they’re back together.\n\nThe supermodel—who previously dated NBA star Devin Booker—first connected with the Grammy-winning Puerto Rican rapper and singer through mutual friends when he moved to Los Angeles early in 2023. The pair embarked on a low-key though buzzy romance, as reflected in both their joint sighting at Coachella in April and their date nights around L.A.\n\nAhead, see everything we know about the model and the musician’s relationship—from the first dating rumors to their recent reconciliation.\n\nJune 23, 2024: They have a Paris Fashion Week date.\n\nThe couple closes men’s Fashion Week in Paris with a romantic dinner at Italian restaurant Ferdi, near the Champs Élysées. Toward the end of the date, friend Gigi Hadid meets up with the pair, and the trio head to a private bash at the Perfumery near the Palais-Royal.\n\n\n\nFor the fun evening out, Jenner looks chic in a steel-gray top-and-pants set from younger sister Kylie Jenner’s clothing brand, Khy. The reggaeton star coordinates with her in a light gray suit with an oversize blazer, plus black accents.\n\nBACKGRID\n\nJune 11, 2024: They go to Puerto Rico.\n\nBunny takes Jenner to his native Puerto Rico, and the two are spotted looking so smitten on a dinner date. In a video captured by a bystander and shared on X (formerly Twitter), the stars are seen sitting across from one another at a table topped with several empty glasses. The model looks amazing in a backless red dress, while the reggaeton singer wears a black hoodie and a blue baseball cap.\n\nSee the post here.\n\nMay 30, 2024: Multiple sources confirm the couple is back together.\n\nAfter being spotted together several times over the last month, Jenner and Bad Bunny are officially back together, multiple sources confirm to People. “It’s going well and they’re prioritizing spending time together as they figure it out,” a source told the outlet. “There wasn’t ever any drama in their breakup and they missed each other.”\n\n“It’s like they needed the break to miss each other enough to figure things out,” another insider explains. “They always had this crazy attraction to each other. Things are great again.”\n\nMay 27, 2024: The duo exits a Miami hotel together.\n\nThe supermodel and the singer are photographed exiting a luxury hotel in Miami, doing their best to sneak out of the oceanside resort by walking through the parking garage. They get into the back of the same car as a security guard keeps watch.\n\nThe duo is spotted on multiple dates throughout Memorial Day weekend. On Friday, they dine together at Bad Bunny’s restaurant Gekko, and on Sunday, they eat lunch at Grutman’s Casadonna restaurant.\n\nMay 17, 2024: Kendall supports Bad Bunny at a show in Florida.\n\nJenner is spotted dancing at Bunny’s concert in Orlando, Florida. She attempts to blend in with the crowd by wearing merch from his Most Wanted Tour, throwing on an oversize brown sweatshirt and pulling the hood over her long hair. The model sways from side to side as she watches the show from the VIP section.\n\nOf where their relationship stands today, a source tells Entertainment Tonight, “Kendall and Bad Bunny are still in contact and spend time together when they can. There’s a strong connection between them whenever they’re together, and they have the same chemistry that they’ve always had.”\n\nThe source adds: “They’re having fun for now, but are hoping to figure things out in a way that makes sense. They’re not necessarily back together or an exclusive item, but there is definitely still a vibe between them. Neither of them feels any pressure and appreciate[s] that they can enjoy space when they want. It’s casual, easy, and comfortable between them.”\n\nMay 7, 2024: They leave the same hotel in the morning.\n\nJenner and Bunny are photographed leaving the same hotel in New York City’s TriBeCa neighborhood—though separately—the morning after their Met Gala reunion. They each step out of the Greenwich Hotel in casual outfits.\n\nMay 6, 2024: They reunite at the 2024 Met Gala.\n\nThe supermodel and the singer walk the carpet at the Metropolitan Museum of Art separately, but reunite at friend Emily Ratajkowski’s after-party with Clase Azul hosted at WSA. The two are seen chatting, laughing, and engaging in PDA while surrounded by friends at a VIP table throughout the night, Bazaar can confirm. She’s pretty in a white lace dress, while he’s cool in a long black leather trench, crisp white shirt, and dark trousers.\n\nWWD/Getty Images\n\nJanuary 1, 2024: The two spend New Year’s together after splitting.\n\nThe former couple appear to remain on good terms after their breakup, even celebrating the new year together on a trip to Barbados, along with a group of their mutual friends.\n\nA source admits to People that Jenner and Bunny “celebrated New Year together with friends near Barbados.” Despite spending time together for the holiday, the source adds that Jenner and Bunny did “not [go] on the same flight” and are not “back together.”\n\nDecember 17, 2023: An insider confirms that Kendall and Bad Bunny have gone their separate ways.\n\nAfter less than a year of dating, an insider confirms to People that Bunny and Jenner have called it quits. A source gives some insight to Entertainment Tonight, saying, “Kendall and Bad Bunny have been doing their own things lately, and things slowly started to fizzle out between them. They both knew going into this that it likely wouldn’t be a forever type of relationship, and that was mutually understood from the get-go.”\n\nApparently timing is the key to the split, as the source adds, “They have crazy-busy schedules and know they’re still young and have a lot more to experience individually before settling down.”\n\nHowever, despite the end of their relationship, the source notes that there “isn’t any negativity between them and they still want the best for one another.” In particular, the model’s family “still thinks highly of [Bad Bunny].” The source adds, “They just want her to be with whoever makes her happy, treats her with love and respect, and someone that understands and can handle the attention that comes along with dating her with poise and grace.”\n\nOctober 22, 2023: Kendall supports Bad Bunny at his Saturday Night Live after-party.\n\nThe couple are photographed while arriving at the NYC hot spot L’Avenue, where they celebrated the rapper’s stint both hosting and performing on SNL. For the outing, Jenner layers a beige suede bomber jacket over a gray T-shirt, black pleated trousers, and black loafers from the Row. Meanwhile, Bunny pairs a cozy brown knit sweater with black jeans, chunky black loafers, and a navy baseball cap.\n\nOctober 8, 2023: They attend a concert together.\n\nJenner and Bad Bunny are seen arriving at New York City’s Madison Square Garden to see Mexican singer Luis Miguel in concert. For the outing, they coordinate in sleek black looks. Jenner wears a tee with tailored trousers, a thin belt, pointy heels, a Gucci handbag, and oval sunglasses. The rapper, meanwhile, opts for a leather jacket with leather racer pants and leather boots; he accessorizes with a white baseball cap and sunglasses.\n\nBACKGRID BACKGRID\n\nOctober 6, 2023: They’re spotted out in Miami following the Billboard Latin Music Awards.\n\nThe couple are seen on an afternoon outing on Friday, one day after the Un Verano Sin Ti rapper performed at the ceremony at the Watsco Center in Coral Gables, Florida. Per Page Six, they visited the Superblue Miami art installation, followed by dinner at Hometown Barbecue in the city’s Allapattah neighborhood. The model pairs white jeans and white Adidas Sambas sneakers with a plain gray tank top, which is cinched with a hair clip to reveal her abs. Meanwhile, the musician wears a white T-shirt tucked into brown pants, a brown baseball cap, and a checkered scarf tied around his neck.\n\nSeptember 30, 2023: They appear together in a luxe Gucci campaign.\n\nThe couple immortalize their relationship while teaming up in an ad campaign for Gucci’s Valigeria luggage collection, photographed by Anthony Seklaoui. In one standout photo, the couple are all smiles as the rapper hugs the model from behind, as she is perched on a stack of travel bags and suitcases. For another image evoking a paparazzi pic, the pair wear coordinating looks and sunglasses from the brand while walking through an airport. Jenner layers a gray trench over a plain white tank and miniskirt covered in Gucci’s interlocking GG logo, while Bunny pairs baggy blue jeans with a white crewneck sweater featuring a green emblem.\n\nSeptember 22, 2023: They make their front-row debut at Milan Fashion Week.\n\nThe couple attend Gucci’s Spring/Summer 2024 runway show in Milan, Italy, where they sit front-row together in cool looks. Jenner is dressed in a pale beige double-breasted trench coat as a minidress, cinched at the waist with a matching belt. She completes the look with crimson pointed-toe slingbacks, a Jackie shoulder bag in the same hue, sculptural gold hoops, and black rectangular sunglasses. Meanwhile, Bunny wears a crisp white button-down, blue jeans, black dress shoes, a beige beanie, diamond hoop earrings, and his own pair of black shades.\n\nJacopo M. Raule // Getty Images\n\nSeptember 15, 2023: They spend the day together in NYC.\n\nThe singer and the model are spotted out and about together in NYC, where they look cool in casual looks on an afternoon stroll. That evening, they enjoy a dinner at celeb hotspot Cosme, where Jenner styles a pair of gray jeans with an oversize, floral-print knit sweater. She completes the look with black loafers, sunglasses, and a huge tan bag. Bunny wore a white button-down over a white tank top and baggy jeans, adding a brown leather belt, a blue ball cap, and layered necklaces.\n\nBACKGRID\n\nSeptember 12, 2023: Bad Bunny speaks out on fans criticizing his romance with Kendall.\n\nIn a candid interview with Vanity Fair, the musician gets real about enforcing personal boundaries when it comes to his private life and fame.\n\n“They [fans] don’t know how you feel, they don’t know how you live, they don’t know anything, and I really don’t want them to know,” he tells the magazine. “I’m not really interested in clarifying anything because I have no commitment to clarify anything to anyone. I am clear and my friend Jomar is clear and my mother is clear. They are the only ones to whom I have to clarify anything. As for Juliana Dominguez from Mississippi, I have nothing I need to clarify to her. Never. About anything.”\n\nHe adds, “There are people who say that artists have to put up with it. I don’t have to accept anything and everything because I wanted to be an artist. At the end of the day, you listen to me because you want to. I don’t force you to.”\n\nHe also lambasts the culture of people normalizing the filming of strangers in public spaces.\n\n“It used to be a guy with a camera and a flash and they fuck with your eyes like that. Nowadays, everybody is a paparazzo,” he says. “Everyone is taking photos, everyone is recording. Nobody respects anybody’s privacy, and not only my privacy as a celebrity, but yours. ... Because if right now you go out there and your pants are ripped and you can see a butt cheek, or a pigeon shits on you, there’s a bastard who will film you and take a picture of you.”\n\nAugust 28, 2023: Bunny wears Kendall’s K initial necklace.\n\nBenito once again subtly showed his love for Jenner on his Instagram Story by wearing a dainty gold chain necklace with a K charm. The necklace appears to be the same one the model wore during a recent video interview.\n\nAugust 27, 2023: Bunny posts a rare video with Kendall.\n\nOn his Instagram Story, the rapper shares a rare clip of an intimate moment with his girlfriend—in it, Jenner is heard calling to a little squirrel who is running in the bushes next to them. “It’s the cutest thing ever. Come here!” she says. “Mami, be careful,” Bunny tells her. “Rabies?” she asks. “The mosquitoes,” he replies.\n\nThe pair’s faces don’t show in the video, but the sweet back-and-forth conversation is the most we’ve gotten from them in terms of insight into their dynamic.\n\nAnd in another subtle tribute to Jenner, the “Where She Goes” rapper also posts a photo on his Story of two cocktails—presumably his and Jenner’s—next to an 818 tequila bottle, which is the model’s brand. No caption needed.\n\nBad Bunny / Instagram\n\nAugust 13, 2023: They make out and dance at a Drake show.\n\nThe couple look so in love while at Drake’s concert in Los Angeles on Sunday. A video shared by a concertgoer on TikTok shows Jenner and Bad Bunny making out, sweetly embracing, laughing, and dancing to the music. What makes it all hilarious, though, is that the model’s older sister Kim Kardashian is standing right beside Bunny the whole time.\n\nJenner wears an asymmetric black mesh top over a lacy black bralette for a date with the rapper. He, meanwhile, opts for a cool black tank and brown leather jacket.\n\nBACKGRID\n\nThe singer and the supermodel step out for dinner at Sushi Park in West Hollywood in all-black looks. Jenners opts for a chic black midi dress with spaghetti straps and a matching black leather mini shoulder bag. Bad Bunny looks cool in a dark-wash denim jacket layered over a black top and paired with black pants. He accessorizes with a black baseball cap—which he wears backward—black oval sunglasses, and gold jewelry.\n\nBACKGRID\n\nJuly 20, 2023: Kendall and Bad Bunny are reportedly “becoming more serious.”\n\nWhile Jenner and Bad Bunny have kept their romance private, the couple are reportedly getting closer than ever. A source tells Entertainment Tonight the pair are getting closer as they keep things light and continue dating.\n\n“Kendall and Bad Bunny are still hanging out and having a great time with each other. Things are definitely progressing between them,” the source says. “Things are becoming more serious and their relationship is on the upswing. They are still keeping things light, but they are both super into each other and have a ton of chemistry. Their friends and families are really happy for them and like them as a couple.”\n\nJune 21, 2023: The two publicly allude to their relationship for the first time.\n\nIn new interviews, the couple open up about keeping their romance out of the spotlight.\n\nSpeaking with WSJ magazine, Jenner has “no comment” when asked about her relationship status. She explains, “I try [to] find the balance of keeping things private and keeping things sacred, [and] also not letting the unfortunate frustration and stress of everyone trying to get in on it stop me from enjoying my side. Does that make sense? … I’ll go out of my way to do things as privately as possible because I just think that that’s the healthier way of dealing with relationships anyway.”\n\nBad Bunny echoes the model’s sentiment in an interview with Rolling Stone. “I know something is going to come out. I know [people are] going to say something. People know everything about me, so what’s left for me to protect? My private life, my personal life,” he tells the outlet. “That’s the only answer. In the end, the only thing I have is my privacy.”\n\nHe adds, “We’re in the worst time, the worst moment for the privacy of other humans; not just artists, but human beings. Today, no one respects the privacy or life of anyone. … I keep living. Fans are always going to want to know more, but I don’t focus on that. I’m always going to keep living my way.”\n\nJune 20, 2023: They coordinate outfits during a night out with friends.\n\nWhile getting sushi with a group of friends, Jenner and Bad Bunny both wear white T-shirts. Jenner pairs her shirt with black-and-white snakeskin pants, a black bag, and square-toe boots. Bad Bunny coordinates his tee with off-white trousers with a light gray print and a camouflage trucker hat.\n\nGetty Images\n\nThe model and rapper embark on a dinner date in Santa Monica, where the two coordinate in black leather ensembles. The model pairs a black leather trench coat with pointed-toe kitten-heel mules, and accessorizes with a black-and-yellow croc-embossed Fendi purse. The rapper, meanwhile, wears a black leather collared jacket with leather trousers and chunky square-toe boots, topping off the look with a backward baseball cap and red-tinted shades.\n\nBACKGRID\n\nBACKGRID\n\nMay 12, 2023: They have their first public outing at a Lakers playoff game.\n\nJenner and Bad Bunny make a buzzy appearance at Crypto.com Arena, where they sit courtside for the Lakers-Warriors playoff game while wearing coordinating snakeskin-print boots. They are seen smiling and chatting closely together throughout the game, with the rapper occasionally resting his arm on the model’s seat.\n\nFor the outing, Jenner wears a casual white tank top and a dyed brown skirt with knee-high tan stiletto boots and gold jewelry. Meanwhile, the rapper pairs his pointed-toe boots with a black leather jacket, a white shirt, black pants, and a bolo tie with a silver bull pendant. He adds sunglasses and a baseball cap worn backward.\n\nKevork Djansezian // Getty Images\n\nJenner and Bad Bunny are among the night’s attendees at the 2023 Met Gala, where Jenner wears a glittering black bodysuit by Marc Jacobs and Bunny wears a white tweed suit with a rosette cape by Jacquemus. Although they don’t make a joint appearance at the event, they are later seen heading into the after-party together.\n\nFor the occasion, Jenner wears a shimmering Nensi Dojaka playsuit—a replication of a 1994 Chanel creation, consisting of pearl-embellished spaghetti straps, plus a black thong and an ultra-cropped black tank layered over the piece.\n\nMeanwhile, the rapper trails after the model in a white T-shirt, brown suede collared jacket, dark brown trousers, and caramel suede boots.\n\nGetty Images\n\nGotham // Getty Images\n\nThe two are spotted during a night out in NYC, where they eat at celeb hotspot Carbone before heading to Pergola.\n\nFor the evening, Jenner wears a sheer brown top with a belted, fur-trimmed micro-miniskirt and boots by Blumarine. Bad Bunny wears a pale-yellow-and-black bomber jacket with a black tee, black trousers, black oval sunglasses, and silver hoop earrings.\n\nApril 26, 2023: They’re spotted leaving a concert together.\n\nThe pair attend Tyler, the Creator’s concert in L.A. for a casual date night. For the evening, the stars coordinate in white T-shirts and black pants. (Jenner adds a hoodie and baseball cap, and Bad Bunny a pair of dark sunglasses.) They are later photographed leaving the venue in the rapper’s car, where Jenner is seen laughing in the passenger seat.\n\nApril 16, 2023: They pack on PDA at Coachella.\n\nThe two make a buzzy joint appearance at this year’s music-and-arts festival in Indio, California.\n\nDuring the artist’s April 14 performance, Jenner supports him from the crowd and is seen dancing to his final song, “Después de la Playa,” alongside a group of friends, per .\n\nOnstage, the rapper directly alludes to recent dating rumors for the first time in an emphatic speech. “People think they know the lives of famous people—but they don’t,” he says in Spanish. “They don’t know what we feel, what we live through. They will never know what a heart can feel. Don’t believe everything you hear. You won’t get to know the real me through a video on Instagram, an interview, or a TikTok. If you really want to get to know me, I invite you to my home.”\n\nJenner and Bad Bunny were seen at the festival again on April 15, as they watched Rosalía’s performance with a group of friends. They ended the weekend on April 16, getting cozy in the crowd during one of the Sunday performances.\n\nLater in the evening, Bad Bunny nearly goes Instagram official with the model when he shares a video of himself to his Instagram Story singing along to a song on the radio from a golf cart. Jenner’s voice is heard in the background, and her hair is seen blowing in the wind beside him.\n\nThe model takes things to the next level with Bad Bunny with a romantic horseback riding date at the Hidden Hills Equestrian Center in California.\n\n\n\nPhotos published by TMZ show the two riding around the corral on one of Jenner’s horses. The rapper later goes on a solo ride while the model smiles and films him.\n\nMarch 8, 2023: They are captured kissing.\n\nIn an outing that confirms their status as an item, the two are photographed sharing a kiss in a parking lot following a night out with friends at a sushi restaurant in West Hollywood.\n\nFebruary 20, 2023: Romance rumors swirl.\n\nJenner and Bad Bunny first meet through mutual friends when the rapper moves to Los Angeles toward the beginning of February, according to People.\n\nWeeks later, rumors of their fling swirl as the two are captured by TMZ leaving the same restaurant in Beverly Hills, allegedly following a double date with Justin and Hailey Bieber. (The outlet notes that the Biebers headed out of the restaurant almost an hour earlier than Jenner and Bad Bunny, suggesting that the supermodel and rapper spent some alone time.)\n\nPer an anonymous submission to celebrity gossip account DeuxMoi, the two were seen locking lips at a private club earlier in the month, on February 15. “I have witnesses on the scene who saw her in the club,” the source reportedly tells the account. “Word is [Bad Bunny] is in an open relationship.”\n\nOn the Monday following the pair’s double date, People reports Jenner and Bad Bunny have indeed been “hanging out.” According to one insider, Jenner “likes” Bad Bunny “and is having fun.” The source adds, “He is different from guys that she dated in the past. He is very charming.”", "images": ["https://hips.hearstapps.com/hmg-prod/images/gettyimages-1486982715-64511908bdf40.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1910714113-65d75b965864a.jpg?crop=1.00xw:0.670xh;0,0.101xh&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/x-regular.e414d97.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523000000&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/bgus-2957603-001-667984ce6581a.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/caret-left-regular.5546078.svg", "https://www.harpersbazaar.com/_assets/design-tokens/harpersbazaar/static/images/logos/logo.823d7af.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2151316862-663b7a3a60e97.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523ffffff&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1695691125-6669b0bee6969.jpg?crop=1xw:0.375xh;0.0625xw,0.0876xh", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1775781039-68d4422ae0941.jpg?crop=0.700xw:1.00xh;0.157xw,0&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/harpersbazaar/static/images/logos/network-logo.6416a85.svg?primary=%2523ffffff", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/bgus-2747390-001-65240582b52fb.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/envelope-simple-regular.91a0134.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/bgus-2639871-027-64625ba4684bc.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1258884511-64930741bafc8.jpg?crop=0.614xw:1.00xh;0.196xw,0&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/bgus-2729335-003-6505d8d838c3a.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/bgus-2697536-001-64ca913ac52fd.jpeg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/bgus-2747390-002-6524059ba0e1b.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg?primary=%2523ffffff", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://hips.hearstapps.com/hmg-prod/images/megan-fox-and-machine-gun-kelly-attend-universal-music-news-photo-1684514141.jpg?crop=1.00xw:0.670xh;0,0.129xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/bgus-2639871-031-64625a746edaf.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2188545144-6758a033a4374.jpg?crop=1.00xw:0.791xh;0,0.0456xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1489056535-645d20bc23bd1.jpg?crop=0.723xw:1.00xh;0.143xw,0&resize=360:*", "https://hips.hearstapps.com/rover/profile_photos/21445446-1bde-4290-a24e-2bdd274be027_1521573573.jpg?fill=1:1&resize=160:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1695691125-1-650f1103e3bc9.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1259015499-6632470007f66.jpg?crop=0.720xw:1.00xh;0.147xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1695691125-6669b0bee6969.jpg?crop=0.870xw:0.291xh;0.0625xw,0.0876xh&resize=1200:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/magnifying-glass-regular.94a1e62.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1254371007-645fc1a8b6703.jpg?resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1463278313-64ee2146ab638.jpg?crop=0.679xw:1.00xh;0.188xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1191508186.jpg?crop=0.676xw:0.998xh;0.200xw,0.00240xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/jake-bongiovi-and-millie-bobby-brown-attend-netflixs-news-photo-1763046330.pjpeg?crop=0.793xw:0.529xh;0.0635xw,0.202xh&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/bookmark-simple-regular.9d9d56b.svg", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/david-harbour-and-lily-allen-attend-the-26th-annual-screen-news-photo-1762971918.pjpeg?crop=0.738xw:1.00xh;0.132xw,0&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/globe-simple-regular.e7f303c.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1486983868-64511447d8b1d.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/tiktok.603c377.svg?primary=%2523000000&id=social-button-icon", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/saved.ad81f1a.svg?primary=%2523000000", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/taylor-swit-matt-healy-2-645e910541bf8.jpg?crop=0.503xw:1.00xh;0,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/bgus-2693746-003-64c7be34ac438.jpg?resize=980:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-2151728037-67d33e4679c52.jpg?crop=0.550xw:0.825xh;0.175xw,0&resize=360:*", "https://www.harpersbazaar.com/_assets/design-tokens/fre/static/icons/clock-regular.b2f2888.svg", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2023-08-28-at-9-09-31-am-64ec9fe88b92c.png?resize=640:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1695691125-6669b0bee6969.jpg?crop=0.870xw:0.291xh;0.0625xw,0.0876xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.harpersbazaar.com/celebrity/latest/a43655988/kendall-jenner-bad-bunny-relationship-timeline/", "title": "Kendall Jenner and Bad Bunny’s Full Relationship Timeline", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Kendall Jenner and Bad Bunny's Full Relationship Timeline", "description": "An insider confirmed the supermodel and the musician are back together, saying, \"It's like they needed the break to miss each other enough to figure things out.\"", "theme-color": "#000000", "og": {"site_name": "Harper's BAZAAR", "title": "Kendall Jenner and Bad Bunny Look So in Love During Paris Fashion Week", "description": "The two enjoyed a private dinner date in coordinating looks", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1695691125-6669b0bee6969.jpg?crop=0.870xw:0.291xh;0.0625xw,0.0876xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.harpersbazaar.com/celebrity/latest/a43655988/kendall-jenner-bad-bunny-relationship-timeline/", "type": "article"}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "opinion": "false", "section": "Celebrity News", "modified_time": "2024-06-24T14:38:00Z", "published_time": "2024-06-24T14:38:00Z"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "parsely-metadata": "{\"socialHeadline\":\"Kendall Jenner and Bad Bunny Look So in Love During Paris Fashion Week\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1695691125-6669b0bee6969.jpg?crop=1.00xw:0.668xh;0,0.0844xh&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1695691125-6669b0bee6969.jpg?crop=0.870xw:0.291xh;0.0625xw,0.0876xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1695691125-6669b0bee6969.jpg?crop=1.00xw:0.668xh;0,0.0844xh", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1695691125-6669b0bee6969.jpg?crop=0.870xw:0.291xh;0.0625xw,0.0876xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "timely", "sailthru.excerpt": "Kendall Jenner and Bad Bunny caused a stir in February 2023 with their unexpected romance—but by the end of the year, it was confirmed the It couple had called it quits. Now, they’re back together.The supermodel—who previously dated NBA star Devin Booker—first connected with the Grammy-winning Puerto Rican rapper and", "sailthru.tags": "celebrity,Celebrity,latest,Celebrity News,celebrity-relationships,Celebrity Relationship News,Harper's BAZAAR-US", "sailthru.date": "2024-06-24 14:38:00", "sailthru.socialtitle": "Kendall Jenner and Bad Bunny Look So in Love During Paris Fashion Week", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1719239880.0, "source": "https://www.harpersbazaar.com", "summary": ""}