{"url": "www.inquisitr.com/4240560/did-ariana-grande-fly-back-to-the-u-s-on-taylor-swifts-plane-after-manchester-bombing-rumors/", "text": "Ariana Grande is safely back in the U.S. after the suicide bombing at her concert in Manchester. But there are some rumors swirling around about the way she got back home.\n\nThe Daily Mail reported that Taylor Swift loaned Grande her plane so that the former Disney star could get back to the States.\n\n“She then made her way back home with a little help from Taylor Swift, who lent Ariana a private plane so that she could make a quick return to the U.S.,” The Daily Mail article said.\n\nHowever, although it’s nice to think that Taylor Swift was kind enough to lend her fellow pop star a plane so that she could get home safely, Gossip Cop is crying foul over that story.\n\nThe site, well known for debunking celebrity rumors, says that that part of the story is completely made up.\n\nAccording to Gossip Cop , Grande came home on a private flight which was arrange by her manager Scooter Braun and Live Nation. Rapper Mac Miller, Ariana’s boyfriend, was there to greet the pop star and her mother when they landed.\n\nWe’re not sure why The Daily Mail would include a mention of Taylor Swift in the story since it’s not at all relevant to anything else about the bombing at Ariana Grande’s concert.\n\nAccording to The Telegraph , the suicide bombing at the Manchester Arena was carried out by a man named Salman Abedi. The attack killed 22 people, the youngest of whom was an eight-year-old girl. Dozens of concert goers were injured.\n\nThe bomb, which was packed with nuts and bolts, went off just moments after Ariana finished the last song in her set. ISIS has since taken credit for the carnage.\n\nIn the aftermath of the bombing, British Prime Minister, Theresa May, increased the terrorist threat level in the UK from severe to critical. She also said that there will be an increased military presence at public events.\n\nAbedi was 22 years old and of Libya descent. He was born in Manchester and studied business at Salisbury college. However, he did not complete his degree. The Telegraph reports that he was the youngest of four children whose parents fled Libya during Colonel Moammar Gaddafi’s regime. According to a family friend he was in Libya a couple of weeks ago. Another friend said that he was a “friendly” guy.\n\n“He was always friendly, nothing to suggest (he was violent). He was normal, to be honest”\n\nU.S President Donald Trump, who’s currently on his first foreign tour as head of state, called the terrorists responsible for the Manchester bombing “evil losers” and offered America’s “absolute solidarity” with the people of the UK.\n\n“Our hearts go out to those killed and wounded”: Obama and the Clintons shared condolences on the Manchester attack https://t.co/zvtMLvu7ln pic.twitter.com/bH4EkQutQ5 — CNN (@CNN) May 24, 2017\n\nThe Telegraph claims that Abedi was recently radicalized but they are not sure when he joined ISIS. His imam said that he had shown him “the face of hate” during a speech where he had warned his congregation about the danger of ISIS.\n\nAriana Grande has since commented on the devastating attack on Twitter.\n\n“Broken,” she wrote. “From the bottom of my heart, I am so so sorry. I don’t have words.”\n\nRELATED POSTS ON INQUISITR\n\nAriana Grande Lands Safely Back In The U.S., To Go Into Hiding After Terrorist Attack\n\nAriana Grande Calls Concert Bombing A ‘Cowardly Act,’ Suspect Arrested In Connection With Attack On Manchester\n\nAriana Grande Manchester Attack: False Rumors, Personal Accounts, Stars And Politicians React\n\nAriana Grande World Tour Cancelled? Manchester Arena Bombing Causes Singer To Suspend Tour Indefinitely\n\n19 Confirmed Dead, Manchester Police Say Ariana Grande Concert Explosion Likely Suicide Bomber With Nail Bomb\n\n[Featured Images by Frederick M. Brown, Mark Davis/Getty Images]", "images": ["https://www.inquisitr.com/wp-content/uploads/2025/10/2421769f-57a4-4bff-913f-cf316747493e.jpg", "https://secure.gravatar.com/avatar/2a5f24f2859380905161f01354fcd60d?s=120&d=mm&r=g", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20500%20157'%3E%3C/svg%3E", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20492%20142'%3E%3C/svg%3E", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo-white.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/inquisitr-logo.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent-Dark-Mode.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20120%20120'%3E%3C/svg%3E"], "top_img": "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "keywords": [], "authors": ["News Writer"], "canonical_link": "https://www.inquisitr.com/did-ariana-grande-fly-back-to-the-u-s-on-taylor-swifts-plane-after-manchester-bombing-rumors", "title": "Did Ariana Grande Fly Back To The U.S. On Taylor Swift’s Plane After Manchester Bombing?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "https://www.inquisitr.com/wp-content/uploads/2024/12/favicon.png", "description": "Ariana Grande is safely back in the U.S. after the suicide bombing at her concert in Manchester. But there are some rumors swirling around about the way she", "robots": "follow, index, max-snippet:-1, max-video-preview:-1, max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Did Ariana Grande Fly Back To The U.S. On Taylor Swift’s Plane After Manchester Bombing? - Inquisitr News", "description": "Ariana Grande is safely back in the U.S. after the suicide bombing at her concert in Manchester. But there are some rumors swirling around about the way she", "url": "https://www.inquisitr.com/did-ariana-grande-fly-back-to-the-u-s-on-taylor-swifts-plane-after-manchester-bombing-rumors", "site_name": "Inquisitr News"}, "article": {"tag": "ariana grande", "section": "News", "published_time": "2017-05-24T02:38:00-04:00"}, "twitter": {"card": "summary_large_image", "title": "Did Ariana Grande Fly Back To The U.S. On Taylor Swift’s Plane After Manchester Bombing? - Inquisitr News", "description": "Ariana Grande is safely back in the U.S. after the suicide bombing at her concert in Manchester. But there are some rumors swirling around about the way she", "site": "@theinquisitr", "creator": "@theinquisitr"}, "generator": "WP Rocket 3.18.3"}, "movies": [], "publish_date": 1495607880.0, "source": "http://www.inquisitr.com", "summary": ""}