{"url": "https://www.bbc.com/news/entertainment-arts-40519845", "text": "Elle Fanning on her 'scandalous' character in The Beguiled\n\n10 July 2017 Share Save Lauren Turner Entertainment reporter Share Save\n\nGetty Images The 19-year-old previously worked with Sofia Coppola on Somewhere\n\nElle Fanning can't stop smiling as she describes her racy character in gothic thriller The Beguiled, set in a girls' boarding school during the American Civil War.\n\n\"It's funny because my character got to wear her hair down and have a couple of buttons unbuttoned and got to show her ankle - that was scandalous in Civil War times,\" she tells the BBC.\n\nThe film tells the story of what happens when Union soldier Corporal John McBurney (played by Colin Farrell) is taken in when one of the schoolgirls finds him injured - and he becomes an object of fascination for pupils and teachers alike.\n\nThe 19-year-old plays rebellious Alicia in the Sofia Coppola film, which won her the best director accolade at Cannes this year.\n\nFanning, star of last year's Neon Demon, said she'd stayed \"extremely close\" to Coppola since working with her on 2010's Somewhere. She got an email with the script for The Beguiled attached, saying Kirsten Dunst was to play teacher Edwina - and with a specific part in mind for Fanning.\n\n\"She thought that would be fun to make me the naughty one,\" said Fanning, adding that another draw was that it's set in the south, where she's from herself.\n\nFocus Features Her character Alicia gets to \"show her ankle\", said Fanning\n\nThe Beguiled is based on the Clint Eastwood film of the same name - and the Thomas P Cullinan novel The Painted Devil, which inspired that 1971 movie.\n\n\"It's a remake of that and also a different take on that - Sofia Coppola-esque, from a different point of view, from the women's perspective this time,\" explains Fanning.\n\nGetty Images Nicole Kidman (left) and Kirsten Dunst (second right) also star in the film, directed by Sofia Coppola (second left)\n\nSo what was it like being the \"bad one\"?\n\n\"It was really fun,\" she grins. \"Also with Sofia, it feels so safe. She's so tasteful and keeps it classy.\"\n\nShirtless calendar shoot\n\nThe other girls got to have their fun too - in a \"girls gone wild behind-the-scenes\" film that Coppola also directed. \"We're holding these red Solo cups and showing our ankles,\" Fanning says.\n\nShe says that McBurney \"really shakes things up\" and \"also how he becomes the object\", adding: \"Normally women in films are objectified but in our film, we really got to objectify Colin.\n\n\"We had a calendar shoot with him, where all the girls were there and he was shirtless and he was sawing and we were laughing at him. He was a really good sport about it, it was really funny.\"\n\nKirsten Dunst on her new film The Beguiled and why things are harder for women\n\nHer co-star Kirsten Dunst said there were \"a lot of interesting dynamics with the household before McBurney comes in\" - notably between her and headmistress Miss Martha, played by Nicole Kidman.\n\nI don't know if something's gone on with me and Miss Martha or if she's made me do things that aren't kosher, you know what I mean?\" she says, adding that there are a lot of underlying tensions.\n\n'Stir crazy'\n\n\"This whole movie's about what's not being said,\" she adds.\n\n\"I think my character is extremely repressed by her but has to keep a good front for the girls because she's their teacher and being a good Christian woman and so I think my character swallows a lot.\n\n\"But I think it's relatable in any way - it's not because we're women. I think that's just being stuck in that household all together is making us a bit stir crazy.\"\n\nDunst is also directing a film version of Sylvia Plath's The Bell Jar, starring Elle's sister Dakota - explaining the script is currently being rewritten.\n\nShe said she picks up tips from all the directors she works with and adds that Coppola, who directed her in The Virgin Suicides and Marie Antoinette, could have her play \"any role\".\n\n\"I've taken a lot from every director I've worked with,\" says Dunst - who was so overwhelmed at being on the Cannes red carpet with Coppola earlier this year that she burst into tears.\n\n\"Sofia makes a nice community on set which is a really lovely working environment. To be the most vulnerable you have to have a kind and open set and really listen to everyone and work as a team. So that's, I think, very important.\"", "images": ["https://ichef.bbci.co.uk/news/1024/branded_news/C412/production/_96849105_fanning_getty.jpg", "https://static.files.bbci.co.uk/bbcdotcom/web/20251110-152207-94080fba49-web-2.33.2-3/grey-placeholder.png", "https://ichef.bbci.co.uk/news/480/cpsprodpb/13906/production/_96843108_elle_focus.jpg.webp", "https://ichef.bbci.co.uk/news/624/mcs/media/images/91185000/jpg/_91185173_fcb3300a-8a77-48d7-a591-3b01987fc3d1.jpg", "https://ichef.bbci.co.uk/news/480/cpsprodpb/13F14/production/_96848618_beguiled_getty.jpg.webp", "https://ichef.bbci.co.uk/news/480/cpsprodpb/4FB4/production/_96840402_fanning_getty.jpg.webp"], "top_img": "https://ichef.bbci.co.uk/news/1024/branded_news/C412/production/_96849105_fanning_getty.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bbc.com/news/entertainment-arts-40519845", "title": "Elle Fanning on her 'scandalous' character in The Beguiled", "meta_data": {"viewport": "width=device-width", "page.section": "Culture", "page.subsection": "Entertainment_and_arts", "og": {"title": "Elle Fanning on her 'scandalous' character in The Beguiled", "description": "Stars of The Beguiled tell the BBC about the award-winning film - and objectifying Colin Farrell.", "image": {"identifier": "https://ichef.bbci.co.uk/news/1024/branded_news/C412/production/_96849105_fanning_getty.jpg", "alt": "Elle Fanning"}}, "twitter": {"title": "Elle Fanning on her 'scandalous' character in The Beguiled", "description": "Stars of The Beguiled tell the BBC about the award-winning film - and objectifying Colin Farrell.", "image": {"src": "https://ichef.bbci.co.uk/news/1024/branded_news/C412/production/_96849105_fanning_getty.jpg", "alt": "Elle Fanning"}, "card": "summary_large_image"}, "description": "Stars of The Beguiled tell the BBC about the award-winning film - and objectifying Colin Farrell.", "msapplication-TileColor": "#da532c", "theme-color": "#ffffff", "robots": "NOODP, NOYDIR", "apple-itunes-app": "app-id=364147881, app-argument=https://www.bbc.com/news/entertainment-arts-40519845", "version": "web-2.33.2-3", "al": {"ios": {"url": "bbcx://news/entertainment-arts-40519845", "app_store_id": 364147881, "app_name": "BBC: World News & Stories"}, "android": {"url": "bbcx://news/entertainment-arts-40519845", "app_name": "BBC: World News & Stories", "package": "bbc.mobile.news.ww"}, "web": {"url": "https://bbc.com/news/entertainment-arts-40519845"}}, "cXenseParse": {"pageclass": "article", "publishtime": "2017-07-10T23:37:21.000Z", "author": "Lauren Turner"}, "article": {"modified_time": "2017-07-10T23:37:21.000Z"}, "next-head-count": 42}, "movies": [], "publish_date": null, "source": "https://www.bbc.com", "summary": ""}