{"url": "www.thesun.co.uk/news/3856958/next-line-throne-prince-harry-royal-family-charles-king/", "text": "KING CHARLES became King in May 2023 after being first in the line of succession ever since his birth in 1948.\n\nThe Queen‘s eldest son took the crown after Her Majesty’s death in September 2022, meaning one of his own children became the new heir to the throne.\n\nWho is next in line to the throne?\n\nPrince William\n\nOnce Charles became King his eldest child, Prince William became heir to the throne.\n\nWilliam is the eldest son of Charles and the late Princess Diana.\n\nHe is also the the older brother of Prince Harry.\n\nThe Prince of Wales was born on June 21, 1982.\n\nPrince George\n\nNow that William is first in line to the throne, his eldest son Prince George has moved up to second in line.\n\nGeorge is the oldest of William and Kate Middleton‘s three children.\n\nHe was born on July 22, 2013.\n\nPrincess Charlotte\n\nPrincess Charlotte is third in line to the throne, behind her father and older brother George.\n\nCharlotte, William and Kate’s only daughter, was born on May 2, 2015.\n\nPrince Louis\n\nPrince Louis, Kate and William’s youngest child, is fourth in line to the throne.\n\nGeorge and Charlotte’s younger brother was born on April 23, 2018.\n\nPrince Harry\n\nPrince William’s younger brother Harry is fifth in line to the throne.\n\nHe and wife Meghan Markle famously announced in 2020 that they were stepping back from royal duties and leaving the UK.\n\nHarry, born on September 15, 1984, now lives in the US with his wife and children.\n\nArchie Harrison Mountbatten-Windsor\n\nArchie Harrison Mountbatten-Windsor is sixth in line to the throne, after his uncle, cousins and father.\n\nArchie, the first child of Prince Harry and Meghan Markle, was born on May 6, 2019.\n\nLilibet Diana Mountbatten-Windsor\n\nMeghan and Harry’s second baby, daughter Lilibet Diana Mountbatten-Windsor, is seventh in line.\n\nShe was born on June 4, 2021, in California.\n\nLilibet is named after the late Queen Elizabeth, who was given the moniker as a nickname when she was a child.\n\nAndrew, The Duke of York\n\nPrince Andrew, Duke of York is the third child and second son of Queen Elizabeth II and is eighth in line to the throne.\n\nHe is the younger brother of King Charles and Princess Anne and the older brother of Prince Edward.\n\nAndrew was born on February 19, 1960, and was married to Sarah Ferguson from 1986 until their divorce in 1996.\n\nIn 2022 Andrew was stripped of his royal titles after he was accused of sexually assaulting Virginia Roberts Giuffre.\n\nPrincess Beatrice\n\nPrincess Beatrice is the eldest daughter of Prince Andrew and Sarah Ferguson, also known as the Duke and Duchess of York.\n\nShe was born on August 8, 1988 and is the older sister of Princess Eugenie.\n\nNinth in line to the throne Beatrice is married to Edoardo Mapelli Mozzi, who she wed in 2020.\n\nMiss Sienna Mapelli Mozzi\n\nTenth in line to the throne is Sienna Elizabeth Mapelli Mozzi, the daughter of Princess Beatrice and Edoardo Mapelli Mozzi.\n\nShe was born on September 18, 2021.\n\nSienna’s father, Edoardo, also has a son named Christopher Woolf from his past relationship with architect Dara Huang.\n\nPrincess Eugenie\n\nPrincess Eugenie, the second daughter of Prince Andrew and Sarah Ferguson, is eleventh in line to the throne.\n\nPrincess Beatrice’s little sister was born on March 23, 1990.\n\nShe has been married to Jack Brooksbank since 2018.\n\nMaster August Brooksbank\n\nAugust Brooksbank is the eldest on of Princess Eugenie and Jack Brooksbank.\n\nHe was born on February 9, 2021.\n\nAugust, who is twelfth in line to the throne, was then joined by little brother Ernest on May 30, 2023.\n\nA royal rule states that only children of the sovereign, children of the sons of the sovereign, and the oldest living son of the Prince of Wales are eligible to receive the HRH status and prince and princess titles.\n\nThis means Beatrice and Eugenie’s children do not have official titles.\n\nHow does royal succession work?\n\nIn the Royal Family, a new sovereign takes the throne when the previous monarch has died.\n\nA group known as the Accession Council will usually meet within 24 hours of the death of a monarch, before formally proclaiming the death of the sovereign and the successor to the throne.\n\nAccording to the Royal Family’s official website, a regent would be appointed to perform the royal functions if a succeeding monarch was a child.\n\nOnce they had turned 18, the monarch would then take over the duties.\n\nA new sovereign may also take the throne if a monarch abdicates.\n\nEdward VIII famously abdicated in 1936 leaving his younger brother, Queen Elizabeth’s father George VI, to become king.\n\nCan the monarch marry a Catholic?\n\nYes, monarchs can marry a Catholic.\n\nIn 2011, Commonwealth leaders also decided to remove the rule that no heir could assume the throne if he or she married a Roman Catholic.\n\nThen-Prime Minister David Cameron said at the time: “The idea that a younger son should become monarch instead of an elder daughter, simply because he is a man just isn’t acceptable any more.\n\n“Nor does it make any sense that a potential monarch can marry someone of any faith other than Catholic.\n\n“The thinking behind these rules is wrong.”\n\nThe Roman Catholic rule can be traced to the 16th-century reign of Henry VIII.\n\nThe King broke with the Roman Catholic Church so he could divorce his wife, Queen Catherine, and marry Anne Boleyn after the Pope refused his divorce request.\n\nWhy was Prince Philip not a king?\n\nDue to English common laws, the late Prince Philip could not become king despite being married to Queen Elizabeth II.\n\nAs is the case with Queen Camilla, the wife of a king is known as a Queen Consort and takes the title of Queen – though she doesn’t rule as the monarch.\n\nIf a female royal, however, marries a man with a title below her own – as was the case with Queen Elizabeth and Prince Philip – she will retain the title while her husband will not be entitled to it.\n\nPhilip, therefore, became known as Prince Consort after changing his title in 1957 when his wife took to the throne.\n\nWhen was the British line of succession changed?\n\nThe rules of royal succession have changed over the years.\n\nIn 2011, leaders of 16 British Commonwealth countries (including Australia, Canada, New Zealand and Jamaica) voted to alter the centuries-old tradition that stated daughters could only inherit the throne if there were no living sons.\n\nThis system dated back 300 years and was based on the rules of primogeniture, which gives preference to the firstborn male heirs of a king or queen.\n\nThis change in royal succession means Princess Charlotte, William and Kate Middleton‘s daughter, is ahead of her younger brother Louis in the line of succession.\n\nPreviously, if the third child was male he would leap the princess in the line of succession.\n\nThe rule, which became law in 2013, only takes into account children born after 2011, meaning Prince Edward‘s youngest child, James, born in 2007, is ahead of his older sister, Louise, born in 2003.\n\nHow did the British royal family start?\n\nThe origins of the British royal family can be traced back to the early medieval period but the family didn’t become known as the House of Windsor until 1917.\n\nThe official title replaced the historic name of Saxe-Coburg-Gotha and was changed in a bid to avoid anti-German sentiment during the First World War.\n\nThere is disagreement amongst historians about exactly how and when the monarchy began but the first King of England is thought to have been Alfred the Great’s grandson Athelstan.\n\nWilliam The Conqueror is known as the first Norman King of England and took the throne in 1066 after the Battle of Hastings.", "images": ["https://www.thesun.co.uk/wp-content/uploads/2024/02/l-r-queen-camilla-king-877155466.jpg?quality=90&strip=all&w=1920&h=1080&crop=1", "https://www.thesun.co.uk/wp-content/uploads/2023/03/062a4308_x9uos1i0-JS877198041.jpg?strip=all&w=300", "https://www.thesun.co.uk/wp-content/uploads/2024/02/image-773ccf931b.jpg?quality=90&strip=all", "https://www.thesun.co.uk/wp-content/uploads/2024/02/VP-ROYAL-LINE-OF-SUCCESSION-2024-v2.jpg?strip=all&w=300"], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2024/02/l-r-queen-camilla-king-877155466.jpg?quality=90&strip=all&w=1920&h=1080&crop=1", "keywords": [], "authors": [], "canonical_link": "https://www.thesun.co.uk/royals/3856958/next-line-throne-royal-succession-explained/", "title": "Who is next in line to the throne after King Charles?", "meta_data": {"copyright": "Copyright 2025 NYP Holdings. All rights reserved.", "viewport": "width=device-width, initial-scale=1", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "robots": "noarchive,noodp,max-image-preview:large", "google-site-verification": "eixRLq6ZFPfabL_W12if1QGJxwbBXFQhFO5J0Vc27EE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "description": "KING CHARLES became King in May 2023 after being first in the line of succession ever since his birth in 1948.The Queen's eldest son took the crown af", "generator": "WordPress 6.5.7", "sailthru.tags": "EVG,Explainers,King Charles,The Queen,Royals", "sailthru.date": "2023-02-06 06:00:09", "sailthru.title": "Who is next in line to the throne after King Charles?", "sailthru.description": "KING CHARLES became King in May 2023 after being first in the line of succession ever since his birth in 1948. The Queen‘s eldest son took the crown after Her...", "sailthru.image.full": "https://www.thesun.co.uk/wp-content/uploads/2024/02/l-r-queen-camilla-king-877155466.jpg?quality=90&strip=all", "sailthru.image.thumb": "https://www.thesun.co.uk/wp-content/uploads/2024/02/l-r-queen-camilla-king-877155466.jpg?quality=90&strip=all&w=50", "bingbot": "noarchive", "keywords": "EVG,Explainers", "article": {"opinion": "false", "content_tier": "free", "published_time": "2023-02-06T06:00:09+00:00", "modified_time": "2024-02-06T10:44:10+00:00", "publisher": 161385360554578, "tag": "EVG, Explainers, King Charles, The Queen", "author": 161385360554578}, "og": {"type": "article", "title": "The royal order of succession explained", "url": "https://www.thesun.co.uk/royals/3856958/next-line-throne-royal-succession-explained/", "description": "KING CHARLES became King in May 2023 after being first in the line of succession ever since his birth in 1948. The Queen’s eldest son took the crown after Her Majesty’s death in Septemb…", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2024/02/l-r-queen-camilla-king-877155466.jpg?quality=90&strip=all&w=1920&h=1080&crop=1", "secure_url": "https://www.thesun.co.uk/wp-content/uploads/2024/02/l-r-queen-camilla-king-877155466.jpg?quality=90&strip=all&w=1024"}, "locale": "en_GB"}, "twitter": {"text": {"title": "Who is next in line to the throne after King Charles?"}, "card": "summary_large_image", "site": "@thesun"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?w=270"}, "movies": [], "publish_date": 1675663209.0, "source": "http://www.thesun.co.uk", "summary": ""}