{"url": "https://web.archive.org/web/20220829041603/http://www.newslocker.com/en-us/news/celebrity/nikki-bella-is-really-disappointed-in-brie-for-asking-daniel-bryan-to-put-in-a-good-word-for-her-at-wwe-watch/", "text": "Kendall Jenner & Boyfriend Devin Booker Keep Close on Date Night in West Hollywood Kendall Jenner and Devin Booker are enjoying a night out!\n\nThe 26-year-old model kept close to the 25-year-old pro basketball player as they left the Catch LA restaurant after a dinner date on Saturday night (August 27) in West Hollywood, Calif.\n\nPHOTOS: Check out the latest pics of Kendall Jenner\n\nFor their night out, Kendall paired a black sports-bra with black leather pants while Devin wore a Method Man T-shirt over a long-sleeved shirt paired with baggy denim pants.\n\nA few nights before, Kendal Read more\n\nJared Leto Sports Fun Floral-Print Shirt While Arriving at Club 55 in St. Tropez Jared Leto is enjoying another day out on vacation!\n\nThe 50-year-old musician and Oscar-winning actor along with a group of friends took a small boat as they arrived at Club 55 for lunch on Wednesday afternoon (August 24) in St. Tropez, France.\n\nPHOTOS: Check out the latest pics of Jared Leto\n\nFor his lunch outing, Jared looked cool in a floral-print shirt paired with gold shorts, a straw hat, and rainbow-colored Gucci slides.\n\nJared has been vacationing around Europe all summer. Last weekend, he w Read more\n\nRebel Wilson & Girlfriend Ramona Agruma Wear Colorful Outfits on Early Dinner Date Rebel Wilson is stepping out on an early dinner date with girlfriend Ramona Agruma.\n\nThe 42-year-old Pitch Perfect actress and her girlfriend arrived at San Vincente Bungalows for an early bite to eat on Saturday (August 27) in West Hollywood, Calif.\n\nPHOTOS: Check out the latest pics of Rebel Wilson\n\nFor their dinner date, Rebel wore a pink dress and gold sunglasses while Ramona wore a blue and cream-colored dress paired with the same sunglasses Rebel was wearing.\n\nA few nights earlier, Rebel and Read more\n\nMaye Musk Explains Why She Sleeps in 'Garage' When Visiting Son Elon in Texas Maye Musk is opening up about spending time with son Elon Musk.\n\nIn a new profile, the 74-year-old model discussed her close bond with the 51-year-old SpaceX and Tesla CEO.\n\nWhile Elon might be the richest man in the world, Maye said that her son isn’t interested in possessions “at all.”\n\nBack in April, Elon said that he doesn’t own a home, and that he has to stay at “friends’ places.”\n\nMaye also revealed that when she goes to visit Elon in Texas – wh Read more\n\nHere's Everything Coming to Hulu in September Hulu has announced all of the new shows and movies coming in September – Just Jared Jr\n\nThe White House is trolling Republicans on Twitter – Celebitchy\n\nTommy Lee is addressing THAT photo he posted on Instagram – DListed\n\nSelena Gomez has a new song out – Just Jared Jr Read more\n\nAdam Levine Shows Off Bleached Blonde Hair & Tattoos During Walk Around Miami Beach Adam Levine is kicking off his day with a few friends.\n\nThe 43-year-old Maroon 5 singer went for a morning walk with two of his friends on Saturday (August 27) in Miami Beach, Florida.\n\nPHOTOS: Check out the latest pics of Adam Levine\n\nFor his outing, a bleached-blonde Adam showed off his tattoos wearing a black tank shirt and matching shorts paired with dark sunglasses and white sneakers.\n\nAdam has been laying low these past few months while enjoying the summer with wife Behati Prinsloo, their kid Read more\n\nSydney Sweeney Denies Mom's 'Hoedown' 60th Birthday Party Was a Political Statement Sydney Sweeney is addressing the backlash surrounding her mom’s birthday party.\n\nOn Saturday (August 27), the 24-year-old Euphoria actress took to Instagram to share a ton of photos from her mom Lisa‘s surprise 60th birthday party.\n\n“No better way to celebrate my momma than a surprise hoedown🤠” Sydney wrote along with the photos from the Western-themed party.\n\nAfter sharing the photos, many fans were quick to point out that one of the party guests is wearing a Blue Read more\n\nJ.K. Rowling Explains Why She Wasn't in HBO Max's 'Harry Potter' Reunion Special J.K. Rowling is addressing her absence from the Harry Potter reunion special.\n\nEarlier this year, stars including Daniel Radcliffe, Emma Watson, Rupert Grint, and many more reunited for the Harry Potter 20th Anniversary: Return to Hogwarts, which debuted on HBO Max.\n\nWhile tons of the cast members participated in the reunion special, the 57-year-old author did not partake in the reunion, with many people assuming she didn’t participate because of her controversial commentary on gender and t Read more\n\nLindsey Vonn Mourns Death of Mom Lindy After Battle with ALS Lindsey Vonn has sadly revealed that that her mom Linda “Lindy” Krohn has died.\n\nOn Saturday (August 27), the 37-year-old Olympic skier took to social media to share a touching tribute to her mom after she lost her battle with ALS, one year after she was diagnosed with the nervous system disease.\n\nClick inside to read more…\n\n“My sweet mother Lindy has lost her battle with ALS. She passed away peacefully as I held her hand, exactly one year after her diagnosis. I am so grat Read more\n\nRobin Thicke's Fiancee April Love Geary Wears Sheer Dress on Date Night Robin Thicke and April Love Geary are stepping out for the night!\n\nThe 45-year-old The Masked Singer judge and the 27-year-old model posed for photos as they arrived at the Catch LA restaurant for a dinner date on Friday night (August 26) in West Hollywood, Calif.\n\nPHOTOS: Check out the latest pics of Robin Thicke\n\nFor their night out, Robin looked sharp in a black suit paired with white sneakers while April wowed in a sheer, flesh-toned outfit.\n\nEarlier this week, Robin was spotted going shirtless Read more\n\nCrystal Renay Says 'There Are No Chances' of Reconciling with Ex Ne-Yo Following Cheating Allegations Crystal Renay is speaking out after filing for divorce from Ne-Yo.\n\nLate last month, Crystal, 36, took to social media where she very publicly slammed the 42-year-old singer, accusing him of cheating on her for the past eight years.\n\nShe then filed for divorce, claiming Ne-Yo fathered a child with another woman.\n\nDuring a recent outing, Crystal was asked if she would consider trying to work things out with Ne-Yo.\n\nClick inside to read more…\n\n“There are no chances, God is good. We are mo Read more\n\nJennifer Lawrence All Smiles on Morning Coffee Run with Friends Jennifer Lawrence is spending her morning with a few friends.\n\nThe 32-year-old Hunger Games actress had a big smile on her face as she and her friends went for a walk after grabbing some iced coffees on Saturday morning (August 27) in New York City.\n\nPHOTOS: Check out the latest pics of Jennifer Lawrence\n\nFor her outing, Jennifer kept things cool and casual in a white T-shirt, jeans, pink jelly sandals, and sunglasses.\n\nEarlier this month, Jennifer was seen meeting up with one of her longtime frien Read more\n\nChris Pratt & Wife Katherine Kick Off Their Weekend with Her Mom Maria Shriver (Photos) Chris Pratt and his wife Katherine Schwarzenegger kicked off their weekend by having lunch with her mom Maria Shriver!\n\nThe married couple went out for lunch with Maria on Friday afternoon (August 26) in Santa Barbara, Calif.\n\nChris was seen taking some pizza to-go before going grocery shopping at a local Vons store while Katherine and Maria went clothes shopping at Poppy.\n\nIt was a patriotic afternoon for Chris, who wore an American flag on his sweater.The day before, Chris went on Instagram and Read more\n\nPrincess Diana's custom Ford Escort sells at auction for more than $850,000 Princess Diana's custom 1985 Ford Escort RS Turbo Series 1 car sold at auction Saturday for more than $850,000. Ordered and specifically made for the late Princess of Wales, the black hatchback vehicle was only used for a few years until it was returned to the manufacturer with fewer than 6,800 miles on it. \"The car is believed to be unique as the first and only black RS Turbo Series 1,\" according to the Silverstone Auction house. PRINCESS DIANA'S CUSTOM FORD ESCORT RS HOT HATCHBACK IS BEING AUC Read more\n\nHallmark Channel's 'Game Set Love' Was Produced By Venus Williams - Watch a Sneak Peek! Davida Williams and Richard Harmon give each other a high five on the court in this still from their new Hallmark Channel movie, Game, Set, Love.\n\nThe flick, which was executive produced by Venus Williams, also features tennis fashions from her clothing line, EleVen.\n\nHere’s a summary of the movie: Taylor (Williams) is a former professional tennis player who retired from the sport following the passing of her mother so she could be there for her father, David and has been enjoying teaching Read more\n\nArcade Fire's Win Butler Accused of Sexual Misconduct - Read His Lengthy Response Win Butler, the frontman of the band Arcade Fire, has been accused of sexual misconduct by four people.The incidents all happened between 2015 to 2020 when the alleged victims were between the ages of 18 and 23 and he was between the ages of 34 and 39.Three of the women told Pitchfork that the encounters with Win were “inappropriate given the gaps in age, power dynamics, and context in which they occurred.” The fourth person, who is gender-fluid, said that they were sexually assault Read more\n\nChris Pine Looks Dapper at Dinner Ahead of His 42nd Birthday Chris Pine looks so suave in his suit!\n\nThe 42-year-old actor was spotted going out for dinner ahead of his birthday on Thursday (August 25) in the Silver Lake neighborhood of Los Angeles.\n\nChris turned 42 the next day and it appears he went out for a pre-birthday dinner!\n\nIt was announced this past week that Chris and his father Robert Pine will be co-hosting the Children’s Hospital Los Angeles Gala in October. The event will take place in Santa Monica and Justin Timberlake is set to perfor Read more\n\nDua Lipa Stuns in Sheer Dress at Friend Simon Porte Jacquemus' Wedding in France Dua Lipa looked so chic while stepping out for a friend’s wedding this weekend!\n\nThe 27-year-old singer wore a white sheer dress while attending the wedding of fashion designer Simon Porte Jacquemus and his new husband Marco Maestri on Saturday (August 27) in Charleval, France.\n\nFor those who don’t know, Simon is the founder of the Jacquemus fashion label.Dua is currently enjoying her summer break after wrapping the North American and European legs of her Future Nostalgia Tour. She&rs; Read more\n\nLizzo Gets Love from Fans After Aries Spears Mocked Her Weight Lizzo is receiving so much support on social media right now after shocking comments from comedian Aries Spears.\n\nThe comments were made on the podcast The Art of Dialogue.\n\nAries made distasteful comments about Lizzo‘s weight and looks and people on social media are pointing out that he should look at himself first.\n\nClick inside to find out what he said…“I can’t get over the fact she looks like the sh-t emoji. She’s a very beautiful girl. She’s got a very pre Read more\n\nTom Holland Is Spending Time with Zendaya in Budapest While She Films 'Dune 2' Zendaya has been filming Dune 2 in Budapest and her boyfriend Tom Holland is in town visiting her right now!\n\nThe cute couple and Spider-Man co-stars were spotted riding scooters around the city together on Saturday (August 27).Click inside to learn more…You can check out the photos on DailyMail.com.\n\nLast week, Tom was spotted in New York City on a solo outing.Tom recently announced that he is taking a break from social media and he is stressing the importance of taking care of your menta Read more", "images": ["https://web.archive.org/web/20220829041604im_/https://www.newslocker.com/images/share-linkedin.png", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271733720_350.jpg", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271770871_725.jpg", "https://web.archive.org/web/20220829041604im_/http://akns-images.eonline.com/eol_images/Entire_Site/201748/rs_600x600-170508122332-600.Total-Divas.ms.0050817psd.jpg?downsize=450:*&crop=450:350;left,top", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271770858_725.jpg", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271733719_350.jpg", "https://web.archive.org/web/20220829041604im_/https://www.newslocker.com/images/newslocker-logo.png", "https://web.archive.org/web/20220829041604im_/https://www.newslocker.com/images/newslocker-cube.png", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271770862_725.jpg", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271733721_350.jpg", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271770851_725.jpg", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271770864_725.jpg", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271770853_725.jpg", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271770854_725.jpg", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271770856_725.jpg", "https://web.archive.org/web/20220829041604im_/https://static.addtoany.com/buttons/share_save_120_16.gif", "https://web.archive.org/web/20220829041604im_/https://www.newslocker.com/images/share-facebook.png", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271762212_725.jpg", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271770872_725.jpg", "https://web.archive.org/web/20220829041604im_/https://www.newslocker.com/images/rss.png", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271770865_725.jpg", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271770849_725.jpg", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271770857_725.jpg", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271770852_725.jpg", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271770850_725.jpg", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271770860_725.jpg", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271770867_725.jpg", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271770861_725.jpg", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271770870_725.jpg", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271770866_725.jpg", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271762213_725.jpg", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271770869_725.jpg", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271770855_350.jpg", "https://web.archive.org/web/20220829041604im_/https://www.newslocker.com/images/share-twitter.png", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271770859_725.jpg", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271770868_725.jpg", "https://web.archive.org/web/20220829041604im_/https://img.newslocker.com/2022/08/28/271770863_725.jpg"], "top_img": "https://web.archive.org/web/20220829041604im_/http://akns-images.eonline.com/eol_images/Entire_Site/201748/rs_600x600-170508122332-600.Total-Divas.ms.0050817psd.jpg?downsize=450:*&crop=450:350;left,top", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20220829041604/https://www.newslocker.com/en-us/news/celebrity/nikki-bella-is-really-disappointed-in-brie-for-asking-daniel-bryan-to-put-in-a-good-word-for-her-at-wwe-watch/", "title": "Nikki Bella Is \"Really Disappointed\" in Brie for Asking Daniel Bryan to Put in a Good Word for Her at WWE: Watch!", "meta_data": {"description": "Are you joking right now?Nikki Bella is furious with Brie Bella on Wednesday's Total Divas season six finale. On the episode, Brie asks Daniel Bryan to put in a good word...", "og": {"title": "Nikki Bella Is Really Disappointed in Brie for Asking Daniel Bryan to Put in a Good Word for Her at WWE: Watch! - Celebrity news - NewsLocker", "description": "Are you joking right now?Nikki Bella is furious with Brie Bella on Wednesday's Total Divas season six finale. On the episode, Brie asks Daniel Bryan to put in a good word...", "type": "website", "url": "https://web.archive.org/web/20220829041604/https://www.newslocker.com/en-us/news/celebrity/nikki-bella-is-really-disappointed-in-brie-for-asking-daniel-bryan-to-put-in-a-good-word-for-her-at-wwe-watch/", "image": "https://web.archive.org/web/20220829041604im_/http://akns-images.eonline.com/eol_images/Entire_Site/201748/rs_600x600-170508122332-600.Total-Divas.ms.0050817psd.jpg?downsize=450:*&crop=450:350;left,top", "site_name": "Newslocker"}, "fb": {"admins": 1335791813}, "robots": "index", "google-site-verification": "wAInSoPxz3OEgOXCHtETx-x7ukmlX40FRoiPZpO7ww4", "msvalidate.01": "2F0DB39856FAA0E47C70E9E1FF8653AA"}, "movies": [], "publish_date": 1494352800.0, "source": "https://web.archive.org", "summary": ""}