{"url": "https://en.wikipedia.org/wiki/Nic_Kerdiles", "text": "American ice hockey player (1994–2023)\n\nIce hockey player\n\nNicolas Kerdiles (January 11, 1994 – September 23, 2023) was an American professional ice hockey forward. He played briefly in the National Hockey League (NHL) with the Anaheim Ducks. Kerdiles was selected by the Ducks in the second round (36th overall) of the 2012 NHL Entry Draft.\n\nEarly life [ edit ]\n\nNicolas Kerdiles was born January 11, 1994, in Lewisville, Texas.[1] The Kerdiles family moved frequently due to his father's job in medical equipment sales before settling in Irvine, California, where Nicolas began playing roller hockey.[2] He transitioned to ice hockey at the age of eight, playing with the Los Angeles Kings youth affiliate.[3] In 2007, Kerdiles participated in the Quebec International Pee-Wee Hockey Tournament with the Los Angeles Hockey Club.[4]\n\nCareer in ice hockey [ edit ]\n\nU.S. National Team Development Program [ edit ]\n\nKerdiles moved to Michigan and joined the USA Hockey National Team Development Program for the 2010–11 season. At the 2011 World U-17 Hockey Challenge, he was named as a forward on the tournament's All-Star team as Team USA claimed a silver medal.[5][6] Later that year, he moved up to the under-18 age-group and helped Team USA win gold in the 2011 IIHF World U18 Championships.[7] The following year, he led Team USA with 4 goals and 9 points in 6 games and captured another gold medal in the 2012 IIHF World U18 Championships.[8][9]\n\nA few months afterwards, the Anaheim Ducks of the National Hockey League selected him 36th overall in the 2012 entry draft.[10][11]\n\nCollege [ edit ]\n\nKerdiles attended the University of Wisconsin–Madison, where he played two seasons of NCAA Division I hockey with the Wisconsin Badgers. During his freshman season, his 11 goals and 22 assists[12] helped the Badgers capture the Broadmoor Trophy as the WCHA playoff champion, and he was recognized for his outstanding performance by being voted the most valuable player of the 2013 WCHA Men's Ice Hockey Tournament.[13]\n\nWhile at university, Kerdiles represented his country in the world stage again, and was the leading scorer (7 points in 5 games) for Team USA in the 2014 World Junior Ice Hockey Championships in Sweden. Despite his goal against Andrei Vasilevskiy giving his team a lead, they were eliminated by Team Russia in the quarter-finals.[14][15]\n\nProfessional [ edit ]\n\nAnaheim Ducks (2014–2018) [ edit ]\n\nKerdiles with the Norfolk Admirals in 2014\n\nOn April 5, 2014, Kerdiles forfeited his final two seasons of college hockey eligibility to sign a three-year entry-level contract with the Anaheim Ducks.[10] He made his professional debut with the Ducks' American Hockey League affiliate, the Norfolk Admirals, during the 2014 Calder Cup playoffs.[16] After the 2014–2015 season, the Admirals moved to the West Coast, bringing Kerdiles along for the San Diego Gulls' first three seasons.[17][18]\n\nIn the 2016–2017 season, Kerdiles suffered a concussion in a game in September, and was unable to play till January 2017; four goals and five assists in 10 games upon his return had him called up by the Ducks from the Gulls.[17] On February 22, 2017, he made his NHL debut in a 5–3 victory against the Boston Bruins, becoming the first player raised in Orange County to play for the Anaheim Ducks.[19] After that season, the club re-signed him to a one-year, two-way extension worth $650,000 on June 17, 2017.[20][21] He then played two more NHL games for the Ducks, but otherwise spent most of the 2017–2018 season with the Gulls.[17]\n\nWinnipeg Jets (2018–2019) [ edit ]\n\nAs an impending restricted free agent, Kerdiles was traded by the Ducks to the Winnipeg Jets in exchange for Chase De Leo on June 30, 2018.[22] He was later signed to a one-year, two-way contract with the Jets on August 21, 2018.[23] Due to injuries, he was only able to suit up for three games for the Jets' farm team, the Manitoba Moose, in the 2018–2019 season.[24]\n\nPost-playing career [ edit ]\n\nAfter his contract with the Jets, Kerdiles started a new career as a real estate broker in the Nashville area.[25]\n\nPersonal life and death [ edit ]\n\nBorn to a French father and a French-Canadian mother, Kerdiles was a native French speaker.[2][3] Kerdiles began dating reality television star Savannah Chrisley in November 2017, and the couple became engaged in 2019.[26] Kerdiles and Chrisley separated in September 2020.[27]\n\nKerdiles died in a motorcycle accident on September 23, 2023, in Nashville, Tennessee, at age 29.[28][29] According to the Metropolitan Nashville Police Department, Kerdiles was driving his Indian Motorcycle when he allegedly drove through a stop sign and hit the driver's side of a BMW SUV at approximately 3:30 a.m. Police confirmed that Kerdiles was transported to Vanderbilt University Medical Center where he later died from his injuries.[30][31][32] A subsequent autoposy report showed Kerdile's blood alcohol concentration was above Tennessee's legal limit of 0.08 at the time of the crash. The cause of death was ruled accidental.[33]\n\nProfessional and amateur career statistics [ edit ]\n\nRegular season and playoffs [ edit ]\n\n[12]\n\nInternational [ edit ]\n\nYear Team Event Result GP G A Pts PIM 2011 United States U17 5 2 2 4 4 2011 United States U18 6 0 2 2 2 2012 United States U18 6 4 5 9 2 2014 United States WJC 5th 5 2 5 7 4 Junior totals 22 8 14 22 12\n\n[12]\n\nAwards and honors [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Nic_Kerdiles_%28cropped%29.jpg/250px-Nic_Kerdiles_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Gold_medal_icon.svg/16px-Gold_medal_icon.svg.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Nic_Kerdiles_2_%28cropped%29.jpg/250px-Nic_Kerdiles_2_%28cropped%29.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Nic_Kerdiles_2_%28cropped%29.jpg/1186px-Nic_Kerdiles_2_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Silver_medal_icon.svg/16px-Silver_medal_icon.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Nic_Kerdiles_2_%28cropped%29.jpg/1186px-Nic_Kerdiles_2_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Nic_Kerdiles", "title": "Nic Kerdiles", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Nic_Kerdiles_2_%28cropped%29.jpg/1186px-Nic_Kerdiles_2_%28cropped%29.jpg", "width": 1186, "height": 1200}, "title": "Nic Kerdiles - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}