{"url": "https://web.archive.org/web/20180309172230/http://time.com/money/5159858/prince-harry-meghan-markle-net-worth/", "text": "Prince Harry and Meghan Markle make international headlines every week as details emerge about their fairytale engagement and upcoming royal wedding. But one thing no one knows for certain is what the royal couple’s combined net worth will be once they tie the knot at Windsor Castle on May 19.\n\nThe 36-year-old former Suits actress met Prince Harry back in 2016 after being set up on a blind date by a mutual friend. After dating for 15 months, Harry, who is fifth in line for the throne, popped the question during a quiet night in at Nottingham Cottage, the royal residence he calls home on the grounds of Kensington Palace. Markle and Harry are already living together at Nottingham Cottage, though according to Architectural Digest, “Nott Cott” will only be their temporary digs. And while the newest royal couple will be living at the cottage rent-free, being a philanthropic, jet-setting couple doesn’t come cheap.\n\nHere’s everything we know Prince Harry and Meghan Markle’s net worth, and how much money they will have as a married couple:\n\nWhat is Meghan Markle’s net worth?\n\nPrince Harry’s net worth far exceeds his fiancée’s, but Markle made a good living as an actress.\n\nMarkle was reportedly paid $50,000 per episode on the USA Network legal drama Suits, raking in a salary of about $450,000 per year, according to Fortune, with some additional income from film roles.\n\nWhile’s Markle’s net worth has been relatively easy to estimate so far, her finances will become more complicated once she moves in to live with her prince.\n\n“She will continue to pay U.S. income tax on her income even after marrying Prince Harry, as the U.S. is one of two countries that taxes expats,” said Marlene Koenig, a royal expert. “She cannot start the process of becoming a U.K. citizen until she is married three years, and when she has acquired British citizenship, she will need to make a decision on whether or not she renounces her U.S. citizenship.”\n\nRoyal spouses are often encouraged to pursue philanthropy full-time, meaning Markle will most likely not have any personal income to report in the future, especially since she has already given up her acting career to relocate for Harry.\n\nBritain's Prince Harry and his fiancée US actress Meghan Markle pose for a photograph in the Sunken Garden at Kensington Palace on November 27, 2017. DANIEL LEAL-OLIVAS—AFP/Getty Images DANIEL LEAL-OLIVAS—AFP/Getty Images\n\nWhat is Prince Harry’s net worth?\n\nPrince Harry — whose official title is currently His Royal Highness Prince Henry of Wales — is royally rich, though his net worth is hard to nail down because some of his family’s fortune is kept private from the public.\n\nWhile there are a lot of guesses out there about the 33-year-old prince’s wealth, global wealth insights firm Wealth-X estimates Prince Harry’s 2018 net worth is about $25 million — at the very least. Other reports speculate his net worth is as high as $40 million, but $25 million is the conservative estimate, Wealth-X told MONEY.\n\nBoth Prince Harry’s private income and the money he receives to take care of official royal obligations come from the same place — The Duchy of Cornwall, a private estate that funds the public, private and charitable activities of the Prince of Wales — Prince Charles, Prince Harry’s father — and his family. The estate has served the financial needs of the royal family since 1337, according to the estate’s website.\n\nIn 2017, all official expenses incurred by Prince Harry, his brother Prince William and his sister-in-law Kate Middleton — including official state visits, royal staffing and wardrobe costs — cost around $4.9 million, and were paid for by The Duchy of Cornwall, according to official documents.\n\nHarry has even more in the bank when you look at his inheritance. Both William and Harry inherited half of their late mother Princess Diana’s estate — which is estimated to be worth about £20 million, or about $28 million — and the money was given to them when they each turned 30. “It has been suggested that William and Harry each received about £10 million ($14 million) from their mother’s estate, with Harry getting more because the money was invested longer for him,” Koenig said.\n\nThe inheritance also included Princess Diana’s personal jewelry collection, though it is unclear how much the jewels are worth.\n\nIn addition to Prince Harry’s wealth from his inheritance from his mother’s estate and his pay for royal obligations, he also earned a steady paycheck while serving 10 years in the British Royal Air Force — where he rose to the rank of captain before retiring. While he was working for the military, he made about $50,000, according to Forbes.\n\nPrince Harry and Meghan Markle watch a performance by a Welsh choir in the banqueting hall during a visit to Cardiff Castle on January 18, 2018 in Cardiff, Wales. WPA Pool—Getty Images WPA Pool—Getty Images\n\nWill Meghan Markle inherit Prince Harry’s fortune when they get married?\n\nWhile Markle and Prince Harry will be legally married in May, the royal pair will likely wait to combine their finances, Koenig said.\n\nIf Markle and Harry open a joint bank account, their financial information could be open to scrutiny by U.S. regulatory bodies because Markle is a U.S. citizen, according to Ryan Ellis, former tax policy director at Americans for Tax Reform. For that reason, the couple will probably keep their finances separate unless Markle decides to gives up her U.S. citizenship.\n\nOnce they tie the knot, Queen Elizabeth — whose net worth is estimated to be around $490 million — will likely anoint Markle and Prince Harry as a Duke and Duchess (some insiders speculate they will be named the Duke and Duchess of Sussex) just as Prince William and Kate Middleton became the Duke and Duchess of Cambridge, Koenig said.\n\nMarkle is likely to initially receive the official title of Henry of Wales — it is common to literally take the prince’s name and title. But once Harry is created a duke by the queen, Markle’s title will become Her Royal Highness Duchess of Sussex (or whichever dukedom Harry is given). Markle will also take on any other titles the Queen bestows upon Harry. But because neither Markle nor Kate Middleton come from royal blood, they will never officially be called “princess,” according to CNN.\n\nWhat do we know about Meghan Markle and Prince Harry’s wedding?\n\nThe newest royal romance will become official this spring when Markle and Prince Harry tie the knot at Windsor Castle, just outside of London, on Saturday, May 19.\n\nWhile we don’t know the exact cost of their wedding, it is expected to to be around the same as Prince William and Kate Middleton’s April 2011 nuptials. Luckily for them, the newlyweds will not be footing the bill. Instead, their wedding will be paid for by the royal family. The chapel they are getting married in, St. George’s, is smaller than Westminster Abbey where Will and Kate got hitched, holding only about 800 guests compared to Westminster’s 2,000.\n\nAimee Dunne, a London-based wedding planner, told CNN Money that she expects Markle and Harry’s actual wedding — excluding security costs — will total nearly $1 million. But security is where the real costs add up: Prince William and Kate Middleton’s entire wedding reportedly cost $34 million with security alone totaling $32 million. The security costs for Harry and Markle’s celebration are unclear since it is not an official occasion like the Duke and Duchess of Cambridge’s wedding, though they may face additional risk factors as modern public figures.", "images": ["https://web.archive.org/web/20180309172230im_/http://subscription-assets.timeinc.com/current/1012_top1_205_thumb.jpg", "https://web.archive.org/web/20180309172230im_/http://pixel.watch/13ha", "https://web.archive.org/web/20180309172230im_/https://timedotcom.files.wordpress.com/2018/02/prince-harry-meghan-markle-net-worth.jpg", "https://web.archive.org/web/20180309172230im_/http://assets.time.com/images/dianomi-logo.png", "https://web.archive.org/web/20180309172230im_/https://timedotcom.files.wordpress.com/2018/03/prince-harry-meghan-markle-net-worth-royals.jpg?quality=85", "https://web.archive.org/web/20180309172230im_/https://timedotcom.files.wordpress.com/2017/09/money-newsletter-tout-footer.png", "https://web.archive.org/web/20180309172230im_/https://timedotcom.files.wordpress.com/2018/03/prince-harry-meghan-markle-net-worth-royals.jpg", "https://web.archive.org/web/20180309172230im_/http://subscription-assets.timeinc.com/current/1012_top2_205_thumb.jpg", "https://web.archive.org/web/20180309172230im_/https://timedotcom.files.wordpress.com/2018/02/meghan-markle-prince-harry-net-worth.jpg", "https://web.archive.org/web/20180309172230im_/http://assets.time.com/images/idealmedia.svg", "https://web.archive.org/web/20180309172230im_/http://pixel.carambo.la/Pixel/tmnc11/112752/0/1/0"], "top_img": "https://web.archive.org/web/20180309172230im_/https://timedotcom.files.wordpress.com/2018/03/prince-harry-meghan-markle-net-worth-royals.jpg?quality=85", "keywords": [], "authors": ["Alix Langone"], "canonical_link": "https://web.archive.org/web/20180309172230/http://time.com/money/5159858/prince-harry-meghan-markle-net-worth/", "title": "Prince Harry and Meghan Markle's Net Worth: What We Know", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "meghan markle, prince harry, prince harry meghan markle, meghan markle net worth, prince harry net worth, prince harry net worth 2017, meghan markle net worth 2017, prince harry age, prince harry engaged, british royal family net worth", "news_keywords": "meghan markle, prince harry, prince harry meghan markle, meghan markle net worth, prince harry net worth, prince harry net worth 2017, meghan markle net worth 2017, prince harry age, prince harry engaged, british royal family net worth", "description": "Prince Harry and Meghan Markle are about to be newlyweds. Here's what we know about their net worth and what will change once they marry.", "og": {"title": "Prince Harry and Meghan Markle Are Royally Rich. Here's What We Know About Their Fortune", "type": "article", "site_name": "Money", "url": "https://web.archive.org/web/20180309172230/http://time.com/money/5159858/prince-harry-meghan-markle-net-worth/", "description": "And what will change once they get married", "image": {"identifier": "https://web.archive.org/web/20180309172230im_/https://timedotcom.files.wordpress.com/2018/03/prince-harry-meghan-markle-net-worth-royals.jpg?quality=85", "width": 1024, "height": 683}}, "pinterest": {"url": "http://time.com/money/5159858/prince-harry-meghan-markle-net-worth/", "description": "Prince Harry and Meghan Markle are about to be newlyweds. Here's what we know about their net worth and what will change once they marry.", "media": "https://timedotcom.files.wordpress.com/2018/03/prince-harry-meghan-markle-net-worth-royals.jpg?quality=85"}, "twitter": {"card": "summary_large_image", "url": "https://web.archive.org/web/20180309172230im_/http://time.com/money/5159858/prince-harry-meghan-markle-net-worth/", "title": "Prince Harry and Meghan Markle Are Royally Rich. Here's What We Know About Their Fortune", "description": "And what will change once they get married", "site": "@MONEY", "image": "https://web.archive.org/web/20180309172230im_/https://timedotcom.files.wordpress.com/2018/03/prince-harry-meghan-markle-net-worth-royals.jpg?quality=85"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}