{"url": "https://www.biography.com/people/jennifer-lawrence-20939797", "text": "1990-present\n\nWho Is Jennifer Lawrence?\n\nActor Jennifer Lawrence got her big break at 14 when she was discovered while vacationing in New York City with her family. She quickly landed a part in the TV series The Bill Engvall Show, followed by roles in movies that included The Burning Plain, Winter’s Bone, X-Men: First Class, and The Hunger Games trilogy. Lawrence won an Academy Award for her work in David O. Russell’s Silver Linings Playbook and continued to work with the director on American Hustle and Joy, winning Golden Globes for all three projects as well.\n\nQuick Facts\n\nFULL NAME: Jennifer Shrader Lawrence\n\nBORN: August 15, 1990\n\nBIRTHPLACE: Louisville, Kentucky\n\nSPOUSE: Cooke Maroney (2019-present)\n\nCHILD: Cy\n\nASTROLOGICAL SIGN: Leo\n\nEarly Life\n\nJennifer Shrader Lawrence was born on August 15, 1990, in a suburb of Louisville, Kentucky. She has two older brothers, Blaine and Ben, and her parents, Karen and Gary, owned a farm just outside the city.\n\nLawrence was an athletic child; involved in cheerleading, field hockey, and softball; and thought she might be a doctor when she grew up. She did some modeling and community theater but never dreamed that she’d become an actor.\n\nEarly Acting Career\n\nLawrence’s big break came when she was discovered at 14 while on spring break in New York with her family. A stranger asked to take her picture and took her mother’s phone number, then called the next day to ask her to do a screen test. Things happened quickly after that: Lawrence stayed in New York City for the summer, acting in commercials for MTV and filming the 2007 thriller Devil You Know with Lena Olin. (The film was shelved due to lack of distribution and was eventually released in 2013.)\n\nSoon after, Lawrence and her family moved to Los Angeles, where she had small roles on the series Medium, Monk, and Cold Case, before landing a part on the TV series The Bill Engvall Show. While working on the series, she also appeared in feature films including The Poker House and The Burning Plain alongside Charlize Theron and Kim Basinger.\n\n\n\nMovies\n\nWinter’s Bone\n\nAfter The Bill Engvall Show was canceled, Lawrence went on to appear in the critically acclaimed Winter’s Bone in 2010, which earned her nominations for an Academy Award, a Golden Globe, and a Screen Actors Guild Award. Opportunities continued to pour in, and in 2011 Lawrence appeared in The Beaver with Mel Gibson, Jodie Foster, and Anton Yelchin. She also took on the role of Mystique in X-Men: First Class.\n\nThe Hunger Games\n\nIn 2012, Lawrence became a box-office sensation as Katniss Everdeen, the lead in The Hunger Games, the film adaptation of the bestselling novel by Suzanne Collins. Set in a post-apocalyptic state, Lawrence’s character must participate in an event in which 24 teens fight to the death as televised entertainment. The film broke box-office records on opening weekend, and Lawrence reprised her role in 2013’s The Hunger Games: Catching Fire as well as the two-part Mockingjay (2014 and 2015). As of late 2015, the franchise had earned more than $2.8 billion dollars at the global box office.\n\nSilver Linings Playbook Oscar\n\nOther 2012 releases for Lawrence included the thriller House at the End of the Street, co-starring Elisabeth Shue, and two dramas with Bradley Cooper: The Falling and Silver Linings Playbook, which earned an array of award nominations and a Golden Globe win (Best Actress in a Comedy or Musical) for Lawrence. She took home the Oscar for Best Actress at the Academy Awards in February 2013. Lawrence seemed overcome with emotion as she accepted the honor.\n\nAmerican Hustle\n\nLawrence continued to work with Silver Linings Playbook director David O. Russell on 2013’s American Hustle, playing the emotionally complex wife of a con artist (Christian Bale). The film co-starred Amy Adams and Cooper. Lawrence received her third Oscar nod for the part and won her second Golden Globe.\n\nIn 2014, she co-starred again with Cooper in the little-seen drama Serena before once again captivating moviegoers as the mutant Mystique in X-Men: Days of Future Past.\n\nJoy, Passengers, and Mother\n\nLawrence, Cooper, and Russell later signed on to bring the story of Miracle Mop inventor Joy Mangano to the big screen, with Lawrence taking on the title role. Joy had a Christmas Day 2015 U.S. release, and Lawrence soon won her third Golden Globe for her performance. Days later, she received another Oscar nod. At 25, she became the youngest performer in history to have earned four Academy Award nominations.\n\nContinuing with her high-profile work, in 2016 Lawrence co-starred in X-Men: Apocalypse and the science-fiction film Passengers. She then made an impressive leap into the horror genre with the critically acclaimed Mother (2017), before starring as a Russian intelligence agent in the thriller Red Sparrow (2018).\n\n\n\nThe Wage Gap Essay\n\nIn October 2015, Lawrence wrote an essay, which was featured in Lena Dunham’s feminist newsletter Lenny, entitled “Why Do I Make Less Than My Male Co‑Stars?”\n\nDiscovering she was paid less than her American Hustle male co-stars via the Sony hacking scandal, Lawrence ultimately blamed herself for not negotiating for more pay.\n\n“When the Sony hack happened and I found out how much less I was being paid than the lucky people with dicks, I didn’t get mad at Sony. I got mad at myself. I failed as a negotiator because I gave up early. I didn’t want to keep fighting over millions of dollars that, frankly, due to two franchises, I don’t need,” she explains.\n\nHowever, Lawrence admitted she didn’t fight for a better salary because she was afraid of how she’d be perceived. “I would be lying if I didn’t say there was an element of wanting to be liked that influenced my decision to close the deal without a real fight. I didn’t want to seem ‘difficult’ or ‘spoiled,’” she confessed. “This is an element of my personality that I’ve been working against for years, and based on the statistics, I don’t think I’m the only woman with this issue. Are we socially conditioned to behave this way?... Could there still be a lingering habit of trying to express our opinions in a certain way that doesn’t ‘offend’ or ‘scare’ men?”\n\nIn her own fiery way, Lawrence concluded she would no longer tolerate inequitable pay for fear of being less liked. Her essay caused a great deal of buzz in the media about ongoing gender wage gap issues.\n\nHusband and Child\n\nShe dated her X-Men co-star, Nicholas Hoult, from 2011 to 2013. A year later, she was involved in an on-and-off-again relationship with Coldplay’s Chris Martin, which reportedly ended in the summer of 2015. The actor went on to date Mother director Darren Aronofsky, before admitting in a November 2017 appearance with Adam Sandler on the Actors on Actors series that the pressures of professional obligations led to their split.\n\nIn February 2019, Lawrence confirmed her engagement to New York art gallery director Cooke Maroney. The two tied the knot in Newport, Rhode Island, that October. They welcomed a son named Cy in February 2022.\n\nThe actor has also established the Jennifer Lawrence Foundation, which leverages independent philanthropy initiatives, community events and donations and auctions to assist other organizations that service abused youth, people with intellectual disabilities and those in need of medical care.\n\nFact Check: We strive for accuracy and fairness. If you see something that doesn’t look right, contact us!", "images": ["https://www.biography.com/_assets/design-tokens/biography/static/images/logos/logo.5ec9b18.svg?primary=%2523ffffff", "https://www.biography.com/_assets/design-tokens/biography/static/images/logos/network-logo.04aa008.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/actors-paul-newman-and-robert-redford-attend-the-sundance-news-photo-1758031823.pjpeg?crop=0.695xw:1.00xh;0.146xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/jennifer-lawrence-attends-the-anatomie-dune-chute-red-news-photo-1704650471.jpg?crop=1.00xw:0.335xh;0,0.225xh&resize=1200:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/sharing.89c15b8.svg", "https://hips.hearstapps.com/hmg-prod/images/robert-redford-gettyimages-1186761501.jpg?crop=1.00xw:1.00xh;0,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/cynthia-erivo-attends-the-77th-annual-tony-awards-at-david-news-photo-1728393569.jpg?crop=1.00xw:0.673xh;0,0.0738xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/jennifer-lawrence-attends-the-anatomie-dune-chute-red-news-photo-1704650471.jpg?crop=1.00xw:0.668xh;0,0.0887xh&resize=640:*", "https://hips.hearstapps.com/hmg-prod/images/judy-garland-9306838-402.jpg?crop=1.00xw:1.00xh;0,0&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-153477096.jpg?crop=1.00xw:0.802xh;0,0.101xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://hips.hearstapps.com/hmg-prod/images/robert-redford-news-photo-1758145731.pjpeg?crop=0.767xw:0.558xh;0.0683xw,0.0579xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/images/privacy/opt-out.66f7eeb.svg", "https://hips.hearstapps.com/hmg-prod/images/nicole-kidman-attends-a-red-carpet-for-babygirl-during-the-news-photo-1730234543.jpg?crop=0.641xw:0.956xh;0.250xw,0.0440xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/jimmy-kimmel-live-airs-every-weeknight-at-11-35-p-m-et-and-news-photo-1758228400.pjpeg?crop=0.771xw:0.616xh;0.117xw,0.0221xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/kevin-costner-attends-airbnb-2025-summer-release-on-may-13-news-photo-1748528166.pjpeg?crop=0.753xw:0.502xh;0.163xw,0.0466xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/the-safe-return-of-the-apollo-13-astronauts-after-their-news-photo-1754686592.pjpeg?crop=0.712xw:1.00xh;0.199xw,0&resize=360:*", "https://hips.hearstapps.com/vidthumb/images/inkt-ep04-thumbnail-682dd7da2d33d.jpg?crop=1xw:1xh;center,top", "https://hips.hearstapps.com/hmg-prod/images/cynthia-erivo-at-the-wicked-for-good-new-york-premiere-held-news-photo-1763498079.pjpeg?crop=0.636xw:0.947xh;0.176xw,0.0526xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1146827623.jpg?crop=1.00xw:1.00xh;0,0&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/close.38e3324.svg", "https://hips.hearstapps.com/rover/profile_photos/b50d4909-0f39-4b73-b482-46d0a9078d40_1682363012.file?fill=1:1&resize=120:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/jennifer-lawrence-attends-the-anatomie-dune-chute-red-news-photo-1704650471.jpg?crop=1.00xw:0.335xh;0,0.225xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.biography.com/actors/jennifer-lawrence", "title": "Jennifer Lawrence: Biography, Actor, 2024 Golden Globe Nominee", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge", "msapplication-tap-highlight": "no", "title": "Jennifer Lawrence: Biography, Actor, 2024 Golden Globe Nominee", "description": "Actor Jennifer Lawrence is known for her movie roles in ‘Winter’s Bone,’ ‘The Hunger Games,’ and ‘Silver Linings Playbook,’ for which she won an Academy Award.", "keywords": "School: Actors Studio Drama School, School: Georgetown University, profile", "theme-color": "#000000", "og": {"site_name": "Biography", "title": "Jennifer Lawrence - Movies, Age & Oscar", "description": "Actor Jennifer Lawrence is known for her movie roles in Winter’s Bone, The Hunger Games, X-Men, and Joy. She won an Oscar for her performance in Silver Linings Playbook.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/jennifer-lawrence-attends-the-anatomie-dune-chute-red-news-photo-1704650471.jpg?crop=1.00xw:0.335xh;0,0.225xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.biography.com/actors/jennifer-lawrence", "type": "article"}, "article": {"publisher": "https://www.facebook.com/Biography", "opinion": "false", "section": "Famous Actors", "modified_time": "2024-01-07T18:29:00Z", "published_time": "2024-01-07T18:29:00Z"}, "parsely-metadata": "{\"socialHeadline\":\"Jennifer Lawrence - Movies, Age & Oscar\"}", "robots": "noarchive,noai,noimageai,max-image-preview:large,max-snippet:-1,max-video-preview:30,index,follow", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/jennifer-lawrence-attends-the-anatomie-dune-chute-red-news-photo-1704650471.jpg?crop=1.00xw:0.670xh;0,0.0882xh&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/jennifer-lawrence-attends-the-anatomie-dune-chute-red-news-photo-1704650471.jpg?crop=1.00xw:0.335xh;0,0.225xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/jennifer-lawrence-attends-the-anatomie-dune-chute-red-news-photo-1704650471.jpg?crop=1.00xw:0.670xh;0,0.0882xh", "twitter": {"image": "https://hips.hearstapps.com/hmg-prod/images/jennifer-lawrence-attends-the-anatomie-dune-chute-red-news-photo-1704650471.jpg?crop=1.00xw:0.335xh;0,0.225xh&resize=640:*", "card": "summary_large_image"}, "auto-publish": "never", "sailthru.excerpt": "1990-presentWho Is Jennifer Lawrence?Actor Jennifer Lawrence got her big break at 14 when she was discovered while vacationing in New York City with her family. She quickly landed a part in the TV series The Bill Engvall Show, followed by roles in movies that included The Burning Plain, Winter’s Bone,", "sailthru.tags": "actors,Famous Actors,academy-awards,Academy Awards,Biography-US", "sailthru.date": "2024-01-07 18:29:00", "sailthru.socialtitle": "Jennifer Lawrence - Movies, Age & Oscar", "sailthru.contenttype": "standard-article"}, "movies": [], "publish_date": 1704652140.0, "source": "https://www.biography.com", "summary": ""}