{"url": "https://en.wikipedia.org/wiki/Stevie_Ryan", "text": "American YouTube personality and actress (1984–2017)\n\nStevie Kathleen Ryan (June 2, 1984 – July 1, 2017)[1] was an American YouTube personality, actress and comedian. She was known for her YouTube videos and starring in the VH1 series Stevie TV.\n\nRyan was born June 2, 1984, in Riverside, California. At the age of two, Ryan and her family relocated to Victorville, where her parents operated a trucking business. In 2002, she graduated from Silverado High School.[2]\n\nAt the age of 19, Ryan made the move to Los Angeles to pursue a career in the entertainment industry. Throughout 2006 and 2007, Ryan booked various commercial projects while also filming, editing, and acting in videos which she posted online.[3]\n\nRyan collaborated with New Wave Entertainment in 2010 on the sketch comedy show Stevie TV, which parodied famous pop culture personalities and phenomena. It was picked up by VH1.[4][5] It was cancelled after the second season.[6]\n\nDeath and lawsuit [ edit ]\n\nRyan was found dead in her home due to an apparent suicide by hanging on July 1, 2017, at the age of 33.[7][8][9]\n\nIn 2018, it was reported that the late actress's parents brought a lawsuit against nurse practitioner Gerald Baltz after it was learned that Baltz, who for two years had provided Ryan with psychiatric care, had an inappropriate sexual relationship with Ryan months before her death. Baltz allegedly issued Ryan prescriptions for about 10 drugs used to treat a range of conditions — including depression, schizophrenia and bipolar disorder — without providing “clear rationale for prescribed medications,” according to the accusation. He also allegedly failed to seek supervision for her when she was suicidal. In 2019, Ryan's parents, Baltz, and Baltz's company Baltz Psychiatry Nursing, settled in the L.A. County Superior Court case for $200,000, according to a settlement notice filed with the court. On March 3, 2022, it was reported that Baltz was fired out of his California medical license.[10][11]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nYear Title Role Notes 2006 Rhapsody Michelle Short 2006 Sell Out Beauty Parlor Girl Short 2015 John Doe; Diary of a Serial Killer Herself\n\nTelevision [ edit ]\n\nYear Title Role Notes 2008 The Heavy Show Amy Winehouse 2 episodes 2009 Sex Ed: The Series Eileen Web series 2012–13 Stevie TV Herself Host; 14 episodes 2014 Ridiculousness Herself Season 4, Episode 5", "images": ["https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Stevie_Ryan", "title": "Stevie Ryan", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "viewport": "width=1120", "og": {"title": "Stevie Ryan - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}