{"url": "https://www.independent.co.uk/news/uk/home-news/prince-harry-meghan-markle-wedding-royal-family-paid-st-georges-chapel-windsor-castle-a8080381.html", "text": "Your support helps us to tell the story Read more Support Now From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it's investigating the financials of Elon Musk's pro-Trump PAC or producing our latest documentary, 'The A Word', which shines a light on the American women fighting for reproductive rights, we know how important it is to parse out the facts from the messaging. At such a critical moment in US history, we need reporters on the ground. Your donation allows us to keep sending journalists to speak to both sides of the story. The Independent is trusted by Americans across the entire political spectrum. And unlike many other quality news outlets, we choose not to lock Americans out of our reporting and analysis with paywalls. We believe quality journalism should be available to everyone, paid for by those who can afford it. Your support makes all the difference. Read more\n\nThe royal family will pay for Prince Harry and Meghan Markle's wedding, Kensington Palace has announced.\n\nThe newly engaged couple are to marry in May at St George's Chapel in Windsor Castle.\n\nMs Markle, who will become a senior HRH on marrying into the royals, also intends to become a British citizen.\n\nAs the couple make preparations for their big day, the American actress, a protestant who went to a catholic high school, will be both baptised and confirmed, ready for the religious ceremony.\n\nThe royal family will pay for the church service, the music, the flowers and the reception, the palace said.\n\nIt was also announced the couple would carry out their first official engagement together at an Aids charity in Nottingham this coming Friday.\n\nMarkle, who rose to fame for playing Rachel Zane on popular US legal drama Suits, will become joint Patron of the Royal Foundation alongside Prince Harry and the Duke and Duchess of Cambridge.\n\nThe humanitarian and gender equality campaigner will be forced to relinquish her current charity commitments and embark on a new string of charitable endeavours as part of her new life in Britain.\n\nSt George's Chapel is a smaller venue for the wedding than Westminster Abbey where the Duke and Duchess of Cambridge tied the knot or St Paul's Cathedral where Prince Harry's parents wed.\n\nThe chapel, which is the burial place of ten monarchs including Henry VIII and Charles I, dates back more than 500 years. It has been a traditional venue for royal weddings since the future King Edward VII married Princess Alexandra of Denmark in 1863.\n\nThe 33-year-old, who is fifth in line to the throne, and Markle have been dating for about a year and a half. The pair, who met through a mutual friend, announced their engagement on Monday.\n\nA statement from Clarence House said: “His Royal Highness and Ms Markle became engaged in London earlier this month. Prince Harry has informed Her Majesty The Queen and other close members of his family. Prince Harry has also sought and received the blessing of Ms Markle's parents\".\n\nDuring a TV appearance on Monday night, Prince Harry revealed he proposed to Markle in the kitchen over a roast kitchen while they enjoyed a \"standard, typical night\" in their cottage.\n\n“It was so sweet and natural and very romantic,” Markle told BBC.\n\nShe added: “As a matter of fact, I could barely let you finish proposing. I said, ‘Can I say yes now’?”\n\nAfter their relationship became public just over a year ago, Prince Harry lashed out at the paparazzi for subjecting Markle to a “wave of abuse and harassment”.\n\nIn an unusual public statement, the Palace attacked the “racial undertones” of media coverage of Markle and said the prince feared for her safety. The actor, whose father is white and mother is African American, has described herself as biracial and “half black and half white” on her website.\n\n“My dad is Caucasian and my mom is African-American. To say who I am, to share where I’m from, to voice my pride in being a strong, confident mixed-race woman,\" Markle has previously said.", "images": ["https://www.independent.co.uk/img/logo-white-out.svg", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/11/28/11/harry-meghan-engagement-1.jpg?width=1200&height=800&crop=1200:800", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/11/28/11/harry-meghan-engagement-1.jpg"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/11/28/11/harry-meghan-engagement-1.jpg?width=1200&height=800&crop=1200:800", "keywords": [], "authors": [], "canonical_link": "https://www.independent.co.uk/news/uk/home-news/prince-harry-meghan-markle-wedding-royal-family-paid-st-georges-chapel-windsor-castle-a8080381.html", "title": "Prince Harry and Meghan Markle's wedding will be paid for by royal family", "meta_data": {"robots": "max-image-preview:large,max-video-preview:-1", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "Home News", "sitename": "The Independent", "page path": "/news/uk/home-news", "page type": "Article", "adPageType": "Article Page", "description": "They newly engaged couple are will marry in May at St George's Chapel in Windsor Castle", "og": {"updated_time": "2017-11-28T16:32:13.000Z", "site_name": "The Independent", "title": "The royal family will pay for Prince Harry and Meghan's wedding", "url": "https://www.independent.co.uk/news/uk/home-news/prince-harry-meghan-markle-wedding-royal-family-paid-st-georges-chapel-windsor-castle-a8080381.html", "type": "article", "description": "They newly engaged couple are will marry in May at St George's Chapel in Windsor Castle", "image": {"identifier": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/11/28/11/harry-meghan-engagement-1.jpg?width=1200&height=800&crop=1200:800", "secure_url": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/11/28/11/harry-meghan-engagement-1.jpg?width=1200&height=800&crop=1200:800"}, "locale": "en_GB"}, "article": {"published_time": "2017-11-28T16:32:13.000Z", "modified_time": "2017-11-28T16:32:13.000Z", "section": "News", "subsection": "UK", "author_name": "Samuel Osborne, Maya Oppenheim", "content_type": "story", "word_count": 625, "image_count": 1, "embed_count": 2, "video_count": 1, "internal_link_count": 3, "external_link_count": 1}, "date": "2017-11-28T16:32:13.000Z", "viewport": "width=device-width,initial-scale=1,minimum-scale=1", "theme-color": "#919191", "indy-test-internal-article-helmet": "indy", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "twitter": {"title": "The royal family will pay for Prince Harry and Meghan's wedding", "site": "@Independent", "card": "summary_large_image", "description": "They newly engaged couple are will marry in May at St George's Chapel in Windsor Castle", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/11/28/11/harry-meghan-engagement-1.jpg?width=1200&height=800&crop=1200:800"}, "keywords": "[\"Prince Harry\",\"Meghan Markle\",\"Royal Wedding\",\"Internal\"]"}, "movies": [], "publish_date": 1511886733.0, "source": "https://www.independent.co.uk", "summary": ""}