{"url": "https://www.celebritynetworth.com/richest-celebrities/singers/marcus-mumford-net-worth/", "text": "What Is Marcus Mumford's Net Worth?\n\nMarcus Mumford is a British-American musician, singer, songwriter, and record producer who has a net worth of $10 million. That is separate from his wife, actress Carey Mulligan, who has a net worth of $12 million.\n\nMarcus Mumford is best known for being the lead singer, guitarist, and drummer for the folk rock band Mumford & Sons. The band has released the studio albums \"Sigh No More\" (2009), \"Babel\" (2012), \"Wilder Mind\" (2015), and \"Delta\" (2018) and are known for singles such as \"Little Lion Man,\" \"The Cave,\" \"Roll Away Your Stone,\" \"I Will Wait,\" and \"Believe.\" As a solo artist, Marcus has released the 2022 album \"Self-Titled\" and he earned a Primetime Emmy nomination for composing the theme music for the Apple TV+ series \"Ted Lasso\" (shared with Tom Howe, who he also scores the series with). Mumford is married to actress Carey Mulligan.\n\nEarly Life\n\nMarcus Mumford was born Marcus Oliver Johnstone Mumford on January 31, 1987, in Yorba Linda, California. His parents, Eleanor and John, are English, and they are national directors of the Vineyard Churches, an evangelical Christian denomination. Since his birth, Marcus has held both U.S. and U.K. citizenship, and the family returned to the U.K. when Mumford was a baby. Marcus has an older brother named James.\n\nMumford grew up in Wimbledon Chase, southwest London, and he attended King's College School, where he met his future Mumford & Sons bandmate Ben Lovett. After a year at the University of Edinburgh, Marcus moved back to London to focus on a career in music. In a 2022 interview with \"GQ\" magazine, Mumford revealed that he had been sexually abused during his childhood and that he wrote the song \"Cannibal\" about it, stating, \"Like lots of people – and I'm learning more and more about this as we go and as I play it to people – I was sexually abused as a child. Not by family and not in the church, which might be some people's assumption. But I hadn't told anyone about it for 30 years.\"\n\nCareer\n\nMarcus' music career began as a drummer for Laura Marling on tour alongside other future members of Mumford & Sons. In 2007, he formed the band with Ben Lovett, Ted Dwane, and Winston Marshall, and they released the EPs \"Mumford & Sons\" and \"Love Your Ground\" the following year. The band released its debut album, \"Sigh No More,\" on October 2, 2009, and it reached #1 on the charts in Australia, Ireland, and New Zealand as well as the U.S. \"Billboard\" Folk Albums, Independent Albums, Top Alternative Albums, Top Rock Albums, and Top Tastemaker Albums charts. The album was certified 6× Platinum in the U.K., 4× Platinum in Australia, and 3× Platinum in the U.S., and the singles \"Little Lion Man,\" \"The Cave,\" and \"Roll Away Your Stone\" went Platinum or higher in several countries. \"Little Lion Man\" and \"The Cave\" each earned a Grammy nomination for Best Rock Song, and \"The Cave\" was also nominated for Record of the Year, Song of the Year, and Best Rock Performance.\n\nMumford & Sons released their second album, \"Babel,\" in September 2012, and it reached #1 on the charts in eight countries and went 5× Platinum in Canada, 4× Platinum in the U.K., and 3× Platinum in Australia. \"Babel\" won a Grammy for Album of the Year, and the single \"I Will Wait\" was nominated for Best Rock Performance and Best Rock Song. Marcus performed a cover of the folk tune \"Dink's Song\" with Oscar Isaac for the 2013 film \"Inside Llewyn Davis,\" and he voiced Mike Timlin, the deceased musical partner of the film's title character. In 2014, he performed on the album \"Lost on the River: The New Basement Tapes,\" which also featured artists such as Elvis Costello, T Bone Burnett, and Rhiannon Giddens. Mumford co-wrote several of the album's tracks as well. The third Mumford & Sons album, Wilder Mind, was released in May 2015, and it reached the top 10 on the charts in 17 countries. The album went Platinum in five countries, and it featured the Gold single \"Believe.\" In November 2018, the band released album #4, \"Delta,\" which topped the charts in four countries and was certified Gold in Canada and the U.K.\n\nThe band appeared in the 2012 documentary \"Big Easy Express,\" which won a Grammy for Best Music Film, and 2013's \"Mumford & Sons: The Road to Red Rocks\" was also nominated in that category. Marcus released the solo album \"Self-Titled\" in September 2022, and it reached #4 in the U.K. His music video for the single \"Cannibal\" was directed by none other than Steven Spielberg. \"Cannibal\" was the Oscar-winning director's first music video, and it was filmed on his phone in one take. Mumford also produced the 2015 Christian Letts album \"Hold Fast\" and co-wrote four of the tracks, and he produced the 2016 King Charles album \"Gamble for a Rose.\"\n\nPersonal Life\n\nAs a child, Marcus was pen pals with a girl named Carey Mulligan. Carey would grow up to become an Oscar-nominated actress known for films such as \"An Education,\" \"Never Let Me Go,\" and \"Promising Young Woman,\" and after she and Marcus worked together on the film \"Inside Llewyn Davis,\" they married on April 21, 2012. The ceremony was officiated by Mumford's father, and guests included Jake Gyllenhaal, Sienna Miller, and Colin Firth. The couple welcomed daughter Evelyn in September 2015, son Wilfred in August 2017 and a third child in October 2023. Marcus is a fan of the English football club AFC Wimbledon.\n\nAwards and Nominations\n\nIn 2021, Mumford earned a Primetime Emmy nomination for Outstanding Original Main Title Theme Music for \"Ted Lasso,\" and he has also received two Hollywood Music In Media Award nominations for the series, Outstanding Score – TV Show/Limited Series (2020) and Best Original Score – TV Show/Limited Series (2021). In 2014, he won an Online Film & Television Association Award for Best Music, Adapted Song for the song \"Fare Thee Well\" from \"Inside Llewyn Davis.\" With Mumford & Sons, Marcus has earned 13 Grammy nominations, winning Album of the Year for \"Babel\" and Best Long Form Music Video for \"Big Easy Express\" in 2013. The band has also won Americana Music Honors & Awards for Emerging Artist of the Year (2011) and Trailblazer Award (2018), an ARIA Music Award for Most Popular International Artist (2010), an Echo Music Prize for International Rock/Pop Group (2013), an Ivor Novello Award for International Achievement (2014), a Juno Award for International Album of the Year for \"Babel\" (2013), and Brit Awards for British Album of the Year for \"Sigh No More\" (2011) and British Group (2013). They have been nominated for 19 \"Billboard\" Music Awards, taking home the prize for Top Alternative Artist, Top Rock Album, and Top Alternative Album for \"Sigh No More\" in 2011 and Top Rock Album for \"Babel\" in 2013.\n\nReal Estate\n\nIn 2013, Marcus and Carey purchased a £2million farmhouse in Devon, England. In September 2022, they paid $6.5 million for a 4,593 square foot home in the Hollywood Hills. The home includes four bedrooms, six bathrooms, a production studio, and a movie theater. They listed this home for sale in March 2023 for $6.5 million, their exact purchase price from less than a year ago. They ultimately accepted a $400,000 loss when they sold the home in August 2023 for $6.1 million. Here's a video tour of their former LA home:", "images": ["https://vz.cnwimg.com/thm/1JoH3482haSLevnlEMdqhrz36y0=/132x132/center/top/filters:format(webp)/2009/11/George-Clooney.jpg", "https://vz.cnwimg.com/thm/I4dSiTJhq0kprSuO--deoPCEAmQ=/132x132/center/top/filters:format(webp)/2020/06/taylor.png", "https://vz.cnwimg.com/thm/uRsxoLs7Ymmit5ATgRtN2utad40=/221x5:381x236/132x132/filters:format(webp):strip_exif()/2009/09/P-Diddy.jpg", "https://vz.cnwimg.com/thm/h02nIgDcIeEu84Js_eZI2mcVLpo=/132x132/center/top/filters:format(webp)/2015/04/GettyImages-463177323.jpg", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "https://vz.cnwimg.com/thm/uve346TeU8bgdsrgCVtVql_6MHE=/132x132/center/top/filters:format(webp)/2015/04/GettyImages-463177309.jpg", "https://vz.cnwimg.com/thm/_mrssHVasAOYBFP_ygklDKXYvBY=/132x132/center/top/filters:format(webp)/2013/07/GettyImages-156420206.jpg", "https://vz.cnwimg.com/thm/1vOxZIY2nPAp21y-DiHlkoMLGQM=/132x132/center/top/filters:format(webp)/2010/12/Natasha-Bedingfield.jpg", "https://vz.cnwimg.com/thm/0dOqT2nlNQM7u_J-5xWrCsf2nAw=/132x132/center/top/filters:format(webp)/2020/02/Angelina-Jolie.png", "https://vz.cnwimg.com/thm/_hOmdPz8Ht24ZxIeZM7m4mGRouk=/132x132/center/top/filters:format(webp)/2019/11/GettyImages-1094653148.jpg", "https://vz.cnwimg.com/thm/Y14fttV9jls9mxFLuNAHJTnNWTE=/132x132/center/top/filters:format(webp)/2019/10/denzel-washington-1.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/thm/lt1abKKVHSBtY-US0k9GLU9MTmM=/132x132/center/top/filters:format(webp)/2009/09/Brad-Pitt.jpg", "https://vz.cnwimg.com/thm/IoWqGPmFDjvC6iTqcDsspXBuxqo=/132x132/center/top/filters:format(webp)/2018/03/GettyImages-821622848.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/thm/EL5Atcw1m6_5DkVUWBicHK_z1wo=/600x300/center/top/filters:format(webp)/2014/05/GettyImages-178307268.jpg", "https://vz.cnwimg.com/thm/_WdaT44PQgHOX_6q_GKf28SBLzk=/132x132/center/top/filters:format(webp)/2010/03/Carey-Mulligan.jpg", "https://vz.cnwimg.com/wp-content/uploads/2014/05/GettyImages-178307268.jpg?x46379", "https://vz.cnwimg.com/thm/dXuAPIEBU--L_kRib4u0nSzjUtE=/132x132/center/top/filters:format(webp)/2020/04/Megan-Fox.jpg", "https://vz.cnwimg.com/thm/95i5RI1LWkjHyyoolMeto-z_WeU=/132x132/center/top/filters:format(webp)/2020/01/lopez3.jpg", "https://vz.cnwimg.com/thm/KFAqJ9F4o80l6an2fe78-0jw28s=/132x132/center/top/filters:format(webp)/2019/04/rr.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2014/05/GettyImages-178307268.jpg?x46379", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/singers/marcus-mumford-net-worth/", "title": "Marcus Mumford Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Marcus Mumford net worth: Marcus Mumford is a British-American musician, singer, songwriter, and record producer who has a net worth of $10 million. That is separate from his wife, actress Carey Mulligan, who has a net worth of $12 million.", "slick": {"wpversion": "3.0.1", "wppostid": 83640, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2014/05/GettyImages-178307268.jpg?x46379", "group": "post", "category": "singers:Singers"}, ";": "richest-celebrities:Richest Celebrities", "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "cnw": {"wppostid": 83640}, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Marcus Mumford Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/singers/marcus-mumford-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2014/05/GettyImages-178307268.jpg?x46379", "site_name": "Celebrity Net Worth", "description": "What is Marcus Mumford's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2023-11-13T18:09:12+00:00", "published_time": "2022-11-16T02:00:13+00:00", "section": "Singers", "tag": "marcus mumford worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2014/05/GettyImages-178307268.jpg?x46379", "title": "Marcus Mumford Net Worth", "description": "Marcus Mumford net worth: Marcus Mumford is a British-American musician, singer, songwriter, and record producer who has a net worth of $10 million. That is separate from his wife, actress Carey Mulli"}}, "movies": [], "publish_date": 1668564013.0, "source": "https://www.celebritynetworth.com", "summary": ""}