{"url": "https://ew.com/tv/2017/05/20/unbreakable-kimmy-schmidt-oitnb-netflix-crossover/", "text": "Warning: This article contains spoilers from Unbreakable Kimmy Schmidt season 3 episode 5. Read at your own risk.\n\nThe fifth episode of Unbreakable Kimmy Schmidt‘s third season ended with a surprising twist: an Orange Is the New Black crossover.\n\nIn “Kimmy Steps on a Crack!,” the FBI asks Kimmy (Ellie Kemper) to help them diffuse a situation involving her former bunker-mate Gretchen (Lauren Adams), who started a cult comprised of kidnapped young boys and who is now threatening to blow up the cult’s compound. Kimmy’s able to talk Gretchen down, and she convinces her to accept the consequences of her actions by going to prison. And not just any prison! (Read our full recap of the episode here.)\n\nIn a very Friends–Mad About You-esque twist, the half-hour ends with Gretchen being sent to Orange Is the New Black‘s Litchfield Penitentiary, where she meets Black Cindy, a character on that show played by Adrienne C. Moore. Which means Unbreakable Kimmy Schmidt and Orange Is the New Black are actually in the same universe!\n\n“We thought it was funny to suggest we lived in the same universe,” Kimmy Schmidt co-creator Robert Carlock told EW when we hopped on the phone with him for a quick chat about how this crossover came to be, what input OITNB creator Jenji Kohan had, and whether or not a line from the scene was an intentional nod to another Netflix series. Read on below to find out more about this fun aside!\n\nENTERTAINMENT WEEKLY: Where did the idea for this crossover come from? Who pitched in the writers’ room?\n\nROBERT CARLOCK: Well, once we went down that road with that story, which we wanted to tell, we knew that Gretchen either had to go to jail or get blown up. We didn’t want to blow up Gretchen or any of the people around her, so we knew she was going to jail. I think [the OITNB scene] was just half a joke pitch and half we felt we could somehow save money, and that turned out not to be true. And, it turned into purely a joke that I think was Tina [Fey]’s. We thought it was funny to suggest we lived in that same world as Orange Is the New Black, and of course, we’re always looking for Netflix synergies. That’s our main thing that we do day-to-day. We’re gonna have a lot of stuff with Fuller House coming up — any opportunity we can to crossover with other Netflix shows.\n\nWe emailed Jenji Kohan just asking if it was okay that we said she was going to that prison, and then I think we added the idea of, “Oh, it’d be nice to have one of their actors to make it really real.” And, we asked if that was okay. Jenji was very open to us just trampling all over the world she created, which we were very appreciative of. At one point, the line that Black Cindy has‚ which is about stabbing her boss at Sea World, was phrased where it made it seem like that was the reason she was at that prison, which pulled a little thread. Jenji did ask us to make that something that happened in the past, which was fine with us and completely understandable. I guess we just like the idea of what it means for Gretchen in the future. I don’t know that Jenji will allow us to do a Gretchen episode of Orange Is the New Black, but we just like the idea of these fictional worlds intersecting. It seemed funny to us.\n\nThis season we actually tried to do a [30 Rock cameo], but we didn’t pull it off, and I hope some day we will. Tina and I have been joking for a while about just having Jack McBrayer just cross in the background at some point on his way to work as Kenneth, the president of NBC, in one of his 1970s suits. Jack happened to be in town on a day that we were shooting at Rockefeller Center. We called him and asked him to come be in the background. He came down, got in makeup, and our costume people somehow tracked down a Kenneth suit, but he was working another job [and] had to go back. At the end of the day, what we want is a unified field theory where every fictional show in the world is actually real in our universe.\n\nJust to clarify, were you joking when you said there’d be some nods to Fuller House?\n\nOh no, sorry, I was joking. Thank you for clarifying.\n\nDid this scene actually end up being more expensive than if you’d just gone with a generic prison?\n\nWell, I don’t know if it was more expensive than going and finding our own prison, but we thought, “This must be an existing thing. We’ll just go and do that there and somehow that’ll be cheaper than having our own unit.” I think the prison is an old insane asylum or something where they shoot, [but] we didn’t realize how far away it was. What we did is that we actually shot all of Gretchen’s pieces for that somewhere either nearby our main stages or connected to a day that we had out in the city. I’m not sure exactly where. So, the stuff with her and Black Cindy coming off the bus, any time Gretchen’s in the shot, we shot that, and all of her POV, including the actual shot of the Litchfield entrance, was footage that we got from them. So, we had to Frankenstein it a little bit to sell that she was at Litchfield. At the end of the day, the idea of going to Litchfield as a joke that might mean we wouldn’t have to build or find a location or something, it ended up being more complicated than it needed to be, but I feel comforted that Gretchen is at that particular prison. I think she’ll do well there.\n\nNetflix\n\nDid you write the scene with Black Cindy in mind, or was it a matter of which actor was available?\n\nI think we got a list of availabilities just to see if anyone was available, but we had worked with Adrienne on 30 Rock. Obviously, everyone’s very talented on that show, but we just knew how funny she was and we kind of thought it’d be nice to use someone we considered a friend and we just liked the character and everything. So, we were happy to have her back. Which, I guess, means in our unified field theory, the character she played on 30 Rock is now in prison and worked at Sea World. So, it’s gonna be hard to figure that out.\n\nIs this sort of crossover easier to do on Netflix than it would be on network television? I remember 30 Rock occasionally had Law & Order: SVU cameos.\n\nI don’t know. In my experience, networks are always happy to have one show promoting the other — when we usually go and ask for it. It’s usually something they have to ask for. Back in the days, there’d be themed nights on network evenings. I think NBC did a blackout night where all of the shows in New York were struck with the same blackout, but Seinfeld wouldn’t do it. Three of the shows had a blackout. So, you know that’s usually the kind of promotional thing they want and that showrunners don’t, but we like anything weirder and denser and funnier.\n\nIn the scene, an inmate named Elaine, using sign language, explains that she doesn’t talk because the Yakuza cut out her tongue. Was that Yakuza reference supposed to be a nod to Daredevil?\n\nI don’t remember [who pitched that], so I can’t tell you if that person was thinking of Daredevil. Is Daredevil on Netflix?\n\nYes, it is.\n\nThen, yes, great! Absolutely!\n\nThe entire third season of Unbreakable Kimmy Schmidt is available on Netflix now. And you can read EW’s binge recap of the season, here.", "images": ["https://ew.com/thmb/lVcm8GPdLt1XCgk4QqkOefhFXLw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/charlie-cox-daredevil-born-again-tom-holland-spiderman-no-way-home-100925-1ef50ecce7b64b5488fb3518d98f8baf.jpg", "https://ew.com/thmb/bVSkRS3sYnmfCtHTCBNrsg2Us2U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9downloadasset-2000-ff8c75fa882c427db9590dfc4a34758d.jpg", "https://ew.com/thmb/82XfrJs5epmyvPMK4h6wMnKkwSM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/netflix-crime-movies-050924-de4748e07f8e4eb0931e9b31141be9cd.jpg", "https://ew.com/thmb/Tm9ojv2gyf9VaVik2D1MZMVIx2k=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/best-british-shows-on-netflix-110424-76e002edcd344ddf83c92a8ba8b1220b.jpg", "https://ew.com/thmb/bXxxtsVFFMWODSBXNmKrDQhiU68=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Selena-y-Los-Dinos-01-111725-05b0faad91744b2092c0f13315669f2a.jpg", "https://ew.com/thmb/26yGmwdKuRR1SV4o1ccFWYmA3VY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/BlackDovesseason2-111825-01-2c08526dbf284e2cabf4072dd445f861.jpg", "https://ew.com/thmb/e8-Qq7suNQi0bVpu3wh8-Fd_2ps=/2000x0/filters:no_upscale():max_bytes(150000):strip_icc()/kimmy-orange-2000-b4d1898fc3a747ae89c7119e9cf6a2fa.jpg", "https://ew.com/thmb/Uv57Y3WKa89BZCU1pOi9njuNi1k=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/parasite-cho-yeo-jeong-shes-gotta-have-it-tracy-camilla-johns-saturday-night-Lamorne-Morris-101525-6b51902aeae0400a87fbd0a33ab60202.jpg", "https://ew.com/thmb/TS-3FlYR2pZW6WKYIm2tHamKjb0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/zootopia-2524-111425-7ecf7385d984463c91394c431fb0aa85.jpg", "https://ew.com/thmb/t_3kph69VC0IgBmApKcTVpcMe9U=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/best-comedy-series-on-netflix-012224-6627fbe325b54f89b96896f4a73b4879.jpg", "https://ew.com/thmb/JcWT1yKuy1-ZcN2eXj5-fxjXyv8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Avatar-Fire-and-Ash-111425-f8901455856345a8a505dc5c57f89b8c.jpg", "https://ew.com/thmb/aEI4rIZDgBkmBOFPNKQhsAfEmbY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Netflix-Cooking-shows-110823-tout-94d8032711c147b9abbc8e6fe723ccf1.jpg", "https://ew.com/thmb/km6O_0hbz__GeURjgAokKwnJYrY=/200x200/filters:no_upscale():max_bytes(150000):strip_icc()/ZvF4pJa8_400x400-10a3bf9e86e7400cb1001c09106ef285.jpg", "https://ew.com/thmb/D5d-HyXM3RUEaDWRyotmJEUDnzA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/matthew-lillard-charlie-cox-daredevil-born-again-100925-676dcd64b3d1478b9d48f2cbf265c5c9.jpg", "https://ew.com/thmb/9kTJ7qtp827bBePJDKNG1oEMr4A=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/NCIS-102825-1-45854be259f640608d9dae5eb26d8721.jpg", "https://ew.com/thmb/j5dDYOvswKECXtB3OD-kp0DmK0Y=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Lizzie-Borde-Ella-Beatty-101025-ea88a211eda043d2987da534903034b3.jpg", "https://ew.com/thmb/aY1r7aO_knJrPPUhCqdlMLS732k=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Netflix-Korean-films-040825-26fb335d0af04813b80ce740b1d12d16.jpg", "https://ew.com/thmb/cQzSuGQp45Qk4_DHL5Vt0sliyjw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/squid-game-prison-break-yellowjackets-110524-1-1538858ae00f4280acdc91e26fb573d3.jpg", "https://ew.com/thmb/I1abSLLuZybT5vru3tUXWEAqbg4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/KUBO-AND-THE-TWO-STRINGS-Guillermo-del-Toros-Pinocchio-THE-SEA-BEAST-050125-b5e0ffbba9344b5090c6ba5cd13ed8ef.jpg"], "top_img": "https://ew.com/thmb/bVSkRS3sYnmfCtHTCBNrsg2Us2U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9downloadasset-2000-ff8c75fa882c427db9590dfc4a34758d.jpg", "keywords": [], "authors": ["Chancellor Agard Is A Former Staff Writer At", "Ew'S Editorial Guidelines", "Andrew Walsh", "Ilana Gordon", "Kevin Jacobsen", "Randall Colburn", "Lauren Huff", "Nick Romano", "Allison Degrushe", "Sydney Bucksbaum"], "canonical_link": "https://ew.com/tv/2017/05/20/unbreakable-kimmy-schmidt-oitnb-netflix-crossover/", "title": "Unbreakable Kimmy Schmidt boss explains that surprising Netflix crossover", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Co-creator Robert Carlock explains how that unexpected crossover with another Netflix series in episode 5 came to be", "parsely-section": "TV", "parsely-tags": "TV Industry,Entertainment Industry Roles,TV Genres,Drama Shows,Screenwriters,Robert Carlock,Netflix,Orange Is the New Black,Comedy Shows", "article": {"section": "EW", "author": "https://www.facebook.com/entertainmentweekly"}, "og": {"type": "article", "site_name": "EW.com", "url": "https://ew.com/tv/2017/05/20/unbreakable-kimmy-schmidt-oitnb-netflix-crossover/", "title": "'Unbreakable Kimmy Schmidt' Boss Explains That Surprising Netflix Crossover", "description": "Co-creator Robert Carlock explains how that unexpected crossover with another Netflix series in episode 5 came to be", "image": "https://ew.com/thmb/bVSkRS3sYnmfCtHTCBNrsg2Us2U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9downloadasset-2000-ff8c75fa882c427db9590dfc4a34758d.jpg"}, "twitter": {"card": "summary_large_image", "site": "@EW", "title": "'Unbreakable Kimmy Schmidt' Boss Explains That Surprising Netflix Crossover", "description": "Co-creator Robert Carlock explains how that unexpected crossover with another Netflix series in episode 5 came to be", "image": "https://ew.com/thmb/bVSkRS3sYnmfCtHTCBNrsg2Us2U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9downloadasset-2000-ff8c75fa882c427db9590dfc4a34758d.jpg"}, "vf": {"url": "https://ew.com/tv/2017/05/20/unbreakable-kimmy-schmidt-oitnb-netflix-crossover/"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.104.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.104.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.104.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.104.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.104.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": 1495252800.0, "source": "https://ew.com", "summary": ""}