{"url": "https://www.vox.com/2018/6/14/17461458/millie-bobby-brown-homophobic-meme", "text": "is a senior correspondent who explains what society obsesses over, from Marvel and movies to fitness and skin care. He came to Vox in 2014. Prior to that, he worked at The Atlantic.\n\nNo one honestly believes Millie Bobby Brown runs over gay men with new cars. Just like no one honestly believes Millie Bobby Brown throws piping hot McCafés at people who wear pride T-shirts at McDonald’s. Just like no one honestly believes that Millie Bobby Brown bullies gay men by sliding into their texts and dropping f-bombs (the one that rhymes with maggots).\n\nBut what people don’t believe doesn’t really matter, as Millie Bobby Brown, the 14-year-old star of Netflix’s Stranger Things, deactivated her Twitter account this week, reportedly in response to assertions like these.\n\nThese claims are part of the #TakeDownMillieBobbyBrown meme, which consists of low-effort pictures — usually screengrabs from Brown’s Snapchat — pasted over with absurdly homophobic statements.\n\nOn the surface, the meme is shocking and in poor taste. Falsely portraying this young girl and child star as a raging homicidal bigot is heinous, and Brown deleting her Twitter to avoid this maelstrom is a logical response to the internet’s festering orgy of toilet humor.\n\nIf you dig deeper, this is also a story about the internet’s deeply intertwined relationship with irony. It’s about a meme that only succeeds because of how absurd it is, how pristine Brown’s celebrity image is, and how outrage can drive the internet to be the worst version of itself.\n\nThe story of Millie Bobby Brown being a monster bigot began as trolling\n\nThis meme about Brown is an exercise in sincerity versus absurdity. Brown seems like a such a sweet, honest young girl, which is why contrasting her image with such heinous statements evokes a reaction. In fact, the meme actually started in November 2017 with portraying Brown as anti-Islam.\n\nA troll account, @Kelsfiona — who changed their account to @Kelsbich, which is now suspended — tweeted a preposterous, fabricated story about meeting Brown at the airport, which ends with Brown stomping on a hijab. What drives the joke further is the trollish response of asking for proof of this nonsense story and then @Kelsfiona responding with an obviously fake image:\n\nMillie Bobbie Brown troll meme Twitter\n\nThat meme spurred this very similar, also ridiculous fake story about Brown being homophobic:\n\nThat spawned the “Millie Bobby Brown is homophobic” meme, with the accompanying troll hashtag #TakeDownMillieBobbyBrown, that’s circulated in the past few days, which has a few variations that resemble those initial reactions. Like this one, a completely farcical tale of Brown throwing a hot McDonald’s McCafé beverage at someone wearing a gay pride T-shirt:\n\nTwitter\n\nThere are also crasser, more to-the-point variations, which mainly consist of an obviously bad photoshop of Brown saying that she wants to run over gay men with her car and a recent variation that ascribes false stories of hateful racism to Brown. While not immediately related to the tweet that kicked all this off, the obviously bad photoshops that often accompany these tweets play up the painfully fake angle of the original meme.\n\nThe takeaway here is that these memes are designed to evoke a reaction, and the more reaction there is, the more troll-y the posts get, and the meme’s longevity increases. And that pattern means that Brown quitting Twitter may cause a Streisand effect, in which the meme only gets more attention from trolls because of Brown’s reaction.\n\nNo one believes the Millie Bobby Brown meme to be true. But that doesn’t mean it’s harmless.\n\nIf I’m being honest, I’ll admit to seeing some dark hilarity in this meme; portraying Brown, who seems to be a sweet, tiny human angel, as a vile bigot who mows down gay men with new cars is so ridiculous that it pushes these statements into the realm of surreal humor. It’s a dark satirization of the gross absurdity of the real world (where we just passed the two-year anniversary of the Pulse nightclub shooting), and for some, laughing at homophobia in such a ridiculous scenario is a way to undermine and cope with the very real homophobia in the world today.\n\nThat the meme is being remixed and laughed at by LGBTQ people creates a context of reclamation that would be missing if LGBTQ people weren’t the ones having fun with it. But the fact that that fun is coming at the expense of a 14-year-old girl raises questions of whether this type of humor is also a form of bullying.\n\nAgain, to be very clear, no one actually believes Brown is a hateful bigot, and there’s no evidence she’s made any statements even remotely related to those being attributed to her. The clear falseness of the meme, the fact that it is an obvious exercise in absurdity, makes it possible to compartmentalize the joke of a homophobic Millie Bobby Brown from the actual Millie Bobby Brown.\n\nBut the people who see this meme as bullying do also have a point: Brown is still a young actress in her formative years, and if the reports are accurate and she deactivated her account because of this meme, she’s clearly uncomfortable with its existence and may not feel that same compartmentalization. It’s not irrational for Brown to dislike the association of her name attached to these memes and want separation. And therein lies a lesson about what happens when the internet’s love of irony meets the real world.\n\nThere’s a phenomenon in which ironic memes, like the ones involving Brown, are sometimes willed into truths. As The Verge pointed out in its examination of the rise of flat-earthers, engaging with ironic humor over and over again (in this case with jokes about believing in a flat Earth) can cause people to start to question things for real. Another example is Pepe the Frog, in which an ironic joke about an awkward frog became a joke about that frog being ironically anti-Semitic, and then eventually that frog became a mascot for the alt-right.\n\nEach reaction to the irony moves the goalposts a little bit each time, to the point that it can become hard to know what field you’re playing on.\n\nAnd as much as I’d like to believe that these Brown memes would never get to that place, the internet has unfortunately shown itself to be more than capable of becoming the worst version of itself when given a chance.", "images": ["https://platform.vox.com/wp-content/uploads/sites/2/2025/11/AlexAbad-Santos_Vox.jpg?quality=90&strip=all&crop=16.666666666667%2C0%2C66.666666666667%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-590696434.jpg?quality=90&strip=all&crop=16.666666666667%2C0%2C66.666666666667%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/11538557/mbb_toned.jpg?quality=90&strip=all&crop=0%2C13.267525063792%2C100%2C73.464949872416&w=1200", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/the-true-meaning-of-friendsgiving.jpg?quality=90&strip=all&crop=7.8125%2C0%2C84.375%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/11535873/Screen_Shot_2018_06_13_at_11.30.49_PM.png?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-2155209999.jpg?quality=90&strip=all&crop=0.0041883062489489%2C0%2C99.991623387502%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/author_profile_images/195900/alex.0.jpg?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=96", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-2155209999.jpg?quality=90&strip=all&crop=16.669458870833%2C0%2C66.661082258335%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/11538307/mbb_compsite.png?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/11538557/mbb_toned.jpg?quality=90&strip=all&crop=0%2C3.2273152478952%2C100%2C93.54536950421&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/gettyimages-2217689678.jpg?quality=90&strip=all&crop=0%2C0.024402147388969%2C100%2C99.951195705222&w=2400", "https://www.google-analytics.com/g/collect?v=2&tid=G-C3QZPB4GVE&cid=555&en=noscript_page_view", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/AlexAbad-Santos_Vox.jpg?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-590696434.jpg?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/3_Vox_FuturePerfect25_LandingPage.gif?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/gettyimages-2217689678.jpg?quality=90&strip=all&crop=16.650390625%2C0%2C66.69921875%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/the-true-meaning-of-friendsgiving.jpg?quality=90&strip=all&crop=21.875%2C0%2C56.25%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/3_Vox_FuturePerfect25_LandingPage.gif?quality=90&strip=all&crop=16.666666666667%2C0%2C66.666666666667%2C100&w=2400"], "top_img": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/11538557/mbb_toned.jpg?quality=90&strip=all&crop=0%2C13.267525063792%2C100%2C73.464949872416&w=1200", "keywords": [], "authors": ["Alex Abad-Santos"], "canonical_link": "https://www.vox.com/2018/6/14/17461458/millie-bobby-brown-homophobic-meme", "title": "The “Millie Bobby Brown is homophobic” meme is absurd, but that doesn’t mean it’s harmless", "meta_data": {"bingbot": "nocache", "twitter": {"card": "summary_large_image", "site": "@voxdotcom", "url": "https://www.vox.com/2018/6/14/17461458/millie-bobby-brown-homophobic-meme", "title": "The “Millie Bobby Brown is homophobic” meme is absurd, but that doesn’t mean it’s harmless", "description": "How the “homophobic Millie Bobby Brown” meme made the actress quit Twitter.", "image": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/11538557/mbb_toned.jpg?quality=90&strip=all&crop=0%2C13.267525063792%2C100%2C73.464949872416&w=1200"}, "fb": {"app_id": 549923288395304}, "og": {"site_name": "Vox", "title": "The “Millie Bobby Brown is homophobic” meme is absurd, but that doesn’t mean it’s harmless", "description": "How the “homophobic Millie Bobby Brown” meme made the actress quit Twitter.", "url": "https://www.vox.com/2018/6/14/17461458/millie-bobby-brown-homophobic-meme", "type": "article", "image": {"identifier": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/11538557/mbb_toned.jpg?quality=90&strip=all&crop=0%2C13.267525063792%2C100%2C73.464949872416&w=1200", "type": "image/jpeg", "width": 1200, "height": 628}}, "viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Vox", "robots": "index,follow,max-image-preview:large", "description": "The “homophobic Millie Bobby Brown” meme made the actress quit Twitter.", "article": {"published_time": "2018-06-14T17:50:02+00:00", "modified_time": "2018-06-15T19:32:03+00:00"}, "author": "Alex Abad-Santos", "amazonbot": "noarchive", "parsely-type": "post", "parsely-title": "The “Millie Bobby Brown is homophobic” meme is absurd, but that doesn’t mean it’s harmless", "parsely-link": "https://www.vox.com/2018/6/14/17461458/millie-bobby-brown-homophobic-meme", "parsely-image-url": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/11538557/mbb_toned.jpg?quality=90&strip=all&crop=0,13.267525063792,100,73.464949872416", "parsely-pub-date": "2018-06-14T17:50:02+00:00", "parsely-section": "culture", "parsely-tags": "vox,pagetype:story,latest-news,culture,internet-culture", "parsely-author": "Alex Abad-Santos", "cse-category": "Culture", "cse-authors": "Alex Abad-Santos", "next-head-count": 49}, "movies": [], "publish_date": 1528948800.0, "source": "https://www.vox.com", "summary": ""}