{"url": "en.wikipedia.org/wiki/Time_Person_of_the_Year", "text": "Annual influential person or idea chosen by magazine\n\nAward\n\nPerson of the Year 1927 Man of the Year Charles Lindbergh , the award's inaugural winner Country United States Presented by Time Formerly called Man of the Year\n\nWoman of the Year First award 1927 ; 98 years ago ( ) Currently held by Donald Trump (2024) Website www .time .com /poy\n\nPerson of the Year (called Man of the Year or Woman of the Year until 1999)[1] is an annual issue of the American news magazine and website Time featuring a person, group, idea, or object that \"for better or for worse ...has done the most to influence the events of the year\".[2] The Time website or a partner organization also runs an annual online reader's poll that has no effect on the selection, although no poll was held in 2023 or 2024.[3][4]\n\nBackground [ edit ]\n\nThe tradition of selecting a \"Man of the Year\" began privately in 1927, with Time editors contemplating the news makers of the year after a series of \"slow news days\" leading up to New Year's Day.[4] The idea originally focused on a Man of the Week before it was decided to use Lindbergh to represent the predominant story of 1927, with the magazine listing him as Man of the Year being published in early 1928.[4]\n\nThe idea was also an attempt to remedy the editorial embarrassment earlier that year of not having aviator Charles Lindbergh on its cover following his historic transatlantic flight.[4] By the end of the year, it was decided that a cover story featuring Lindbergh as the Man of the Year would serve both purposes.[5]\n\nBefore the online poll was instituted, \"readers were invited to weigh in by mail.\"[4]\n\nSelection [ edit ]\n\nNational leaders [ edit ]\n\nSince the list began, every serving president of the United States has been a Man or Person of the Year at least once, with the exceptions of Calvin Coolidge (in office at the time of the first issue), Herbert Hoover (the subsequent president), and Gerald Ford (the only president never to have been elected to the office of president or vice president). Most were named Man or Person of the Year either the year they were elected or while they were in office; the only one to be given the title before being elected was Dwight D. Eisenhower, in 1944, as Supreme Commander of the Allied Invasion Force, eight years before his first election. He received the title again in 1959 while in office. Franklin D. Roosevelt became the first chosen US president and is the only person to have received the title three times, first as president-elect (1932) and later as the incumbent president (1934 and 1941).\n\nAll countries' heads of state or government to have been chosen as Man, Woman, or Person of the Year (arranged in chronological order by country name, from the most frequently selected) are:\n\nNotes\n\nWinston Churchill was chosen a second time for the special \"Man of the Half-Century\" edition in 1949 while serving as Leader of the Opposition before his second premiership; Charles de Gaulle was chosen while being elected President of France before formally taking office; Lech Wałęsa and Nelson Mandela were chosen before being elected President of Poland and President of South Africa, respectively.\n\nWomen [ edit ]\n\nBefore 1999, four women were granted the title as individuals: three as \"Woman of the Year\"—Wallis Simpson (1936), Queen Elizabeth II (1952), and Corazon Aquino (1986)—and one as half of \"Man and Wife of the Year\", Soong Mei-ling (jointly with Chiang Kai-shek) in 1937.[6] \"American Women\" were recognized as a group in 1975. Other classes of people recognized comprise both men and women, such as \"Hungarian Freedom Fighters\" (1956), \"U.S. Scientists\" (1960), \"The Inheritors\" (1966), \"The Middle Americans\" (1969), \"The American Soldier\" (1950 and 2003), \"You\" (2006), \"The Protester\" (2011), and \"Ebola Fighters\" (2014). However, the title on the magazine remained \"Man of the Year\" for both the 1956 \"Hungarian Freedom Fighter\" and the 1966 \"Twenty-five and Under\" editions which both featured a woman standing behind a man, and \"Men of the Year\" on the 1960 \"U.S. Scientists\" edition which exclusively featured men on its cover. It was not until the 1969 edition on \"The Middle Americans\" that the title embraced \"Man and Woman of the Year\".\n\nIn 1999, the title was changed to the gender-neutral \"Person of the Year\" (its first recipient under the new name being Jeff Bezos of Amazon.com).[7] Women who have been selected for recognition after the renaming include \"The Whistleblowers\" (Cynthia Cooper, Coleen Rowley, and Sherron Watkins) in 2002; Melinda Gates (jointly with Bill Gates and Bono) in 2005; Angela Merkel (2015); \"The Silence Breakers\" (2017); Greta Thunberg (2019); Kamala Harris (jointly with Joe Biden) in 2020; and Taylor Swift (2023). To celebrate International Women's Day in 2020, Time editors released 89 new magazine covers, each showing women, in addition to the 11 already chosen, as counterparts to the Man of the Year choices from the past century.[8]\n\nSince 2022, Time has awarded a separate \"Women of the Year\" title to a number of women each year, in a similar fashion to Time 100.[9]\n\nGroups and non-humans [ edit ]\n\nDespite the name, the title is not just granted to individuals. Pairs of people such as married couples and political opponents, classes of people, and inanimate objects have all been selected for the special year-end issue.\n\nMultiple named people\n\nClasses of unnamed people\n\nInanimate objects\n\nThe Computer (Machine of the Year, 1982)\n\nThe Endangered Earth (Planet of the Year, 1988)\n\nAbstract concepts\n\nSpecial editions [ edit ]\n\nIn 1949, Winston Churchill was named Man of the Half-Century,[10] and the last issue of 1989 named Mikhail Gorbachev as \"Man of the Decade\".[11] The December 31, 1999 issue of Time named Albert Einstein the \"Person of the Century\".[12] Both Franklin D. Roosevelt and Mahatma Gandhi were chosen as runners-up.[13] Aside from Einstein, the December 31 edition also named Persons of the Century for every century of the 2nd millennium: William the Conqueror for the 11th century, Saladin for the 12th century, Genghis Khan for the 13th century, Giotto for the 14th century, Johannes Gutenberg for the 15th century, Elizabeth I for the 16th century, Isaac Newton for the 17th century, Thomas Jefferson for the 18th century, and Thomas Edison for the 19th century.[14]\n\nControversial choices [ edit ]\n\nDespite the magazine's frequent statements to the contrary, the designation is often regarded as an honor and spoken of as an award or prize, simply based on many previous selections of admirable people.[15] However, Time points out that controversial figures such as Adolf Hitler (1938), Joseph Stalin (1939 and 1942), Nikita Khrushchev (1957), and Ayatollah Khomeini (1979) have also been granted the title for their impact on events.[16] Nevertheless, as a result of the public backlash it received from the American audience for naming Khomeini Man of the Year in 1979, the magazine's editors have since shied away from using figures who are controversial in the United States, fearing reductions in sales or advertising revenue.[17]\n\nTime's Person of the Year for 2001, immediately following the September 11 attacks, was Rudy Giuliani, who was then mayor of New York City.[18] The stated rules of selection—the individual or group of individuals who have had the bigger influence on the year's events—made Osama bin Laden the more likely choice that year; however, Giuliani was selected for symbolizing the American response to the attacks, in the same way that Albert Einstein was selected Person of the Century for representing a century of scientific exploration and wonder instead of Adolf Hitler, who was arguably a stronger candidate.[19] The selections were ultimately based on the criteria, \"who they believed had a stronger influence on history and who represented either the year or the century the most.\"[citation needed]\n\nWithdrawn and alleged selections [ edit ]\n\nIn 1941, the fictional elephant Dumbo from Walt Disney's animated film of the same name was selected to be \"Mammal of the Year\", and a cover was created showing the title character in a formal portrait style. However, the attack on Pearl Harbor on December 7 pre-empted the cover. The U.S. president Franklin Delano Roosevelt was named Man of the Year for a record third time, although Dumbo's Mammal of the Year profile still appeared on the inside pages of the magazine.[20]\n\nFilmmaker Michael Moore claims that director Mel Gibson cost him the opportunity to be Person of the Year alongside Gibson in 2004. Moore's controversial political documentary Fahrenheit 9/11 became the highest-grossing documentary of all time the same year Gibson's The Passion of the Christ became a box-office success and also caused significant controversy. Moore said in an interview \"I got a call right after the '04 election from an editor from Time Magazine. He said,' Time Magazine has picked you and Mel Gibson to be Time's Person of the Year to put on the cover, Right and Left, Mel and Mike. The only thing you have to do is pose for a picture with each other. And do an interview together.' I said 'OK.' They call Mel up, he agrees. They set the date and time in LA. I'm to fly there. He's flying from Australia. Something happens when he gets home ... Next thing, Mel calls up and says, 'I'm not doing it. I've thought it over and it is not the right thing to do.' So they put Bush on the cover.\"[21]\n\nU.S. president Donald Trump claimed on Twitter in November 2017 that Time editors had told him he would \"probably\" be named Person of the Year for a second time, conditional on an interview and photo shoot, which he had refused. Time denied that they had made any such promises or conditions to Trump, who was named a runner-up.[22]\n\nPerson(s) of the Year [ edit ]\n\nOther categories [ edit ]\n\nEvery year, in addition to the main Person of the Year, Time (sometimes alongside a partner company) acknowledges impactful people or groups in other categories. This is a relatively recent practice, beginning in 1998 when Mark McGwire was awarded the title of Hero of the Year and becoming a regular event in 2018 with the re-introduction of the Heroes of the Year award.\n\nHeroes of the Year was joined by Athlete of the Year, CEO of the Year, Entertainer of the Year and Guardians of the Year in 2019, Kid of the Year in 2020, Breakthrough of the Year, Dreamer of the Year, Icon of the Year and Innovator of the Year in 2022, Team of the Year in 2023 and Community of the Year in 2024.\n\nIn line with the introduction of these new categories, Time has expanded their annual Person of the Year private event to include and celebrate their recipients. The event, titled A Year in TIME beginning in 2023, has been held at Plaza Hotel since 2022.[145][146] A Year in TIME typically features interviews, speeches and performances from some of the categories' winners, as well as winners of other Time awards. Some of these are then posted to Time's official YouTube channel.\n\nAthlete of the Year [ edit ]\n\nAthlete of the Year was awarded in partnership with Oura Health in 2021[147] and LG in 2022.[148]\n\nBreakthrough of the Year [ edit ]\n\nIn 2022, this selection was called Breakthrough Artist of the Year.\n\nCEO of the Year [ edit ]\n\nIn 2019 and 2020, this selection was called Businessperson of the Year.\n\nCommunity of the Year [ edit ]\n\nCommunity of the Year is awarded in partnership with Land O'Lakes.\n\nYear Choice Notes 2024 People of Agriculture [ 159 ] Representing the global rural farming community\n\nDreamer of the Year [ edit ]\n\nDreamer of the Year is awarded in partnership with American Family Insurance.\n\nEntertainer of the Year [ edit ]\n\nIn 2022, Entertainer of the Year was awarded in partnership with Montblanc.[163]\n\nGuardians of the Year [ edit ]\n\nIn 2020, Guardians of the Year was awarded in partnership with Amazon.[167]\n\nHero(es) of the Year [ edit ]\n\nIn 2020, Heroes of the Year was awarded in partnership with State Farm.[170]\n\nIcon of the Year [ edit ]\n\nInnovator of the Year [ edit ]\n\nYear Choice Notes 2022 Gregory Robinson and the James Webb Space Telescope team [ 191 ] Robinson was the telescope's program director from 2018 to 2022.\n\nKid of the Year [ edit ]\n\nIn 2020 and 2021, Kid of the Year was awarded in partnership with Nickelodeon.\n\nTeam of the Year [ edit ]\n\nTeam of the Year is awarded in partnership with Smartsheet.\n\nYear Choice Notes Runners-up 2023 HP's Social Impact team [ 198 ] The team consists of Michele Malejki, Mariama Kabia, Anshu Grover, Ina Progonati, Stephanie Bormann and Julio Vera Barajas. 2 Pfizer's RSV vaccine leadership team\n\nSyngenta's Research & Development Team\n\n[ 199 ]\n\nOnline poll [ edit ]\n\nFrom 2010 to 2022, Time held an annual online poll for the readers to vote for who they believed to be the Person of the Year. While many mistakenly believed the winner of the poll to be the Person of the Year, the title, as mentioned above, is decided by the editors of Time.[200]\n\nAn online reader's choice poll was also held in 1998, with professional wrestler Mick Foley and murdered college student Matthew Shepard as the top vote-getters, although the final result is unknown.[214][74]\n\nSee also [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Haile_Selassie_Time_cover_1936.jpg/250px-Haile_Selassie_Time_cover_1936.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Bill_Clinton.jpg/250px-Bill_Clinton.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Lech_Wa%C5%82%C4%99sa_%282019%29%2C_FORUM_2000%2C_Prague_%282%29.jpg/250px-Lech_Wa%C5%82%C4%99sa_%282019%29%2C_FORUM_2000%2C_Prague_%282%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Peace_symbol_%28bold%29.svg/130px-Peace_symbol_%28bold%29.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/John_F._Kennedy%2C_White_House_color_photo_portrait.jpg/250px-John_F._Kennedy%2C_White_House_color_photo_portrait.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/King_Faisal_bin_Abdulaziz_%28cropped%29.jpg/250px-King_Faisal_bin_Abdulaziz_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Konrad-Adenauer-TIME-1954.jpg/250px-Konrad-Adenauer-TIME-1954.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/WW2_Liberation_of_France_Eisenhower_Portrait_%283x4_cropped%29.jpg/250px-WW2_Liberation_of_France_Eisenhower_Portrait_%283x4_cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Taylor_Swift_at_the_2023_MTV_Video_Music_Awards_%283%29.png/250px-Taylor_Swift_at_the_2023_MTV_Video_Music_Awards_%283%29.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/05/John_Sirica_c._1973.jpg/250px-John_Sirica_c._1973.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Man-of-the-Year-TIME-1951.jpg/250px-Man-of-the-Year-TIME-1951.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Conical_flask_teal.svg/130px-Conical_flask_teal.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/40/2ID_Recon_Baghdad.jpg/250px-2ID_Recon_Baghdad.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Volodymyr_Zelensky_2022_official_portrait_%28cropped%29.jpg/250px-Volodymyr_Zelensky_2022_official_portrait_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Andrew_Grove.jpg/250px-Andrew_Grove.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/TRUMAN_58-766-06_%28cropped%29.jpg/250px-TRUMAN_58-766-06_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/George-W-Bush.jpeg/250px-George-W-Bush.jpeg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Elon_Musk_Colorado_2022_%28cropped2%29.jpg/250px-Elon_Musk_Colorado_2022_%28cropped2%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Pierre_Laval-TIME-1932.jpg/250px-Pierre_Laval-TIME-1932.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/US_map-Central.png/250px-US_map-Central.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Angela_Merkel_Security_Conference_February_2015_%28cropped%29.jpg/250px-Angela_Merkel_Security_Conference_February_2015_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/GeorgeWBush_%281%29.jpg/250px-GeorgeWBush_%281%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Dwight_D._Eisenhower%2C_official_photo_portrait%2C_May_29%2C_1959.jpg/250px-Dwight_D._Eisenhower%2C_official_photo_portrait%2C_May_29%2C_1959.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Charles-DeGaulle-TIME-1959.jpg/250px-Charles-DeGaulle-TIME-1959.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Vincenzo_Laviosa_-_Duke_and_Duchess_of_Windsor_-_Google_Art_Project_%28cropped%29.jpg/250px-Vincenzo_Laviosa_-_Duke_and_Duchess_of_Windsor_-_Google_Art_Project_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/MeToo_logo.svg/250px-MeToo_logo.svg.png", "http://en.wikipedia.org/static/images/icons/wikipedia.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/56/PH1-RAPPLER-DSCF3442.jpg/250px-PH1-RAPPLER-DSCF3442.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Joseph_Stalin%2C_1950_%28cropped%29.jpg/250px-Joseph_Stalin%2C_1950_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/16/Official_Presidential_Portrait_of_President_Donald_J._Trump_%282025%29.jpg/250px-Official_Presidential_Portrait_of_President_Donald_J._Trump_%282025%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/15/Greta_Thunberg_at_the_Parliament_%2846705842745%29_%28cropped%29.jpg/250px-Greta_Thunberg_at_the_Parliament_%2846705842745%29_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Owen_D._Young_on_TIME_Magazine%2C_January_6%2C_1930.jpg/250px-Owen_D._Young_on_TIME_Magazine%2C_January_6%2C_1930.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Madame_Chiang_Kai-shek%2C_seated_portrait_%28cropped_3x4%29.jpg/250px-Madame_Chiang_Kai-shek%2C_seated_portrait_%28cropped_3x4%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Peter_Ueberroth_1985.jpg/250px-Peter_Ueberroth_1985.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Nikita-Khrushchev-TIME-1958.jpg/250px-Nikita-Khrushchev-TIME-1958.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Kenneth_W._Starr.jpg/250px-Kenneth_W._Starr.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Bono_singing_in_Indianapolis_on_Joshua_Tree_Tour_2017_9-10-17.jpg/250px-Bono_singing_in_Indianapolis_on_Joshua_Tree_Tour_2017_9-10-17.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/YuriAndropov1970.png/250px-YuriAndropov1970.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Deng_Xiaoping_at_the_arrival_ceremony_for_the_Vice_Premier_of_China_%28cropped%29.jpg/250px-Deng_Xiaoping_at_the_arrival_ceremony_for_the_Vice_Premier_of_China_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/29/1933_Time_Man_of_the_Year_cover_alt_2.jpg/250px-1933_Time_Man_of_the_Year_cover_alt_2.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Marcha_estudiantes_Chile.jpg/250px-Marcha_estudiantes_Chile.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Police_escort_detained_Reuters_journalist_Kyaw_Soe_Oo.jpg/250px-Police_escort_detained_Reuters_journalist_Kyaw_Soe_Oo.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Kamala_Harris_Vice_Presidential_Portrait_%28cropped%29.jpg/250px-Kamala_Harris_Vice_Presidential_Portrait_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Gandhi_Time_cover_1931.jpg/250px-Gandhi_Time_cover_1931.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Flag_of_Ukraine.svg/250px-Flag_of_Ukraine.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Charles_Lindbergh_Time_cover_1928.jpg/250px-Charles_Lindbergh_Time_cover_1928.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Jamal_Khashoggi_in_March_2018.jpg/250px-Jamal_Khashoggi_in_March_2018.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Whistle_icon.svg/250px-Whistle_icon.svg.png", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Apollo_8_Crewmembers_%284x5_cropped%29.jpg/250px-Apollo_8_Crewmembers_%284x5_cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Mr._Harlow_H._Curtice%2C_General_Manager._Buick_Motor_Division.jpg/250px-Mr._Harlow_H._Curtice%2C_General_Manager._Buick_Motor_Division.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Sir_Winston_Churchill_-_19086236948_%28cropped2%29.jpg/250px-Sir_Winston_Churchill_-_19086236948_%28cropped2%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Charles_Lindbergh_Time_cover_1928.jpg/960px-Charles_Lindbergh_Time_cover_1928.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Pope_Francis_Korea_Haemi_Castle_19_%28cropped%29.jpg/250px-Pope_Francis_Korea_Haemi_Castle_19_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Anwar_Sadat_cropped.jpg/250px-Anwar_Sadat_cropped.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Chiang_Kai-shek%EF%BC%88%E8%94%A3%E4%B8%AD%E6%AD%A3%EF%BC%89_%289to12%29.jpg/250px-Chiang_Kai-shek%EF%BC%88%E8%94%A3%E4%B8%AD%E6%AD%A3%EF%BC%89_%289to12%29.jpg", "http://en.wikipedia.org/static/images/footer/wikimedia.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Donald_Trump_official_portrait_%28cropped_2%29.jpg/250px-Donald_Trump_official_portrait_%28cropped_2%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/Harry_S_Truman%2C_bw_half-length_photo_portrait%2C_facing_front%2C_1945_%28cropped%29.jpg/250px-Harry_S_Truman%2C_bw_half-length_photo_portrait%2C_facing_front%2C_1945_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Corazon_Aquino_1986.jpg/250px-Corazon_Aquino_1986.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/RIAN_archive_850809_General_Secretary_of_the_CPSU_CC_M._Gorbachev_%28cropped%29.jpg/250px-RIAN_archive_850809_General_Secretary_of_the_CPSU_CC_M._Gorbachev_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Carter_cropped.jpg/250px-Carter_cropped.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/FDR_1944_Color_Portrait_%283x4_cropped%29.jpg/250px-FDR_1944_Color_Portrait_%283x4_cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/19/George_Catlett_Marshall%2C_general_of_the_US_army_%28cropped%29.jpg/250px-George_Catlett_Marshall%2C_general_of_the_US_army_%28cropped%29.jpg", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Bundesarchiv_B_145_Bild-F057884-0009%2C_Willy_Brandt.jpg/250px-Bundesarchiv_B_145_Bild-F057884-0009%2C_Willy_Brandt.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Portrait_of_Ruhollah_Khomeini.jpg/250px-Portrait_of_Ruhollah_Khomeini.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Ritratto_di_papa_Giovanni_Paolo_II_%281984%29.jpg/250px-Ritratto_di_papa_Giovanni_Paolo_II_%281984%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/PPE_Training_%282%29.jpg/250px-PPE_Training_%282%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/John_Foster_Dulles_Nov_49-cropped.jpg/250px-John_Foster_Dulles_Nov_49-cropped.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Sanco_8001.jpg/250px-Sanco_8001.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Pope_John_XXIII_-_Time_Magazine_Cover_-_January_4%2C_1963.jpg/250px-Pope_John_XXIII_-_Time_Magazine_Cover_-_January_4%2C_1963.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Obama_portrait_crop.jpg/250px-Obama_portrait_crop.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Ben_Bernanke_official_portrait.jpg/250px-Ben_Bernanke_official_portrait.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/Adolf_Hitler_cropped_restored.jpg/250px-Adolf_Hitler_cropped_restored.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/86/RichardNixoncrop.jpg/250px-RichardNixoncrop.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/2008-08-29_%D0%92%D0%BB%D0%B0%D0%B4%D0%B8%D0%BC%D0%B8%D1%80_%D0%9F%D1%83%D1%82%D0%B8%D0%BD_%284%29.jpeg/250px-2008-08-29_%D0%92%D0%BB%D0%B0%D0%B4%D0%B8%D0%BC%D0%B8%D1%80_%D0%9F%D1%83%D1%82%D0%B8%D0%BD_%284%29.jpeg", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/09/James_F._Byrnes_cph.3c32232.jpg/250px-James_F._Byrnes_cph.3c32232.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Franklin_D._Roosevelt_on_Time_cover_1933.webp/250px-Franklin_D._Roosevelt_on_Time_cover_1933.webp.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Jeff_Bezos_2004_%28cropped%29.jpg/130px-Jeff_Bezos_2004_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Gen_William_C_Westmoreland.jpg/250px-Gen_William_C_Westmoreland.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/37_Lyndon_Johnson_3x4.jpg/250px-37_Lyndon_Johnson_3x4.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/65/President_Barack_Obama_%28cropped%29_3.jpg/250px-President_Barack_Obama_%28cropped%29_3.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Mohammad_Mosaddegh_portrait.jpg/130px-Mohammad_Mosaddegh_portrait.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/David_Ho_portrait_%28cropped%29.JPG/250px-David_Ho_portrait_%28cropped%29.JPG", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Ted_Turner_April_1985_%28cropped%29.jpg/250px-Ted_Turner_April_1985_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/66/US_Birth_Rates.svg/250px-US_Birth_Rates.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Venus_symbol_%28heavy_pink%29.svg/130px-Venus_symbol_%28heavy_pink%29.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/George_H._W._Bush_presidential_portrait_%28cropped%29.jpg/250px-George_H._W._Bush_presidential_portrait_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Franklin_D._Roosevelt_Time_cover_1935.jpg/250px-Franklin_D._Roosevelt_Time_cover_1935.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Walter_Chysler_Time_cover_1929.webp/250px-Walter_Chysler_Time_cover_1929.webp.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Mark_Zuckerberg_at_the_37th_G8_Summit_in_Deauville_018_v1.jpg/250px-Mark_Zuckerberg_at_the_37th_G8_Summit_in_Deauville_018_v1.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Richard_Nixon_presidential_portrait_%281%29.jpg/250px-Richard_Nixon_presidential_portrait_%281%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Rudy_Giuliani_207-DP-8297B-DSC_0041.jpg/250px-Rudy_Giuliani_207-DP-8297B-DSC_0041.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/64/President_Biden_%282021%29.jpg/250px-President_Biden_%282021%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/35/TIME_Magazine_Cover_Hungarian_Patriot%2C_Man_of_the_Year.jpg/250px-TIME_Magazine_Cover_Hungarian_Patriot%2C_Man_of_the_Year.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/The_Blue_Marble_%28remastered%29.jpg/250px-The_Blue_Marble_%28remastered%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Queen_Elizabeth_II-TIME-1953.jpg/250px-Queen_Elizabeth_II-TIME-1953.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/97/Henry_A._Kissinger%2C_U.S._Secretary_of_State%2C_1973-1977.jpg/250px-Henry_A._Kissinger%2C_U.S._Secretary_of_State%2C_1973-1977.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Lyndon_B._Johnson_Dec._1967_%28cropped_3x4%29.jpg/250px-Lyndon_B._Johnson_Dec._1967_%28cropped_3x4%29.jpg", "http://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Courtney_Recker_2017_%28Unsplash%29.jpg/250px-Courtney_Recker_2017_%28Unsplash%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Bill_og_Melinda_Gates_2009-06-03_%28bilde_01%29.JPG/250px-Bill_og_Melinda_Gates_2009-06-03_%28bilde_01%29.JPG", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Martin_Luther_King%2C_Jr..jpg/250px-Martin_Luther_King%2C_Jr..jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Official_Portrait_of_President_Reagan_1981-cropped.jpg/250px-Official_Portrait_of_President_Reagan_1981-cropped.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Newt_Gingrich_by_Gage_Skidmore_3_%28cropped%29.jpg/250px-Newt_Gingrich_by_Gage_Skidmore_3_%28cropped%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Charles_Lindbergh_Time_cover_1928.jpg/960px-Charles_Lindbergh_Time_cover_1928.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Time_Person_of_the_Year", "title": "Time Person of the Year", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Charles_Lindbergh_Time_cover_1928.jpg/960px-Charles_Lindbergh_Time_cover_1928.jpg", "width": 912, "height": 1200}, "title": "Time Person of the Year - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}