{"url": "https://www.manchestereveningnews.co.uk/news/showbiz-news/harry-styles-dunkirk-one-direction--13400815", "text": "Could Harry Styles become Hollywood's next big movie star?\n\nCinema-goers are calling for the One Direction heartthrob to land more lead roles after his charismatic debut in Dunkirk\n\nHarry Styles is being tipped to be the next big thing in Hollywood after winning rave reviews for his role in the blockbuster Dunkirk.\n\n‌\n\n\n\nThe One Direction heartthrob from Holmes Chapel has had audiences shook with his acting talents in the war drama, with fans and new admirers keen to see his return to the big screen following a “remarkable” debut.\n\n‌\n\n\n\nWho would have thought the formerly floppy-haired Styles , who as a teenager had a Saturday job working in a bakery, would head onto the silver screen after X Factor boyband 1D announced their hiatus in 2015?\n\n‌\n\n\n\nDunkirk director Christopher Nolan has compared Styles landing the part in his World War Two epic to choosing the late Heath Ledger as the Joker The Dark Knight - and Ledger went on to win the posthumous Oscar for best supporting actor for his role in the Batman blockbuster.\n\nOne fan said: “Petition to have Harry Styles to star in the next big rom-com.” Another tweeted: “Calling all hollywood directors: give me a romantic comedy with Harry Styles.”\n\nView 11 Images Harry Styles at the premiere of Dunkirk (Image: Evan Agostini/Invision/AP)\n\n‌\n\n\n\nAnd @TerrelleGraham praised: “Got to give props to Harry Styles. He is great in #Dunkirk. Would like to see him tackle some more serious roles in the future.”\n\nSpeaking with Radio One presenter Nick Grimshaw, the former Holmes Chapel Comprehensive School pupil joked that for Dunkirk he used his experience playing Buzz Lightyear in a school production.\n\nAnd this was was the only previous acting experience he had to draw on to play Alex, a junior soldier desperately trying to get home as enemy forces close in on the beaches.\n\n‌\n\n\n\nContent cannot be displayed without consent\n\nAlso starring in Dunkirk, about the 1940 evacuation of Allied troops from the French shores, are acting heavyweights Tom Hardy, Mark Rylance, Kenneth Branagh and Cillian Murphy. And the charismatic Styles more than earns his place at the table, to the extent audiences could easily forget they were watching a popstar up their on the cinema screen.\n\nOne film-goer tweeted after a trip to the cinema: “Anyone realized how Alex from Dunkirk looks exactly like Harry Styles?”\n\n‌\n\n\n\nView 11 Images Harry Styles in the film Dunkirk\n\n‘Kingsley’ said: “Last 5 mins of #Dunkirk my friend leans over to me and goes “Is that Harry Styles?”\n\nAnd Daniel Reji commented: “Harry Styles had a remarkable debut as an actor in Dunkirk.”\n\n‌\n\n\n\nIn September Styles will kick off his sold-out world tour after his single Sign of the Times and and self-titled album were released to acclaim with comparisons drawn with Freddy Mercury and David Bowie’s Ziggy Stardust alter-ego. And he can now add ‘movie star’ to his CV.\n\nHere are other popstars who have made the switch to big screen:\n\nBeyoncé\n\n‌\n\n\n\nView 11 Images Beyonce makes movies too (Image: Kevin Winter/WireImage)\n\nQueen Bey makes movies for her own albums these days.\n\n‌\n\n\n\nBut the Work It Out singer had a turn in Austin Powers: Goldmember, which divided the critics, and she shone as Deena in the 2006 film Dreamgirls based on the story of the Supremes which saw Jennifer Hudson and Eddie Murphy win best supporting actress and actor gongs at the Oscars.\n\nMichael Jackson\n\nView 11 Images Michael Jackson was a Wiz on the big screen too (Image: AP Photo/Joerg Sarbach)\n\n‌\n\n\n\nThe King of Pop made a werewolf movie within a zombie film as the epic video for the 80s monster hit Thriller.\n\nAnd he packed devoted fans into cinemas for Moonwalker, which was a collection of short films about Jackson’s life as well an adventure film starring MJ.\n\n‌\n\n\n\nIn 1978 he had a starring role as The Scarecrow in The Wiz, a remake of one of his favourite films The Wizard of Oz co-starring Diana Ross as Dorothy.\n\nJustin Timberlake\n\nView 11 Images (Image: Invision)\n\n‌\n\n\n\nJT’s albums are pop and R&B perfection. But we have to wait while he heads off to make huge Hollywood films in between making music.\n\nLike Styles, Timberlake is a former boyband member with N’Sync and he has gone on to carve out a hugely successful career as a solo singer and as an actor. He played the romantic lead in Friends With Benefits with Mila Kunis and had a starring role in the Oscar-winning social network. Last year he lent his voice to the animated film Trolls, as well as providing the lead song Can’t Stop The Feeling!\n\n‌\n\n\n\nMadonna\n\nView 11 Images Madonna wowed in Evita (Image: PA)\n\n‌\n\n\n\nIt started well back in the 80s with her iconic role in Desperately Seeking Susan. But Shanghai Surprise with ex-husband Sean Penn, Who’s That Girl and Bloodhounds of Broadway flopped.\n\nShe was applauded for her performance as Breathless Mahoney in Warren Beatty’s film adaptation of Dick Tracy and captured hearts in the weepy A League of Their Own.\n\nThe True Blue-singing trooper won critical acclaim for her emotionally-charged lead role as Eva Perón in the musical biopic Evita.\n\n‌\n\n\n\nBut the 2002 film Swept Away, directed by her ex husband Guy Ritchie, was critically panned.\n\nWhitney Houston\n\nView 11 Images Kevin Costner and Whitney Houston in a publicity picture for the film The Bodyguard from 1992\n\n‌\n\n\n\nWhitney launched her acting career playing a megastar singer in The Bodyguard, which spawned one of the biggest selling soundtracks of all time including the record-breaking I Will Always Love You.\n\nShe went on to star in Waiting to Exhale and The Preacher’s Wife.\n\n‌\n\n\n\nEminem\n\nView 11 Images Eminem\n\n‌\n\n\n\nAmerican rapper Eminem, real name Marshall Mathers, showed off his acting chops in this 2002 film inspired by his real-life upbringing and attempts to launch a music career, co-starring Kim Basinger and the late Brittany Murphy.\n\nFilmed mostly on location in Detroit the film was both a critical success and Eminem won the Academy Award for Best Original Song for Lose Yourself.\n\nCher\n\n‌\n\n\n\nView 11 Images Cher won an Oscar for Moonstruck (Image: Getty Images)\n\nYou don’t get bigger than winning an Oscar and all-rounder Cher won the best actress gong for the romantic comedy Moonstruck in 1988.\n\n‌\n\n\n\nShe also gifted us with her role as a wacky mom in Mermaids in 1990 and the amazing Shoop Shoop Song (It’s In His Kiss) which seemed to be number one for an eternity.\n\nMariah Carey\n\nView 11 Images Mariah Carey was almost unrecognisable in Precious\n\n‌\n\n\n\nMariah played a young singer in the 2001 flop Glitter, alonside Burnage’s finest Max Beesley as DJ Julian ‘Dice’ Black who helps her in her music career.\n\nBut the Can’t Let Go hitmaker proved her acting worth in the gritty movie Precious and looked totally unlike her usual glamorous self as a makeup-free no-nonsense social worker.\n\n‌\n\n\n\nElvis Presley\n\nView 11 Images Elvis Presley was a king of the movies too\n\nArticle continues below\n\nAs well as being the King of Rock and Roll, ultimate entertainer Elvis made 31 films as an actor, including Love Me Tender, Viva Las Vegas, King Creole, GI Blues and Blue Hawaii.\n\nFans love his movies as much as they do his music.", "images": ["https://i2-prod.manchestereveningnews.co.uk/article13401126.ece/ALTERNATES/s615/JS120422379.jpg", "https://www.manchestereveningnews.co.uk/assets/men/logos/masthead-men-default.svg", "https://i2-prod.manchestereveningnews.co.uk/article13401117.ece/ALTERNATES/s615b/JS124704513.jpg", "https://i2-prod.manchestereveningnews.co.uk/article13400977.ece/ALTERNATES/s615b/JS125910133.jpg", "https://i2-prod.manchestereveningnews.co.uk/article13400957.ece/ALTERNATES/s1200/JS125805910.jpg", "https://i2-prod.manchestereveningnews.co.uk/article13401206.ece/ALTERNATES/s615/JS125812889.jpg", "https://www.manchestereveningnews.co.uk/nav-web-static/release-v41-14493b7c888038a7d89b99cb3a7937c2b71eaebe/public/logo-reach.png", "https://i2-prod.manchestereveningnews.co.uk/article13401057.ece/ALTERNATES/s615/JS35937133.jpg", "https://i2-prod.manchestereveningnews.co.uk/article9168069.ece/ALTERNATES/s615/Eminem.jpg", "https://i2-prod.manchestereveningnews.co.uk/article13400998.ece/ALTERNATES/s615/JS123060684.jpg", "https://i2-prod.manchestereveningnews.co.uk/article13401139.ece/ALTERNATES/s615b/CY28332591.jpg", "https://i2-prod.manchestereveningnews.co.uk/article12569534.ece/ALTERNATES/s615b/US-Presidential-election.jpg", "https://i2-prod.manchestereveningnews.co.uk/article13400957.ece/ALTERNATES/s615/JS125805910.jpg", "https://www.manchestereveningnews.co.uk/footer/ipso.svg", "https://i2-prod.manchestereveningnews.co.uk/article12590034.ece/ALTERNATES/s615b/Justin-Timberlake.jpg", "https://www.manchestereveningnews.co.uk/footer/trust-project.svg"], "top_img": "https://i2-prod.manchestereveningnews.co.uk/article13400957.ece/ALTERNATES/s1200/JS125805910.jpg", "keywords": [], "authors": ["Katie Fitzpatrick", "Updated"], "canonical_link": "https://www.manchestereveningnews.co.uk/news/showbiz-news/harry-styles-dunkirk-one-direction--13400815", "title": "Could Harry Styles become Hollywood's next big movie star?", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"page_id": 107654667059, "app_id": 226899387441465, "pages": 105073559550641}, "description": "Cinema-goers are calling for the One Direction heartthrob to land more lead roles after his charismatic debut in Dunkirk", "author": "Katie Fitzpatrick", "robots": "noarchive, max-image-preview:large", "Googlebot-News": "noarchive", "referrer": "unsafe-URL", "keywords": "BBC Radio 1, One Direction, X Factor, David Bowie, Harry Styles, John Terry, Justin Timberlake, Kenneth Branagh, Madonna, Mariah Carey, Oscar, The Oscars, Burnage", "news_keywords": "BBC Radio 1, One Direction, X Factor, David Bowie, Harry Styles, John Terry, Justin Timberlake, Kenneth Branagh, Madonna, Mariah Carey, Oscar, The Oscars, Burnage", "allowTaboolaDeepDive": "true", "vf": {"00000000-0000-4000-8000-14cc93248f99": "men-prod-13400815"}, "og": {"title": "Could Harry Styles become Hollywood's next big movie star?", "description": "Cinema-goers are calling for the One Direction heartthrob to land more lead roles after his charismatic debut in Dunkirk", "url": "http://www.manchestereveningnews.co.uk/news/showbiz-news/harry-styles-dunkirk-one-direction--13400815", "site_name": "Manchester Evening News", "locale": "en_GB", "image": "https://i2-prod.manchestereveningnews.co.uk/article13400957.ece/ALTERNATES/s1200/JS125805910.jpg", "type": "article"}, "article": {"published_time": "2017-07-30T09:12:29Z", "modified_time": "2017-07-30T09:12:41Z", "author": "https://www.facebook.com/CelebrityManchester", "section": "Celebs", "tag": "Burnage"}, "twitter": {"card": "summary_large_image", "site": "@MENNewsdesk", "creator": "@ShowbizKatieMEN", "title": "Could Harry Styles become Hollywood's next big movie star? - Manchester Evening News", "description": "Cinema-goers are calling for the One Direction heartthrob to land more lead roles after his charismatic debut in Dunkirk", "image": "https://i2-prod.manchestereveningnews.co.uk/article13400957.ece/ALTERNATES/s1200/JS125805910.jpg"}}, "movies": [], "publish_date": 1501405949.0, "source": "https://www.manchestereveningnews.co.uk", "summary": ""}