{"url": "https://www.thedailybeast.com/taylor-swift-transforms-into-a-nude-cyborg-in-ready-for-it-we-are-so-not-ready", "text": "In August, Taylor Swift released a series of blurry, pseudo-artsy snakes on her social media. As fans struggled to find meaning in this serpentine imagery Swift upped the ante, sharing a promo image for her new album, Reputation—a sultry, black and white portrait that managed to beautifully capture all the angst and font-play of a middle school computer class project. While Swift gets a solid B/B+ in graphic design, her ability to dominate the national conversation—and in the midst of a solar eclipse, no less!—is unparalleled. With some grainy reptile footage and a “Fake News” narrative, Swift ushered in the next stage of her controversial career.\n\nWhile Reputation isn’t dropping until November, it feels like everything there is to say about TayTay has already been said. The new Taylor Swift era has been described as Trumpian, petty, self-aware, self-obsessed, aggressively bad, and not as good as Carly Rae Jepsen. Turns out, Taylor Swift doesn’t need to actually put out good pop music to stay on top; her new strategy appears to be generating buzz through diss tracks and coded lyrics while padding her dream wedding fund with overpriced merch and corporate partnerships. Who needs to write a danceable chorus when you can just put your face on a bunch of UPS trucks? Delivering packages is the new delivering hits.\n\nTake “Look What You Made Me Do,” the first single off of Reputation, which effectively set the tone for Swift’s new era. Musically, “Look What You Made Me Do” is…not good. But no one cares, since the track is chock full of not-so-subtle jabs at Swift’s uber-famous enemies.\n\nAfter listening to the song ten times and then once backwards combing for receipts, fans were invited to go further down the conspiracy rabbit hole with the Easter egg-heavy “Look What You Made Me Do” music video. Like Arya Stark without rhythm, Swift brags that “I’ve got a list of names and yours is in red, underlined.” She bathes in a tub of diamonds (A dig at the Kim Kardashian jewel theft?), shades Kanye’s “tilted stage,” and even gets a few insults in at the past iterations of Taylor Swift. While Swift’s meta-commentary was clearly meant to show that she’s in on the joke, it ends up underlining the pop star’s lack of self-awareness. Laughing about your reputation for playing the victim isn’t believable when you’re still complaining about all the people who are mean to you. Releasing this diss track as her first single proved that Taylor Swift still sees herself as the injured party, despite the fact that she is quite literally on the attack.\n\nTaylor Swift’s failure to understand why people don’t like Taylor Swift is also apparent in her latest music video, “…Ready For It?” The majority of the Joseph Kahn-directed joint is spent watching a cyborg Taylor Swift stare longingly at a second cyborg Taylor Swift, which sounds about right. The main message of the music video is that Taylor Swift knows that we think she’s a robot; the second, subtler takeaway is that Taylor Swift definitely saw Ghost in the Shell. Unlike the genuinely clever “Blank Space,” Swift’s seemingly satirical lyrics fall flat here, as she ineffectively straddles the line between a scary-sincere love song and a parody of a Taylor Swift single.\n\nWhen Swift sings, “Younger than my exes, but he act like such a man, so / I see nothing better, I keep him forever / Like a vendetta-ta,” it seems obvious that she’s mocking her reputation as a cold, ruthless serial monogamist with a Rhode Island basement full of future boyfriends. Then again, lyrics like, “Knew I was a robber first time that he saw me / Stealing hearts and running off and never sayin’ sorry / But if I’m a thief, then he can join the heist, and / We’ll move to an island, and / And he can be my jailer, Burton to this Taylor” might actually be sincere. For all of her purported self-awareness, Swift is still writing corny lyrics about an interchangeable white boy who she’ll probably break up with come Christmas. In other words, this is the same old Taylor Swift—just with a higher visual effects budget.\n\nAgain, the video seems to be taking a good deal of visual cues from Ghost in the Shell, specifically Major Motoko’s “full-body prosthesis”—which is fine since white people have already ruined that. A hooded, Hot Topic Taylor cyborg-struts through a gritty sci-fi garage, where she encounters her near-naked cyborg doppelgänger. The two Taylors face off across an invisible barrier. At one point, a cyborg Taylor appears to be channeling her past selves, sitting on top of the white horse from Fearless and/or her “Blank Space” music video—Taylor Swift’s old horse can’t come to the phone right now, ‘cause it’s a reanimated robot corpse.\n\nThe idea that the innocent, heartsick songstress from the Fearless era is now a ruthless cyborg girl on a creepy robot horse is very 2017. “…Ready For It?” is really just a music video for anyone who feels like a cold, hollowed-out shell of their former self, just going through the motions.", "images": ["https://www.thedailybeast.com/pf/resources/svgs/social-logos/fb.svg?d=342", "https://www.thedailybeast.com/pf/resources/svgs/social-logos/email-icon.svg?d=342", "https://static.themebuilder.aws.arc.pub/thedailybeast/1741381130319.png", "https://www.thedailybeast.com/pf/resources/images/obsessed-header-logo-h-2.png?d=342", "https://www.thedailybeast.com/resizer/v2/Q26RG6FW7ROJFJFUTWJXYHQA7U.png?smart=true&auth=0b3c5013899315a25e681fe13173c616d86efbe42a7b7b49abe5ef2d9bc7e88f&width=969&height=545", "https://www.thedailybeast.com/resizer/v2/NHKXP4MZAVE23CPMPZRGAKWUS4.jpg?smart=true&auth=197ab6390b5883b95c9ebad436bcf0add7ea8c8d89109c63bc6c120ce7e5fc67&width=1440&height=1080", "https://www.thedailybeast.com/resizer/v2/A63MWLYCCFHBPHOWMDSMB2AC34.jpg?smart=true&auth=e6e0d7b78502b822266b1e2ab946831e823f84ee61b3369b9a9446f43ee046eb&width=1440&height=1080", "https://www.thedailybeast.com/resizer/v2/AU37OZYATNECPJJOTM65FJT3LQ.png?smart=true&auth=c921d820cc8119838347e4bb81883b36692ed42e6469e37bdb9bdae8df9f629f&width=1440&height=1080", "https://www.thedailybeast.com/pf/resources/svgs/badges/app_store.svg?d=342", "https://www.thedailybeast.com/pf/resources/svgs/badges/google_play.svg?d=342", "https://www.thedailybeast.com/pf/resources/svgs/social-logos/twitter-icon.svg?d=342", "https://www.thedailybeast.com/pf/resources/svgs/social-logos/reddit.svg?d=342", "https://www.thedailybeast.com/resizer/v2/DPXPPUYZ6JHF7DSLHPW34F25PI.jpg?smart=true&auth=5b1083923ea9a1017cc738ca599056b16bb8f485435e3b7ae3fbbc7936ba2181&width=1440&height=1080", "https://www.thedailybeast.com/resizer/v2/TVEQLZCSIJHF5MHTBSX5743D5I.png?smart=true&auth=8ec6be7b16209630ff84f12fdb29fa234015ab297bbce0cad3678062d1edd565&width=1440&height=1080", "https://cloudfront-us-east-1.images.arcpublishing.com/thedailybeast/V6FGHJOZ3JI3VLHO6ESYUVWXCQ.jpg", "https://www.thedailybeast.com/resizer/v2/Q26RG6FW7ROJFJFUTWJXYHQA7U.png?smart=true&auth=0b3c5013899315a25e681fe13173c616d86efbe42a7b7b49abe5ef2d9bc7e88f&width=1200&height=630"], "top_img": "https://www.thedailybeast.com/resizer/v2/Q26RG6FW7ROJFJFUTWJXYHQA7U.png?smart=true&auth=0b3c5013899315a25e681fe13173c616d86efbe42a7b7b49abe5ef2d9bc7e88f&width=1200&height=630", "keywords": [], "authors": ["Amy Zimmerman", "Entertainment Reporter", "Got A Tip", "Send It To The Daily Beast", "Ethan Cotler", "Catherine Bouris", "Leigh Kimmins", "Sarah Ewall-Wice", "Laura Esposito", "Harry Thompson"], "canonical_link": "https://www.thedailybeast.com/taylor-swift-transforms-into-a-nude-cyborg-in-ready-for-it-we-are-so-not-ready/", "title": "Taylor Swift Transforms Into a Nude Cyborg in ‘...Ready for It?’ We Are So Not Ready.", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "The pop dynamo’s latest music video is a head-scratching take on Scarlett Johansson’s dreadful ‘Ghost in the Shell’ remake.", "twitter": {"description": "The pop dynamo’s latest music video is a head-scratching take on Scarlett Johansson’s dreadful ‘Ghost in the Shell’ remake.", "title": "Taylor Swift Transforms Into a Nude Cyborg", "image": {"identifier": "https://www.thedailybeast.com/resizer/v2/Q26RG6FW7ROJFJFUTWJXYHQA7U.png?smart=true&auth=0b3c5013899315a25e681fe13173c616d86efbe42a7b7b49abe5ef2d9bc7e88f&width=1200&height=630", "alt": "Screen_Shot_2017-10-27_at_2.05.06_PM_smr8ga"}, "site": "@https://twitter.com/thedailybeast", "card": "summary_large_image"}, "og": {"description": "The pop dynamo’s latest music video is a head-scratching take on Scarlett Johansson’s dreadful ‘Ghost in the Shell’ remake.", "title": "Taylor Swift Transforms Into a Nude Cyborg", "image": {"identifier": "https://www.thedailybeast.com/resizer/v2/Q26RG6FW7ROJFJFUTWJXYHQA7U.png?smart=true&auth=0b3c5013899315a25e681fe13173c616d86efbe42a7b7b49abe5ef2d9bc7e88f&width=1200&height=630", "alt": "Screen_Shot_2017-10-27_at_2.05.06_PM_smr8ga"}, "type": "article", "site_name": "The Daily Beast", "url": "https://www.thedailybeast.com/taylor-swift-transforms-into-a-nude-cyborg-in-ready-for-it-we-are-so-not-ready/"}, "keywords": "taylor-swift,nudity,beyonce,music-video,scarlett-johansson,science-fiction", "robots": "max-image-preview:large", "loadforge-site-verification": "3ac1d76b00b152231dc1bef253b8d571e663ffa9b4826b38646ee6d4a23225d2a762aac1254120868ebecd9c4666ad563ef03b99a25d3966cba08ee2380aa43b"}, "movies": ["https://www.youtube.com/embed/3tmd-ClpJxA", "https://www.youtube.com/embed/wIft-t-MQuE"], "publish_date": null, "source": "https://www.thedailybeast.com", "summary": ""}