{"url": "https://www.mirror.co.uk/3am/celebrity-news/gal-gadot-says-born-play-10573332", "text": "EXCLUSIVE: Wonder Woman Gal Gadot's little girl had secret role in film - but nobody noticed\n\nThe Israeli actress opens up on filming while pregnant, gaining 17Ibs of muscle and meeting first Wonder Woman Lynda Carter\n\nView 7 Images Wonder Woman star Gal Gadot says her husband is her biggest fan as she slips into iconic role (Image: Warner Bros)\n\nGal Gadot really can do it all as Wonder Woman . She rides horses, wields a whopping sword and saves the world – and her man – while wearing a ­literally breathtaking outfit.\n\n‌\n\n\n\nBut what makes her performance truly superhuman is that Gal actually filmed some of those scenes while pregnant , so her newborn daughter Maya also got to star. And for a film oozing girl power, this is particularly apt.\n\n‌\n\n\n\nGal, 32, who also has daughter Alma, five, says: “I was pregnant and showing for some of the additional scenes we shot but they did some clever stuff with special effects to hide my bump.\n\n‌\n\n\n\n“It didn’t hinder the process, I could still do the action stuff and the physical scenes. And now, it’s nice to look at the movie and know that Maya is in the movie with me in some way. I love that.\n\n“She has an entry on movie database IMDB. It took me years to get mine.”\n\nView 7 Images Gal, here with co-star Chris Pine, said she had to gain 17Ibs of muscle to take on the role of Wonder Woman (Image: Warner Bros)\n\n‌\n\n\n\nView 7 Images Gal Gadot was pregnant with her second daughter but still managed to film her scenes\n\nThe Israeli actress is now on her way to being a household name after the movie opened on Friday – and her CV reads like that of a real wonder woman.\n\nShe has served in the military, competed in Miss Universe and rides a motorbike. She also juggled her intense training with caring for Alma on set. Some men might find that intimidating, but not Gal’s husband of eight years, property developer Yaron Versano, 39.\n\n‌\n\n\n\n“He’s super-happy to be married to Wonder Woman,” she laughs. “He’s my biggest fan. The only thing that changed is he has started training more because I became so strong!”\n\nGal first slipped on Wonder Woman’s Bracelets of Submission in last year’s Batman v Superman. But her standalone movie is now smashing a fair few glass ceilings.\n\nWONDER WOMAN Final Trailer\n\n‌\n\n\n\nWith Monster’s Patty Jenkins at the helm, it’s the first superhero movie this millennium directed by a woman and the biggest opening weekend box office taking for a female director ever. So far it has raked in £172million.\n\nAnd Gal will soon reprise the role again for Justice League. It is out in November and reunites her with Ben Affleck’s Batman and Henry Cavill as Superman.\n\nThe star, who was born and raised in Rosh HaAyin, Israel, is proud to be a female superhero that her daughters and girls everywhere can look up to.\n\n‌\n\n\n\nGal says: “I feel I was born to play Wonder Woman. Boys have always had a figure to look up to, whether it’s Superman, Batman or Spider-Man.\n\n“For girls it was always the princess being saved.\n\n“Now we have Wonder Woman – she’s fearless, proactive, she believes in herself and she believes she can do everything. That’s a true woman for me.”\n\n‌\n\n\n\nLynda Carter looks AMAZING at LA premiere of Wonder Woman READ MORE :\n\nView 7 Images The Israeli actress says her husband Yaron Versano loves that she is Wonder Woman\n\nView 7 Images The former model says she is proud to be a role model for her girls Alma and Maya\n\nIt could all have been so different if Gal landed the first role she auditioned for – as a Bond girl opposite Daniel Craig in Quantum of Solace. Bond girls may be iconic, but few are strong female role models.\n\n‌\n\n\n\nBorn to teacher Irit and engineer Michael, Gal became a school basketball star after shooting up to 5ft 10in.\n\nAs is normal in Israel, she was called for military service, aged 20, and spent two years as a combat trainer.\n\nShe then went on to study for a degree in law and international relations, but having done beauty pageants on the side, she was snapped by a modelling agency and spotted by a British casting director who asked her to try out for Bond.\n\n‌\n\n\n\nGal says: “That was my very first audition, I wasn’t even an actress. But everything happens for a reason.\n\nView 7 Images She takes on the role famously played by Lydna Carter (Image: Moviepix)\n\n“Going through the entire process only for it not to work out, made me realise that I wanted to be an actress.”\n\n‌\n\n\n\nHer big break then came as she moved to the US and landed a recurring role as sharp-shooting Gisele Yasharin in the Fast and Furious series.\n\nBut it will be playing Wonder Woman, alias Diana Prince, that will make her a star. And while her military history helped her get in shape for playing the Amazonian demigoddess, it was not easy.\n\nShe spent months eating pasta and salmon to fuel a gruelling training regime to gain 17lb of muscle.\n\n‌\n\n\n\nView 7 Images Gal met the TV icon at the Wonder Woman premiere (Image: Getty)\n\nThe actress says: “I couldn’t even do one pull-up when I started.\n\n“I had a tent in the studio and every time we had a break I went training, so I was training all the time.” She also had to adapt to the glamorous but skin-tight costumes.\n\n‌\n\n\n\nGal says: “I love the costume, I think it’s super-strong and sexy at the same time. But the first time in the costume it was so tight I could not breathe.\n\n“They made things better this time. It was pretty comfortable, apart from the cold. We shot in England in the middle of winter, wearing not much. It was so cold I could hardly talk.”\n\nGal wasn’t even born when Lynda Carter, now 65, first played Wonder Woman in the hugely popular 1970s ­television series.\n\n‌\n\n\n\nBut this made her less nervous when she met her in New York last October to ­celebrate Wonder Woman being made a United Nations Honorary Ambassador for the Empowerment of Women and Girls.\n\nIt was an instant friendship.\n\nGal laughs: “From the very first moment I met her I totally understood why she was the first Wonder Woman. She has such a special energy and presence. She’s funny, and smart, and witty, and sassy, and she’s amazing.”\n\n‌\n\n\n\nComic book creation inspired by scientist's two lovers\n\nWonder Woman was created by the renowned psychologist and inventor William Moulton Marston.\n\nMarston believed Superman and Batman were sexist, so when he was asked by comic book creator Max Gaines to consult on a new character, he decided it should be a female superhero. He asked to write it himself and the result was Wonder Woman, which first appeared in 1941.\n\n‌\n\n\n\nMarston had two inspirations for Diana Prince. The first was his feminist wife Elizabeth Holloway Marston, a lawyer and fellow psychologist whocollaborated with him on his inventions.\n\nThe second was his mistress Olive Byrne, who actually lived with him and his wife in a bizarre love triangle.\n\nShe agreed to stay home and raise Elizabeth’s two children while she went to work – and also had two of her own with Marston.\n\nArticle continues below\n\nAs Olive had no wedding ring, she wore large bronze bracelets instead – just like Wonder Woman’s.\n\nAfter Marston died at the age of 54, the two women lived together in New York for the rest of their lives.", "images": ["https://i2-prod.mirror.co.uk/article10571545.ece/ALTERNATES/s615b/PROD-Wonder-Woman.jpg", "https://i2-prod.mirror.co.uk/article10571544.ece/ALTERNATES/s615b/PROD-Gal-Gadot-and-Lynda-Carter.jpg", "https://www.mirror.co.uk/footer/ipso.svg", "https://www.mirror.co.uk/footer/trust-project.svg", "https://i2-prod.mirror.co.uk/article10571549.ece/ALTERNATES/s615/PROD-Wonder-Woman.jpg", "https://www.mirror.co.uk/nav-web-static/release-v41-14493b7c888038a7d89b99cb3a7937c2b71eaebe/public/logo-reach.png", "https://i2-prod.mirror.co.uk/article10571543.ece/ALTERNATES/s615b/PROD-Screen-Shot-2017-05-26-at-142409JPG.jpg", "https://i2-prod.mirror.co.uk/article10571549.ece/ALTERNATES/s1200/PROD-Wonder-Woman.jpg", "https://i2-prod.mirror.co.uk/article10571546.ece/ALTERNATES/s615b/PROD-Screen-Shot-2017-05-26-at-150101JPG.jpg", "https://www.mirror.co.uk/assets/mirror/logos/masthead-mirror-default.svg", "https://i2-prod.mirror.co.uk/article10571548.ece/ALTERNATES/s615b/PROD-Wonder-Woman.jpg", "https://i2-prod.mirror.co.uk/article10571542.ece/ALTERNATES/s615b/PROD-Screen-Shot-2017-05-26-at-150154JPG.jpg", "http://brightcove01.brightcove.com/24/4221396001/201705/3228/4221396001_5452816206001_5452808851001-vs.jpg?pubId=4221396001"], "top_img": "https://i2-prod.mirror.co.uk/article10571549.ece/ALTERNATES/s1200/PROD-Wonder-Woman.jpg", "keywords": [], "authors": ["Warren Manger", "Updated"], "canonical_link": "https://www.mirror.co.uk/3am/celebrity-news/gal-gadot-says-born-play-10573332", "title": "Wonder Woman Gal Gadot's little girl had secret role in film", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"page_id": 6149699161, "app_id": 123792601022133, "pages": 1814357575554395}, "description": "The Israeli actress opens up on filming while pregnant, gaining 17Ibs of muscle and meeting first Wonder Woman Lynda Carter", "author": "Warren Manger", "robots": "noarchive, max-image-preview:large", "Googlebot-News": "noarchive", "referrer": "unsafe-URL", "keywords": "Gal Gadot, Lynda Carter, Batman v Superman, Wonder Woman, Pregnancy, Films", "news_keywords": "Gal Gadot, Lynda Carter, Batman v Superman, Wonder Woman, Pregnancy, Films", "allowTaboolaDeepDive": "true", "vf": {"00000000-0000-4000-8000-67e599051dc3": "mirror-prod-10573332"}, "og": {"title": "Wonder Woman's little girl had secret role in film - and nobody noticed", "description": "The Israeli actress opens up on filming while pregnant, gaining 17Ibs of muscle and meeting first Wonder Woman Lynda Carter", "url": "http://www.mirror.co.uk/3am/celebrity-news/gal-gadot-says-born-play-10573332", "site_name": "Daily Mirror", "locale": "en_GB", "image": "https://i2-prod.mirror.co.uk/article10571549.ece/ALTERNATES/s1200/PROD-Wonder-Woman.jpg", "type": "article"}, "article": {"published_time": "2017-06-06T20:48:41Z", "modified_time": "2017-06-07T08:25:32Z", "author": "https://www.mirror.co.uk/authors/warren-manger/", "section": "Celebrity News", "tag": "Films"}, "twitter": {"card": "summary_large_image", "site": "@DailyMirror", "creator": "@warrenmanger", "title": "Wonder Woman Gal Gadot's little girl had secret role in film - but nobody noticed - The Mirror", "description": "The Israeli actress opens up on filming while pregnant, gaining 17Ibs of muscle and meeting first Wonder Woman Lynda Carter", "image": "https://i2-prod.mirror.co.uk/article10571549.ece/ALTERNATES/s1200/PROD-Wonder-Woman.jpg"}}, "movies": [], "publish_date": 1496782121.0, "source": "https://www.mirror.co.uk", "summary": ""}