{"url": "https://www.washingtonblade.com/2018/04/25/disney-debuts-rainbow-mickey-mouse-ears-pride-month/", "text": "‘A Case for the Existence of God’\n\nThrough Dec. 7\n\nMosaic Theater Company at Atlas Performing Arts Center\n\n1333 H St,, N.E.\n\nTickets: $42- $56 (discounts available)\n\nMosaictheater.org\n\nWith each new work, Samuel D. Hunter has become more interested in “big ideas thriving in small containers.” Increasingly, he likes to write plays with very few characters and simple sets.\n\nHis 2022 two-person play, “A Case for the Existence of God,” (now running at Mosaic Theater Company) is one of these minimal pieces. “Audiences might come in expecting a theological debate set in the Vatican, but instead it’s two guys sitting in a cubicle discussing terms on a bank loan,” says Hunter (who goes by Sam).\n\nLike many of his plays, this award-winning work unfolds in rural Idaho, where Hunter was raised. Two men, one gay, the other straight (here played by local out actors Jaysen Wright and Lee Osorio, respectively), bond over financial insecurity and the joys and challenges of single fatherhood.\n\nHis newest success is similarly reduced. Touted as Hunter’s long-awaited Broadway debut, “Little Bear Ridge Road” features Laurie Metcalf as Sarah and Micah Stock as Ethan, Sarah’s estranged gay nephew who returns to Idaho from Seattle to settle his late father’s estate. At 90 minutes, the play’s cast is small and the setting consists only of a reclining couch in a dark void.\n\n“I was very content to be making theater off-Broadway. It’s where most of my favorite plays live.” However, Hunter, 44, does admit to feeling validated: “Over the years there’s been this notion that my plays are too small or too Idaho for Broadway. I feel that’s misguided, so now with my play at the Booth Theatre, my favorite Broadway house, it kind of proves that.”\n\nWith “smaller” plays not necessarily the rage on Broadway, he’s pleased that he made it there without compromising the kind of plays he likes to write.\n\nHunter first spoke with The Blade in 2011 when his “A Bright Day in Boise” made its area premiere at Woolly Mammoth Theatre. At the time, he was still described as an up-and-coming playwright though he’d already nabbed an Obie for this dark comedy about seeking Rapture in an Idaho Hobby Lobby.\n\nIn 2015, his “The Whale,” played at Rep Stage starring out actor Michael Russotto as Charlie, a morbidly obese gay English teacher struggling with depression. Hunter wrote the screenplay for the subsequent 2022 film which garnered an Oscar for actor Brendan Frazier.\n\nThe year leading up to the Academy Awards ceremony was filled with travel, press, and festivals. It was a heady time. Because of the success of the film there are a lot of non-English language productions of “The Whale” taking place all over the world.\n\n“I don’t see them all,” says Hunter. “When I was invited to Rio de Janeiro to see the Portuguese language premiere, I went. That wasn’t a hard thing to say yes to.”\n\nAnd then, in the middle of the film hoopla, says Hunter, director Joe Mantello and Laurie (Metcalf) approached him about writing a play for them to do at Steppenwolf Theatre in Chicago before it moved to Broadway. He’d never met either of them, and they gave me carte blanche.\n\nEarly in his career, Hunter didn’t write gay characters, but after meeting his husband in grad school at the University of Iowa that changed, he began to explore that part of his life in his plays, including splashes of himself in his queer characters without making it autobiographical.\n\nHe says, “Whether it’s myself or other people, I’ve never wholesale lifted a character or story from real life and plopped it in a play. I need to breathing room to figure out characters on their own terms. It wouldn’t be fair to ask an actor to play me.”\n\nHis queer characters made his plays more artistically successful, adds Hunter. “I started putting something of myself on the line. For whatever reason, and it was probably internalized homophobia, I had been holding back.”\n\nThough his work is personal, once he hands it over for production, it quickly becomes collaborative, which is the reason he prefers plays compared to other forms of writing.\n\n“There’s a certain amount of detachment. I become just another member of the team that’s servicing the story. There’s a joy in that.”\n\nHunter is married to influential dramaturg John Baker. They live in New York City with their little girl, and two dogs. As a dad, Hunter believes despite what’s happening in the world, it’s your job to be hopeful.\n\n“Hope is the harder choice to make. I do it not only for my daughter but because cynicism masquerades as intelligence which I find lazy. Having hope is the better way to live.”", "images": ["data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20800%2073'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20400%20240'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201%201'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201200%20800'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20360%20240'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20460%20470'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20235%20240'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20361%20240'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201200%20798'%3E%3C/svg%3E", "https://www.washingtonblade.com/content/files/2018/04/Mickey_Mouse_Pride_Ears_Screenshot_460_by_470.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201200%201159'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20400%20221'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%2080%2080'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201200%20799'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20600%20400'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201200%201257'%3E%3C/svg%3E"], "top_img": "https://www.washingtonblade.com/content/files/2018/04/Mickey_Mouse_Pride_Ears_Screenshot_460_by_470.jpg", "keywords": [], "authors": ["Mariah Cooper", "Michael Key", "Patrick Folliard", "Terri Schlichenmeyer"], "canonical_link": "https://www.washingtonblade.com/2018/04/25/disney-debuts-rainbow-mickey-mouse-ears-pride-month/", "title": "Disney debuts gay pride Mickey Mouse ears", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0, user-scalable=no", "og": {"type": "article", "image": "http://www.washingtonblade.com/content/files/2018/04/Mickey_Mouse_Pride_Ears_Screenshot_600_by_400.jpg", "url": "https://www.washingtonblade.com/2018/04/25/disney-debuts-rainbow-mickey-mouse-ears-pride-month/", "title": "Disney debuts gay pride Mickey Mouse ears", "description": "Disney appears to be gearing up for Pride month with the debut of rainbow-colored Mickey Mouse ears available for purchase at its theme parks.", "locale": "en_US", "site_name": "Washington Blade: LGBTQ News, Politics, LGBTQ Rights, Gay News"}, "twitter": {"image": "https://www.washingtonblade.com/content/files/2018/04/Mickey_Mouse_Pride_Ears_Screenshot_460_by_470.jpg", "card": "summary_large_image", "url": "https://www.washingtonblade.com/2018/04/25/disney-debuts-rainbow-mickey-mouse-ears-pride-month/", "title": "Disney debuts gay pride Mickey Mouse ears", "description": "the hats are on sale at in-park", "creator": "@WashBlade", "site": "@WashBlade", "label1": "Written by", "data1": "Mariah Cooper", "label2": "Est. reading time", "data2": "1 minute"}, "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Disney appears to be gearing up for Pride month with the debut of rainbow-colored Mickey Mouse ears available for purchase at its theme parks.", "article": {"publisher": "http://www.facebook.com/WashingtonBlade", "published_time": "2018-04-25T17:39:58+00:00", "modified_time": "2018-04-25T17:40:25+00:00"}, "author": "Mariah Cooper", "generator": "WP Font Awesome Settings v1.1.10"}, "movies": [], "publish_date": 1524628800.0, "source": "https://www.washingtonblade.com", "summary": ""}