{"url": "en.wikipedia.org/wiki/Ocean%27s_8", "text": "2018 film by Gary Ross\n\nOcean's Eight (stylized as Ocean's 8) is a 2018 American heist comedy film directed by Gary Ross and written by Ross and Olivia Milch. A spin-off of Steven Soderbergh's Ocean's trilogy, it is the fourth installment in the Ocean's franchise. The film features an ensemble cast including Sandra Bullock, Cate Blanchett, Anne Hathaway, Mindy Kaling, Sarah Paulson, Awkwafina, Rihanna, and Helena Bonham Carter.\n\nThe plot follows Debbie Ocean, the sister of Danny Ocean, who assembles a team of women to orchestrate an elaborate heist at the annual Met Gala at the Metropolitan Museum of Art in New York City.\n\nThe film premiered at Alice Tully Hall on June 5, 2018, and was released theatrically in the United States on June 8, 2018, by Warner Bros. Pictures—exactly eleven years after the release of Ocean's Thirteen (2007). It received generally positive reviews from critics, who praised the ensemble cast and stylish direction. A commercial success, the film grossed $298 million worldwide against a production budget of approximately $70 million.\n\nPlot [ edit ]\n\nNewly paroled con artist Debbie Ocean, the younger sister of Danny Ocean, reunites with her former partner Lou Miller to plan an ambitious new heist. The target is the Toussaint, a $150 million diamond necklace owned by Cartier, which Debbie intends to steal during the upcoming Met Gala at the Metropolitan Museum of Art in NYC.\n\nTo execute the plan, Debbie and Lou assemble a team of specialists: Rose Weil, a struggling fashion designer facing IRS debt; Amita, a skilled jeweler seeking independence from her overbearing mother; Nine Ball, a proficient hacker; Constance, a street hustler and pickpocket; and Tammy, a suburban mother who fences stolen goods.\n\nThe plan hinges on convincing actress Daphne Kluger, a prominent guest at the Gala, to wear the Toussaint so the team can manipulate its access. Rose is hired as Daphne's stylist and, along with Amita, scans the necklace at Cartier to create a cubic zirconia replica. Tammy secures a temporary position at Vogue to gain access to the guest list, while Lou infiltrates the event as a nutritionist. Nine Ball works to create a temporary blind spot in the museum's security system.\n\nDebbie, seeking personal closure, manipulates Daphne into inviting Claude Becker—an art dealer whose betrayal led to Debbie's incarceration—as her date to the Gala. Lou confronts Debbie about risking the heist for revenge, but Debbie reassures her that it will not jeopardize the plan.\n\nOn the night of the Gala, Daphne becomes ill after consuming spiked soup, prompting her to rush to the bathroom. As Cartier's male guards wait outside, Constance removes the necklace unnoticed and passes it to Amita, who quickly disassembles it into smaller pieces.\n\nMeanwhile, Tammy \"discovers\" the replica necklace just in time to avert suspicion. As the event is locked down and searched, members of the team smuggle the real necklace fragments out as smaller pieces while Debbie plants one piece on Becker to frame him.\n\nDaphne later reveals she has deduced the heist and asks to join the group in exchange for keeping quiet. Debbie agrees, so Daphne becomes the eighth member of the team. Insurance investigator John Frazier, who has prior history with the Ocean family, is assigned to the case.\n\nAlthough John suspects Debbie, her presence on security footage provides a solid alibi. She cooperates by arranging for Becker to be implicated; Daphne supplies a photo, and actresses posing as elderly socialites sell some of the jewels, depositing the money into an account in Becker's name. He is arrested.\n\nAs the crew celebrates their success, Lou reveals an additional layer of the heist: during the Gala lockdown, she and The Amazing Yen, a former associate of Danny's, stole a display of royal jewels on loan to the museum. They then replaced them with replicas crafted by Amita. The value of the jewels exceeds that of the Toussaint, increasing the crew's payout significantly.\n\nWith their shares secured, each member goes her own way: Amita moves to Paris, Rose opens her own store, Constance becomes a YouTuber, Tammy expands her fencing operation, Nine Ball opens a pool hall, Daphne becomes a film director, and Lou embarks on a road trip. Debbie visits Danny's marked gravesite and toasts a martini, content that her brother would be proud.\n\nCast [ edit ]\n\nThe Eight [ edit ]\n\nOthers [ edit ]\n\nCelebrities who make cameo appearances include Anna Wintour, Katie Holmes, Maria Sharapova, Serena Williams, Richard Madden, Kim Kardashian, Common, Adriana Lima, Desiigner, Kylie Jenner, Alexander Wang, Liu Wen, Kendall Jenner, Bella Hadid, Gigi Hadid, Lily Aldridge, Olivia Munn, Jaime King, Zac Posen, Hailey Baldwin, Derek Blasberg, Sofia Richie, Heidi Klum, Kelly Rohrbach, Lauren Santo Domingo, and Rainey Qualley.[6][7]\n\nMatt Damon and Carl Reiner reprised their roles as Linus Caldwell and Saul Bloom, but their scenes were removed from the final cut of the film.[8][9]\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nFollowing the release of Ocean's Thirteen in 2007, director Steven Soderbergh stated there would not be an Ocean's Fourteen, noting that star George Clooney preferred to conclude the trilogy on a strong note.[10] In December 2008, Soderbergh reiterated that a fourth film was unlikely, this time citing the death of Bernie Mac, a key cast member in the trilogy.[11] However, in October 2015, it was reported that a female-led spin-off was in development, with Sandra Bullock set to star.[12][13] Early reports indicated that Helena Bonham Carter, Cate Blanchett, Mindy Kaling, and Elizabeth Banks were in talks to join the cast, although Banks's involvement was later revealed to be speculative and did not materialize.[14][15]\n\nBy August 2016, the core cast had been finalized, with Bullock, Blanchett, Bonham Carter, and Kaling confirmed, and Anne Hathaway, Rihanna, Awkwafina, and Sarah Paulson joining shortly thereafter.[16][17]\n\nCasting [ edit ]\n\nDuring production, actors Dakota Fanning and Damian Lewis were spotted on set. Lewis was originally cast in a key role, but later exited the project due to scheduling conflicts and was replaced by Richard Armitage.[18][19][20] Fanning's casting was confirmed in March 2017. Richard Robichaux was also added to the cast in November 2016.[21]\n\nMatt Damon, who played Linus Caldwell in the Ocean's trilogy, stated in November 2016 that he had filmed a cameo for Ocean's 8; however, his scene was ultimately cut from the final version of the film.[22][23][24] In January 2017, James Corden joined the cast as an insurance investigator suspicious of the heist.[25] That same month, a number of real-life celebrities were confirmed to appear as themselves in cameo roles at the Met Gala, including Anna Wintour, Alexander Wang, Zac Posen, Derek Blasberg, Lauren Santo Domingo, Kim Kardashian, Kendall Jenner, Kylie Jenner, Katie Holmes, Olivia Munn, Hailey Bieber, and Zayn Malik.[26][27][28][29]\n\nFilming [ edit ]\n\nPrincipal photography began on October 25, 2016, in New York City, with scenes filmed around Manhattan.[30][31] In March 2017, Cate Blanchett confirmed that principal photography had been completed.[32] However, in May 2017, it was reported that additional filming would take place on Staten Island at the former Arthur Kill Correctional Facility, which had recently been acquired by Broadway Stages after an initial rejection.[33]\n\nMusic [ edit ]\n\nReception [ edit ]\n\nBox office [ edit ]\n\nOcean's 8 premiered at Alice Tully Hall in New York City on June 5, 2018, and was released theatrically in North America on June 8, 2018, by Warner Bros. Pictures.[34][35][36] The film grossed $140.3 million in the United States and Canada and $157.5 million in international territories, for a worldwide total of $297.8 million, against a production budget of $70 million.[3]\n\nIn the United States and Canada, the film opened alongside Hotel Artemis and Hereditary and was projected to earn between $30 million and $45 million from 4,145 theaters during its opening weekend. Tracking comparisons included the 2016 Ghostbusters reboot and other female-led comedies such as The Heat (2013), Spy (2015), and Girls Trip (2017).[37] Ocean's 8 earned $4 million in Thursday night previews (including $100,000 from early Wednesday screenings) and $15.8 million on its first full day. It went on to debut with $41.6 million, with 69% of its audience being female.[38][39] The film earned $19 million in its second weekend, finishing behind Incredibles 2, and $11.6 million in its third, ranking third behind Jurassic World: Fallen Kingdom and Incredibles 2.[40][41]\n\nCritical response [ edit ]\n\nOcean's 8 received generally positive reviews from critics. On Rotten Tomatoes, the film holds an approval rating of 69% based on 360 reviews, with an average rating of 6.2/10. The site's consensus reads: \"Ocean's 8 isn't quite as smooth as its predecessors, but still has enough cast chemistry and flair to enjoyably lift the price of a ticket from filmgoers up for an undemanding caper.\"[42] On Metacritic, the film has a weighted average score of 61 out of 100 based on 50 critics, indicating \"generally favorable reviews.\"[43] Audiences polled by CinemaScore gave the film a grade of \"B+,\" matching the scores of Ocean's Eleven (2001) and Ocean's Thirteen (2007).[38]\n\nCritics praised the film's ensemble cast and style, though some noted shortcomings in narrative depth. Peter Travers of Rolling Stone awarded the film 3 out of 4 stars, calling it \"a heist caper that looks gorgeous, keeps the twists coming and bounces along on a comic rhythm that's impossible to resist.\"[44] Alonso Duralde of TheWrap described it as \"slick, charming, and funny,\" but added that it \"never quite kicks into high gear.\"[45] Variety's Owen Gleiberman called the film \"a casually winning heist movie\", praising Anne Hathaway's performance while critiquing underwritten roles for Cate Blanchett and Sarah Paulson.[46]\n\nTy Burr of The Boston Globe highlighted Blanchett's presence as a standout, while Michael Phillips of the Chicago Tribune found the film lacking ensemble cohesion, writing, \"It's smooth, and far from inept. But it isn't much fun.\"[47][48] Richard Roeper of the Chicago Sun-Times praised the cast's chemistry but noted the absence of a compelling villain or stakes.[49] Manohla Dargis of The New York Times expressed frustration that the film incorporated romantic baggage even in a female-led heist, calling some of the narrative \"needless filler.\"[50]\n\nActor's response [ edit ]\n\nFollowing the film's release, Mindy Kaling suggested that some of the criticism stemmed from the lack of diversity among film critics. Kaling stated that many critics \"come at it from a different point of view\" and may not connect with female-led films in the same way.[51]\n\nSeveral journalists responded critically to that claim. Guy Lodge of Variety and other writers pointed out that many negative reviews were also written by female critics, including Emily Yoshida of Vulture and Stephanie Zacharek of Time.[51] Justin Chang of the Los Angeles Times acknowledged the need for greater diversity in film criticism but cautioned against assuming that critical responses are determined solely by identity, emphasizing instead the importance of varied perspectives.[52] Donald Clarke of The Irish Times noted that Ocean's 8 still received a \"fresh\" rating on Rotten Tomatoes and had been rated higher than Ocean's Twelve (2004).[53]\n\nScreenwriter Olivia Milch also addressed the pressure surrounding the film's success. In an interview with Refinery29, she commented, \"Because the percentage of films that are either made by women or with female protagonists is so low, there does tend to be this pressure to perform very well... or if you screw up, then you're never going to get the chance again.\"[54]\n\nAccolades [ edit ]\n\nHome media [ edit ]\n\nOcean's 8 was first released on Digital HD on August 21, 2018, by Warner Bros. Home Entertainment.[59] The film was subsequently made available on DVD, Blu-ray, and 4K Ultra HD Combo Pack on September 11, 2018.[60] Upon its physical release, the film debuted at number one on the NPD VideoScan First Alert chart for the week ending September 15, 2018, indicating strong home video sales.[61]\n\nSee also [ edit ]", "images": ["http://en.wikipedia.org/static/images/icons/wikipedia.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/71/OOjs_UI_icon_robot.svg/40px-OOjs_UI_icon_robot.svg.png", "http://upload.wikimedia.org/wikipedia/en/d/dd/OceansEightPoster.jpeg", "https://upload.wikimedia.org/wikipedia/en/d/dd/OceansEightPoster.jpeg", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/20px-Symbol_category_class.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "http://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Cate_Blanchett_2011.jpg/120px-Cate_Blanchett_2011.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/13/SandraBullockMay09.jpg/120px-SandraBullockMay09.jpg", "http://en.wikipedia.org/static/images/footer/wikimedia.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/d/dd/OceansEightPoster.jpeg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Ocean%27s_8", "title": "Ocean's 8", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/d/dd/OceansEightPoster.jpeg", "width": 810, "height": 1200}, "title": "Ocean's 8 - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}