{"url": "http://abcnews.go.com/ThisWeek/week-transcript-odierno-chiarelli/story?id=11351927&page=4", "text": "August 8, 2010 — -- AMANPOUR: Good morning. I'm Christiane Amanpour, and at the top of the news this week, ending the war in Iraq.\n\n(BEGIN VIDEO CLIP)\n\nPRESIDENT BARACK OBAMA: Tens of thousands of our troops in Iraq are coming home.\n\n(END VIDEO CLIP)\n\nAMANPOUR: As America stands down, is Iraq ready to stand up? This morning from Baghdad, the commanding general of U.S. forces, General Ray Odierno, a \"This Week\" exclusive.\n\nThen, hidden wounds. After a decade of war, why is the military still so unprepared to deal with its emotional scars?\n\n(BEGIN VIDEO CLIP)\n\n(UNKNOWN): They didn't care about my family. The only thing I thought was my role was (inaudible).\n\n(END VIDEO CLIP)\n\nAMANPOUR: This morning, the general in charge of healing those wounds, an exclusive interview with the vice chief of staff of the army, General Peter Chiarelli.\n\nThen...\n\n(BEGIN VIDEO CLIP)\n\n(UNKNOWN): We are losing everything we have.\n\n(END VIDEO CLIP)\n\nAMANPOUR: Jobs, immigration, and gay marriage. All the week's politics on our roundtable with Politico's John Harris; Gillian Tett of the Financial Times; George Packer of the New Yorker, and former Bush White House official Michael Gerson.\n\nAnd the Sunday Funnies.\n\n(BEGIN VIDEO CLIP)\n\n(UNKNOWN): According to the Bureau of Labor statistics, like half of American workers hold on to a job for four years or more. Bad news for President Obama.\n\n(END VIDEO CLIP)\n\nAMANPOUR: This weekend marks a major milestone in the seven-year war in Iraq. U.S. forces have now handed over control of all combat duties to Iraqi forces, and by the end of this month, all U.S. combat forces will be out. A transitional force of about 50,000 troops will remain, though.\n\nEarlier this week, President Obama spelled out their mission.\n\n(BEGIN VIDEO CLIP)\n\nOBAMA: Our forces will have a focused mission -- supporting and training Iraqi forces; partnering with Iraqis in counter-terrorism missions, and protecting our civilian and military efforts. But make no mistake: Our commitment in Iraq is changing from a military effort led by our troops to a civilian effort led by our diplomats.\n\n(END VIDEO CLIP)\n\nAMANPOUR: But five months after elections, Iraqi politicians have not yet formed a government, and violence continues. Last night, three explosions at a market in southern Iraq killed dozens of people. And today, two car bombs went off west of Baghdad.\n\nJoining me this morning from Baghdad, the commander of U.S. forces in Iraq, General Ray Odierno. General Odierno, thank you very much for joining us on \"This Week.\"\n\nAnd I want to start by asking you about the handover. You have just handed over all combat operations to Iraqi forces. Are they really ready to stand up once you draw down by the end of this month?\n\nODIERNO: Well, this is something that we've been working for a very long time with the Iraqi security forces. For the last 20 months, we've been slowly and deliberately turning over more and more responsibility to them, and they have stepped up. They continue to do broad-scoped operations across all of Iraq. We continue to help them as they do these, and that will continue after 1 September, our assistance. But we do believe they are ready to assume full operations in Iraq.\n\nAMANPOUR: Well, let me ask you about the violence. This weekend alone in Basra in the south, there has been a big explosion that's caused dozens of deaths. What is it? Do you know what it is, in fact, was it a terrorist attack?\n\nODIERNO: Well, I think it probably was. We're still sorting through that, because there was conflicting reports, but my guess is it was probably some sort of an improvised explosive device that went off.\n\nI would just say, this is a reflection -- we have ups and downs here. As I step back, having been here since the dark days of 2006 and '7, to where we are today, what I see is a broad change in the security environment here in Iraq.\n\nHowever, there are still groups out there who are conducting terrorist acts against the people of Iraq, and they are doing this to stop the political way forward, to stop the political process moving forward, to stop democracy moving forward, and to cause the government of Iraq not to continue its progress. And that's what we're seeing that's playing out on the ground now.\n\nAMANPOUR: Well, General Odierno, in fact, it seems that the political parties in Iraq are not moving forward with the democracy as you describe it. Five months or more after the election, there is still no government. How much does that worry you, and what kind of vacuum is that creating there?\n\nODIERNO: Well, again, first off, we've seen during this time, this governmental formation timeframe, the Iraqi security forces have acted neutral; they've continued to conduct operations across the broad spectrum of operations that are necessary. In fact, I have found them to be very professional in continuing to execute the security profile. So we have seen no degradation in their ability to execute the security profile. And I think that's actually an extremely positive step forward for them, that they've continued to operate, even though -- or during this time of governmental formation.\n\nAMANPOUR: So, how concerned are you and at what point will you be concerned if there is no government, and do you think that that is providing space for insurgents to reorganize, as many suggest?\n\nODIERNO: Well, I will just tell you, is what we -- again, what we can't do is overreact to incidents. There are going to be incidents that occur here. There is a level of violence and a level of terrorism here that's going to occur. But I will tell you, over the last six to seven months, the success that we've had against Al Qaida in Iraq specifically in decapitating the leadership has in fact affected them. The kind of operations that they now conduct are very different than what they did just six months ago or eight months ago. And the kind of their ability to surge and do this over a sustained period of time is limited, and that's due to a lot of the work of the Iraqi security forces, working with us to conduct these operations.", "images": ["https://i.abcnewsfe.com/a/bf2f8ed5-a320-4d7e-b583-179abe072d92/trump-signs-shutdown-bill-20251112-ap-jh_1763006747268_hpMain_square.jpg?w=208", "https://i.abcnewsfe.com/a/009e3420-a5ae-477a-aeb3-edfa85648814/johnson-2-gty-jef-251118_1763480583977_hpMain_square.jpg?w=208", "https://i.abcnewsfe.com/a/a904a3c1-1e2d-4174-9130-e846e8059dee/carnivaldeath_1762746067738_hpMain_square.jpg?w=208", "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://i.abcnewsfe.com/a/7669390d-d027-4ec7-9673-1d2eccafbbec/comey-gty-er-251117_1763404424377_hpMain_square.jpg?w=208", "https://assets-cdn.abcotvs.net/static/images/DisneyPlus.svg"], "top_img": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "keywords": [], "authors": ["Abc News"], "canonical_link": "https://abcnews.go.com/ThisWeek/week-transcript-odierno-chiarelli/story?id=11351927", "title": "'This Week' Transcript: Odierno and Chiarelli", "meta_data": {"viewport": "initial-scale=1.0, user-scalable=yes", "og": {"locale": "en_US", "site_name": "ABC News", "url": "https://abcnews.go.com/ThisWeek/week-transcript-odierno-chiarelli/story?id=11351927", "title": "'This Week' Transcript: Odierno and Chiarelli", "description": "Transcript of 'This Week' interview with Generals Ray Odierno and Peter Chiarelli", "image": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "type": "article"}, "description": "Transcript of 'This Week' interview with Generals Ray Odierno and Peter Chiarelli", "keywords": "this week, christiane amanpour, iraq, militayr, suicide, army, odierno, chiarelli, Article, 11351927", "theme-color": "#fff", "copyright": "2025 ABC News", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "'This Week' Transcript: Odierno and Chiarelli", "lastPublishedDate": "2010-08-11T16:09:02Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/prism-story,11351927", "ipad": "abcnewsipad://link/prism-story,11351927", "googleplay": "https://abcnews.go.com/ThisWeek/week-transcript-odierno-chiarelli/story?id=11351927"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "'This Week' Transcript: Odierno and Chiarelli", "description": "Transcript of 'This Week' interview with Generals Ray Odierno and Peter Chiarelli", "url": "https://abcnews.go.com/ThisWeek/week-transcript-odierno-chiarelli/story?id=11351927", "image": {"identifier": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/prism-story,11351927", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/prism-story,11351927", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/ThisWeek/week-transcript-odierno-chiarelli/story?id=11351927", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/ThisWeek/week-transcript-odierno-chiarelli/story?id=11351927"}}}, "movies": [], "publish_date": null, "source": "http://abcnews.go.com", "summary": ""}