{"url": "https://www.huffingtonpost.com/entry/the-bachelor-winter-games-what-you-didnt-see_us_5a8743cce4b05c2bcacab5e8", "text": "Ashley Iaconetti, Lesley Murphy and Clare Crawley on \"The Bachelor Winter Games.\" ABC\n\nWatching “The Bachelor Winter Games” requires a real time commitment from even Bachelor Nation’s most ardent members.\n\nSince the show only runs for two weeks ― to coincide with the 2018 Winter Olympics ― viewers are expected to consume three nights of “Bachelor”-related content each week. But according to “Winter Games” cast member Michael Garofola, there was a lot of plot that got left on the cutting room floor.\n\nAdvertisement\n\nMichael stopped by the “Here To Make Friends” podcast to share the inside scoop on house dynamics, love interests we didn’t see, and more. Here’s what we learned:\n\n1. The very international cast talked a lot about politics in the house.\n\n“It was definitely a pervasive topic in the house, even though it’s obviously not being shown,” said Michael. “When this show was filming, the big story is all the Roy Moore stuff is going on. That was also when Trump tweeted basically admitting to obstructing justice... So these things are all being discussed and we were like, ‘Ah, they’re gonna cut all this out.’... [But] it’s relevant, it’s topical. We were, at one point, sitting around the island in the kitchen and there was a big talk with everyone, and basically they denoted me to be the speaker on behalf of apologizing for the United States and explaining what was going on. I jokingly tweeted this, but feel like my role there was to improve United States diplomatic relations with our foreign allies.”\n\nAdvertisement\n\n2. The “Bachelor” anthem was written by the high-school girl who sang it!\n\n“That was a local high school student who wrote the song herself. They did not give it to her,” said Michael. “Chris Harrison introduced her [at the opening ceremonies] ... I think her mission was to write something funny and cheesy.”\n\nBen Higgins and Luke Pell on \"The Bachelor Winter Games.\" ABC\n\n3. Some of the contestants weren’t initially told the competition would include real Olympic sports.\n\n“When I was asked to do this show, I was like, ‘Look, it’s been a while since I’ve gone skiing, it’s been a while since I’ve gone ice skating,’” said Michael. “They said, ‘Oh, Michael G., don’t worry. We don’t wanna get sued by the Olympics! We’re not gonna do real winter sports. We can’t do that. We’re gonna do like, snowball fights and who can build a snowman fastest.’”\n\nAdvertisement\n\nWelp.\n\n4. Michael had some potential love interests that never went anywhere, so they got cut.\n\nOn Jenny, from Finland: “I was sort of talking to Jenny. Nothing really developed there. She spoke English very well but she was very insecure and self-conscious about her ability to speak English ... She had some difficulty and I think that ultimately for me, if I’m gonna date someone long-distance from Helsinki I need that to be like, ‘Wow, I’ve never found this kind of feeling before.’ Jenny is lovely but I think we were trying and then it just didn’t happen. There was no making out.”\n\nOn Lesley, from the USA: ”I love Lesley and Dean together. I love both of them individually as well. But look, I’ve known Lesley for a while ― she was on the [“Bachelor”] season before mine [of “The Bachelorette”].... She and I had a couple really great conversations, and then she hit it off with Dean. There was an undeniable chemistry there.”\n\nFor more behind-the-scenes insight about “The Bachelor Winter Games,” check out the full episode:\n\nAdvertisement\n\nDo people love “The Bachelor,” “The Bachelorette” and “Bachelor in Paradise,” or do they love to hate these shows? It’s unclear. But at “Here to Make Friends,” we both love and love to hate them — and we love to snarkily dissect each episode in vivid detail. Podcast edited by Nick Offenberg.\n\nCelebrate Truth This Season Your Support Fuels Our Mission Your Support Fuels Our Mission The holidays can get loud. But some stories cut through the noise -- the ones that make sense of the chaos and hold power to account. Support the newsroom built on clarity, accountability, and a healthy dose of reality. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. “Our fierce, independent reporting and unvarnished perspective hold power to account and inform millions of readers. Please support this hard-hitting journalism.” Monthly Annually SAVE 16% Support $5/month (about $0.17/day) Silver Huffposter 🤍 Monthly recurring supporter-only email\n\nFewer requests for financial support Support $10/month (about $0.33/day) Gold Everything in the Silver Tier\n\nAd-free access on the HuffPost website OR HuffPost apps\n\nSay goodbye to annoying video interruptions while you read. No more autoplay videos. Support $20/month (about $0.67/day) Platinum HuffPoster 🏆 Everything in the Gold Tier\n\nAd-free access on the HuffPost website AND HuffPost apps\n\nEarly access to new features\n\nMembership to Platinum Club focus group Make a One Time Contribution Support HuffPost Already a member? Log in to hide these messages.", "images": ["https://img.huffingtonpost.com/asset/5a8752f32000002d00eaf20c.jpeg?cache=v38G0kbpiC&ops=1200_630", "https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "https://img.huffingtonpost.com/asset/5a8752f32000002d00eaf20c.jpeg?cache=v38G0kbpiC&ops=scalefit_720_noupscale", "https://img.huffingtonpost.com/asset/5a87532f21000038006017a6.jpeg?ops=scalefit_720_noupscale", "https://img.huffingtonpost.com/asset/691c87541700009d2b9c5f37.jpg?ops=50_50"], "top_img": "https://img.huffingtonpost.com/asset/5a8752f32000002d00eaf20c.jpeg?cache=v38G0kbpiC&ops=1200_630", "keywords": [], "authors": ["Senior Women'S Reporter", "Books", "Culture Writer", "Senior Audio Producer", "Whitney Snyder", "Editor-In-Chief Huffpost"], "canonical_link": "https://www.huffpost.com/entry/the-bachelor-winter-games-what-you-didnt-see_n_5a8743cce4b05c2bcacab5e8", "title": "Here's What You Didn't See On 'The Bachelor Winter Games'", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "Contestant Michael Garofola broke down the behind-the-scenes fun that ended up on the cutting room floor.", "keywords": "the bachelor,Reality TV,Winter,here to make friends", "fb": {"app_id": 46744042133}, "og": {"title": "Here's What You Didn't See On 'The Bachelor Winter Games'", "type": "article", "image": {"identifier": "https://img.huffingtonpost.com/asset/5a8752f32000002d00eaf20c.jpeg?cache=v38G0kbpiC&ops=1200_630", "url": "https://img.huffingtonpost.com/asset/5a8752f32000002d00eaf20c.jpeg?cache=v38G0kbpiC&ops=1200_630", "type": "image/jpeg", "width": 1200, "height": 630}, "url": "https://www.huffpost.com/entry/the-bachelor-winter-games-what-you-didnt-see_n_5a8743cce4b05c2bcacab5e8", "site_name": "HuffPost", "locale": "en_US", "description": "Contestant Michael Garofola broke down the behind-the-scenes fun that ended up on the cutting room floor."}, "article": {"tag": "the bachelor,Reality TV,Winter,here to make friends", "section": "Entertainment", "published_time": "2018-02-16T23:44:07Z", "modified_time": "2018-02-19T20:48:01Z"}, "twitter": {"card": "summary_large_image", "site": "@HuffPostEnt", "title": "Here's What You Didn't See On 'The Bachelor Winter Games'", "image": {"identifier": "https://img.huffingtonpost.com/asset/5a8752f32000002d00eaf20c.jpeg?cache=v38G0kbpiC&ops=1200_630", "width": 1200, "height": 630}, "description": "Contestant Michael Garofola broke down the behind-the-scenes fun that ended up on the cutting room floor."}, "al": {"ios": {"url": "huffpostnews:///?editionID=us&entryID=us_5a8743cce4b05c2bcacab5e8", "app_store_id": 306621789, "app_name": "HuffPost"}}, "bingbot": "noarchive", "robots": "max-snippet:-1,max-image-preview:large,max-video-preview:-1", "google-site-verification": "97Mj-wW7u8U1NOnkW1rfH-I1kgO0-a9YsgoesOk41R8"}, "movies": [], "publish_date": 1518824647.0, "source": "https://www.huffingtonpost.com", "summary": ""}