{"url": "https://cfda.com/news/the-2018-cfda-fashion-awards-winners", "text": "The winners of the 2018 CFDA Fashion Awards are in!\n\nRaf Simons won Womenswear Designer of the Year for Calvin Klein, which was presented to him by Cate Blanchett. Supreme took home Menswear Designer of the Year, presented by Trevor Noah, and Ashley Olsen and Mary-Kate Olsen took home the Accessory Designer of the Year award for The Row, given to them by Julia Garner.\n\nThe awards, in partnership with Swarovski for the 17th consecutive year, just concluded at the Brooklyn Museum.\n\nKarlie Kloss presented the Swarovski Award for Emerging Talent to Sander Lak for Sies Marjan.\n\n“The range and depth of talent honored at the CFDA Fashion Awards is the perfect proof that American fashion is a global powerhouse,” said Steven Kolb, President and CEO of the CFDA.\n\nIn one of the highlights of the evening, Ralph Lauren received A CFDA Members Salute by designers Vera Wang, Tommy Hilfiger, Michael Kors, Alexander Wang, Thom Browne, Jeffrey Banks, John Varvatos, Donna Karan, Marcus Wainwright, Jason Wu, and Diane von Furstenberg. Tory Burch, Carolina Herrera, Marc Jacobs, Norma Kamali, Calvin Klein, and Reed Krakoff participated in the salute via a soundscape.\n\nBusy Philipps presented Kim Kardashian West with the CFDA’s first Influencer Award.\n\nNaomi Campbell was named Fashion Icon, presented by Lee Daniels.\n\nOprah Winfrey presented Edward Enninful with the Media Award.\n\nDonatella Versace was recognized with this year’s International Award, presented by Lupita Nyong’o.\n\nThe Geoffrey Beene Lifetime Achievement Award was presented to Narciso Rodriguez by Claire Danes.\n\nThe Founder’s Award in honor of Eleanor Lambert was presented to Carolina Herrera by Caroline Kennedy.\n\nThe Swarovski Award for Positive Change was presented to Diane von Furstenberg by Parkland student Delaney Tarr.\n\nIssa Rae hosted the evening, which featured star-studded guests such as Julianna Margulies, Gigi Hadid, Anwar Hadid, Kendall Jenner, Kaia Gerber, Laura Harrier, Ashley Graham, Erika Jayne, Rachel Zoe, Zac Posen, Tabitha Simmons, Christian Siriano, Ana Khouri, and Joseph Altuzarra.\n\n“The range and depth of talent honored at the CFDA Fashion Awards is the perfect proof that American fashion is a global powerhouse,” said Steven Kolb, President and CEO of the CFDA. “I would like to thank Nadja Swarovski and Swarovski for their continued support of the CFDA Fashion Awards and American fashion.”\n\nCheck back for full coverage on the awards and watch them on facebook.com/cfda and CFDA’s YouTube channel!\n\nThe official partners of the 2018 CFDA Fashion Awards include: Official Carpet Sponsor, ECONYL® x ege; Official Hydration Partner, LIFEWTR; Official Ride Share Partner, Lyft; Official Champagne Sponsor, Perrier-Jouët featuring Belle Epoque Rosé; Official Spirit Sponsor, Maestro Dobel Tequila; Official Hair Sponsor, Pureology", "images": ["https://cfda.com/wp-content/themes/cfda-website/dist/logo-black.svg", "https://cfda.com/wp-content/uploads/2018/05/BFA_24154_2914471-1.jpg", "https://cfda.com/wp-content/uploads/2018/06/CFDA003.jpg", "https://cfda.com/wp-content/uploads/2025/05/70482373aac752999475186fd81f911739e9262d-820x1024.png", "https://cfda.com/wp-content/uploads/2017/03/Skyline.jpg", "https://cfda.com/wp-content/uploads/2025/05/7364f3415a33ccef274c6ee26c91648f0e2a5ced-819x1024.png", "https://cfda.com/wp-content/uploads/2025/05/0d002bb0feb8a5a4479e8fa8152558f911b06e1c-821x1024.png", "https://cfda.com/wp-content/themes/cfda-website/dist/logo-white.svg", "https://cfda.com/wp-content/uploads/2018/06/CFDA002.jpg"], "top_img": "https://cfda.com/wp-content/uploads/2018/06/CFDA002.jpg", "keywords": [], "authors": [], "canonical_link": "https://cfda.com/news/the-2018-cfda-fashion-awards-winners/", "title": "The 2018 CFDA Fashion Awards Winners!", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "max-snippet:-1,max-image-preview:large,max-video-preview:-1", "og": {"type": "article", "locale": "en_US", "site_name": "CFDA", "title": "The 2018 CFDA Fashion Awards Winners!", "url": "https://cfda.com/news/the-2018-cfda-fashion-awards-winners/", "image": {"identifier": "https://cfda.com/wp-content/uploads/2018/06/CFDA002.jpg", "width": 1484, "height": 1920}}, "article": {"published_time": "2018-06-05T02:50:37+00:00", "modified_time": "2018-06-05T02:50:37+00:00"}, "twitter": {"card": "summary_large_image", "title": "The 2018 CFDA Fashion Awards Winners!", "description": "field_5800d2bbdbce5", "image": "https://cfda.com/wp-content/uploads/2018/06/CFDA002.jpg"}, "generator": "Site Kit by Google 1.166.0", "msapplication-TileImage": "https://cfda.com/wp-content/uploads/2025/05/cropped-favicon-1-270x270.png"}, "movies": [], "publish_date": 1528167037.0, "source": "https://cfda.com", "summary": ""}