{"url": "www.nowtolove.com.au/celebrity/celeb-news/nicole-kidman-and-keith-urban-divorce-1-45990", "text": "The future isn’t looking bright for Nicole Kidman and Keith Urban who recently attended a private counseling retreat in an attempt to save their marriage.\n\nAdvertisement\n\n“Nicole and Keith went for an emergency stay,” an insider recently revealed to In Touch of the pair, who have been married for nearly 12 years. “It was an extremely emotional and testing few days.”\n\nThe couple’s best efforts to repair their damaged relationship were unsuccessful, “and now friends think this will end in divorce,” the insider confessed. Simply put, there are just too many obstacles for the Oscar winner and the country superstar to overcome. During the course of their union, the two 50-year-old Australia natives have struggled to deal with Keith’s addiction issues — he went to rehab four months after they wed in 2006 — as well as Nicole’s anger over rumors of his infidelity.\n\nThe couple, who share daughters Sunday, 9, and Faith, 7, “have been fighting constantly over Nicole’s incessant jealousy and need to control Keith on every level,” added the insider. “They have been putting a Band-Aid over their problems for too long. While they have smiles plastered on their faces in public, in private, things have been falling apart.”\n\nAdvertisement\n\nThe counseling trip to Vermont marked their final attempt to patch things up. “It was Keith’s idea to visit the boot camp,” the insider said. The Lion actress resisted and only relented when Keith threatened to leave for good. “He gave her an ultimatum,” the source said. And she knew he wasn’t bluffing. The insider said their recent fights have gotten so bad that Keith has even left their Nashville home to stay overnight at a hotel. “It’s become a second home for him. Of course, there have been times she’s given up and walked out on him, too,” the source revealed.\n\nBut in Vermont, the pair were side by side as they hashed out their problems. “They addressed a range of issues, including emotional intimacy, and focused on the root of their problems as they learned to break down walls and start working on their issues rather than plastering over the cracks,” the insider explained.\n\nThey both opened up. “Keith said he couldn’t continue to live in a marriage where he felt like he was being constantly monitored like one of her children,” the source shared. “And Nicole ended up breaking down and spilled her heart out about how past relationships had damaged her, and she vowed to make a conscious effort to change things.” The nearly weeklong retreat was intense. Said the insider, “At one point it was touch-and-go whether they’d even leave together.” They ultimately did, and yet it didn’t work — their problems still remain.\n\nAdvertisement\n\nNicole and Keith struggled from the outset of their union. When the “Blue Ain’t Your Color” singer moved to Nashville from Australia in the ’90s, drugs “were my thing,” he told Rolling Stone in 2016. “I loved them.” By the time he met Nicole in 2005, he was seven years sober following a rehab stay in 1998. But he relapsed shortly after their 2006 wedding and checked into Betty Ford. Nicole was devastated. “It was very, very hard to have to have her go through that,” Keith later said.\n\nNicole publicly stood by his side (and even hopped on a flight from Europe to be with him when she heard the news), but it was a struggle. “It was just another twist in my life: Here it goes. Hold on, and off we go! But it was painful, deeply painful,” she admitted to Vanity Fair in 2007. “We were in a very, very, very bad, painful place, and have managed to step through it.”\n\nOther problems soon replaced that one. In 2015, Keith was photographed hanging out with his opening act, fellow country singer Kelsea Ballerini, 24, on his tour bus. The photos left Nicole furious. “She calls him out every time he’s pictured with another woman,” according to a friend. “Keith is constantly defending himself from rumors of on-tour affairs with groupies and female singers.”\n\nAdvertisement\n\nNicole — who attended this year’s Oscars alone because Keith had a concert — has even admitted to keeping close tabs on him when they are apart. “I don’t like it when my husband doesn’t answer his phone. I have to keep calling and calling, and I get anxious. Does that make me high-maintenance?” she told W Magazine in 2017. Around the same time, Keith became the jealous one. A source said he became furious when he learned that Nicole pushed to get Zoë Kravitz — the daughter of Nicole’s ex-fiancé Lenny Kravitz — hired on her HBO series Big Little Lies. “Keith feared she may still have feelings for Lenny,” said the source. “Nicole kept telling Keith that Zoë is like family and it was a mutual decision between the producers that she was right for the part. Lenny had nothing to do with it, but Keith didn’t care.”\n\nStory continues after video\n\nLoading the player...\n\nThey have also clashed over where to live. “Nicole likes the more laid-back life in Australia, and she thinks it would be a great place for the girls,” said the friend. Keith, however, prefers his adopted home of Nashville. The four-time Grammy winner “has become one of contemporary country music’s biggest stars, and he’s looked upon as one of the kings of the city,” continued the friend. “He feels he has to stay in Music City to stay relevant and on top of his game. The discussion over living in Australia versus living in Nashville has become a contentious battle.”\n\nAdvertisement\n\nThe couple already seem to be liquidating assets to make a divorce easier. They recently listed one of their homes — and there will be plenty more to fight over in the event of an ugly breakup. The pair also own a Beverly Hills home, which they bought for $3.47 million in 2008, and an apartment in NYC’s trendy Chelsea neighborhood and they have spent $18 million on properties in Australia. Combined, they are worth an estimated $350 million. (There could be a battle over the kids, as well.)\n\nThe public may be shocked when Keith and Nicole inevitably announce a decision to separate.\n\nBut insiders know better.\n\nSaid the friend, “Their marriage is in far bigger trouble than they’re letting on.”\n\nAdvertisement\n\nThis story was originally published on our sister site Closer Magazine.\n\nRelated\n\nUnwind and relax with your favourite magazine! Huge savings plus FREE home delivery Subscribe TODAY", "images": ["https://www.nowtolove.com.au/wp-content/uploads/sites/7/2024/11/Logo-1.svg", "https://api.photon.aremedia.net.au/wp-content/uploads/sites/7/WomansDay/2013/11/14/12041/nic_0210.jpg?resize=200%2C145", "https://www.nowtolove.com.au/wp-content/uploads/sites/7/2024/02/Vector.svg", "https://www.nowtolove.com.au/wp-content/themes/express/assets/images/are-logo.svg", "https://api.photon.aremedia.net.au/wp-content/uploads/sites/7/2025/11/the-family-stone-sequel-691e9a875ea9c.png?resize=720%2C405", "https://api.photon.aremedia.net.au/wp-content/uploads/sites/7/WomansDay/2013/11/13/8767/nicole_2908.jpg?resize=200%2C145", "https://www.nowtolove.com.au/wp-content/uploads/sites/7/2024/02/tvweek_adobe_express-01.svg", "https://api.photon.aremedia.net.au/wp-content/uploads/sites/7/now/2018/03/26/1522006882566_AAutKrh.jpg?resize=1024%2C853", "https://www.nowtolove.com.au/wp-content/uploads/sites/7/2024/02/PTL-logo-3.svg", "https://api.photon.aremedia.net.au/wp-content/uploads/sites/7/Now/2018/03/26/45990/Nicole-ART.jpg?fit=900%2C750", "https://www.nowtolove.com.au/wp-content/themes/express/assets/images/icon-phosphor-circle.svg", "https://api.photon.aremedia.net.au/wp-content/uploads/sites/7/2025/11/bear-and-sunny-feature-image-691e8fe58c85f.jpg?resize=720%2C405", "https://api.photon.aremedia.net.au/wp-content/uploads/sites/7/2025/11/andrew-and-fergie-feature-image-691e6fd02f613.jpg?resize=720%2C405", "https://www.nowtolove.com.au/wp-content/uploads/sites/7/2024/11/t5_adobe_express.svg", "https://secure.gravatar.com/avatar/d41d8cd98f00b204e9800998ecf8427e?d=mm&s=128", "https://api.photon.aremedia.net.au/wp-content/uploads/sites/7/now/2018/03/26/1522007131738_nicole-kidman-keith-urban-blast.jpg?resize=960%2C1024", "https://api.photon.aremedia.net.au/wp-content/uploads/sites/7/Now/2018/03/26/45990/Nicole-ART.jpg?resize=690%2C575", "https://www.nowtolove.com.au/wp-content/uploads/sites/7/2024/02/35_Mag-Cover-Image-1.png", "https://api.photon.aremedia.net.au/wp-content/uploads/sites/7/now/2018/03/26/1522007103736_keith-urban-nicole-kidman-family.jpg?resize=1024%2C819"], "top_img": "https://api.photon.aremedia.net.au/wp-content/uploads/sites/7/Now/2018/03/26/45990/Nicole-ART.jpg?resize=690%2C575", "keywords": [], "authors": ["Closer Staff"], "canonical_link": "https://www.nowtolove.com.au/celebrity/celebrity-news/nicole-kidman-and-keith-urban-divorce-1-45990/", "title": "Are Nicole Kidman and Keith Urban headed for divorce? Friends say yes", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1", "taboola-author": "Closer staff", "taboola-category": "Celebrity News", "taboola-section": "celebrity", "taboola-pub-date": "2018-03-25T19:37:43+11:00", "taboola-updated-date": "2024-02-04T22:36:18+11:00", "taboola-title": "Are Nicole Kidman and Keith Urban headed for divorce? Friends say yes", "taboola-description": "<p>Said the friend, \"Their marriage is in far bigger trouble than they're letting on.\"</p>", "taboola-image-url": "https://api.photon.aremedia.net.au/wp-content/uploads/sites/7/Now/2018/03/26/45990/Nicole-ART.jpg?fit=690%2C575", "taboola-tags": "Keith Urban, Nicole Kidman", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "The public may be shocked when Keith and Nicole inevitably announce a decision to separate.  But insiders know better.  Said the friend, \"Their marriage is in far bigger trouble than they're letting on.\"", "og": {"locale": "en_US", "type": "article", "title": "Are Nicole Kidman and Keith Urban headed for divorce? Friends say yes", "description": "The public may be shocked when Keith and Nicole inevitably announce a decision to separate.  But insiders know better.  Said the friend, \"Their marriage is in far bigger trouble than they're letting on.\"", "url": "https://www.nowtolove.com.au/celebrity/celebrity-news/nicole-kidman-and-keith-urban-divorce-1-45990/", "site_name": "Now To Love", "image": {"identifier": "https://api.photon.aremedia.net.au/wp-content/uploads/sites/7/Now/2018/03/26/45990/Nicole-ART.jpg?resize=690%2C575", "width": 1200, "height": 630, "type": "image/jpeg"}}, "article": {"publisher": "https://www.facebook.com/nowtolove/", "published_time": "2018-03-25T19:37:43+00:00", "modified_time": "2024-02-04T22:36:18+00:00"}, "twitter": {"card": "summary_large_image", "label1": "Est. reading time", "data1": "5 minutes", "label2": "Written by", "data2": "Closer staff"}, "generator": "speculation-rules 1.6.0", "sailthru.date": "2018-03-25 19:37:43", "sailthru.title": "Are Nicole Kidman and Keith Urban headed for divorce? Friends say yes", "sailthru.tags": ",Now to Love", "sailthru.author": "Closer staff", "sailthru.description": "<p>Said the friend, \"Their marriage is in far bigger trouble than they're letting on.\"</p>", "sailthru.image.full": "https://api.photon.aremedia.net.au/wp-content/uploads/sites/7/Now/2018/03/26/45990/Nicole-ART.jpg?fit=690%2C575", "sailthru.image.thumb": "https://api.photon.aremedia.net.au/wp-content/uploads/sites/7/Now/2018/03/26/45990/Nicole-ART.jpg?fit=50%2C42", "msapplication-TileImage": "https://api.photon.aremedia.net.au/wp-content/uploads/sites/7/2024/02/cropped-FavIcon.png?fit=270%2C270"}, "movies": [], "publish_date": 1522006663.0, "source": "http://www.nowtolove.com.au", "summary": ""}