{"url": "https://www.nydailynews.com/entertainment/elle-king-opens-battle-depression-ptsd-article-1.3295718", "text": "“Ex’s & Oh’s” singer Elle King revealed in a lengthy Instagram post that she’s staying positive and seeking help as she struggles with both depression and post-traumatic stress disorder.\n\n“I’m slowly learning that prolonging and putting off the inevitable and looming painful decision or choice… ONLY CREATES MORE PAIN. AND YOU’RE LITERALLY JUST SITTING IN IT,” King, 27, wrote Saturday alongside a photo of her in a “Born to be mild” T-shirt.\n\nElle King posted a message about her struggles with depression and PTSD to her Instagram account.\n\nThough she never mentions explicitly what choice she is referring to, she continued her extensive note by explaining that she recently sought help from a doctor for her PTSD, and that the session helped “the door inside of me open up just a little bit more.”\n\nKing also provided a colorful comparison to help better explain how she’s been dealing with her mental state — it’s a lot like doing LSD.\n\n“I also realized that PTSD and/or depression FOR ME, and I say for me because I can only speak for myself, is like a trip on LSD,” she wrote. “I realized that when I’ve been in an altered state I HAVE had weird moments and scary thoughts.”\n\nThe singer explained that, just as she’s forced to do when on the drug, the way she plans on combatting her PTSD and depression is by forcing herself to regain control of her own mind.\n\n“Today, if presented with two options, I will CHOOSE the one that is most beneficial and happy for me right then and there,” she wrote. “I’ll make some healthy choices.”\n\nKing, whose father is “Saturday Night Live” vet Rob Schneider, has long been known to share intimate details of her personal life with her social media followers.\n\nBack in April, she revealed with an Instagram post that her wedding to fiancé Andrew Ferguson had been called off, only to share in May that they had actually been secretly married in February 2016, and had since divorced.\n\n“My heart is broken. My soul aches. I am lost,” she wrote at the time.\n\nReports later emerged that Ferguson was arrested for domestic violence after allegedly threatening to kill King in April. She did not press charges.", "images": ["https://secure.gravatar.com/avatar/?s=85&d=mm&r=g", "https://www.nydailynews.com/wp-content/uploads/migration/2017/07/02/CWUXFSLBO462H36BD6RKXMQYGI.jpg?w=1024&h=670", "data:image/webp;base64,UklGRiQAAABXRUJQVlA4IBgAAAAwAQCdASoBAAEAAwA0JaQAA3AA/v3AgAA=", "https://www.nydailynews.com/wp-content/uploads/2023/08/New_York_Daily_News_nydredblack-1.svg"], "top_img": "https://www.nydailynews.com/wp-content/uploads/migration/2017/07/02/CWUXFSLBO462H36BD6RKXMQYGI.jpg?w=1024&h=670", "keywords": [], "authors": ["Rachel Desantis"], "canonical_link": "https://www.nydailynews.com/2017/07/02/elle-king-opens-up-about-battle-with-depression-and-ptsd/", "title": "Elle King opens up about battle with depression and PTSD", "meta_data": {"application-name": "newyorkdailynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "robots": "max-image-preview:large", "tdm-reservation": 1, "mrf": {"authors": "Rachel Desantis", "canonical": "https://www.nydailynews.com/2017/07/02/elle-king-opens-up-about-battle-with-depression-and-ptsd/"}, "description": "Elle King revealed in an Instagram post that she's staying positive and seeking help as she struggles with both depression and PTSD.", "generator": "WordPress 6.8.3", "og": {"type": "article", "title": "Elle King opens up about battle with depression and PTSD", "url": "https://www.nydailynews.com/2017/07/02/elle-king-opens-up-about-battle-with-depression-and-ptsd/", "description": "“Ex’s & Oh’s” singer Elle King revealed in a lengthy Instagram post that she’s staying positive and seeking help as she struggles with both depression and post-tr…", "site_name": "New York Daily News", "image": {"identifier": "https://www.nydailynews.com/wp-content/uploads/migration/2017/07/02/CWUXFSLBO462H36BD6RKXMQYGI.jpg?w=1024&h=670", "width": 1024, "height": 670}, "locale": "en_US"}, "article": {"published_time": "2017-07-02T14:23:51+00:00", "modified_time": "2018-04-06T12:19:38+00:00"}, "twitter": {"text": {"title": "Elle King opens up about battle with depression and PTSD"}, "image": "https://www.nydailynews.com/wp-content/uploads/migration/2017/07/02/CWUXFSLBO462H36BD6RKXMQYGI.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.nydailynews.com/wp-content/uploads/2023/09/cropped-DailyNewsCamera-7.webp?w=270"}, "movies": [], "publish_date": 1499005431.0, "source": "https://www.nydailynews.com", "summary": ""}