{"url": "https://en.wikipedia.org/wiki/Alan_Thicke", "text": "Canadian actor, songwriter, and television host (1947–2016)\n\nAlan Willis Thicke (né Jeffrey; 1 March 1947 – 13 December 2016) was a Canadian-American actor, songwriter, and game/talk show host. He was the father of singer Robin Thicke. Thicke was best known for playing Dr. Jason Seaver on the 1980s sitcom Growing Pains on ABC. In 2013, he was inducted into Canada's Walk of Fame.\n\nEarly life [ edit ]\n\nThicke was born on 1 March 1947 in Kirkland Lake, Ontario, the son of Shirley \"Joan\" Isobel Marie (née Greer), a nurse, and William Jeffrey, a stockbroker.[2] They divorced in 1953. His mother remarried Brian Thicke, a physician, and they moved to Elliot Lake.[3] Taking his stepfather's name, Alan Thicke graduated from Elliot Lake Secondary School in 1965.[4] He went on to attend the University of Western Ontario, joining the Delta Upsilon fraternity.[5]\n\nCareer [ edit ]\n\nHosting [ edit ]\n\nGame shows [ edit ]\n\nThicke hosted the Canadian game show Face the Music for CHCH-TV by Niagara Television in 1975 (not affiliated with Sandy Frank Productions' 1980-81 version). He hosted the Canadian game show First Impressions on the CTV network during the 1976–77 season, taped at CFCF-TV in Montreal,[6] the Saturday morning celebrity game show Animal Crack-Ups in the late 1980s,[7] and, in 1997, a television version of the board game Pictionary.[2] In the early 2000s, he hosted the All New 3's a Crowd on the Game Show Network.[2]\n\nTalk shows [ edit ]\n\nNorman Lear hired Thicke to produce and head the writing staff of Fernwood 2 Night, a tongue-in-cheek talk show based on characters from Lear's earlier show, Mary Hartman, Mary Hartman.[8] In the late 1970s, he was a frequent guest host of The Alan Hamel Show, a popular daytime talk show on Canadian TV, usually hosted by Alan Hamel.[9] When the Hamel series ended in the early 1980s, it was replaced by The Alan Thicke Show. The show at one point spawned a prime-time spinoff, Prime Cuts, which consisted of edited highlights from the talk show.[citation needed]\n\nThicke was later signed to do an American syndicated late-night talk show, Thicke of the Night, for the 1983–1984 TV season. Heavily promoted prior to broadcast as a competitor to NBC's The Tonight Show Starring Johnny Carson, Thicke of the Night was short-lived.[8]\n\nProducing and composing [ edit ]\n\nThicke had a successful career as a TV theme song composer, often collaborating with his then-wife Gloria Loring on these projects, which included the themes to the popular sitcoms Diff'rent Strokes and The Facts of Life.[9] He also wrote a number of TV game show themes, including The Wizard of Odds (for which he also sang the vocal introduction),[10] The Joker's Wild, Celebrity Sweepstakes, The Diamond Head Game, Animal Crack-Ups (which he co-wrote with his brother Todd Thicke and Gary Pickus), Blank Check, Stumpers!, Whew!,[11] and the original theme to Wheel of Fortune.[12] Thicke was a popular songwriter. He co-wrote \"Sara\", a solo hit for Bill Champlin and included on the latter's Runaway album (1981).[13]\n\nThicke produced a variety of television shows, including Anne Murray Christmas specials for the CBC, beginning in the late 1970s.[14]\n\nGrowing Pains [ edit ]\n\nThicke became well known when he played Jason Seaver, a psychiatrist and father, on the family sitcom Growing Pains.[15] When the show began, Jason was moving his psychiatry practice into the home to be closer to the family's children while the family matriarch Maggie, played by Joanna Kerns, resumed her career as a reporter.[16] Growing Pains debuted on ABC in 1985 and ran until 1992.[15][17] For his role, Thicke was nominated for a Golden Globe award in 1988.[citation needed]\n\nThicke reprised his role in two reunion TV movies, The Growing Pains Movie (2000)[18] and Growing Pains: Return of the Seavers (2004).[19]\n\nTelevision and film appearances [ edit ]\n\nThicke at a Canadian Film Centre and Variety-hosted reception for the Telefilm Canada Features Comedy Lab, March 2012\n\nThicke co-hosted the Walt Disney World Very Merry Christmas Parade (now the Disney Parks Christmas Day Parade) with Joan Lunden from 1983 to 1990, when he was succeeded by Regis Philbin.[20] Thicke also hosted the 1987 and 1988 Crystal Light National Aerobic Championships.[21][22]\n\nIn 1987, Thicke appeared as Dr. Jonas Carson, who creates an android that looks just like a human teenage boy (played by Jay Underwood), and he \"adopts\" him as his son in the Disney Channel film Not Quite Human. Thicke reprised his role as Jonas Carson in two sequels, 1989's Not Quite Human II and 1992's Still Not Quite Human.\n\nIn 1988, he hosted the Miss USA Pageant in El Paso, Texas, replacing Bob Barker (who quit over fur being involved in the pageants).[23] He replaced Barker again as host of the 1988 Miss Universe Pageant (along with Tracy Scoggins) in Taipei, Taiwan.[24] Thicke was replaced by Dick Clark as host of the 1989 Miss USA Pageant in Mobile, Alabama[25] and by John Forsythe as host of the 1989 Miss Universe Pageant in Cancún, Mexico.[26]\n\nThicke continued to host a wide range of variety TV events. In 1989, he co-hosted with SCTV alumna Andrea Martin the TV special Opening of SkyDome in Toronto, which aired across Canada on the CBC.[27][28] In 2004, he hosted the Miss Universe Canada Pageant in Ontario.\n\nIn 1992, Thicke appeared as himself in the pilot episode of the sitcom Hangin' with Mr. Cooper. He appeared in the end-credits scene, alongside series star Mark Curry, humorously referencing the pilot episode being filmed on the same set used as the Seavers' home on Growing Pains. He also made guest appearances on shows such as Murder, She Wrote; Married... with Children; Son of the Beach and 7th Heaven.\n\nFrom 1995 to 1996, Thicke appeared on the American television series Hope & Gloria, which ran for 35 episodes.[29] In March 2002, Thicke participated in a celebrity version of Fear Factor. In May 2002, he appeared in the season six finale of Just Shoot Me, \"The Boys in the Band.\"[30] From 2006 to 2009, Thicke was talk show host Rich Ginger on The Bold and the Beautiful.[31]\n\nFrom 2001 to 2003, Thicke hosted Animal Miracles on the Pax TV network. In April 2006, he hosted Celebrity Cooking Showdown on NBC, in which celebrities were teamed with famous chefs in a cooking competition.[32]\n\nLater appearances [ edit ]\n\nIn 2008, Thicke appeared in a major supporting role as Jim Jarlewski in the television series adaptation of Douglas Coupland's jPod.[33] That same year, he had a cameo appearance in the How I Met Your Mother episode \"Sandcastles in the Sand\" as the dad in Robin Scherbatsky's second \"Robin Sparkles\" music video.[34] He guest starred as himself in the episodes \"The Rough Patch\", \"Glitter\", \"P.S. I Love You\", and \"The Rehearsal Dinner\".[35]\n\nIn February 2009, Thicke made guest appearances on Adult Swim's Tim and Eric Awesome Show, Great Job. and the web series Star-ving.[36] He also had a role in the 2009 film, The Goods: Live Hard, Sell Hard.[37] On 10 July 2009, Alan appeared on the 1000th episode of Attack of the Show!, singing with Kevin Pereira and Olivia Munn, kissing Olivia on lips in the end of the skit.[38]\n\nThicke made a guest appearance on a few episodes of Canada's Worst Handyman 5.[39] In January 2010, Thicke appeared on the television program, Tosh.0.[40] In March 2010, he made an appearance in La La Land as himself. In October 2010, he appeared as a celebrity contestant on Don't Forget the Lyrics, where he played for the charities ProCon.org and the Alan Thicke Center for diabetes research.[41]\n\nIn March 2013, he participated on ABC's Celebrity Wife Swap. He swapped wives with comedian Gilbert Gottfried.[42] From 2014 to 2015, Thicke starred in his own reality series, Unusually Thicke, which aired on Pop.\n\nIn October 2016, Thicke appeared as himself in the pilot episode of NBC's This is Us.[43]\n\nOther hosting [ edit ]\n\nDuring 2014 and 2015 Thicke hosted a travelling dance show Dancing Pros Live which toured the United States.[44]\n\nCommercials [ edit ]\n\nIn the 1990s, Thicke was the spokesman for the Canadian division of Woolco department stores until its demise in 1994.[45] In 2007, Thicke appeared in a television ad for Tahiti Village, a Las Vegas time-share resort.[46][47] In 2009, Thicke began appearing in TV ads endorsing CCS Medical, a distributor of home-delivered diabetes supplies.[48][unreliable source?] In 2014, he began representing Optima Tax Relief.[49]\n\nFrom 2011, Thicke was the spokesperson for Cambridge Life Solutions, a Canadian company that promised to reduce unsecured consumer debt through a method known as debt settlement, which had been outlawed in the United States by the Federal Trade Commission as a predatory practice in 2010 and was subsequently banned in Ontario in 2015. According to Scott Hannah, the president and CEO of the Credit Counseling Society of Canada, the company, which was accused of \"bilking thousands of vulnerable Canadians\" eventually dominated half of the Canadian market due to Thicke's hiring \"as a spokesman who was very credible to Canadians.\"[50]\n\nPersonal life [ edit ]\n\nThicke was married three times: His first marriage, to Days of Our Lives actress Gloria Loring, lasted from 1970 until 1984; they had two sons, Brennan and Robin.[2] In 1987 at the age of 40, Thicke began dating 17-year old Kristy Swanson. Two years later, they were engaged but never married. He married his second wife, Miss World 1990 Gina Tolleson, on 13 August 1994, and had a son, Carter William Thicke, before their divorce was finalized on 29 September 1999.[2] In 1999, he met Tanya Callau in Miami, where he was a celebrity host and she was a model.[51] They were married from 2005 until his death.[52]\n\nThicke lent his name and star power to supporting the Alan Thicke Center for diabetes research.[53] Also, for several years in the mid-1980s, Thicke and Gloria Loring were co-hosts of Telemiracle, an annual 20-hour telethon that alternated between Saskatoon and Regina, Saskatchewan, to support programs run by the Kinsmen Club.[citation needed]\n\nDeath [ edit ]\n\nOn 13 December 2016, Thicke collapsed while playing ice hockey with his son Carter at Pickwick Gardens in Burbank, California. The manager of the rink said he was talking and even joked to his son to take a photo as he was being wheeled out on a stretcher.[54] Thicke died later that day of type-A aortic dissection at the Providence Saint Joseph Medical Center in Burbank, at age 69.[55][56] On 19 December 2016, the cast of Growing Pains, including Leonardo DiCaprio, reunited at Thicke's funeral; a eulogy was given by his friend Bob Saget, and his son, Robin, offered a humorous remembrance. He was buried at Santa Barbara Cemetery in Santa Barbara, California.[57]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nSeries [ edit ]\n\nTelevision movies [ edit ]\n\nBooks [ edit ]\n\nHonours [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/60px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Alan_Thicke.jpg/250px-Alan_Thicke.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/3/3a/Alan_Thicke.jpg", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/CFC_in_LA_%28Alan_Thicke%29.jpg/250px-CFC_in_LA_%28Alan_Thicke%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Alan_Thicke.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Alan_Thicke", "title": "Alan Thicke", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Alan_Thicke.jpg", "width": 772, "height": 1200}, "title": "Alan Thicke - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}