{"url": "https://ew.com/tv/2017/05/12/once-upon-time-ginnifer-goodwin-josh-dallas-emilie-de-ravin-jared-gilmore-exit/", "text": "Ginnifer Goodwin, Josh Dallas, Emilie de Ravin, and Jared Gilmore will not return to Once Upon a Time after season 6, EW has learned.\n\nThe news comes following the previously announced exits of Jennifer Morrison (read her exit interview here) and Rebecca Mader. Once Upon a Time, which was officially renewed for season 7 on Thursday, will now be centered on Regina (Lana Parrilla), Rumple (Robert Carlyle), and Hook (Colin O'Donoghue).\n\nGoodwin, Dallas, and Gilmore, who are original cast members from the pilot, play Snow White, Prince Charming, and Henry Mills, respectively. Snow and Charming are the parents of Emma (Morrison), while Henry is Emma and Regina's (Parrilla) son. De Ravin, meanwhile, joined the show later in season 1 as the iconic Beauty and the Beast heroine Belle.\n\nExecutive producers Adam Horowitz and Edward Kitsis crafted a detailed statement about the many exits and the possibility they will return:\n\n\"Words can't do justice to what Ginny, Josh, Emilie, Rebecca and Jared brought to Once Upon a Time… but we'll try… never have we had the privilege of working with a more talented group of collaborators. Each brought unique talent, incredible intelligence, and their own individual bit of magic as they gave life to these iconic characters. Ginny reinvented Snow White for a modern audience – there was no way she would be stuck cleaning up after dwarfs, she created an iconic empowered heroine for the 21st century. Josh mined the depths of Prince Charming – a character who in myth was just a 'type' but in his superlative interpretation became a complex man fighting for love and family. Emilie took the character of Belle to a deep and soulful place, bringing great intelligence and warmth to the character, making her fiercely independent, strong willed but also an eternal optimist who saw only the best in all those she encountered. Rebecca took us on a broomstick roller coaster ride as she re-invented the Wicked Witch of the West by finding the pain beneath the green. She made the character soar to incredible heights while always keeping her grounded and relatable. And Jared literally grew up before the eyes of millions, from a child actor with enormous innate talent to a young man whose abilities continue to astound as he created a character who truly, as we say on the show, has the heart of the truest believer. We can't thank them enough for the hard work, dedication, and passion they delivered day in and day out. Without them there would be no Once Upon a Time. As Once continues, this group will always be the beating heart of the show. And even though we won't be with them every week, in a show about magic and hope, we fervently believe it won't be the last we see of them.\"\n\nEarlier this year, ABC chief Channing Dungey seemed to indicate there could be possible exits should the show be renewed, noting that the OUAT bosses were looking at the potential seventh season as a springboard in a new direction, \"which doesn't necessarily mean that we're not bringing cast back. It's just: How do you kind of hit the reset button in a way that gives you an opportunity to expand the stories that we're telling?\" Dungey said.\n\nOUAT's season finale, which will air Sunday, is slated to provide a sense of closure, while also launching a new chapter for season 7. That new phase will include the introduction of characters played by The Walking Dead alum Andrew J. West and Jane the Virgin star Alison Fernandez, who will both appear in the season 6 finale, with the potential for more. Check out our theory on that here. And get even more scoop on the finale here.\n\nHowever, Horowitz and Kitsis have previously noted that season 7 will not go through a complete overhaul. \"We're not designing this in a way where you say goodbye to everyone and never see them again,\" Horowitz said. \"We've been telling a story for six years now for these characters and now we're trying to complete that story, but that doesn't mean they don't have other stories.\"\n\nWhen EW hit the set of the ABC fairy tale drama earlier this year, both Dallas and Goodwin seemed optimistic that the show could continue on even with a new set of characters. \"Because things are always so new on our show, there would have to be a radical change in order to infuse it with new direction, and so I'm all for it,\" Goodwin said. \"I feel like these guys are the epitome of creativity, and if anybody can continue a show that's been this inventive, and new, and has always gone in a million directions at once in the most entertaining way, I think its Eddy and Adam, and I'm ecstatic to see what happens.\"\n\nDallas concurred: \"The great thing about Eddy and Adam, and the great thing about the show and the characters that they've created is that they're always reinventing themselves,\" he said. \"I think that's only right with Once Upon a Time that at the end of this season, if it indeed comes back, that it has a completely different reboot, and it goes in a different direction. It's fitting that Once Upon a Time changes as well as its characters.\"\n\nEven so, both seemed hopeful it's not the last we'd see of Snow and Charming. \"I hope there's always some Snow story to tell,\" Goodwin said at the time. \"I have discussed with the guys that in whatever capacity Snow should appear to do right by the story then I will definitely contribute for sure.\"\n\nMuch like Mader released a statement about her exit on social media, so too did de Ravin on Friday evening, explaining that it was not her choice to leave:\n\n\"Dear #oncers. I wanted to tell you guys myself, but it seems the news was already released :/ … I won't be returning to #onceuponatime for Season 7. While I would have loved to continue exploring Belle's journey, the show has decided to move in a different creative direction. Massive thank you to all the fans for your incredible love & support towards me & this character over the past 6 yrs. It's been an honor & a privilege to bring Belle to life :) Congrats to Adam & Eddy & the returning cast & crew!! I wish you all a wonderful 7th Season!! Much love.\"\n\nOnce Upon a Time's two-hour finale airs Sunday at 8 p.m. ET on ABC.", "images": ["https://ew.com/thmb/RqHoqQ4Lxss43NxbjT-w8faxdhQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/FRANKENSTEIN-Jacob-Elordi-Mia-Goth-103125-3667e4e2657a4f3e909aa054dfac60e5.jpg", "https://ew.com/thmb/GtXN9xAJou4IKRsCiS6CVHUwVLg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/TALAMASCA-Maisie-Richardson-Sellers-053025-8d07f8d454f443c8b7e56716bc6c6cc4.jpg", "https://ew.com/thmb/HcYqac9B6mFAAK0cwF7Ys8_QnQI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Percy-Jackson-and-the-Olympians-Tamara-Smart-110425-0530b2d0f4b3400a8e534df10773203e.jpg", "https://ew.com/thmb/aSXklZ9DkMHY8TtljYdqB4Kmmjc=/200x200/filters:no_upscale():max_bytes(150000):strip_icc()/natalie-abrams-image-acc2911b740c4fd7bd230096500a5d95.png", "https://ew.com/thmb/KiccK0nZulpVXbWCAoeARkC3biY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/STRANGERTHINGSSEASON5-103025-10-e15ce5c1bfb8454ba1ab5768add6b3fe.jpg", "https://ew.com/thmb/AeNJ0ShhbizqSXuDXbgPjed56_0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/stranger-things-tales-from-85-110625-2-338ab30fcb854b809a16588ce61cf90c.jpg", "https://ew.com/thmb/N--HuLBQbrtr45KY-LQZhdI1BnM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Calum-Worthy-111525-83fcb412c54c4c5e89fd04a2986c357a.jpg", "https://ew.com/thmb/TS-3FlYR2pZW6WKYIm2tHamKjb0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/zootopia-2524-111425-7ecf7385d984463c91394c431fb0aa85.jpg", "https://ew.com/thmb/IOQ1nXm48FI6hC2sqU1jWpIjc20=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Pluribus-110625-2-0e07695928b54143b6920b7da168dcd8.jpg", "https://ew.com/thmb/ed35vCh8XWctuWtcCyabIUv6-FY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Rhea-Seehorn-Pluribus-102125-0f193517dc214930b836f20d512dd0ef.jpg", "https://ew.com/thmb/4u7bSLgM1tNFwz8JV5VeystuIho=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Mighty-Nein-111825-024633714e724e6a9b7f387abbed5f5b.jpg", "https://ew.com/thmb/L_TrFN2cxsrwhIPyaO6dVOMkZZQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/STRANGERTHINGSSEASON5-103025-06-3ffe87200fce448f949e419afaa3147a.jpg", "https://ew.com/thmb/gi59S4kPk4RGgpF1PfRcO3l0vHc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/JacobElordi-TheAwardistDigitalCoverFINAL-c489820abd2c4c1a934cdd08e0bf201c.jpg", "https://ew.com/thmb/N46Ft50JD-0EU394cCURjCi0Wwo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/millie-bobby-brown-david-harbour-stranger-things-5-premiere-110725-d4a174b1ac014d34924b8225760c20f3.jpg", "https://ew.com/thmb/D8Mt-TIJHaD9Aq85vHczePzZPrQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Pluribus-110425-01-25ed8d47c0374bb7bcafa9f9be12683e.jpg", "https://ew.com/thmb/yLu-6juFkyBU0MyqrZ3AKNKYzNA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/THEBEASTINME-111425-09-0b49c0b96399418c8e13abec20a140d7.jpg", "https://ew.com/thmb/qTgRistNI6p-dJLOpjdCCrRH67o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/gettyimages-619579624-2000-4f81051a5baf434b9b40afb7b69c591d.jpg", "https://ew.com/thmb/rGu8C0wdPYKD7bjc5iEDWyJSsrs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/guillermo-del-toro-oscar-issac-frankenstein-072825-156ae71c22c8431c8d1d6acfe73a95cf.jpg"], "top_img": "https://ew.com/thmb/qTgRistNI6p-dJLOpjdCCrRH67o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/gettyimages-619579624-2000-4f81051a5baf434b9b40afb7b69c591d.jpg", "keywords": [], "authors": ["Natalie Abrams Is A Former Senior Writer At", "Ew'S Editorial Guidelines", "Lauren Huff", "Wesley Stenzel", "Nick Romano", "Allison Degrushe", "Samantha Highfill", "Sydney Bucksbaum", "Gerrad Hall", "Ew Staff"], "canonical_link": "https://ew.com/tv/2017/05/12/once-upon-time-ginnifer-goodwin-josh-dallas-emilie-de-ravin-jared-gilmore-exit/", "title": "Once Upon a Time: Ginnifer Goodwin, Josh Dallas, Emilie de Ravin, Jared Gilmore exit", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "This news comes on the heels of the show's season 7 renewal and the departures of Jennifer Morrison and Rebecca Mader", "parsely-section": "TV", "parsely-tags": "TV Industry,TV Genres,Actors,Sci-Fi & Fantasy Shows,Josh Dallas,Emilie de Ravin,Ginnifer Goodwin,ABC,Once Upon a Time", "article": {"section": "EW", "author": "https://www.facebook.com/entertainmentweekly"}, "og": {"type": "article", "site_name": "EW.com", "url": "https://ew.com/tv/2017/05/12/once-upon-time-ginnifer-goodwin-josh-dallas-emilie-de-ravin-jared-gilmore-exit/", "title": "'Once Upon a Time': Ginnifer Goodwin, Josh Dallas, Emilie de Ravin, and Jared Gilmore Exit", "description": "This news comes on the heels of the show's season 7 renewal and the departures of Jennifer Morrison and Rebecca Mader", "image": "https://ew.com/thmb/qTgRistNI6p-dJLOpjdCCrRH67o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/gettyimages-619579624-2000-4f81051a5baf434b9b40afb7b69c591d.jpg"}, "twitter": {"card": "summary_large_image", "site": "@EW", "title": "'Once Upon a Time': Ginnifer Goodwin, Josh Dallas, Emilie de Ravin, and Jared Gilmore Exit", "description": "This news comes on the heels of the show's season 7 renewal and the departures of Jennifer Morrison and Rebecca Mader", "image": "https://ew.com/thmb/qTgRistNI6p-dJLOpjdCCrRH67o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/gettyimages-619579624-2000-4f81051a5baf434b9b40afb7b69c591d.jpg"}, "vf": {"url": "https://ew.com/tv/2017/05/12/once-upon-time-ginnifer-goodwin-josh-dallas-emilie-de-ravin-jared-gilmore-exit/"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.104.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.104.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.104.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.104.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.104.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": 1494561600.0, "source": "https://ew.com", "summary": ""}