{"url": "www.inquisitr.com/4790472/angelina-jolie-reportedly-has-shocking-effect-on-brad-pitt-jennifer-aniston-turns-to-ex-reports-express/", "text": "Angelina Jolie filed for divorce from Brad Pitt in 2016, but the divorce proceedings still have not been finalized. Consequently, when Jennifer Aniston became single again after separating from Justin Theroux, Jolie reportedly had a shocking influence on Brad’s feelings for Jennifer. As a result, Aniston has turned to her ex-boyfriend, Scottish actor Gerard Butler , an insider told the Express .\n\nGerard Butler Comes Through For Jennifer Aniston\n\nButler and Aniston reportedly stayed close after they dated for about a year. Jennifer and Gerard worked together on the 2010 film The Bounty Hunter . Although Gerard and Jennifer have been talking to each other constantly, don’t look for Aniston to “rush headlong into a new romance right away,” a friend of Aniston told the Express . However, Jennifer appreciates Butler’s return to her life at this time of heartbreak, according to the pal.\n\n“[Jennifer Aniston is] really touched Gerard is doing everything he can to console her. When she’s ready, there’s no doubt he’ll be at her side.”\n\nBut for fans who have been hoping that the Friends actress and Brad would rekindle their romance, the bombshell about Butler’s return to Aniston’s life is disappointing. Now that Pitt and Aniston are both single, why aren’t they ready to mingle together once more? Jennifer’s friend had a shocking answer to that question.\n\nAngelina Jolie, Jennifer Aniston ‘Bad Blood’ Causes Brad Pitt To Steer Clear\n\nFor the many fans hoping that Jennifer and Brad will reunite and even remarry after her split from Justin Theroux, the friend pointed to Angelina Jolie as the reason for Pitt to back off.\n\n“[Brad Pitt and Jennifer Aniston are] never going to happen and there are six little reasons why: Brad’s children with Angelina Jolie.”\n\nJennifer and Angelina allegedly have “so much bad blood between them” that Pitt didn’t dare to reunite with Aniston, according to the insider. Jolie and Pitt have six children: Maddox, Pax, Zahara, Vivienne, Knox, and Shiloh Jolie-Pitt.\n\nAt this point in the custody and divorce proceedings, Brad reportedly is worried about Angelina’s reaction. Jolie and Aniston allegedly are feuding, causing Pitt to fear that Angelina “would hit the roof” if he became romantically involved with Jennifer. Aniston’s friend claimed that the situation could make the divorce proceedings “extremely difficult.”\n\nAlthough some reports have claimed that Pitt already introduced some of his kids to Jennifer when Aniston dropped by for a visit, the insider denied it. Instead, the source said that Brad is steering clear of Jennifer because he doesn’t want Jolie to think “he’d so much as introduced the kids to Jen during a visit.”\n\nBrad Pitt’s Love For Kids Trumps Feelings For Jennifer Aniston\n\nAs the Inquisitr reported, Brad Pitt reportedly had a shocking response when he learned about Jennifer Aniston’s split from Justin Theroux . Even though Pitt empathizes with Aniston’s heartbreak as a result of her split from Justin, Brad reportedly dislikes the publicity that has resulted. Pitt also reportedly is worried about the increased spotlight that would result if he and Jennifer rekindled their romance.\n\nJennifer’s friend told the Express that Brad wants to protect his children and that love has caused him to steer clear of Aniston.\n\n“Brad loves his children dearly and he’s not going to let anyone come between them if doing so would create custody problems and expose them to negative and invasive publicity.”\n\nWhile it’s therefore not likely that Pitt and Aniston will reunite at this point in their lives, Gerard Butler has increased his support for Jennifer, according to the insider. Never married, Butler has been involved in an on-again, off-again relationship with an interior designer, Morgan Brown, for about three years.\n\nGerard once revealed that he feels Jennifer Aniston is a “much better” on-screen kisser than Angelina Jolie. Jen’s friend told the Express that it’s not a coincidence that Gerard has been supporting Jennifer, hinting that he knew her marriage was falling apart long before she and Justin Theroux announced their split.\n\nJennifer and Justin reportedly chose her 49th birthday to split. But a source told the newspaper that to those on the inside, it has been “very obvious” that their marriage was over. Jennifer and Justin “led almost completely separate lives,” added the insider. Theroux was primarily based in New York, while Aniston reportedly preferred their California mansion. That put thousands of miles between the two, causing them to grow “completely apart,” said the source.", "images": ["https://www.inquisitr.com/wp-content/uploads/2025/10/2421769f-57a4-4bff-913f-cf316747493e.jpg", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20500%20157'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20492%20142'%3E%3C/svg%3E", "https://www.inquisitr.com/wp-content/uploads/2024/12/transparent-logo-white.png", "https://secure.gravatar.com/avatar/b080b69e05111d2a8b3b6633f72f8c45?s=120&d=mm&r=g", "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "https://www.inquisitr.com/wp-content/uploads/2024/12/inquisitr-logo.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent-Dark-Mode.png", "https://www.inquisitr.com/wp-content/uploads/2025/02/inquisitr-logo-Transparent.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20120%20120'%3E%3C/svg%3E"], "top_img": "https://www.inquisitr.com/wp-content/uploads/2024/12/apple-touch-icon.png", "keywords": [], "authors": ["News Writer"], "canonical_link": "https://www.inquisitr.com/angelina-jolie-reportedly-has-shocking-effect-on-brad-pitt-jennifer-aniston-turns-to-ex-reports-express", "title": "Angelina Jolie’s Alleged Shocking Impact On Brad Pitt Makes Jennifer Aniston Turn To Ex, Reports ‘Express’", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "https://www.inquisitr.com/wp-content/uploads/2024/12/favicon.png", "description": "Angelina Jolie filed for divorce from Brad Pitt in 2016, but the divorce proceedings still have not been finalized. Consequently, when Jennifer Aniston became", "robots": "follow, index, max-snippet:-1, max-video-preview:-1, max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Angelina Jolie’s Alleged Shocking Impact On Brad Pitt Makes Jennifer Aniston Turn To Ex, Reports ‘Express’ - Inquisitr News", "description": "Angelina Jolie filed for divorce from Brad Pitt in 2016, but the divorce proceedings still have not been finalized. Consequently, when Jennifer Aniston became", "url": "https://www.inquisitr.com/angelina-jolie-reportedly-has-shocking-effect-on-brad-pitt-jennifer-aniston-turns-to-ex-reports-express", "site_name": "Inquisitr News"}, "article": {"tag": "justin theroux", "section": "Entertainment", "published_time": "2018-02-18T08:33:00-05:00"}, "twitter": {"card": "summary_large_image", "title": "Angelina Jolie’s Alleged Shocking Impact On Brad Pitt Makes Jennifer Aniston Turn To Ex, Reports ‘Express’ - Inquisitr News", "description": "Angelina Jolie filed for divorce from Brad Pitt in 2016, but the divorce proceedings still have not been finalized. Consequently, when Jennifer Aniston became", "site": "@theinquisitr", "creator": "@theinquisitr"}, "generator": "WP Rocket 3.18.3"}, "movies": [], "publish_date": 1518960780.0, "source": "http://www.inquisitr.com", "summary": ""}