{"url": "https://www.celebritynetworth.com/richest-businessmen/ceos/mauricio-umansky-net-worth/", "text": "What Is Mauricio Umansky's Net Worth?\n\nMauricio Umansky is a Mexican real estate developer and reality television personality who has a net worth of $100 million. Although Mauricio Umansky is probably most famous for being the husband of Kyle Richards from \"The Real Housewives of Beverly Hills,\" he is an accomplished and well-known figure in his own right. An incredibly successful real estate professional, Umansky sells more than $150 million worth of property in an average year. This number does not include referrals and other commissions for his network of agents. He currently acts as the CEO of The Agency, a successful real estate firm. He has sold $5 billion worth of real estate during his career to date.\n\nEarly Life\n\nMauricio Umansky was born on June 25, 1970, in Mexico. He is the son of a well-known radio and television personality in Mexico called Estella Sneider. Among other things, Estella is a sex therapist, psychologist, and author. Early childhood was not easy for Mauricio, as he was diagnosed with a condition called neutropenia, which is an abnormally low white blood cell count. As a result, he was in and out of hospital from a young age. One year after he was born, his parents gave birth to his younger sister.\n\nAt the age of six, Mauricio moved with his family to the United States. Although he initially attended the University of Southern California, he eventually dropped out to begin his entrepreneurial career.\n\nCareer\n\nUmansky began his business career with a successful clothing line, and he sold it at age 26 for a substantial profit. He then went into real estate, joining a firm established by his brother-in-law called Hilton & Hyland. Mauricio started strong, and his first sale was a $7.5-million property once owned by his wife's ex-husband.\n\nBy 2011, he was ready to establish his own real estate firm, The Agency. Today, Mauricio Umansky is the CEO of the firm, which specializes in luxury properties located in high-end neighborhoods like Beverly Hills, Holmby Hills, Malibu, and Brentwood. According to The Agency's website, Mauricio has $350 million worth of property under inventory, including a single house that is listed for sale at $68.5 million.\n\nThe Agency represents buyers, sellers, and renters of high-end homes and apartments. The company employs more than 650 agents and has over 37 offices across the globe. Umansky often works with some of the most notable celebrities in the world through his real estate business. He has overseen deals connected with the Playboy Mansion, the Disney Estate, and properties owned by rockstar celebrities. In addition, Mauricio helped finalize a deal involving the first-ever LA property to sell for more than $100 million.\n\nSome consider Umansky to be the top real estate agent in the country, and he consistently takes high spots in official real estate agent rankings. Since launching the company, his company has sold more than $1.5 billion worth of property.\n\nIn 2022, Umansky and his family landed a real estate Netflix show titled \"Buying Beverly Hills.\" It has aired two seasons as of this writing.\n\nPersonal Life\n\nMauricio married Kyle Richards in 1996. Kyle would later become famous as a cast member of the reality series \"The Real Housewives of Beverly Hills.\" Kyle and Mauricio have three daughters, Portia, Alexia, and Sophia. He is also step father to Kyle's daughter from a previous relationship, Farra. All four daughters have appeared on \"The Real Housewives\" having extremely elaborate birthday parties.\n\nIn July 2023, rumors spread that Mauricio and Kyle were separating. At first the couple insisted these rumors were false, but it was eventually revealed that they were indeed seeking a divorce. They reportedly do not have a prenuptial agreement.\n\nThrough Kyle, Mauricio is the brother-in-law of Kim Richards, Kathy Hilton, and Rick Hilton. Kathy and Rick are the parents of Paris Hilton and Nicki Hilton, so he is their uncle-in-law.\n\nHis mother is a television and radio personality, sex therapist, psychologist, author, and socialite who has appeared on \"The Real Housewives of Beverly Hills.\" She gets along beautifully with her daughter-in-law, Kyle Richards. She said, \"She is a wonderful wife to my son Mauricio Umansky for 17-plus years, a fabulous mother to my granddaughters, and the best daughter-in-law any mother could have.\"\n\nAside from the typical rich guy activities like golf and tennis, Mauricio is an avid helicopter skier.\n\nFor Mauricio's 50th birthday, Richards got him a tricked-out electric bike and showed it off on her social media, writing: \"You are loved and admired by so many. Whatever you do in life, you give it your all. A lover of life who always sees the glass half full. I admire your strength, confidence, and work ethic (even if I complain about all the business calls). I love your fun, outgoing nature, and sense of adventure (even if our girls [and] I complain about the excursions you take us on we always end up loving it and happy you make us try new things). Thank you for being a loving husband and father and for everything you do for our family. Crazy that we have been together more than half of our lives. I love you so much and hope this birthday brings you continued health [and] happiness!\"\n\nIn July 2020, Mauricio had his hair shaved into a mohawk. Kyle Richards did not like it. In her Instagram stories, Kyle said:\n\n\"My husband has not cut his hair the entire quarantine, and I just found all of this. Oh my god. I have to see this hair.\" She panned over a pile of her husband's hair in the bathroom and went looking for him. \"What have you done to yourself? Are you kidding me?!\" she said when she saw his new mohawk. \"I gave myself a mohawk. I put the 'Moe' into mohawk,\" Mauricio explained. Mauricio did abandon the mohawk. After all, happy wife, happy life.\n\nPersonal Real Estate\n\nIn 2011, Kyle and Mauricio paid $3 million for a mansion in LA's Bel-Air neighborhood. This is the mansion that they used most during the filming of \"The Real Housewives of Beverly Hills.\" They listed the home for sale for the first time in 2017. They finally accepted an offer of $6.5 million in January 2022.\n\nIn October 2017, Kyle and Mauricio paid $8.2 million for a home in Encino, California. In 2023, they took out a $5.4 million mortgage on this home. They also own a home in La Quinta, California, which they bought in 2014 for $2.35 million.", "images": ["https://vz.cnwimg.com/thm/1JoH3482haSLevnlEMdqhrz36y0=/132x132/center/top/filters:format(webp)/2009/11/George-Clooney.jpg", "https://vz.cnwimg.com/thm/I4dSiTJhq0kprSuO--deoPCEAmQ=/132x132/center/top/filters:format(webp)/2020/06/taylor.png", "https://vz.cnwimg.com/wp-content/uploads/2020/06/mauricio.jpg?x46379", "https://vz.cnwimg.com/thm/KNDSqD-9inbRekV6AGgXDEG2Scw=/375x35:810x586/132x132/filters:format(webp):strip_exif()/2015/09/GettyImages-476575299.jpg", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "https://vz.cnwimg.com/thm/0dOqT2nlNQM7u_J-5xWrCsf2nAw=/132x132/center/top/filters:format(webp)/2020/02/Angelina-Jolie.png", "https://vz.cnwimg.com/thm/_hOmdPz8Ht24ZxIeZM7m4mGRouk=/132x132/center/top/filters:format(webp)/2019/11/GettyImages-1094653148.jpg", "https://vz.cnwimg.com/thm/c1jhyxQwW8-EhTQb55QONaU74G0=/132x132/center/top/filters:format(webp)/2020/09/kathy-hilton.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/thm/phwy2-WfW95rh-N8AOs0aQ8kdUE=/132x132/center/top/filters:format(webp)/2020/02/kim-richards-1.jpg", "https://vz.cnwimg.com/thm/IoWqGPmFDjvC6iTqcDsspXBuxqo=/132x132/center/top/filters:format(webp)/2018/03/GettyImages-821622848.jpg", "https://vz.cnwimg.com/thm/ZUzCxjwmueoX38jMcQ8hJrJKLC8=/132x132/center/top/filters:format(webp)/2014/09/Emma-Slater.jpg", "https://vz.cnwimg.com/thm/Kjn_7s5tQhEDOsaUOAyYVFAUAnM=/132x132/center/top/filters:format(webp)/2020/01/altman-thumb.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/thm/Q9QTUO9ke1M8CYi_Xz65i7lnSNc=/600x300/center/top/filters:format(webp)/2020/06/mauricio.jpg", "https://vz.cnwimg.com/thm/dXuAPIEBU--L_kRib4u0nSzjUtE=/132x132/center/top/filters:format(webp)/2020/04/Megan-Fox.jpg", "https://vz.cnwimg.com/thm/Nl5X_2zbqNqReBW5hXx3PU35gos=/132x132/center/top/filters:format(webp)/2020/02/kyle-richards-1.jpg", "https://vz.cnwimg.com/thm/lY3-oCS-xIdiqDaOi1qHd6UaTjg=/132x132/center/top/filters:format(webp)/2009/09/Cristiano-Ronaldo.jpg", "https://vz.cnwimg.com/thm/UxnQSql1h0QyX1CgkPqKhTxCTHM=/132x132/center/top/filters:format(webp)/2009/09/Jennifer-Aniston.jpg", "https://vz.cnwimg.com/thm/95i5RI1LWkjHyyoolMeto-z_WeU=/132x132/center/top/filters:format(webp)/2020/01/lopez3.jpg", "https://vz.cnwimg.com/thm/KFAqJ9F4o80l6an2fe78-0jw28s=/132x132/center/top/filters:format(webp)/2019/04/rr.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2020/06/mauricio.jpg?x46379", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-businessmen/ceos/mauricio-umansky-net-worth/", "title": "Mauricio Umansky Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Mauricio Umansky net worth: Mauricio Umansky is a Mexican real estate developer and reality television personality who has a net worth of", "slick": {"wpversion": "3.0.1", "wppostid": 12479, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2020/06/mauricio.jpg?x46379", "group": "post", "category": "ceos:CEOs"}, ";": "richest-businessmen:Richest Business", "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "cnw": {"wppostid": 12479}, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Mauricio Umansky Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-businessmen/ceos/mauricio-umansky-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2020/06/mauricio.jpg?x46379", "site_name": "Celebrity Net Worth", "description": "What is Mauricio Umansky's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2024-09-09T19:41:17+00:00", "published_time": "2020-06-29T00:04:23+00:00", "section": "CEOs", "tag": "real housewives of beverly hills"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2020/06/mauricio.jpg?x46379", "title": "Mauricio Umansky Net Worth", "description": "Mauricio Umansky net worth: Mauricio Umansky is a Mexican real estate developer and reality television personality who has a net worth of"}}, "movies": [], "publish_date": 1593389063.0, "source": "https://www.celebritynetworth.com", "summary": ""}