{"url": "https://web.archive.org/web/20170725060723/http://time.com/4872107/trump-boy-scout-speech-reactions/", "text": "President Trump's speech at the 2017 Boy Scout Jamboree has drawn criticism from former Boy Scouts and current Scout leaders alike, with some comparing the speech to a \"political rally.\"\n\nDuring Monday night's speech, Trump referred to \"this horrible thing known as Obamacare,\" called for \"more loyalty\" and recounted the night of his election as \"that famous night on television.\" Trump also repeated his claims against \"fake media\" and \"fake news,\" despite commencing the speech by saying \"we're going to put that aside.\"\n\nWhile the speech was interspersed with applause and chants of \"USA! USA! USA!\" from the audience, Trump's comments about Barack Obama and Hillary Clinton also elicited boos from the crowd, which was highlighted by users on social media.\n\nTrump—who was NOT a boy scout—gets @Boyscouts to boo Obama, who was a boy scout. 45 is teaching kids 'great' values. https://t.co/2QklslW5mc - Qasim Rashid, Esq. (@MuslimIQ) July 25, 2017\n\nScouts booing former Boy Scout and former President Obama is classless and disgraceful. - kate4ez (@kate4ez) July 25, 2017\n\nFormer Chief Official White House Photographer Pete Souza made his own comparison between Obama and Trump via Instagram.\n\nI can assure you, POTUS was not telling this Cub Scout and the Boy Scouts who followed about his electoral college victory. A post shared by Pete Souza (@petesouza) on Jul 24, 2017 at 5:10pm PDT\n\nCurrent Scout leaders and former Scouts, as well as parents, also used Twitter to voice their criticism of the nature of Trump's speech.\n\nAs a Scout leader, my stomach is in knots about what Trump did today. If you haven't watched it yet, don't. It's downright icky. - Chris Murphy (@ChrisMurphyCT) July 25, 2017\n\nI'm an Eagle Scout. Trump using the 30,000 BoyScouts as his props tonight was a scene out of Triumph of the Will. Shocking abuse of children - Michael Moore (@MMFlint) July 25, 2017\n\nThis is nauseating. I'm an Eagle Scout and a former scoutmaster. The BSA was never partisan. https://t.co/T6W2jGx8eE - Dan Kennedy (@dankennedy_nu) July 24, 2017\n\nAs Scouts, we were taught never to make our service about politics. Scouts are not supposed to appear in uniform at political events. - Ted Genoways (@TedGenoways) July 25, 2017\n\nAnd yet, Trump saw fit to turn the largest gathering of Boy Scouts into a political gathering, as if they had come together only to see him. - Ted Genoways (@TedGenoways) July 25, 2017\n\nMy son worked hard to become an Eagle Scout and I am horrified to see the org allow itself to be politicized. - Deb Bakes (@BakesDeb) July 25, 2017\n\nIn a statement , the Boy Scouts of America said that it is \"wholly non-partisan and does not promote any one position, product, service, political candidate or philosophy. The invitation for the sitting U.S. President to visit the National Jamboree is a long-standing tradition and is in no way an endorsement of any political party or specific policies.\"", "images": ["https://web.archive.org/web/20170725060723im_/http://time.com/4872107/trump-boy-scout-speech-reactions/", "https://web.archive.org/web/20170725060723im_/https://timedotcom.files.wordpress.com/2017/07/gettyimages-671164306.jpg?h=52", "https://web.archive.org/web/20170725060723im_/https://timedotcom.files.wordpress.com/2017/07/gettyimages-821810776.jpg?w=720", "https://web.archive.org/web/20170725060723im_/https://timedotcom.files.wordpress.com/2017/07/rtx3crft.jpg?h=52", "https://web.archive.org/web/20170725060723im_/https://timedotcom.files.wordpress.com/2017/07/gettyimages-596424526.jpg?h=52"], "top_img": "https://web.archive.org/web/20170725060723im_/https://timedotcom.files.wordpress.com/2017/07/gettyimages-821810776.jpg?w=720", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20170725060723/http://time.com/4872107/trump-boy-scout-speech-reactions/", "title": "Donald Trump: Reactions to 2017 Boy Scout Jamboree Speech", "meta_data": {"description": "President Trump's speech at the 2017 Boy Scout Jamboree has drawn criticism, with some comparing the speech to a \"political rally\"", "keywords": "donald trump, trump, boy scouts, boy scouts jamboree, boy scouts trump, trump boy scouts jamboree, trump boy scouts speech, boy scouts jamboree 2017, trump news", "news_keywords": "donald trump, trump, boy scouts, boy scouts jamboree, boy scouts trump, trump boy scouts jamboree, trump boy scouts speech, boy scouts jamboree 2017, trump news", "og": {"site_name": "Time", "type": "article", "locale": "en_US", "url": "https://web.archive.org/web/20170725060723/http://time.com/4872107/trump-boy-scout-speech-reactions/", "title": "Past and Present Scouts React to Trump's Jamboree Speech", "description": "\"Shocking abuse of children\"", "image": "https://web.archive.org/web/20170725060723im_/https://timedotcom.files.wordpress.com/2017/07/gettyimages-821810776.jpg?w=720"}, "author": "Suyin Haynes", "fb": {"app_id": 53177223193}, "twitter": {"site": "@TIME", "title": "Past and Present Scouts React to Trump's Jamboree Speech", "description": "\"Shocking abuse of children\"", "card": "summary_large_image"}, "article": {"author": "http://time.com/author/suyin-haynes/"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}