{"url": "https://people.com/royals/lifetimes-harry-meghan-a-royal-romance/", "text": "Prince Harry and Meghan Markle’s love story plays out on the small screen in Lifetime’s Harry & Meghan: A Royal Romance, which premieres on Sunday night.\n\nFrom their first blind date to their cozy kitchen engagement, the TV movie captured many of the couple’s milestone moments — and Parisa Fitz-Henley and Murray Fraser’s uncanny resemblance to the real-life couple is worth a double take!\n\nBut what was real and what was just for show? Here’s a breakdown of the show’s major plot points. And, it goes without saying, spoilers ahead!\n\nTrue: Prince Charles Took William and Harry to Africa After Their Mother’s Death\n\nThe first scene opens with brothers Prince William and Prince Harry traveling through Africa with their father, Prince Charles, just after Princess Diana’s death. In real life, Charles brought his sons there to escape the glare of the spotlight following their mother’s death on August 30, 1997. It was a formative trip for Harry, who fell in love with Africa during that time. “I first came in 1997, straight after my mum died. My dad told my brother and me to pack our bags — we were going to Africa to get away from it all,” Harry told Town & Country in 2017. “This is where I feel more like myself than anywhere else in the world. I wish I could spend more time in Africa. I have this intense sense of complete relaxation and normality here.”\n\nFrom left: Prince Philip, Prince William, Charles Spencer, Prince Harry and Prince Charles walk behind Princess Diana's casket at her 1997 funeral. JEFF J. MITCHELL/AFP/Getty\n\nFalse: Prince Harry Was Deep Into the Party Scene Just Before Meeting Meghan\n\nWhile it’s true that he was known as the party prince during his 20s, his partying days were well behind him by the time he met Meghan in 2016. In 2005, Harry’s picture was splashed on front pages around the world showing the then-20-year-old wearing a Nazi uniform at a costume party. He made headlines again after naked photos emerged from his strip billiards game in Las Vegas in 2012. But after retiring from the Army in 2015 after 10 years of service, Harry had reformed his wild ways. And he was ready to find love and settle down. “Harry’s drinking days are over,” a source told PEOPLE. “All of his best friends have settled and had children, so he’s had fewer people to go out and play with. He realized he was getting a bit older and that it was time to settle down a little bit.” Adds Duncan Larcombe, a former royals reporter who traveled with Prince Harry throughout much of the early 2000s: “He desperately wanted to get married and be happy. He sees his brother has found that. The fact that Meghan arrived when she did completes it for Harry.”\n\nLifetime\n\nOwen Humphreys/PA Wire/AP\n\nTrue: Meghan Took Issue with an Ivory Soap Commercial\n\nThe scene where Meghan was offended by a soap commercial geared towards women rings true. Meghan was inspired to change a TV commercial at the age of 11, after seeing a Procter & Gamble commercial that advertised its Ivory dishwashing soap solely to women. The commercial for the soap struck her as unfair and insensitive when she heard, “women all over America are fighting greasy pots and pans.” Meghan’s social studies class had been assigned to watch commercials and assess them. The assignment led to a monumental moment for the future royal. Meghan decided to write to the company and asked them to change their slogan from “Women all over America” to “People all over America.” And her efforts paid off. The commercial aired on TV again, this time with the slogan, “People are fighting greasy pots and pans with Ivory care.” About 20 years after seeing the commercial, Meghan gave a speech about the moment at the United Nations, saying, “I remember feeling shocked and angry and also just feeling so hurt. It just wasn’t right and something needed to be done.\n\nRELATED VIDEO: Harry and Meghan Confirm They Will Uphold a ‘Very Important’ Tradition Involving the Wedding Dress!\n\nTrue: Meghan and Harry Were Set Up on a Blind Date\n\nThe newly-engaged couple revealed that they were set up on a blind date in July 2016 and knew very little about each other before they met. “It was definitely a set-up — it was a blind date,” Harry said during the couple’s revealing engagement interview. “It was a blind date for sure.” And as is shown in the movie, Meghan did ask their matchmaker whether Harry was “nice.” “I didn’t know much about him. And so the only thing that I had asked her when said she wanted to set us up was – I had one question, I said, ‘Well, is he nice?’ Because if he wasn’t kind it just didn’t – it didn’t seem like it would make sense,” Meghan said during their interview.\n\nTrue: One of Their First Dates Was a Trip to Botswana\n\nUnlike what was depicted in the movie, Meghan didn’t spend three days waiting for Harry to call her. In real life, Meghan and Harry’s first date was quickly followed by two back-to-back dates in London, so he was already on speed-dial by that point! But after those initial dates, they did travel together to Botswana. “It was I think about three, maybe four weeks later that I managed to persuade her to come and join me in Botswana,” Harry said of their whirlwind romance. “And we camped out with each other under the stars. She came and joined me for five days out there, which was absolutely fantastic. So then we were really by ourselves, which was crucial to me to make sure that we had a chance to know each other.”\n\nLifetime\n\nRhino Conservation Botswana/ Kensington Palace/Getty\n\nFalse: Will and Kate Cautioned Harry About Dating Meghan\n\nIn the movie, Prince William and Kate Middleton aren’t overly supportive of Harry dating Meghan in the beginning and they express their concern over her background. But Meghan’s future in-laws have always been in the couple’s corner. “She’s been wonderful,” Meghan said of Kate after the couple’s engagement. Harry added: “Amazing, as has William as well, you know, fantastic support.” Meghan, who will be learning on the job, “is funny and serious and extremely hard-working,” a source close to the former Suits star told PEOPLE. “I can imagine Kate will find a great friend in her.”\n\nLifetime\n\nChris Jackson/Getty Images\n\nFalse: Meghan Wasn’t Invited to Pippa Middleton’s Wedding Reception\n\nWhile it’s true that Meghan didn’t receive an invite to Pippa’s wedding ceremony, she was invited to the black-tie reception that followed. Following the ceremony, a source told PEOPLE that Harry would travel back to London to pick Meghan up for the wedding reception in Bucklebury. The royal was spotted driving after the post-church Englefield House party. The fact that she did attend the wedding — even if it was the post-church nighttime bash — was yet another sign that the Suits actress and the prince were getting more and more serious.\n\nTrue: A Royal Relative Wore an Offensive Brooch\n\nWhile it didn’t happen at Pippa’s wedding as depicted in the movie, a royal relative did wear an offensive brooch to the Queen’s annual Christmas lunch, which was attended by Meghan in December 2017. Princess Michael of Kent, the wife of the Queen’s first cousin, was pictured arriving at Buckingham Palace wearing a brooch on her left shoulder which appeared to be “blackamoor” jewelry, depicting the bust of a black person with a gold crown and colorful crystals. The brooch drew further criticism due to Meghan’s biracial background (her mother is Black and her father is white) — and the fact that Princess Michael chose to wear it on the day Meghan was being introduced to many extended royal family members for the first time. Princess Michael of Kent released a statement following the incident that read: “The brooch was a gift and has been worn many times before. Princess Michael is very sorry and distressed that it has caused offense.”\n\nMark Cuthbert/UK Press/Getty\n\nTrue: Harry and Meghan Wore Matching Bracelets\n\nJust like in the movie, Harry did give Meghan a bracelet that matched his own. The couple started sporting “his and hers” jewelry early on in their relationship. They were spotted wearing the same blue beaded bracelet on several occasions. Prince Harry reportedly picked up the bracelet during one of his trips to Africa. And the gift rarely left the actress’s wrist! She even posted several photos on her now-deleted Instagram account showing off her sweet trinket.\n\nMax Mumby/Indigo/Getty; Megan Markle/Instagram\n\nTrue: Meghan Met the Queen\n\nDuring Meghan and Prince Harry’s revealing engagement interview, the couple revealed that the L.A.-born actress had not only met the Queen a couple times already, she also immediately won over her dogs. “It’s incredible,” Meghan said about meeting the Queen. “To be able to meet her through his lens, not just with his honor and respect for her as Monarch, but with the love he has for her as his grandmother. She’s an incredible woman.” Harry then added: “The corgis took to her straight away. ‘I’ve spent the last 33 years being barked at — this one walks in, absolutely nothing.” And Meghan, who has two dogs herself, replied: “They were laying on my feet during tea!”\n\nFalse: Harry’s Public Statement Led to a Breakup\n\nWhile the movie insinuates that Meghan was in the dark about Harry’s rare public statement in November 2016 that confirmed that he was dating the actress and slammed what he called the racist and sexist abuse she had endured since their relationship was revealed, Meghan was most likely fully supportive of that decision. And it didn’t lead to a brief breakup as was depicted in the movie. Since it was such a rare move for a royal family member to release a statement about their private life, Meghan would have been briefed about the statement at length before it was released.\n\nLifetime\n\nAlexi Lubomirski/REX/Shutterstock\n\nFalse: A Member of Harry’s Inner Circle Tried to Intimidate Meghan\n\nThe character of Annabella, played by Marlie Collins, doesn’t exist in real life. But the royal interloper, who chided Meghan about her TV career, biracial background and even her biological clock, did represent a lot of the criticism the couple was facing when they took their relationship public.\n\nTrue: Meghan’s Ex-Husband Is Producing a Show Based on Her Relationship with Prince Harry\n\nTrevor Engelson, Meghan’s ex-husband, is producing an as-of-yet-untitled show with a premise that sounds awfully familiar — because it’s based on his own relationship with Meghan, and her relationship with Prince Harry. The description of the show reads: “Divorce is hard. Sharing custody is harder. Sharing custody with the British Royal family when your wife marries a prince, in the unforgiving spotlight of London’s tabloid media, is next level,” according to Deadline. The idea came to be during a discussion between Engelson — who also works on FX’s Snowfall — and Dan Farah, another one of the show’s producers, where they imagined what life would have been like if Engelson and Markle had children, and he potentially had to share custody (and all the associated drama) with the royal family. Though the basis of the show was hatched from reality, Deadline does add that, “It should be noted that the comedy is fictional, the lead characters are not based on Markle or Engelson, who have no kids together, and she has had no involvement in the project.”\n\nIndianapolis Museum of Art /Getty Images\n\nTrue: Meghan Is Not the First Biracial Royal\n\nAlthough it’s doubtful that the Queen showed Meghan a portrait of Queen Charlotte, a biracial royal, during her palace visit, she is, in fact, a real royal. Queen Charlotte of Mecklenburg-Strelitz was married to King George III and was queen for nearly 60 years, until she died in 1818. She’s the grandmother of Queen Victoria and the great-great-great-great-grandmother of the current Queen Elizabeth. Though she was born in Germany, the daughter of a Duke, Queen Charlotte was directly descended from Margarita de Castro y Sousa, which was the black branch of the Portuguese Royal House. Her racial background wasn’t known to the public when she served as queen. It was only discovered many years after her death, thanks to art historians who studied portraits of Charlotte more closely.\n\nHarry & Meghan: A Royal Romance airs Sunday at 8 p.m. on Lifetime.", "images": ["https://people.com/thmb/jtJVC5-lFXN2l9J6HmAHp2-UxbQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/hmarr_02282018_mc_0356-1-2000-10956c94829942e990e29fdce8425bd7.jpg", "https://people.com/thmb/fdrkA4DEwROjP0MLgd2nu4Gx2s0=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/harry-meghan-13-2000-6a99fedc51a94ba4931f7060efd25035.jpg", "https://people.com/thmb/MZ3j8KZIm6tssgCDNSKsUTYscJs=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/princess-michael-7-83c0e21b3ac24e75b23adfe74e675c13.jpg", "https://people.com/thmb/ZvAhd1PP9kO8x1nmx6CeYcy_3YA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Queen-Elizabeth-Prince-Philip-wedding-1-jpg-cbe332a4d2d0478eb4d1827f590aa3a4.jpg", "https://people.com/thmb/kKCYbiaaybGVP7hNE58GgMOAQoA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(709x0:711x2)/hmarr_02202018_mc_0258-3-1-1-2000-59690f0d6d34491ca4ca9b30a507f0fd.jpg", "https://people.com/thmb/EKlxP0gNpam0YcjHBNxV0IkpMUQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/prince-harry-serena-williams-meghan-markle-baby2baby-gala-west-hollywood-111025-d2d224a5d9a445b9839798ef38914e9d.jpg", "https://people.com/thmb/k2MVcpPRLlF0coL7S6yFEwfocMw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/prince-harry-meghan-markle-110725-bdaa13e8ec84464a88ae53b8344cbde0.jpg", "https://people.com/thmb/26_J2fAXIKk0V705Qyb0Cs44ois=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/meghan-markle-prince-harry-1-111325-07ba1342d900451385e988735fb1cf84.jpg", "https://people.com/thmb/AVQGORoYnErZZt_-xUd8mRMYV1U=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(661x0:663x2)/gettyimages-499067712-da4bd7bdf27645c68cbe87a122caea2b.jpg", "https://people.com/thmb/GkRzcKilPZ2OOM4BVbPXca_j48U=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(511x0:513x2)/prince-harry5-1-ac8249f4841d4f99b89ccd632f27e260.jpg", "https://people.com/thmb/ovFNjWLrSqBrPgcwAplysMT2Dak=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Meghan-Markle-attends-Fortune-Most-Powerful-Women-Summit-2025-meghan-markle-archie-lilibet-111825-77fa47a901cd40ff9ccc169af46c5fd9.jpg", "https://people.com/thmb/bHIJ8R2DpWqAlFfbjlC4D2qRtRg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(296x0:298x2)/meghan-harry-xmas-walk-e3d0453356844e9fb976a160746ee035.jpg", "https://people.com/thmb/vuA_NeJekGVgMYSjpix9u2n5Zio=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/meghan-markle-prince-harry-111125-c76e9b31f1004d14b3a53adf53a51466.jpg", "https://people.com/thmb/_MUmLBReBIePzhQwaTjacFW-OFs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/hmarr_02282018_mc_0356-1-2000-10956c94829942e990e29fdce8425bd7.jpg", "https://people.com/thmb/LFBTixqM_KCxwv9o0fBUWuSvOOg=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/prince-charles-2-d7febd736f3b449781d359c4056e5074.jpg", "https://people.com/thmb/R6D3o4sOuukxwrzvLh8DrNPzSKY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Meghan-Markle-Prince-Harry-Kris-Jenner-110925-3-22ec68a7d8e440d5a6a73609cedb58d3.jpg", "https://people.com/thmb/Xfu-4fcGNtP6CKlcUqmI786NMSA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Meghan-Markle-090824-4ab64512d0f245299e8a82b3c31f2b12.jpg", "https://people.com/thmb/B4v72LCUGnBcbzUYwT_Zzc-ROWA=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/prince-harry-11-16cedbadb09f4867b0d3aec07e7e298c.jpg", "https://people.com/thmb/zNb84YLBb59-BPEl8qeAM9xtZvg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/meghan-markle-prince-harry-111125-c76e9b31f1004d14b3a53adf53a51466.jpg", "https://people.com/thmb/QIniS452eg1fVssrA_GWYzNyGGs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Prince-Harry-Angela-Pearl-Meghan-Markle-111425-tout-d5c78c193a86445a85d2f7cdf806a2be.jpg", "https://people.com/thmb/-aPJGF7eEuNSpx_HO8eN_H19Ym8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Prince-Harry-Canada-111625-dc3cfddd73e04ca9b12f5ba21d59dc57.jpg", "https://people.com/thmb/7RqRekuTgjd-aixVSzUk7OP1zkY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Meghan-Markle-Prince-Harry-Home-Theater-110225-422da875fb14482f9ac37055d0d2534f.jpg", "https://people.com/thmb/mfMQdle1205x-eLVwSgj0kmfIGQ=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/meghan-markle-19-1-2000-773a7431ad3b40c59e2efd0b39fe0862.jpg", "https://people.com/thmb/TlvhHymeVAJMf0_2n85Vz4789u4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/prince-harry-Toronto-Blue-Jays-v-Los-Angeles-Dodgers-2025-110625-a3b870f4c9a645ebb90d4a362ce4ffd8.jpg", "https://people.com/thmb/l1heBQe1jhrtwJjca13fVum5wTk=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/ekaterina-gordeeva-sergei-grinkov-ice-skating-111925-43f6a37ba62840c685a1b57f3a2569ac.jpg", "https://people.com/thmb/JuzCLe6TDIWkeZSCSIOgfpyb0qA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/prince-harry-meghan-markle-kris-jenner-kim-kardashian-birthday2-111125-f2a00c2d35b24b32bf353aebebfed03c.jpg", "https://people.com/thmb/sCPPtn-2YdzFgUeB_aASDkFOiOs=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/h_m_03082018_jz_0260-1-1-2000-1a889f5133b64f3db8bdd213c929f62d.jpg", "https://people.com/thmb/dNO06MF-dGVSWbKogXD3uOi3N1U=/200x200/filters:no_upscale():max_bytes(150000):strip_icc()/ERIN-HILL-_small-3ca66f1b802e465a88bb8940124770a2.jpg", "https://people.com/thmb/Yqde-S_gnuSvbiFL1zW4fegtFok=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/Queen-Elizabeth-Prince-Philip-wedding-1-jpg-cbe332a4d2d0478eb4d1827f590aa3a4.jpg", "https://people.com/thmb/W7pR5Ab5uQ2xdjO8WSlfEinulo0=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/Vencent-Hickerson-111925-6-f70136ab95854fed905274e761d98e0f.jpg", "https://people.com/thmb/lbLhzhd8vhxt2ZIUC2bSyAEqgEg=/343x228/filters:no_upscale():max_bytes(150000):strip_icc()/Prince-Harry-Angela-Pearl-Meghan-Markle-111425-tout-d5c78c193a86445a85d2f7cdf806a2be.jpg", "https://people.com/thmb/jScIqdz9hc6Tunrz5xerhtluJ34=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/hmarr_02272018_mc_0459-1-1-2000-beff7a34f4dc427e8937d25d42cc8d7e.jpg", "https://people.com/thmb/wAV5VoesVrmxB4jeyhu5PWBp3t4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Catherine-Princess-of-Wales-and-Prince-William-Prince-of-Wales-Paddington-Bear-112025-1-4c38aeea69294b63a204af67dce293fd.jpg", "https://people.com/thmb/Ae41PRD717sFqpqb5_G_oPbBl8I=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/kate-middleton-prince-william-engagement-anniversary-111622-2-b707145a44ef41d9904ddff59c1e8f2a.jpg", "https://people.com/thmb/6IyhFgQT3wu0NWP0Aphz5wDFs4s=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/Kelsey-Zach-Top-Riley-Green-111925-f36976ca5eb14ae792f092060f209f93.jpg", "https://people.com/thmb/SLX76p4w-rfRc_Kk1N7oqdNk8qw=/800x533/filters:no_upscale():max_bytes(150000):strip_icc()/meghan-king-5th-Annual-Vanderpump-Dog-Foundation-Gala-2023-jim-edmonds-Busch-Stadium-2024-092425-66f95d42ed374e038155e8e43fc99358.jpg", "https://people.com/thmb/3HWPyxL4lcCwtDjySt1lMVO4mRk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Meghan-Markle-Fortune-Most-Powerful-Women-Summit-As-Ever-Holidays-111525-46766544c7bc40b59fcadabb06d2d949.jpg"], "top_img": "https://people.com/thmb/_MUmLBReBIePzhQwaTjacFW-OFs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/hmarr_02282018_mc_0356-1-2000-10956c94829942e990e29fdce8425bd7.jpg", "keywords": [], "authors": ["Erin Hill", "Erin Hill Is The Senior Editor", "Royals At People. She Has Reported On Royals For The Brand Since Erin Previously Worked At Parade Magazine", "The Knot.", "People Editorial Guidelines", "Brendan Le", "Janine Henni", "Desiree Anello", "Ingrid Vasquez", "Meredith Kile"], "canonical_link": "https://people.com/royals/lifetimes-harry-meghan-a-royal-romance/", "title": "Fact-Checking Lifetime's Harry & Meghan: A Royal Romance", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "From their first blind date to their cozy kitchen engagement, the TV movie captured many of the couple's milestone moments", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "PEOPLE", "sailthru.author": "Erin Hill", "sailthru.tags": "british-royal-family-weddings", "parsely-section": "Royals", "parsely-tags": "People.com,Celebrity,British Royal Family,Person,Entertainment,British Royal Family Weddings,TV,Meghan Markle,Prince Harry,The Scoop", "article": {"section": "People", "author": "https://www.facebook.com/peoplemag"}, "og": {"type": "article", "site_name": "People.com", "url": "https://people.com/royals/lifetimes-harry-meghan-a-royal-romance/", "title": "Inside Lifetime's Harry & Meghan: A Royal Romance: 8 Things That Are True (and 5 That Aren't!)", "description": "From their first blind date to their cozy kitchen engagement, the TV movie captured many of the couple's milestone moments", "image": "https://people.com/thmb/_MUmLBReBIePzhQwaTjacFW-OFs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/hmarr_02282018_mc_0356-1-2000-10956c94829942e990e29fdce8425bd7.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Inside Lifetime's Harry & Meghan: A Royal Romance: 8 Things That Are True (and 5 That Aren't!)", "description": "From their first blind date to their cozy kitchen engagement, the TV movie captured many of the couple's milestone moments", "image": "https://people.com/thmb/_MUmLBReBIePzhQwaTjacFW-OFs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/hmarr_02282018_mc_0356-1-2000-10956c94829942e990e29fdce8425bd7.jpg"}, "vf": {"url": "https://people.com/royals/lifetimes-harry-meghan-a-royal-romance/"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.147.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.147.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.147.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.147.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.147.0/icons/favicons/mstile-310x150.png", "fb": {"pages": 95926963131}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}