{"url": "https://en.wikipedia.org/wiki/Crossover_(fiction)", "text": "Film and video terminology\n\nThis article is about combinations of separate fictional universes in new works. For unauthorised adaptations of existing works, see Mashup . For unauthorised adaptations of existing novels but set in alternative universes, see mashup novel\n\nA crossover is the placement of two or more otherwise discrete fictional characters, settings, or universes into the context of a single story. They can arise from legal agreements between the relevant copyright holders (known as intercompany crossovers), common corporate ownership or unofficial efforts by fans.\n\nThis is different from a spoof, where one discrete character, setting, or universe, copies another character, setting, or universe, often in a comedic manner.\n\nBackground [ edit ]\n\nOfficial [ edit ]\n\nCrossovers often occur in an official capacity in order for the intellectual property rights holders to reap the financial reward of combining two or more popular, established properties. In other cases, the crossover can serve to introduce a new concept derivative of an older one. Another intention is to give fictional characters more emotional credibility and thus increase immersion for the fans.\n\nCrossovers generally occur between properties owned by a single holder, but they can, more rarely, involve properties from different holders, provided that the inherent legal obstacles can be overcome. They may also involve using characters that have passed into the public domain with those concurrently under copyright protection.\n\nA crossover story may try to explain its own reason for the crossover, such as characters being neighbors (notable examples being the casts from The Golden Girls and Empty Nest) or meeting via dimensional rift or similar phenomenon (a common explanation for science fiction properties that have different owners). Some crossovers are not explained at all. Others are absurd or simply impossible within the fictional setting, and have to be ignored by the series' respective continuities. Still others intentionally make the relations between two or more fictional universes confusing, as with The Simpsons and Futurama, where each show is fiction in the other.\n\nUnofficial [ edit ]\n\nIn contrast with legal crossovers, unofficial crossovers are created solely because of the artistic pleasure derived by their creators. Unofficial crossovers often take the form of fan-written fiction[1] and fan art, but the trope is increasingly prevalent in amateur films and audio. Whereas official crossovers are frequently stymied by such concerns as copyright, royalties payments, quality of writing and ownership of the characters, unofficial crossovers are unfettered by such concerns, so long as property holders do not exercise their right to enjoin the distribution of such material. A good example would be the unauthorised live action fan film Batman: Dead End which brings together the properties of Batman, Alien and Predator in one setting.\n\nUnofficial crossovers can also occur in a \"what-if\" scenario. Roger makes frequent cameo appearances in Family Guy, while Brian makes cameos on American Dad!. Roger, Rallo Tubbs and Klaus Heissler were seen in the final Family Guy Star Wars spoof, \"It's A Trap!\", as Moff Jerjerrod, Nien Nunb and Admiral Ackbar, respectively. Stewie also appears as an interactive hallucination of Booth on Bones when the agent has issues over possibly becoming a sperm donor, with David Boreanaz (who plays Booth) repaying the favor in \"Road to the North Pole\". An appearance by Elmo, from Sesame Street, was made, in a hallucination of Connie Ray's, on TV sitcom The Torkelsons. Fan fiction fusions between different science fiction movies and series are often created, such as Star Wars and Star Trek or Babylon 5 and Stargate. M.U.G.E.N. is a fighting game engine that features many fan-created and fictional characters and stages from various television series, movies, as well as other video games.\n\nLiterature [ edit ]\n\nThe first popular crossover in literature was the 1885 Mark Twain novel, The Adventures of Huckleberry Finn, which had an important guest appearance by Tom Sawyer. Similarly, Lady Glencora Palliser from the Pallisers series of Anthony Trollope appears towards the end of Miss Mackenzie, a novel published between the first and second Palliser novels in 1865, a character first introduced in the novel, Can You Forgive Her? (1864). Andrew Lang's 1890 collection, Old Friends: Essays in Epistolary Parody, contains letters combining characters from different sources, including one based on Jane Austen's Northanger Abbey and Charlotte Brontë's Jane Eyre.[2]\n\nKim Newman frequently uses this device, as does Stephen King. The works of James Branch Cabell, J. D. Salinger, William Faulkner, Margaret Laurence, Thomas Pynchon, Kurt Vonnegut, Mordecai Richler, Sir H. Rider Haggard, Edgar Rice Burroughs, Robert Heinlein and Isaac Asimov also cross over with each other, linking different characters and settings together over a number of different works.\n\nIllustrator Howard Pyle conceived his work Twilight Land as one such crossover. In it, a nameless narrator is transported to \"Twilight Land\" and meets famous fairy tale characters for a soirée in an inn: Mother Goose, Cinderella, Fortunatus, Sinbad the Sailor, Aladdin, Boots, the Valiant Little Tailor and others gather in the framing device and tell each other adventurous tales featuring other literary personages.[3]\n\nFrench author Jules Lemaître wrote a sort of sequel to Cinderella, named Princess Mimi, where Cinderella's daughter is courted by Polyphemus and Charles Perrault's Hop-o'-My-Thumb.[4][5]\n\nAnime and manga [ edit ]\n\nAnime has also participated in many crossover events featuring characters or shows from the same company or network. One of the biggest projects down would be Dream 9 Toriko x One Piece x Dragon Ball Z Super Special Collaboration as it includes three Shonen Jump franchises, being Dragon Ball Z, One Piece and Toriko, crossed over into an hour long special-like most crossovers, this special is filler, a fan-service episode that follows the common plot line in most crossovers. What makes this crossover unique is when the characters from all three shows split into groups, where the members all share the same clichéd character archetypes, such the main characters Goku, Luffy and Toriko falling into the dumb, good-natured, strong character archetype.[6]\n\nManga artist Leiji Matsumoto has been known to cross over the characters of his various stories and characters such as Captain Harlock, Galaxy Express 999 and Queen Millennia, all of which were originally written as separate, self-contained stories. In the Maetel Legend, Queen Promethium is revealed to be having been Yukino Yaoi, the protagonist from Queen Millennia. Matsumoto has also created various crossovers with Space Battleship Yamato, an anime on which he served as director, although the rights to Yamato are actually owned by Yoshinobu Nishizaki.\n\nTelevision series [ edit ]\n\nBetween established shows [ edit ]\n\nCrossovers involving principals can also occur when the characters have no prior relationship, but are related by time period, locale or profession. The Law and Order series, for example, afford a commonality of setting and profession which lends itself to crossovers, both within the franchise and in a wider universe. Following the cancellation of the ABC soap opera One Life to Live and its high-rated finale, several characters crossed over into the network's remaining soap opera General Hospital, remaining in the same timeline as their former show.\n\nCharacters Kyle Barker & Max Shaw from the sitcom Living Single made an appearance in Half & Half. Their appearance came seven years after the end of Livin' Single and confirmed that Kyle and Max had remained a couple and were raising a family.\n\nIn 1992, sitcoms Fresh Prince of Bel-Air and the short-lived Out All Night crossed over briefly when Hilary Banks appears as a customer at Chelsea's Club.\n\nIn 1993, British soap opera EastEnders aired a two part crossover with Doctor Who for the annual Children in Need telethon. During the 2010 telethon, EastEnders crossed over with Coronation Street, another prominent soap opera, for a special fifteen minute episode, titled EastStreet. [7]\n\nBetween related shows [ edit ]\n\nThough most common on shows of the same production company (see, for example, \"Hurricane Saturday\"), crossovers have also occurred because shows share the same distributor or television network. A notable example of this kind of link is that between Murder, She Wrote and Magnum, P.I. These shows were made by different companies, but owned by Universal Studios and broadcast on CBS. Another case is that of Mad About You and Friends, which share the character of Ursula Buffay. Neither show shares any production or distribution commonality, but rather an actress (Lisa Kudrow), a setting (New York City) and a schedule (Friends initially followed Mad About You on NBC's Thursday night schedule).\n\nMad About You and Friends share another type of \"network crossover\". On rare occasions, networks have chosen to theme an entire night's programming around a crossover \"event\". In one case, a New York City blackout caused by Paul Reiser's character on Mad About You was experienced by the characters on Friends and Madman of the People.[8] Such \"event nights\" can also be linked by a single character's quest across multiple shows on the same evening. ABC attempted this kind of \"event night\" crossover with its Friday night programming during the 1997 season. There, they proposed that the title character of Sabrina the Teenage Witch should chase her cat, Salem, through Boy Meets World, You Wish and Teen Angel because it had run away with a \"time ball\" that was displacing each show through time.[9]\n\nIn 2004, Shed Productions produced a crossover between the TV shows Bad Girls and Footballers' Wives, where the Footballers' Wives character Tanya Turner was sent to HMP Larkhall in Bad Girls for three episodes of the sixth series from 17th May 2004 to 19th May 2004. In the storyline, Tanya is imprisoned for drug charges after her nemesis Amber planted cocaine in her bag during the third series. Her time in prison involved a mystery poisoning and other dramatic events, ending with her release after making a deal. To mark the crossover Bad Girls aired over three consecutive nights before going on a three month hiatus. [10]\n\nIn 2006, Disney Channel produced a crossover between three of their sitcoms titled That's So Suite Life of Hannah Montana. Episode one \"Checkin' Out\" aired as in the fourth season of That's So Raven. Episode two, titled \"That's So Suite Life of Hannah Montana\" aired in the second season episode of The Suite Life of Zack & Cody. The third and final episode titled \"On the Road Again\" aired in the first season of Hannah Montana. The storyline focused on both Raven Baxter and Hannah Montana being guests at the Tipton Hotel.[11]\n\nIn 2013, the Canadian crime drama series Republic of Doyle and Murdoch Mysteries produced a crossover,[12] which was complicated by the shows' incompatible historical settings; Murdoch Mysteries is a historical series set in the 1890s, while Republic of Doyle is set in the present day. The problem was solved by having the actors cross over as relatives of their primary characters; Allan Hawco appeared on the November 25, 2013 episode of Murdoch Mysteries as Jacob Doyle, a 19th-century ancestor of his regular character Jake Doyle, while Yannick Bisson appeared on a January 2014 episode of Republic of Doyle as Bill Murdoch, a 21st-century descendant of his regular character William Murdoch.[12]\n\nIn 2025, British soap opera Hollyoaks celebrated it's thirtieth anniversary and crossed over with Brookside. Brookside had ceased production in 2003 and most of their sets had since been used in the production of Hollyoaks. Many characters from Brookside appeared and the original closing storyline had been retconned. Both soap opera's were created by Phil Redmond, and it was previously established that the programmes existed in a shared universe when Brookside character Matt Musgrove (Kristian Ealey) transitioned into Hollyoaks in February 2000. [13]\n\nThe earliest example of a crossover in children's television was PBS's 1971 program The Electric Company.\n\nPromotional cameos [ edit ]\n\nCrossovers can take the form of a promotional cameo appearance, used to draw attention to another work of fiction, with little rational explanation in the context of the hosting show's narrative. When not clearly presented as parody, this is frequently scorned by fans as blatant commercialism. A notable example of this is The Simpsons episode \"A Star Is Burns\", in which the character of Jay Sherman (from The Critic) appeared. It originally aired on March 5, 1995, on FOX right before The Critic began its second season, its first season having aired on ABC. This episode was largely condemned by fans of The Simpsons as existing to promote The Critic, an animated series considered inferior by comparison. Even Simpsons creator Matt Groening objected, preferring to remove his name from the credits of that particular episode in protest.[14]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/60px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Yogi_Bear_and_Gremlins_in_Teen_Titans_Go%21.png/1200px-Yogi_Bear_and_Gremlins_in_Teen_Titans_Go%21.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/Ile_Mysterieuse_02.jpg/250px-Ile_Mysterieuse_02.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Yogi_Bear_and_Gremlins_in_Teen_Titans_Go%21.png/250px-Yogi_Bear_and_Gremlins_in_Teen_Titans_Go%21.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/20px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Ivan_Tsarevich_and_cameo_appearances_of_Pepper_and_Carrot_in_Morevna_Project_episode_4.png/250px-Ivan_Tsarevich_and_cameo_appearances_of_Pepper_and_Carrot_in_Morevna_Project_episode_4.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Yogi_Bear_and_Gremlins_in_Teen_Titans_Go%21.png/1200px-Yogi_Bear_and_Gremlins_in_Teen_Titans_Go%21.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Crossover_(fiction)", "title": "Crossover (fiction)", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Yogi_Bear_and_Gremlins_in_Teen_Titans_Go%21.png/1200px-Yogi_Bear_and_Gremlins_in_Teen_Titans_Go%21.png", "width": 1200, "height": 675}, "title": "Crossover (fiction) - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}