{"url": "https://en.wikipedia.org/wiki/Tom_Hanks", "text": "American actor and filmmaker (born 1956)\n\nThis article is about the American actor. For the seismologist, see Thomas C. Hanks\n\nThomas Jeffrey Hanks (born July 9, 1956) is an American actor and filmmaker. Known for both his comedic and dramatic roles, he is one of the most popular and recognizable film stars worldwide, and is regarded as an American cultural icon.[2] Hanks is ranked as the fourth-highest-grossing American film actor.[3][4] His numerous awards include two Academy Awards, seven Emmy Awards, and four Golden Globe Awards; he has also been nominated for five BAFTA Awards and a Tony Award. He received the AFI Life Achievement Award in 2002, the Kennedy Center Honor in 2014, the Presidential Medal of Freedom in 2016, and the Golden Globe Cecil B. DeMille Award in 2020.[5][6][7]\n\nHanks rose to fame with leading roles in the comedies Splash (1984), The Money Pit (1986), Big (1988), and A League of Their Own (1992). He won two consecutive Academy Awards for Best Actor, playing a gay lawyer suffering from AIDS in Philadelphia (1993), then the title character in Forrest Gump (1994).[8] Hanks has collaborated with Steven Spielberg on five films—Saving Private Ryan (1998), Catch Me If You Can (2002), The Terminal (2004), Bridge of Spies (2015) and The Post (2017)—and three World War II-themed miniseries: Band of Brothers (2001), The Pacific (2010) and Masters of the Air (2024). He has also frequently collaborated with directors Ron Howard, Nora Ephron and Robert Zemeckis.\n\nHanks cemented his film stardom with lead roles in the romantic comedies Sleepless in Seattle (1993) and You've Got Mail (1998); the dramas Apollo 13 (1995), The Green Mile (1999), Cast Away (2000), Road to Perdition (2002), Cloud Atlas (2012) and News of the World (2020); and the biographical dramas Charlie Wilson's War (2007), Captain Phillips (2013), Saving Mr. Banks (2013), Sully (2016), A Beautiful Day in the Neighborhood (2019) and Elvis (2022). He played the title character in the Robert Langdon series (2006–2016) and voiced Sheriff Woody in the Toy Story franchise (1995–present) and multiple roles in The Polar Express (2004). Hanks directed and acted in That Thing You Do! (1996) and Larry Crowne (2011).\n\nHis breakthrough television role was a co-lead in the ABC sitcom Bosom Buddies (1980–1982). He has hosted Saturday Night Live ten times[9] and launched a production company, Playtone, which has produced various limited series and television movies, including From the Earth to the Moon (1998), Band of Brothers, John Adams (2008), The Pacific, Game Change (2012) and Olive Kitteridge (2015). He made his Broadway debut in Nora Ephron's Lucky Guy (2013), earning a nomination for the Tony Award for Best Actor in a Play.[10]\n\nEarly life, family, and education\n\nHanks was born in Concord, California,[11] on July 9, 1956,[12] to hospital worker Janet Marylyn (née Frager) and itinerant[13][14] cook Amos \"Bud\"[15][16] Hanks. His mother was from a Portuguese family; their surname was originally \"Fraga\".[17] His father had English ancestry,[18] and through his line, Hanks is a distant cousin of Nancy Hanks and her son President Abraham Lincoln[19][20] and children's host Fred Rogers (who Hanks has portrayed in a film role).[21][22]\n\nHanks' parents divorced in 1960.[23] Their three oldest children, Sandra (later Sandra Hanks Benoiton, a writer),[24] Larry (who became an entomology professor at the University of Illinois Urbana-Champaign),[25][26] and Tom, went with their father, while the youngest, Jim (who also became an actor and filmmaker), remained with their mother in Red Bluff, California.[27] In his childhood, Hanks' family moved often. By age ten, he had lived in ten different houses.[28]\n\nHis family's religious history was Catholic and Mormon.[29] One journalist characterized Hanks' teenage self as being a \"Bible-toting evangelical\" for several years.[30] In school, he was unpopular with students and teachers alike, later telling Rolling Stone magazine, \"I was a geek, a spaz. I was horribly, painfully, terribly shy. At the same time, I was the guy who'd yell out funny captions during filmstrips. But I didn't get into trouble. I was always a real good kid and pretty responsible.\"[31] Hanks acted in school plays, including South Pacific, while attending Skyline High School in Oakland, California.[32]\n\nHaving grown up in the Bay Area, Hanks says that some of his first movie memories were seeing movies in the Alameda Theatre.[33] Hanks studied theater at Chabot College in Hayward, California,[34] and transferred to California State University, Sacramento after two years.[35][36] During a 2001 interview with sportscaster Bob Costas, Hanks was asked whether he would rather have an Oscar or a Heisman Trophy. He replied that he would have rather won a Heisman by playing halfback for the California Golden Bears.[37] He told New York magazine in 1986, \"Acting classes looked like the best place for a guy who liked to make a lot of noise and be rather flamboyant. I spent a lot of time going to plays. I wouldn't take dates with me. I'd just drive to a theater, buy myself a ticket, sit in the seat and read the program, and then get into the play completely. I spent a lot of time like that, seeing Brecht, Tennessee Williams, Ibsen, and all that.\"[38]\n\nDuring his years studying theater, Hanks met Vincent Dowling, head of the Great Lakes Theater Festival in Cleveland, Ohio.[15] At Dowling's suggestion, Hanks became an intern at the festival. His internship stretched into a three-year experience that covered most aspects of theater production, including lighting, set design, and stage management, prompting Hanks to drop out of college. During the same time, Hanks won the Cleveland Critics Circle Award for Best Actor for his 1978 performance as Proteus in Shakespeare's The Two Gentlemen of Verona, one of the few times he played a villain.[39]\n\nCareer\n\n1980–1989: Early work, sitcom and comedy films\n\nHanks at the Academy Awards after-party in March 1989\n\nIn 1979, Hanks moved to New York City, where he made his film debut in the low-budget slasher film He Knows You're Alone (1980)[15][40] and landed a starring role in the television movie Mazes and Monsters (1982).[41] Early that year, he was cast as the lead, Callimaco, in the Riverside Shakespeare Company's production of Niccolò Machiavelli's The Mandrake, directed by Daniel Southern.[42] The following year, Hanks landed one of the lead roles, that of character Kip Wilson, on the ABC television pilot of Bosom Buddies. He and Peter Scolari played a pair of young advertising men forced to dress as women so they could live in an inexpensive all-female hotel.[15] Hanks had previously partnered with Scolari on the 1970s game show Make Me Laugh. After landing the role, Hanks moved to Los Angeles. Bosom Buddies ran for two seasons, and, although the ratings were never strong, television critics gave the program high marks. \"The first day I saw him on the set,\" co-producer Ian Praiser told Rolling Stone, \"I thought, 'Too bad he won't be in television for long.' I knew he'd be a movie star in two years.\"[43]\n\nHanks made a guest appearance on a 1982 episode of Happy Days (\"A Case of Revenge\", in which he played a disgruntled former classmate of Fonzie) where he met writers Lowell Ganz and Babaloo Mandel who were writing the film Splash (1984), a romantic comedy fantasy about a mermaid who falls in love with a human, to be directed by former Happy Days star Ron Howard. Ganz and Mandel suggested Howard consider Hanks for the film.[44][45][46] At first, Howard considered Hanks for the role of the main character's wisecracking brother, a role that eventually went to John Candy. Instead, Hanks landed the lead role in Splash, which went on to become a surprise box office hit, grossing more than US$69 million.[47] He had a sizable hit with the sex comedy Bachelor Party, also in 1984.[48] In 1983–84, Hanks made three guest appearances on Family Ties as Elyse Keaton's alcoholic brother Ned Donnelly.[49][50]\n\nWith Nothing in Common (1986)—a story of a young man alienated from his father (Jackie Gleason)—Hanks began to extend himself from comedic roles to dramatic. In an interview with Rolling Stone, Hanks commented on his experience: \"It changed my desires about working in movies. Part of it was the nature of the material, what we were trying to say. But besides that, it focused on people's relationships. The story was about a guy and his father, unlike, say, The Money Pit, where the story is really about a guy and his house.\"[51] In 1987, he had signed an agreement with The Walt Disney Studios where he had starred to a talent pool in an acting/producing pact.[52] After a few more flops and a moderate success with the comedy Dragnet (1987), Hanks' stature in the film industry rose.\n\nThe broad success of the fantasy comedy Big (1988) established Hanks as a major Hollywood talent, both as a box office draw and within the industry as an actor.[48][15][53] For his performance in the film, Hanks earned his first nomination for the Academy Award for Best Actor.[54] Big was followed later that year by Punchline, in which he and Sally Field co-starred as struggling comedians. Hanks then suffered a run of box-office underperformers: The 'Burbs (1989), Joe Versus the Volcano (1990) and The Bonfire of the Vanities (1990).[15] In the last, he portrayed a greedy Wall Street figure who gets enmeshed in a hit-and-run accident. Turner & Hooch (1989) was Hanks' only financially successful film of the period.\n\n1990–1999: Leading man and acclaim\n\nHanks climbed back to the top again with his portrayal of a washed-up baseball legend turned manager in Penny Marshall's A League of Their Own (1992).[15] Hanks has said that his acting in earlier roles had not been great, but that he later improved. In an interview with Vanity Fair, Hanks called attention to what he called his \"modern era of moviemaking ... because enough self-discovery has gone on ... My work has become less pretentiously fake and over the top\". This \"modern era\" began in 1993 for Hanks, first with Nora Ephron's Sleepless in Seattle and then with Jonathan Demme's Philadelphia.\n\nSleepless in Seattle is a romantic comedy about a widower who finds true love over the radio airwaves. Hanks co-starred with Meg Ryan.[55] Richard Schickel of TIME called his performance \"charming\", and most critics agreed that Hanks' portrayal ensured him a place among the premier romantic-comedy stars of his generation.[56] In Philadelphia, he played a gay lawyer with AIDS who sues his firm for discrimination.[15] Hanks lost 35 pounds (16 kg) and thinned his hair in order to appear sickly for the role. In a review for People, Leah Rozen stated, \"Above all, credit for Philadelphia's success belongs to Hanks, who makes sure that he plays a character, not a saint. He is flat-out terrific, giving a deeply felt, carefully nuanced performance that deserves an Oscar.\" Hanks won the 1993 Academy Award for Best Actor for his role in Philadelphia.[15][57] During his acceptance speech, he revealed that two people with whom he was close, his high school drama teacher Rawley Farnsworth and his former classmate John Gilkerson, were gay.[58]\n\nHanks on the film set of Forrest Gump (1994)\n\nHanks followed Philadelphia with Robert Zemeckis's Forrest Gump (1994), playing the title character, a man with an IQ of 75 who happens to find himself involved with some of the major events in recent American history. It grossed a worldwide total of more than $600 million.[59] Hanks remarked, \"When I read the script for Gump, I saw it as one of those kind of grand, hopeful movies that the audience can go to and feel ... some hope for their lot and their position in life ... I got that from the movies a hundred million times when I was a kid. I still do.\" Hanks won his second Best Actor Academy Award for his role in Forrest Gump, becoming only the second actor to have accomplished the feat of winning consecutive Best Actor Oscars.[60] (Spencer Tracy was the first, winning in 1937 and ‘38 for Captains Courageous and Boys Town. Hanks and Tracy were the same age at the time they received their Academy Awards: 37 years old when they won their first and 38 when they won their second.)[61][62]\n\nHanks reunited with Ron Howard to play astronaut and commander Jim Lovell in Apollo 13 (1995).[15] Critics generally applauded the film and the performances of the entire cast, which included Kevin Bacon, Bill Paxton, Gary Sinise, Ed Harris and Kathleen Quinlan. The movie earned nine Academy Award nominations, winning two. Hanks also starred in Pixar's Toy Story (1995) as the voice of Sheriff Woody.[63] Hanks made his directing debut with That Thing You Do! (1996), about a 1960s pop group; he also played the role of a music producer in the film.[64][65] Hanks and producer Gary Goetzman went on to create Playtone, a record and film production company named after the record company in the film.[66][67]\n\nHanks then executive produced, co-wrote and co-directed the HBO docudrama From the Earth to the Moon (1998). The 12-part series chronicled the space program from its inception, through the familiar flights of Neil Armstrong and Jim Lovell, to the personal feelings surrounding the reality of Moon landings. The Emmy Award–winning project was, at $68 million (equivalent to $131 million in 2024), one of the most expensive ventures undertaken for television.[68][69]\n\nFor Saving Private Ryan (1998), he worked with Steven Spielberg to make a film about a search through war-torn France after D-Day to bring home a soldier.[70] It earned the praise and respect of the film community, critics and the general public.[71] Hailed as one of the finest war films ever made, it earned Spielberg his second Academy Award for direction, and Hanks another Best Actor nomination.[72] Later that year, Hanks re-teamed with Ephron and Ryan for You've Got Mail, a remake of Ernst Lubitsch's The Shop Around the Corner (1940).[48] He starred in Frank Darabont's The Green Mile (1999), based on the novel of the same name by Stephen King.[73] Hanks reprised the role of Woody in Toy Story 2 (1999).\n\n2000–2009: Established star and expansion\n\nHanks in 2009\n\nHanks reunited with Zemeckis for Cast Away (2000), playing a marooned FedEx systems analyst. Roger Ebert of The Chicago Sun-Times wrote: \"Hanks proves here again what an effective actor he is, never straining for an effect, always persuasive even in this unlikely situation, winning our sympathy with his eyes and his body language when there's no one else on the screen.\"[74] Hanks co-directed and produced the Emmy Award-winning HBO miniseries Band of Brothers (2001).[75] He also appeared in the September 11 television special America: A Tribute to Heroes and the documentary Rescued From the Closet.[76] In 2002, he teamed up with Sam Mendes for Road to Perdition, an adaptation of the adaptation of Max Allan Collins's and Richard Piers Rayner's comics, in which he played an anti-hero role as a hitman on the run with his son. Hanks reunited with Spielberg, starring opposite Leonardo DiCaprio in Catch Me If You Can (2002), based on the true story of conman Frank Abagnale, Jr. Hanks and his wife Rita Wilson produced My Big Fat Greek Wedding (2002).[77][78] In August 2007, Hanks, along with co-producers Wilson and Gary Goetzman and writer and star Nia Vardalos, initiated a legal action against the production company Gold Circle Films for their share of profits from the movie.[79][80][81] At the age of 45, Hanks became the youngest-ever recipient of the American Film Institute's Life Achievement Award on June 12, 2002.[82][83]\n\nHanks at Post-Emmys Party, September 2008\n\nIn 2004, he appeared in three films: The Coen brothers' The Ladykillers, Spielberg's The Terminal and Zemeckis' The Polar Express, a family film for which Hanks played multiple motion capture roles. In a USA Weekend interview, Hanks discussed how he chooses projects: \"[Since] A League of Their Own, it can't be just another movie for me. It has to get me going somehow ... There has to be some all-encompassing desire or feeling about wanting to do that particular movie. I'd like to assume that I'm willing to go down any avenue in order to do it right\". In August 2005, Hanks was voted in as vice president of the Academy of Motion Picture Arts and Sciences.[84] Hanks next starred in The Da Vinci Code (2006), which grossed over US$750 million worldwide.[85] In 2006, Hanks topped a 1,500-strong list of \"most trusted celebrities\" compiled by Forbes magazine.[86] He produced the animated children's movie The Ant Bully and Starter for Ten, a comedy about working-class students attempting to win on University Challenge.[87]\n\nHanks did voice work for Ken Burns's documentary The War (2007), reading excerpts from World War II-era columns by Al McIntosh. Hanks voiced himself in The Simpsons Movie (2007), in which he appeared in an announcement claiming that the U.S. government has lost its credibility and is hence buying some of his. He also made an appearance in the credits, expressing a desire to be left alone when he is out in public. He starred in Mike Nichols's Charlie Wilson's War (2007) as Democratic Texas Congressman Charles Wilson. In the comedy-drama film The Great Buck Howard (2008), Hanks played the on-screen father of a young man (played by Hanks' real-life son Colin) who chooses to work as road manager for a fading mentalist (John Malkovich). His character was less than thrilled about his son's career decision.[88] In the same year, he executive produced the musical comedy Mamma Mia! and the miniseries John Adams.[89][90]\n\nHanks' next endeavor was Angels & Demons (2009). Its April 11, 2007, announcement revealed that Hanks would reprise his role as Robert Langdon, and that he would reportedly receive the highest salary ever for an actor.[91][92] The following day he made his 10th appearance on NBC's Saturday Night Live, impersonating himself for the Celebrity Jeopardy sketch. Hanks produced Spike Jonze's Where The Wild Things Are (2009), based on the children's book by Maurice Sendak.[93]\n\n2010–2019: Broadway debut and other roles\n\nHanks reprised his role of Woody in Toy Story 3 (2010) after he, Tim Allen and John Ratzenberger were invited to a movie theater to see a complete story reel of the movie.[94] The film went on to become the highest-grossing animated film at the time.[95][96][97] He executive produced the miniseries The Pacific (2010).[98] In 2011, he directed and starred opposite Julia Roberts in the title role in the romantic comedy Larry Crowne.[99] The movie received poor reviews, with only 35% of the 175 Rotten Tomatoes reviews giving it high ratings.[100] Also in 2011, he starred in the drama Extremely Loud and Incredibly Close.[101] In 2012, he voiced the character Cleveland Carr for a web series he created, Electric City.[102] He played multiple parts in Cloud Atlas (2012), based on the novel of the same name by David Mitchell, and was executive producer of the miniseries Game Change.[103]\n\nIn 2013, Hanks starred in two critically acclaimed films—Paul Greengrass's Captain Phillips and John Lee Hancock's Saving Mr. Banks—which earned him praise, including nominations for the BAFTA Award for Best Actor in a Leading Role and the Golden Globe Award for Best Actor – Motion Picture Drama for the former role.[104][105] In Captain Phillips, he starred as Captain Richard Phillips with Barkhad Abdi, which was based on the Maersk Alabama hijacking.[106] In Saving Mr. Banks, co-starring Emma Thompson, he was the first actor to portray Walt Disney in a mainstream film.[107] That same year, Hanks made his Broadway debut, starring in Nora Ephron's Lucky Guy, for which he was nominated for the Tony Award for Best Actor in a Play.[108]\n\nHanks at a Sully premiere in Japan in 2016\n\nIn 2014, Hanks' short story \"Alan Bean Plus Four\" was published in The New Yorker.[109] Revolving around four friends who make a voyage to the moon, the short story is titled after the Apollo 12 astronaut Alan Bean. Slate magazine's Katy Waldman found his first published short story \"mediocre\", writing that \"Hanks' shopworn ideas about technology might have yet sung if they hadn't been wrapped in too-clever lit mag-ese\".[110] In an interview with The New Yorker, Hanks said he has always been fascinated by space. He told the magazine that he built plastic models of rockets when he was a child and watched live broadcasts of space missions back in the 1960s.[111]\n\nIn March 2015, Hanks appeared in the music video for Carly Rae Jepsen's \"I Really Like You\", lip-syncing most of the song's lyrics as he goes through his daily routine.[112] His next film was Steven Spielberg's Bridge of Spies (2015), in which he played lawyer James B. Donovan, who negotiated for the release of pilot Francis Gary Powers by the Soviet Union in exchange for KGB spy Rudolf Abel.[113] In April 2016, Hanks starred as Alan Clay in the comedy-drama A Hologram for the King, an adaptation of the 2012 novel of the same name.[114] It is the second time he was directed by Tom Tykwer after Cloud Atlas.[115]\n\nHanks starred as airline captain Chesley Sullenberger in Clint Eastwood's Sully (2016).[116] He next reprised his role as Robert Langdon in Inferno (2016),[117] and co-starred alongside Emma Watson in the 2017 science fiction drama The Circle.[118] He voiced David S. Pumpkins in The David S. Pumpkins Halloween Special, which aired October 28, 2017, on NBC, a character he had portrayed in episodes of Saturday Night Live.[119]\n\nHanks reprised his role as Sheriff Woody in Pixar's Toy Story 4 (2019).[121] Hanks portrayed Fred Rogers in Marielle Heller's biographical film A Beautiful Day in the Neighborhood (2019), for which he was nominated for his first Academy Award for Best Supporting Actor.[122]\n\n2020–present\n\nOn April 11, 2020, Hanks made his first television appearance since his COVID-19 diagnosis by hosting Saturday Night Live.[123] Hanks delivered an opening monolog via his house but did not appear in any of the sketches. This is the first episode of SNL to debut after the show's hiatus due to the COVID-19 pandemic; it features different sketches filmed remotely from the cast members' homes. This is also a first in SNL history, for the show to be made up entirely of prerecorded content before airing, and the second to not be filmed at Studio 8H.\n\nHanks had two films released in 2020. Hanks starred in Greyhound, a war film which he also wrote the screenplay for.[124][125] Initially set to be theatrically released in June 2020 by Sony Pictures, due to the COVID-19 pandemic, distribution rights to the film were bought by Apple TV+, where it was released in July 2020.[126] He reunited with Paul Greengrass for the Western News of the World.[127][128] David Rooney of The Hollywood Reporter praised Hanks' performance: \"Hanks has built a career out of playing thoroughly decent men, so his casting here is entirely to type. But the soulfulness and sorrow, the innate compassion that ripple through his characterization make this an enormously pleasurable performance to watch, with new depths of both kindness and regret that keep revealing themselves.\"[129]\n\nIn 2021, Hanks starred in the science fiction drama Finch, directed by Miguel Sapochnik,[130][131][132] and released by Apple TV+.[133] On March 2, 2022, Connor Ratliff appeared as a guest on Late Night With Seth Meyers,[134] where he revealed that Hanks would at last be interviewed for the season three finale of Ratliff's podcast Dead Eyes. The conversation between Hanks and Ratliff took place 22 years after Ratliff was about to begin filming an episode of Band of Brothers, when he was subsequently fired, allegedly because Hanks believed Ratliff had \"dead eyes\". The 90 minute interview was hailed as a momentous achievement in podcasting, a \"rare show that gives you a perfect conclusion\",[135] \"surprisingly funny and empathetic\",[135] and an event Paul Scheer called \"thrilling\".[136]\n\nHanks at the 80th D-Day Ceremony in Normandy, France in 2024\n\nHanks had three films released in 2022. He first starred as Tom Parker, the manager of Elvis Presley, in Baz Luhrmann's Elvis.[137] Shooting commenced in the beginning of 2020 in Queensland, Australia,[138] and the film was released in June 2022.[139] Hanks next film was portraying Geppetto in Walt Disney Studios' live-action adaptation of Pinocchio.[140] His involvement in the film, which was directed by his longtime collaborator Zemeckis, was officially confirmed in December 2020,[141] and released on September 8, 2022, by Disney+.[142] Hanks' final film of the year was A Man Called Otto, an English-language remake of the Swedish film A Man Called Ove.[143]\n\nHanks appeared in Wes Anderson's Asteroid City (2023), starring alongside Jason Schwartzman, Scarlett Johansson, Adrien Brody, Jeffrey Wright and Bryan Cranston.[144] The film premiered at the 2023 Cannes Film Festival to mixed reviews,[145] and was released in June 2023. Hanks executive produced the miniseries Masters of the Air (2024).[146] HBO confirmed in January 2013 that it was developing a third World War II miniseries based on the book Masters of the Air by Donald L. Miller to follow Band of Brothers and The Pacific.[147] NME reported in March 2017 that production was progressing under the working title The Mighty Eighth,[148] but on October 11, 2019, it was announced the series would keep the original title and stream on Apple TV+ where it premiered on January 26, 2024. Hanks starred in the film Here (2024), an adaptation of Richard McGuire's graphic novel that reunited Hanks with Forrest Gump co-star Robin Wright and director Robert Zemeckis.[149] Hanks attended the Saturday Night Live 50th Anniversary Special where he acted in the Black Jeopardy sketch reprising his role as Doug.[150] From February to April 2025, Hanks narrated NBC documentary series The Americas.[151][152]\n\nUpcoming projects\n\nHanks is attached to star in an adaptation of the 2011 non fiction book In the Garden of Beasts from director Joe Wright about American diplomat William Dodd's time in Nazi Germany.[153][154] It was announced that Hanks would return to the stage as performer and playwright in This World of Tomorrow, an adaptation of short stories written by Hanks, at The Shed in New York City.[155]\n\nFilmography\n\nAs an actor\n\nAwards and honors\n\nIn Hanks' career as an actor and producer, he has received many award nominations. Hanks has received six Academy Award nominations including two consecutive wins for Best Actor for Philadelphia and Forrest Gump in 1993 and 1994 respectively. Hanks also received a Tony Award nomination for Best Actor in a Play for his performance in Nora Ephron's play Lucky Guy in 2013. Hanks has also received 12 Primetime Emmy Award nominations for his work on television which includes 7 wins for his work as a producer on various limited series and television films including From the Earth to the Moon (1998), Band of Brothers (2002), John Adams (2008), The Pacific (2010), Game Change (2012), and Olive Kitteridge (2015).\n\nHonors\n\nReputation and legacy\n\nHanks is often compared to James Stewart,[220] and has also frequently been referred to as \"America's Dad\".[221] In 2013, when he was starring in Nora Ephron's Lucky Guy on Broadway, he had crowds of 300 fans waiting for a glimpse of him after every performance. This is the highest number of expectant fans post-show of any Broadway performance.[222]\n\nHanks is ranked as the fifth-highest all-time box office star in North America, with a total gross of over $4.9 billion at the North American box office, an average of $100.8 million per film.[223] Worldwide, his films have grossed over $9.96 billion.[224] Asteroid 12818 Tomhanks is named after him.[225]\n\nIn 2003, Hanks was voted Number 3 in Channel 4's countdown of the 100 Greatest Movie Stars of All Time,[226] and he is number 22 on VH1's list of the \"200 Greatest Pop Culture Icons of All Time\".[227] He was included on Forbes' list of the top ten most powerful celebrities in the world, in 2000, 2002, and 2003.[228] Hanks was the guest on BBC Radio 4's Desert Island Discs on May 8, 2016. In the process in the final minutes of the program, in which the guest chooses his/her favorite of the eight discs (pieces of music) just played, a book, and a luxury item, he chose Richard Strauss' Also sprach Zarathustra by the Vienna Philharmonic, A World Lit Only by Fire by William Manchester, and a Hermes 3000 typewriter and paper, respectively.[229][230]\n\nHanks was interviewed five times on WHYY-FM by Terry Gross on the radio show Fresh Air in Philadelphia. Topics included two segments on his lead role in Captain Phillips, a movie about the real life story of a ship's captain hijacked by Somali pirates. Two interviews are about the 12 part miniseries From Earth to the Moon, for which Hanks was executive producer and which was nominated for 17 Emmy Awards. The last interview segment comprises anecdotes shared by Hanks about his acting career.[231]\n\nHanks' cement prints in front of the Grauman's Chinese Theatre in Hollywood\n\nRoger Ebert wrote \"of actors who are not 'bigger than life,' but somehow just like life—people who we feel we know and understand, and are comfortable with. We sense that these actors embody not our fantasies, but our lives. Watching them we feel congratulated, because we are watching ourselves. They reassure us that in our ordinariness we also have a kind of importance. The actors who can do that—Buster Keaton, Spencer Tracy, James Stewart, Henry Fonda, Robert Duvall, Gene Hackman, and Tom Hanks, occupy a special category... The central triumph of Tom Hanks as a movie actor is that, most of the time, we believe he thinks a lot like us, and does more or less what we would do, but that he somehow does it on a larger or more ennobling scale. It is the James Stewart quality. But few actors can obtain it; with most, you see their egos peeking through, or you catch them trying too hard. The camera is a lie detector, and Hanks must be a fundamentally good person to play such roles—either that, or he is an even better actor than we think.\"[232]\n\nPersonal life\n\nMarriage and family\n\nHanks and his wife Rita Wilson at the 1989 Oscars\n\nHanks married American actress Samantha Lewes (1952–2002) in 1978. They had one son, actor Colin (b. 1977),[233] and one daughter, Elizabeth (b. 1982).[48] Hanks and Lewes divorced in 1987.[48][234] Lewes died in 2002 at the age of 49 from bone cancer.[235]\n\nIn 1981, Hanks met actress Rita Wilson on the set of the TV comedy Bosom Buddies (1980–1982). They were reunited in 1985 on the set of Volunteers.[48] Wilson is of Greek and Bulgarian descent and a member of the Greek Orthodox Church. Before marrying her, Hanks converted to her faith.[236][237] He actively attends church and has commented, \"I must say that when I go to church—and I do go to church—I ponder the mystery. I meditate on the 'why?' of 'why people are as they are' and 'why bad things happen to good people,' and 'why good things happen to bad people' ... The mystery is what I think is, almost, the grand unifying theory of all mankind.\"[30] Hanks and Wilson married in 1988 and have two sons.[238] Their older son, Chet, released a rap song in 2011 and had recurring roles in Empire and Shameless.[239][240] Their younger son, Truman, was born in 1995, and portrayed the younger version of his father's character in A Man Called Otto (2022).[241] Hanks lives with his family in Los Angeles, California,[242] and Ketchum, Idaho.[243]\n\nIn October 2013, on Late Show with David Letterman, Hanks said he has type 2 diabetes. The CBS News medical contributor said significant weight fluctuations for various film roles such as A League of Their Own and Cast Away might have contributed to the diagnosis.[244] In a 2018 interview, Hanks further attributed his condition to a combination of genetics and lifestyle choices. He has since made lifestyle changes to manage his condition, such as maintaining a healthier diet and avoiding film roles that require drastic weight changes.[245]\n\nDespite being a fan of the Oakland Athletics and the Raiders when they were based in Oakland, Hanks stated in April 2017 he would boycott the NFL for two years after the Raiders filed for relocation to Las Vegas.[246] Since 1984, Hanks has been a fan of the English Premier League club Aston Villa.[247]\n\nIn November 2019, shortly before the release of A Beautiful Day in the Neighborhood, a drama film in which Hanks portrays Fred Rogers, he learned through Ancestry.com that he and Rogers were sixth cousins, both descendants of Johannes Meffert (1732–1795), who was born in Schöneck, Hesse, Germany (then part of the Holy Roman Empire) and emigrated to the United States in the 18th century, settling in Kentucky and changing his last name to Mefford.[248] Hanks is also a relative of the 16th US president, Abraham Lincoln. Hanks narrated the 2011 television program Killing Lincoln.[249]\n\nOn December 27, 2019, the President of Greece, Prokopis Pavlopoulos, signed an honorary naturalization order for Hanks and his family, citing their \"exceptional services to Greece\", thus making him and his immediate family Greek citizens.[218][1][250] Hanks, along with Wilson and their children, were conferred honorary citizenship for their role in bringing global attention and appealing for aid after a devastating wildfire that ripped through the seaside village of Mati, near Athens, in July 2018, which killed more than 100 people.[251][250] Greece's Interior Minister Takis Theodorikakos said Hanks \"showed real interest in the people who suffered from the fire in Mati and promoted this issue in the global media\".[250] In July 2020, Hanks and Wilson were photographed with their Greek passports alongside the Prime Minister of Greece, Kyriakos Mitsotakis and his wife.[251][252]\n\nPolitical views and activism\n\nHanks with World War II veterans in 2010\n\nHanks has donated to many Democratic politicians, and during the 2008 United States presidential election uploaded a video to his MySpace account endorsing Barack Obama.[253] He also narrated a 2012 documentary, The Road We've Traveled, created by Obama for America.[254] In 2016, Hanks endorsed former Secretary of State Hillary Clinton in the 2016 presidential election.[255]\n\nHanks was outspoken about his opposition to the 2008 Proposition 8, an amendment to the California constitution that defined marriage as a union only between a man and a woman. Hanks and others raised over US$44 million to campaign against the proposition.[256] While premiering a TV series in January 2009, Hanks called supporters of Proposition 8 \"un-American\" and criticized LDS Church members, who were major proponents of the bill, for their views on marriage and role in supporting the bill.[257][258] About a week later, he apologized for the remark, saying that nothing is more American than voting one's conscience.[259]\n\nA proponent of environmentalism, Hanks is an investor in electric vehicles and owns a Toyota RAV4 EV and the first production AC Propulsion eBox. He was a lessee of an EV1 before it was recalled, as chronicled in the documentary Who Killed the Electric Car?[260] He was on the waiting list for an Aptera 2 Series.[261] Hanks serves as campaign chair of the Hidden Heroes Campaign of the Elizabeth Dole Foundation. The stated mission of the campaign is to inspire a national movement to more effectively support the military and veteran caregivers.[262][263]\n\nIn 2004, while touring the White House, Hanks learned that the press corps did not have a coffee pot, and shortly thereafter, he donated an espresso machine. He again donated new machines in 2010 and 2017. His 2017 donation was accompanied by a note that read, \"To the White House Press Corps, Keep up the good fight for Truth, Justice, and the American Way. Especially for the truth part.\"[264][265] He endorsed former Vice President Joe Biden in the 2020 presidential election.[266]\n\nVentures and interests\n\nA supporter of NASA's crewed space program, Hanks said he originally wanted to be an astronaut. Hanks is a member of the National Space Society, serving on the Board of governors of the nonprofit educational space advocacy organization founded by Wernher von Braun.[267] He also produced the HBO miniseries From the Earth to the Moon about the Apollo program to send astronauts to the Moon. In addition, Hanks co-wrote and co-produced Magnificent Desolation: Walking on the Moon 3D, an IMAX film about the Moon landings.[268] Hanks provided the voice-over for the premiere of the show Passport to the Universe at the Rose Center for Earth and Space in the Hayden Planetarium at the American Museum of Natural History in New York.[269]\n\nIn 2006, the Space Foundation awarded Hanks the Douglas S. Morrow Public Outreach Award,[270] given annually to an individual or organization that has made significant contributions to public awareness of space programs.[271]\n\nIn June 2006, Hanks was inducted as an honorary member of the United States Army Rangers Hall of Fame for his accurate portrayal of a captain in the movie Saving Private Ryan; Hanks, who was unable to attend the induction ceremony, was the first actor to receive such an honor. In addition to his role in Saving Private Ryan, Hanks was cited for serving as the national spokesperson for the World War II Memorial Campaign, for being the honorary chairperson of the D-Day Museum Capital Campaign, and for his role in writing and helping to produce the Emmy Award-winning miniseries, Band of Brothers.[272] On March 10, 2008, Hanks was on hand at the Rock and Roll Hall of Fame to induct The Dave Clark Five.[273]\n\nHanks is a collector of manual typewriters which he began collecting in his youth[274] and which he uses almost daily.[275][276] Hank has gifted typewriters including to a child who was being bullied because of his name, which happened to also be a brand of typewriter.[274] In August 2014, Hanks released Hanx Writer, an iOS app meant to emulate the experience of using a typewriter; within days the free app reached number one on the App Store.[277][278] After contracting and recovering from a COVID-19 infection early in the pandemic, Hanks and his wife donated their blood antibodies for virus research.[279] Hanks is an ordained minister, and on March 24, 2022, CBS News reported that he had recently officiated a wedding in Pittsburgh.[280]\n\nIn 2023, Hanks founded Hanx for the Troops, a coffee company that supports veterans and military families through a portion of its profits and various initiatives.[281] In recognition of Hanks's positive portrayal of the American service member, his support of veterans, the military, and America's space program, he was to receive the 2025 Sylvanus Thayer Award from the West Point Association of Graduates (WPAOG), but the ceremony was cancelled.[282][283][284][285][286]\n\nBibliography\n\nHanks wrote a collection of short stories, Uncommon Type, inspired by his typewriter collection, which was published in 2017.[287][288] The Making of Another Major Motion Picture Masterpiece, his debut novel, was published in May 2023.[289]\n\nSee also\n\nReferences\n\nFurther reading", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/USMC-100311-M-1318S-196.jpg/250px-USMC-100311-M-1318S-196.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/P120714PS-0497_%2815953217940%29.jpg/250px-P120714PS-0497_%2815953217940%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/40px-Wikidata-logo.svg.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/Normandy_American_Cemetery_ahead_of_the_80th_D-Day_Ceremony_in_Normandy%2C_France%2C_June_6%2C_2024_-_14.jpg/250px-Normandy_American_Cemetery_ahead_of_the_80th_D-Day_Ceremony_in_Normandy%2C_France%2C_June_6%2C_2024_-_14.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/40px-Video-x-generic.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Tom_Hanks_2016.jpg/250px-Tom_Hanks_2016.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/26th_Tokyo_International_Film_Festival-_Tom_Hanks_from_Captain_Phillips%2C_Yakusho_Koji_from_The_Kiyosu_Conference%2C_Prime_Minister_Abe_Shinzo_%2815403635119%29.jpg/250px-26th_Tokyo_International_Film_Festival-_Tom_Hanks_from_Captain_Phillips%2C_Yakusho_Koji_from_The_Kiyosu_Conference%2C_Prime_Minister_Abe_Shinzo_%2815403635119%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/P052511PS-1339_%285836460582%29.jpg/250px-P052511PS-1339_%285836460582%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Baz_Luhrmann%2C_Eva_Rinaldi_%282%29%2C_Olivia_Dejonge%2C_Austin_Butler%2CTom_Hanks_%2852123990193%29.jpg/250px-Baz_Luhrmann%2C_Eva_Rinaldi_%282%29%2C_Olivia_Dejonge%2C_Austin_Butler%2CTom_Hanks_%2852123990193%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/TomHanksForrestGump94.jpg/250px-TomHanksForrestGump94.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Tom_Hanks_and_wife_Rita_Wilson_836.jpg/250px-Tom_Hanks_and_wife_Rita_Wilson_836.jpg", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/TomHanksPrincEdw031223_%2811_of_41%29_%28cropped%29.jpg/250px-TomHanksPrincEdw031223_%2811_of_41%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/TomHanksApr09.jpg/250px-TomHanksApr09.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Tom_Hanks_the_Presidential_Medal_of_Freedom_2016.jpg/250px-Tom_Hanks_the_Presidential_Medal_of_Freedom_2016.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/40px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Tom_Hanks_-_footprint.JPG/250px-Tom_Hanks_-_footprint.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Tom_Hanks_signature.svg/250px-Tom_Hanks_signature.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Steven_Spielberg_%26_Tom_Hanks_at_National_World_War_II_Memorial_for_premiere_of_The_Pacific_2010-03-11.jpg/250px-Steven_Spielberg_%26_Tom_Hanks_at_National_World_War_II_Memorial_for_premiere_of_The_Pacific_2010-03-11.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/40px-P_vip.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/TomHanksPrincEdw031223_%2811_of_41%29_%28cropped%29.jpg/960px-TomHanksPrincEdw031223_%2811_of_41%29_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Kevin_Kline_%26_Tom_Hanks_%28252967475%29_%28cropped%29.jpg/250px-Kevin_Kline_%26_Tom_Hanks_%28252967475%29_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/Tom_Hanks_2008a.jpg/250px-Tom_Hanks_2008a.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/TomHanksPrincEdw031223_%2811_of_41%29_%28cropped%29.jpg/960px-TomHanksPrincEdw031223_%2811_of_41%29_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Tom_Hanks", "title": "Tom Hanks", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/TomHanksPrincEdw031223_%2811_of_41%29_%28cropped%29.jpg/960px-TomHanksPrincEdw031223_%2811_of_41%29_%28cropped%29.jpg", "width": 865, "height": 1200}, "title": "Tom Hanks - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}