{"url": "https://web.archive.org/web/20161004211351/http://fashionmagazine.com/culture/selena-gomez-justin-bieber-relationship/", "text": "A complete timeline of Selena Gomez and Justin Bieber’s relationship\n\nA photo posted by Selena Gomez (@classyselenagomez) on Aug 16, 2016 at 12:03pm PDT\n\nEvery relationship has its ups and downs, but when we’re talking about Justin Bieber and Selena Gomez, that’s approximately six years of roller-coaster emotions.\n\nThe two sparked dating rumours in 2010 and captured the hearts of both their fan bases, thus creating #Jelena supporters. Since Bieber and Gomez are two of the most famous young stars of their time, their admirers range from supportive to downright obsessive.\n\nWhile Jelena fans have been rooting for them to get back (and stay!) together since their first split in 2012, the group got a little more passionate after seeing the recent posts on Biebs’ now-deleted Instagram page. Over the weekend, Bieber published photos with his rumoured new girlfriend, Sofia Richie, which lead to an attack on her from his fans. As a result of said attack, he threatened to set his account to private if they didn’t ease up on her. Gomez then addressed the controversial post, giving JB some unsolicited advice about appreciating his fans (she’s since regretted commenting, obv). So, what has this all lead to? Bieber allegedly accusing Selena of using him for his fame and then deleting his Instagram, breaking the hearts of Jelena fans everywhere.\n\nKind of hard to follow, right? Luckily, we’ve broken down every single one of their breakups and makeups!\n\nA photo posted by Mr And Mrs Bieber ? Jelena??✌️ (@jelena_firstofall) on Mar 6, 2014 at 3:10am PST\n\nJanuary 2011: Gomez and Bieber vacation in St. Lucia\n\nDating rumours began to circulate around the duo in 2010; They were spotted vacationing together in St. Lucia in 2011, sending out major PDA vibes.\n\nA photo posted by ‘ArSyn catastrophe (@arsyn_catastrophe) on Dec 31, 2015 at 6:10am PST\n\nFebruary 2011: Gomez and Bieber make their red carpet debut as a couple at the Vanity Fair Oscars party\n\nYup, they finally made our dreams a reality by walking the red carpet together for the first time, thus confirming their young love and letting fans set their hearts on #Jelena4ever.\n\nA photo posted by ✨JustinBieber & SelenaGomez✨ (@_justinselena_jelena_) on Nov 27, 2015 at 1:34pm PST\n\nMay 2011: Billboard Music Awards\n\nJelena looked happy and strong at the Billboard Music Awards, even giving the camera an on-screen kiss! Oh, young love.\n\nA photo posted by Jarbara Is Life (@jarbaraislife) on Oct 26, 2015 at 2:58pm PDT\n\nNovember 2012: First breakup reported (Bieber briefly linked to model Barbara Palvin)\n\nJelena sees the first of many breakups. After more than a year of puppy love, the two reportedly split for the first time due to their busy schedules. That same month the Internet began to speculate a relationship between JB and Victoria’s Secret model Barbara Palvin.\n\nA photo posted by Alondra (@russomccann) on Jan 5, 2014 at 12:07pm PST\n\nJanuary 2013: The two stars are reportedly back together, as Gomez travels to Norway to visit Bieber\n\nThey can’t stay away from one another for long. A couple months after their first breakup, Justin posted the above image of them on his Instagram, and of course, promptly deleted it. Come on Jelena, keep us in the loop!\n\nA photo posted by ??? (@_sel_queen_) on Aug 6, 2016 at 8:47am PDT\n\nNovember 2014: Gomez performs her single “The Heart Wants What It Wants” at the American Music Awards\n\nHere’s the kicker: she confirmed the song was about Bieber. After a few more on-again off-again appearances in the media, the couple confirmed they’d split.\n\nA photo posted by Baby Hails (@mommyhaileybaldwin) on Mar 17, 2016 at 6:32pm PDT\n\nDecember 2014: Bieber denies Hailey Baldwin dating rumours\n\nGoodbye Jelena, hello Jailey! Beliebers start to suspect relations between their boy and model Hailey Baldwin. However, JB denies these rumours, posting this photo on Instagram assuring fans that they are simply good friends.\n\nA photo posted by – selena gomez ; ? (@selenqqomez) on Apr 11, 2015 at 6:59am PDT\n\nJanuary 2015: Gomez and DJ Zedd dating rumours begin\n\nShortly after the Jailey rumours, Gomez was seen getting close with DJ Zedd. This romance was not confirmed by Gomez until later that year in September when she spoke with Elle.\n\nA photo posted by Meeting Selena October 12th (@selenamylight) on Sep 16, 2015 at 11:30am PDT\n\n\n\nSeptember 2015: Gomez opens up about Bieber in ELLE‘s September issue\n\nIn September 2015, Gomez graced the cover of Elle, opening up about her past relationship with her fellow pop star and the support she will always have for him.\n\nA photo posted by SelGSelenator (@selgselenator) on Jan 29, 2015 at 12:49pm PST\n\nNovember 2015: Bieber confirms which songs on his album Purpose are about his ex on The Ellen DeGeneres Show\n\nIn November 2015, JB stopped by Ellen, and while discussing his upcoming album Purpose, he revealed which songs were inspired by Selena—thanks for the intel, Biebs! The songs? Check out “What Do You Mean?” “Sorry” and “Mark My Words”.\n\nA photo posted by Hailey Baldwin (@haileybaldwin) on Dec 29, 2015 at 11:50am PST\n\nJanuary 2016: Bieber and Baldwin hang out on New Year’s Eve\n\nWas it not recently that JB confirmed that he and Baldwin were just good friends? Yes, but now things appear to have changed. The two celebs took their romance public on Instagram. However, it’s unclear how long the this romance lasted, as they’ve since broken up.\n\nA photo posted by Sofia Richie (@sofiarichie) on Aug 13, 2016 at 11:34pm PDT\n\nAugust 2016: Sofia Richie posts a pic on Instagram of her and Bieber\n\nYes, Sofia Richie, daughter of Lionel Richie, and sister of Nicole Richie. Bieber and Richie both took to Instagram recently to post photos of their time in Japan. The comments on both their accounts proved one thing for sure: do not mess with Jelena fans.\n\n[Short Audio]: Selena Gomez’s version of DJ Snake’s “Let Me Love You”! pic.twitter.com/7tOEjw8ltF — Selena Gomez News (@LifeWithSelG) August 23, 2016\n\nAugust 2016: Gomez posts a clip of her singing “Let Me Love You”\n\nSo, just when we thought the dust had settled between Jelena, the above clip surfaced of Gomez singing DJ Snake’s “Let Me Love You,” which features the Biebs on vocals. An official cover has yet to be released; however, suspicions that it’s coming soon have been heightened as DJ Snake posted a longer version of Gomez’s cover on his Snapchat. I think we can all agree that it’s a little odd of Selena to chose to cover her ex’s song after feuding over his new boo Sofia. But hey, you do you, Selena!", "images": ["https://web.archive.org/web/20161004211351im_/http://cdn.fashionmagazine.com/wp-content/themes/sjm-genus/images/misc/snapchat-qr-code.jpg", "https://web.archive.org/web/20161004211351im_/http://fashionmagazine.com/wp-content/themes/sjm-genus/images/fashion-logo.svg", "https://web.archive.org/web/20161004211351im_/http://cdn.fashionmagazine.com/wp-content/themes/sjm-genus/images/logos/logo_st-joseph-cropped.png", "https://web.archive.org/web/20161004211351im_/http://cdn.fashionmagazine.com/wp-content/uploads/2016/08/Screen-Shot-2016-08-16-at-5.13.23-PM.png", "https://web.archive.org/web/20161004211351im_/http://cdn.fashionmagazine.com/wp-content/uploads/2016/09/FM-oct-2016-magazineimage.png"], "top_img": "https://web.archive.org/web/20161004211351im_/http://cdn.fashionmagazine.com/wp-content/uploads/2016/08/Screen-Shot-2016-08-16-at-5.13.23-PM.png", "keywords": [], "authors": ["Date August"], "canonical_link": "https://web.archive.org/web/20161004211351/http://fashionmagazine.com/culture/selena-gomez-justin-bieber-relationship/", "title": "A complete timeline of Selena Gomez and Justin Bieber’s relationship", "meta_data": {"description": "A photo posted by Selena Gomez (@classyselenagomez) on Aug 16, 2016 at 12:03pm PDT Every relationship has its ups and downs, but when we're talking about J", "viewport": "width=device-width, initial-scale=1.0, user-scalable=no", "thumbnail": "http://cdn.fashionmagazine.com/wp-content/uploads/2016/08/Screen-Shot-2016-08-16-at-5.13.23-PM-900x600-c-default.png", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "/mstile-144x144.png", "theme-color": "#ffffff", "robots": "noodp", "og": {"locale": "en_US", "type": "article", "title": "A complete timeline of Selena Gomez and Justin Bieber's relationship", "description": "A photo posted by Selena Gomez (@classyselenagomez) on Aug 16, 2016 at 12:03pm PDT Every relationship has its ups and downs, but when we're talking about J", "url": "https://web.archive.org/web/20161004211351/http://fashionmagazine.com/culture/selena-gomez-justin-bieber-relationship/", "site_name": "FASHION Magazine", "updated_time": "2016-08-25T15:16:29-04:00", "image": {"identifier": "https://web.archive.org/web/20161004211351im_/http://cdn.fashionmagazine.com/wp-content/uploads/2016/08/Screen-Shot-2016-08-16-at-5.13.23-PM.png", "width": 472, "height": 590}}, "article": {"tag": "Selena Gomez", "section": "Culture", "published_time": "2016-08-16T17:00:04-04:00", "modified_time": "2016-08-25T15:16:29-04:00"}, "twitter": {"card": "summary", "description": "A photo posted by Selena Gomez (@classyselenagomez) on Aug 16, 2016 at 12:03pm PDT Every relationship has its ups and downs, but when we're talking about J", "title": "A complete timeline of Selena Gomez and Justin Bieber's relationship", "image": "https://web.archive.org/web/20161004211351im_/http://cdn.fashionmagazine.com/wp-content/uploads/2016/08/Screen-Shot-2016-08-16-at-5.13.23-PM.png"}, "generator": "WordPress 4.6.1"}, "movies": [], "publish_date": 1471381204.0, "source": "https://web.archive.org", "summary": ""}