{"url": "www.thehollywoodgossip.com/2018/02/selena-gomez-pregnant-with-justin-biebers-baby/", "text": "Reading Time: 3 minutes\n\nPoor Mandy Teefey. If Selena Gomez’s mom was hospitalized over Selena getting back together with Justin Bieber, we can only imagine how she’ll respond to this news.\n\nHonestly, this could leave a lot of fans divided. Or disappointed.\n\nA new report claims that Selena Gomez is pregnant and that Justin Bieber is the baby daddy.\n\n(Getty)\n\nSo, Justin and Selena took a trip to Laguna Beach earlier in February. NW claims that this is when the couple bonded over some big news.\n\n\"The word is that Selena is pregnant and told Justin as much during their trip.\"\n\nThat would be some major news to break.\n\n\"Justin wasn’t expecting it, but he’s ecstatic about it. It’s a dream come true.\"\n\nif he wanted Selena back for good, getting her pregnant sure might work.\n\n\"Pals say they’ve been casual with contraception because they are both keen to make this happen at some point.\"\n\nThe report goes on to claim that this is more or less an act of providence.\n\n\"They know there’s never going to be a perfect time, so they’ve been putting their faith in God’s hands.\"\n\nThat claim ties in to Selena’s idea that God blesses her reunion with the Biebs and with Justin recently ending his tour to spend more time at church.\n\nThe report suggests that this accident was a happy one.\n\n\"This is something they both want.\"\n\nThey’re both at odd places in their lives to have a kid, so that’s … an interesting claim.\n\n\"Selena has always liked the idea of being a young mum and Justin is desperate to settle down.\"\n\nThere were even claims that Selena is following a safe pregnancy checklist, \"steering clear of alcohol, sushi, and soft cheeses to be safe.\"\n\n(Those would be pretty standard precautions for a pregnant woman, and match up with Kim Kardashian’s surrogate’s dietary restrictions)\n\nAnd then there’s Bieber’s side, with claims that he’s \"started following pregnancy accounts on Instagram and posed for photos with a fan’s baby while out in L.A.\"\n\nJustin Bieber follows all kinds of accounts, folks. Also, he’s been posing with babies for years.\n\nBabies are cute. They’re not, um, evidence of more babies.\n\nIn real life, Justin Bieber and Selena Gomez have been in Jamaica for Justin’s dad’s wedding.\n\nAnd Gossip Cop reports that, also in real life, Selena is not pregnant with Justin’s baby. And probably not with anyone’s.\n\nThe timing for this wouldn’t be great, right?\n\nJustin only recently managed to get out of what was reportedly a life-threatening substance abuse issue.\n\nHis own manager feared that he would die, just a few years ago, if he went on tour.\n\nIn the mean time, Selena Gomez received a kidney transplant just last year. It saved her life but did not cure her Lupus.\n\nUntil very recently, doctors discouraged women with Lupus from getting pregnant, due to risks to their lives and their baby’s. Now, those risks are lower.\n\nBut given the severity of Selena’s health battle, some wonder if a pregnancy would be a fatal mistake.\n\nNow whatever you may think of Selena falling back into bad habits by dating a man some might characterize as an inked trash gremlin who’s not even hot anymore, we should remember:\n\nThat’s her choice.\n\nFans don’t have to agree with her love life.\n\nBut everyone can breathe a sigh of relief with the report that Selena is not pregnant. Those who admire her music, her acting, and her as a person want her to be around and healthy for a long, long time.", "images": ["https://cdn.thehollywoodgossip.com/uploads/2025/11/2552_D085_00216R-H-2025-80x80.webp", "http://cdn.thehollywoodgossip.com/uploads/2017/12/justin-bieber-and-selena-gomez-in-2011-640x1024.jpg", "https://cdn.thehollywoodgossip.com/uploads/2025/11/GettyImages-1154615733-80x80.jpg", "https://cdn.thehollywoodgossip.com/uploads/2022/02/thg-logo.png", "https://cdn.thehollywoodgossip.com/uploads/2025/11/GettyImages-2159895990-6-80x80.jpg", "https://cdn.thehollywoodgossip.com/uploads/2025/11/GettyImages-2247300883-80x80.jpg", "https://cdn.thehollywoodgossip.com/uploads/2024/12/1206_annaduggar_header-80x80.png", "https://cdn.thehollywoodgossip.com/uploads/2025/11/1119_janellebrown_angelamoody_header-80x80.png", "https://cdn.thehollywoodgossip.com/uploads/2025/11/69023040a27d084abe99b818-80x80.webp", "https://cdn.thehollywoodgossip.com/uploads/2025/11/1119_tekashi6ix9ine_header-80x80.jpg"], "top_img": "http://cdn.thehollywoodgossip.com/uploads/2017/12/justin-bieber-and-selena-gomez-in-2011-640x1024.jpg", "keywords": [], "authors": ["Simon Delott"], "canonical_link": "https://www.thehollywoodgossip.com/2018/02/selena-gomez-pregnant-with-justin-biebers-baby/", "title": "Selena Gomez: PREGNANT With Justin Bieber's Baby?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Selena Gomez: PREGNANT With Justin Bieber’s Baby?", "description": "Poor Mandy Teefey. If Selena Gomez's mom was hospitalized over Selena getting back together with Justin Bieber, we can only imagine how she'll respond to this n", "url": "https://www.thehollywoodgossip.com/2018/02/selena-gomez-pregnant-with-justin-biebers-baby/", "site_name": "The Hollywood Gossip", "updated_time": "2022-04-26T08:52:10+00:00", "image": {"identifier": "http://cdn.thehollywoodgossip.com/uploads/2017/12/justin-bieber-and-selena-gomez-in-2011-640x1024.jpg", "width": 640, "height": 1024, "type": "image/jpeg"}, "article": {"published_time": "2018-02-21 15:57:08", "modified_time": "2022-04-26 08:52:10"}}, "article": {"published_time": "2018-02-21T15:57:08+00:00", "modified_time": "2022-04-26T08:52:10+00:00"}, "twitter": {"card": "summary", "title": "Selena Gomez: PREGNANT With Justin Bieber’s Baby?", "description": "Poor Mandy Teefey. If Selena Gomez's mom was hospitalized over Selena getting back together with Justin Bieber, we can only imagine how she'll respond to this n", "image": "http://cdn.thehollywoodgossip.com/uploads/2017/12/justin-bieber-and-selena-gomez-in-2011-640x1024.jpg", "label1": "Written by", "data1": "Simon Delott", "label2": "Est. reading time", "data2": "3 minutes"}, "author": "Simon Delott", "generator": "WordPress 6.8.3", "theme-color": "#000000", "msapplication-TileImage": "https://cdn.thehollywoodgossip.com/uploads/2024/07/cropped-THG-LOGO-270x270.jpg"}, "movies": [], "publish_date": 1519228628.0, "source": "http://www.thehollywoodgossip.com", "summary": ""}