{"url": "www.complex.com/music/2011/11/drakes-10-hottest-hook-ups/", "text": "lead\n\nMaliah Michel 10. MALIAH MICHEL When: May 2010 Drake turned the pole-dancing stripper chick into video vixen when he casted her in his video for \"Find Your Love.\" It was well-known that the two were hooking up when a slew of pictures of the Canadian rapper and the booty model lounging at a nightclub surfaced on the Internet. He also gave her a shoutout in \"Miss Me.\" In June 2010, Maliah told VIBE that she had met Drake's mother. Bringing a stripper to meet your parents? Is that a smart idea? Smash Probability: Yeah, this happened.\n\nTeyana Taylor 9. TEYANA TAYLOR When: May 2009 All it took was a Photo Booth picture of Drake attempting to lip-lock with Teyana Taylor for the \"Are they a couple?\" rumor mill to start rolling. The images were uploaded by the Harlem-born rapper/singer on her MySpace page. Though nothing was confirmed, a picture is worth a thousand words. In this case, four pictures. Smash Probability: They were cuddle buddies at the very least.\n\nSerena Williams 8. SERENA WILLIAMS When: August 2011 After being snapped hitting a Florida resort to play tennis together, Drake was rumored to be doing a little something-something with tennis star Serena Williams. Drake was also spotted cheering on Serena when she played (and won) the 2011 Rogers Cup in the rapper's hometown of Toronto. Then a clip of Serena twerking it to Trey Songz's \"Bottoms Up\" in Drake's condo surfaced. Grand Slam winner turned video vixen? Drake would later deny and say that it was not his place. Smash Probability: She definitely helped him practice some type of stroke.\n\nTaraji P. Henson 7. TARAJI P. HENSON When: November 2011 Earlier this month, Taraji revealed that Drake tried to hook up with her. The 41-year-old actress went on the record and said that Drake is just \"a friend\" and said that if he were 10 years older, she would have been down. She then went on to compare Drizzy's age to that of her son. Bummer. Smash Probability: We're willing to bet that Drake will hold her to those comments next decade.\n\nBria Myles 6. BRIA MYLES When: January 2009 Drake named his critically acclaimed So Far Gone track \"Bria's Interlude\" as a tribute to the model and video vixen. In an interview where Drake broke down each track from the 2009 mixtape, he described the song saying, \"I was smitten over this girl from L.A. and I started writing a song about her.\" Ms. Myles is in fact from Los Angeles. As for if the two actually hooked up, Drake proclaims, \"A lot of the R&B [I do] is really based off women that come into my life and inspire me to speak to them in song and say what I never would expose on just a talking level.” Smash Probability: We'll never think this guy couldn't pull any video girl he's \"smitten\" with.\n\nNicole Scherzinger 5. NICOLE SCHERZINGER When: October 2011 After announcing her split with her long-term boyfriend of nearly five years, Nicole and Drizzy were spotted leaving an Italian eatery in L.A. (separately) late last month. The X-Factor judge then took to Twitter to say, \"Wow, now anyone that happens to be in the same restaurant is linked to me.\" Drake also denied that he was dating the Pussycat Dolls singer in a recent radio interview. Ms. Scherzinger is still however single and ready to mingle. Smash Probability: It wouldn't have been surprising if she was looking for a rebound, though.\n\nRashida Jones 4. RASHIDA JONES When: Unknown In our cover story earlier this week, Drake claims that he only admired Quincy Jones' daughter from afar. \"I was, like, in love with Rashida. I love funny women and I love beautiful women and I love women that have great taste in music and Rashida is all those things,\" he said. They met when she complimented his DJ set at a party, and coincidentally linked at a later date when they stayed at the same resort on vacation. Maybe they had that Black Jew connection, but Rashida is famously low key, and we know Drake would respect that. Smash Probability: What happens on vacation stays on vacation.\n\nZineb \"Nebby\" Samir 3. ZINEB \"NEBBY\" SAMIR When: 2009 If you've heard \"Look What You've Done\" off Drake's newly released Take Care, he raps about his ex-girlfriend Zineb Samir—better known as Nebby Neb. Drake even appeared on Toronto's FLOW 93.5 to answer the questions on who \"Best I Ever Had\" was about and revealed that the song was for Nebby. We can definitely see why. Smash Probability: Rapping about making a girl's special place \"whistle\" is confirmation enough.\n\nNicki Minaj 2. NICKI MINAJ When: January 2011 From hoping they'd get married on \"Miss Me\" to an actual Twitter matrimony, Drake proclaims his love for his Young Money labelmate constantly. The two were reported as \"dating\" when they were spotted late last year at a New Year's Eve party in Miami \"dancing and cuddling.\" It's hard to say if the rumors of romance between the two are actually real, but according to Drizzy, Nicki definitely \"makes him proud.\" Whatever that means. Smash Probability: This is like one of those office romances that neither party can admit to.", "images": ["https://images.complex.com/complex/image/upload/ar_1.91,c_fill,g_auto,q_auto/v1723942594/sanity-new%2Ftmp-name-3-2042-1670687485-116_16x9-6722670", "https://images.complex.com/complex/image/upload/q_auto,f_auto,c_fill,ar_1.78,w_2048,g_auto/v1723942590/sanity-new/not-available-lead-134960081.jpg"], "top_img": "https://images.complex.com/complex/image/upload/ar_1.91,c_fill,g_auto,q_auto/v1723942594/sanity-new%2Ftmp-name-3-2042-1670687485-116_16x9-6722670", "keywords": [], "authors": ["Ernest Baker", "Anthony Osei"], "canonical_link": "https://www.complex.com/music/a/ernest-baker/drakes-10-hottest-hook-ups", "title": "Drake's 10 Hottest Hook-Ups", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "From pop stars to strippers, Drizzy has been linked to several lovely ladies. | Complex", "robots": "noindex", "og": {"title": "Drake's 10 Hottest Hook-Ups", "description": "From pop stars to strippers, Drizzy has been linked to se...", "url": "https://www.complex.com/music/a/ernest-baker/drakes-10-hottest-hook-ups", "site_name": "Complex", "image": "https://images.complex.com/complex/image/upload/ar_1.91,c_fill,g_auto,q_auto/v1723942594/sanity-new%2Ftmp-name-3-2042-1670687485-116_16x9-6722670", "type": "article"}, "twitter": {"card": "summary_large_image", "site": {"identifier": "@complex", "id": 13049362}, "title": "Drake's 10 Hottest Hook-Ups", "description": "From pop stars to strippers, Drizzy has been linked to several lovely ladies. | Complex", "image": "https://images.complex.com/complex/image/upload/ar_1.91,c_fill,g_auto,q_auto/v1723942594/sanity-new%2Ftmp-name-3-2042-1670687485-116_16x9-6722670"}}, "movies": [], "publish_date": null, "source": "http://www.complex.com", "summary": ""}