{"url": "starcasm.net/kourtney-kardashians-secret-wedding/", "text": "It’s Kardashian pregnancy and wedding rumors galore today: Just hours after another round of rumors that Kylie Jenner’s gone into early labor comes a high-profile story claiming that Kourtney Kardashian’s secret wedding to 24-year-old boyfriend Younes Bendjima has come and gone without a hitch.\n\nThis is at least the second time that Kourtney and Younes have said to either tied the knot or been ready to do so since the summer. Back then, with Scott Disick trying to get a rise out of Kourtney by engaging in his World Sex Tour, the story was that Kourtney had decided to put an end to Scott’s shenanigans by getting married to Younes for Keeping Up With The Kardashians‘ cameras.\n\nThis time, the gossip comes from OK!’s Australian edition, and alleges that Kourtney Kardashian’s secret wedding to Younes came on an undisclosed Mexican beach. The magazine says that apparently, “with the world watching for the arrival of her sisters Kim, Khloe and Kylie Jenner’s new babies, it’s been the perfect time for low-key Kourt to sneak under the radar and say ‘I do’ in secret.”\n\nHowever, their story trips up by going on to claim — in the very next sentence — that Kris Jenner is “desperate to air” the supposedly secret ceremony on KUWTK. And just a bit later, the story then doubles down on its contradiction by further claiming that Kourtney Kardashian’s secret wedding was atypical for the Kardashians in that it was only Kourtney and Younes and “a celebrant on the beach, with no cameras around.”\n\nFurther adding to the delightful deception is the magazine’s cover, which does appear to depict a beach wedding ceremony, and which comes complete with privacy-ensuring canopies…\n\n…but which photo, as the good people at Gossip Cop point out, actually comes from Johnny Depp and Amber Heard’s 2015 wedding. (Plus, there are way more than just three people in the cover photo, meaning the magazine is banking on its readers never putting the article’s discrepancies together.)\n\nOn the other hand, KUWTK viewers were recently treated to Kourtney finding out how to treat herself to a little alone time with Younes. “I’ve definitely learned from my past relationship, where I really wouldn’t travel without the kids,” she told the show’s cameras, when debating whether to jet off to Egypt for a kid-free vacation with her boyfriend. “And I think it is important to take time, especially because my relationship is important to me.”\n\nSo it’s entirely possible that 2018 will be the year we find out about Kourtney Kardashian’s secret wedding — the real one, that is — after it’s already happened, in a grand Kris Jenner-organized reveal. But, if 2017 taught us anything, it’s just as likely that Kourtney will slouch her way into a why-not marriage with Scott Disick.\n\n(Photo credits: Kourtney Kardashian’s secret wedding via Instagram, Splash News)\n\n\n\n\n\n\n\n\n\n", "images": ["https://starcasm.net/wp-content/uploads/2018/01/Kourtney-Kardashians-secret-wedding-3-490x606.jpg", "https://starcasm.net/wp-content/uploads/2018/01/Kourtney-Kardashians-secret-wedding-2-490x735.jpg", "https://starcasm.net/wp-content/uploads/2018/01/Kourtney-Kardashians-secret-wedding-2.jpg", "https://starcasm.net/wp-content/uploads/2019/05/Black-Ink-Compton-1.jpg", "https://starcasm.net/wp-content/uploads/2016/10/Moniece-Slaughters-sex-tape-2.jpg", "https://c.statcounter.com/9846729/0/9a0f0d6e/0/", "https://starcasm.net/wp-content/uploads/2024/07/cropped-starcasmlogo-2.png", "https://starcasm.net/wp-content/uploads/2020/03/LHHH-A1-3.png"], "top_img": "https://starcasm.net/wp-content/uploads/2018/01/Kourtney-Kardashians-secret-wedding-2.jpg", "keywords": [], "authors": [], "canonical_link": "https://starcasm.net/kourtney-kardashians-secret-wedding/", "title": "Kourtney Kardashian’s secret wedding allegedly still had a camera crew", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1", "robots": "max-image-preview:large", "generator": "Site Kit by Google 1.166.0", "og": {"type": "article", "title": "Kourtney Kardashian’s secret wedding allegedly still had a camera crew", "url": "https://starcasm.net/kourtney-kardashians-secret-wedding/", "description": "It’s Kardashian pregnancy and wedding rumors galore today: Just hours after another round of rumors that Kylie Jenner’s gone into early labor comes a high-profile story claiming that Ko…", "site_name": "Starcasm", "image": {"identifier": "https://starcasm.net/wp-content/uploads/2018/01/Kourtney-Kardashians-secret-wedding-2.jpg", "width": 490, "height": 735}, "locale": "en_US"}, "article": {"published_time": "2018-01-15T15:02:53+00:00", "modified_time": "2018-01-15T15:03:49+00:00"}, "twitter": {"text": {"title": "Kourtney Kardashian’s secret wedding allegedly still had a camera crew"}, "image": "https://starcasm.net/wp-content/uploads/2018/01/Kourtney-Kardashians-secret-wedding-2.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://starcasm.net/wp-content/uploads/2018/04/cropped-Starcasm_site_icon-270x270.jpg"}, "movies": [], "publish_date": 1516028573.0, "source": "http://starcasm.net", "summary": ""}