{"url": "https://www.nydailynews.com/sports/football/tom-brady-cuts-interview-host-calls-daughter-pissant-article-1.3785665", "text": "Super Bowl week got off to a frosty start for Tom Brady.\n\nThe Patriots QB hung up on a radio show Monday morning in response to comments recently made by one of the station’s hosts about his daughter. WEEI’s Alex Reimer recenty referred to Brady’s 5-year-old daughter Vivian as an “annoying little pissant.”\n\nReimer reportedly made the comment Thursday night. Brady was asked about it Monday morning around 7:30 on the “Kirk and Callahan Show,” where the hosts said it was “a stupid thing to say.”\n\nTom Brady with daughter Vivian.\n\n“Well, I think that — I’ve tried to come on this show for many years and have showed you guys a lot of respect,” Brady seethed. “I’ve always tried to come on and do a good job for you guys, so it’s very disappointing when you hear that, certainly. But my daughter or any child, they certainly don’t deserve that.”\n\nReimer’s comment was a reference to Brady’s daughter shouting to him in the opening scene of the Facebook documentary series, “Tom vs. Time.” She was telling her dad she was going to play soccer.\n\nKirk Minihane apologized to Brady, but the QB, who is known to hold legendary grudges, cut the interview short.\n\n“I’ll obviously evaluate whether I want to come on this show again, so I really don’t have much to say this morning. So, maybe I’ll speak with you guys some other time,” Brady said before hanging up.\n\nAlex Reimer of WEEI\n\nAccording to WEEI, Reimer was informed Friday that he is suspended indefinitely. Minihane said on “Kirk and Callahan” that Reimer is “very distraught.”\n\nWEEI later released a statement calling Reimer’s comments “utterly indefensible” and offering their “sincerest apologies” to Brady.\n\n“We are disappointed and embarrassed by Alex Reimer’s on-air comments made last Thursday evening,” the statement reads. “His remarks were utterly indefensible, and mean-spirited commentary directed in any way at children is wholly inappropriate.”\n\nKevin Youkilis, the former Red Sox infielder who is married to Brady’s sister Julie, shared his thoughts on Twitter Monday.\n\n“As a proud family man, it is taking everything in me to not take the low road today,” he wrote. “We will continually take the high road while others feel it necessary to take a swipe at our family. #Karma #Family”\n\nDespite Reimer’s insensitive remarks, Brady later said he doesn’t hope the radio host is fired.\n\n“I just said I would certainly hope the guy’s not fired,” Brady said at Super Bowl Media Day, per Boston.com. “I would hate for that to happen.”\n\nThanks to the controversy, lookups for the word “pissant” are up 115,000 percent on Merriam-Webster.com, the dictionary site said. The word is typically used to describe someone or some thing as insignificant or worthless.\n\nIn the first episode of “Tom vs. Time,” an all-access documentary that follows Brady through this season, Brady summed up how the Patriots view the chaotic week heading into this week when he said, “The Super Bowl environment is all about hype and ridiculous bulls—t that will go on,” adding that “being mentally tough is putting all that BS aside … and doing what you have to do.”\n\nWe’ll see if Brady manages to do that this week.", "images": ["https://secure.gravatar.com/avatar/?s=85&d=mm&r=g", "https://www.nydailynews.com/wp-content/uploads/migration/2018/01/29/XTSQG4XWBLM422ATVG66XLZJPM.jpg?w=1024&h=670", "data:image/webp;base64,UklGRiQAAABXRUJQVlA4IBgAAAAwAQCdASoBAAEAAwA0JaQAA3AA/v3AgAA=", "https://www.nydailynews.com/wp-content/uploads/2023/08/New_York_Daily_News_nydredblack-1.svg"], "top_img": "https://www.nydailynews.com/wp-content/uploads/migration/2018/01/29/XTSQG4XWBLM422ATVG66XLZJPM.jpg?w=1024&h=670", "keywords": [], "authors": ["Evan Grossman"], "canonical_link": "https://www.nydailynews.com/2018/01/29/tom-brady-cuts-off-radio-interview-threatens-to-end-weekly-weei-appearances-after-host-calls-daughter-annoying-little-pissant/", "title": "Tom Brady cuts off radio interview, threatens to end weekly WEEI appearances after host calls daughter ‘annoying little pissant’", "meta_data": {"application-name": "newyorkdailynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "robots": "max-image-preview:large", "tdm-reservation": 1, "mrf": {"authors": "Evan Grossman", "canonical": "https://www.nydailynews.com/2018/01/29/tom-brady-cuts-off-radio-interview-threatens-to-end-weekly-weei-appearances-after-host-calls-daughter-annoying-little-pissant/"}, "description": "There’s a new rift forming with Tom Brady, but this one doesn’t involve the Patriots.", "generator": "WordPress 6.8.3", "og": {"type": "article", "title": "Tom Brady cuts off radio interview, threatens to end weekly WEEI appearances after host calls daughter ‘annoying little pissant’", "url": "https://www.nydailynews.com/2018/01/29/tom-brady-cuts-off-radio-interview-threatens-to-end-weekly-weei-appearances-after-host-calls-daughter-annoying-little-pissant/", "description": "Super Bowl week got off to a frosty start for Tom Brady. The Patriots QB hung up on a radio show Monday morning in response to comments recently made by one of the station’s hosts about his d…", "site_name": "New York Daily News", "image": {"identifier": "https://www.nydailynews.com/wp-content/uploads/migration/2018/01/29/XTSQG4XWBLM422ATVG66XLZJPM.jpg?w=1024&h=670", "width": 1024, "height": 670}, "locale": "en_US"}, "article": {"published_time": "2018-01-29T12:42:02+00:00", "modified_time": "2018-04-07T07:23:33+00:00"}, "twitter": {"text": {"title": "Tom Brady cuts off radio interview, threatens to end weekly WEEI appearances after host calls daughter ‘annoying little pissant’"}, "image": "https://www.nydailynews.com/wp-content/uploads/migration/2018/01/29/XTSQG4XWBLM422ATVG66XLZJPM.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.nydailynews.com/wp-content/uploads/2023/09/cropped-DailyNewsCamera-7.webp?w=270"}, "movies": [], "publish_date": 1517229722.0, "source": "https://www.nydailynews.com", "summary": ""}