{"url": "https://www.celebritynetworth.com/richest-celebrities/richest-comedians/amy-schumer-net-worth/", "text": "What is Amy Schumer's Net Worth and Salary?\n\nAmy Schumer is an American stand-up comic, actress, and author who has a net worth of $45 million. Amy Schumer emerged as one of comedy's most influential voices after breaking through on NBC's \"Last Comic Standing\" in 2007. Following years on the stand-up circuit, Schumer catapulted to mainstream success with her Comedy Central sketch series \"Inside Amy Schumer\" (2013-2016), which earned critical acclaim, multiple Emmy Awards, and a Peabody for its sharp feminist satire and unflinching examination of gender politics.\n\nHer transition to film came with 2015's \"Trainwreck,\" which she wrote and starred in under Judd Apatow's direction. After earning more than $140 million at the box office, the hit established Schumer as a bankable leading actress while maintaining her distinctive comedic voice. She followed with films including \"Snatched,\" \"I Feel Pretty,\" and the more dramatic \"The Humans,\" showcasing her evolving range.\n\nShe has hosted the podcast \"Amy Schumer Presents: 3 Girls, 1 Keith\" with Bridget Everett, Rachel Feinstein, and Keith Robinson since 2018. In 2016, Amy was the first woman to rank as one of the highest-paid comedians in the world with earnings that topped $20 million.\n\nBeyond entertainment, Schumer became a prominent voice in social activism, advocating for gun control following a shooting at a screening of \"Trainwreck\" and speaking out on women's issues. Her 2016 memoir \"The Girl with the Lower Back Tattoo\" became a bestseller, revealing personal struggles with family alcoholism and sexual assault.\n\nIn recent years, Schumer has continued her multi-hyphenate career with Netflix specials, hosting the 2022 Oscars, creating and starring in the Hulu series \"Life & Beth,\" and balancing motherhood after documenting her difficult pregnancy in the HBO Max docuseries \"Expecting Amy.\"\n\nEarly Life\n\nAmy Schumer was born Amy Beth Schumer on June 1, 1981, in Manhattan, New York. Her mother, Sandra, and father, Gordon, owned a baby furniture company called Lewis of London. Her younger sister, Kim, grew up to become a comedy writer and producer (collaborating with Amy on several projects), and her half-brother, Jason, is a jazz musician. When Schumer was 9, her family's company went out of business, and soon after, her father was diagnosed with multiple sclerosis.\n\nSchumer's father is Jewish, and her Protestant mother converted to Judaism before marrying Gordon. Amy has said that while living in Long Island, people around her were openly antisemitic, and kids regularly made fun of her Jewish heritage. Schumer's great-grandmother was a bootlegger during Prohibition, and she opened Schumer's Liquors in New York City after alcohol became legal again. Senator Chuck Schumer is Amy's second cousin once removed. They teamed up to push for stronger gun control laws after a mass shooting occurred at a screening of \"Trainwreck\" in 2015.\n\nEducation\n\nWhen her parents divorced, Amy moved to Long Island with Sandra and attended South Side High School, where she was voted \"Class Clown\" and \"Teacher's Worst Nightmare.\" After graduating in 1999, she attended Central Synagogue of Nassau County, a Hebrew school, before moving to Maryland to attend Towson University. Amy graduated with a theater degree in 2003 and then studied at the William Esper Studio in New York City for 2 years.\n\nStand-Up Comedy Career\n\nSchumer performed her first stand-up comedy set on June 1, 2004, at New York City's Gotham Comedy Club. In 2007, she appeared on Comedy Central's \"Live at Gotham\" and competed on the fifth season of \"Last Comic Standing,\" coming in fourth place. Amy's first half-hour special, \"Comedy Central Presents,\" aired in April 2010, and she followed this with the \"Comedy Central Roast of Charlie Sheen\" in 2011 and the \"Comedy Central Roast of Roseanne Barr\" in 2012. Also in 2012, Comedy Central aired her first one-hour special, \"Amy Schumer: Mostly Sex Stuff,\" which was followed by 2015's \"Amy Schumer: Live at the Apollo\" (HBO), 2017's \"Amy Schumer: The Leather Special\" (Netflix), and 2019's \"Amy Schumer: Growing\" (Netflix).\n\nNetflix Earnings\n\nNetflix paid Schumer $13 million for \"The Leather Special;\" they originally offered her $11 million, but Amy renegotiated her deal after learning that Netflix had struck $20 million deals with Chris Rock and Dave Chappelle. Schumer said that she didn't think she deserved as much money as the two comedy legends but that she believed women deserve equal pay. Amy has regularly sold out arenas during her career, and in 2015, she performed as Madonna's opening act on three shows of the \"Rebel Heart Tour.\"\n\nBook Advance\n\nIn 2015, Schumer landed one of the largest book advance deals of all time, a $9 million deal. When she published \"The Girl with the Lower Back Tattoo\" the following year, it hit #1 on \"The New York Times\" Best Seller list.\n\nActing Career\n\nIn 2008, Amy appeared on Comedy Central's \"Reality Bites Back,\" a reality show parody hosted by Michael Ian Black, and from 2013 to 2016, she starred in \"Inside Amy Schumer,\" which featured sketches and stand-up comedy. Schumer hosted \"Saturday Night Live\" in 2015 and 2018 and hosted the \"2015 MTV Movie Awards.\" Amy has also appeared on \"30 Rock,\" \"Curb Your Enthusiasm,\" and \"Girls\" and has lent her voice to \"Bojack Horseman,\" \"Bob's Burgers,\" \"The Simpsons,\" and \"Family Guy.\"\n\nSchumer made her movie debut in the 2006 short film \"Sense Memory,\" and she has an uncredited appearance in Mike Birbiglia's 2012 movie \"Sleepwalk with Me.\" She also appeared in \"Price Check\" and \"Seeking a Friend for the End of the World\" in 2012, then in 2015, she starred in \"Trainwreck,\" which she also wrote. Judd Apatow directed the film, and it also starred Bill Hader, Brie Larson, Colin Quinn, and John Cena. In 2017, Amy starred with Goldie Hawn in \"Snatched\" and showed her more serious side in \"Thank You for Your Service,\" a film about soldiers suffering from post-traumatic stress disorder. In 2018, Schumer starred in \"I Feel Pretty.\" which grossed $94 million worldwide.\n\nPersonal Life\n\nAmy dated comedian Anthony Jeselnik and professional wrestler Nick Nemeth (aka Dolph Ziggler) before marrying chef Chris Fischer. The wedding took place on February 13, 2018, in Malibu, California. They welcomed son Gene Attell (named after Amy's friend, comedian Dave Attell) on May 5, 2019. The couple later changed Gene's middle name to David, saying that they had realized his original name sounded like \"genital.\"\n\nIn May 2020, Amy and Chris began starring on a Food Network show together, \"Amy Schumer Learns to Cook.\" The show was shot by the couple during quarantine while they cooked in their own kitchen.\n\nAwards and Honors\n\nIn 2015, Amy was featured on Barbara Walters's list of the 10 Most Fascinating People, and she was named one of \"Time\" magazine's 100 Most Influential People. She has won several awards, including a Peabody Award, a Primetime Emmy Award, 2 Critics Choice Movie Awards, and two Television Critics Association Awards, and she has earned Grammy nominations for Best Comedy Album and Best Spoken Word Album.\n\nReal Estate\n\nIn 2014, Schumer paid $1.7 million for a 1-bedroom Manhattan apartment. The fifth-floor walk-up sold for $1.62 million in December 2016 after more than a year on the market.\n\nIn November 2016, she paid $12.15 million for a 4,500-square-foot penthouse on NYC's Upper West Side. The home includes five bedrooms and 5.5 baths. In May 2022, Amy listed this apartment for sale for $15 million. She accepted $13 million in August 2022. Around the time of her Upper West Side townhouse sale, Amy paid $12.25 million for a townhouse in Brooklyn Heights, New York. She listed this property for sale in March 2022 for $14 million.\n\nIn 2022, unconfirmed rumors swirled that Amy paid $12.5 million for a mansion in Montecito, California, that sits on 20 acres. As far as we can tell, this turned out to not be true.", "images": ["https://vz.cnwimg.com/thm/1JoH3482haSLevnlEMdqhrz36y0=/132x132/center/top/filters:format(webp)/2009/11/George-Clooney.jpg", "https://vz.cnwimg.com/thm/uRsxoLs7Ymmit5ATgRtN2utad40=/221x5:381x236/132x132/filters:format(webp):strip_exif()/2009/09/P-Diddy.jpg", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "https://vz.cnwimg.com/thm/1j66MbvUUH9DBLzLkwBc1uWu83s=/132x132/center/top/filters:format(webp)/2020/03/silverman.png", "https://vz.cnwimg.com/thm/0dOqT2nlNQM7u_J-5xWrCsf2nAw=/132x132/center/top/filters:format(webp)/2020/02/Angelina-Jolie.png", "https://vz.cnwimg.com/thm/_hOmdPz8Ht24ZxIeZM7m4mGRouk=/132x132/center/top/filters:format(webp)/2019/11/GettyImages-1094653148.jpg", "https://vz.cnwimg.com/thm/Y14fttV9jls9mxFLuNAHJTnNWTE=/132x132/center/top/filters:format(webp)/2019/10/denzel-washington-1.jpg", "https://vz.cnwimg.com/thm/yboGsO77E1kQwELLmrwRZv_4RmE=/132x132/center/top/filters:format(webp)/2017/02/GettyImages-528215436.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/thm/5sihCxjaccCBx32U-UXHdtoY_-E=/132x132/center/top/filters:format(webp)/2023/01/Dan-Soder.jpg", "https://vz.cnwimg.com/thm/6a060S2o-IC_BSHIVLmsWFftNUQ=/132x132/center/top/filters:format(webp)/2016/08/kurt.jpg", "https://vz.cnwimg.com/thm/IoWqGPmFDjvC6iTqcDsspXBuxqo=/132x132/center/top/filters:format(webp)/2018/03/GettyImages-821622848.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/wp-content/uploads/2020/05/amy.png?x46379", "https://vz.cnwimg.com/thm/dXuAPIEBU--L_kRib4u0nSzjUtE=/132x132/center/top/filters:format(webp)/2020/04/Megan-Fox.jpg", "https://vz.cnwimg.com/thm/lY3-oCS-xIdiqDaOi1qHd6UaTjg=/132x132/center/top/filters:format(webp)/2009/09/Cristiano-Ronaldo.jpg", "https://vz.cnwimg.com/thm/UxnQSql1h0QyX1CgkPqKhTxCTHM=/132x132/center/top/filters:format(webp)/2009/09/Jennifer-Aniston.jpg", "https://vz.cnwimg.com/thm/95i5RI1LWkjHyyoolMeto-z_WeU=/132x132/center/top/filters:format(webp)/2020/01/lopez3.jpg", "https://vz.cnwimg.com/thm/WZby2-7JKiYTzO7nwipeqJhansI=/600x300/center/top/filters:format(webp)/2020/05/amy.png", "https://vz.cnwimg.com/thm/9i9OndqBYXQ1BoIfWDsTdZr80q8=/132x132/center/top/filters:format(webp)/2011/10/anthony-jeselnik-ftr.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://vz.cnwimg.com/thm/akp6Cetcwk72tgNRtu_LUDQWAp8=/132x132/center/top/filters:format(webp)/2023/12/Bridget-Everett.jpg"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2020/05/amy.png?x46379", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/richest-comedians/amy-schumer-net-worth/", "title": "Amy Schumer Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Amy Schumer is an American stand-up comic, actress, and author who has a net worth of $45 million. She rose to fame after competing on NBC's \"Last Comic Standing\" in 2007 and went on to create, co-produce, co-write, and star in Emmy-winning Comedy Central show, \"Inside Amy Schumer.\"", "slick": {"wpversion": "3.0.1", "wppostid": 35383, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2020/05/amy.png?x46379", "group": "post", "category": "richest-comedians:Richest Comedians"}, ";": "richest-celebrities:Richest Celebrities", "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "cnw": {"wppostid": 35383}, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Amy Schumer Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/richest-comedians/amy-schumer-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2020/05/amy.png?x46379", "site_name": "Celebrity Net Worth", "description": "What is Amy Schumer's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2025-03-21T17:04:01+00:00", "published_time": "2020-05-01T17:30:00+00:00", "section": "Richest Comedians", "tag": "Amy Schumer salary"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2020/05/amy.png?x46379", "title": "Amy Schumer Net Worth", "description": "Amy Schumer is an American stand-up comic, actress, and author who has a net worth of $45 million. She rose to fame after competing on NBC's \"Last Comic Standing\" in 2007 and went on to create, co-pro"}}, "movies": [], "publish_date": 1588354200.0, "source": "https://www.celebritynetworth.com", "summary": ""}