{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/josh-gad-net-worth/", "text": "What is Josh Gad's Net Worth and Salary?\n\nJosh Gad is an American actor who has a net worth of $40 million. As we detail later in this article, Josh's most lucrative role to date has been voicing \"Olaf\" in the \"Frozen\" films. He earned $75 million for his work on Frozen 2, 3, and 4.\n\nJosh Gad rose to prominence as Elder Arnold Cunningham in the hit Broadway musical \"The Book of Mormon,\" earning a Tony Award nomination and a Grammy Award for his performance. A graduate of Carnegie Mellon University's School of Drama, Gad began his career in theater before transitioning into screen work, where he quickly became a familiar face in comedy and family entertainment.\n\nGad gained worldwide recognition as the voice of Olaf, the lovable snowman in Disney's \"Frozen\" franchise, starting in 2013. His performance earned him two Annie Awards and made Olaf one of Disney's most iconic modern characters. In addition to his voice work, Gad has appeared in films such as \"The Internship,\" \"Pixels,\" \"Murder on the Orient Express,\" and the live-action remake of \"Beauty and the Beast.\" On television, he starred in series like \"1600 Penn\" and HBO's \"Avenue 5.\" He also co-created the Apple TV+ animated musical series \"Central Park.\"\n\nDuring the COVID-19 pandemic, Gad created the YouTube series \"Reunited Apart,\" bringing together the casts of beloved films to raise money for charity. He released his memoir, \"In Gad We Trust,\" in 2025, offering a humorous and candid look at his career, anxiety, and personal growth.\n\nEarly Life\n\nJosh Gad was born Joshua Ilan Gad on February 23, 1981, in Hollywood, Florida. His parents, Susan and Sam, are from Germany and Afghanistan, respectively, and are both of Jewish descent. They had Josh and his older brothers, Jeff and Jason, before divorcing in 1987. Susan went on to marry investment advisor Stanford Schwartz. From this relationship, Josh has a stepbrother and stepsister.\n\nGad studied at the University School of Nova Southeastern University, where he won the National Forensics League National Tournament Championships two years in a row, for Original Oratory in 1998 and Original Oratory and Humorous Interpretation in 1999. After graduating in 1999, he enrolled at the Carnegie Mellon College of Fine Arts, earning a Bachelor of Fine Arts in drama in 2003. Josh also spent a semester at Australia's National Institute of Dramatic Art.\n\nEarly Film, Television, and Broadway Work\n\nGad's first film was 2002's \"Mary and Joe,\" and three years later, he made his small screen debut in an episode of NBC's \"ER\" and his Broadway debut in \"The 25th Annual Putnam County Spelling Bee.\" In 2007, he appeared in the film \"Watching the Detectives\" and landed a main role on the sitcom \"Back to You.\" Josh played news director Ryan Church on the series, which also starred Kelsey Grammer, Patricia Heaton, Fred Willard, and future \"Modern Family\" star Ty Burrell. In 2008, Gad co-starred with Rainn Wilson, Christina Applegate, and Emma Stone in \"The Rocker,\" appeared in the heist drama \"21,\" lent his voice to Fox's \"American Dad!,\" and guest-starred on the CBS series \"Numb3rs.\" From 2009 to 2011, Josh was a correspondent on Comedy Central's \"The Daily Show with Jon Stewart,\" and during this time, he also appeared in the films \"Crossing Over,\" \"Love & Other Drugs,\" and \"Marmaduke\" (voice only) and produced and starred in a web series called \"Gigi: Almost American.\"\n\nBreakthrough With \"The Book of Mormon\"\n\nIn 2011, Gad returned to Broadway to originate the role of Elder Cunningham in \"The Book of Mormon,\" which won the Tony for Best Musical later that year. The musical, created by Trey Parker, Matt Stone, and Robert Lopez, became a smash hit and has grossed more than $500 million. Gad left the production in June 2012 to star in and co-executive produce \"1600 Penn,\" a sitcom he co-created with Jon Lovett and Jason Winer. Also in 2012, he voiced Louis the molehog in \"Ice Age: Continental Drift,\" which grossed $877.2 million worldwide.\n\nMajor Film Roles and \"Frozen\" Success\n\nIn 2013, Gad co-starred with Vince Vaughn and Owen Wilson in \"The Internship,\" portrayed Apple co-founder Steve Wozniak in \"Jobs,\" and voiced Olaf the snowman in \"Frozen.\" He reprised Olaf in \"Frozen II\" (2019), the short film \"Frozen Fever\" (2015), and the TV special \"Olaf's Frozen Adventure\" (2017). The franchise became a global phenomenon, with \"Frozen\" grossing $1.280 billion and \"Frozen II\" earning $1.450 billion.\n\nFrozen Salary\n\nJosh Gad's role as Olaf in \"Frozen\" has become one of the most financially significant voice performances in animation history. For \"Frozen 2,\" he and his co-stars Kristen Bell and Idina Menzel each earned $15 million. For \"Frozen 3\" and \"Frozen 4,\" all three earned $60 million. The agreement includes an upfront fee of roughly $20 million per film, with additional compensation tied to box-office bonuses and backend performance incentives. The size of the deal reflects both his importance to the franchise and the enormous commercial power of the \"Frozen\" brand across theatrical releases, streaming, merchandise, and theme-park attractions.\n\nContinued Film and Television Work\n\nAfter \"Frozen,\" Gad appeared in films including \"Wish I Was Here\" (2014), \"The Wedding Ringer\" (2015), and \"Pixels\" (2015). In 2017, he starred as LeFou in \"Beauty and the Beast,\" another film that surpassed $1 billion at the global box office. On television, Gad co-starred with Billy Crystal on \"The Comedians,\" competed on \"Celebrity Jeopardy!,\" and made guest appearances on \"Sesame Street.\" He continued adding voice roles in projects such as \"The Angry Birds Movie\" (2016), \"The Angry Birds Movie 2\" (2019), \"A Dog's Purpose\" (2017), \"A Dog's Journey\" (2019), and the series \"Star Wars Rebels\" (2017), \"South Park\" (2017), and \"Bob's Burgers\" (2018).\n\nRecent Projects and Digital Work\n\nDuring the 2020 Coronavirus pandemic, Gad began hosting the hugely popular YouTube series \"Reunited Apart,\" which brought together the casts of classic films like \"Ghostbusters\" and \"Back to the Future\" via video conferencing. In 2020, he also starred in \"Artemis Fowl,\" HBO's space comedy \"Avenue 5,\" Apple TV+'s animated musical \"Central Park,\" and the playful quarantine project \"Home Movie: The Princess Bride.\" Gad is also set to reprise his role as LeFou in a Disney+ prequel series to \"Beauty and the Beast,\" which he co-created and will write and executive produce.\n\nAwards and Nominations\n\nIn 2011, Gad earned a Tony nomination for Best Actor in a Musical for \"The Book of Mormon,\" and he won an Outer Critics Circle Award for Outstanding Actor in a Musical and a Grammy for Best Musical Theater Album. In 2008, he shared the Special Award for Best Ensemble with his \"21\" castmates at the ShoWest Convention, and in 2011, \"Gigi: Almost American\" won a New Media Film Festival Award for Best Web Series. Josh has won several awards for his voiceover work in the \"Frozen\" franchise, including four Behind the Voice Actors Awards (two individual awards and two ensemble awards), two Annie Awards for Outstanding Achievement in Voice Acting in an Animated Feature Production, and a Kids' Choice Award for Favorite Male Voice from an Animated Movie (for both \"Frozen II\" and \"The Angry Birds Movie 2\"). In 2012, he was nominated for an American Comedy Award for Breakout Performer of the Year, and in 2014, he received an Online Film & Television Association award for Best Voice-Over Performance for \"Frozen.\" \"Beauty and the Beast\" earned Gad a Teen Choice Award nomination for Choice: Scene Stealer and an MTV Movie + TV Award nomination for Best Duo (shared with Luke Evans).\n\nPersonal Life\n\nJosh married Ida Darvish, who co-starred with him in a 2004 production of David Ives' \"All in the Timing,\" on May 10, 2008. The couple welcomed daughter Ava on December 1, 2010, and daughter Isabella on February 17, 2014. Gad is the godfather of Theo Gabel, the son of Bryce Dallas Howard and Josh's longtime friend Seth Gabel. Though Josh was raised Jewish and Ida is Catholic, he has said that he is spiritual but doesn't consider himself religious.\n\nReal Estate\n\nIn September 2013, two months before \"Frozen\" was released, Josh paid $2.2 million for a home in the Los Angeles neighborhood of Cheviot Hills. Today, the home is worth around $4 million.", "images": ["https://vz.cnwimg.com/thm/1JoH3482haSLevnlEMdqhrz36y0=/132x132/center/top/filters:format(webp)/2009/11/George-Clooney.jpg", "https://vz.cnwimg.com/thm/I4dSiTJhq0kprSuO--deoPCEAmQ=/132x132/center/top/filters:format(webp)/2020/06/taylor.png", "https://vz.cnwimg.com/thm/KNDSqD-9inbRekV6AGgXDEG2Scw=/375x35:810x586/132x132/filters:format(webp):strip_exif()/2015/09/GettyImages-476575299.jpg", "https://vz.cnwimg.com/thm/wY8kcJfVapsqFInhR3_0o_EHCNc=/600x300/center/top/filters:format(webp)/2020/10/Josh-Gad.jpg", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "https://vz.cnwimg.com/thm/0dOqT2nlNQM7u_J-5xWrCsf2nAw=/132x132/center/top/filters:format(webp)/2020/02/Angelina-Jolie.png", "https://vz.cnwimg.com/wp-content/uploads/2020/10/Josh-Gad.jpg?x46379", "https://vz.cnwimg.com/thm/n3VK5uG66GlnJHLbLaQ8QykRXSA=/132x132/center/top/filters:format(webp)/2013/09/wilson.jpg", "https://vz.cnwimg.com/thm/EZLlL4y9fArd9hFuuJLW9k_lIh0=/132x132/center/top/filters:format(webp)/2019/10/Jonathan-Groff.jpg", "https://vz.cnwimg.com/thm/yboGsO77E1kQwELLmrwRZv_4RmE=/132x132/center/top/filters:format(webp)/2017/02/GettyImages-528215436.jpg", "https://vz.cnwimg.com/thm/RAQkoEunIMtgcSLcaCmlFMMeg5k=/132x132/center/top/filters:format(webp)/2021/04/matt-stone.png", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/thm/IoWqGPmFDjvC6iTqcDsspXBuxqo=/132x132/center/top/filters:format(webp)/2018/03/GettyImages-821622848.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/thm/dXuAPIEBU--L_kRib4u0nSzjUtE=/132x132/center/top/filters:format(webp)/2020/04/Megan-Fox.jpg", "https://vz.cnwimg.com/thm/lY3-oCS-xIdiqDaOi1qHd6UaTjg=/132x132/center/top/filters:format(webp)/2009/09/Cristiano-Ronaldo.jpg", "https://vz.cnwimg.com/thm/UxnQSql1h0QyX1CgkPqKhTxCTHM=/132x132/center/top/filters:format(webp)/2009/09/Jennifer-Aniston.jpg", "https://vz.cnwimg.com/thm/9nmk_3I4Zjo-_Upm4B76gxE66Zk=/132x132/center/top/filters:format(webp)/2022/09/jason-ritter.jpg", "https://vz.cnwimg.com/thm/95i5RI1LWkjHyyoolMeto-z_WeU=/132x132/center/top/filters:format(webp)/2020/01/lopez3.jpg", "https://vz.cnwimg.com/thm/KFAqJ9F4o80l6an2fe78-0jw28s=/132x132/center/top/filters:format(webp)/2019/04/rr.jpg", "https://vz.cnwimg.com/thm/7Cv4edkHrFWJoj2HakYs4T-RIdU=/132x132/center/top/filters:format(webp)/2021/04/trey.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2020/10/Josh-Gad.jpg?x46379", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/josh-gad-net-worth/", "title": "Josh Gad Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Josh Gad is an American actor who has a net worth of $20 million. Josh Gad is best known for playing Elder Cunningham in the hit Broadway musical \"The Book of Mormon\" (which earned him a Tony nomination)", "slick": {"wpversion": "3.0.1", "wppostid": 57559, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2020/10/Josh-Gad.jpg?x46379", "group": "post", "category": "actors:Actors"}, ";": "richest-celebrities:Richest Celebrities", "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "cnw": {"wppostid": 57559}, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Josh Gad Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/josh-gad-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2020/10/Josh-Gad.jpg?x46379", "site_name": "Celebrity Net Worth", "description": "What is Josh Gad's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2025-11-20T21:54:47+00:00", "published_time": "2020-10-06T00:20:06+00:00", "section": "Actors", "tag": "josh gad worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2020/10/Josh-Gad.jpg?x46379", "title": "Josh Gad Net Worth", "description": "Josh Gad is an American actor who has a net worth of $40 million. Josh Gad is best known for playing Elder Cunningham in the hit Broadway musical \"The Book of Mormon\" (which earned him a Tony nominati"}}, "movies": [], "publish_date": 1601943606.0, "source": "https://www.celebritynetworth.com", "summary": ""}