{"url": "www.thesun.co.uk/tvandshowbiz/5735247/miley-cyrus-liam-hemsworth-married-engaged-split/", "text": "MILEY Cyrus and Liam Hemsworth called it quits after over a decade of being together.\n\nTheir split stunned fans, with many allegations leading to cheating and drug abuse – two claims which Miley has firmly denied, but what really happened? Here’s everything you need to know.\n\nWhat has Miley said about their split?\n\nOn August 10, 2019, the couple announced their split, adding that they plan on carrying on as friends and nothing more.\n\nAccording to an official statement made by Miley’s rep, they parted ways to “focus on themselves and careers”.\n\nBut just days after the shock statement was made by a rep of the former couple, photos of Miley making out with Kaitlynn Jenner surfaced online, leading fans to believe she had cheated on Liam, which ultimately led to their split.\n\nThe allegations appeared to strike a nerve with the US pop star, who hit back on Twitter, where she said: “I can admit to a lot of things but I refuse to admit that my marriage ended because of cheating.\n\n“Liam and I have been together for a decade. I’ve said it before & it remains true, I love Liam and always will.”\n\nMiley also slammed the criticism she was getting by tweeting: “I can accept that the life I’ve chosen means I must live completely open and transparent with my fans who I love, and the public, 100% of the time.\n\n“What I cannot accept is being told I’m lying to cover up a crime I haven’t committed. I have nothing to hide.”\n\nWhy did Miley Cyrus and Liam Hemsworth split?\n\nOn August 13, Liam posted on Instagram: “Just a quick note to say that Miley and I have recently separated and I wish her nothing but health and happiness going forward.\n\n“This is a private matter and I have not made, nor will I be making, any comments to any journalists or media outlets.\n\n“Any reported quotes attributed to me are false. Peace and Love.”\n\nMiley’s rep released a statement saying, “Ever evolving, changing as partners and individuals, they have decided this is what’s best while they both focus on themselves and careers.\n\n“They still remain dedicated parents to all of their animals they share while lovingly taking this time apart.”\n\nHow did Miley Cyrus and Liam Hemsworth meet?\n\nMiley Cyrus, 26, had been in a relationship with Australian actor Liam Hemsworth, 28, since 2009.\n\nThe former star couple met on the set of their movie The Last Song.\n\nAt the time Liam was a virtual unknown, while Miley was a Disney pop princess.\n\nDid they call off their wedding?\n\nOn July 19, 2018, it was reported that Miley Cyrus and Liam Hemsworth “called off their wedding” as she’s “not ready to have a baby”.\n\nAccording to OK! Australia sources, the ex Hollywood couple clashed over having children – with the Wrecking Ball singer not ready to become a mum.\n\nThe source said: “‘He wants kids and doesn’t want to keep putting it off but it’s not quite the timeline Miley had in mind. He is left heartbroken.\n\n“Miley put off plans for the wedding and Liam was growing tired of it. They haven’t been getting along in recent months.”\n\nLater that day, however, Liam added a video of the pair to his Instagram story, suggesting the rumours are fake.\n\nOn December 24, 2018, it was revealed the couple “wed in a secret ceremony” at Miley’s house in Franklin, Tennessee, six years after getting engaged.\n\nMiley Cyrus was filmed dancing to Uptown Funk by Mark Ronson in her £6,800 wedding dress by Vivienne Westwood.\n\nThe couple’s wedding photo was just like their first kiss on the set of The Last Song 10 years ago.\n\nTo celebrate finally tying the knot, they took the whole of Liam’s family on a ski trip honeymoon to Montana.\n\nWho is Miley Cyrus dating now?\n\nMiley is reportedly dating Liily drummer, Maxx Morando, 23.\n\nA source told E! News that Miley is “happily dating Maxx,” adding, “It’s official between them.”\n\nRumors that they were dating started to spread after Miley and Maxx were seen attending Gucci’s Love Parade runway show together in November 2021.\n\nMaxx Morando, 23, is the lead drummer of the band, Liily, and was previously a member of The Regrettes from 2015 to 2018.\n\nIn addition to his musical talents, Morando has moved into the fashion industry.\n\nWho is Liam Hemsworth dating now?\n\nLiam has been dating Gabriella Brooks since they were spotted out together in Byron Bay, Australia, in late 2019.\n\nGabriella, born on May 18, 1996, is a model who has worked with big brands like TopShop and Calvin Klein.\n\nLike her beau Liam Hemsworth, she is Australian and lived until recently in Sydney, although her career often took her to LA and London.\n\nShe was scouted to start modeling at 14 and has worked in the industry ever since.\n\nRumors about the couple began at the end of 2019, and at the beginning of 2020, they were spotted kissing on Byron Beach.\n\nA source told PEOPLE in January 2020 that the two were getting “serious.”\n\nAfter COVID-19 hit two months later, the couple took shelter together, quarantining in Hemsworth’s hometown of Phillips Island, Australia.\n\nThey were spotted out for their first official appearance together in June 2021, a whole year and a half after they became an item.\n\nIn December 2021, the couple moved back to Los Angeles together.", "images": ["https://www.thesun.co.uk/wp-content/uploads/2019/08/NINTCHDBPICT000512769413.jpg?quality=90&strip=all&w=1920&h=1080&crop=1", "https://www.thesun.co.uk/wp-content/uploads/2019/01/NINTCHDBPICT000515090602-e1566575907907.jpg?strip=all&w=960", "https://www.thesun.co.uk/wp-content/uploads/2019/01/NINTCHDBPICT000515350689-e1566572042448.jpg?strip=all&w=730", "https://www.thesun.co.uk/wp-content/uploads/2019/01/NINTCHDBPICT000515351099-e1566572025408.jpg?strip=all&w=635", "https://www.thesun.co.uk/wp-content/uploads/2019/08/image-e8f5db62db.jpg?quality=90&strip=all", "https://www.thesun.co.uk/wp-content/uploads/2018/03/nintchdbpict000390036632.jpg?strip=all&w=639", "https://www.thesun.co.uk/wp-content/uploads/2023/11/photo-john-salangsang-wwd-penske-799582704.jpg?strip=all&w=300"], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2019/08/NINTCHDBPICT000512769413.jpg?quality=90&strip=all&w=1920&h=1080&crop=1", "keywords": [], "authors": [], "canonical_link": "https://www.thesun.co.uk/tvandshowbiz/5735247/miley-cyrus-liam-hemsworth-split-divorce-cheating/", "title": "Why did Miley Cyrus and Liam Hemsworth split?", "meta_data": {"copyright": "Copyright 2025 NYP Holdings. All rights reserved.", "viewport": "width=device-width, initial-scale=1", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "robots": "noarchive,noodp,max-image-preview:large", "google-site-verification": "eixRLq6ZFPfabL_W12if1QGJxwbBXFQhFO5J0Vc27EE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "description": "MILEY Cyrus and Liam Hemsworth called it quits after over a decade of being together.Their split stunned fans, with many allegations leading to cheati", "keywords": "Celebrity relationships and break ups,Explainers", "generator": "WordPress 6.5.7", "sailthru.tags": "Celebrity relationships and break ups,Explainers,Liam Hemsworth,Miley Cyrus,Celebrity,Showbiz", "sailthru.date": "2024-02-07 11:04:14", "sailthru.title": "Why did Miley Cyrus and Liam Hemsworth split?", "sailthru.description": "MILEY Cyrus and Liam Hemsworth called it quits after over a decade of being together. Their split stunned fans, with many allegations leading to cheating and drug abuse – two...", "sailthru.image.full": "https://www.thesun.co.uk/wp-content/uploads/2019/08/NINTCHDBPICT000512769413.jpg?quality=90&strip=all", "sailthru.image.thumb": "https://www.thesun.co.uk/wp-content/uploads/2019/08/NINTCHDBPICT000512769413.jpg?quality=90&strip=all&w=50", "bingbot": "noarchive", "article": {"opinion": "false", "content_tier": "free", "published_time": "2024-02-07T11:04:14+00:00", "modified_time": "2024-02-07T11:09:44+00:00", "publisher": 161385360554578, "tag": "Celebrity relationships and break ups, Explainers, Liam Hemsworth, Miley Cyrus", "author": 161385360554578}, "og": {"type": "article", "title": "Why did Miley Cyrus and Liam Hemsworth split?", "url": "https://www.thesun.co.uk/tvandshowbiz/5735247/miley-cyrus-liam-hemsworth-split-divorce-cheating/", "description": "MILEY Cyrus and Liam Hemsworth called it quits after over a decade of being together. Their split stunned fans, with many allegations leading to cheating and drug abuse – two claims which Mil…", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2019/08/NINTCHDBPICT000512769413.jpg?quality=90&strip=all&w=1920&h=1080&crop=1", "secure_url": "https://www.thesun.co.uk/wp-content/uploads/2019/08/NINTCHDBPICT000512769413.jpg?quality=90&strip=all&w=1024"}, "locale": "en_GB"}, "twitter": {"text": {"title": "Why did Miley Cyrus and Liam Hemsworth split?"}, "card": "summary_large_image", "site": "@thesun"}, "fb": {"app_id": 144647118961553, "pages": 161385360554578}, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?w=270"}, "movies": [], "publish_date": 1707303854.0, "source": "http://www.thesun.co.uk", "summary": ""}