{"url": "https://www.huffingtonpost.com/entry/game-of-thrones-lena-headey-harvey-weinstein_us_59e62e62e4b02a215b339cec", "text": "LOADING ERROR LOADING\n\nAs women come forward to accuse Harvey Weinstein of sexual misconduct, they paint an increasingly clear picture of the once-powerful studio executive’s disturbing predatory behavior.\n\n“Game of Thrones” star Lena Headey shared her own Weinstein story in a series of notes posted to Twitter on Tuesday. The actress, who has earned three Emmy nominations for her role as Cersei Lannister in the HBO hit series, said the Miramax co-founder made sexual advances toward her after their first meeting at the Venice Film Festival. Headey was attending to promote the Weinstein-produced film “Brothers Grimm,” which screened there in September 2005.\n\nAdvertisement\n\n“At one point Harvey asked me to take a walk down to the water,” she began. “I walked down with him and he stopped and made some suggestive comment, a gesture. I just laughed it off.”\n\n“I was genuinely shocked. I remember thinking, it’s got to be a joke,” she continued. “I said something like, ‘Oh, come on, mate?!?? It’d be like kissing my dad!!’”\n\nHeadey suggested her rebuff might have cost her roles in other projects helmed by Weinstein, because she was never cast again.\n\nAdvertisement\n\nEchoing stories from many other actresses in recent weeks, Headey recounted a second incident, in which the producer allegedly tried to lure her into his hotel room under the pretense of work.\n\n“I had always carried the thought that he’d never try anything with me again, not after I’d laughed and said never in a million years,” she wrote. “I believed that he respected my boundary and maybe he wanted to talk about potential work.”\n\nOver breakfast, the actress recalled talking “about films, film making.” When the producer asked about Headey’s love life, she “shifted the conversation back to something less personal.” Later, she continued, Weinstein said he wanted to give her a script in his hotel room.\n\nAdvertisement\n\n“We walked to the lift and the energy shifted,” she wrote. “My whole body went into high alert. The lift was going up and I said to Harvey, ‘I’m not interested in anything other than work. Please don’t think I got in here with your for any other reason. Nothing is going to happen,’ I said. I don’t know what possessed me to speak out at that moment, only that I had such a strong sense of ‘don’t come near me.’”\n\nThe producer, she said, did not take her statement well.\n\nC Flanigan via Getty Images\n\n“He was silent after I spoke, furious,” she wrote. “We got out of the lift and walked to his room. His hand was on my back. He was marching me forward, not a word. I felt completely powerless. He tried his key card and it didn’t work, then he got really angry. He walked me back to the lift, through the hotel to the valet, by grabbing and holding tightly to the back of my arm. He paid for my car and whispered in my ear, ‘Don’t tell anyone about this. Not your manager, not your agent.’”\n\nAdvertisement\n\n“I got into my car and cried,” Headey concluded.\n\nThe actress’ tweets also slammed “Brothers Grimm” director Terry Gilliam for “endless bullying” ― a word frequently associated with Weinstein ― and shared a message from a fan thanking her for “outing” the director as “a really really huge asshole.”\n\nHer story comes after The New York Times and The New Yorker publicized allegations of rampant sexual harassment and abuse by Weinstein over decades, blaming Hollywood insiders’ culture of secrecy for keeping it under wraps for so long.\n\nStories That Inspire You Your Support Fuels Our Mission Your Support Fuels Our Mission Become a Member Today As the year ends, our reporting does not slow down. Support the journalists who continue asking questions and telling stories with depth and care. Your membership today helps ensure we start the new year strong. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. Support HuffPost Already a member? Log in to hide these messages.\n\nDozens of women have spoken out against the producer, who was fired from his company last week. Their admissions have encouraged women across social media to share their own personal stories of sexual harassment and abuse, using the hashtag #MeToo.\n\nAdvertisement", "images": ["https://img.huffingtonpost.com/asset/59e63be214000020008c849b.jpeg?cache=YukMlP3Wb8&ops=crop_361_69_1117_789%2Cscalefit_720_noupscale", "https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "https://img.huffingtonpost.com/asset/5bfe09312400001e005838fc.png?ops=100_100", "https://img.huffingtonpost.com/asset/59e63be214000020008c849b.jpeg?cache=YukMlP3Wb8&ops=1200_630", "https://img.connatix.com/fb4e6af1-efbe-4815-b0b1-160559f1d875/1_th.jpg?crop=629:354,smart&width=629&height=354&format=jpeg&quality=60&fit=crop", "https://img.huffingtonpost.com/asset/691c87541700009d2b9c5f37.jpg?ops=50_50"], "top_img": "https://img.huffingtonpost.com/asset/59e63be214000020008c849b.jpeg?cache=YukMlP3Wb8&ops=1200_630", "keywords": [], "authors": ["Reporter", "Whitney Snyder", "Editor-In-Chief Huffpost"], "canonical_link": "https://www.huffpost.com/entry/game-of-thrones-lena-headey-harvey-weinstein_n_59e62e62e4b02a215b339cec", "title": "Lena Headey Recalls How Harvey Weinstein Made Her Feel 'Powerless'", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "The \"Game of Thrones\" actress shared her own sexual harassment experience with the producer on Twitter.", "keywords": "entertainment,harvey weinstein,lena headey", "fb": {"app_id": 46744042133}, "og": {"title": "Lena Headey Recalls How Harvey Weinstein Made Her Feel 'Powerless'", "type": "article", "image": {"identifier": "https://img.huffingtonpost.com/asset/59e63be214000020008c849b.jpeg?cache=YukMlP3Wb8&ops=1200_630", "url": "https://img.huffingtonpost.com/asset/59e63be214000020008c849b.jpeg?cache=YukMlP3Wb8&ops=1200_630", "type": "image/jpeg", "width": 1200, "height": 630}, "url": "https://www.huffpost.com/entry/game-of-thrones-lena-headey-harvey-weinstein_n_59e62e62e4b02a215b339cec", "site_name": "HuffPost", "locale": "en_US", "description": "The \"Game of Thrones\" actress shared her own sexual harassment experience with the producer on Twitter."}, "article": {"tag": "entertainment,harvey weinstein,lena headey", "section": "Entertainment", "published_time": "2017-10-17T17:42:39Z", "modified_time": "2017-10-17T17:42:39Z"}, "twitter": {"card": "summary_large_image", "site": "@HuffPostEnt", "title": "Lena Headey Recalls How Harvey Weinstein Made Her Feel 'Powerless'", "image": {"identifier": "https://img.huffingtonpost.com/asset/59e63be214000020008c849b.jpeg?cache=YukMlP3Wb8&ops=1200_630", "width": 1200, "height": 630}, "description": "The \"Game of Thrones\" actress shared her own sexual harassment experience with the producer on Twitter."}, "al": {"ios": {"url": "huffpostnews:///?editionID=us&entryID=us_59e62e62e4b02a215b339cec", "app_store_id": 306621789, "app_name": "HuffPost"}}, "bingbot": "noarchive", "robots": "max-snippet:-1,max-image-preview:large,max-video-preview:-1", "google-site-verification": "97Mj-wW7u8U1NOnkW1rfH-I1kgO0-a9YsgoesOk41R8"}, "movies": [], "publish_date": 1508262159.0, "source": "https://www.huffingtonpost.com", "summary": ""}