{"url": "https://www.cbc.ca/news/world/prince-philip-last-public-event-retirement-1.4231661", "text": "The audio version of this article is generated by text-to-speech, a technology based on artificial intelligence.\n\nThe 96-year-old husband of Queen Elizabeth made a final, solo, public appearance at Buckingham Palace Wednesday. Both the Queen and Prince Philip have cut their workload, passing on many duties to younger Royals\n\nPrince Philip, the 96-year-old husband of Queen Elizabeth, bowed out of public life today with a final solo appearance at an official event, ending a royal career marked by occasional gaffes that landed him in hot water.\n\nThough known for often off-colour comments that seized the headlines, Philip has been by the Queen's side throughout her 65 years on the throne, and she has described him as \"my strength and stay.\"\n\nHe announced his retirement in May this year, after completing more than 22,000 solo appearances, spanning seven decades. At an engagement on the day of the announcement, a guest had told Philip he was sorry to hear he was standing down.\n\n\"I can't stand up much,\" quipped the prince.\n\nBoth the Queen and Prince Philip have cut their workload in recent years, passing on many responsibilities to son and heir Prince Charles, and grandsons, Princes William and Harry.\n\n70th anniversary\n\nPhilip spent two days in hospital in June for treatment for an infection. The Queen, the world's longest-reigning living monarch who celebrated her 91st birthday in April, will continue to carry out a full program of official engagements.\n\nPhilip married Elizabeth at Westminster Abbey in 1947, and the couple are due to celebrate their 70th wedding anniversary in November.\n\nOutspoken, irascible and intensely private, Philip, a Greek-born former naval officer, developed a reputation for occasional brusque and sometimes politically incorrect comments at ceremonial events he attended.\n\nA stray remark about \"slitty eyes\" during a visit to China in the 1980s became symbolic of his gruff and often unguarded manner.\n\nDuring a visit to Oban in Scotland in 1995, he asked a driving instructor: \"How do you keep the natives off the booze long enough to pass the (driving) test ?\"\n\n'My strength and stay'\n\nWell into his 90s, he made headlines when he exasperatedly swore at a photographer at a 2015 event.\n\nNonetheless, the Queen has described him as a crucial figure during her long reign.\n\n\"He has, quite simply, been my strength and stay all these years,\" Elizabeth said in a rare personal tribute to Philip made in a speech marking their 50th wedding anniversary in 1997.\n\nFor his final solo appearance on Wednesday, Philip, also known as the Duke of Edinburgh, will attend a parade of Royal Marines at Buckingham Palace and meet servicemen who have taken part in a 1,664 mile race to raise money for the Royal Marine's Charity.\n\nBuckingham Palace has said that Philip may choose to accompany Elizabeth at certain events in the future.", "images": ["https://www.cbc.ca/a/assets/nojsimg.gif", "https://i.cbc.ca/ais/1.4232456,1717205692665/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C156%2C3000%2C1687%29%3BResize%3D620", "https://www.cbc.ca/a/assets/logo_cbc-radio-canada.svg", "https://i.cbc.ca/1.4231936.1501684126!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/britain-royals-philip.jpg?im=Resize%3D620", "https://www.cbc.ca/a/assets/texttospeech.svg"], "top_img": "https://i.cbc.ca/1.4231936.1501684126!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/britain-royals-philip.jpg?im=Resize%3D620", "keywords": [], "authors": ["Thomson Reuters"], "canonical_link": "https://www.cbc.ca/news/world/prince-philip-last-public-event-retirement-1.4231661", "title": "Prince Philip makes final solo appearance before retirement", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "Prince Philip, the 96-year-old husband of Queen Elizabeth, bows out of public life today with a final solo appearance at an official event, ending a royal career marked by occasional gaffes that landed him in hot water.", "vf": {"container_id": "1.4231661", "url": "https://www.cbc.ca/news/world/prince-philip-last-public-event-retirement-1.4231661", "section": "2.633"}, "twitter": {"card": "summary_large_image", "site": "@cbc", "title": "Prince Philip makes final solo appearance before retirement | CBC News", "description": "Prince Philip, the 96-year-old husband of Queen Elizabeth, bows out of public life today with a final solo appearance at an official event, ending a royal career marked by occasional gaffes that landed him in hot water.", "image": "https://i.cbc.ca/1.4231936.1501684126!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/britain-royals-philip.jpg?im=Resize%3D620", "player": {"width": 640, "height": 360}}, "google-site-verification": "pJy_QmRvDz2tr7X8eQ6Y1L3Se-8RWM_PpJX42Pr_fYo", "og": {"url": "https://www.cbc.ca/news/world/prince-philip-last-public-event-retirement-1.4231661", "title": "Prince Philip makes final solo appearance before retirement | CBC News", "image": "https://i.cbc.ca/1.4231936.1501684126!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/britain-royals-philip.jpg?im=Resize%3D620", "description": "Prince Philip, the 96-year-old husband of Queen Elizabeth, bows out of public life today with a final solo appearance at an official event, ending a royal career marked by occasional gaffes that landed him in hot water.", "type": "article", "locale": "en_US", "site_name": "CBC"}, "fb": {"pages": 5823419603}}, "movies": [], "publish_date": null, "source": "https://www.cbc.ca", "summary": ""}