{"url": "https://www.chicagotribune.com/entertainment/tv/ct-ent-christmas-prince-sequel-netflix-20181205-story.html", "text": "It is quite difficult to keep track of all the cheesy, made-for-television holiday movies released this time of year – but it certainly helps if one of them goes viral.\n\nThanks to that creepy tweet from Netflix last year, in which the streaming behemoth reminded everyone it’s constantly watching and analyzing your viewing data, “A Christmas Prince” became something of an internet sensation. The movie wasn’t good – in fact, it was kind of terrible. But like all good TV movies, that made it even more fun to watch.\n\nNaturally, Netflix commissioned a sequel: “A Christmas Prince: The Royal Wedding,” which started streaming Friday. Here’s everything you need to know:\n\n1. The main players are back – for the most part\n\nFor those who can’t remember, the gist of the original “A Christmas Prince”: A frustrated New York journalist named Amber (Rose McIver of The CW’s “iZombie”) arrived in the lovely country of Aldovia, determined to get a scoop that would impress her editors and finally get her a promotion. Amber’s task was to report on Prince Richard (also known as “His Royal Hotness,” played by Ben Lamb of “The White Queen”), who might abdicate the throne after his father’s death and throw the whole country into chaos.\n\nAmber was mistaken for Richard’s younger sister’s tutor, so she found herself with the undercover scoop of a lifetime. Naturally, she wound up falling for Richard (because that’s what female journalists do in movies), and he was very hurt when he found out her true identity. But then everything was fine. He forgave her. And Richard became king and proposed to Amber; if you don’t fall in love and get engaged in about 72 hours in these movies, you’re doing something wrong.\n\nAnyway, nearly everyone has returned: Amber; Richard; Richard’s little sister, Emily; Richard’s mother, Queen Helena; Richard’s troublemaking cousin, Simon, etc. However, Amber’s father has been recast – and outfitted with a much campier personality, playing up his Brooklyn roots and being an extremely embarrassing dad as Amber tries to impress the royals.\n\n“We’re gonna burn the house down, kiddo!” he says jubilantly as he first arrives at the palace.\n\nAmber hurries to assure the royal family: “He didn’t mean that literally.”\n\n2. There’s really no need to catch up on the first movie\n\nWithout giving all the “plot” details away, we can assure you that if you missed the first “A Christmas Prince,” you probably won’t have a difficult time catching up. The 90-minute sequel takes place exactly a year after the last movie ended, as the palace is in a frenzy for Richard and Amber’s coming wedding on Christmas Day.\n\nHowever, there are some dark subplots: The country of Aldovia is in a financial crisis. Amber suddenly realizes that yes, becoming a member of a royal family means your entire life belongs to them. Oh, and Princess Emily’s Christmas play is briefly in trouble, though that jam is particularly low-stakes.\n\n3. There are a few callbacks\n\nFor die-hard fans, you’ll recognize more than a few elements. Some plot points are repeated: For example, Amber’s bossy wedding planner steals a cab at the airport, just as Richard stole Amber’s cab last time. Amber’s dad makes her favorite menu items from his diner, a “Coney Island Bloodhound” (a hot dog) and a “Blonde With Sand” (coffee with cream and sugar).\n\nPlus, the movie writers were definitely listening to all of the ways that people made fun of the original. Amber was employed at the magazine “Now Beat,” a name that received plenty of mockery – or was it “Beat Now”? No one on the internet could tell. In the sequel, there’s similar confusion, as Amber and her former co-workers talk about how “Now Beat” folded.\n\n“Now Beat?” Amber said, and then definitively answered: “It was Beat Now.”\n\n4. There are some parallels to real-life royals\n\nCoincidentally or not, Amber has a few things in common with Meghan Markle, also an American marrying into a royal family. Similar to Markle, Amber has a blog, albeit with the uncreative title “Amber’s Blog.” A major theme in the movie is how all sorts of people are worrying about Amber breaking “protocol,” because she doesn’t want to lose her own identity. We have a feeling this might sound familiar to some new members of the real-life palace.\n\nOriginally appeared in the Washington Post", "images": ["data:image/webp;base64,UklGRiQAAABXRUJQVlA4IBgAAAAwAQCdASoBAAEAAwA0JaQAA3AA/v3AgAA=", "https://www.chicagotribune.com/wp-content/uploads/2023/12/2560px-Chicago_Tribune_Logo.svg-1.png", "https://www.chicagotribune.com/wp-content/uploads/2023/12/chicago-tribune-logo-basic.jpeg", "https://secure.gravatar.com/avatar/?s=85&d=mm&r=g"], "top_img": "https://www.chicagotribune.com/wp-content/uploads/2023/12/chicago-tribune-logo-basic.jpeg", "keywords": [], "authors": ["Washington Post"], "canonical_link": "https://www.chicagotribune.com/2018/12/05/what-to-know-about-netflixs-a-christmas-prince-the-royal-wedding-the-sequel-to-last-years-viral-hit/", "title": "What to know about Netflix’s ‘A Christmas Prince: The Royal Wedding,’ the sequel to last year’s viral hit", "meta_data": {"application-name": "chicagotribune", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "robots": "max-image-preview:large", "tdm-reservation": 1, "mrf": {"authors": "Washington Post", "canonical": "https://www.chicagotribune.com/2018/12/05/what-to-know-about-netflixs-a-christmas-prince-the-royal-wedding-the-sequel-to-last-years-viral-hit/"}, "description": "It is quite difficult to keep track of all the cheesy, made-for-television holiday movies released this time of year – but it certainly helps if one of them goes viral. Thanks to that creepy tweet from Netflix last year, in which the streaming behemoth reminded everyone it’s constantly watching and analyzing your viewing data, “A […]", "generator": "WordPress 6.8.3", "og": {"type": "article", "title": "What to know about Netflix’s ‘A Christmas Prince: The Royal Wedding,’ the sequel to last year’s viral hit", "url": "https://www.chicagotribune.com/2018/12/05/what-to-know-about-netflixs-a-christmas-prince-the-royal-wedding-the-sequel-to-last-years-viral-hit/", "description": "It is quite difficult to keep track of all the cheesy, made-for-television holiday movies released this time of year – but it certainly helps if one of them goes viral. Thanks to that creepy …", "site_name": "Chicago Tribune", "image": {"identifier": "https://www.chicagotribune.com/wp-content/uploads/2023/12/chicago-tribune-logo-basic.jpeg", "width": 1200, "height": 630}, "locale": "en_US"}, "article": {"published_time": "2018-12-05T14:05:00+00:00", "modified_time": "2018-12-05T19:05:59+00:00"}, "twitter": {"image": "https://www.chicagotribune.com/wp-content/uploads/2023/12/chicago-tribune-logo-basic.jpeg", "text": {"title": "What to know about Netflix’s ‘A Christmas Prince: The Royal Wedding,’ the sequel to last year’s viral hit"}, "card": "summary"}, "msapplication-TileImage": "https://www.chicagotribune.com/wp-content/uploads/2024/02/favicon.png?w=16"}, "movies": [], "publish_date": 1543986000.0, "source": "https://www.chicagotribune.com", "summary": ""}