{"url": "https://simple.wikipedia.org/wiki/Snow_White_and_the_Seven_Dwarfs_(1937_movie)", "text": "Story [ change | change source ] An evil Queen has a mirror and asks \"Magic Mirror on the wall, who is the fairest one of all?\" The mirror answers \"Snow White\". Snow White is the princess of the kingdom and the evil Queen is her stepmother. The evil Queen is jealous of Snow White's beauty so she sends a Huntsman to kill her. However, he decides not to and lets Snow White escape. Snow White is lost in the woods, and comes across the home of seven little men, or Dwarfs named Doc, Grumpy, Happy, Sleepy, Bashful, Sneezy, and Dopey. She cleans their home, and they allow her to stay with them. The Queen eventually finds out that the Huntsman did not kill Snow White. The Queen, who is also a witch, transforms into an old hag. She goes to the dwarfs' cottage the next day while they're out and gets Snow White to bite into an apple with makes her fall dead. Suddenly, the dwarfs chase the old hag up a cliff and trap her. The hag tries to crush them with a boulder but lightning strikes the cliff and she falls off. Snow White is awakened by the kiss of a handsome Prince and they get married.\n\nProduction [ change | change source ] Walt Disney introduces each of the Seven Dwarfs in a scene from the original 1937 Snow White theatrical trailer. Development on Snow White and the Seven Dwarfs began in early 1934, and in June 1934, Walt Disney announced the production of his first feature to the New York Times.[2] Before Snow White, the Disney studio had been mainly involved in the production of highly successful animated shorts in the Mickey Mouse and Silly Symphonies series. Disney hoped to enlarge his studio's reputation and money by moving into features, and estimated that Snow White could be produced for a budget of $250,000 - ten times the budget of an average Silly Symphony. Walt Disney had to fight to get the movie produced. Both his brother Roy Disney and his wife Lillian attempted to talk him out of it, and the Hollywood movie industry mockingly referred to the movie as \"Disney's Folly\" while it was in production. He even had to mortgage his house to help finance the movie's production, which eventually ran up a total cost of just over $1.5 million, a huge sum for a movie in 1937. The 90th anniversary movie on Blu-ray in June 1, 2027.\n\nRelease [ change | change source ] Snow White and the Seven Dwarfs was first shown in cinemas on December 21, 1937. It was released across the United States on February 4, 1938. It has been re-released many times since. The first time was in 1944, in order to raise money for the Disney studio during World War II. This set a tradition of re-releasing Disney animated features every seven to ten years. Snow White was re-released to theaters in 1952, 1958, 1967, 1975, 1983, 1987 and 1993.", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/40px-Wikiquote-logo.svg.png", "https://simple.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-simple.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/SNOW_WHITE_DISNEY.jpg/250px-SNOW_WHITE_DISNEY.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "https://simple.wikipedia.org/static/images/icons/wikipedia.png", "https://simple.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Snow_white_1937_trailer_screenshot.jpg/250px-Snow_white_1937_trailer_screenshot.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Snow_White_2024_logo.png/330px-Snow_White_2024_logo.png", "https://simple.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/commons/b/b0/Snow_white_1937_trailer_screenshot.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Walt_Disney_Snow_white_1937_trailer_screenshot_%2813%29.jpg/250px-Walt_Disney_Snow_white_1937_trailer_screenshot_%2813%29.jpg", "https://simple.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://simple.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/78/Evil_Queen_WDW.jpg/250px-Evil_Queen_WDW.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Snow_white_1937_trailer_screenshot.jpg", "keywords": [], "authors": [], "canonical_link": "https://simple.wikipedia.org/wiki/Snow_White_and_the_Seven_Dwarfs_(1937_movie)", "title": "Snow White and the Seven Dwarfs (1937 movie)", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Snow_white_1937_trailer_screenshot.jpg", "width": 1200, "height": 960}, "title": "Snow White and the Seven Dwarfs (1937 movie) - Simple English Wikipedia, the free encyclopedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://simple.wikipedia.org", "summary": ""}