{"url": "https://web.archive.org/web/20070518064337/http://www.time.com:80/time/magazine/article/0,9171,810925,00.html", "text": "(See Cover)\n\nGeorge Wilcken Romney, at 51, is a broad-shouldered, Bible-quoting broth of a man who burns brightly with the fire of missionary zeal. On the Lord's Day, and whenever else he can find time, he is a fervent apostle for the Mormon Church, in which he is a high official. But at all other times his missionary zeal is best defined by a plaque that hangs in the walnut-paneled Detroit office where he reigns as boss of American Motors. A facetious gift from the Cleveland Auto Dealers Association, it reads: \"To George Romney, critic, lecturer, anthropologist, white hunter of the American dinosaur.\"\n\nThe American dinosaur, to Romney, is the long, low, chrome-laden U.S. auto, i.e., any car of his Big Three competitors. Where does he hunt it? At conventions, Rotary meetings, congressional hearings, wherever he can find a platform or a soapbox. He closes in on the quarry with a verbal barrage. Back and forth he rocks, clenching his fists, screwing his handsome face into an intense mask. Out shoot the words in evangelical, organlike tones; down flies his big fist to shake the dust from the table.\n\nHe even carries his own props. \"This fellow here,\" he says, suddenly snatching a green china dinosaur from his briefcase, \"is called a triceratops. He had the biggest radiator ornament in prehistoric history. It kept getting bigger and bigger until finally he could no longer hold up his head. He had a wheelbase of nearly 30 feet. The dinosaur perished because he got too big.\"\n\nThen Romney pauses dramatically, juts his formidable jaw. \"Who,\" he challenges, \"wants to have a gas-guzzling dinosaur in his garage?\" In the silence that follows, Romney races on to introduce the creature he would most like to see replace the dinosaur: American Motors' compact little Rambler.\n\nNow, Ladies. With inexhaustible energy Romney last year traveled 70,000 miles across the U.S. to preach his message, sometimes sleeping and eating in his Rambler. He wears an alarm wrist watch to remind himself when to stop talking, but no one can remember a time when he ever heeded it. He likes to get up before women's clubs, fix the ladies accusingly with his blue-grey eyes. \"Ladies,\" he says, wagging his finger at them, \"why do you drive such big cars? You don't need a monster to go to the drugstore for a package of hairpins. Think of the gas bills!\" No audience is too small for him. Caught in a taxi in the middle of a St. Louis traffic jam, he lectured the captive driver: \"Now if we all drove small cars, we'd have a lot less trouble like this.\" His parting tip as he abandoned the cab and sprinted off on foot: \"Next time try a Rambler.\"\n\nRecently, when an American Motors executive showed up at an automobile manufacturers' meeting in place of Romney, a Big Three auto official asked: \"Where's the boss?\" Said the substitute: \"He's making a speech.\" Yawned the Big Three man: \"So what else is new?\"", "images": ["https://web.archive.org/web/20070518064337im_/http://img.timeinc.net/time/daily/2007/0705/175_jerry_seinfeld_bee0517.jpg", "https://web.archive.org/web/20070518064337im_/http://img.timeinc.net/time/daily/2007/0705/175_computer_portal_0510.jpg", "https://web.archive.org/web/20070518064337im_/http://ar.atwola.com/image/93224417/aol", "https://web.archive.org/web/20070518064337im_/http://img.timeinc.net/time/i/blank.gif", "https://web.archive.org/web/20070518064337im_/http://adremote.timeinc.net/image.ng/site=time&channel=cm&adsize=336x15&pagepos=cmarticlepagebtf", "https://web.archive.org/web/20070518064337im_/http://img.timeinc.net/time/favicon.ico", "https://web.archive.org/web/20070518064337im_/http://img.timeinc.net/time/daily/2007/0705/175_hairspray0517.jpg", "https://web.archive.org/web/20070518064337im_/http://adremote.timeinc.net/image.ng/site=time&channel=cm&adsize=245x15&pagepos=cmglobaltout", "https://web.archive.org/web/20070518064337im_/http://img.timeinc.net/time/i/subscribe.gif", "https://web.archive.org/web/20070518064337im_/http://s3.addthis.com/button1-bm.gif", "https://web.archive.org/web/20070518064337im_/http://img.timeinc.net/time/photoessays/2007/jerry_falwell/175_falwell_tout.jpg", "https://web.archive.org/web/20070518064337im_/http://img.timeinc.net/time/cartoons/20070520/tout_cartoon_1.jpg"], "top_img": "https://web.archive.org/web/20070518064337im_/http://img.timeinc.net/time/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "The Dinosaur Hunter", "meta_data": {"head": "The Dinosaur Hunter", "keywords": "Art, Automobiles, Babies, Basketball, Beverages, Business, Blacks, Children, Consumer, Corporations, Economy, Employment, Energy, Family, Finance, Forecasts, Foreign Relations, Government, Housing, Labor, Layoff, Manufacturing, Merger, Music, Mutual Funds, Real Estate, Records, Recreation, Religion, Retail, Sports, Terrorism, Travel, Trend", "description": "(See Cover) George Wilcken Romney, at 51, is a broad-shouldered, Bible-quoting broth \nof a man who burns brightly with the fire of missionary zeal. On the \nLord's Day, and whenever else he can...", "srce": "/time Magazine", "path": "/time/magazine/article/0,9171,810925,00.html", "date": "Monday, Apr. 06, 1959", "word_count": 4764}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}