{"url": "https://www.vox.com/culture/2017/10/13/16465216/ben-affleck-harvey-weinstein-sexual-harassment", "text": "is a senior correspondent on the Culture team for Vox, where since 2016 she has covered books, publishing, gender, celebrity analysis, and theater.\n\nThe scandal that has destroyed the reputation of Hollywood mega mogul Harvey Weinstein appears to be widening its scope to the point that it might take down actor and filmmaker Ben Affleck, too.\n\nAffleck, like other prominent figures in Hollywood, has publicly denounced Weinstein, declaring himself “angry and saddened” at the allegations that Weinstein has harassed and assaulted multiple women throughout his career, and saying that reading details of the accusations “made him sick.”\n\nBut in speaking out against him, Affleck — a close colleague and protégé of Weinstein’s — seems to have only inspired people to share accounts of the harassment he has allegedly committed himself. Multiple women have come forward with accounts of harassment from Affleck, both on- and off-camera, as well as stories they say prove he has been complicit in other men’s harassment of women.\n\nAs Anna North wrote here at Vox, when one woman comes forward with a story of sexual assault, she inspires a domino effect: More women feel that it is safe to come forward with their own stories, so what started out as a case built around Ashley Judd and a few other women saying on the record that Weinstein harassed them became a case with dozens of accusers.\n\nAnd the domino effect can work between cases, too. Multiple sources have said that women began to speak out against Weinstein because they saw what happened to Roger Ailes and Bill O’Reilly and Bill Cosby when women joined together to share their stories. Now, the domino effect seems to have spread from Weinstein to Affleck.\n\nWhat remains to be seen is whether it will do more than cause a temporary scandal, and whether it will ever lead to actual consequences with measurable, lasting effects.\n\nAffleck’s past includes a lot of time spent around men facing sexual harassment accusations, and a lot of time on camera groping women\n\nOne reason that Affleck has become something of a secondary target as fallout from the Weinstein scandal spreads is that he spent much of the last year helping his brother Casey Affleck successfully campaign for an Oscar, even as the story emerged that Casey had faced two sexual harassment lawsuits in the past. Ben appeared at parties and premieres with Casey in what looked like an attempt to whip up support for Casey’s Best Actor run, and he certainly never made a public statement condemning Casey’s alleged sexual harassment — a fact that many observers were quick to point out when he made a statement condemning Weinstein.\n\nSo Affleck has a history of appearing to support men who have been accused of committing sexual assault, a history that is fresh in the public’s mind. And it seems to have prompted multiple people to remember that Affleck also has a history of publicly groping women under the cover of frat-boy humor. Most infamously, he is said to have groped the breasts of One Tree Hill actress Hilarie Burton when they appeared on MTV’s TRL together in 2003.\n\nIn the segment, Affleck (who was 31 at the time) wraps his arm around Burton (then 21) and slides his hand down and out of the frame, apparently tweaking her breast, while Burton laughs uncomfortably. “That’s a move,” he tells the camera nonchalantly.\n\nThe episode cuts to a talking head confessional. “Some girls like a good tweakage here and there,” Burton says. “I’d rather have a high five.”\n\n“I was a kid,” she wrote on Twitter this week, adding, “I had to laugh back then so I wouldn’t cry.”\n\n“I acted inappropriately toward Ms. Burton and I sincerely apologize,” Affleck responded on Twitter.\n\nIn another video that resurfaced this week, Affleck pulls interviewer Anne-Marie Losique onto his lap and comments on her breasts while filming a 2004 segment for the Canadian TV series Box-Office. “Everything you know about Affleck is wrong,” says the summary for the video on YouTube, apparently uploaded by an independent party in 2006.\n\n“They would like it better if you did the show topless, the station, wouldn’t they?” he says, appearing to hold Losique down on his lap as she squirms. “You usually show a lot more cleavage than this,” he adds. “What’s the story? Why are you covering it up today?”\n\n“It’s Sunday morning,” Losique says, laughing.\n\n“That never stopped you before from getting them titties out,” Affleck says, smirking. He pulls her in tighter and hugs her. “These breasts are very firm, suspiciously firm, I have to say.”\n\nIn an interview this week, Losique told the Hollywood Reporter she was not uncomfortable with Affleck’s behavior. “This was for the camera,” she said. “You have to understand that we have done dozens and dozens of interviews like that. It was for a show I was producing, so I was not at all a victim. When the cameras rolled, we would start to do that game. As soon as it stopped rolling, there was none of that. He never touched me in any improper way. He was very respectful, I must say.”\n\nBut while Losique may not have minded Affleck’s advances, other women have come forward to say that Affleck groped them in public as well — and that he did not have their consent and they most certainly did mind.\n\nTV writer Jen Statsky and author Annamarie Tendler both say that Affleck groped multiple women at a Golden Globes party in 2014. “He walked by me, cupped my butt and pressed his finger into my crack,” wrote Tendler on Twitter, adding, “I guess he tried to play it like he was politely moving me out of the way and oops touched my butt instead of my lower back?” Affleck has not publicly commented on Tendler’s allegations.\n\nThe emerging narrative about Affleck has been met not with surprise but with resigned acceptance and disgust: Yes, that tracks, seems to be the overwhelming sentiment. Affleck has publicly associated with men accused of sexual harassment for so long that it feels shocking less because these allegations are emerging, and more because they didn’t emerge years ago. If it’s common for Affleck’s younger brother and close professional colleague to allegedly harass the women around them without any apparent disapproval from Affleck, the thinking goes, it doesn’t seem implausible that Affleck himself would also harass the women around him.\n\nIn 2017, a sexual harassment scandal can hurt a career. But it won’t necessarily end one.\n\nIt seems likely that Harvey Weinstein is going to be cut out of Hollywood for a long, long time. Maybe he’ll even be cut out for longer than the eight years Mel Gibson spent in exile after he was caught on tape telling his wife she deserved to be gang-raped before he returned to the fold this year with an Oscar nomination for directing Hacksaw Ridge. And as Ben Affleck gets caught in the domino effect, he too might have to take a break from public life and his film career.\n\nAs more and more women come forward to speak out against powerful men in Hollywood with allegations of sexual harassment, assault, and rape, it’s become less dangerous to make these allegations. There’s less fear of being blackballed for the rest of your career, or having every detail of your past dug up and legislated on CNN.\n\nBut it’s not clear that these allegations actually end the careers of the men who face them. And it has yet to be proved that any of them will ever face legal consequences.", "images": ["https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9453113/98094146.jpg?quality=90&strip=all&crop=0%2C9.9316166257079%2C100%2C80.136766748584&w=1200", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-2155209999.jpg?quality=90&strip=all&crop=16.669458870833%2C0%2C66.661082258335%2C100&w=2400", "https://www.google-analytics.com/g/collect?v=2&tid=G-C3QZPB4GVE&cid=555&en=noscript_page_view", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/the-true-meaning-of-friendsgiving.jpg?quality=90&strip=all&crop=21.875%2C0%2C56.25%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/3_Vox_FuturePerfect25_LandingPage.gif?quality=90&strip=all&crop=16.666666666667%2C0%2C66.666666666667%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9605083/687736578.jpg?quality=90&strip=all&crop=13.3%2C0%2C51.333333333333%2C77&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9538503/headshots_1508964052528.jpg?quality=90&strip=all&crop=16.666666666667%2C0%2C66.666666666667%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/AlexAbad-Santos_Vox.jpg?quality=90&strip=all&crop=16.666666666667%2C0%2C66.666666666667%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-2155209999.jpg?quality=90&strip=all&crop=0.0041883062489489%2C0%2C99.991623387502%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/AlexAbad-Santos_Vox.jpg?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-590696434.jpg?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/3_Vox_FuturePerfect25_LandingPage.gif?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-590696434.jpg?quality=90&strip=all&crop=16.666666666667%2C0%2C66.666666666667%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9605083/687736578.jpg?quality=90&strip=all&crop=0.46666666666667%2C0%2C77%2C77&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/gettyimages-2217689678.jpg?quality=90&strip=all&crop=16.650390625%2C0%2C66.69921875%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/author_profile_images/11909/profile_pic.jpg?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=96", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9538503/headshots_1508964052528.jpg?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/the-true-meaning-of-friendsgiving.jpg?quality=90&strip=all&crop=7.8125%2C0%2C84.375%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/10711815/490064598.jpg.jpg?quality=90&strip=all&crop=0%2C1.8536350505537%2C100%2C96.292729898893&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9453113/98094146.jpg?quality=90&strip=all&crop=0.99999999999999%2C0%2C98%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/gettyimages-2217689678.jpg?quality=90&strip=all&crop=0%2C0.024402147388969%2C100%2C99.951195705222&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/10711815/490064598.jpg.jpg?quality=90&strip=all&crop=15.383333333333%2C0%2C69.233333333333%2C100&w=2400"], "top_img": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9453113/98094146.jpg?quality=90&strip=all&crop=0%2C9.9316166257079%2C100%2C80.136766748584&w=1200", "keywords": [], "authors": ["Constance Grady"], "canonical_link": "https://www.vox.com/culture/2017/10/13/16465216/ben-affleck-harvey-weinstein-sexual-harassment", "title": "The Harvey Weinstein scandal has inspired a Ben Affleck scandal", "meta_data": {"bingbot": "nocache", "twitter": {"card": "summary_large_image", "site": "@voxdotcom", "url": "https://www.vox.com/culture/2017/10/13/16465216/ben-affleck-harvey-weinstein-sexual-harassment", "title": "The Harvey Weinstein scandal has inspired a Ben Affleck scandal", "description": "Multiple women are accusing Ben Affleck of sexual harassment.", "image": {"identifier": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9453113/98094146.jpg?quality=90&strip=all&crop=0%2C9.9316166257079%2C100%2C80.136766748584&w=1200", "alt": "24th Annual American Cinematheque Honors Matt Damon - Show"}}, "fb": {"app_id": 549923288395304}, "og": {"site_name": "Vox", "title": "The Harvey Weinstein scandal has inspired a Ben Affleck scandal", "description": "Multiple women are accusing Ben Affleck of sexual harassment.", "url": "https://www.vox.com/culture/2017/10/13/16465216/ben-affleck-harvey-weinstein-sexual-harassment", "type": "article", "image": {"identifier": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9453113/98094146.jpg?quality=90&strip=all&crop=0%2C9.9316166257079%2C100%2C80.136766748584&w=1200", "alt": "24th Annual American Cinematheque Honors Matt Damon - Show", "type": "image/jpeg", "width": 1200, "height": 628}}, "viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Vox", "robots": "index,follow,max-image-preview:large", "description": "Multiple women are accusing Ben Affleck of sexual harassment.", "article": {"published_time": "2017-10-13T14:00:01+00:00", "modified_time": "2017-10-13T14:00:01+00:00"}, "author": "Constance Grady", "amazonbot": "noarchive", "parsely-type": "post", "parsely-title": "The Harvey Weinstein scandal has inspired a Ben Affleck scandal", "parsely-link": "https://www.vox.com/culture/2017/10/13/16465216/ben-affleck-harvey-weinstein-sexual-harassment", "parsely-image-url": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/9453113/98094146.jpg?quality=90&strip=all&crop=0,9.9316166257079,100,80.136766748584", "parsely-pub-date": "2017-10-13T14:00:01+00:00", "parsely-section": "culture", "parsely-tags": "vox,pagetype:story,latest-news,metoo,celebrities,culture,gender,life,movies,stream-16198791", "parsely-author": "Constance Grady", "cse-category": "Culture", "cse-authors": "Constance Grady", "next-head-count": 51}, "movies": [], "publish_date": 1507867200.0, "source": "https://www.vox.com", "summary": ""}