{"url": "https://en.wikipedia.org/wiki/Sarah_Michelle_Gellar", "text": "American actress (born 1977)\n\nSarah Michelle Prinze (née Gellar GHEL-ər; born April 14, 1977) is an American actress. After being spotted by a talent agent as a young child, she made her film debut at age six in the television film An Invasion of Privacy (1983). She had her first leading role in the syndicated teen drama series Swans Crossing (1992), which was followed by her breakthrough as Kendall Hart on the ABC soap opera All My Children (1993–1995), for which she won a Daytime Emmy Award.\n\nGellar achieved international recognition for her portrayal of Buffy Summers on the WB/UPN supernatural series Buffy the Vampire Slayer (1997–2003), which earned her four Teen Choice Awards and a Golden Globe nomination.[2] Her film credits include I Know What You Did Last Summer (1997), Scream 2 (1997), Cruel Intentions (1999), Scooby-Doo (2002), Scooby-Doo 2: Monsters Unleashed (2004), The Grudge (2004), Southland Tales (2006), TMNT (2007), and Do Revenge (2022).[3]\n\nOn television, Gellar has starred in Ringer (2011–2012), The Crazy Ones (2013–2014), Wolf Pack (2023), and Dexter: Original Sin (2024–2025), and provided voice work for Robot Chicken (2005–2018), Star Wars Rebels (2015–2016), and Masters of the Universe: Revelation (2021). In 2015, she co-founded Foodstirs, an e-commerce baking company.[4] Her cookbook, Stirring Up Fun with Food, was published in 2017.\n\nEarly life [ edit ]\n\nGellar was born in New York City on April 14, 1977. She is the only child of Rosellen (née Greenfield), a nursery school teacher, and Arthur Gellar, a garment worker.[5][6] Both of her parents are Jewish.[7][8] In 1984, when she was seven, her parents divorced and she was raised by her mother on Manhattan's Upper East Side.[9] While growing up, she lost contact with her father, from whom she remained estranged until his death in 2001.[10][11][12] She once described him as \"non-existent\",[13] and stated: \"My father, you can just say, is not in the picture. I'm not being deliberately evasive about him, it's just that there's so little to say.\"[12][14][15] Gellar was a competitive figure skater, once finishing in third place at a New York State regional competition,[16] as well as having a black belt in taekwondo.[16]\n\nWith her single mother working \"just above the poverty line\",[17] Gellar received a partial scholarship to study at the Columbia Grammar & Preparatory School, where she experienced bullying.[16][18] She remarked: \"I was different and that's the one thing you can't be at school, because you're ostracised. I didn't have the money these kids had\".[19] As a working child actress, she was not present in class for a considerable amount of time, and recalled having \"more absences in the first month than you're supposed to have for an entire year\".[16] She then briefly attended the Fiorello H. LaGuardia High School of Music & Art and Performing Arts, but dropped out due to acting obligations.[16] Gellar graduated from the Professional Children's School[16][20][21] in 1994 as a \"straight A\" student with a 4.0 grade average.[22][23][24] As she spent significant time working on All My Children while \"trying to graduate\",[25] the majority of her senior year was completed through guided study.[26]\n\nCareer [ edit ]\n\nBeginnings and breakthrough (1981–1996) [ edit ]\n\nAt the age of four, Gellar was spotted by an agent in a restaurant in Upper Manhattan.[27] Two weeks later, she auditioned for a part in the television film An Invasion of Privacy. At the audition, she read both her own lines and those of Valerie Harper, impressing the directors enough to cast her in the role.[16] The film aired on CBS in January 1983.[28]\n\nWhile growing up, Gellar appeared in television commercials for such brands as Burger King, Shake 'n Bake, Duncan Hines, and Avon.[29][30] A 1982 advertisement for Burger King, in which she claimed the brand made larger and better tasting burgers than competitor McDonald's, was one of the first attack ads in the fast food industry.[31] Executives at McDonald's parent company were so enraged that they sued all parties involved, naming Gellar and reportedly banning her from eating at the food chain.[32][33][34] In a 2004 interview, she recalled: \"I wasn't allowed to eat there. It was tough because, when you're a little kid, McDonald's is where all your friends have their birthday parties, so I missed out on a lot of apple pies.\"[35][36] She was also signed up as a model for Wilhelmina.[16][37]\n\nGellar appeared in a safety skit during the September 28, 1982 episode of Late Night with David Letterman.[38] Throughout the 1980s, she guest starred in various television series, such as Spenser: For Hire and Crossbow, and played minor roles in the films Over the Brooklyn Bridge (1984), Crossroads (1986), and Funny Farm (1988), though her scenes in the latter two were cut.[39] She obtained a larger role as the daughter of a prostitute in the B thriller High Stakes (1989).[40][41][42] At the age of nine, she acted in the off-Broadway production The Widow Claire,[16][43][44] as well as in the Kids Sing-A-long VHS tapes Camp Melody and U.S.S. Songboat by Kids Klassics.[45][46] In 1989, she shared hosting duties with Soleil Moon Frye and Rod Brogan in the syndicated weekly variety show Girl Talk, based on the board game of the same name.[47][48] It only produced five episodes.[49]\n\nGellar portrayed 13-year-old Mollie in the initial production of Neil Simon's play Jake's Women, which ran at the Old Globe Theatre in San Diego, California, from March to April 1990.[50] In 1991, she was cast as a young Jacqueline Bouvier in A Woman Named Jackie. The miniseries won the Emmy Award for Outstanding Limited Series. Gellar obtained her first leading role, as a mayor's manipulative daughter, in the 1992 syndicated teen serial Swans Crossing, which chronicled the lives of a group of wealthy teenagers. She felt that playing a \"villainous\" character gave her the call for \"better and more varied acting skills\", while the gig's weekly payment proved a financial aid for Gellar and her mother.[16] The series ran for a 65-episode season and earned her two Young Artist Award nominations for Best Young Actress.[51]\n\nGellar made her debut on the ABC soap opera All My Children in 1993, playing Kendall Hart, the long-lost teenage daughter of character Erica Kane (Susan Lucci). As she got the role, Gellar was complimented as having the acting talent and the \"forceful personality\" needed to go up against Lucci's experience; Kendall was supposed to be like a younger version of Erica.[52] Her stint on the show was successful as \"longtime fans of the soap saw her as the second coming of Erica\".[53] Writers showcased her more after her initial reception and she became a household name to the soap opera medium.[53] In 1995, at the age of eighteen, she won a Daytime Emmy Award for Outstanding Younger Actress in a Drama Series for the role.[54] The same year, Gellar left the show and moved to Los Angeles to pursue other acting opportunities.[55][56] In 1996, she filmed the ABC television film Beverly Hills Family Robinson, in which she played a spoiled adolescent.\n\nWorldwide recognition (1997–2003) [ edit ]\n\nAfter reading the script for Joss Whedon's television series Buffy the Vampire Slayer, which follows Buffy Summers, a teenager burdened with the responsibility of fighting occult foes and supernatural occurrences, Gellar screen tested for the role of Cordelia Chase.[57] Whedon then asked her to come back in and audition for the title role.[58][16][59] The show premiered in March 1997, to widespread critical and popular acclaim.[60] Gellar's Buffy, created to subvert the stereotypical female horror movie victim,[61] was described by Entertainment Weekly as one of the 100 greatest female characters in American television.[2][62] Buffy ran for seven seasons and 144 episodes,[63] and during its broadcast, earned Gellar four Teen Choice Awards, the Saturn Award for Best Genre Television Actress, and a Golden Globe Award nomination for Best Actress – Television Series Drama.[64] She sang during the series' musical episode \"Once More, with Feeling\", which spawned an original cast album, released in 2002.[65][66]\n\nDuring the early airing of Buffy the Vampire Slayer, Gellar made her first major film appearances in two successful slasher films. In I Know What You Did Last Summer (1997), she took on the role of ill-fated beauty queen Helen Shivers.[67] Washington Post found the cast to be \"solid\",[68] in what San Francisco Chronicle described as a \"competent but uninspired\" film.[67] Budgeted at US$17 million, the film made US$125 million globally.[69][70][71] For her part, Gellar earned a Blockbuster Entertainment Award for Favorite Supporting Actress – Horror and a MTV Movie Award nomination for Best Breakthrough Performance.[72][73] In Scream 2 (1997),[74] Gellar played a likewise ill-fated vain character, this time that of Sorority sister Cici Cooper. She filmed her scenes in between shots of Buffy and had only recently finished work on I Know What You Did Last Summer. Despite the hectic scheduling, she agreed to perform in Scream 2 without having read the script, on the basis of the success of the first film.[75] Scream 2 grossed over US$172 million worldwide.[76][77]\n\nIn January 1998, Gellar hosted Saturday Night Live for the first time.[78] She returned as a host in May 1999 and October 2002, and made two cameo appearances in May 2000, including one in which she introduced Britney Spears' performance of \"Don't Let Me Be the Last to Know\". In 1998, she also provided her voice for the Gwendy Doll in Small Soldiers,[79] and for the character of Marie in the King of the Hill episode \"And They Call It Bobby Love\".[25] Gellar's cameo as a girl sitting in the high school cafeteria in the sleeper hit She's All That (1999)[80] was soon followed by her first top-billing film role, as a struggling restaurant owner, in the romantic comedy Simply Irresistible (1999).[81][82] The film received negative reviews and flopped at the box office,[83] but Roger Ebert found her to be \"lovely\" in what he described as an \"old-fashioned\" comedy.[84]\n\nIn Roger Kumble's Cruel Intentions (1999), a modern-day retelling of Les Liaisons dangereuses, Gellar portrayed Kathryn Merteuil, a cocaine addict with an appetite for manipulating people.[85] In his review for the film, Ebert felt that she is \"effective as a bright girl who knows exactly how to use her act as a tramp\",[86] and in an interview with Chicago Tribune, Kumble described her as \"the most professional actor I ever worked with\".[16] The film was a hit at the box office, grossing US$75 million worldwide, and went on to become a cult classic.[87][88][89] Gellar and co-star Selma Blair obtained the Best Kiss award at the 2000 MTV Movie Awards.[90][91][92] In Angel, a spin-off series of Buffy the Vampire Slayer, Gellar reprised her titular role for a three-episode arc, starting in 1999.[93]\n\nIn 2000, Gellar appeared as a film studio executive in the HBO series Sex and the City episode \"Escape from New York\". Her next film, James Toback's independent drama Harvard Man (2001),[94][95][96] in which she starred as the \"sharp and shrewd\" daughter of a mobster,[97] helped her shed her good girl image, along with Cruel Intentions, according to Peter Travers of Rolling Stone.[98] In 2002, Gellar portrayed Daphne Blake in the live action–comedy Scooby-Doo. For the production, she trained with a Hong Kong wire team, and commuted between Queensland and California every two weeks due to her simultaneous commitment to Buffy.[99] Despite negative reviews, A. O. Scott of The New York Times felt that her performance added \"a snarl of Powerpuff feminism to her character's ditzy stereotype\",[100] and with a global gross of US$275 million,[101] Scooby-Doo emerged as Gellar's most widely seen film to date.[102] Her role earned her the Teen Choice Award for Choice Movie Actress – Comedy.[103] With Jack Black, she hosted the 2002 MTV Movie Awards, which attracted 7.1 million viewers on its June 6 broadcast, achieving the show's highest rating ever at the time.[104][105]\n\nDuring her growing film career, Gellar continued to work on Buffy the Vampire Slayer, but she decided to leave the series after the seventh season. When asked why, she explained, \"This isn't about leaving for a career in movies, or in theater –it's more of a personal decision. I need a rest.\"[106][107][108][109] In her feature in Esquire magazine, Gellar expressed her pride for her work on Buffy, \"I truly believe that it is one of the greatest shows of all time and it will go down in history as that. And I don't feel that that is a cocky statement. We changed the way that people looked at television.\"[110]\n\nFilm roles (2004–2010) [ edit ]\n\nGellar in 2004\n\nAfter the end of Buffy the Vampire Slayer, Gellar reprised the role of Daphne in Scooby-Doo 2: Monsters Unleashed (2004).[111][112] Like the first film, Scooby-Doo 2 was a commercial success despite a negative critical response.[113] In Takashi Shimizu's The Grudge (2004), she portrayed Karen Davis, an exchange student in Tokyo who becomes exposed to a supernatural curse.[114] The film received mixed reviews from critics,[115][116] but was a major box office hit,[117][118] grossing more than US$110 million in North America and US$187 million globally.[119] She received a MTV Movie Award nomination for Best Frightened Performance as well as a Teen Choice Award nomination for Choice Movie Actress – Thriller.[120] Gellar provided her voice for the character Gina Vendetti in The Simpsons episode \"The Wandering Juvie\", which aired in March 2004, and went on to voice several recurring characters of the animated television series Robot Chicken, starting in 2005.\n\nGellar starred in Richard Kelly's Southland Tales (2006) as a psychic adult film star who creates a reality television series based on prophetic visions. Drawn to the \"batshit ambitious\" ideas for the film,[121] she accepted the role before she even read the script.[122][123][124] Southland Tales polarised critics upon its debut at the 2006 Cannes Film Festival and found a limited audience in theaters.[125] However, J. Hoberman for Village Voice remarked that the director contrived a \"memorable\" comic performance from Gellar, while the film gathered a cult following in subsequent years.[126] In 2006, Gellar briefly reprised the role of Karen in the sequel The Grudge 2,[127][128][129] and starred in Asif Kapadia's psychological thriller The Return, as a businesswoman haunted by memories of her childhood and the mysterious death of a young woman.[130] The Return was a critical and commercial failure, grossing only US$11 million.[131][132] Jeannette Catsoulis of The New York Times called it a \"career stagnation\".[133]\n\nIn 2007, Gellar voiced Ella and April O'Neil in Happily N'Ever After and TMNT, respectively.[134][135][136] She starred in the romantic comedy Suburban Girl and the drama The Air I Breathe, both of which were screened at the 2007 Tribeca Film Festival and released in January 2008.[137][138] In Suburban Girl, she took on the role of a New York City editor and the love interest of a much older businessman (Alec Baldwin). In The Air I Breathe, Gellar portrayed an up-and-coming pop singer.[139][140] The New York Times described the latter as a \"gangster movie with delusions of grandeur\",[141] while DVD Talk noted that \"her character here has the deepest emotional arc, and she hits all the right notes.\"[142]\n\nThe psychological thriller Possession, in which Gellar starred as a lawyer whose life is thrown into chaos after a car accident sends her husband and brother-in-law into comas, had a range of release dates in the United States between 2008 and 2009, due to financial problems at Yari Film Group.[143][144][145] The film ultimately went to DVD in March 2010.[146] In Veronika Decides to Die, an adaptation of the 1998 novel by Paulo Coelho,[147][148] Gellar starred as a depressed woman who rediscovers the joy in life when she finds out that she only has days to live following a suicide attempt.[149] Initially released in some countries in 2009 and 2010, the film was distributed domestically in January 2015.[150][151][152] Frank Scheck of The Hollywood Reporter found the actress to be \"reasonably compelling\" in what he called a \"ponderous and silly misfire\".[153]\n\nHiatus and sporadic output (2011–2020) [ edit ]\n\nGellar took a two-year hiatus from acting following the birth of her daughter in 2009, and in 2011, she signed to star and work as executive producer for The CW's Ringer, in which she played the dual role of twin sisters, one of whom is on the run and manages to hide by assuming the wealthy life of the other. Gellar has stated that part of her decision to return to television was because it allowed her to both work and raise her family.[154][155][156] Despite a large fan base,[157][158] the series received mixed reviews,[159][160][161] and was canceled after the first season.[162] For her portrayal, she received several award nominations, including one for the Teen Choice Award for Choice Television Actress – Drama.[163][164]\n\nGellar with Robin Williams at an event for The Crazy Ones in 2013\n\nIn September 2011, Gellar returned as a guest star on All My Children before the show's ending but not as Kendall Hart;[165] she portrayed a patient at Pine Valley Hospital who tells Maria Santos that she is \"Erica Kane's daughter\", and states that she saw vampires before they became trendy—a reference to Buffy the Vampire Slayer. She voiced different characters in the American Dad! episodes \"Virtual In-Stanity\" and \"Adventures in Hayleysitting\", which aired in November 2011 and December 2012, respectively.[166][167][168] On September 30, 2012, she reprised her role of Gina Vendetti in the premiere episode of The Simpsons' season 24.[169][170]\n\nA fan of Robin Williams for years, once Gellar learned that he was making the CBS single-camera sitcom The Crazy Ones (2013–2014), she contacted her friend Sarah de Sa Rego, the wife of Williams' best friend, Bobcat Goldthwait, in order to lobby for a co-starring role.[171] She obtained the part of an advertising director who runs an agency with her father.[172][173] Digital Spy felt that Williams \"shares a warm, genuine chemistry with his on-screen offspring Gellar,\"[174] as part of a mixed critical response.[175][176][177] The series earned Gellar the People's Choice Award for Favorite Actress in a New Television Series.[178]\n\nFollowing the conclusion of The Crazy Ones and the death of Williams, Gellar took another sabbatical from screen acting, stating that she had \"been working [her] entire life\" and \"needed that break\" to focus on raising her children.[179] During that period, she made an appearance as Cinderella in a March 2015 episode of Whitney Avalon's YouTube channel series Princess Rap Battle,[180] voiced a recurring character known as the Seventh Sister in the second season of the animated science fiction series Star Wars Rebels (2015–2016),[181][182] and guest starred as herself in the series finale of The Big Bang Theory, which aired on May 16, 2019.[183] Gellar was also attached to several television projects that ultimately were not picked up for production.[184] These included a 2016 pilot for a series based on Cruel Intentions, in which she reprised her role of Kathryn Merteuil.[185][186]\n\nResurgence (2021–present) [ edit ]\n\nIn 2021, Gellar voiced Teela in Kevin Smith's Masters of the Universe: Revelation, an animated series for Netflix.[187][188] In 2022, she made her first live-action film appearances in 13 years with brief roles in Smith's Clerks III and Jennifer Kaytin Robinson's Do Revenge, released in theaters and on Netflix respectively, in the same week.[189][190] Gellar's part as a headmistress in Do Revenge was specifically written for her as a tribute to her Cruel Intentions character.[191] Despite a limited screen time, it was described as a \"sizeable\" and \"unforgettable\" role by Alison Stine of Salon.com and Evan Romano of Men's Health, respectively.[192] Romano considered it a \"brilliant move to let audiences know [that] this movie belongs.\"[193]\n\nGellar starred as an arson investigator in the Paramount+ supernatural drama series Wolf Pack (2023), for which she also served as an executive producer.[194] Critics praised her performance but found the series to be \"bereft of a voice\".[195][196] In another Paramount+ production, the prequel series Dexter: Original Sin (2024–2025), she played a forensics expert and the title character's boss.[197] She made a cameo appearance as Helen Shivers, during a dream sequence, in Robinson's sequel I Know What You Did Last Summer (2025).[198]\n\nGellar is set to appear in the horror sequel Ready or Not 2: Here I Come,[199] provide her voice for Breaking Bear, an adult animated series on Tubi,[200] and star in and produce a television adaptation of Bad Summer People.[201] She is slated to reprise her role as Buffy and serve as an executive producer of an upcoming Buffy series.[202]\n\nOther ventures [ edit ]\n\nActivism and philanthropy [ edit ]\n\nGellar has been an active advocate for various charities, including breast cancer research, Project Angel Food, Habitat for Humanity and CARE. Of her charitable pursuits, she said: \"I started because my mother taught me a long time ago that even when you have nothing, there's ways to give back. And what you get in return for that is tenfold. But it was always hard because I couldn't do a lot. I couldn't do much more than just donate money when I was on [Buffy] because there wasn't time. And now that I have the time, it's amazing.\"[203]\n\nIn 1999, Gellar helped Habitat for Humanity's project of building homes in Dominican Republic.[204][203] With Project Angel Food, she delivered healthy meals to people infected with AIDS, and through the Make-A-Wish Foundation, she granted sick children's wishes of meeting her while working on Buffy.[203] In 2007, Gellar was featured in Vaseline's Skin Is Amazing campaign,[205] in which she agreed to auction nude-posed photos of herself on eBay to raise money for the Coalition of Skin Diseases, an organization which supports clinical research, fosters physician and patient education.[206][207]\n\nIn 2011, Gellar joined The Nestlé Share the Joy of Reading Program, which promotes reading to young children.[208][209] The following year, she was presented with the Tom Mankiewicz Leadership Award during the Beastly Ball at the Los Angeles Zoo.[210][211] In 2013, she hosted the Kidstock Music and Art Festival, an event that benefited the One Voice Scholars Program.[212] In 2014 and 2015, Gellar hosted two fundraisers for Mattel Children's Hospital UCLA.[213][214] In 2021, she promoted Subaru of America's donation of 100 million meals to Feeding America.[215] In 2025, she collaborated with Alyson Hannigan in GSK's Ask2BSure campaign, to raise awareness about meningitis and encourage vaccination among teens.[216]\n\nBusiness and media [ edit ]\n\nGellar has graced the covers of numerous magazines throughout her career. She appeared on the August 2–8, 1997 cover of TV Guide and the February 1998 cover of Seventeen.[217] The list went on to include Nylon, Marie Claire, Vogue, Glamour, Esquire, Allure, Cosmopolitan, FHM, Rolling Stone, and Elle, among others.[218][219][220][221] Wearing a black lace bra, she was on the cover of the December 2007 issue of Maxim. She was featured on the cover of Gotham and their main story in the March 2008 issue.[222]\n\nIn 1999, Gellar signed on to be the face of Maybelline, becoming the company's first celebrity spokeswoman since Lynda Carter in the late 1970s.[223][224] She has appeared in advertisements for Got Milk?, Proactiv, Colgate, and Cascade.[225][226][227][228] Drawing on her background in horror films, she has starred in several genre-inspired promotional campaigns, such as Killer Skin, a commercial for Olay that aired during the Super Bowl LIII,[229][230] Philosophy's Rated R in 2024,[231] and Uber One's I Know What You Could've Saved Last Summer in 2025.[232] She also appeared in the music videos for Bree Sharp's \"David Duchovny\" (1999), Marcy Playground's \"Comin' Up From Behind\" (1999), Stone Temple Pilots' \"Sour Girl\" (2000), and Outkast's \"Land of a Million Drums\" (2002).[233][234][235]\n\nIn October 2015, Gellar, along with entrepreneurs Galit Laibow and Greg Fleishman, co-founded Foodstirs, a startup food crafting brand that sold easy-to-make organic baking mixes and kits for families through e-commerce and retail.[4] By 2018, the brand's products were sold at 7,500 retailers nationwide, including Starbucks, Whole Foods, Walmart, WW and Amazon.[236][237][238] By 2022, Foodstirs had ceased operations, and Gellar sold off her remaining stake in the company.[239]\n\nGellar released a cookbook titled Stirring up Fun with Food on April 18, 2017. The book was co-authored by Gia Russo, and features numerous food crafting ideas.[240]\n\nPublic image [ edit ]\n\nGellar's wax figure at Madame Tussauds\n\nKnown for often playing characters with \"strength, sensitivity and snark\" in the horror genre,[241] Gellar has been viewed as a \"scream queen\" throughout the majority of her career.[242] She has stated that horror offers actresses \"the best roles\" through which they \"can really shine\", and that it is in television where \"women are the stars, but in films we're still struggling to play the leads\".[242] Thus, she feels that she \"couldn't just be the girlfriend or the wife in a film\". She has said: \"So I'll be wherever the good female roles are. I like horror.\"[242] Writing for Bloody Disgusting, Alex DiVincenzo asserted that \"Buffy the Vampire Slayer alone should be enough to cement her horror icon status\", and highlighting some of her roles in the genre, observed: \"Regardless of whether they made it to the end credits, her characters were intelligent, resourceful, and empowering.\"[242] She has ranked 6th among \"The All Time Greatest Horror Scream Queens\" by CinemaBlend,[243] 4th among the \"9 Greatest Scream Queens in All of Horror\" by Syfy,[244] and 8th among the \"10 Best Scream Queens of the '90s\" by Screen Rant.[245]\n\nBy the late 1990s, Gellar had become a household name, as well as one of Hollywood's \"It Girls\".[25] In 1998, she appeared on Entertainment Weekly's Top 12 Entertainers of the Year and the \"Most Beautiful\" list by People magazine. In 1999, she was voted number one in FHM's \"100 Sexiest Women\" of the year.[246] She was featured in the magazine's German, Dutch, South African, Danish and Romanian editions of the list since 1998.[247] Topsocialite.com listed her as the 8th Sexiest woman of the 1990s.[248]\n\nIn 2002, Gellar was honored with a Woman of the Year Award by Glamour magazine,[249] and her wax figure by Madame Tussauds, was unveiled as part of the \"Trail of Vampires\" exhibition.[250] Between 2002 and 2008, she was featured on the annual Maxim \"Hot 100\" list.[251][252][253] The magazine named her the 2008 Woman of the Year.[254] She was also featured in Google's Top 10 Women Searches of 2002 and 2003, coming in at No. 8,[255] and was included in UK Channel 4's 100 Greatest Sex Symbols in 2007, ranking at No. 16.[256] Other appearances and listings include Glamour's 50 Best Dressed Women in the World in 2004 and 2005,[247] Entertainment Weekly's Top 100 TV Icons in 2007, and BuddyTV's 100 Sexiest Women of 2011.[257]\n\nPersonal life [ edit ]\n\nGellar with her husband Freddie Prinze Jr. in 2007\n\nGellar met her future husband, Freddie Prinze Jr., while they were filming the 1997 teen horror film I Know What You Did Last Summer,[258] but the two did not begin dating until 2000. She and Prinze have worked together several times, including when they played each other's respective love interests as Fred and Daphne in Scooby-Doo and Scooby-Doo 2: Monsters Unleashed.[259] They were engaged in April 2001 and married in Mexico on September 1, 2002,[260] in a ceremony officiated by Adam Shankman, a director and choreographer with whom Gellar had worked on Buffy the Vampire Slayer.[261] In 2007, in honor of their fifth year of marriage, Gellar legally changed her name to Sarah Michelle Prinze.[16] Together, she and Prinze have two children, a daughter born in 2009 and a son born in 2012.[262][263] The family lives in Los Angeles.[264]\n\nOn February 10, 2021, Gellar expressed support for her Buffy the Vampire Slayer co-star Charisma Carpenter after Carpenter made allegations of abuse against series creator Joss Whedon. She also stated, \"While I am proud to have my name associated with Buffy Summers, I don't want to be forever associated with the name Joss Whedon.\"[265] In an interview with The Hollywood Reporter published January 18, 2023, Gellar is quoted as saying, \"I'll never tell my full story because I don't get anything out of it.\"[241]\n\nFilmography [ edit ]\n\nKey † Denotes film or TV productions that have not yet been released\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nCommercials [ edit ]\n\nMusic videos [ edit ]\n\nOther [ edit ]\n\nAwards and nominations [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/SarahMGellar_cropped2013.jpg/250px-SarahMGellar_cropped2013.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/40px-Wikiquote-logo.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Sarah_Michelle_Gellar.jpg/250px-Sarah_Michelle_Gellar.jpg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Sarah_Michelle_Gellar%27s_Wax_Statue.jpg/250px-Sarah_Michelle_Gellar%27s_Wax_Statue.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Freddie_Prinze_Jr_and_Sarah_Michelle_Gellar_by_David_Shankbone_%28cropped%29.jpg/250px-Freddie_Prinze_Jr_and_Sarah_Michelle_Gellar_by_David_Shankbone_%28cropped%29.jpg", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/40px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/commons/2/2c/Sarah_Michelle_Gellar_Comic-Con_5%2C_2011.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Sarah_Michelle_Gellar_Comic-Con_5%2C_2011.jpg/250px-Sarah_Michelle_Gellar_Comic-Con_5%2C_2011.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/2/2c/Sarah_Michelle_Gellar_Comic-Con_5%2C_2011.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Sarah_Michelle_Gellar", "title": "Sarah Michelle Gellar", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.3", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/2/2c/Sarah_Michelle_Gellar_Comic-Con_5%2C_2011.jpg", "width": 1025, "height": 1200}, "title": "Sarah Michelle Gellar - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}