{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/mandy-moore-net-worth/", "text": "What is Mandy Moore's net worth and salary?\n\nMandy Moore is an American singer, songwriter, and actress who has a net worth of $14 million. Mandy Moore rose to fame in the late 1990s as a teenage pop star with hit singles like \"Candy\" and \"I Wanna Be with You.\" Her albums sold a combined 10 million copies. She transitioned to acting in the early 2000s, appearing in romantic comedies such as \"A Walk to Remember\" and \"Chasing Liberty.\"\n\nMoore continued to balance music and acting, releasing several albums and taking on diverse film roles. She provided the voice of Rapunzel in Disney's animated feature \"Tangled\" and its subsequent TV series. Her career experienced a significant resurgence with her starring role as Rebecca Pearson in the critically acclaimed NBC drama series \"This Is Us\" (2016-2022). The show earned her widespread recognition, including Golden Globe and Emmy nominations. Throughout her career, Moore has also appeared in independent films, made guest appearances on various TV shows, and engaged in philanthropic work. She has been an ambassador for health and education initiatives.\n\nIn recent years, Moore has returned to her musical roots, releasing the album \"Silver Landings\" in 2020 and \"In Real Life\" in 2022, showcasing a more mature, folk-influenced sound.\n\nEarly Life\n\nAmanda Leigh Moore was born in Nashua, New Hampshire, on April 10, 1984. Her mom, Stacy, is a former reporter who worked for the Orlando Sentinel, among other publications. Her father, Donald, is a pilot for American Airlines. Mandy is the middle child of three. She has an older brother named Scott and a younger brother named Kyle. The Moore family moved to a suburb of Orlando in Seminole County, Florida, for her dad's job. Mandy was interested in singing and acting from a young age and begged her parents for voice and acting lessons. When she was 12, she attended the Stagedoor Manor performing arts camp, which counts Natalie Portman as one of its alumni. She attended Bishop Moore Catholic High School in Orlando for one year in 1998-1999. One day, while working in a studio, she was overheard by a FedEx delivery man who had a friend in A&R at Epic Records. That FedEx delivery man sent his friend a copy of Moore's unfinished demo, and Moore signed on with the label.\n\nCareer\n\nAfter signing with Epic, Mandy began working on her debut album. She dropped out of high school during her freshman year to focus on her album. She continued her high school education via tutors. In 1999, when Mandy was 15 years old, she toured with NSYNC and the Backstreet Boys, two of the biggest names in pop of that era. She released her debut single in August 1999. \"Candy\" was a commercial hit, but Mandy was compared to the hottest pop divas of that time– Christina Aguilera, Britney Spears, and Jessica Simpson, and came up short. Moore's debut studio album, So Real, was released on December 7, 1999. The album peaked at No. 31 on the Billboard charts.\n\nMoore's second studio album, I Wanna Be with You, was released on May 9, 2000. The album was a commercial success, debuting and peaking at No. 21 on the U.S. Billboard 200 chart. Moore won the Kids' Choice Award for Favorite Rising Star for the album in 2000. In 2001, Moore began working on her third studio album. The album's lead single, \"In My Pocket,\" reached No. 21 on the Billboard Pop Songs chart. Moore's self-titled third studio album, Mandy Moore, debuted and peaked at number 35 on the No. Billboard 200 chart.\n\nMoore made her feature film debut in 2001, where she voiced a Girl Bear Cub in the comedy Dr. Dolittle 2, which starred Eddie Murphy. Later that year, Moore co-starred with Anne Hathaway in the comedy The Princess Diaries. In 2002, Moore made her starring debut with Shane West in the romantic drama A Walk to Remember.\n\nIn 2003, Moore began working on her fourth studio album, later revealed to be an album of cover songs called Coverage. The album debuted at No. 14 on the Billboard 200 chart.\n\nIn 2004, Moore co-starred in the romantic comedy Chasing Liberty. Late in 2004, Moore co-starred in the religious satirical comedy-drama Saved!. In 2005, Moore guest-starred in the HBO comedy-drama Entourage. In 2007, Moore co-starred in the romantic comedy Because I Said So.\n\nMoore's fifth studio album, Wild Hope, was released on June 19, 2007. The album debuted on the U.S. Billboard 200 at No. 30. Moore's sixth studio album, Amanda Leigh, was released on May 26, 2009. It debuted at No. 25 on the Billboard 200. It was her final album for over ten years.\n\nIn 2010, Moore voiced Rapunzel in Tangled. Moore has been co-starring as Rebecca Pearson in the NBC hit show This Is Us since September 2016. She received a Golden Globe Award nomination for her role.\n\nMoore's seventh studio album and her first album in 11 years, Silver Landings, was released in March 2020. Moore was scheduled to promote the album with a North American tour beginning on March 20, 2020, before it was postponed due to the COVID-19 pandemic.\n\nPersonal Life\n\nMandy Moore dated former Scrubs star Zach Braff from 2004 to 2006.\n\nIn 2008, Moore began dating musician Ryan Adams. They got engaged in February 2009 and married on March 10, 2009, in Savannah, Georgia. In January 2015, Moore filed for divorce from Adams, citing \"irreconcilable differences.\" Moore and Adams later released a joint statement explaining their decision, calling it a \"respectful, amicable parting of ways.\" The divorce was finalized in June 2016. In 2019, in light of a number of allegations from women over Ryan Adams' abusive behavior toward them, Moore called him emotionally abusive. She spoke about her years with Adams on an episode of the WTF with Marc Maron podcast. She said: \"I felt like I was drowning. It was so untenable and unsustainable, and it was so lonely. I was so sad. I was lonely with him.\" She followed up in an interview with the New York Times, saying: \"His controlling behavior essentially did block my ability to make new connections in the industry during a very pivotal and potentially lucrative time — my entire mid-to-late 20s.\"\n\nIn 2015, Moore began dating Dawes frontman Taylor Goldsmith. They got engaged in September 2017 and married on November 18, 2018, in Los Angeles. The ceremony was an intimate backyard wedding at Mandy's house that started just after sundown. After the ceremony, guests then traveled to The Fig House, a private event space in the Highland Park neighborhood of Los Angeles. Attendees include Minka Kelly, Wilmer Valderrama, Milo Ventimiglia, and Moore's \"This is Us\" co-stars Chrissy Metz and Sterling K. Brown.\n\nMoore is also a committed philanthropist, working tirelessly for causes related to Africa and its people. Moore is the ambassador for the UN Foundation's Nothing But Nets malaria prevention campaign and is also the spokesperson for Dove's self-esteem movement and the \"Women who should be famous\" campaign.\n\nMoore is a Democrat who endorsed Hillary Clinton in the 2016 Presidential election and Pete Buttigieg in the 2020 Presidential election.\n\nIn 2019, Moore reached the base camp at Mount Everest with a guide and a group of hikers.\n\nThis Is Us Salary\n\nMandy Moore's salary per episode on \"This Is Us\" is $250,000. That works out to $4.5 million per year in an 18-episode season.\n\nReal Estate\n\nIn 2002, Moore purchased a home in Los Feliz for $1.725 million. The 4,747-square-foot home has access to large outdoor spaces, including a terraced backyard with multiple gardens and seating areas. She sold it shortly after her divorce from Ryan Adams for $2.95 million.\n\nIn early 2017, Moore and Goldsmith paid $2.56 million for a mid-century modern home in Pasadena that had been subjected to some unfortunate 1990s renovations that robbed it of its original and classic charm. The 3,351-square-foot house has three bedrooms and three bathrooms on 1.4 acres. The backyard has a pool and sweeping views of the San Gabriel Valley. Moore oversaw a complete renovation to restore the original mid-century modern details that had been lost in the 1990s renovation. Mandy and Taylor listed this home for sale in July 2024 for $6 million. They sold it in September 2024 for $5.8 million. Here is a video tour from before they purchased the property and performed the renovations:", "images": ["https://vz.cnwimg.com/thm/1JoH3482haSLevnlEMdqhrz36y0=/132x132/center/top/filters:format(webp)/2009/11/George-Clooney.jpg", "https://vz.cnwimg.com/thm/I4dSiTJhq0kprSuO--deoPCEAmQ=/132x132/center/top/filters:format(webp)/2020/06/taylor.png", "https://vz.cnwimg.com/thm/uRsxoLs7Ymmit5ATgRtN2utad40=/221x5:381x236/132x132/filters:format(webp):strip_exif()/2009/09/P-Diddy.jpg", "https://vz.cnwimg.com/thm/DG4AcNm-z7zHg_GCp_UriEOyJok=/132x132/center/top/filters:format(webp)/2009/09/GettyImages-451804119.jpg", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "https://vz.cnwimg.com/thm/1eUeq3vpWFXg7U-izW68z5mBqus=/600x300/center/top/filters:format(webp)/2020/05/Mandy-Moore.jpg", "https://vz.cnwimg.com/thm/0dOqT2nlNQM7u_J-5xWrCsf2nAw=/132x132/center/top/filters:format(webp)/2020/02/Angelina-Jolie.png", "https://vz.cnwimg.com/thm/_hOmdPz8Ht24ZxIeZM7m4mGRouk=/132x132/center/top/filters:format(webp)/2019/11/GettyImages-1094653148.jpg", "https://vz.cnwimg.com/thm/QnVi6Qp3-k0Jr6HXA-YmVSIkn68=/132x132/center/top/filters:format(webp)/2009/10/Zach-Braff.jpg", "https://vz.cnwimg.com/thm/wQP3GTpfvBjQAK8IYK7e_grLDWE=/132x132/center/top/filters:format(webp)/2016/01/ryan.jpg", "https://vz.cnwimg.com/thm/yboGsO77E1kQwELLmrwRZv_4RmE=/132x132/center/top/filters:format(webp)/2017/02/GettyImages-528215436.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/thm/lt1abKKVHSBtY-US0k9GLU9MTmM=/132x132/center/top/filters:format(webp)/2009/09/Brad-Pitt.jpg", "https://vz.cnwimg.com/thm/IoWqGPmFDjvC6iTqcDsspXBuxqo=/132x132/center/top/filters:format(webp)/2018/03/GettyImages-821622848.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/wp-content/uploads/2020/05/Mandy-Moore.jpg?x46379", "https://vz.cnwimg.com/thm/dXuAPIEBU--L_kRib4u0nSzjUtE=/132x132/center/top/filters:format(webp)/2020/04/Megan-Fox.jpg", "https://vz.cnwimg.com/thm/Zci9BdOLQWtmpfD-a5GXs3BO-R8=/132x132/center/top/filters:format(webp)/2010/11/Julianne-Moore.jpg", "https://vz.cnwimg.com/thm/UxnQSql1h0QyX1CgkPqKhTxCTHM=/132x132/center/top/filters:format(webp)/2009/09/Jennifer-Aniston.jpg", "https://vz.cnwimg.com/thm/KFAqJ9F4o80l6an2fe78-0jw28s=/132x132/center/top/filters:format(webp)/2019/04/rr.jpg", "https://vz.cnwimg.com/thm/AtJkdDpz8YPLULNKljfY06QhBU8=/132x132/center/top/filters:format(webp)/2021/05/Emmy-Rossum.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2020/05/Mandy-Moore.jpg?x46379", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/mandy-moore-net-worth/", "title": "Mandy Moore Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Mandy Moore net worth and salaru: Mandy Moore is an American singer, songwriter, and actress who has a net worth of $14 million. She signed", "slick": {"wpversion": "3.0.1", "wppostid": 2089, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2020/05/Mandy-Moore.jpg?x46379", "group": "post", "category": "actors:Actors"}, ";": "richest-celebrities:Richest Celebrities", "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "cnw": {"wppostid": 2089}, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Mandy Moore Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/mandy-moore-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2020/05/Mandy-Moore.jpg?x46379", "site_name": "Celebrity Net Worth", "description": "What is Mandy Moore's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2025-01-11T23:09:24+00:00", "published_time": "2020-05-02T04:12:23+00:00", "section": "Actors", "tag": "richest singers"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2020/05/Mandy-Moore.jpg?x46379", "title": "Mandy Moore Net Worth", "description": "Mandy Moore net worth and salaru: Mandy Moore is an American singer, songwriter, and actress who has a net worth of $14 million. She signed"}}, "movies": [], "publish_date": 1588392743.0, "source": "https://www.celebritynetworth.com", "summary": ""}