{"url": "https://www.desmoinesregister.com/story/news/crime-and-courts/2018/11/13/abc-bachelor-chris-soules-pleads-guilty-leaving-scene-fatal-crash-killed-kenny-mosher-arlington-iowa/1975979002/", "text": "Chris Soules, the reality television celebrity from Iowa, is set to avoid trial in connection with a deadly crash last year in northeast Iowa after pleading guilty to a reduced charge Tuesday.\n\nIn conjunction with the plea, defense lawyers asserted that the farm tractor Soules' struck while driving his pickup truck, fatally injuring 66-year-old Kenny Mosher of Aurora, was improperly lit. Lawyers also revealed new information about injuries Soules sustained.\n\nThe nighttime collision in April 2017 set off over 18 months of high-profile court proceedings, with tabloid media documenting Soules' appearances at a courthouse in Independence, a television reporter charged with a crime for recording video inside a courtroom, and arguments by Soules' lawyers that an Iowa law was unconstitutional.\n\nSoules, the star of the 19th season of ABC's \"The Bachelor,\" was originally charged with a felony for leaving the scene of a deadly accident.\n\n► UPDATE: Judge denies 'Bachelor' star Chris Soules' request to delay sentencing in fatal 2017 crash\n\n► PREVIOUSLY: Chris Soules' real life in rural Iowa\n\nHe pleaded guilty Tuesday of leaving the scene of a personal injury accident, which is an aggravated misdemeanor. Rather than a sentence of up to five years in prison, Soules now faces up to two years at his sentencing Jan. 8. He also has the ability to withdraw his guilty plea if a judge does not accept the plea agreement he struck with prosecutors.\n\nIn an affidavit filed Tuesday, Soules' attorney Brandon Brown said that neither Soules nor an independent witness to the crash saw any lights on Mosher's tractor before the collision. By law, the tractor would have been required to display flashing amber lights, the affidavit states.\n\nSoules, 36, was later diagnosed with a concussion resulting from the crash, Brown said. Even though his airbag deployed, it \"did not prevent Mr. Soules from hitting his head on the windshield so hard that it shattered.\"\n\nIn his signed plea, Soules acknowledged he failed to provide his vehicle's registration number to 911 dispatch or law enforcement, as required by Iowa law.\n\nAt his sentencing, Soules will be free to request a deferred judgment or suspended sentence, which would let him avoid prison time and possibly remove the charge from his record.\n\nJudge Andrea Dryer ordered a routine pre-sentence investigation report to be completed ahead of Soules' sentencing.\n\nSoules appeared on \"The Bachelor\" in 2015, where his roots as a farmer in rural Arlington, Iowa, played a prominent role and earned him the nickname, \"Prince Farming.\"\n\nMosher, who was on a tractor without an enclosed cab, was driving as slow as 6 miles per hour, Brown's affidavit states. Soules was driving his truck below the posted 55 mph speed limit, and Brown said experts concluded Soules acted reasonably given the circumstances.\n\n\"Mr. Soules found himself in an unavoidable accident,\" Brown's affidavit states.\n\nSoules called 911 and administered CPR until the compressions caused blood to come from Mosher's mouth. He remained on scene until paramedics arrived and directed them to Mosher, then left several minutes later. Mosher was taken to a local hospital and later died.\n\nAfter the crash, four other individuals arrived at the scene \"nearly immediately,\" according to court documents.\n\n\"No one, even the individuals who knelt in close proximity to Mr. Soules while he administered CPR, smelled any alcohol or had any belief Mr. Soules had been drinking,\" Brown's affidavit states.\n\nSoules' attorneys argued throughout the legal process that a trial would irreparably damage his reputation as a public figure. They also said the law Soules was accused of breaking was invalid because it compromised the constitutional rights of anybody charged under it. Earlier this year they unsuccessfully appealed for the Iowa Supreme Court to take up the case before it went to trial. Last month they said publicly that they were in the process of negotiating a plea.\n\nNeither Soules' attorneys nor Buchanan County Attorney Shawn Harden commented Tuesday. Mosher's family has declined to speak with reporters since the crash.", "images": ["https://www.desmoinesregister.com/gcdn/-mm-/8b5dca4c54b24584d95cf15efba87939124804da/c=0-204-5753-3454/local/-/media/2017/11/27/IAGroup/DesMoines/636473825051305049-112717-Chris-Soules-RWHITE-4920.jpg?width=3200&height=1808&fit=crop&format=pjpg&auto=webp", "https://www.desmoinesregister.com/gcdn/presto/2021/11/12/PDEM/e142af1d-a780-48d9-a795-159423b58510-Stephen_headshot_2021.jpg?crop=1999,1999,x1,y352&width=48&height=48&format=pjpg&auto=webp", "https://www.desmoinesregister.com/gciaf/prod/p?a=pageview&p=PDEM-TEALIUM-TANGENT&m=web&k=f14ebdd6-0569-4c64-af73-99937bc06379&s=noscript"], "top_img": "https://www.desmoinesregister.com/gcdn/-mm-/8b5dca4c54b24584d95cf15efba87939124804da/c=0-204-5753-3454/local/-/media/2017/11/27/IAGroup/DesMoines/636473825051305049-112717-Chris-Soules-RWHITE-4920.jpg?width=3200&height=1808&fit=crop&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.desmoinesregister.com/story/news/crime-and-courts/2018/11/13/abc-bachelor-chris-soules-pleads-guilty-leaving-scene-fatal-crash-killed-kenny-mosher-arlington-iowa/1975979002/", "title": "Iowa 'Bachelor' Chris Soules pleads guilty to leaving the scene of an accident", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "theme-color": "#0098FE", "og": {"title": "Iowa 'Bachelor' Chris Soules pleads guilty to leaving the scene of an accident", "description": "Soules was charged in connection to a fatal 2017 crash that killed 66-year-old Kenny Mosher of Aurora.", "url": "https://www.desmoinesregister.com/story/news/crime-and-courts/2018/11/13/abc-bachelor-chris-soules-pleads-guilty-leaving-scene-fatal-crash-killed-kenny-mosher-arlington-iowa/1975979002/", "site_name": "The Des Moines Register", "image": {"identifier": "https://www.desmoinesregister.com/gcdn/-mm-/8b5dca4c54b24584d95cf15efba87939124804da/c=0-204-5753-3454/local/-/media/2017/11/27/IAGroup/DesMoines/636473825051305049-112717-Chris-Soules-RWHITE-4920.jpg?width=3200&height=1808&fit=crop&format=pjpg&auto=webp", "width": 3200, "height": 1808}, "type": "article"}, "article": {"author": "Stephen Gruber-Miller", "content_tier": "free", "opinion": "false"}, "description": "Soules was charged in connection to a fatal 2017 crash that killed 66-year-old Kenny Mosher of Aurora.", "fb": {"pages": 8031989578, "app_id": 169766623060429}, "ROBOTS": "NOODP, NOYDIR, max-image-preview:large", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.desmoinesregister.com/gcdn/-mm-/8b5dca4c54b24584d95cf15efba87939124804da/c=0-204-5753-3454/local/-/media/2017/11/27/IAGroup/DesMoines/636473825051305049-112717-Chris-Soules-RWHITE-4920.jpg?width=1600&height=800&fit=crop&format=pjpg&auto=webp", "site": "@DMRegister", "creator": "@DMRegister", "title": "Iowa 'Bachelor' Chris Soules pleads guilty to leaving the scene of an accident", "description": "Soules was charged in connection to a fatal 2017 crash that killed 66-year-old Kenny Mosher of Aurora."}}, "movies": [], "publish_date": 1542085200.0, "source": "https://www.desmoinesregister.com", "summary": ""}