{"url": "www.mirror.co.uk/3am/celebrity-news/real-reason-mel-b-ended-10071235", "text": "EXCLUSIVE: The real reason Mel B ended her turbulent marriage to Stephen Belafonte revealed\n\nSources claim the final straw for the former Spice Girl was a string of blazing rows over her £40million fortune\n\nMel B is said to have ended her turbulent marriage to Stephen Belafonte after a “moment of clarity” as she healed a 10-year family rift and lost her dad to cancer .\n\n‌\n\n\n\nSources claim the final straw for the former Spice Girl was a string of blazing rows over her £40million fortune.\n\n‌\n\n\n\nInsiders who worked with Mel on her US TV shows said the split was no surprise as the couple spent most of their time “squabbling” and “bickering” amid accusations of affairs and flirting.\n\n‌\n\n\n\nAnd the Mirror can reveal they spent half their marriage in therapy as they desperately tried to make things work.\n\nA TV executive in Los Angeles said: “They started from the beginning when they realised they were very different people, who would argue and row.\n\nView 9 Images Melanie Brown poses with husband Stephen Belafonte and father Martin Brown, whi has tragically died of cancer (Image: Getty)\n\n‌\n\n\n\n\"Their personalities were like fire and ice, one minute it was pure adoration and the next it was all-out war.\n\n“It led to them having blow-out arguments non-stop. However, as they got further down the line, the stress of keeping things together proved too much.\n\n\"The therapy prompted more fights and bitterness. Their connection by the end was all but burned out.”\n\n‌\n\n\n\nMel, 41, fell out with her family when they told her of their concerns over ­ Belafonte ahead of their 2007 wedding.\n\nView 9 Images Mel B with her sister Danielle (Image: PA)\n\nThere were fears for her three years ago when she turned up for The X Factor panel one Sunday in the UK with bruises and scratches on her face and arms. Belafonte, 41, denied assaulting her.\n\n‌\n\n\n\nAs their relationship failed, Mel was reconciled with her family after dad Martin made a plea.\n\nEarlier this month, she posted a snap of her and sister Danielle, 36, holding his hand after he lost a five-year battle with myeloma cancer.\n\nSources said Mel’s loss was compounded by a series of rows with her film producer hubby over cash.\n\n‌\n\n\n\nView 9 Images Stephen Belafonte and Mel B in happier times (Image: Getty )\n\nAn insider said: “Ever since they got married, they have been plagued with ­problems. The writing has been on the wall for a while.\n\n“Money was at the centre of many rows but Martin’s passing provided a moment of complete clarity for Mel.\n\n‌\n\n\n\n“For the first time in a decade, she decided to put blood before water.\n\n“Stephen was always coming up with business ideas which caused huge ­arguments. It is no secret her family didn’t like him and now she has reconnected with them, Mel is sorting out her life.\n\nView 9 Images A source has said Mel B and Stephen had been arguing (Image: Getty)\n\n‌\n\n\n\n\"She’s had enough of the chaos with Stephen. Her, the kids and her family come first.”\n\nBelafonte referred to Mel’s family as “the cutoff crew” on Twitter after Martin reached out to her. Speaking in 2012, Martin said: “I just want to speak to her, so I know those children are happy.\n\n“If she wants this strange relationship, that’s her choice. She’s my daughter and I love her to bits.”\n\n‌\n\n\n\nMel started dating Belafonte in February 2007 and they wed four months later in Las Vegas and renewed their vows in Egypt in 2008.\n\nView 9 Images Mel B and Stephen Belafonte have ended their marriage (Image: Getty)\n\nBut Scary Spice, whose real name is Melanie Brown, filed divorce papers in Los Angeles ­Superior Court on Monday, citing irreconcilable differences.\n\n‌\n\n\n\nThe Leeds-born star listed the date of separation as December 28 and asked for joint legal and physical custody of daughter Madison, five.\n\nMel, who also has daughters Angel Iris, nine, with Hollywood actor Eddie Murphy and Phoenix Chi, 18, with her former backing dancer Jimmy Gulzar, is bidding to terminate the court’s ability to award spousal support – hinting at the alleged money rows.\n\n‌\n\n\n\nThe star was seen arriving at the Hollywood Hills home she had shared with Belafonte at 10.20am as she dropped Madison off.\n\nView 9 Images Melanie Brown, husband Stephen Belafonte and their family (Image: Getty )\n\nShe then drove to Beverly Hills, where Phoenix got out to pick up coffee. Mel looked anguished and could be seen texting.\n\n‌\n\n\n\nIn February last year, Mel had said in a gushing Instagram post: “We have been through everything that would normally tear couples apart and come out on the other side stronger.\n\n“You loved me before I even new [sic] how to really love myself, you are my world honey and let’s not forget you are abit [sic] of a d**khead too.”\n\nLast week, she posted: “You have to be at your strongest when you’re feeling at your weakest.” Pals have said Mel told them several times in the last couple of years “she was done”.\n\n‌\n\n\n\nView 9 Images Mel B and Danielle at the death of their father\n\nAnd they said the couple would act for cameras to “pretend their marriage was strong”.\n\nThe TV source said Belafonte, who in 2003 admitted a domestic charge linked to then-girlfriend Nicole Contreras, often shocked TV workers with crude outbursts on and off set.\n\n‌\n\n\n\nOne model, who would not be named, even claimed that in recent weeks Stephen has been “acting like a single man”.\n\nThe LA TV executive said: “Mel was incredibly open about their fights and arguments in front of staff on America’s Got Talent and other shows. She’d have screaming matches with him on the phone or even at the studio.\n\nView 9 Images Mel B's emotional Instagram post (Image: officialmelb/Instagram)\n\n‌\n\n\n\n“It was so bizarre, as they didn’t appear to show any love, care or even respect at times.\n\n“She has dropped F-bombs galore and called him all the names under the sun. He too had the mouth of a sailor, saying inappropriate things to her in front of researchers and assistants.\n\n\"He would make rude statements about her body and having sex with her. It is a surprise they stayed together so long.\n\n‌\n\n\n\n“He always acted like he was her manager and supervisor, which seemed an unusual mix, given he really had little experience. It was like he inserted himself into her business just to make himself look busy.”\n\nView 9 Images Mel B poses with fans during the New Year's Eve celebrations in Times Square (Image: AFP)\n\nProblems may have been brought to a head by the couple’s busy ­workloads, which gave them little time together recently.\n\n‌\n\n\n\nMel had a full schedule on America’s Got Talent last year, while eyeing a Spice Girls reunion and performing in Chicago on Broadway in New York.\n\nMeanwhile, Belafonte has been trying to carve out a new career as a restaurateur in Los Angeles.\n\n‌\n\n\n\nThe source said: “There was a bigger rift growing as they ended up living separate lives. He ended up spending days and nights at his Italian restaurant, Serafina, acting like this huge star.”\n\nLast month, Mel’s publicist played down reports Belafonte was caught holding hands with a brunette at STK restaurant in New York.\n\nThe couple have also been dogged by rumours that they invited other women into their bedroom.\n\nArticle continues below\n\nThe TV insider said: “Nothing would surprise me.”", "images": ["https://i2-prod.mirror.co.uk/article10070925.ece/ALTERNATES/s615b/Mel-B-Portrait-Session.jpg", "http://www.mirror.co.uk/footer/ipso.svg", "http://www.mirror.co.uk/footer/trust-project.svg", "https://i2-prod.mirror.co.uk/article10065741.ece/ALTERNATES/s810/PAY-MAIN-Mel-B-and-husnabd-Stephen-Belafonte-at-Dick-Clarks-New-Years-Rockin-Eve-17.jpg", "https://i2-prod.mirror.co.uk/article10065836.ece/ALTERNATES/s615b/Mel-B.jpg", "https://i2-prod.mirror.co.uk/article10070935.ece/ALTERNATES/s615b/Victorias-Secret-Fashion-Show-After-Party.jpg", "https://i2-prod.mirror.co.uk/article4814566.ece/ALTERNATES/s810/belafonte-main-copy.jpg", "https://i2-prod.mirror.co.uk/article4823524.ece/ALTERNATES/s810/MAIN-Mel-B-and-Stephen-Belafonte.jpg", "https://i2-prod.mirror.co.uk/article10070925.ece/ALTERNATES/s1200/Mel-B-Portrait-Session.jpg", "https://i2-prod.mirror.co.uk/article10070934.ece/ALTERNATES/s615b/CRIME-Gulzar-Mel-B.jpg", "https://i2-prod.mirror.co.uk/article5880178.ece/ALTERNATES/s810/Mel-b-date-night-main.jpg", "https://i2-prod.mirror.co.uk/article10070927.ece/ALTERNATES/s615b/Cosmopolitan-Ultimate-Women-Of-The-Year-Awards-Inside-Ceremony.jpg", "https://i2-prod.mirror.co.uk/article10070924.ece/ALTERNATES/s615b/PROD-Mel-B-and-Danielle-at-the-death-of-their-father.jpg", "http://www.mirror.co.uk/nav-web-static/release-v41-14493b7c888038a7d89b99cb3a7937c2b71eaebe/public/logo-reach.png", "https://i2-prod.mirror.co.uk/article9544891.ece/ALTERNATES/s615b/Melanie-Mel-B-Brown-poses-with-fans-.jpg", "https://i2-prod.mirror.co.uk/article10070932.ece/ALTERNATES/s615b/Maxim-Hot-100-Party-Red-Carpet.jpg", "https://i2-prod.mirror.co.uk/article10070926.ece/ALTERNATES/s615b/Premiere-Of-TWC-Dimensions-Paddington-Arrivals.jpg", "http://www.mirror.co.uk/assets/mirror/logos/masthead-mirror-default.svg"], "top_img": "https://i2-prod.mirror.co.uk/article10070925.ece/ALTERNATES/s1200/Mel-B-Portrait-Session.jpg", "keywords": [], "authors": ["Christopher Bucktin", "Updated"], "canonical_link": "https://www.mirror.co.uk/3am/celebrity-news/real-reason-mel-b-ended-10071235", "title": "The real reason Mel B ended her turbulent marriage to Stephen Belafonte revealed", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"page_id": 6149699161, "app_id": 123792601022133, "pages": 1814357575554395}, "description": "Sources claim the final straw for the former Spice Girl was a string of blazing rows over her £40million fortune", "author": "Christopher Bucktin", "robots": "noarchive, max-image-preview:large", "Googlebot-News": "noarchive", "referrer": "unsafe-URL", "keywords": "Stephen Belafonte, Mel B, Spice Girls, Marriage", "news_keywords": "Stephen Belafonte, Mel B, Spice Girls, Marriage", "allowTaboolaDeepDive": "true", "vf": {"00000000-0000-4000-8000-67e599051dc3": "mirror-prod-10071235"}, "og": {"title": "The real reason Mel B ended her turbulent marriage to Stephen Belafonte revealed", "description": "Sources claim the final straw for the former Spice Girl was a string of blazing rows over her £40million fortune", "url": "http://www.mirror.co.uk/3am/celebrity-news/real-reason-mel-b-ended-10071235", "site_name": "Daily Mirror", "locale": "en_GB", "image": "https://i2-prod.mirror.co.uk/article10070925.ece/ALTERNATES/s1200/Mel-B-Portrait-Session.jpg", "type": "article"}, "article": {"published_time": "2017-03-21T21:40:35Z", "modified_time": "2017-03-22T09:44:20Z", "author": "https://www.mirror.co.uk/authors/christopher-bucktin/", "section": "Celebrity News", "tag": "Marriage"}, "twitter": {"card": "summary_large_image", "site": "@DailyMirror", "creator": "@DailyMirror", "title": "The real reason Mel B ended her turbulent marriage to Stephen Belafonte revealed - The Mirror", "description": "Sources claim the final straw for the former Spice Girl was a string of blazing rows over her £40million fortune", "image": "https://i2-prod.mirror.co.uk/article10070925.ece/ALTERNATES/s1200/Mel-B-Portrait-Session.jpg"}}, "movies": [], "publish_date": 1490132435.0, "source": "http://www.mirror.co.uk", "summary": ""}