{"url": "www.mirror.co.uk/news/world-news/meghan-markles-uni-pals-reveal-11101548", "text": "EXCLUSIVE: Meghan Markle's uni pals reveal her secret wild child past that could rival party-loving Prince Harry's\n\nStudents at Northwestern University open up on her antics as part of a hard-partying sorority\n\nView 7 Images Meghan Markle poses with a drink in her hand in 2003\n\nThe actress Prince Harry looks set to pop the question to could not be more suited, say pals - because her student days were perfect training to keep up with the playboy prince.\n\n‌\n\n\n\nWhile 36-year-old Meghan Markle may seem like the ideal princess-in-waiting, we can reveal she had a wild youth just like 32-year-old Harry.\n\n‌\n\n\n\nMeghan’s days at Northwestern University in Chicago in the early 2000s have rarely been spoken about.\n\n‌\n\n\n\nBut a visit to her old stomping ground by the Sunday Mirror has revealed she was a typical party-loving student who allegedly used fake ID to go clubbing.\n\nPrince Harry engagement rumours mount as he plans to take Meghan Markle on romantic waterfall trip READ MORE :\n\nView 7 Images Meghan was part of a sorority that was infamous for partying\n\nOne of her favourite haunts is said to have been a bar that has since been shut down following a battle with authorities over underage drinking.\n\n‌\n\n\n\nWe also uncovered an article from the college news magazine in which Meghan herself joked she put on a stone after bingeing on Burger King in her Freshman year.\n\nInterviewed by the magazine in 2014, after returning to the Northwestern campus for a Q&A session alongside fellow cast members of TV show Suits, she said: “It’s surreal because I haven’t been back since I graduated.\n\n“And as I’m walking around I remember things like the schlep of getting to South Campus from up north.\n\n‌\n\n\n\n“The 24-hour Burger King also ­definitely helped me put on the Freshman Fifteen.”\n\nView 7 Images Meghan as a student (Image: Coleman-Rayner)\n\nMeghan attended the university’s School of Communication at the same time as fun-loving Prince Harry was getting into trouble for heavy drinking.\n\n‌\n\n\n\nIn his late teens, the young prince was making headlines for his wild nights out in Gloucestershire pubs around Highgrove – Prince Charles’s country home.\n\nOne pub in particular, the Rattlebone Inn, which has since changed hands, was infamous for its boozy lock-ins.\n\nPrince Harry even set up a nightclub for his posh friends in the basement of Highgrove, calling it Club H.\n\n‌\n\n\n\nAnd while the prince partied with his exclusive group of pals, Meghan was at college mixing with members of her own posh pack.\n\nHers was an all-female society, called the Kappa Kappa Gamma sorority, with a reputation for hard partying and social climbing.\n\nCurrent KKG member Melania Hidalgo told the Sunday Mirror that Meghan had been a popular member of the student body.\n\n‌\n\n\n\nView 7 Images The Keg, in Chicago, was a popular bar for students including Meghan (Image: Coleman-Rayner)\n\nShe said: “We’re intelligent hot messes. The thing we all have in common is that we’re all very driven, ambitious and passionate.\n\n“Meghan was the recruitment chair of the sorority during her time here.\n\n‌\n\n\n\n“She was in charge of bringing in new girls – you have to be a very friendly and outgoing person for that role.\n\n“I lived in the house for a year and it’s a very fun experience, you end up becoming friends with people you never thought you’d mix with.\n\nView 7 Images Meghan was part of Kappa Kappa Gamma while studying at Northwestern University (Image: Coleman-Rayner)\n\n‌\n\n\n\n“All of the late nights, and coming home from going out, watching movies… you develop very strong friendships.”\n\nMeghan is not the only famous actor to have graduated from Northwestern. David Schwimmer, Warren Beatty, Stephen Colbert, Julia Louis-Dreyfus and Zach Braff also learned their trade at the school.\n\nFormer pals told how Meghan had her eyes firmly set on Hollywood even back then – and would often sneak off for secret auditions for TV commercials.\n\n‌\n\n\n\nWhen Harry met Meghan: ,A timeline,\n\nBut she still found time to let her hair down in the Windy City. One former student claimed: “Meghan had a fake ID during her time at university and told us about it when she visited the campus in 2014. She said she used it to drink at The Keg, which was a popular student bar for years, and she also got a job at a club in the city.\n\n“You can get two fake IDs for about $100 in Chicago – it’s a little bit sketchy though and not everyone has one.\n\n‌\n\n\n\nView 7 Images Prince Harry was known for his drinking and boozy antics in his youth (Image: GC)\n\n“She seems like the perfect modern princess now, but she lived university life like most teenagers and was really popular on campus. Everyone talks about her going here.” The Keg of Evanston later lost its liquor licence – after 36 years as a students’ favourite – following a battle with city officials over underage drinking.\n\nIt is now a trendy bar and restaurant, Bangers and Lace, and new management say The Keg will not be missed.\n\n‌\n\n\n\n“It was a sh**hole, full of underage girls drinking and crazy boys starting fights,” general manager Chris Nora said. “It doesn’t surprise me Meghan had a fake ID.\n\nView 7 Images Meanwhile, Meghan is now an accomplished actress (Image: WireImage)\n\nDoor staff used to joke when girls finally handed over a real one, saying, ‘It’s about time!’”\n\n‌\n\n\n\nAlready an accepted part of the family, Meghan is in the UK this week to give Prince Harry much-needed support on the 20th anniversary of mum Diana’s death . She spent the anniversary behind closed doors at Kensington Palace, sharing the difficult time with Harry and his brother William, along with William’s wife Kate and Harry’s nephew and niece, George, four, and Charlotte, two.\n\nOur trip to Northwestern also shed some light on the mystery surrounding Meghan’s birth name, Rachel. For while the world knows her as Meghan, that is actually her middle name.\n\n‌\n\n\n\nRachel is the name given by her parents Thomas and Doria.\n\nAnd photos discovered in the KKG house on campus show one picture of the actress captioned “Rachel Markle” – and another captioned “Meghan Markle”.\n\nThe find suggests it was during her college years that she switched her names.\n\nArticle continues below\n\nAnd as speculation grows that the world’s most eligible bachelor could be about to pop the question, Meghan Markle is the name that will soon be known in every corner of the globe.", "images": ["http://www.mirror.co.uk/assets/mirror/logos/masthead-mirror-default.svg", "http://www.mirror.co.uk/footer/trust-project.svg", "https://i2-prod.mirror.co.uk/article11095699.ece/ALTERNATES/s1200/SUNDAY-MIRROR-PRODUCTION-Meghan-Markle.jpg", "https://i2-prod.mirror.co.uk/article11095670.ece/ALTERNATES/s615b/SUNDAY-MIRROR-PRODUCTION-Meghan-Markle1.jpg", "https://i2-prod.mirror.co.uk/article11095700.ece/ALTERNATES/s615b/SUNDAY-MIRROR-PRODUCTION-Meghan-Markle.jpg", "http://www.mirror.co.uk/nav-web-static/release-v41-14493b7c888038a7d89b99cb3a7937c2b71eaebe/public/logo-reach.png", "https://i2-prod.mirror.co.uk/article11095790.ece/ALTERNATES/s615b/PAY-Prince-Harry.jpg", "https://bcsecure01-a.akamaihd.net/24/4221396001/201708/1390/4221396001_5531705164001_5531675159001-vs.jpg?pubId=4221396001&videoId=5531675159001", "http://www.mirror.co.uk/footer/ipso.svg", "https://i2-prod.mirror.co.uk/article11095690.ece/ALTERNATES/s615/SUNDAY-MIRROR-PRODUCTION-Meghan-Markle.jpg", "https://i2-prod.mirror.co.uk/article11095666.ece/ALTERNATES/s615b/PAY-SUNDAY-MIRROR-PRODUCTION-Meghan-Markle.jpg", "https://i2-prod.mirror.co.uk/article11095663.ece/ALTERNATES/s615b/PAY-SUNDAY-MIRROR-PRODUCTION-Meghan-Markle.jpg", "https://i2-prod.mirror.co.uk/article11095667.ece/ALTERNATES/s615b/PAY-SUNDAY-MIRROR-PRODUCTION-Meghan-Markle.jpg"], "top_img": "https://i2-prod.mirror.co.uk/article11095699.ece/ALTERNATES/s1200/SUNDAY-MIRROR-PRODUCTION-Meghan-Markle.jpg", "keywords": [], "authors": ["Nicola Small", "Katy Forrester", "Updated"], "canonical_link": "https://www.mirror.co.uk/news/world-news/meghan-markles-uni-pals-reveal-11101548", "title": "Meghan Markle's uni pals reveal her secret wild child past that could rival party-loving Prince Harry's", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"page_id": 6149699161, "app_id": 123792601022133, "pages": 1814357575554395}, "description": "Students at Northwestern University open up on her antics as part of a hard-partying sorority", "author": "Katy Forrester", "robots": "noarchive, max-image-preview:large", "Googlebot-News": "noarchive", "referrer": "unsafe-URL", "keywords": "Meghan Markle, Prince Harry, Kensington Palace, Northwestern University, Royal Family", "news_keywords": "Meghan Markle, Prince Harry, Kensington Palace, Northwestern University, Royal Family", "allowTaboolaDeepDive": "true", "vf": {"00000000-0000-4000-8000-67e599051dc3": "mirror-prod-11101548"}, "og": {"title": "Meghan Markle's secret wild partying past that could rival even Prince Harry's", "description": "Students at Northwestern University open up on her antics as part of a hard-partying sorority", "url": "http://www.mirror.co.uk/news/world-news/meghan-markles-uni-pals-reveal-11101548", "site_name": "Daily Mirror", "locale": "en_GB", "image": "https://i2-prod.mirror.co.uk/article11095699.ece/ALTERNATES/s1200/SUNDAY-MIRROR-PRODUCTION-Meghan-Markle.jpg", "type": "article"}, "article": {"published_time": "2017-09-02T20:35:44Z", "modified_time": "2017-09-02T22:02:03Z", "author": "https://www.mirror.co.uk/authors/katy-forrester/", "section": "World news", "tag": "Royal Family"}, "twitter": {"card": "summary_large_image", "site": "@DailyMirror", "creator": "@mirrorkaty", "title": "Meghan Markle's uni pals reveal her secret wild child past that could rival party-loving Prince Harry's - The Mirror", "description": "Students at Northwestern University open up on her antics as part of a hard-partying sorority", "image": "https://i2-prod.mirror.co.uk/article11095699.ece/ALTERNATES/s1200/SUNDAY-MIRROR-PRODUCTION-Meghan-Markle.jpg"}}, "movies": [], "publish_date": 1504384544.0, "source": "http://www.mirror.co.uk", "summary": ""}