{"url": "www.huffingtonpost.com/entry/liam-payne-and-singer-cheryl-cole-split-after-two-years-together_us_5b3a4260e4b09e4a8b25d7e1", "text": "LOADING ERROR LOADING\n\nLiam Payne, 24, and singer Cheryl Cole, 35, are going their separate directions ways.\n\nThe former One Direction singer and the “X Factor UK” judge announced their split on Sunday after nearly two years together. The two have a 1-year-old son together, Bear.\n\nLiam Payne and Cheryl Cole attend the Chopard Tropy Ceremony on May 12, 2016 in Cannes. Venturelli via Getty Images\n\nAdvertisement\n\n“We are sad to announce that we are going our separate ways. It’s been a tough decision for us to make,” the joint statement said, which appeared somewhat differently on the pair’s respective Twitter accounts. “We still have so much love for each other as a family. Bear is our world and we ask that you respect his privacy as we navigate our way through this together.”\n\nWe are sad to announce that we are going our separate ways. It's been a tough decision for us to make. We still have so much love for each other as a family. Bear is our world and we ask that you respect his privacy as we navigate our way through this together. — Cheryl (@CherylOfficial) July 1, 2018\n\nThe two first met on a 2008 episode of “X Factor,” when Payne was a 14-year-old contestant and Cole was a judge.\n\nAdvertisement\n\nAfter his audition, Cole said, “I like you, I think you’re really cute. I think you’ve got charisma ― you know ― when you give us that cheeky little wink.”\n\nThough Payne didn’t advance in the show at the time, he later locked eyes with Cole when he reappeared on the show in 2010 and was paired with his future One Direction stars.\n\nAdvertisement\n\n“X Factor UK” gave Payne the career of a lifetime, but the 24-year-old told the radio station “The Hits” that his favorite moment on the show involved Cheryl, saying “I think when I winked at my Mrs. on the show, before she was my Mrs. I think it’s just the best thing ever.”\n\nThe two began dating in 2015 shortly after Cole split from her second husband, Jean-Bernard Fernandez-Versini (she was previously married to soccer player Ashley Cole). They made things official — with an Instagram photo, of course — in early 2016.\n\nA post shared by Liam Payne (@liampayne) on Mar 2, 2016 at 8:34am PST\n\nAdvertisement\n\nThe two announced that Cole had given birth to their first child, a son named Bear, in March 2017. People first confirmed the pregnancy in November 2016.\n\n“On Wednesday 22nd March Liam and I became parents to an incredibly beautiful, healthy baby boy, weighing 7lb 9 and looking like a dream,” Cole wrote in an Instagram post. “Although he still doesn’t have a name he is already stealing hearts. We are all madly in love and overwhelmingly happy with our little arrival. Happy Mother’s Day to all the mothers around the world. A day that now has a different meaning to me forever.”\n\nA post shared by Cheryl (@cherylofficial) on Mar 25, 2017 at 1:25pm PDT\n\nAdvertisement\n\nShortly afterward, Payne opened up about dating his “dream girl” in an interview with the U.K. magazine Rollacoaster.\n\n“She is a wonderful, wonderful person and it’s amazing to have someone who can relate to so much of things — someone who’s taken greater steps than me,” Payne said. “She’s been my dream girl since I was younger. She’s so ace.”\n\nStories That Inspire You Your Support Fuels Our Mission Your Support Fuels Our Mission Become a Member Today As the year ends, our reporting does not slow down. Support the journalists who continue asking questions and telling stories with depth and care. Your membership today helps ensure we start the new year strong. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. Support HuffPost Already a member? Log in to hide these messages.\n\nIn the following months, the couple denied both engagement rumors and split rumors, though the latter apparently turned out to be true.\n\nAdvertisement", "images": ["https://img.huffingtonpost.com/asset/5b3a4f9a200000f202b95f2b.jpeg?cache=1agSWnBpds&ops=1200_630", "https://img.huffingtonpost.com/asset/5b3a4f9a200000f202b95f2b.jpeg?cache=1agSWnBpds&ops=scalefit_720_noupscale", "https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNkYAAAAAYAAjCB0C8AAAAASUVORK5CYII=", "https://img.huffingtonpost.com/asset/631d16ff2200001900ca9324.png?ops=100_100", "https://img.huffingtonpost.com/asset/691c87541700009d2b9c5f37.jpg?ops=50_50"], "top_img": "https://img.huffingtonpost.com/asset/5b3a4f9a200000f202b95f2b.jpeg?cache=1agSWnBpds&ops=1200_630", "keywords": [], "authors": ["Senior Reporter", "Whitney Snyder", "Editor-In-Chief Huffpost"], "canonical_link": "https://www.huffpost.com/entry/liam-payne-and-singer-cheryl-cole-split-after-two-years-together_n_5b3a4260e4b09e4a8b25d7e1", "title": "Liam Payne And Singer Cheryl Cole Split After Over Two Years Together", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "The two have a 1-year-old son together named Bear.", "keywords": "Liam Payne,celebrity breakups,Cheryl singer", "fb": {"app_id": 46744042133}, "og": {"title": "Liam Payne And Singer Cheryl Cole Split After Over Two Years Together", "type": "article", "image": {"identifier": "https://img.huffingtonpost.com/asset/5b3a4f9a200000f202b95f2b.jpeg?cache=1agSWnBpds&ops=1200_630", "url": "https://img.huffingtonpost.com/asset/5b3a4f9a200000f202b95f2b.jpeg?cache=1agSWnBpds&ops=1200_630", "type": "image/jpeg", "width": 1200, "height": 630}, "url": "https://www.huffpost.com/entry/liam-payne-and-singer-cheryl-cole-split-after-two-years-together_n_5b3a4260e4b09e4a8b25d7e1", "site_name": "HuffPost", "locale": "en_US", "description": "The two have a 1-year-old son together named Bear."}, "article": {"tag": "Liam Payne,celebrity breakups,Cheryl singer", "section": "Entertainment", "published_time": "2018-07-02T16:49:01Z", "modified_time": "2018-07-02T20:00:10Z"}, "twitter": {"card": "summary_large_image", "site": "@HuffPostEnt", "title": "Liam Payne And Singer Cheryl Cole Split After Over Two Years Together", "image": {"identifier": "https://img.huffingtonpost.com/asset/5b3a4f9a200000f202b95f2b.jpeg?cache=1agSWnBpds&ops=1200_630", "width": 1200, "height": 630}, "description": "The two have a 1-year-old son together named Bear."}, "al": {"ios": {"url": "huffpostnews:///?editionID=us&entryID=us_5b3a4260e4b09e4a8b25d7e1", "app_store_id": 306621789, "app_name": "HuffPost"}}, "bingbot": "noarchive", "robots": "max-snippet:-1,max-image-preview:large,max-video-preview:-1", "google-site-verification": "97Mj-wW7u8U1NOnkW1rfH-I1kgO0-a9YsgoesOk41R8"}, "movies": ["https://www.youtube.com/embed/HBj9ctwZsX0?rel=0&showinfo=0&enablejsapi=1"], "publish_date": 1530550141.0, "source": "http://www.huffingtonpost.com", "summary": ""}