{"url": "en.wikipedia.org/wiki/Christina_Aguilera", "text": "American singer and songwriter (born 1980)\n\nNot to be confused with Christina Aguilar\n\nChristina María Aguilera ( AG-il-AIR-ə, Spanish: [kɾisˈtina maˈɾi.a aɣiˈleɾa];[1] born December 18, 1980) is an American singer, songwriter, actress, and television personality. Recognized as an influential figure in music and having received widespread public interest, she is noted for her four-octave vocal range extending into the whistle register, artistic reinventions, and incorporating controversial themes into her music. Referred to as the \"Voice of a Generation\", she was also named a Disney Legend, in recognition of her contributions to the Walt Disney Company.\n\nAfter appearing on The All New Mickey Mouse Club (1993–1994), Aguilera recorded the theme song, \"Reflection\", for the animated film Mulan (1998) and signed a record deal with RCA Records. She rose to fame in 1999 with her self-titled debut album, which topped the US Billboard 200 and garnered three US Billboard Hot 100 number-one singles: \"Genie in a Bottle\", \"What a Girl Wants\" and \"Come on Over Baby (All I Want Is You)\". Seeking a departure from her teen idol image, Aguilera took on a more provocative image on Stripped (2002), one of the best-selling albums of the 21st century. After another old-school-inspired musical reinvention, she released her second number-one album in the US, Back to Basics (2006). Throughout these periods, she amassed various worldwide hits, including \"Lady Marmalade\", \"Dirrty\", \"Beautiful\" and \"Ain't No Other Man\".\n\nDuring the early 2010s, Aguilera featured on a string of worldwide top ten songs, including \"Moves like Jagger\", \"Feel This Moment\" and \"Say Something\"; the first of these topped the Hot 100, making her one of the few artists to peak over three decades. She also starred in the film Burlesque (2010) and contributed to its soundtrack, earning a Golden Globe Award nomination. Her concurrent ventures included a role in the television series Nashville (2015); roles in the films The Emoji Movie (2017) and Zoe (2018); becoming an ambassador for the World Food Programme (WFP); co-founding the company Playground; and serving as a coach on the reality competition show The Voice (2011–2016).\n\nAguilera is one of the best-selling music artists of all time, with over 100 million records sold worldwide. She has been named one of the most successful artists of the 2000s by Billboard and was listed among the greatest singers of all time by Rolling Stone. Aguilera has been regarded as one of the most influential Latin artists in the entertainment industry, having helped shape the \"Latin explosion\" in the early 2000s. Time named her one of the 100 most influential people in the world in 2013. Her accolades include five Grammy Awards, two Latin Grammy Awards, six ALMA Awards, two MTV Video Music Awards, a Billboard Music Award, a Guinness World Record, and a star on the Hollywood Walk of Fame.\n\nEarly life\n\nChristina María Aguilera was born on December 18, 1980, in Ocean Breeze, New York, at Staten Island University Hospital,[2] to Shelly Loraine (née Fidler) and Fausto Wagner Xavier Aguilera.[3] Her father is an Ecuadorian emigrant from Guayaquil while her mother has German, Irish, Welsh, and Dutch ancestry.[5] Fausto Aguilera was a United States Army sergeant, and Shelly Loraine was a violinist in the American Youth Symphony before becoming a Spanish translator.[6]\n\nDue to Fausto's military service, Aguilera's family moved frequently. She lived in Grasmere, New York before moving to[2] New Jersey and Texas.[8] In 1983, they moved to Japan and lived in Sagamihara for at least two years. During her youth in the Pittsburgh metropolitan area, Aguilera attended North Allegheny Intermediate High School before leaving there to be homeschooled to avoid bullying she experienced at school.[11]\n\nIn 1986, the family returned to the United States, and settled in Pennsylvania, where they welcomed her younger sister, Rachel, in 1986. Aguilera has spoken out about her father's physically and emotionally abusive behavior.[13] She noted that this is what made her turn to music, noting that, \"growing up in an unstable environment and whatnot, music was my only real escape\".[14] In 1987, Shelly filed to divorce Fausto and moved with Aguilera and Rachel to her mother's home in Rochester, a suburb of Pittsburgh.[15] She later married James Kearns and had a son with him named Michael. In 2012, following decades of estrangement, Aguilera expressed interest in reconciling with her biological father.[17]\n\nAguilera moving to her grandmother's home allowed her to explore her grandmother's records, which featured mostly soul and blues singers and increased her interest in music.[18] She also began to practice singing in public and competing in talent contests. Following numerous contests, she earned a reputation in her neighborhood as the \"little girl with a big voice\" and received widespread attention from local television and radio programs.[21]\n\nIn 1990, she performed the popular song \"A Sunday Kind of Love\" on the reality competition show Star Search, but was eliminated during the semi-final round.[22] Aguilera was eventually invited to sing \"The Star-Spangled Banner\" before Pittsburgh Penguins hockey, Pittsburgh Steelers football, and Pittsburgh Pirates baseball games, and at the 1992 Stanley Cup Finals.[24]\n\nCareer\n\n1993–1998: Career beginnings\n\nIn 1991, Aguilera auditioned for the television series The All New Mickey Mouse Club (MMC), which aired on the Disney Channel. She ran against 400 candidates, and while she made the shortlist, she was ultimately rejected for not meeting the minimum age requirement. One year later, in 1992, Aguilera received a call from one of the show's producers asking if she was still interested in becoming a \"Mouseketeer\". She once again competed for a spot (this time, against 15,000 candidates) and was selected to join the variety program the following year. Her fellow cast members included Ryan Gosling, Keri Russell, Britney Spears, Justin Timberlake, and JC Chasez.[27] During the show recordings—which included Aguilera performing musical numbers and comedy sketches—she moved with her family to Orlando, Florida.[28] In 1995, it was reported the series would not return for a new season.\n\nAiming to begin a music career, Aguilera moved to Japan in 1997. She was selected to record a duet with Japanese singer Keizo Nakanishi, with whom she performed in concert shows around the country. Their song, \"All I Wanna Do\", was released as a single but failed to reach commercial success.[31][32] In June 1997, Aguilera went on to Romania to represent the United States in a singers contest during the Golden Stag Festival, failing to win over the audience.\n\nSeeking a recording contract, Aguilera recorded numerous demo tapes directed to record labels, including Walt Disney Records, for which she sent a cover of \"Run to You\" by Whitney Houston. She eventually was chosen to record \"Reflection\", the theme song from the animated film Mulan (1998), which reached number 15 on the Billboard Adult Contemporary chart. Following the attention she received with \"Reflection\", Aguilera caught the ear of Ron Fair, the A&R executive from RCA Records, who consequently signed Aguilera to the label.[8] In late 1998, she began to record her debut studio album, for which producers reportedly invested over $1 million worth of writers, producers and vocal lessons.[8]\n\n1999–2001: Christina Aguilera, Mi Reflejo, and My Kind of Christmas\n\nIn May 1999, Aguilera released \"Genie in a Bottle\", the lead single off her long-awaited debut album, which topped the US Billboard Hot 100 for five consecutive weeks and became the second best-selling single of 1999.[36] The song became an international success, increasing Aguilera's popularity worldwide, topping the charts in over 20 countries.[37] The single also attracted the attention of conservatives including celebrities such as Debbie Gibson that spoke out against its lyrical content, and was eventually considered \"too provocative\" to be sung by a teen idol.[39] Due to the criticism, Radio Disney replaced the song with a censored version.[40] The song was nominated for a Grammy Award for Best Female Pop Vocal Performance.[41]\n\nAguilera's self-titled debut album, Christina Aguilera, was released on August 24, 1999, to critical praise, debuting at number one on the US Billboard 200.[42] It catapulted Aguilera into fame globally and sold over ten million copies in its first year.[43] It was later certified eight times platinum by the Recording Industry Association of America (RIAA),[44] and it has sold over 17 million copies worldwide.[45][46] Originally, Aguilera's desire was to create material inspired by R&B and soul, but the label opted for a more teen pop production due the genre's high financial return in the late 1990s.[47] At the 42nd Annual Grammy Awards, Aguilera won the Best New Artist category for which Time credited the award for \"[helping] certify her credentials as a real singer\".[48]\n\nI was completely blown away, shocked, overwhelmed and thrilled. I didn't expect it. I've dreamed of that since I was eight years old. I was rambling off the top of my head, my knees were shaking and I'm still floating on air because of it! —Aguilera on winning Best New Artist at the 42nd Annual Grammy Awards.\n\nAfter the album's release, \"What a Girl Wants\", topped the Hot 100 and is recognized as the first new number one entry on the chart for the 2000s decade. The song was also nominated for Best Female Pop Vocal Performance at the 43rd Annual Grammy Awards. This was followed with \"I Turn to You\" which reached number 3,[42] and \"Come on Over Baby (All I Want Is You)\" which became Aguilera's third number one song and achieved worldwide success.[51] She also released a cover of \"The Christmas Song\" in November 1999, which peaked at number 18 and became the second-highest charting position of the song after the original in 1944.[52]\n\nIn January 2000, Aguilera performed at the Super Bowl XXXIV halftime show alongside Enrique Iglesias, Phil Collins and Toni Braxton.[53] In May, she embarked on her debut concert tour, Christina Aguilera in Concert, which toured North America, Latin America, Europe, and Japan until February 2001.[54] Her success continued to rise with the release of her second studio album, Mi Reflejo, in September 2000 which topped both the Billboard Top Latin Albums and Latin Pop Albums for nineteen consecutive weeks.[56] The album featured Spanish-language versions of several songs from her debut album along with new songs, and had Latin pop themes.[57] Three singles were release for the album including the Spanish version of \"Come on Over Baby (All I Want Is You)\" titled \"Ven Conmigo (Solamente Tú)\", \"Pero Me Acuerdo de Ti\" and \"Falsas Esperanzas\".[58] The latter two were performed at the 43rd Annual Grammy Awards.[59] The album went on to be the best-selling Latin pop album of 2000 and was later certified six times Latin platinum by the RIAA.[28][60] Mi Reflejo was also certified Platinum in Argentina, Mexico, and Spain. At the 2nd Annual Latin Grammy Awards, the album won Best Female Pop Vocal Album.[62]\n\nIn October 2000, Aguilera also released her third studio album, My Kind of Christmas, her first Christmas album, which reached number one on the US Top Holiday Albums chart.[63][64] The album received generally polarized reviews at the time but has since gone on to retrospectively receive praise.[65] Aguilera starred in a holiday special, My Reflection, which aired on December 3, 2000, on ABC. Aguilera's commercial success saw her being named the 2000 Top Female Pop Act by Billboard.[67] The same year, she also filed a fiduciary duty against manager Steve Kurtz for \"improper, undue, and inappropriate influence over her professional activities\". She eventually hired Irving Azoff to manage her career, aiming for control of her career and image.[68]\n\nOn January 16, 2001, Aguilera featured on Ricky Martin's \"Nobody Wants to Be Lonely\", which topped charts internationally and peaked at number 13 on the Hot 100, becoming her fifth top-20 hit in the US.[69] She was also listed as one of the most successful artists on the Billboard 200, Hot 100, and Mainstream Top 40 charts—for which the latter she was ranked among the greatest of all time.[70][71] The song was ranked at number 65 on VH1's \"100 Greatest Love Songs\",[72] and was nominated for Best Pop Collaboration with Vocals at the 44th Annual Grammy Awards.[73] In April of that year, Aguilera featured alongside Lil' Kim, Mýa, and Pink on \"Lady Marmalade\" from the soundtrack for the film, Moulin Rouge! (2001).[74] The song received positive reviews and topped the Hot 100 for five consecutive weeks, becoming Aguilera's fourth number one.[75][76] The song also won the Grammy Award for Best Pop Collaboration with Vocals and the MTV Video Music Award for Video of the Year.[77]\n\nIn August 2001, Warlock Records released Just Be Free, a demo album recorded by Aguilera between 1994 and 1995 while she was looking for a recording deal following the end of The All New Mickey Mouse Club (MMC). She filed a suit against the label and the album's producers, aiming to stop the release of the album; however, both parties came to a confidential settlement to release the album, in which Aguilera lent out her name, likeness, and image for an unspecified amount of damages.[79]\n\n2002–2004: New image with Stripped\n\nWith a new management, Aguilera started moving away from her teen pop niche and began working on a new project.[80] She cultivated a new image by adopting the alter ego Xtina, dyeing her hair black, and sporting several tattoos and body piercings.[81] Aguilera's new persona was widely criticized by media outlets.[82][83][84] In September 2002, she released the controversial song, \"Dirrty\", which garnered mixed reviews and peaked as number 48 on Billboard Hot 100.[47] The song's accompanying music video generated controversy for depicting overtly sexual fetishes,[85] and attracted the attention of conservative organizations and moralists who sought to have the video banned on MTV.[86] The video also sparked protests in Thailand and was eventually banned on the country's local television.[87][88] \"Dirrty\" topped the charts in the UK and Ireland,[89] and has gone on to become a cult classic.[90]\n\nAguilera performing on The Stripped Tour in 2003\n\nAguilera's fourth studio album, Stripped, followed with a release on October 22, 2002.[91] She also executive produced and co-wrote the majority of the songs.[91][92] Upon release, the album received generally mixed reviews but found commercial success and debuted at number two on the Billboard 200, and eventually was certified five times platinum by the RIAA.[93][44] In the UK, Stripped sold over two million copies and became the second highest-selling album by an American female artists in the 2000s.[94][95] Since then, it was reported the album sold 12 million copies globally.[96]\n\nThe album's second single, \"Beautiful\", was released to widespread acclaim for its empowering lyrics about embracing inner beauty, also becoming a LGBT anthem.[97] The song reached number two on the Hot 100 and topped the chart in various international countries, including the UK, Canada, Ireland and New Zealand.[69] It also reached number one on the US Adult Contemporary chart and the US Dance Club Songs chart.[98][99] At the 46th Annual Grammy Awards, the single won Best Female Pop Vocal Performance.[100] This was followed with the singles — \"Fighter\", \"Can't Hold Us Down\" and \"The Voice Within\".[71]\n\nIn June 2003, Aguilera co-headlined The Justified & Stripped Tour alongside Justin Timberlake.[101] The joint tour visited North America solely, attracting an audience of 546,483 and grossed over $31.8 million.[102] It ranked sixteenth on Billboard's list of Top 25 Tours of 2003.[103] Later that year, she also embarked on The Stripped Tour in Europe, Asia, and Australia.[104] Her performances at the Wembley Arena were taped, broadcast on WB Network and eventually sold as a video album under the name Stripped Live in the U.K.[104] In early 2004, it was reported that she would return to North America to perform a second leg of her tour but was eventually canceled due to a vocal cord injury.[105]\n\nIn August 2003, at the 2003 MTV Video Music Awards, Aguilera opened the show singing \"Like a Virgin\" and \"Hollywood\" alongside Britney Spears.[106] Halfway through the performance, she was joined by Madonna whom they both kissed, consequently making the performance highly publicized.[107] Various media outlets retrospectively considered it one of the \"most iconic\" VMAs performances of all time.[108] In 2008, MTV listed the performance as the number-one opening moment in the history of MTV Video Music Awards,[109] while Blender magazine cited it as one of the twenty-five sexiest music moments on television history.[110] In November of that year, Aguilera hosted the 2003 MTV Europe Music Awards.[111] She received widespread media attention for dressing up as a nun and being undressed to reveal her underclothes while performing the slutdrop dance style.[112] She was later named Top Female Pop Act of 2003 by Billboard.[113]\n\nIn August 2004, Aguilera recorded a cover of \"Car Wash\" alongside rapper Missy Elliott for the soundtrack of the DreamWorks Animation film Shark Tale.[114] She also voiced a Rastafarian jellyfish in the film.[115] That September, Aguilera was featured on \"Tilt Ya Head Back\" with rapper Nelly.[116] The songs respectively reached number 63 and 58 on the Billboard Hot 100.[69]\n\n2005–2008: Back to Basics\n\nIn early 2005, Aguilera embraced a new image inspired by Old Hollywood figures, debuting burlesque-style curly blonde hair and makeup. Her new persona was eventually adopted to promote her subsequent music project.[117] In March 2006, Aguilera released a duet with Andrea Bocelli, \"Somos Novios (It's Impossible)\", and performed the song together at the Sanremo Music Festival.[118] She also featured on \"A Song for You\" by Herbie Hancock which received a Grammy Award nomination for Best Pop Collaboration with Vocals.[119]\n\nIn June 2006, Aguilera released \"Ain't No Other Man\" as her then-forthcoming fifth studio album's lead single, which received critical acclaim and was praised by music critics.[69] Critics compared her vocals on the songs to older singers such as Etta James and Aretha Franklin.[120] The song achieved commercial success, peaked at number six on Billboard Hot 100 and has sold 1.7 million digital copies in the US[121] The single eventually earned her the Grammy Award for Best Female Pop Vocal Performance.[122]\n\nAguilera's fifth studio album, Back to Basics, was released as a double album in August 2006.[123] The album was inspired by 1920s–1950s music and was described as a \"throwback with elements of old-school [music] combined with a modern-day twist\".[124] The album debuted at number one on the US Billboard 200, marking Aguilera's second number-one album on the chart.[125] It also debuted atop the charts in numerous countries, including Australia, Canada, Germany, Switzerland, and the UK.[126] The album received positive reviews and was nominated a Best Pop Vocal Album at the 49th Annual Grammy Awards.[127][128][129][130] The album was later certified double platinum by the RIAA,[44] and sold over 5 million units worldwide.[131] \"Hurt\" and \"Candyman\" were released as singles following the album's release and reached the top ten on various international charts, and peaked top-thirty on Hot 100.[133][69]\n\nIn November 2006, Aguilera performed \"Steppin' Out with My Baby\" at NBC's Tony Bennett: An American Classic special as a duet alongside Tony Bennett.[134] The duo performed the song on Saturday Night Live and at the 59th Primetime Emmy Awards.[134] Their live performance was nominated a Grammy Award at the 50th Annual Grammy Awards.[135] Their version was officially recorded in 2012 for Bennett's Viva Duets.[136] That same month, Aguilera also featured on rapper Diddy's song \"Tell Me\" which topped the UK R&B Singles chart and number eight in the UK.[137][138]\n\nAt the end of November 2006 until October 2008, Aguilera embarked on the Back to Basics Tour which visited North America, Europe, Asia, and Oceania.[139] The tour received positive reviews and was divided into acts inspired by juke joints and the circus.[140] Rolling Stone highlighted its \"numerous sets and costumes changes\" emphasizing Aguilera's \"evolution from bubblegum starlet to dirrty vixen to her current incarnation as retro-styled soul siren\".[141] With earnings around 48.1 million, the tour was the highest-grossing concert tour by a female in 2007.[142] Additionally, the performances at the Adelaide Entertainment Centre were taped, broadcast on VH1 and sold as a video album under the title Back to Basics: Live and Down Under.[143]\n\nIn February 2007, Aguilera performed \"It's a Man's Man's Man's World\" at the 49th Annual Grammy Awards, which received widespread praise and has been noted as one of the best Grammy performances of all time.[144][145] Her performance has been voted as the 3rd Most Memorable Grammy Performance of all time, as presented in the 2007 CBS television special My Night at the Grammys.[146][147][148][149] That same month she performed at the halftime show for the 2007 NBA All-Star Game.[150]\n\nIn April 2008, Aguilera appeared in Martin Scorsese's documentary, Shine a Light (which chronicled a two-day concert by the Rolling Stones at the Beacon Theatre), where she performed \"Live with Me\" with Mick Jagger.[151] In September, she released \"Keeps Gettin' Better\" set to feature on her first then-upcoming greatest hits album of the same name.[152] The song received mixed reviews and debuted at number seven on the Billboard Hot 100, making it her highest debut on the chart at the time,[153] and has since sold 1.156 million digital copies in the US.[121] She performed the song live at the 2008 MTV Video Music Awards alongside a medley.[154] Keeps Gettin' Better: A Decade of Hits was released in November 2008 to positive reviews, debuting at number nine on Billboard 200 and was later certified gold by the RIAA.[155][44] The compilation added two original songs (its title track and \"Dynamite\") and also featured remakes of \"Genie in a Bottle\" and \"Beautiful\".[156][157] By late 2008, Aguilera stated that she had begun working on a new album.[158]\n\n2009–2011: Bionic, Burlesque and The Voice\n\nIn 2009, at the end of the 2000s, Aguilera was named the twentieth best \"Artist of the Decade\" by Billboard, and was nominated for the MTV Europe Music Award for Best Act Ever.[69][159] At the end of 2009, Aguilera stated that her then-forthcoming sixth studio album originally titled Light & Darkness would be released in March 2010.[160] However, by February 2010, Aguilera stated that the album would be retitled and released in June.[161] In April 2010, Aguilera released the lead single, \"Not Myself Tonight\" which peaked at number 23 on the Billboard Hot 100.[162][69] She performed the song live on The Oprah Winfrey Show.[163] This was followed by the album's second single, \"Woohoo\" featuring rapper Nicki Minaj.[162]\n\nAguilera at the premiere of Burlesque at the Empire, Leicester Square in London, 2010\n\nAguilera released her sixth studio album, Bionic, on June 6, 2010, which debuted at number three on the Billboard 200, and topped the European and the UK charts.[164][165] The album was inspired by electronic music, and was described by her as a project \"about the future\" noting that it was inspired by her son who motivated her to \"want to play and have fun\".[166] The album received generally mixed reviews by critics,[162] with Kitty Empire of The Observer calling it \"very strong, but only in parts\".[167] It was later certified gold by the Recording Industry Association of America (RIAA), and sold approximately over one million copies globally.[44][168] \"You Lost Me\" and \"I Hate Boys\" were released as singles in the following month of June.[162] A tour was planned for the album, but was postponed and later cancelled due to prior commitments.[169]\n\nAguilera landed her first starring role as a waitress turned burlesque performer in the Steven Antin film Burlesque, released in theaters in November 2010.[170][171] She received her star on the Hollywood Walk of Fame the same week in which the film premiered.[172] While the film received generally mixed reviews from critics, Aguilera's portrayal of the main character garnered positive reviews,[173] and the film grossed US$90 million in the box office.[174][175][176][177][178] The film also received a nomination for Best Motion Picture – Musical or Comedy at the 68th Golden Globe Awards.[179]\n\nIn addition to starring in the film, Aguilera recorded eight tracks for the film's accompanying soundtrack, while Cher performed the remaining two.[180] The soundtrack reached number 18 on the Billboard 200 and was certified gold by the RIAA.[44][69] Her song \"Bound to You\" received nominations for the Golden Globe Award for Best Original Song at the 68th Golden Globe Awards while the album itself was nominated for the Best Compilation Soundtrack for Visual Media at the 54th Annual Grammy Awards.[181] Aguilera performed \"Express\" on the finale of the seventh series of The X Factor UK which received criticism for its raunchy content.[182]\n\nIn April 2011, Aguilera became a coach on reality competition show The Voice, which aired on NBC.[183][184] Aguilera later returned to its second, third, fifth, eighth, and tenth season.[185] For the show's first season, Aguilera's duet of her song \"Beautiful\" with her finalist, Beverly McClellan, debuted at number 74 on the US Billboard Hot 100 with first-week sales of 42,000 downloads on iTunes.[186][187] A year later, for the second season, Aguilera's duet of \"The Prayer\" with her contestant, Chris Mann, also reached 85 on the chart.[188]\n\nIn 2011, she featured on the song \"Moves like Jagger\" by Maroon 5.[189] They first performed the song during their time on The Voice and also performed it at the 2011 American Music Awards.[190][191] The song received positive reviews and topped the Hot 100 for four non-consecutive weeks, making Aguilera the fourth female artist to top the chart over three decades (1990s, 2000s, and 2010s).[192][193] The song was also nominated for Best Pop Duo/Group Performance at the 54th Annual Grammy Awards.[194] In July 2021, the song was certified diamond by the Recording Industry Association of America (RIAA).[195][44][196]\n\n2012–2015: Lotus and other projects\n\nDuring the third season of The Voice in September 2012, Aguilera debuted \"Your Body\" as the lead single from her then-upcoming seventh studio album.[197] The song received critical acclaim and reached number one on the US Dance Club Song chart and 34 on the Billboard Hot 100.[198] The album, titled Lotus, followed in November 2012, in which Aguilera described the record as a \"rebirth\" of herself after the personal struggles she overcame.[173] Reviewers found the album generic and conventional, as opposed to Aguilera's previous experimental ventures.[199][200] Lotus peaked at number 7 on the Billboard 200 and has sold 303,000 copies in the US as of 2019.[201] \"Just a Fool\" with Blake Shelton was released as the album's second single and received positive reviews.[202] The two performed the song live on The Voice and on The Ellen DeGeneres Show.[203]\n\nAguilera at the Breakthrough Prize Award ceremony in 2014\n\nOn February 22, 2013, Aguilera featured on rapper Pitbull's \"Feel This Moment\", which became the first of various international top-ten singles she would achieve that year, peaking at number eight on the Billboard Hot 100 becoming Aguilera's tenth top-ten song, and was later certified platinum by the RIAA.[44][69][204] The song garnered positive reviews and was performed at the 2012 American Music Awards, 2013 Kids' Choice Awards, The Voice and 2013 Billboard Music Awards.[205][206] In May 2013, Aguilera appeared on Alejandro Fernández's cover of Miguel Gallardo's 1976 \"Hoy Tengo Ganas de Ti\" which received critical acclaim and earned them a diamond certification in Mexico.[207]\n\nOn November 4, 2013, Aguilera featured on a duet version of \"Say Something\" with A Great Big World.[208] The song became an instant success receiving universal acclaim from critics who praised Aguilera's stripped back vocals.[209] The song became Aguilera's second top-tenth hit on the Billboard Hot 100 peaking at number 4 and also became the second time she achieved multiple top-ten songs in a calendar year since 2000.[210] They performed the song live on the fifth season of The Voice and 2013 American Music Awards.[211][212] The song earned them various awards including a six-time platinum certification from the RIAA[44] and won Best Pop Duo/Group Performance at the 57th Annual Grammy Awards.[213][214][215][216] In October of that year, Aguilera also lent her vocals to the soundtrack for The Hunger Games: Catching Fire with the song \"We Remain\".[217] She performed the song live with her contestant Jacquie Lee on The Voice.[218]\n\nOn January 1, 2014, Aguilera featured on the remix for \"Do What U Want\" by Lady Gaga to replace the original version with R. Kelly after his sexual abuse allegations.[219][220] The two performed the song on the fifth season of The Voice.[221] In May of that year, she performed a medley of hits at the New Orleans Jazz & Heritage Festival and performed at the 2014 KIIS FM Wango Tango concert.[222][223] In November, Aguilera performed at the Breakthrough Prize Award ceremony.[224]\n\nIn February 2015, Aguilera opened the 2015 NBA All-Star Game alongside The Rockettes and Nas with a New York-themed medley.[225][226] In April, Aguilera starred in the third season of the musical drama series Nashville, which aired on ABC.[227] She also contributed to the series' soundtrack with \"The Real Thing\" and \"Shotgun\" — with the latter reaching number twenty-eight on Hot Country Songs chart.[228][229] She also performed at the 50th Academy of Country Music Awards alongside the Rascal Flatts.[230]\n\n2016–2020: Liberation and The Xperience\n\nIn May 2016, Aguilera exited The Voice following its tenth season, which she won with her contestant Alisan Porter.[231] On the season finale, she performed \"I Have Nothing\" and \"Dangerous Woman\"; the latter with Ariana Grande.[232] A month later, Aguilera released the song \"Change\", in which she dedicated to the victims of the 2016 Orlando nightclub shooting.[233] The ballad received positive reviews and debuted at number five on Billboard's Bubbling Under Hot 100 chart.[234] In August 2016, Aguilera recorded a disco song titled \"Telepathy\" featuring Nile Rodgers for the soundtrack of a Netflix original series, The Get Down (2016).[235] Her vocals were praised by critics and the song reached number one on the Dance Club Songs chart.[236]\n\nIn January 2017, Aguilera performed \"Stormy Weather\" on the ABC television special Taking the Stage: African American Music and Stories That Changed America.[237] In July, she voiced a video-game dancer in The Emoji Movie (2017), with the film also featuring her song \"Feel This Moment\".[238][239][240] She also lent her vocals to the Served Like a Girl documentary film for a song titled \"America\".[241] In November, Aguilera performed a tribute to Whitney Houston at the 2017 American Music Awards.[242] The tribute received polarized views from fans and critics who praised her vocals but criticized why she was selected over a black artist.[243][244]\n\nIn March 2018, Aguilera announced the completion of her then-upcoming eighth studio album alongside a Paper Magazine cover which received media coverage.[245] Aguilera released her eighth studio album Liberation on June 15, 2018, to favorable reviews.[246][247][248] The album had been in the works since the summer of 2015 and incorporated R&B and hip-hop elements.[249][250][251] Liberation debuted at number six on the Billboard 200 chart, becoming Aguilera's seventh US top-ten album.[252] The album was promoted with multiple singles,[253][254][255][256] including the preceding lead single, \"Accelerate\" featuring Ty Dolla Sign and 2 Chainz, which became Aguilera's tenth number one song on the US Billboard Dance Songs Chart.[257][258] Two other singles from the album, \"Fall in Line\" (with Demi Lovato) and \"Like I Do\", were nominated at the 61st Annual Grammy Awards for Best Pop Duo/Group Performance and Best Rap/Sung Performance respectively.[259]\n\nTo further promote Liberation, Aguilera embarked on her first tour in 10 years, The Liberation Tour, which ran from September to November 2018 in the US.[260] The tour received positive reviews from critics who praised Aguilera's vocals and stage presence.[261] Billboard named the tour one of the best 2018 live shows, and it was ranked at 132 on Pollstar's 2018 Year-End Top 200 North American Tours chart with a total gross of $8.7 million with an attendance of 77,854.[262][263] She also starred in the romantic science fiction Zoe, which premiered at the Tribeca Film festival and was released in July of that year.[264][265] At the end of 2018, Aguilera performed a medley of her songs on Dick Clark's New Year's Rockin' Eve.[266]\n\nIn May 2019, Aguilera began headlining her first concert residency, Christina Aguilera: The Xperience,[267][268][269][270][271] a 25-date show at the Zappos Theater at Planet Hollywood Las Vegas which concluded in March 2020.[272] In between the residency, from July to December 2019, Aguilera also embarked on The X Tour, which served as the international counterpart to The Liberation Tour, running throughout Europe and Latin America.[273]\n\nIn October 2019, Aguilera released the song \"Haunted Heart\" from the soundtrack of the animated film, The Addams Family,[274][275][276] and her second collaboration with A Great Big World, \"Fall on Me\", followed a month later.[277] The former received critical acclaim from critics, was nominated for Best Original Song in an Animated Film at the Hollywood Music in Media Awards and topped the US Kid Digital Song Sales chart.[278]\n\nIn early 2020, Aguilera recorded two songs for Disney's live action remake of Mulan (2020): \"Loyal Brave True\" – released in March 2020 as a promotional single to positive reviews, eventually being shortlisted as one of the fifteen potential nominees for the Academy Award for Best Original Song[279][280][281] – and a re-recording of \"Reflection\", released in August.[282] That year, she appeared on the ABC television special, The Disney Family Singalong and its follow-up, where she performed \"Can You Feel the Love Tonight\" and \"Remember Me\" respectively.[283] In November of that year, Aguilera signed a new management deal with Roc Nation.[284][285]\n\n2021–present: Aguilera and Voltaire residency\n\nIn July 2021, Aguilera performed two sold-out shows at the Hollywood Bowl with Gustavo Dudamel and the Los Angeles Philharmonic.[286][287] She also recorded \"The Addams Family Theme\", which was featured on The Addams Family 2 soundtrack.[288] In October, she performed \"Reflection\", \"When You Wish Upon a Star\" and \"Loyal Brave True\" for ABC's Walt Disney World's 50th Anniversary special.[289][290][291] On December 7, 2021, Aguilera was honored with the People's Music Icon honorific award at the 47th People's Choice Awards.[292]\n\nAguilera released her ninth studio album, titled Aguilera, originally as a double album on May 31, 2022.[293][294] The album paid tribute to different genres of Latin music,[295] and consisted of three separately released parts: La Fuerza,[296] La Tormenta,[297] and La Luz.[298] The full album was released in its complete form on September 30, 2022.[299] The album was preceded with the singles \"Pa Mis Muchachas\", \"Somos Nada\", \"Santo\" and followed with \"Suéltame\" and \"No Es Que Te Extrañe\".[300] Aguilera received widespread critical acclaim from music critics upon release, and was placed on several year-end lists by publications such as Billboard and the Houston Chronicle.[301] The album was promoted through the EU / UK Summer Series promotional tour, which consisted of five festival shows throughout Europe and three arena concerts in the United Kingdom.[302][303][304] The promotional tour received critical praise.[305][306][307][308][309]\n\nAguilera performing at the 2022 Starlite Festival held in Marbella\n\nAguilera and its songs received seven nominations at the 23rd Annual Latin Grammy Awards with the album winning for Best Traditional Pop Vocal Album.[310][311] The album also received another two nominations for Best Latin Pop Album and Best Immersive Audio Album at the 65th Annual Grammy Awards.[312] \"No Es Que Te Extrañe\" was also nominated for Record of the Year at the 24th Annual Latin Grammy Awards.[313]\n\nOn June 11, 2022, Aguilera headlined the Los Angeles Pride festival with guests Mýa, Kim Petras and Paris Hilton.[314] The use of a strap-on dildo during the set was the subject of polarized reception.[315][316][317] In October 2022, Stripped was reissued for its 20-year anniversary, featuring \"I Will Be\" (the b-side to \"Dirrty\") and Benny Benassi's remix of \"Beautiful\".[318] A new music video for \"Beautiful\" was also released.[319][91] On November 10, 2022, Time Studios announced a partnership with Roc Nation to produce an upcoming documentary about Aguilera.[320][321]\n\nOn September 22, 2023, Aguilera released \"Learning to Fly\" as a part of the soundtrack for PAW Patrol: The Mighty Movie.[322] The same month she performed at the EuroPride concert in Malta.[323][324] At the end of the month, it was reported that Aguilera would executive produce a stage adaptation of Burlesque which eventually made its debut in 2024, and its West End debut in July 2025.[325][326] In December 2023, Aguilera began her second residency, Christina Aguilera at Voltaire, at The Venetian Las Vegas which ran until August 2024.[327][328][329] In May 2024, it was reported that Aguilera had parted ways with RCA Records and signed with 5020 Records, a division of Sony Music Latin.[330]\n\nIn September 2024, Aguilera announced a \"Spotify Anniversaries\" performance for the 25th anniversary of her debut album.[331] The performances were released on both YouTube as a recording, and Spotify as a live extended play on September 23,[332] while featuring appearances from Machine Gun Kelly and Sabrina Carpenter.[333] In December, the EP was named one of the best albums of the year by HuffPost.[334] In 2025, Aguilera headlined the September 2025 Portola Music Festival.[335][336] A month later, Deadline Hollywood reported that she is set to star in a concert film, Christina Aguilera: Christmas in Paris, directed by Sam Wrench, in support of the 25th anniversary of her Christmas album.[337] The film is set to be released theatrically on December 14 and 21.[338]\n\nArtistry\n\nInfluences\n\nAguilera has named Etta James as a \"role model\", and said \"At Last\" made a major impression on her. She later stated, \"I'll still be as raunchy as I wanna be, and I'll have [Etta]'s memory to back me up. She's what I want to be someday\".[341] As a young girl, The Sound of Music (1959) and its lead actress, Julie Andrews, became her early references to sing and perform, in addition to broadening her interest on Broadway.[342] American singers Whitney Houston and Mariah Carey were cited as Aguilera's \"most apparent influences\" having been compared to them throughout her career.[343] Aguilera's other major influences include Billie Holiday, and Ella Fitzgerald. She has also cited rock bands as an influence, specifically the Red Hot Chili Peppers, Nirvana, and Radiohead.[346]\n\nAguilera was also influenced by Latin music, recalling that during her childhood: \"I grew up hearing [Spanish] being spoken in my household [and] hearing a lot of Julio Iglesias on the record player\". Some of her other inspirations in Latin music include Chavela Vargas, Vicente Fernández, and younger artists such Rosalía.[348][349] As a performer, Aguilera credits Madonna and Janet Jackson as major inspirations for being \"positive female artists [who] aren't afraid to take chances, be daring, experimental and sexy\".[350] Cher also encouraged her to be a performer and \"a woman who has the guts to do [everything]\".[351]\n\nAguilera's childhood visits to records stores moulded her taste and led to an appreciation for blues and soul music, which she called \"music that really had heart\".[352] Her music has also paid homage to many artists from this genre, including Aretha Franklin, Marvin Gaye, Nina Simone, and Otis Redding. Her album Back to Basics (2006) features inspirations of musicians from the early 20th century. As she later commented: \"I was just so drawn to that [kind of music] ... [It] has so much pain, so much beauty of raw emotion and passion\".[13] Her other influences in the genre was added for Liberation (2018), including Michael Jackson in \"Maria\" and Janis Joplin in \"Sick of Sittin'\".[353][248]\n\nOutside of the music industry, Aguilera was inspired by actresses from the Old Hollywood.[354] She later stated, \"I'm fascinated with the golden age of film. I wanted to capture the authenticity of the glam era\", after which she cited examples such as Marlene Dietrich, Marilyn Monroe, Greta Garbo, Veronica Lake, and the pin-up models.[355] Her \"Tilt Ya Head Back\" music video also recreated Monroe's signature look, while the video for \"Your Body\" includes a reference to Lucille Ball.[356][357] The video for \"Ain't No Other Man\" presented Aguilera under the alter ego Baby Jane, which was inspired by Bette Davis's character in psychological horror film What Ever Happened to Baby Jane? (1962).[358] Her other inspirations mostly came from art works, including those by Andy Warhol, Roy Lichtenstein and Banksy.[359][360]\n\nVoice\n\nCritics have described Aguilera as a soprano,[14][363] possessing a four-octave vocal range.[364] She is also able to perform the whistle register.[365] Maura Johnston, a journalist with Slate, called Aguilera's voice \"an instrument that despite its ability to leap octaves has a low-end grounding similar to that possessed by opera singers\".[366] The Boston Globe columnist Joan Anderman highlighted her vocal versatility: \"[She] is a real singer ... blessed with the sort of breathtaking elasticity, golden tones, and sheer power that separate the divas from the dabblers\".[367] In addition to sustain high notes, Aguilera is recognized for making use of the melismatic technique.[361] Jon Pareles from The New York Times emphasized that \"she can aim a note as directly as a missile or turn its trajectory into an aerobatic spiral of leaping, quivering, and scalloping melismas\".[248] Ron Fair—A&R executive from RCA Records—was impressed by her \"perfect intonation\", and concluded: \"She's got the pipes to be the next Barbra Streisand or Céline Dion\".[343]\n\nAguilera's singing technique also yielded comparisons to other singers. Journalist David Browne suggested that, alongside Mariah Carey and Whitney Houston, she \"forms the team of the main proponents\" of the melismatic technique.[362] Richard Harrington from The Washington Post also noticed similarities with both artists: \"She has a genuinely powerful voice that's evoked comparisons [to them], though it for the most part avoids those singers' ornamental mannerisms\".[368] The New Yorker columnist Sasha Frere-Jones also credited the technique by making her become \"a serious singer without needing to reincarnate the Sarah Vaughan\".[369] Songwriter Steve Kipner praises Aguilera's vocal dexterity, including her ability to \"internalize[d] all the riffs from Chaka Khan\".[343] Los Angeles Times music critic Ann Powers wrote that she possesses a \"voice purely powerful as that of Etta James [...] and she's moving toward the expressiveness of Gladys Knight, if not Aretha Franklin\". Powers also associated her vocal ability with Donna Summer when she performs records influenced by rhythm and blues.[370] Minneapolis Star Tribune noted that \"She has the best voice of the bunch — big, rich, soulful.\"[371]\n\nHowever, Aguilera has also been criticized for the frequent use of melisma, as well as for her style of singing live during concerts.[372][128] HuffPost columnist John Eskow called her \"the main proponent of oversouling\". Eskow praised Aguilera's voice as a \"great instrument\", though complained she did not \"seem to know when to stop\" with the use of \"gratuitous and confected melisma\".[373] Lucy Davies, music critic from BBC Music, raved about her \"stunning voice\", but offered that \"she could be more varied, simply by cutting out some of the 'ye-e-eeeh, woah' in her songs\".[374] Writing for Entertainment Weekly, Chris Willman credits Aguilera's singing style as an influence of Mariah Carey, noting \"her slightly nasal tone that really only becomes obvious when she's overselling a song\".[375] Alexa Tietjen from VH1 acknowledged that Aguilera \"does tend to take it to the extreme at times [...] but her vocal prowess is what's gotten her so far. Love them or hate them, the riffs are a part of who she is as performer\".[376]\n\nMusical style\n\nAguilera's discography is generally categorized as pop, R&B, hip-hop, and soul.[378][379] According to critics, she has also experimented with other musical genres in her works. In a 2008 interview, she explained that she is \"always inspired by new things\" in music and enjoys \"experimenting with [her] voice\".[156] Alexis Petridis from The Guardian considered the \"boldness in [continually] reinventing\" her music as \"one of her most impressive facets\" as an artist.[380] Initially established as a bubblegum pop singer, she mixed teen pop and dance-pop on her first records, Christina Aguilera (1999) and Mi Reflejo (2000), with the latter also taking inspiration from numerous genres in Latin music.[368][381]\n\nMoving away from the teen niche, Aguilera's post-2000 material mainly incorporated R&B and hip-hop.[378][80] Listed as an executive producer on Stripped (2002), she mixed both genres with Latin pop, rock, neo-soul, gospel, among others, while Back to Basics (2006) was described as a \"throwback with elements of old-school genres combined with a modern-day twist [and] hard-hitting beats\".[123] She continued merging R&B with other musical styles on Burlesque (2010), as well on Liberation (2018), which also features hip-hop, soul and blues elements.[382][383]\n\nThe show tune \"Lady Marmalade\" is noted as Aguilera's first musical transformation, which RCA Records initially felt was \"too urban\".[116][384] Despite the renewal in her repertoire, Aguilera continued producing power ballads—which became a signature in her discography—in between her uptempo material.[385] Kelefa Sanneh, music critic from The New York Times, observed the continuous modification in her music, in addition to highlighting her \"decision to snub some of the big-name producers on whom pop stars often rely\".[386] Her sonically drastic ventures include the subversive \"galactic pop\" on Bionic (2010),[162] electropop club on Lotus (2012),[387] and Mexican ranchera numbers on Aguilera (2022).[388]\n\nCultural status\n\nAguilera performing on the Liberation Tour in 2019\n\nThroughout her career, Aguilera has been called a pop icon,[389] a gay icon,[390][391] a triple threat entertainer,[392] and a fashion icon.[393][394] She has been ranked among the greatest singers of all time and referred to as the \"Voice of a Generation\".[395][396] She has been labeled a \"diva\" for her stardom and persona,[397] garnering polarized views, and various comparisons to Mariah Carey.[397] She has attracted criticism for wearing revealing clothes,[398] and has been called a sex symbol.[369][6] Aguilera has also been noted for her close affiliation with The Walt Disney Company, being honoured as a Disney Legend in 2019.[399]\n\nShe has often received media attention for her reinventions.[400][401] In the early 2000s, Aguilera rose to fame as a teen idol with her bubblegum pop eponymous debut album.[402] Various images she took on included a provocative image following the release of her single \"Dirrty\", an old Hollywood image, and a futuristic look.[402] She was later ranked as one of the most successful artists of the 2000s decade by Billboard.[403] In the 2010s, Aguilera saw moderate success with her music while spending six seasons as a coach on The Voice.[185] Aguilera's personal struggles were often highlighted in the media.[404] She saw a musical comeback with Liberation (2018).[405]\n\nThroughout her career, Aguilera has faced media attention for her physical appearances with some journalists noting that she has often received body shaming critical comments.[406] She was named one of the artists who revived teen pop in the late 1990s.[48] Aguilera has also been a significant figure in helping reshape the \"Latin explosion\" in the late 1990s and contributed to the Latin pop boom in American music with her album Mi Reflejo (2000), which went on to become the best-selling Latin pop album of all time.[56][407] She has also been noted for honouring her Ecuadorian roots throughout her career.[408]\n\nShe has heavily incorporated controversial themes in her music.[409] Various themes include feminism, sexuality, defending the sex-positive movement, domestic violence, among others.[409] Gerrick D. Kennedy writing for the Los Angeles Times opined that Aguilera \"tackled subject matters her contemporaries were shying away from\" which made her stand out amongst her peers in the early 2000s.[379] The impact of her videography, particularly the music videos for \"Dirrty\" and \"Beautiful\", has also been analyzed by music critics.[410] Subsequently, Aguilera has influenced and inspired several acts and artists in industries worldwide.[411]\n\nAchievements\n\nAguilera has accumulated numerous awards and honorary accolades throughout her career. At the age of 19, she won the Grammy Award for Best New Artist, becoming one of the youngest artists to receive the award.[412] Aguilera received four other trophies from twenty nominations by The Recording Academy.[413] She is also a recipient of two Latin Grammy Awards, three Billboard Latin Music Awards—including the Spirit of Hope Award—, two MTV Video Music Awards (VMAs), two People's Choice Awards—including the inaugural Music Icon Award—, three World Music Awards, and one Guinness World Record.[414][415] Aguilera is also one of the best-selling music artists of all time, with estimated sales of over 100 million records sold worldwide.[417][418][419] Among other honors, she received a star on the Hollywood Walk of Fame in 2010 \"recognition of her achievements in the recording industry\".[420] Billboard ranked her at number 20 on its 2025 \"Top 100 Women Artists of the 21st Century\" list.[421]\n\nOther activities\n\nBusiness ventures and wealth\n\nAguilera attending a fundraising event promoted by Montblanc in 2010\n\nAs a businesswoman, Aguilera has been selling her own products and investing in multiple companies. In 2008, she became co-owner of LAX nightclub at the Luxor Las Vegas alongside DJ AM.[422] In 2015, she founded the MX Productions & Investments in partnership with fiancée Matthew Rutler, for which they was included in the investors' group of Pinterest, DraftKings, Lyft and MasterClass enterprises.[423] Aguilera also joined the ownership group of Angel City FC, a National Women's Soccer League (NWSL) expansion team, and sexual wellness brand Playground.[424][425] In March 2015, Aguilera and Rutler signed a deal with Lions Gate Entertainment to developed both scripted and unscripted projects which eventually was acquired by ABC Family and Spike TV networks.[426][427] In 2022, she was named chief culture officer of The Fun Wine Company.[428]\n\nIn 2007, Aguilera signed a long-term deal with Procter & Gamble (P&G) and created the Christina Aguilera Fragrances, which has been sold in North America, Latin America, Asia and Europe.[429][430] In addition to scents, the brand manufactures body lotions, body sprays, and deodorants whose products was ranked among the United Kingdom best-sellers in 2007, 2009 and 2010.[431] In January 2016, the line was reported to sold over $80 million.[432] Her fragrances also received numerous accolades, including at the Duftstars Awards and FiFi Awards.[433][434] During São Paulo Fashion Week in 2011, Aguilera debuted her first clothes line which was mostly sold in Brazilian department stores C&A.[435] In partnership with American Greetings, she featured in customized birthday video cards which was sold online in 2021 and eventually won a Clio Awards.[436]\n\nDuring her career, Aguilera has been involved in marketing initiatives and endorsed numerous brands including Sears, Levi's,[437] Skechers,[438] Mercedes-Benz,[439] Virgin Mobile,[440] Orange UK, Sony Ericsson,[441] Oreo,[442] SweeTarts,[443] Just Eat, Lieferando, Menulog,[444] Merz Aesthetics,[445] and Grindr.[446] In 2001, she starred in a series of television advertising to Coca-Cola, which was aired in Latin America and the United States. Media outlets reported the deal signed by Aguilera to be worth up to £50 million.[447] Aguilera also shot a global scale advertising campaign alongside South Korean singer Rain to promote Pepsi during the 2006 FIFA World Cup.[448] Other Aguilera's endorses included a clothing line by Versace in 2003, and a collection of sterling silver pieces designed by Stephen Webster in 2008.[449][450] On June 28, 2004, she received £200,000 to open the summer sale at the London's department store Harrods.[451] In 2008, Aguilera was paid $1.5 million to submit pictures of her first child to People, becoming the ninth most expensive celebrity baby photograph ever taken.[452]\n\nIn 2000, Aguilera was among the biggest moneymakers in the music business with over £65 million earned with album sales, merchandising and licensing deals according to VH1.[453] In January 2008, she was ranked 19th on Forbes' list of Top-Earning Women in Music of 2007 with earnings of $20 million.[454] The previous year, she was also included on their list of richest women in entertainment industry, with an estimated net worth of $60 million.[455] In August 2022, Aguilera's net worth was reported to be $160 million.[456]\n\nPhilanthropy and activism\n\nReferred to as a humanitarian, Aguilera has done philanthropic works during her career.[457] In 2003, she visited the Women's Center & Shelter of Greater Pittsburgh and provided a donation over $200,000 in support for victims of domestic violence.[458] In addition to starred in television advertisings on the Lifetime network calling for the end of violence against women in 2007, she partnered with Verizon in a campaign to awareness about violence domestic in 2015.[459][460] She later destined proceeds from the Christina Aguilera: The Xperience (2019–2020) residency to The Shade Tree, a women and children's center in Las Vegas, Nevada.[461] In October 2019, Aguilera efforts against domestic violence earned her the Bonnie Polley Community Hero Award.[462]\n\nIn 2009, Aguilera became the global spokesperson for the World Food Program, a branch of the United Nations (UN).[463] She visited countries with high rates of malnutrions, including Ecuador, Guatemala, Haiti and Rwanda.[464] As of 2013, it was reported she helped raise over $148 million to the organization and other hunger relief agencies in 45 countries.[465] Aguilera's efforts eventually earned her the Muhammad Ali Humanitarian Awards and George McGovern Leadership Awards—which she received in the White House from the former Secretary of State, Hillary Clinton.[466][467] Her other philanthropy initiatives included donations of her wedding gifts to charities in support of families affected by Hurricane Katrina in 2005 and concerts to urges donations to the American Red Cross due Hurricane Sandy in 2012.[468][469]\n\nIn 2010, Aguilera auctioned tickets to her concerts through Christie's, earmarking the proceeds to non-profit environmental organizations, including Conservation International and the Natural Resources Defense Council.[470] In response to the 2010 Haiti earthquake, she auctioned off a Chrysler 300 and destined proceeds to support disaster victims and their families.[471] Additionally, Aguilera appeared on the Hope for Haiti Now telethon, whose donations directly benefited Oxfam America, Partners In Health, International Red Cross and Red Crescent Movement, and UNICEF.[472][473] She also was praised by People for the Ethical Treatment of Animals (PETA) for signed an open letter destined to Government of South Korea appealing to the ban of consumption of dogs and cats, and for using fake fox fur in concerts costumes.[474][475]\n\nAs a LGBT rights activist, Aguilera was lauded for calling out myths around HIV/AIDS, in addition to raising awareness about the virus and raising funds for the Mac AIDS Fund and the Elton John AIDS Foundation.[476][477] In 2008, she advocated for same-sex marriage and spoke out against Proposition 8. During an interview with MTV News, she stated \"Why would you put so much money behind something [aimed at] stopping people from loving each other? I just don't understand it\".[478] In June 2016, Aguilera released single \"Change\", which was aimed to raise proceeds to the victim's families and survivors of the Orlando nightclub shooting.[479] During The X Tour (2019), Aguilera visited Russia and \"blessed\" a gay marriage proposal in the backstage, contrary to the country's laws against \"gay propaganda\".[480]\n\nPersonal life\n\nFrom 2000 to September 2001, Aguilera dated dancer Jorge Santos, whom she met whilst filming one of her music videos.[481] She began dating music executive Jordan Bratman in late 2002. They got engaged in February 2005.[482] On November 19, 2005, they married on an estate in Napa County, California, holding a private traditional Jewish ceremony.[483][484][485] They have a son, Max Liron Bratman, born in 2008.[486][487] In September 2010, the couple had separated and she filed for divorce in October 2010,[488] which was finalized in April 2011 and included joint custody of their son.[489]\n\nIn November 2010, Aguilera began dating production assistant Matthew Rutler, whom she met while filming the musical Burlesque.[490] Aguilera was arrested for public intoxication in March 2011, while Rutler was booked for driving under the influence.[491] However, the charges against Rutler were dropped the following month.[492] In 2014, they became engaged on Valentine's Day.[493] Later that year, Aguilera gave birth to their daughter, Summer Rain Rutler.[494][487]\n\nAfter being raised Catholic, she learned about Judaism in the mid-2000s.[495] In 2022, she opened up about depression and anxiety, stating \"I experienced a lot of trauma in my childhood [...] I've definitely had struggles in the past with depression and anxiety. It's a constant battle to overcome a mind that is anxious, a mind that is always second-guessing\".[496] Aguilera has also been sharing about insecurity and struggling with body image early in her career.[497]\n\nIn 2007, Aguilera purchased a Mediterranean-style mansion in Beverly Hills for $11.5 million, which she sold for $13.5 million in March 2013.[498] Shortly afterwards, she acquired a house in the Mulholland Estates' private enclave, at the Santa Monica Mountains, for $10 million and currently resides there with her family.[499]\n\nDiscography\n\nStudio albums\n\nFilmography\n\nTheater\n\nBurlesque (2024); producer, co-composer and lyricist\n\nTours and residencies\n\nSee also\n\nReferences\n\nSources\n\nFurther reading", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Audio-input-microphone.png/20px-Audio-input-microphone.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Christina_Aguilera_en_Marbella_2022_05_%28cropped%29.jpg/250px-Christina_Aguilera_en_Marbella_2022_05_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Stripped_Tour_CH_-_cropped.jpg/250px-Stripped_Tour_CH_-_cropped.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Christina_Aguilera_%28at_premiere_of_%22To_John_With_Love%22%2C_September_2010%29.jpg/250px-Christina_Aguilera_%28at_premiere_of_%22To_John_With_Love%22%2C_September_2010%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/40px-Wikiquote-logo.svg.png", "http://en.wikipedia.org/static/images/footer/wikimedia.svg", "http://en.wikipedia.org/static/images/icons/wikipedia.png", "http://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/20px-P_vip.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Christina_Aguilera_2019_Disney_Legends_Awards_Ceremony_D23_EXPO_2019_%2851440741738%29_%28cropped%29.jpg/250px-Christina_Aguilera_2019_Disney_Legends_Awards_Ceremony_D23_EXPO_2019_%2851440741738%29_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/What_A_Girl_Wants122_-_CA.jpg/250px-What_A_Girl_Wants122_-_CA.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/40px-Wikidata-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Gnome-mime-sound-openclipart.svg/60px-Gnome-mime-sound-openclipart.svg.png", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Secretary_Clinton_With_David_Novak_and_Christina_Aguilera_%28cropped%29.jpg/250px-Secretary_Clinton_With_David_Novak_and_Christina_Aguilera_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/35/Christina_Aguilera_at_the_premiere_of_Burlesque_%282010%29.jpg/250px-Christina_Aguilera_at_the_premiere_of_Burlesque_%282010%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Whitney_Houston_Welcome_Home_Heroes_1_cropped.jpg/250px-Whitney_Houston_Welcome_Home_Heroes_1_cropped.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/20px-Symbol_category_class.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/20px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Christina_Aguilera_at_the_MTV_Video_Music_Awards_2006.jpg/250px-Christina_Aguilera_at_the_MTV_Video_Music_Awards_2006.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Mariah_Carey13_Edwards_Dec_1998.jpg/250px-Mariah_Carey13_Edwards_Dec_1998.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/40px-Flag_of_the_United_States.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Christina_Aguilera_2019_Disney_Legends_Awards_Ceremony_D23_EXPO_2019_%2851440741738%29_%28cropped%29.jpg/960px-Christina_Aguilera_2019_Disney_Legends_Awards_Ceremony_D23_EXPO_2019_%2851440741738%29_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Etta_James.jpg/250px-Etta_James.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Christina_Aguilera_signature.png/250px-Christina_Aguilera_signature.png", "http://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Christina_Aguilera_at_the_Breakthrough_Prize_Scientists%2C_2014.jpg/250px-Christina_Aguilera_at_the_Breakthrough_Prize_Scientists%2C_2014.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/CAguilera_DenverOct2018_3.jpg/250px-CAguilera_DenverOct2018_3.jpg", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/86/Liberation_Tour_%2845997616942%29_%28cropped%29.jpg/250px-Liberation_Tour_%2845997616942%29_%28cropped%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Christina_Aguilera_2019_Disney_Legends_Awards_Ceremony_D23_EXPO_2019_%2851440741738%29_%28cropped%29.jpg/960px-Christina_Aguilera_2019_Disney_Legends_Awards_Ceremony_D23_EXPO_2019_%2851440741738%29_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Christina_Aguilera", "title": "Christina Aguilera", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Christina_Aguilera_2019_Disney_Legends_Awards_Ceremony_D23_EXPO_2019_%2851440741738%29_%28cropped%29.jpg/960px-Christina_Aguilera_2019_Disney_Legends_Awards_Ceremony_D23_EXPO_2019_%2851440741738%29_%28cropped%29.jpg", "width": 869, "height": 1200}, "title": "Christina Aguilera - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}