{"url": "https://en.wikipedia.org/wiki/Married_at_First_Sight_(Australian_TV_series)", "text": "Australian reality television series\n\nMarried at First Sight is an Australian reality television adaptation of the Danish series Gift ved første blik [da]. The show features a group of strangers who participate in a social experiment and are paired together by experts.[1] Due to the legal requirement to give one month's notice of marriage in Australia,[2] participants in this installment are not legally married, instead proceeding with an unofficial commitment ceremony.[3] The series first premiered on 18 May 2015 on the Nine Network.[4] The show has had twelve seasons between 2015 and 2025,[5] plus a two-part reunion special which was broadcast before the eighth season in 2021.[6]\n\nPremise [ edit ]\n\nCouples meet for the first time at the altar, before spending their \"wedding night\" in a hotel and then embarking on a honeymoon. Upon return, they live together for a period of time and each week decide whether they will continue their relationship at a commitment ceremony where they can choose to either stay or leave. The experts encourage contestants to fully immerse themselves within all stages of the experiment which focuses on relationship building and companionship.[citation needed]\n\nProduction [ edit ]\n\nIn November 2013, the series was originally announced to air in 2014, however was later delayed to the following year and premiered on 18 May 2015, with experts John Aiken, Sabina Read and Trisha Stratford.[7][8][3] Following the series premiere, the series was immediately renewed for a second season after a strong debut in its timeslot.[9] Mel Schilling replaced Read as an expert in the second season.[10] It was narrated by Georgie Gardner from 2015 to 2017 for the first four seasons.[10] Since 2018, Helen Dallimore has replaced Gardner as series narrator since the fifth season.[11] Due to Australian legal requirements, participants in the series are not legally married, instead proceeding with an unofficial commitment ceremony.[3]\n\nSeries overview [ edit ]\n\nSeason Episodes Originally aired Season premiere Season finale 1 6 18 May 2015 22 June 2015 2 7 4 April 2016 27 April 2016 3 8 29 August 2016 13 September 2016 4 29 30 January 2017 3 April 2017 5 32 29 January 2018 21 March 2018 6 41 28 January 2019 8 April 2019 7 36 3 February 2020 5 April 2020 GR 2 31 January 2021 1 February 2021 8 32 22 February 2021 18 April 2021 9 37 31 January 2022 4 April 2022 10 36 30 January 2023 3 April 2023 11 38 29 January 2024 15 April 2024 12 40 27 January 2025 7 April 2025 13\n\nTimeline of experts [ edit ]\n\nSeason 1 (2015) [ edit ]\n\nIn the first episode, two couples (Michael & Roni, Clare & Lachlan) met and wed in Melbourne and Sydney respectively. In the second episode, another two couples (Zoe & Alex, Michelle & James) met and wed in Melbourne and Sydney.[citation needed]\n\nThe Nine Network announced on 26 June 2015 that Lachlan would participate in the network's upcoming revival of The Farmer Wants a Wife.[12]\n\nCouple profiles [ edit ]\n\nNo. Couple Age Home Occupation Honeymoon Final Decision Status 1 Clare Tamas 37 Sydney, New South Wales Marketing manager Gold Coast, Queensland Yes Separated [ 13 ] Lachlan McAleer 36 Sydney, New South Wales Farmer 2 Roni Azzopardi 32 Melbourne, Victoria Payroll manager Wanaka, New Zealand Broke up before final decision Separated Michael O'Dea 31 Melbourne, Victoria Event manager 3 Zoe Hendrix 25 Melbourne, Victoria Digital marketing executive Whitsunday Islands Yes Separated with child [ 14 ] [ 15 ] Alex Garner 29 Melbourne, Victoria Plumber 4 Michelle Worsley 34 Sydney, New South Wales Communications manager Darwin, Northern Territory Yes Separated [ 16 ] James Webster 36 Sydney, New South Wales Sign writer\n\nSeason 2 (2016) [ edit ]\n\nIn the first episode, two couples (Erin & Bryce, Christie & Mark) met and wed in Melbourne and Sydney. In the second episode, another two couples (Clare & Jono, Simone & Xavier) met and wed in Melbourne and Sydney respectively.\n\nCouple profiles [ edit ]\n\nNo. Couple Age Home Occupation Honeymoon Final Decision Status 1 Erin Bateman 26 Melbourne, Victoria Retail Manager Palm Cove, Queensland Yes Together [ 17 ] Bryce Mohr 31 Melbourne, Victoria Business analyst 2 Christie Jordee 39 Sydney, New South Wales Business Owner New Caledonia Yes Separated [ 18 ] Mark Hughes 36 Gippsland, Victoria Farmer 3 Clare Verrall 32 Melbourne, Victoria Recruitment Consultant Northern Territory Broke up before final decision Separated Jono Pitman 28 Melbourne, Victoria Tradie 4 Simone Lee Brennan 29 Sydney, New South Wales Make-up artist Fiji No Separated Xavier Forsberg 26 Sydney, New South Wales Sales manager\n\nSeason 3 (2016) [ edit ]\n\nSeason 3 was the first to feature five couples, including the series' first same-sex couple.[19] In the first episode, two couples (Nicole & Keller, Monica & Mark) met and wed in Brisbane and Sydney. In the second episode, another two couples (Jess & Dave, Bella & Michael) met and wed in Sydney and Brisbane. In the third episode, one more couple (Craig & Andy) met and wed in New Zealand.\n\nCouple profiles [ edit ]\n\nNo. Couple Age Home Occupation Honeymoon Final Decision Status 1 Nicole Heir 28 Gold Coast, Queensland Teacher Cook Islands Yes Separated [ 20 ] Craig Keller 26 Brisbane, Queensland Mechanical fitter 2 Monica Vanderkley 28 Sydney, New South Wales Project manager Lord Howe Island Yes Separated [ 20 ] Mark Ellam 30 Sydney, New South Wales Firefighter 3 Jess Wardrop 31 Sydney, New South Wales Bank officer Byron Bay, New South Wales Broke up before final decision Separated Dave Crisp 28 Melbourne, Victoria Account manager 4 Bella Frizza 30 Gold Coast, Queensland Radio announcer Port Douglas, Queensland Yes Separated [ 20 ] Michael Hughes 32 Brisbane, Queensland Fashion accessories designer 5 Craig Roach 41 Gold Coast, Queensland Hairdresser Queenstown, New Zealand Broke up before final decision Separated Andy Ankers 41 Sydney, New South Wales Global account director\n\nSeason 4 (2017) [ edit ]\n\nIn the first episode, two couples (Cheryl & Jonathan, Susan & Sean) met and wed in Sydney and Melbourne. In the second episode, another two couples (Scarlett & Michael, Nadia & Anthony) met and wed in Sydney. In the third episode, two more couples (Alene & Simon, Vanessa & Andy) met and wed in Sydney and Melbourne respectively. In the fourth episode, another two couples (Lauren & Andrew, Deborah & John) met and wed in Sydney. In the fifth episode, two of the women were twins and they were all married in the same ceremony in Perth, (Michelle & Jesse, Sharon & Nick). In the ninth episode, two previous contestants were matched up (Andrew & Cheryl).\n\nSeason 5 (2018) [ edit ]\n\nIn the first episode, the first two couples (Tracey & Dean, Sarah & Telv) met and wed in Sydney and Melbourne.[21] In the second episode, another two couples (Jo & Sean, Alycia & Mat) met and wed in Sydney and Melbourne.[22] In the third episode, two more couples (Davina & Ryan, Charlene & Patrick) met and wed in Warrawong and Melbourne.[23] In the fifth episode, two more couples (Ashley & Troy, Melissa & John (a returning groom from season 4)) met and wed in Gold Coast and Melbourne.[24] In the sixth episode, another two couples (Gabrielle & Nasser, Carly & Justin) met and wed in Sydney.[25] In the seventh episode, the final couple (Blair & Sean) met and wed in Sydney.[26]\n\nSeason 6 (2019) [ edit ]\n\nIn the first episode, two couples (Jules & Cameron, Cyrell & Nic) met and wed in Sydney.[27] In the second episode, two more couples (Jessika & Mick, Melissa & Dino) met and wed in Byron Bay and Hawkesbury River, both in New South Wales.[28] In the third episode, another two couples (Heidi & Mike, Ning & Mark) met and wed in Byron Bay and Melbourne.[29] In the fifth episode, two more couples (Lauren & Matthew, Elizabeth & Sam) met and wed in Byron Bay and Hawkesbury River.[30] In the sixth episode, the last two couples (Ines & Bronson, Martha & Michael) met and wed in Byron Bay and Melbourne.[31] In the 18th episode, two new couples (Susie & Billy, Tamara & Dan) met and wed in Sydney.[32]\n\nThe experts had to decide on a controversial request by Dan and Jess who wanted to leave their respective \"spouses\" but remain in the experiment as a couple. The experts allowed the couple to leave their previous matches and stay in the experiment as a new couple.[33]\n\nSeason 7 (2020) [ edit ]\n\nIn the first episode, the first two couples (Poppy & Luke, Cathy & Josh) met and wed in Bilpin and Wyong Creek, both in New South Wales.[34] In the second episode, another two couples (Natasha & Mikey, Amanda & Tash) met and wed in Stanwell Tops and Melbourne.[35] In the third episode, another two couples (Hayley & David, Vanessa & Chris) met and wed in Melbourne and Sydney.[36] In the fifth episode, two more couples (Connie & Jonethen, Aleks & Ivan) met and wed in Melbourne and Sydney.[37] In the sixth episode, the last two couples (Mishel & Steve, Stacey & Michael) met and wed in Melbourne.[38] In the 18th episode, two new couples (Elizabeth & Seb, KC & Drew) met and wed in Sydney and Central Coast.[39]\n\nGrand Reunion special (2021) [ edit ]\n\nAfter Season 8 was delayed by three weeks due to a delayed Australian Open, the Nine Network commissioned a two part reunion special to fill the programming gap.[40][41] Part 1 centered around a dinner party, whereas Part 2 focused on experts John Aiken and Mel Schilling catching up with each participant, where they reflected on their lives following their time in the experiment.\n\nPart 1 aired on 31 January 2021. Part 2 was scheduled to air on 7 February 2021, however was brought forward to 1 February 2021, as counter-programming to the Seven Network's premiere of Holey Moley.[43]\n\nParticipants [ edit ]\n\nParticipant Season Dean Wells Season 5 Tracey Jewel Season 5 Cyrell Paule Season 6 Ines Bašić Season 6 Jessika Power Season 6 Martha Kalifatidis Season 6 Michael Brunelli Season 6 Sarah Roza Season 5 Nasser Sultan Season 5 Troy Delmege Season 5 Ashley Irvin Season 5 Mike Gunner Season 6 Charlene Perera Season 5 Jo McPharlin Season 5 Ryan Gallagher Season 5 Elizabeth Sobinoff Season 6 & 7 Sebastian Guilhaus Season 7\n\nSeason 8 (2021) [ edit ]\n\nIn the first episode, two couples (Melissa & Bryce, Rebecca & Jake) met and wed in Richmond and Hunter Valley, both in New South Wales.[44] In the second episode, three more couples (Samantha & Cameron, Booka & Brett, Coco & Sam) met and wed in Sydney and Hunter Valley.[45] In the third episode, another two couples (Alana & Jason, Joanne & James) met and wed in Sydney and Vaucluse.[46] In the fifth episode, two more couples (Belinda & Patrick, Beth & Russell) met and wed in the Hunter Valley and Sydney.[47] In the 14th episode, an additional two couples (Kerry & Johnny, Georgia & Liam) met and wed in Richmond and Helensburgh, both in New South Wales.[48] In the 15th episode, the final couple Jaimie & Chris met and wed in Sydney.[49][50]\n\nSeason 9 (2022) [ edit ]\n\nIn the first episode, two couples (Selin & Anthony, Tamara & Brent) met and wed in Richmond and Sydney.[51] In the second episode, two more couples (Domenica & Jack, Ella & Mitch) met and wed in Helensburgh and Sydney.[52] In the third episode, another two couples (Holly & Andrew, Selina & Cody) met and wed in Sydney and Cattai, New South Wales.[53] In the fifth episode, two more couples (Olivia & Jackson, Samantha & Al) met and wed in Sydney.[54] In the 14th episode, an additional two couples (Kate & Matt, Carolina & Dion) met and wed in Sydney and Oatlands, New South Wales.[55] In the 15th episode, the final couple Jessica & Daniel met and wed in Richmond, New South Wales.[56]\n\nSeason 10 (2023) [ edit ]\n\nIn the first episode, two couples (Lyndall & Cameron, Bronte & Harrison) met and wed in Byron Bay and Sydney.[57] In the second episode, another two couples (Sandy & Dan, Claire & Jesse) met and wed in Sydney.[58] In the third episode, two more couples (Tahnee & Ollie, Janelle & Adam) met and wed in Sydney and Byron Bay.[59] In the fourth episode, another two couples (Caitlin & Shannon, Alyssa & Duncan) met and wed on the Gold Coast and in Byron Bay.[60] In the fifth episode, two more couples (Melissa & Josh, Melinda & Layton) met and wed in Sydney.[61] In the 14th episode, the final two couples (Tayla & Hugo, Evelyn & Rupert) met and wed in Sydney.[62]\n\nSeason 11 (2024) [ edit ]\n\nIn the first episode, two couples (Sara & Tim, Cassandra & Tristan) met and wed in Sydney. In the second episode, two couples (Lucinda & Timothy, Tori & Jack) met & wed in Gold Coast Hinterland and Sydney. In the third episode, two couples (Natalie & Collins, Eden & Jayden) met & wed in Sydney and Gold Coast. In the fourth episode, one couple (Ben & Ellie) met & wed in Sydney. In the fifth episode, two couples (Lauren & Jonathan, Andrea & Richard) met & wed in Gold Coast & Tamborine Mountain. In the 14th episode, two couples (Stephen & Michael, same sex couple and Madeleine & Ash) met & wed. In the 15th episode, the final couple (Jade & Ridge) met & wed in Sydney.\n\nSeason 12 (2025) [ edit ]\n\nIn the first episode, two couples (Carina & Paul, Lauren & Eliot) met and wed in Sydney. In the second episode, two couples (Katie & Tim, Jamie & Dave) met and wed in Sydney and Berry. In the third episode, two couples (Awhina & Adrain, Sierah & Billy) met and wed. In the fourth episode, two couples (Ashleigh & Jake, Rhi & Jeff) met and wed. In the fifth episode, two couples (Morena & Tony, Jacqueline & Ryan) met and wed. In the 14th episode, one couple (Beth & Teejay) met and wed. In the 15th episode, a couple who left returned as separate bride and groom to form two new couples (Lauren & Clint, Veronica & Eliot) met and wed.\n\nSeason 13 (2026) [ edit ]\n\nViewership [ edit ]\n\nSeason ratings [ edit ]\n\nRatings data for seasons 1-10 represents the same day average viewership from the 5 largest Australian metropolitan centres (Sydney, Melbourne, Brisbane, Perth and Adelaide). Season 11 onwards represents the national average viewership.\n\nSeason Episodes Originally aired Preliminary Consolidated Season premiere Season finale Average viewers Average rank Average viewers Average rank 1 6 18 May 2015 22 June 2015 1.115 #4 1.195 #3 2 7 4 April 2016 27 April 2016 0.915 #7 0.999 #6 3 8 29 August 2016 13 September 2016 0.880 #7 0.970 #5 4 29 30 January 2017 3 April 2017 1.081 #3 1.186 #2 5 32 29 January 2018 21 March 2018 1.223 #1 1.328 #1 6 41 28 January 2019 8 April 2019 1.323 #1 1.432 #1 7 36 3 February 2020 5 April 2020 1.102 #2 1.215 #1 GR 2 31 January 2021 1 February 2021 0.824 #6 0.980 #4 8 32 22 February 2021 18 April 2021 1.021 #2 1.121 #1 9 37 31 January 2022 4 April 2022 0.946 #3 1.045 #1 10 36 30 January 2023 3 April 2023 0.878 #2 - #1 11 38 29 January 2024 8 April 2024 - #1 — 12 40 27 January 2025 7 April 2025 - #1 13\n\nSeason 1 (2015) [ edit ]\n\nSeason 2 (2016) [ edit ]\n\nSeason 3 (2016) [ edit ]\n\nGrand Reunion special (2021) [ edit ]\n\nAwards [ edit ]\n\nYear Award Category Result Ref. 2025 TV Week Logies Best Structured Reality Program Nominated [ 109 ]\n\nControversy and legality [ edit ]\n\nBefore the first season went to air, an online petition calling for the series to be axed attracted over 15,000 signatures.[110]\n\nContestants have also criticised the show, such as second season participant Simone Lee Brennan described the program as \"never [being] portrayed to its full authenticity,\" suggesting the man she had been paired with, Xavier Forsberg, had been recruited by producers and was seeking a sports-presenting role rather than a relationship.[111]\n\nAt the show's commitment ceremonies, each contestant chooses to remain in the production or withdraw, the latter of which the contestant's partner must agree to mutually. This has been criticised as sending \"the worst possible message\" to people who may be in a toxic relationship.[112] Due to interpersonal complexities in Season 10, contestants Caitlin McConville and Josh White were permitted to withdraw without input from their respective partners.\n\nSome of the contestants of the show have also spoken out against the program claiming it to be fake,[113] including Dean Wells from Season 5.[114] Other former contestants have been abused in the street, received death threats online, attempted suicide, or been taken to a psychiatric hospital.[115]\n\nInternational [ edit ]\n\nBroadcasters [ edit ]\n\nIn The Netherlands the show is called Married at First Sight and is broadcast at primetime on RTL 4.\n\nIn Belgium the show is broadcast as Blind getrouwd - Australië and runs every weekday on the Flemish channel VTM2. The parent network VTM also produces and runs an own installment of the format, called \"Blind getrouwd\" (\"Married in blind faith\") and which features Flemish couples.\n\nIn Spain, the show is broadcast as Casados a ciegas and runs every weekday from 6:15 pm for three hours each day on TEN.[116]\n\nIn the United Kingdom, in 2020, E4 aired the fourth series (2017), following this the fifth series (2018) was aired and then in early 2021, the sixth series (2019) was broadcast on the channel. By 2021 the series had become a hit with British audiences, earning a number of celebrity fans that included Sam Smith,[117] Michael Ball, and Duncan James.\n\nIn New Zealand, the show is broadcast on Three and screens four nights per week.\n\nIn Croatia the show is broadcast on the VOD platform Voyo\n\nIn the United States, the show is broadcast on cable network Lifetime on Wednesdays and Thursdays at 9pm ET/PT.[118]\n\nIn Poland, the show is broadcast on a VOD platform Player.pl.", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/60px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/en/5/5e/Married_at_First_Sight.png", "https://en.wikipedia.org/static/images/footer/wikimedia.svg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&type=1x1&usesul3=1", "https://en.wikipedia.org/w/resources/assets/mediawiki_compact.svg", "https://upload.wikimedia.org/wikipedia/en/thumb/5/5e/Married_at_First_Sight.png/250px-Married_at_First_Sight.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/5/5e/Married_at_First_Sight.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Married_at_First_Sight_(Australian_TV_series)", "title": "Married at First Sight (Australian TV series)", "meta_data": {"generator": "MediaWiki 1.46.0-wmf.2", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/5/5e/Married_at_First_Sight.png", "width": 1200, "height": 661}, "title": "Married at First Sight (Australian TV series) - Wikipedia", "type": "website"}, "viewport": "width=1120"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}