{"url": "https://www.vox.com/2018/5/9/17308114/avengers-infinity-captain-america-death", "text": "is a senior correspondent who explains what society obsesses over, from Marvel and movies to fitness and skin care. He came to Vox in 2014. Prior to that, he worked at The Atlantic.\n\nI spend a lot of time thinking about Captain America. I think about how, after six Marvel Studios films featuring Chris Evans in the role, we’ve gotten to the point where it’s impossible to trace where Evans ends and where Cap begins. I think about how he’s evolved from a character whose duty was to serve his country into a character whose country let him down. I think about how he bicep-curled a helicopter.\n\nAnd after seeing Avengers: Infinity War, and after seeing Evans tweeting about his character’s presumed cinematic end, I’ve thought a lot about what happens when Captain America dies.\n\n“We don’t trade lives,” Steve Rogers, a.k.a. Cap, tells Vision around Infinity War’s midpoint, explaining that the Avengers leave no men, women, or any other forms of life behind. But as we see half the world’s population (including some of our favorite Avengers) decimated at the movie’s end, it’s not hard to foresee an outcome in next year’s Avengers 4 where Cap is put in the position of trading his life for others.\n\nIt’s been eight years since Evans donned the stars and stripes for Captain America: The First Avenger. In that time, he’s evolved from a selfless patriot to a man out of time to a prodigal son. Now, with the future of the universe at stake, the table is set for what could be the biggest moment in the character’s cinematic life.\n\nGiven Cap’s character arc, which has always been underscored by his selflessness, and how much Infinity War emphasized his stance on “trading lives,” it certainly seems like a noble sacrifice to save the universe lies in his future. And even if it somehow doesn’t come to that, he’s already cemented his legacy as Earth’s most enduring Avenger.\n\nIn Infinity War, Cap and Thanos’s worldviews are symmetrical\n\nCap in Infinity War. Marvel Studios\n\nOne of the biggest revelations in Infinity War is Thanos’s motivations for culling the universe: He believes that in order to sustain life, we have to reduce it by half. Resources are finite, and life is a burden on those resources. Eliminate life to an ideal degree (roughly half, according to Thanos’s math), and both life and resources reach an optimal level.\n\nIn other words, Thanos believes in trading lives.\n\nThe ultimate example of his willingness to trade is his choice to throw his adopted daughter Gamora off a cliff in order to obtain the Soul Stone. His sights are set on completing the Infinity Gauntlet and using it to create his vision of a utopia. Killing his daughter, whom he seems to genuinely love, is the price he’s willing to pay.\n\nSteve Rogers and everything he stands for — and, by extension, the standard for what superheroes in Marvel’s Cinematic Universe strive to be — are the antithesis to Thanos. When faced with the choice between ripping the Mind Stone from Vision’s forehead and killing him, or protecting Vision and risking the fate of half the universe, Rogers refuses to trade a single life in the name of preserving his and countless others’. He’d rather die fighting than sacrifice an innocent to avoid the fight.\n\nThis stance is remarkable for a couple of reasons. First, Vision is an AI — Tony Stark’s computer program upgraded with the power of an Infinity Stone — which raises the question of whether Vision is even “alive” to begin with. Also, in contrast to Gamora and Thanos, Vision isn’t someone with a particularly distinct relationship to Steve Rogers. But despite this, Cap doesn’t hesitate in choosing to save Vision at all costs, risking the lives of Avengers and Wakandans alike to protect him.\n\nWhen Avengers 4 unfolds next year it will most likely involve the resurrection of its vaporized heroes (especially those with confirmed sequels on the schedule). Because of this, I’d expect there to be a continued emphasis on Steve’s “we don’t trade lives” mantra — it’s one of the few lines he’s given in Infinity War, and it’s repeated — in contrast to Thanos’s worldview. There’s just too much symmetry and thematic opportunity there for Marvel to ignore it.\n\nIt wouldn’t surprise me if in Avengers 4, in order to undo Thanos’s massive cull, Steve Rogers would have to sacrifice himself to undo the damage of not trading Vision’s life — that he would be faced with having to “trade lives” to get back all the lives that were lost. And the only life Cap would be fine with trading would be his own. (It also wouldn’t surprise me if some sort of Soul Stone mythology leads to a confrontation between Cap and Red Skull, the supervillain from Captain America: The First Avenger who’s revealed to be the keeper of the Soul Stone in Infinity War.)\n\nCap sacrificing himself for the greater good would feel like the ultimate inverse of Thanos’s decimation: giving his life to save the people he loves, instead of killing someone he loves in the name of a greater good. It’s a sacrifice that only Cap could make.\n\nMarvel figured out the importance of being earnest\n\nFind you someone who looks at you the way Cap looks at everyone. Marvel Studios\n\nBack in 2008, Marvel found itself a hero in Iron Man’s Tony Stark, who was sardonic, quippy, and smarter and cockier than his peers. Compared to other relatively earnest cinematic superheroes of the time, like the X-Men and Spider-Man, Tony Stark was the “cool” superhero we needed.\n\n“It takes about two minutes of watching Robert Downey Jr. in action in Iron Man 3 — in any of his appearances as the armored Tony Stark, in fact — to realize what the other Avengers are lacking: Charisma,” Graeme McMillan wrote in Time in 2013, bemoaning the Cap’s stiffness and earnestness in comparison to the Avengers’ other leader.\n\nBut a lot changes in five years.\n\nWith the way the Marvel Cinematic Universe has since shaken out, with Tony Stark at fault for creating Ultron and ripping apart the Avengers in Civil War, Downey’s portrayal of an artisanal tech jerk hasn’t aged particularly well. (And while I don’t blame Marvel or Downey for this, I can’t see Elon Musk without thinking of the smarminess of Tony Stark, and vice versa.) Tony Stark’s cocksure genius has gone from being an asset to a liability, for the character and the franchise alike. And in those same five years, Cap has become the more endearing hero.\n\nEver since his first appearance in 2011’s The First Avenger, Steve Rogers has been defined by his spirit — it’s the reason he, in spite of his physical deficiencies, was chosen for the super soldier experiment. In 2012’s The Avengers, he’s a thawed-out man out of time; he has all the powers of a super soldier, but beneath his superhero surface is that scrawny guy who’s a grandpa among his peers. He’s a relic of America’s golden age, and his earnestness and selflessness feel like relics as well: too good and sweet to be of our contemporary time and place, and directly at odds with the modern sensibilities of Tony Stark.\n\nBut Cap’s evolution into the heart of the modern MCU begins with the surreal revelation in 2014’s Captain America: The Winter Soldier that the country and the government he believed in and fought for has spoiled since he left it, forcing him to redefine his heroism in relationship to the government that first made him a hero. Then in 2016’s Captain America: Civil War, he’s completely at odds with the government, defying orders to save and protect his friends and the greater good, while Tony Stark aligns the remaining Avengers with the government in the name of atoning for the damage he caused by creating Ultron.\n\nClashing with Tony’s contemporary sarcasm, Steve’s earnestness becomes timeless. His heroism isn’t undertaken out of duty like Tony’s, but rather woven into the fabric of his being. Tony Stark’s goodness saves him from himself, while Steve’s goodness is quantified in saving others.\n\nAfter Infinity War, it feels like it’s time for Marvel to pass the torch\n\nInfinity War ends with a cliffhanger and a twist. Thanos eliminates half of the universe — and half of the Avengers — as the movie fades to black. But in a post-credits scene, Nick Fury is seen sending a distress call to someone he believes can save the day: Captain Marvel.\n\nWe know very little about the upcoming 2019 Captain Marvel film other than that it’s set in the 1990s and that its titular superhero, Carol Danvers, a.k.a. Captain Marvel, is an Air Force pilot caught in the middle of a war between two alien races, probably the Kree and the Skrulls. Setting the movie in the 1990s, and then possibly sending the character into space to deal with cosmic threats, could help explain why Captain Marvel hasn’t already appeared on Earth at some point in the MCU’s 10-year history.\n\nBut with the Avengers and the universe in tatters, the table is set for Captain Marvel to make her debut and rally the troops. It also feels like the time when the original core Avengers will pass the torch to the next generation of Marvel heroes.\n\nEvans hasn’t detailed the specifics of his Captan America contract, but he told Good Morning America during the Infinity War press tour: “I don’t know what’s next — but by 2019, that’s it.” And this week he tweeted about how grateful he was for the memories and the experiences of playing (in past tense) the character.\n\nAssuming Evans isn’t bluffing, there will be a storytelling opportunity for Captain America to pass his leadership of the team to another captain who happens to share many of his defining qualities (time displacement, an outsider to the core group, a US service member). It would make sense that Cap would sacrifice himself, but also that he would see to it that the Avengers are left in capable, caring, and responsible hands.\n\nThere’s thematic precedence for this in the comics that Avengers 4 could easily draw on for this scenario. In Captain Marvel No. 1, written by Kelly Sue DeConnick and drawn by Dexter Soy, Carol and Cap have a strikingly pertinent discussion about her taking the name “Captain Marvel” and leading the team. It’s primarily a conversation about legacy: Carol doesn’t want the title because she doesn’t want to be seen as stealing or besmirching the original Captain Marvel’s good name.\n\nCap and Carol in Captain Marvel No. 1. Marvel/Dexter Soy\n\nReading over that scene made me think about the title of Captain America as it stands in the Marvel Cinematic Universe. Marvel has, over the past seven years, created a humanity in Captain America. In taking up that mantle, Steve Rogers has become one of the most beloved characters in pop culture, and the defining spirit of the first generation of Avengers. Should Avengers 4 be his last hurrah, it will also necessarily be a celebration of his legacy.", "images": ["https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-468814460.jpg?quality=90&strip=all&crop=0%2C2.3825770499261%2C100%2C95.234845900148&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/8635113/spoilers_below.png?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-2155209999.jpg?quality=90&strip=all&crop=16.669458870833%2C0%2C66.661082258335%2C100&w=2400", "https://www.google-analytics.com/g/collect?v=2&tid=G-C3QZPB4GVE&cid=555&en=noscript_page_view", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/the-true-meaning-of-friendsgiving.jpg?quality=90&strip=all&crop=21.875%2C0%2C56.25%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/3_Vox_FuturePerfect25_LandingPage.gif?quality=90&strip=all&crop=16.666666666667%2C0%2C66.666666666667%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/10417219/infinitywar.jpg?quality=90&strip=all&crop=0%2C0.35873569904983%2C100%2C99.2825286019&w=1200", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/10853127/InfinityWar_thanos.jpg?quality=90&strip=all&crop=10.77880859375%2C0%2C78.4423828125%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-2155209999.jpg?quality=90&strip=all&crop=0.0041883062489489%2C0%2C99.991623387502%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/10806839/Screen_Shot_2018_05_09_at_9.39.31_AM.png?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/10769383/Screen_Shot_2018_05_02_at_3.57.13_PM.png?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-590696434.jpg?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/3_Vox_FuturePerfect25_LandingPage.gif?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-590696434.jpg?quality=90&strip=all&crop=16.666666666667%2C0%2C66.666666666667%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/10417219/infinitywar.jpg?quality=90&strip=all&crop=10.44921875%2C0%2C79.1015625%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/gettyimages-2217689678.jpg?quality=90&strip=all&crop=16.650390625%2C0%2C66.69921875%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/10155785/infinitywar2.png?quality=90&strip=all&crop=22.054317548747%2C0%2C41.504178272981%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/10853127/InfinityWar_thanos.jpg?quality=90&strip=all&crop=28.828125%2C0%2C52.294921875%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/GettyImages-468814460.jpg?quality=90&strip=all&crop=14.998805827561%2C0%2C70.002388344877%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/the-true-meaning-of-friendsgiving.jpg?quality=90&strip=all&crop=7.8125%2C0%2C84.375%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/author_profile_images/195900/alex.0.jpg?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=96", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/10806827/Screen_Shot_2018_05_09_at_9.40.16_AM.png?quality=90&strip=all&crop=0%2C0%2C100%2C100&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/2025/11/gettyimages-2217689678.jpg?quality=90&strip=all&crop=0%2C0.024402147388969%2C100%2C99.951195705222&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/2348912/Screen_Shot_2014-10-13_at_12.41.22_AM.0.png?quality=90&strip=all&crop=0%2C17.341040462428%2C100%2C65.317919075145&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/2348912/Screen_Shot_2014-10-13_at_12.41.22_AM.0.png?quality=90&strip=all&crop=0%2C1.0115606936416%2C100%2C97.976878612717&w=2400", "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/10155785/infinitywar2.png?quality=90&strip=all&crop=18.871866295265%2C0%2C62.256267409471%2C100&w=2400"], "top_img": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/10417219/infinitywar.jpg?quality=90&strip=all&crop=0%2C0.35873569904983%2C100%2C99.2825286019&w=1200", "keywords": [], "authors": ["Alex Abad-Santos"], "canonical_link": "https://www.vox.com/2018/5/9/17308114/avengers-infinity-captain-america-death", "title": "Goodbye to Captain America: How Marvel might retire Steve Rogers", "meta_data": {"bingbot": "nocache", "twitter": {"card": "summary_large_image", "site": "@voxdotcom", "url": "https://www.vox.com/2018/5/9/17308114/avengers-infinity-captain-america-death", "title": "Goodbye to Captain America: How Marvel might retire Steve Rogers", "description": "Chris Evans has all but confirmed he’s done playing Cap. So have the Avengers movies.", "image": {"identifier": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/10417219/infinitywar.jpg?quality=90&strip=all&crop=0%2C0.35873569904983%2C100%2C99.2825286019&w=1200", "alt": "Marvel Studios' AVENGERS: INFINITY WAR..L to R: War Machine (Don Cheadle), Winter Soldier/Bucky Barnes (Sebastian Stan), Black Widow/Natasha Romanoff (Scarlet Johansson), Captain America/Steve Rogers (Chris Evans), Hulk (Mark Ruffalo), Okoye (Danai Gurira"}}, "fb": {"app_id": 549923288395304}, "og": {"site_name": "Vox", "title": "Goodbye to Captain America: How Marvel might retire Steve Rogers", "description": "Chris Evans has all but confirmed he’s done playing Cap. So have the Avengers movies.", "url": "https://www.vox.com/2018/5/9/17308114/avengers-infinity-captain-america-death", "type": "article", "image": {"identifier": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/10417219/infinitywar.jpg?quality=90&strip=all&crop=0%2C0.35873569904983%2C100%2C99.2825286019&w=1200", "alt": "Marvel Studios' AVENGERS: INFINITY WAR..L to R: War Machine (Don Cheadle), Winter Soldier/Bucky Barnes (Sebastian Stan), Black Widow/Natasha Romanoff (Scarlet Johansson), Captain America/Steve Rogers (Chris Evans), Hulk (Mark Ruffalo), Okoye (Danai Gurira", "type": "image/jpeg", "width": 1200, "height": 628}}, "viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Vox", "robots": "index,follow,max-image-preview:large", "description": "Chris Evans has all but confirmed he’s done playing Cap. So have the Avengers movies.", "article": {"published_time": "2018-05-09T14:10:02+00:00", "modified_time": "2018-10-05T16:37:53+00:00"}, "author": "Alex Abad-Santos", "amazonbot": "noarchive", "parsely-type": "post", "parsely-title": "Avengers: Infinity War is the beginning of a goodbye to Captain America", "parsely-link": "https://www.vox.com/2018/5/9/17308114/avengers-infinity-captain-america-death", "parsely-image-url": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/10417219/infinitywar.jpg?quality=90&strip=all&crop=0,0.35873569904983,100,99.2825286019", "parsely-pub-date": "2018-05-09T14:10:02+00:00", "parsely-section": "culture", "parsely-tags": "vox,pagetype:story,latest-news,culture,movies,stream-17023139", "parsely-author": "Alex Abad-Santos", "cse-category": "Culture", "cse-authors": "Alex Abad-Santos", "next-head-count": 51}, "movies": [], "publish_date": 1525838400.0, "source": "https://www.vox.com", "summary": ""}