{"url": "https://www.desmoinesregister.com/story/news/crime-and-courts/2018/09/24/judge-dismisses-contempt-court-charge-journalist-who-filmed-bachelor-chris-soules-court-appearance/1370935002/", "text": "A judge has dismissed contempt of court charges against a former reporter for an eastern Iowa news station who took video of a court appearance by \"The Bachelor\" star Chris Soules.\n\nElizabeth Amanieh, a former reporter for KWWL, an NBC affiliate station based in Waterloo, took video of Soules in April 2017 during his initial appearance.\n\nAuthorities say Soules was involved in a hit and run in April in Aurora, a small town in Buchanan County, when he rear-ended 66-year-old Kenneth Mosher, who was driving a tractor. Soules allegedly left the scene after calling 911. Mosher died in the accident.\n\nSoules was charged with leaving the scene of a fatal car crash, a class D felony. If convicted, he could face as many as five years in prison. His trial is set to begin Nov. 7.\n\nBuchanan County District Court Judge Fae Hoover-Grinde on Thursday dismissed the contempt charge against Elizabeth Amanieh. Hoover-Grinde found prosecutors failed to prove beyond a reasonable doubt that Elizabeth Amanieh willfully violated another judge's order not to record video of the proceeding, said Amanieh's attorneys, Tom Frerichs and Eric Tindal.\n\n\"For her to recognize that was huge for me because I felt like my voice was finally heard,\" Amanieh told the Register in an interview Monday.\n\nMore on the Chris Soules case:\n\nIowa allows journalists to record video, audio and take photographs if they have prior approval. Prosecutors in the case say Judge Linda Fangman had told Amanieh that only photos could be taken during the trial. But prosecutors said that the reporter used her cellphone to take video of Soules' initial appearance.\n\nHours after the hearing, the district's chief judge, Kellyann Lekar, signed an order retroactively approving expanded media coverage for the hearing. That order was requested by the media coordinator at KWWL's urging, amid confusion about Fangman's order. KWWL then aired and posted the video.\n\nThe Buchanan County Attorney's Office filed a complaint saying Amanieh was in contempt of court.\n\nIn a news release, Amanieh expressed relief that the case was dismissed. But she also said KWWL executives asked her to film on her cellphone and later posted the video, though she was uncomfortable with the actions.\n\n\"I only did everything my news director at the time, Shane Moreland, directed me to do,\" Amanieh said in the release. \"I was simply following orders when I received direction from KWWL-TV management to record video on my cellphone. When the judge ... told me she did not want that video to be seen anywhere, I got on the phone and called my boss, telling him I was going to delete the video.\"\n\nAmanieh said KWWL management told her not to delete the video and later asked Lekar for permission to use the video.\n\n\"KWWL may have been wrong in ordering me to record video on my phone, but they also took no ownership of their actions,\" Amanieh said in the release. \"Even though I followed the directions of KWWL management, they used me as a scapegoat. Instead of standing beside me, they covered up their own actions at every step.\"\n\nWhen asked if she would pursue legal action against the station, Amanieh said \"as of this moment, we are just looking at our options.\"\n\nJim McKernan, KWWL's vice president and general manager, on Monday took issue with some of the information he's seen reported on the case, but said the station would not comment further.\n\n\"Some of the reporting and some of the opinions as represented so far in the press are not correct,\" he said, declining to elaborate.\n\nMoreland did not immediately respond Monday to a message seeking comment.", "images": ["https://www.desmoinesregister.com/gcdn/presto/2018/09/24/PDEM/fb39d4fc-4852-453f-b5cb-66a82fb49bde-Elizabeth_Amanieh_Headshot.JPG?crop=5759,3226,x0,y75&width=3200&height=1793&format=pjpg&auto=webp", "https://www.desmoinesregister.com/gciaf/prod/p?a=pageview&p=PDEM-TEALIUM-TANGENT&m=web&k=f14ebdd6-0569-4c64-af73-99937bc06379&s=noscript"], "top_img": "https://www.desmoinesregister.com/gcdn/presto/2018/09/24/PDEM/fb39d4fc-4852-453f-b5cb-66a82fb49bde-Elizabeth_Amanieh_Headshot.JPG?crop=5759,3226,x0,y75&width=3200&height=1793&format=pjpg&auto=webp", "keywords": [], "authors": [], "canonical_link": "https://www.desmoinesregister.com/story/news/crime-and-courts/2018/09/24/judge-dismisses-contempt-court-charge-journalist-who-filmed-bachelor-chris-soules-court-appearance/1370935002/", "title": "Judge dismisses contempt charge against journalist who filmed Chris Soules' court appearance", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1", "theme-color": "#0098FE", "og": {"title": "Judge dismisses contempt charge against journalist who filmed Chris Soules' court appearance", "description": "A former reporter for KWWL in Waterloo took video of Soules in April 2017 during his initial appearance on a fatal hit-and-run case.", "url": "https://www.desmoinesregister.com/story/news/crime-and-courts/2018/09/24/judge-dismisses-contempt-court-charge-journalist-who-filmed-bachelor-chris-soules-court-appearance/1370935002/", "site_name": "The Des Moines Register", "image": {"identifier": "https://www.desmoinesregister.com/gcdn/presto/2018/09/24/PDEM/fb39d4fc-4852-453f-b5cb-66a82fb49bde-Elizabeth_Amanieh_Headshot.JPG?crop=5759,3226,x0,y75&width=3200&height=1793&format=pjpg&auto=webp", "width": 3200, "height": 1793}, "type": "article"}, "article": {"author": "Makayla Tendall and Stephen Gruber-Miller", "content_tier": "free", "opinion": "false"}, "description": "A former reporter for KWWL in Waterloo took video of Soules in April 2017 during his initial appearance on a fatal hit-and-run case.", "fb": {"pages": 8031989578, "app_id": 169766623060429}, "ROBOTS": "NOODP, NOYDIR, max-image-preview:large", "google": "notranslate", "twitter": {"card": "summary_large_image", "image": "https://www.desmoinesregister.com/gcdn/presto/2018/09/24/PDEM/fb39d4fc-4852-453f-b5cb-66a82fb49bde-Elizabeth_Amanieh_Headshot.JPG?crop=5759,3226,x0,y75&width=1600&height=800&format=pjpg&auto=webp", "site": "@DMRegister", "creator": "@DMRegister", "title": "Judge dismisses contempt charge against journalist who filmed Chris Soules' court appearance", "description": "A former reporter for KWWL in Waterloo took video of Soules in April 2017 during his initial appearance on a fatal hit-and-run case."}}, "movies": [], "publish_date": 1537761600.0, "source": "https://www.desmoinesregister.com", "summary": ""}