{"url": "https://www.vanityfair.com/style/2012/09/kate-middletons-married-life-house-facials", "text": "From left to right: Kate wears a dress by Roland Mouret and shoes by Jimmy Choo to a private dinner at Claridge’s hotel, in London; in an Alice Temperley gown for the U.K. premiere of War Horse; wearing an Alexander McQueen gown and Jimmy Choo shoes to a BAFTA event in Los Angeles; a McQueen dress and Mascaró bag for the Sun Military Awards at London’s Imperial War Museum., From left: © Splash News/Corbis, from Indigo/Getty Images, by Mark Large/Getty Images, by Jameson Zed/Sipa Press.\n\nWhen Catherine, the Duchess of Cambridge, emerged on the balcony of Buckingham Palace at the close of the Queen’s Diamond Jubilee celebrations, there was no mistaking her position and importance within the British royal family. Here was Prince William’s university sweetheart, a commoner from the Home Counties who had married the world’s most eligible prince in a fairy-tale wedding just a year earlier, taking her place alongside the line of succession and making history.\n\nAs the Queen of England stood flanked by the two men she refers to as “my substitutes”—her son the Prince of Wales and her grandson Prince William—she sent out a powerful message about the future of the newly streamlined British monarchy. There, alongside Camilla, the Duchess of Cornwall, and Prince Harry, was Kate. Resplendent in a champagne lace Alexander McQueen dress, a jaunty Jane Taylor hat, and her trademark L. K. Bennett nude stiletto heels, she looked entirely natural and at ease. The young woman, who just years earlier had been known as “Waity Katie,” was now at the forefront of the world’s most famous family.\n\nKate is the embodiment of a “People’s Princess” and—like William’s late mother, Diana, the Princess of Wales, and the forebear of that title—a world-renowned style icon. Over the past year, she has certainly proved to be the rising star of the monarchy, which is still riding high following the enormous success of the royal wedding—watched by a global audience of two billion—and the Queen’s recent Diamond Jubilee. Both events reprised a wave of affection the royal family feared it might never again experience.\n\nThose close to William, who turned 30 on June 21, say that he has never been happier. While his birthright and sense of responsibility used to weigh heavily on his shoulders, William is now optimistic about his destiny, and ready to embrace it. “There’s a happiness in the House of Windsor generally at the moment for the first time ever,” says a family friend. “Charles and Camilla are genuinely happy. William is happy because Charles is troubled less, and he has Kate to share his future with.”\n\nLike William, the Queen is said to be acutely aware that there must be no repeat of the past. The late Princess of Wales often complained that she felt like an outsider as she embarked on her new life as a working royal alongside the older and more seasoned Charles. Kate, in contrast, has been both better prepared and supported by her husband, whom she has described as a “great teacher.” She has taken to royal life like a duck to water. While she enjoys staying at the royal residences of Sandringham, in Norfolk, and Balmoral, in Scotland, she is said to find the constant clothes changes (up to five a day if the itinerary includes shooting, tea, and a formal dinner) and the omnipresence of a full household of staff rather stressful. The duchess is also still getting used to royal protocol, and a recent revision to the Order of Precedence, a document which outlines royal etiquette and protocol, was circulated to assist her. The “rules” were last revised when Camilla married Charles, and it is understood the Queen wanted them to be updated following Kate’s entry into “the Firm,” as the royal family refers to itself. According to protocol, if William is not present Kate is expected to curtsy to all senior members of the family, including blood princesses Beatrice and Eugenie, and she is always expected to curtsy to Camilla and the Prince of Wales. While the antiquated guidelines are not always adhered to, the Queen believes they are fundamental to the underpinning of the family, and Kate always ensures that she curtsies to the Queen and the Duke of Edinburgh. Apparently in private she is close enough to Camilla that there is no need to curtsy, nor does she defer to William’s cousins unless it is required at a formal occasion, according to one family member.\n\nWhile Kate is keen to cut her teeth as a working royal, William has told aides not to overbook the couple’s diaries. The Queen promised the couple a two-year grace period from public life after the wedding so that they could enjoy the early years of their newly married life, just as she and Prince Philip did when he was serving as a naval officer in Malta. Since the summer of 2010, William and Kate have lived on the Welsh island of Anglesey, in a rented five-bedroom farmhouse close to R.A.F. Valley where William is serving as a search-and-rescue pilot with the Royal Air Force. The place is surrounded by thick woodland and is a short walk from the beach, where the couple walk their new cocker-spaniel puppy, Lupo. “It’s all very normal. The last time I went round, William was pottering around making tea and toast, very chilled and relaxed,” says one of their friends. When they do venture out, the locals are incredibly protective of them. “People around here have taken them to their hearts. You won’t catch anyone tweeting gossip about them as they go about their day-to-day business,” says Jack Abbott, chairman of the Trearddur Bay R.N.L.I. lifeboat station, where the couple carried out one of their first joint engagements.", "images": ["https://media.vanityfair.com/photos/68fa686659389b4cea701e19/4:3/w_1200%2Cc_limit/undefined", "https://media.vanityfair.com/photos/690e55b2c48e51f42566b396/4:3/w_1200%2Cc_limit/undefined", "https://media.vanityfair.com/photos/54ca93f651062027081e57d9/master/w_1600%2Cc_limit/image.jpg", "https://media.vanityfair.com/photos/54ca93f651062027081e57d7/16:9/w_1280,c_limit/image.jpg", "https://media.vanityfair.com/photos/691cd91f9f3eb60315ac3531/4:3/w_1200%2Cc_limit/undefined", "https://media.vanityfair.com/photos/57d1e95850198fb52857665c/4:3/w_1200%2Cc_limit/kate-middleton-name-question-christopher-wahl.jpg", "https://media.vanityfair.com/photos/62fe7ae3f9f2d6c81700a52c/1:1/w_90%2Cc_limit/undefined", "https://media.vanityfair.com/photos/691388cbb0b7e0bbf578f04e/4:3/w_1200%2Cc_limit/undefined", "https://media.vanityfair.com/photos/690e0b6136f4223ffe5015ef/4:3/w_1200%2Cc_limit/undefined", "https://media.vanityfair.com/photos/690a5ee0da787343f1849201/4:3/w_1200%2Cc_limit/undefined", "https://media.vanityfair.com/photos/69163ff8fd759a5ca922c157/4:3/w_1200%2Cc_limit/undefined", "https://www.vanityfair.com/verso/static/vanityfair-global/assets/VF_Logo_Footer.svg", "https://media.vanityfair.com/photos/6903bca7d353cca0e86410a6/4:3/w_1200%2Cc_limit/undefined", "https://media.vanityfair.com/photos/690a2457c9b01443eb632273/4:3/w_1200%2Cc_limit/undefined", "https://media.vanityfair.com/photos/690bcf4cd862d6f327955a94/4:3/w_1200%2Cc_limit/undefined", "https://www.vanityfair.com/verso/static/vanityfair-global/assets/VF_Logo_Inverted_Header.svg", "https://media.vanityfair.com/photos/691b63b86201973f77db4e40/4:3/w_1200%2Cc_limit/undefined"], "top_img": "https://media.vanityfair.com/photos/54ca93f651062027081e57d7/16:9/w_1280,c_limit/image.jpg", "keywords": [], "authors": ["Katie Nicholl"], "canonical_link": "https://www.vanityfair.com/style/2012/09/kate-middletons-married-life-house-facials", "title": "Inside Kate Middleton’s Domestic Life: The House, the Facials, the Roast-Chicken Recipe", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "width=device-width, initial-scale=1", "author": "Katie Nicholl", "copyright": "Copyright (c) Condé Nast 2025", "description": "Just one after her wedding, the Duchess of Cambridge already seems to the palace born. That—and her impeccable fashion choices—explains why all eyes are on Kate, reports Katie Nicholl.", "id": "54cb00cf674871890b583139", "keywords": "kate middleton,magazine,archive,society,prince william,september 2012 issue", "news_keywords": "kate middleton,magazine,archive,society,prince william,september 2012 issue", "robots": "index, follow, noarchive, max-image-preview:large", "content-type": "article", "parsely-post-id": "54cb00cf674871890b583139", "parsely-metadata": "{\"description\":\"Just one after her wedding, the Duchess of Cambridge already seems to the palace born. That—and her impeccable fashion choices—explains why all eyes are on Kate, reports Katie Nicholl.\",\"image-16-9\":\"https://media.vanityfair.com/photos/54ca93f651062027081e57d7/16:9/w_1000,c_limit/image.jpg\",\"image-1-1\":\"https://media.vanityfair.com/photos/54ca93f651062027081e57d7/1:1/w_1000,c_limit/image.jpg\"}", "og": {"description": "Just more than a year after her wedding, the Duchess of Cambridge already seems to the palace born. That—and her impeccable fashion choices—explains why all eyes are on Kate, reports Katie Nicholl.", "image": "https://media.vanityfair.com/photos/54ca93f651062027081e57d7/16:9/w_1280,c_limit/image.jpg", "site_name": "Vanity Fair", "title": "Inside Kate Middleton’s Domestic Life: The House, the Facials, the Roast-Chicken Recipe", "type": "article", "url": "https://www.vanityfair.com/style/2012/09/kate-middletons-married-life-house-facials"}, "article": {"content_tier": "free", "opinion": "false", "section": "tags", "published_time": "2012-08-20T04:47:00.000Z", "modified_time": "2012-08-20T04:47:00.000Z", "author": "Katie Nicholl"}, "twitter": {"card": "summary_large_image", "creator": "@VanityFair", "description": "Just more than a year after her wedding, the Duchess of Cambridge already seems to the palace born. That—and her impeccable fashion choices—explains why all eyes are on Kate, reports Katie Nicholl.", "domain": "https://www.vanityfair.com", "image": "https://media.vanityfair.com/photos/54ca93f651062027081e57d7/16:9/w_1280,c_limit/image.jpg?mbid=social_retweet", "site": "@VanityFair", "title": "Inside Kate Middleton’s Domestic Life: The House, the Facials, the Roast-Chicken Recipe"}, "pinterest": {"image": "https://media.vanityfair.com/photos/54ca93f651062027081e57d7/2:3/w_1000,h_1500,c_limit/image.jpg"}, "fb": {"app_id": 256281040558, "pages": 8810407571}, "google": "nopagereadaloud", "google-signin-client_id": "1065629119444-svrqo31taikd2j0ji4dgjs9q3vul4133.apps.googleusercontent.com"}, "movies": [], "publish_date": 1345438020.0, "source": "https://www.vanityfair.com", "summary": ""}