{"url": "https://www.brides.com/story/2017-wedding-trend-predictions", "text": "Whether you shop together or leave it in the hands of a soon-to-be spouse, an engagement ring should last a lifetime. But, after two years of wedding and proposal postponements, couples are eschewing tradition and going with their gut when it comes to design details—and that includes wedding jewelry. Expect to see grandiose styles not only in rings but all bridal-related trends.\n\n\"In 2022, we are going to see a mix of trends with engagement rings as we know there is no one size fits all when shopping for a ring that exemplifies a love a person shares with their partner,\" Katie Zimmerman, Chief Merchandising Officer at Blue Nile tells Brides.\n\nWe spoke with the experts to find out which ring styles are forecasted to be the biggest in 2022. Scroll on for the top nine engagement ring trends you'll be dying to get your hands on (or get on your finger).\n\nToi Et Moi\n\nWe've seen a huge uptick in celebrity multi-stone engagement rings recently—Megan Fox, Ariana Grande, Emily Ratajkowski—and you can fully anticipate the style sticking around in 2022. Zimmerman says double (and even triple!) stone rings will be popular, as well as unique combinations of stones and gems (think Fox's accompanying emerald or Grande's pearl).\n\n\"Specifically the double stone visually showcases the coming together of two people as a couple,\" she explains. \"We’ve increasingly seen people choose unique diamonds and gemstones to further elaborate on the love story that is being told with the two gemstones.\"\n\nKathryn Money, Senior Vice President of Merchandising and Retail at Brilliant Earth, tells us that the timeless symbolism of the Toi Et Moi design is part of the appeal. \"While it might feel like a modern and unique trend, it's actually a style of engagement ring that has been around for centuries,\" she says. \"The beauty of a Toi Et Moi engagement ring lies not just in the symbolism of togetherness, but also in how the stones paired together can accentuate the other's beauty.\"\n\nAnd while the three-stone ring has also been around for quite some time, Zimmerman tells us it's experiencing a bit of a resurgence lately. \"It’s said that the three stones represent the past, present, and future for a couple as they journey through the different stages of a relationship.\"\n\nLogan Hollowell, jewelry designer and founder of her eponymous jewelry brand, adds that multi-stone rings allow for creativity. \"We’re also living in a cultural moment that values distinctiveness and artistic expression, and the Toi et Moi rings exude individuality,\" she says.\n\nGender-Neutral Rings\n\nGender-neutral ring options have finally become more readily available. And it's only just beginning. Money says that simple, gender-fluid designs are going to continue gaining popularity in the coming year. And your favorite stars are leading the pack, like Bella Hadid, Dua Lipa, and Kylie Jenner opting for chunkier jewelry options this year.\n\n\"While dainty rings are still on-trend for engagement rings, we are seeing more women beginning to gravitate toward bolder, chunkier styles that are more traditionally associated with men’s fashion,\" explains Money.\n\nColorful Gemstones\n\nColored stones are having a moment, allowing couples to pick something bold and bright to represent their love story. Zimmerman notes that emerald, morganite, and sapphire are particularly popular options this year.\n\n\"Colored engagement rings and wedding accessories, like colored bridal gowns, have surged in demand recently, so it makes sense that the top purchased rings we saw last month were non-diamond stones,\" says Michela Griffin, Commercial Lead at commerce shopping payment app Klarna. And according to Griffin, the app shows emerald stone rings increased by 115% in December 2021 alone, setting up 2022 as the year of the gemstone.\n\nVintage Nostalgia\n\nBlue Nile\n\nIn the same way that thrifting and vintage finds have taken over the fashion industry, antique engagement rings are at the forefront of the industry. Finding a one-of-a-kind, heirloom piece can be really special, but you can still have the same style while staying true to yourself with vintage-inspired rings. \"They offer an emotional connection to a special person like a grandmother, mother, or aunt but with the ability to make it their own while still having sentimental value,\" notes Zimmerman.\n\nAdding a different band, diamond shape, or cut is a way to update a timeless style while crafting techniques like milgrain, hand engraving, draping, and filagree designs will add vintage components to your sparkler, says Zimmerman. \"Vintage inspired rings are all about creating your own personal style while still adding sentimental value to your engagement rings,\" says Zimmerman.\n\nTraditional cushion cuts are even making a comeback according to Klarna, who found that the vintage style saw a 118% purchase increase late last year, according to Griffin. \"Cushion Cut engagement rings have always been a safe and timeless choice amongst brides-to-be, so it’s no surprise that these styles are trending ahead of other classic staples,\" says Griffin.\n\nContoured Stacks\n\nLogan Hollowell / Blue Nile / Brilliant Earth\n\nAnother ring trend that has taken over the industry is stacked styles. The design allows each customer to get creative with shapes and combos. Plus, a stacked set can help highlight an existing piece. \"The stacked and nested wedding styles are a way to uniquely highlight the center gem and make a statement,\" says Money.\n\nBrilliant Earth has even curated a collection that is specifically designed to mix, match, and stack for the perfect finger full of jewels.\n\nOval Shapes\n\nOval-shaped diamonds have seen a boom in popularity and will only continue to gain momentum in 2022. According to Zimmerman, an oval's soft, oblong shape draws attention to the hand and lengthens the appearance of the fingers. \"The diamond can speak for itself or can be elevated further with additional stones or decorated band.\"\n\nHollowell also predicts that solitaire ovals are making a comeback. \"They are very flirty and feminine stones while keeping an essence of [timelessness],\" she tells Brides.\n\nAnd if celebrity engagements are any indication, ovals are here to stay. To All the Boys I've Loved Before star Lana Condor debuted a stunning oval rock set in a yellow gold band within the first month of the year.\n\n\n\nBig and Blingy\n\nJared / Kay Jewelers\n\nBigger really is better—at least, when referring to 2022 engagement ring trends. Soon-to-be-married couples are craving grand, over-the-top designs. Think: bold shapes, large diamonds, and halo cuts. In fact, Klarna found that there was a 127% increase in halo cut ring purchases, according to Griffin.\n\nBlack Ice\n\nAnna Sheffield / David Yurman / Reeds\n\nCouples are looking to break the mold this year and opt for one-of-a kind settings. Enter black-stone engagement rings—according to Griffin, Klarna shows that they've seen a 47% increase in purchases in January. And if you recall, Carrie Bradshaw (the fashion queen herself) owns a black diamond ring. The reboot recently aired, and just like that ... black-stone rings have seen an uptick.\n\n\"Black Diamond engagement rings may have had a big moment in the first month of the year,\" says Griffin. \"During the extremely anticipated Sex and the City reboot, And Just Like That, fans were reminded of Carrie Bradshaw and Big’s decades-long romance, which left viewers longing for another glimpse at the rare Black Diamond ring that Big gifted Carrie in the last SATC movie.\"\n\n\n\nSurprise Diamonds Details\n\nBrilliant Earth\n\nAccording to Money, you can expect to see more and more rings with bonus stones, like hidden halos and accented galleries.\n\n\"This unique trend offering diamonds crafted beneath the ring’s center gemstone is intended to add extra sparkle and unique personalization to otherwise understated styles,\" she tells us. \"These hidden accents are often paired with solitaire styles and are timeless modern classics with a twist and a personalized touch.\"\n\n", "images": ["https://www.brides.com/thmb/tfi-hA2KBhvnIccOvhyiqZ0LB3g=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/cathedral-setting-4869812_sculpted_crescent_tacori_V3-e32d029035a44560876fabdb8e331628.png", "https://www.brides.com/thmb/EeqMSTIL0zbbVXm7wgAmfTZy1b0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/anna-f34ec1b6fb6b4dc184569623ead63873.png", "https://www.brides.com/thmb/QmNmGEIx-ahZo0BGqYPk-i-poqM=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/recirc_05-sleep-9dd4a5faa0104caca6b481d5b0f4e817.jpg", "https://www.brides.com/thmb/rsAVixJDDLU6mhh4gLRXAb95qLA=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/woman-sells-engagement-ring-recirc-getty-1-10-b1d58f0066504b99b8f12cfc090d9d30.jpg", "https://www.brides.com/thmb/dItdVUOEz2TrqxJ6TluZ7crFbsA=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/wedding-ring-rash-engagement-ring-lance-nicoll-recirc-1123-dcc475aa003f4ed994dd052d7c02798d.jpg", "https://www.brides.com/thmb/wHkvqo2DJd5nGptR-SevyDwj9Rs=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/engagement-ring-wedding-ring-set-logan-cole-primary-1024-dfaffc1aaa45450cad997ef7998f34de.jpg", "https://www.brides.com/thmb/D2WULu3-LB5rX2TVwh4NvZj7hKM=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/recirc_01-gemstone-072ffe178e554e70bb4af0c86b26cb94.jpg", "https://www.brides.com/thmb/A5F9hZstmtSc9TeXx4LeCSz5uO4=/200x200/filters:no_upscale():max_bytes(150000):strip_icc()/headshot1-1726354bd1dd433b821411df1feb205a.JPG", "https://www.brides.com/thmb/2Mc6T9l9ERrwwHrcEQ_Boyz2ejk=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/recirc_04-custom-9c73b79b726e4d6a8d8c7cc0f43706a4.jpg", "https://www.brides.com/thmb/fN8460SqP--WEYGo3TWSMIBcG7U=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/black-engagement-rings_rare_earth_V2-5d4308849dcd460e866347ecb9bbc9be.png", "https://www.brides.com/thmb/nnVwJAVbR9BQW0nCzoftPsk7-kA=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/CladdaghRing-ebad180b19f141abacfbdf7b82cb4fe9.jpg", "https://www.brides.com/thmb/lcG8c3KWgjoPRBdJA7nd3nkQ9ww=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/vintage-engagement-ring-recirc-sasithon-4-14-48d5bacbf25045d2b14d5a1ad157c01d.jpg", "https://www.brides.com/thmb/nf9cPbOQsM4H2GV62mtu6TKQR1o=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/beyonce-a7e0f72da8fe4ad39ecb8a0e01ab80a9.jpg", "https://www.brides.com/thmb/3z8cvYnIQCN6Wdw0xm5y4YUkXYU=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/Indhira-Jason-Wedding-9sq-91942e0d504d48b58a62c11de041b450.jpg", "https://www.brides.com/thmb/t1KogWErQngA1xUkWF5Gt_cujHQ=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/01-Promise-Ring-Getty-Images-2c307f0fe3fe4987b38c7b97afa93e7b.jpg", "https://www.brides.com/thmb/RXTExioEzTTZtq0skV-8R-eV1Ps=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/recirc_05-insurance-bc4059ba23624f5998c1a2ffa5b474c4.jpg", "https://www.brides.com/thmb/urCOuAJ6QJLY3CsZNFVLzgviErk=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/01-Types-of-Rings-Remi-Dupac-f2088e10068141d581bf4b4ccc90d2dd.jpg", "https://www.brides.com/thmb/GUzI0yzre9Hxj1aac7MON1DQNEw=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/recirc_04-questions-7a2ce9acdb834d8ea2743bc1b5ad20fb.jpg"], "top_img": "https://www.brides.com/thmb/EeqMSTIL0zbbVXm7wgAmfTZy1b0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/anna-f34ec1b6fb6b4dc184569623ead63873.png", "keywords": [], "authors": ["Tess Petak", "Tess Petak Has Written For Brides Since Her Work Has Also Appeared In Instyle Magazine", "On Instyle.Com.", "Brides'S Editorial Guidelines"], "canonical_link": "https://www.brides.com/story/engagement-ring-trends", "title": "The 9 Engagement Ring Trends You Need to Know for 2022", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "These engagement ring trends will put you ahead of the style game for your engagement next year, according to ring experts.", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "BRIDES", "sailthru.author": "Tess Petak", "sailthru.tags": "rings,rings", "parsely-section": "Rings", "parsely-tags": "Brides,Rings,Engagement Rings", "article": {"section": "Brides"}, "og": {"type": "article", "site_name": "Brides", "url": "https://www.brides.com/story/engagement-ring-trends", "title": "The 9 Engagement Ring Trends You Need to Know for 2022", "description": "These engagement ring trends will put you ahead of the style game for your engagement next year, according to ring experts.", "image": "https://www.brides.com/thmb/EeqMSTIL0zbbVXm7wgAmfTZy1b0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/anna-f34ec1b6fb6b4dc184569623ead63873.png"}, "twitter": {"card": "summary", "site": "@Brides", "title": "The 9 Engagement Ring Trends You Need to Know for 2022", "description": "These engagement ring trends will put you ahead of the style game for your engagement next year, according to ring experts.", "image": "https://www.brides.com/thmb/EeqMSTIL0zbbVXm7wgAmfTZy1b0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/anna-f34ec1b6fb6b4dc184569623ead63873.png"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.129.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.129.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.129.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.129.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.129.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://www.brides.com", "summary": ""}