{"url": "www.huffingtonpost.com/2013/11/05/melissa-joan-hart-republicans-hollywood_n_4218426.html", "text": "NEW YORK, NY - SEPTEMBER 26: Actress Melissa Joan Hart attends 2013 Women Making A Difference Awards at Hearst Tower on September 26, 2013 in New York City. (Photo by Desiree Navarro/WireImage)\n\nMelissa Joan Hart might have once raised eyebrows for voting Republican, but the actress says she's far from the only conservative in Hollywood.\n\nFox News spoke with the former child star this week and broached the subject of her political stance. The interview recounted the time Hart said her \"Sabrina the Teenage Witch\" costars were shocked to learn she voted for Bob Dole over Bill Clinton during the 1996 presidential election.\n\nAdvertisement\n\n\"Yeah there were some jaws dropping on the set that day,\" Hart, who was 20 at the time of that election, told Fox in an interview published Tuesday. \"These days I find more [Republicans] in Hollywood and I love having a healthy debate with anyone. Nobody's one way or the other. I feel that unfortunately in this country there are only two parties. I wish there were more because nobody fits into one or the other.\"\n\nWhen asked how things have changed politically in the industry during the last 20 years, Hart responded: \"There's definitely been some fellowship, which is nice. On 'Sabrina' when that happened I was pulled aside by the Republicans on the set. I was able to discuss it in a safe environment. These days I'm pretty much surrounded by Republicans at work. It's made it a little easier but I love talking to my Democrat friends about how they see things.\"\n\nShortly after the election last year, Hart told Fox's Sean Hannity that she \"learned a lesson\" the day she voted for Dole.\n\nAdvertisement\n\n\"It schooled me in the fact that you just don't talk about politics in Hollywood, and most people don't think the way you do,\" she said. \"But, I quickly found out kind of behind the scenes that a lot of people do feel that way. A lot of people do vote Republican ... but they're afraid to say it ... It is sort of like a blacklist. It's a little scary.\"\n\nHart has long been forthright about her support of the Republican party, but that didn't sit well with some last November during the 2012 election.\n\nStories That Inspire You Your Support Fuels Our Mission Your Support Fuels Our Mission Become a Member Today As the year ends, our reporting does not slow down. Support the journalists who continue asking questions and telling stories with depth and care. Your membership today helps ensure we start the new year strong. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. Support HuffPost Already a member? Log in to hide these messages.\n\nThe actress recently sat down with HuffPost Live and discussed the stir she caused after announcing on Twitter that she was voting for Republican presidential candidate Mitt Romney.\n\nAdvertisement\n\n\"I got called every name in the book,\" Hart said. \"[People wrote] that they hope I die, and that they hope my children are gay, which is somehow supposed to be some sort of punishment. [...] The hate was really unbelievable just from that simple tweet. Just by saying I was voting.\"\n\nHart has been making the media rounds recently promoting her book, \"Melissa Explains It All: Tales From My Abnormally Normal Life.\"\n\nCelebrate Truth This Season Your Support Fuels Our Mission Your Support Fuels Our Mission The holidays can get loud. But some stories cut through the noise -- the ones that make sense of the chaos and hold power to account. Support the newsroom built on clarity, accountability, and a healthy dose of reality. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. “Our fierce, independent reporting and unvarnished perspective hold power to account and inform millions of readers. Please support this hard-hitting journalism.” Monthly Annually SAVE 16% Support $5/month (about $0.17/day) Silver Huffposter 🤍 Monthly recurring supporter-only email\n\nFewer requests for financial support Support $10/month (about $0.33/day) Gold Everything in the Silver Tier\n\nAd-free access on the HuffPost website OR HuffPost apps\n\nSay goodbye to annoying video interruptions while you read. No more autoplay videos. Support $20/month (about $0.67/day) Platinum HuffPoster 🏆 Everything in the Gold Tier\n\nAd-free access on the HuffPost website AND HuffPost apps\n\nEarly access to new features\n\nMembership to Platinum Club focus group Make a One Time Contribution Support HuffPost Already a member? Log in to hide these messages.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "https://img.huffingtonpost.com/asset/default-entry.jpg?ops=1200_630", "https://img.huffingtonpost.com/asset/56bfc27e180000670080beb4.jpg?ops=100_100", "https://img.huffingtonpost.com/asset/691c87541700009d2b9c5f37.jpg?ops=50_50", "https://img.huffingtonpost.com/asset/5bb43f54200000e5000064bd.jpeg?ops=scalefit_720_noupscale"], "top_img": "https://img.huffingtonpost.com/asset/default-entry.jpg?ops=1200_630", "keywords": [], "authors": ["Deputy Director Of News", "Analytics", "Whitney Snyder", "Editor-In-Chief Huffpost"], "canonical_link": "https://www.huffpost.com/entry/melissa-joan-hart-republicans-hollywood_n_4218426", "title": "Melissa Joan Hart: 'These Days I Find More Republicans In Hollywood'", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "Melissa Joan Hart: 'These Days I Find More Republicans In Hollywood'", "keywords": "entertainment,melissa joan hart", "fb": {"app_id": 46744042133}, "og": {"title": "Melissa Joan Hart: 'These Days I Find More Republicans In Hollywood'", "type": "article", "image": {"identifier": "https://img.huffingtonpost.com/asset/default-entry.jpg?ops=1200_630", "url": "https://img.huffingtonpost.com/asset/default-entry.jpg?ops=1200_630", "type": "image/jpeg", "width": 1200, "height": 630}, "url": "https://www.huffpost.com/entry/melissa-joan-hart-republicans-hollywood_n_4218426", "site_name": "HuffPost", "locale": "en_US", "description": "Melissa Joan Hart: 'These Days I Find More Republicans In Hollywood'"}, "article": {"tag": "entertainment,melissa joan hart", "section": "Entertainment", "published_time": "2013-11-05T15:16:33Z", "modified_time": "2013-11-05T15:16:33Z"}, "twitter": {"card": "summary_large_image", "site": "@HuffPostEnt", "title": "Melissa Joan Hart: 'These Days I Find More Republicans In Hollywood'", "image": {"identifier": "https://img.huffingtonpost.com/asset/default-entry.jpg?ops=1200_630", "width": 1200, "height": 630}, "description": "Melissa Joan Hart: 'These Days I Find More Republicans In Hollywood'"}, "al": {"ios": {"url": "huffpostnews:///?editionID=us&entryID=us_5bb43f54e4b066f8d256f18b", "app_store_id": 306621789, "app_name": "HuffPost"}}, "bingbot": "noarchive", "robots": "max-snippet:-1,max-image-preview:large,max-video-preview:-1", "google-site-verification": "97Mj-wW7u8U1NOnkW1rfH-I1kgO0-a9YsgoesOk41R8"}, "movies": [], "publish_date": 1383627600.0, "source": "http://www.huffingtonpost.com", "summary": ""}