{"url": "https://www.huffingtonpost.com/entry/jesse-williams-nfl-national-anthem-scam_us_59c8fe84e4b0cdc77332a9ea", "text": "Jesse Williams spoke out against President Donald Trump’s remarks regarding National Football League players who choose to kneel in protest during the singing of the national anthem. The actor also questioned the necessity for pageantry in sports at all.\n\nDuring a speech in Alabama Friday to campaign for Sen. Luther Strange, Trump said people should boycott the NFL over protests like those demonstrated by former San Francisco 49ers quarterback Colin Kaepernick, who took a knee during the national anthem before games last year to protest police brutality and racial injustices.\n\nAdvertisement\n\n“Wouldn’t you love to see one of these NFL owners, when somebody disrespects our flag, to say, ‘Get that son of a bitch off the field right now, he’s fired’?” Trump asked.\n\nAfter a weekend of widespread backlash from NFL players aimed at Trump, Williams sat down with MSNBC and questioned why the anthem is even included in games.\n\nThe actor called Trump “a very horrible, a guy who thinks he’s a dictator, who treats America like it’s a game show.”\n\nAdvertisement\n\n“It’s also important to realize this anthem thing is a scam,” Williams said. “This is not actually part of football. This was invented in 2009 from the government paying the NFL to market military recruitment to get more people to go off and fight wars to die.”\n\n“This has nothing to do with [the] NFL, or American pastime, or tradition,” Williams continued. “This is to get boys and girls to go fly overseas and go kill people. They’re marketing. They’re pumping millions and millions of dollars into the NFL to get us to put on a pageant in front of the NFL football games to get you to go off and fight.”\n\nAdvertisement\n\n“This not only betrays the sentiment and trust of fans, but casts an unfortunate shadow over the genuine patriotic partnerships that do so much for our troops,” the congressional report stated.\n\nAs for the NFL specifically, players were not required to be on the field during the anthem until 2009, per a Vice report.\n\nStories That Inspire You Your Support Fuels Our Mission Your Support Fuels Our Mission Become a Member Today As the year ends, our reporting does not slow down. Support the journalists who continue asking questions and telling stories with depth and care. Your membership today helps ensure we start the new year strong. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. Support HuffPost Already a member? Log in to hide these messages.\n\n“As you know, the NFL has a long tradition of patriotism,” NFL spokesman Brian McCarthy said back in August, confirming that the practice of players being on the field began eight years ago. “Players are encouraged but not required to stand for the anthem.”\n\nAdvertisement\n\nWilliams reiterated his message on Instagram, offering his support to Kaepernick and others taking a knee.\n\nA post shared by jesse Williams (@ijessewilliams) on Sep 24, 2017 at 5:54pm PDT\n\nCelebrate Truth This Season Your Support Fuels Our Mission Your Support Fuels Our Mission The holidays can get loud. But some stories cut through the noise -- the ones that make sense of the chaos and hold power to account. Support the newsroom built on clarity, accountability, and a healthy dose of reality. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. “Our fierce, independent reporting and unvarnished perspective hold power to account and inform millions of readers. Please support this hard-hitting journalism.” Monthly Annually SAVE 16% Support $5/month (about $0.17/day) Silver Huffposter 🤍 Monthly recurring supporter-only email\n\nFewer requests for financial support Support $10/month (about $0.33/day) Gold Everything in the Silver Tier\n\nAd-free access on the HuffPost website OR HuffPost apps\n\nSay goodbye to annoying video interruptions while you read. No more autoplay videos. Support $20/month (about $0.67/day) Platinum HuffPoster 🏆 Everything in the Gold Tier\n\nAd-free access on the HuffPost website AND HuffPost apps\n\nEarly access to new features\n\nMembership to Platinum Club focus group Make a One Time Contribution Support HuffPost Already a member? Log in to hide these messages.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "https://img.huffingtonpost.com/asset/59c7b7ff1d00002900e728e6.png?ops=210_120", "https://img.huffingtonpost.com/asset/59c8c50e19000099555656e6.png?cache=1oPvAYbLTP&ops=210_120", "https://img.huffingtonpost.com/asset/59c69c9c1d00002900e727d4.jpeg?cache=eWmoDqI7Au&ops=210_120", "https://img.huffingtonpost.com/asset/56bfc27e180000670080beb4.jpg?ops=100_100", "https://img.huffingtonpost.com/asset/691c87541700009d2b9c5f37.jpg?ops=50_50", "https://img.huffingtonpost.com/asset/59c8ffbb1a00002650f085a0.png?cache=07HzcTMhk7&ops=1200_630"], "top_img": "https://img.huffingtonpost.com/asset/59c8ffbb1a00002650f085a0.png?cache=07HzcTMhk7&ops=1200_630", "keywords": [], "authors": ["Deputy Director Of News", "Analytics", "Whitney Snyder", "Editor-In-Chief Huffpost"], "canonical_link": "https://www.huffpost.com/entry/jesse-williams-nfl-national-anthem-scam_n_59c8fe84e4b0cdc77332a9ea", "title": "Jesse Williams: NFL National Anthem Is 'A Scam' To Boost Military Recruitment", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "The actor spoke to MSNBC after a weekend of backlash against President Trump's NFL protest remarks.", "keywords": "Donald Trump,NFL,Football,News and Politics,jesse williams", "fb": {"app_id": 46744042133}, "og": {"title": "Jesse Williams: NFL National Anthem Is 'A Scam' To Boost Military Recruitment", "type": "article", "image": {"identifier": "https://img.huffingtonpost.com/asset/59c8ffbb1a00002650f085a0.png?cache=07HzcTMhk7&ops=1200_630", "url": "https://img.huffingtonpost.com/asset/59c8ffbb1a00002650f085a0.png?cache=07HzcTMhk7&ops=1200_630", "type": "image/png", "width": 1200, "height": 630}, "url": "https://www.huffpost.com/entry/jesse-williams-nfl-national-anthem-scam_n_59c8fe84e4b0cdc77332a9ea", "site_name": "HuffPost", "locale": "en_US", "description": "The actor spoke to MSNBC after a weekend of backlash against President Trump's NFL protest remarks."}, "article": {"tag": "Donald Trump,NFL,Football,News and Politics,jesse williams", "section": "Entertainment", "published_time": "2017-09-25T14:14:16Z", "modified_time": "2017-09-25T14:52:50Z"}, "twitter": {"card": "summary_large_image", "site": "@HuffPostEnt", "title": "Jesse Williams: NFL National Anthem Is 'A Scam' To Boost Military Recruitment", "image": {"identifier": "https://img.huffingtonpost.com/asset/59c8ffbb1a00002650f085a0.png?cache=07HzcTMhk7&ops=1200_630", "width": 1200, "height": 630}, "description": "The actor spoke to MSNBC after a weekend of backlash against President Trump's NFL protest remarks."}, "al": {"ios": {"url": "huffpostnews:///?editionID=us&entryID=us_59c8fe84e4b0cdc77332a9ea", "app_store_id": 306621789, "app_name": "HuffPost"}}, "bingbot": "noarchive", "robots": "max-snippet:-1,max-image-preview:large,max-video-preview:-1", "google-site-verification": "97Mj-wW7u8U1NOnkW1rfH-I1kgO0-a9YsgoesOk41R8"}, "movies": ["https://www.youtube.com/embed/7wwTAo01AKs?rel=0&showinfo=0&enablejsapi=1"], "publish_date": 1506348856.0, "source": "https://www.huffingtonpost.com", "summary": ""}