{"url": "https://www.brides.com/story/chrissy-teigen-and-john-legend-are-having-the-best-time-at-the-grammys", "text": "With John Legend being a decorated musician, it's no surprise his romance with wife Chrissy Teigen began on the set of a 2006 music video. In the years since, the famous duo has gone on to star in two more music videos together (Chrissy is undoubtedly John's muse!), host an envious wedding in Lake Como and welcome two children together—with another currently on the way! From their first red carpet appearance to their latest pregnancy announcement, here's everything you need to know about Chrissy Teigen and John Legend's relationship.\n\nJohn Legend and Chrissy Teigen first met on the set of his music video in 2006.\n\nThe singer proposed to the model in December 2011 while vacationing in the Maldives.\n\nThe couple married on September 14, 2013 in Lake Como, Italy.\n\nSince their wedding, John and Chrissy have welcomed three children—Luna, Miles, and Esti Stephens. On September 30, 2020, the couple revealed they endured a devastating miscarriage.\n\nSeptember 14, 2006: Music Video Romance\n\nJohn Legend and Chrissy Teigen's romantic connection was instant when they met on the set of John's music video for his single, \"Stereo,\" in 2006. \"We did the music video, we were together for like 12 hours,\" Teigen recalled to Wendy Williams in 2014. \"We spent the entire day together, me in my underwear and him in a full suit, and I went to go say goodbye to him, to his hotel and we didn't ever say goodbye that night.\"\n\n2007: A One-Day Break-Up\n\nThe pair broke up briefly in 2007, but their time apart only lasted a few hours (John claims it was even less than that!). \"He was feeling really bummed and stressed out. He was like, ‘I can’t be in a relationship right now,'\" Chrissy recalled to Cosmopolitan in 2016. \"It was the stress of him having to maybe cancel a show, and he had never been in a real relationship—or so he says now.\"\n\n2007: First Vacation to Italy\n\nAfter their very brief time apart, Chrissy and John took their first vacation to Lake Como, Italy—a place that would soon become very special to the couple. \"A boat tour guide took us to a little spot on the lake and told us to make a wish. I asked for this to be the man I marry and have children with,\" Chrissy revealed in an Instagram post nine years later. Lucky for her, both would eventually come true!\n\nGetty Images\n\nFebruary 10, 2008: Red Carpet Debut at the Grammy's\n\nThe couple walked what is now the first of many red carpets at the 50th annual Grammy Awards in 2008.\n\nDecember 2011: The Marriage Proposal That Was Almost Ruined by Security\n\nJohn proposed to Chrissy during a Christmas holiday in the Maldives in 2011, however, his grand plans were nearly spoiled before the pair even caught their flight (and the pair even got in an argument before heading to the airport). \"[The ring] was in my carry-on bag going through airport security, and security wanted to look through my bag and they wanted to look in that particular box,” said John during a 2013 appearance on Oprah’s Next Chapter. “And Chrissy was standing right next to me and I was, like, ‘Oh, my God. I’ve hid it so well this whole time. Now as we’re just about to get to the Maldives she’s going to find out I have a ring in this box and it’s going to ruin the surprise and I’ll have to get on my knees in the airport.'”\n\nAs for how the actual proposal went down? \"This waiter comes out with a silver dome for dessert…So he opens up the dome and a ton of arugula falls out and then I kind of fish in it…And I see the little box and then you know, your heart stops and you get so excited. There was no big grand speech or anything. I think it was just very lovely and sweet,\" she shared on an episode of FABLife.\n\nGetty Images\n\nSeptember 10, 2013: A Courthouse Wedding\n\nAfter attending Vera Wang's New York Fashion Week runway show in 2013 (pictured above), the couple headed for the courthouse to make their marriage official—with model Irina Shayk as a witness. \"We are dumb and didn't realize that our Italian wedding would not be recognized unless we had a real ceremony in New York City,\" Chrissy told E! News at the time.\n\nSeptember 14, 2013: Traditional Wedding in Lake Como, Italy\n\nWith the marriage official in the United States, the couple flew to Lake Como, Italy for a lavish traditional wedding celebration. They tied the knot on September 14, 2013 at Villa Pizzo and the bride wore three custom Vera Wang gowns on the big day (a strapless ivory tulle ball gown, a strapless mermaid gown, and a crimson dress). A-list guests enjoyed a four-tiered carrot cake with cream cheese frosting for dessert and danced the night away with live performances from both the groom and Stevie Wonder.\n\nOctober 2, 2013: Love Song by Legend\n\nAlthough John's love song to Chrissy, \"All of Me,\" debuted in June 2013, the steamy music video for the hit track was released the month after their wedding. The black-and-white video featured John and Chrissy in all of their newlywed glory and was even shot in Lake Como.\n\nOctober 12, 2015: They're Expecting!\n\nTwo years after saying \"I do,\" the couple announced they were pregnant with their first child in a loving Instagram post. \"As many of you know, we've been trying to have a baby for a while now. It hasn't been easy, but we kept trying because we can't wait to bring our first child into the world and grow our family,\" she wrote on Instagram. \"We're so excited that it's finally happening. Thank you for all your love and well wishes. I look forward to all the belly touching!\"\n\nApril 14, 2016: Luna Stephens Is Born\n\nThe first child of Chrissy and John, Luna Simone Stephens was born on April 14, 2016.\n\nNovember 21, 2017: A Second Baby on the Way\n\nA year-and-a-half after welcoming their first daughter, the couple announced they were expecting their second child together. Of course, the parents recruited baby Luna to share the news with fans.\n\nMay 17, 2018: Miles Stephens Is Born\n\nChrissy and John welcomed their first son, Miles Theodore Stephens, on May 17, 2018. He has since proven to be a spitting image of his father, John!\n\nAugust 13, 2020: Expecting Baby Number Three!\n\nChrissy and John announced they are pregnant with their third child in John's music video for \"Wild.\" As the video comes to a close, the famous parents are seen playing with their two children followed by a shot of the couple cradling Chrissy's suspected baby bump! Chrissy confirmed fans' suspicions in a clip she shared via Twitter rubbing her belly.\n\nSeptember 30, 2020: A Heartbreaking Pregnancy Loss\n\nAfter being put on bedrest then hospitalized during her third pregnancy, Chrissy announced she had suffered a miscarriage due to pregnancy complications. The model got emotional with fans on Instagram, saying, \"We are shocked and in the kind of deep pain you only hear about, the kind of pain we’ve never felt before.\" She added, \"We are so grateful for the life we have, for our wonderful babies Luna and Miles, for all the amazing things we’ve been able to experience. But every day can’t be full of sunshine. On this darkest of days, we will grieve, we will cry our eyes out. But we will hug and love each other harder and get through it.\" While the couple typically waits to name their children until after they are born, Chrissy and John had begun to call their unborn son Jack.\n\nOctober 14, 2020: A Tribute to Chrissy\n\nAt the 2020 Billboard Music Awards, John Legend performed his new song \"Never Break.\" But before he began his performance on a grand piano, he announced, \"This is for Chrissy.\" Of course, the emotional tribute was made in the wake of the couple's devastating pregnancy loss, which the model announced to the public just two weeks earlier.\n\nAugust 3, 2022: Another Baby on the Way\n\nNearly two years after losing their third child, Jack, Chrissy shared the exciting news that she and John were expecting another baby. \"The last few years have been a blur of emotions to say the least, but joy has filled our home and hearts again. 1 billion shots later (in the leg lately, as u can see!) we have another on the way. Every appointment I’ve said to myself, 'Ok if it’s healthy today I’ll announce' but then I breathe a sigh of relief to hear a heartbeat and decide I’m just too nervous still. I don’t think I’ll ever walk out of an appointment with more excitement than nerves but so far, everything is perfect and beautiful and I’m feeling hopeful and amazing. Ok phew it’s been very hard keeping this in for so long!\" she wrote on Instagram.\n\nJanuary 13, 2023: Esti Maxine Is Born\n\nJohn and Chrissy welcomed a baby girl into their family on January 13, 2023. \"She’s here! Esti Maxine Stephens - the house is bustling and our family could not be happier 💕 Daddy sheds nightly tears of joy seeing Luna and Miles so full of love, and I am learning you still need diapers with a c section!? We are in bliss. Thank you for all the love and well wishes - we feel it all! X\" Chrissy wrote on Instagram.", "images": ["https://www.brides.com/thmb/a-HBqyz12G9Y6ehIMqtA8CC9Jh8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-79699789-618bf8a346ee4a79aa14d7872c8d09be.jpg", "https://www.brides.com/thmb/BA2NzZPNNv6z14dPLjMv1m9QKxs=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/taylor-swift-travis-kelce-recirc-waverly-inn-getty-images-3e164dc71e62422aa72d341254b4403a.jpg", "https://www.brides.com/thmb/O-r5kWoEuddijYB187YEvb9T_6E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-180218207-463867bd7598406198001d74e153cb88.jpg", "https://www.brides.com/thmb/Ia3RkT_PrOrLuneSrp4KjId8Z60=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/tom-holland-zendaya-red-carpet-getty-primary-1025-c070dcd16add48829e940334f37ea2c8.jpg", "https://www.brides.com/thmb/PMNR1dJqoaascbNmwELcifa3CWk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1127327658-0678edc4fda94395b3750c4f6103b68e.jpg", "https://www.brides.com/thmb/99pP21_jHCaAFWY-7qLDj-ZuOlI=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/selena-gomez-benny-blanco-recirc-getty-9-30-63e2d599988c4d6c958b6ef2beebec62.jpg", "https://www.brides.com/thmb/6iVA0oHBLo85brcN3UV6lESLrMI=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/judy-garland-recirc-getty-10-7-f9ec5b1c46a14a1daf2aa6ab118a609b.jpg", "https://www.brides.com/thmb/XCcxg_orZjp37rqYgIa9ixMiR3A=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/ririprimary-1eb76ffee280496a856776bc13e0453f.png", "https://www.brides.com/thmb/cloNlEWENp0rZ-Onk2SwCs8lxa0=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/saquon-barkley-anna-congdon-reicrc-getty-10-3-959d18cb46c44179ba8a729b9fd7b8d8.jpg", "https://www.brides.com/thmb/fdTJrXmlZH3ISoAn7-KNBsPNuIY=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/princess-beatrice-engagement-ring-recirc-getty-10-8-cb4e23a2c1e240c39f1cb8d1afde6653.jpg", "https://www.brides.com/thmb/DHvHZm1-TKm4EHny-7jJjfalnrc=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/millie-bobby-brown-jake-bongiovi-recirc-getty-10-6-6e8851200c9d49aa81206441544ff05c.jpg", "https://www.brides.com/thmb/PrmkwSkxVgBJzoy_7ARdlFEYARk=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/kristin-kyle-juszczyk-recirc-getty-10-2-2e19c8ed28874ecca97ae930da17237f.jpg", "https://www.brides.com/thmb/ruuBM8xwhKrwjxcpjxkXADuQ8jg=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/ryan-destiny-keith-powers-recirc-getty-10-6-cdc7aa8cddee4572b3bbdc4f083c995f.jpg", "https://www.brides.com/thmb/_pAVl4SYBzZi26jYKB1YmqeZ_I0=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/elizabeth-taylor-conrad-hilton-wedding-getty-primary-0925-0c944a3d3fbe4c93945ffa905e4bafa4.jpg", "https://www.brides.com/thmb/9y5aI7WuM6TV3x2j-ipn47NEzhI=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/100225-charles-marriages-recirc-28cf12a4bd5e434db595007c9b3498ec.jpg", "https://www.brides.com/thmb/tZqOPO3iFMFESomreLgDv6mIJtg=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/cbk-wedding-dress-recirc-getty-9-30-a71e3c0c67214cb9a5e658e1fdd74725.jpg", "https://www.brides.com/thmb/Lzw5NQ4bGwxOjE_XoZPcP4pFfZc=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/taylor-swift-recirc-getty-10-3-3c7ea50bb568420e904afd62d64341b9.jpg", "https://www.brides.com/thmb/QkAbKAlMOn724HSthIFxiG7G66k=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/will-and-kate-wedding-recirc-getty-7-9-88e66308dac143aea8668ec00892574f.jpg", "https://www.brides.com/thmb/2-Mu3y1VwfW2-tCEJTJHcQXnRLo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1205178827-a9515862023d40829aa6a0264dec2762.jpg", "https://www.brides.com/thmb/CpScQR7dZKa7dgURvBl7FdJNsP4=/200x200/filters:no_upscale():max_bytes(150000):strip_icc()/DSC03763-54bce324f1bd48f5af0910efb178cb7e.jpg", "https://www.brides.com/thmb/dtquhjd6pN79qdnKKe6mXVRV-90=/600x600/filters:no_upscale():max_bytes(150000):strip_icc()/goldie-hawn-kurt-russell-recirc-getty-10-7-ef4ed3fd779a45eb936ce7337796037b.jpg"], "top_img": "https://www.brides.com/thmb/2-Mu3y1VwfW2-tCEJTJHcQXnRLo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1205178827-a9515862023d40829aa6a0264dec2762.jpg", "keywords": [], "authors": ["Maggie Kreienberg", "Maggie Kreienberg Is An Editor At", "Brides'S Editorial Guidelines"], "canonical_link": "https://www.brides.com/john-legend-chrissy-teigen-relationship-timeline-4842391", "title": "Chrissy Teigen and John Legend's Relationship Timeline", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "From their Lake Como wedding to the birth of their children, here is a complete timeline of John Legend and Chrissy Teigen's relationship.", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "BRIDES", "sailthru.author": "Maggie Kreienberg", "sailthru.tags": "news,celebrity-and-royal-weddings", "parsely-section": "News", "parsely-tags": "Brides,News,Celebrity & Royal Weddings", "article": {"section": "Brides"}, "og": {"type": "article", "site_name": "Brides", "url": "https://www.brides.com/john-legend-chrissy-teigen-relationship-timeline-4842391", "title": "Chrissy Teigen and John Legend's Relationship Timeline", "description": "From their Lake Como wedding to the birth of their children, here is a complete timeline of John Legend and Chrissy Teigen's relationship.", "image": "https://www.brides.com/thmb/2-Mu3y1VwfW2-tCEJTJHcQXnRLo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1205178827-a9515862023d40829aa6a0264dec2762.jpg"}, "twitter": {"card": "summary", "site": "@Brides", "title": "Chrissy Teigen and John Legend's Relationship Timeline", "description": "From their Lake Como wedding to the birth of their children, here is a complete timeline of John Legend and Chrissy Teigen's relationship.", "image": "https://www.brides.com/thmb/PMNR1dJqoaascbNmwELcifa3CWk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1127327658-0678edc4fda94395b3750c4f6103b68e.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/4.129.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/4.129.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/4.129.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/4.129.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/4.129.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://www.brides.com", "summary": ""}